{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 4,
  "verses": [
    {
      "pk": 18004001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 1,
      "text": "When the people of Israel in Judea heard everything that Holofernes, the commander of the Assyrian army, had done to the nations, and how he had robbed and destroyed their temples,",
      "links": "<a href='/AIV/18/3/8'>Jdt 3:8</a>; <a href='/AIV/23/37/11'>Isa. 37:11</a>",
      "comment": "The context shows the threat not just to life but to the worship of the one true God. The text emphasizes the vulnerability of the Temple and holy places, recalling other moments when Israel faced aggressors who attacked their worship. For a spiritual reading, the preservation of true worship serves as a type for the safeguarding of right doctrine and sacramental practice."
    },
    {
      "pk": 18004002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 2,
      "text": "they were terrified before him, and deeply troubled for Jerusalem and for the Temple of the Lord their God.",
      "links": "<a href='/AIV/19/48/2'>Ps. 48:2</a>; <a href='/AIV/13/21/15'>1 Chr. 21:15</a>",
      "comment": "The people's fear is centered around the Temple, the place of God's unique presence. This centrality of sacred space mirrors the importance of worship and liturgy in the life of faith, hinting at the value of visible, communal marks of belonging to God's people."
    },
    {
      "pk": 18004003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 3,
      "text": "For those who had recently returned from exile, and all the people of Judea, had just gathered together; the sacred vessels and the altar and the Temple had been newly purified from profanation.",
      "links": "<a href='/AIV/15/6/16'>Ezra 6:16</a>; <a href='/AIV/15/2/68'>Ezra 2:68</a>",
      "comment": "The purification of the Temple signals a renewal of Israel's religious life after exile. This scene can be understood both literally—return from exile—and as a spiritual renewal, akin to personal conversion and restoration of God's dwelling among His people through sacramental grace."
    },
    {
      "pk": 18004004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 4,
      "text": "So they sent word into all the region of Samaria, and to Kona, Beth-Horon, Belmain, and Jericho, and to Choba and Aesora, and to the valley of Salem.",
      "links": "<a href='/AIV/06/18/21'>Josh. 18:21</a>; <a href='/AIV/06/16/1'>Josh. 16:1</a>",
      "comment": "This verse details the extending call to collective prayer and defense. The gathering of all tribes and regions highlights the unity of God's people, which is a biblical model for a visible church united across geography and tradition."
    },
    {
      "pk": 18004005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 5,
      "text": "They occupied all the high places and fortified the villages, and stored up provisions for war, since their fields had just been harvested.",
      "links": "<a href='/AIV/07/6/2'>Judg. 6:2</a>; <a href='/AIV/20/21/20'>Prov. 21:20</a>",
      "comment": "Preparation for defense is not merely military, but also spiritual; fortifying the high places recalls earlier practices of safeguarding places chosen by God for worship. This preparation has spiritual significance, as vigilance and readiness for spiritual battle."
    },
    {
      "pk": 18004006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 6,
      "text": "Joakim the high priest, who was in Jerusalem at that time, wrote to the people of Bethulia and Betomesthaim, which is opposite Esdraelon, facing the plain near Dothan,",
      "links": "<a href='/AIV/09/1/1'>1 Samuel 1:1</a>; <a href='/AIV/07/19/12'>Judg. 19:12</a>",
      "comment": "Joakim, as high priest, exercises authority over both civil and spiritual matters. This role echoes ancient biblical offices that combined spiritual leadership with guardianship of God's people, laying foundation for later forms of church governance by high-ranking elders."
    },
    {
      "pk": 18004007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 7,
      "text": "to guard the mountain passes, since access to Judea was by way of them; it was easy to stop any attempt to enter, as the approach was narrow, only wide enough for two men at a time.",
      "links": "<a href='/AIV/07/3/28'>Judg. 3:28</a>; <a href='/AIV/09/13/23'>1 Sam. 13:23</a>",
      "comment": "Physical geography plays into Israel's defense, but the underlying theme is the protection of God's heritage. The narrow passage symbolizes the difficulty of attacking God's people when they are united and steadfast in faith."
    },
    {
      "pk": 18004008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 8,
      "text": "So the Israelites did as Joakim and the council of elders of all Israel commanded.",
      "links": "<a href='/AIV/04/1/16'>Num. 1:16</a>; <a href='/AIV/02/18/25'>Ex. 18:25</a>",
      "comment": "The obedience to both priest and elders signifies the importance of divinely instituted authority and communal decision-making. The text shows harmony between spiritual and lay leadership—a foundational principle for how God's people are governed."
    },
    {
      "pk": 18004009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 9,
      "text": "All the men of Israel cried out with fervor to God, and they humbled themselves deeply before Him.",
      "links": "<a href='/AIV/19/107/6'>Ps. 107:6</a>; <a href='/AIV/10/12/13'>2 Samuel 12:13</a>",
      "comment": "This verse emphasizes collective repentance, vital in times of crisis. Humbling oneself before God is both a literal cry for help and a spiritual sign of conversion necessary for receiving God's mercy."
    },
    {
      "pk": 18004010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 10,
      "text": "Together with their wives and children, and even their livestock, every resident, both foreigner and native, put on sackcloth.",
      "links": "<a href='/AIV/32/3/6'>Jonah 3:6</a>; <a href='/AIV/29/2/16'>Joel 2:16</a>",
      "comment": "The universal penitence—including foreigners—points to the inclusive call to repentance. This anticipates the future universality of God’s covenant, inviting all people into worship and conversion (cf. Acts 10:34-35)."
    },
    {
      "pk": 18004011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 11,
      "text": "With ashes on their heads, they all cried out earnestly to the Lord and prayed for mercy with united hearts,",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/27/9/3'>Dan. 9:3</a>",
      "comment": "Ashes symbolize repentance; prayer in unity highlights the corporate aspect of intercession. Communion in prayer hints at the real power in united, liturgical petitions (Matt. 18:19-20)."
    },
    {
      "pk": 18004012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 12,
      "text": "and Joakim the high priest, with the priests who served before the Lord, clothed themselves in sackcloth and offered the daily burnt offerings, the vows, and the voluntary gifts of the people.",
      "links": "<a href='/AIV/03/6/20'>Lev. 6:20</a>; <a href='/AIV/04/28/3'>Num. 28:3</a>",
      "comment": "Priests intercede for the people through sacrifices and vows, combining penitence with liturgy. This illustrates the enduring principle of priestly mediation and the necessity of sacrificial worship as commanded by God."
    },
    {
      "pk": 18004013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 13,
      "text": "With great devotion, all Israel cried to God so that He would not allow their children to be taken, their wives to be carried away, their cities to be destroyed, and their sanctuary to be profaned.",
      "links": "<a href='/AIV/19/137/7'>Ps. 137:7</a>; <a href='/AIV/13/21/30'>1 Chr. 21:30</a>",
      "comment": "Prayer for protection is focused especially on the sanctuary, which is the earthly sign of God’s covenant presence. This desire for the integrity of the sanctuary connects to the theme of safeguarding true worship and the faith passed down through generations."
    },
    {
      "pk": 18004014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 14,
      "text": "The Lord heard their cries and looked upon their distress. For the people fasted many days throughout all Judea and Jerusalem before the sanctuary of the Lord Almighty.",
      "links": "<a href='/AIV/19/34/15'>Ps. 34:15</a>; <a href='/AIV/23/58/6'>Isa. 58:6</a>",
      "comment": "Fasting before the sanctuary highlights the role of physical acts in spiritual petition—embodied worship, fasting, and prayer are connected. God’s response to fervent united prayer is consistent throughout scripture (cf. 2 Chron. 7:14)."
    },
    {
      "pk": 18004015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 4,
      "verse": 15,
      "text": "So Joakim the high priest and all the priests who stood before the Lord in ministry, and those who served at the altar, wore sackcloth and prayed for the salvation of Israel without ceasing.",
      "links": "<a href='/AIV/03/10/17'>Lev. 10:17</a>; <a href='/AIV/58/7/25'>Heb. 7:25</a>",
      "comment": "The priests' unceasing prayer for Israel foreshadows the perpetual intercession of Christ, our High Priest, and establishes the importance of ministerial priesthood and sacrificial worship. This pattern of ceaseless prayer remains central to spiritual life and the preservation of true faith."
    }
  ],
  "translatedAt": "2025-12-24T05:01:32.336Z"
}