{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 3,
  "verses": [
    {
      "pk": 4303100,
      "translation": "AIV",
      "book": 22,
      "chapter": 3,
      "verse": 1,
      "text": "So they sent messengers from every city and region—from all the coast and countryside—to bring gifts of peace and submission to Holofernes.",
      "links": "<a href='/AIV/22/2/28'>Judith 2:28</a>",
      "comment": "The sending of messengers throughout the land signifies the recognition of Holofernes’ authority. The act of bringing gifts of peace and submission reflects Old Testament patterns of homage to a conqueror, reminiscent of nations submitting to King Solomon (see 1 Kings 10:24–25)."
    },
    {
      "pk": 4303101,
      "translation": "AIV",
      "book": 22,
      "chapter": 3,
      "verse": 2,
      "text": "All the people—Israelites, Edomites, and Moabites, along with those from the coast—bowed down before him, seeking mercy.",
      "links": "<a href='/AIV/19/72/9'>Ps. 72:9</a>; <a href='/AIV/1/27/29'>Genesis 27:29</a>",
      "comment": "This verse lists not only Israel but also neighboring peoples, suggesting the widespread fear and influence of Holofernes. The act of bowing underscores a posture of humility before power, a motif echoed in prophetic literature (see Isaiah 45:23)."
    },
    {
      "pk": 4303102,
      "translation": "AIV",
      "book": 22,
      "chapter": 3,
      "verse": 3,
      "text": "They said, 'Grant us peace; we will serve Nebuchadnezzar, the great king. We will obey you and him.'",
      "links": "<a href='/AIV/27/3/12'>Daniel 3:12</a>",
      "comment": "The plea for peace and willingness to serve Nebuchadnezzar aligns with other instances in biblical history where peoples submitted to earthly rulers, but here it also sets up a spiritual tension between faithfulness to God and worldly compromise (cf. Daniel 3:16–18)."
    },
    {
      "pk": 4303103,
      "translation": "AIV",
      "book": 22,
      "chapter": 3,
      "verse": 4,
      "text": "Our cities and our people are yours; come and do as you please with us.",
      "links": "<a href='/AIV/9/11/1'>1 Samuel 11:1</a>",
      "comment": "Offering up cities and people demonstrates complete surrender, reminiscent of the covenant commitment in the Old Testament—but tragically, here the surrender is not to God but to a pagan king."
    },
    {
      "pk": 4303104,
      "translation": "AIV",
      "book": 22,
      "chapter": 3,
      "verse": 5,
      "text": "So the messengers came to Holofernes and reported all this.",
      "links": "<a href='/AIV/22/2/17'>Judith 2:17</a>",
      "comment": "A straightforward narration continuing the sequence of events, showing the submission reaching its destination. It echoes Old Testament stories where envoys deliver messages of surrender or negotiation (cf. Joshua 9:3–6)."
    },
    {
      "pk": 4303105,
      "translation": "AIV",
      "book": 22,
      "chapter": 3,
      "verse": 6,
      "text": "Then Holofernes went down with his army to the seacoast—he fortified the cities there, took the choicest men as his troops, and established garrisons among them.",
      "links": "<a href='/AIV/22/2/20'>Judith 2:20</a>",
      "comment": "Holofernes’ strategic actions parallel ancient military practice and highlight his systematic domination. His control foreshadows the persistence of external powers over Israel until divine intervention (cf. Judges 3:8–11)."
    },
    {
      "pk": 4303106,
      "translation": "AIV",
      "book": 22,
      "chapter": 3,
      "verse": 7,
      "text": "The cities and people along the coast welcomed him with garlands, dances, and tambourines.",
      "links": "<a href='/AIV/9/18/6'>1 Samuel 18:6</a>; <a href='/AIV/19/149/3'>Psalm 149:3</a>",
      "comment": "The joyful reception—garlands and music—is reminiscent of celebrations for victorious kings (cf. 1 Samuel 18:6). Ironically, this joy precedes impending doom; it contrasts worship celebrations prescribed in Psalms, highlighting the difference between worship of God and honor given to a mortal leader."
    },
    {
      "pk": 4303107,
      "translation": "AIV",
      "book": 22,
      "chapter": 3,
      "verse": 8,
      "text": "But he demolished their shrines, cut down the sacred groves of their gods, and declared to the surrounding peoples that they must worship only Nebuchadnezzar and no other god.",
      "links": "<a href='/AIV/7/6/25'>Judges 6:25</a>; <a href='/AIV/27/3/4-6'>Daniel 3:4–6</a>",
      "comment": "Holofernes’ destruction of shrines and insistence on king-worship mirrors the idolatry condemned in the prophets (cf. Daniel 3). The contrast here contemplates the true worship directed to God alone, anticipating the later New Testament emphasis on exclusive devotion to Christ (see John 14:6)."
    },
    {
      "pk": 4303108,
      "translation": "AIV",
      "book": 22,
      "chapter": 3,
      "verse": 9,
      "text": "The strength of his army and the terror of his fame spread through all the regions.",
      "links": "<a href='/AIV/19/48/4-6'>Psalm 48:4–6</a>",
      "comment": "Reputation of power spreading is a common biblical theme. Compare Psalm 48, where dread overtakes nation’s enemies at the Lord’s might—here, it is an earthly tyrant. The spiritual principle is the supremacy of faith in God’s power over worldly fear."
    },
    {
      "pk": 4303109,
      "translation": "AIV",
      "book": 22,
      "chapter": 3,
      "verse": 10,
      "text": "All those living in the cities and on the coasts were seized with great fear; they honored Holofernes and Nebuchadnezzar as a god.",
      "links": "<a href='/AIV/27/3/6'>Daniel 3:6</a>; <a href='/AIV/23/42/8'>Isaiah 42:8</a>",
      "comment": "This verse reaches the climax: worship of a king as divine. It echoes prophetic warnings about false worship (Isaiah 42:8)—pointing to the necessity of true worship directed only to the one true God. There is an implicit spiritual critique: even when worldly powers seem insurmountable, God alone is worthy of adoration, a theme deepened by later New Testament teaching about worshipping in spirit and truth (John 4:24; see also Christ’s exclusive claim in John 14:6)."
    }
  ],
  "translatedAt": "2025-12-23T09:13:25.904Z"
}