{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 1,
  "verses": [
    {
      "pk": 18001001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 1,
      "text": "In the twelfth year of the reign of Nebuchadnezzar, who ruled the Assyrians in Nineveh the great city—in those days Arphaxad also reigned over the Medes in Ecbatana—",
      "links": "<a href='/AIV/27/1/1-2'>Dan. 1:1-2</a>",
      "comment": "The historical context sets up the narrative during the time of Nebuchadnezzar. Nineveh, once destroyed (Nah. 1:1), is featured here symbolically to contrast earthly power with God's ultimate plan."
    },
    {
      "pk": 18001002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 2,
      "text": "He built massive walls around Ecbatana with hewn stones, each stone three cubits wide and six cubits long. He made the walls seventy cubits high and fifty cubits wide.",
      "links": "<a href='/AIV/16/3/8'>Neh. 3:8</a>",
      "comment": "Arphaxad’s building projects show the emphasis on earthly strength. This contrasts with biblical themes that true security is in God, not in fortifications (Ps. 127:1)."
    },
    {
      "pk": 18001003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 3,
      "text": "He set the towers on its gates one hundred cubits high, and their width was sixty cubits, at the gates he set them up proud of their strength.",
      "links": "<a href='/AIV/11/10/20'>1 Kings 10:20</a>",
      "comment": "This demonstrates earthly pride and the reliance on human achievement. Throughout Scripture, such pride is contrasted with reliance on God (Prov. 16:18)."
    },
    {
      "pk": 18001004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 4,
      "text": "He made its gates strong, with a height of seventy cubits, and their width forty cubits, wide enough for his massive armies, and his foot soldiers to march in military array.",
      "links": "<a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "The gates' grandeur reflects military might, but ultimately in the biblical worldview, victory belongs to the Lord (1 Sam. 17:47)."
    },
    {
      "pk": 18001005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 5,
      "text": "Then Nebuchadnezzar king of Assyria made war on King Arphaxad in the great plain, which is on the border of Ragau.",
      "links": "<a href='/AIV/12/18/34'>2 Kings 18:34</a>",
      "comment": "This introduces the conflict between kingdom powers. In a spiritual sense, earthly wars foreshadow the larger battle between righteousness and evil (Eph. 6:12)."
    },
    {
      "pk": 18001006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 6,
      "text": "Many nations joined him: all who lived in the hill country, and all those who lived along the Euphrates, Tigres, and Hydaspes, and in the plain of Arioch the king of the Elymaeans; many nations assembled for the battle.",
      "links": "<a href='/AIV/01/14/1-2'>Gen. 14:1-2</a>",
      "comment": "The unity of nations against a common enemy reflects themes of coalition seen throughout Scripture, often unified in opposition to God's will (Gen. 11:1-9)."
    },
    {
      "pk": 18001007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 7,
      "text": "But Nebuchadnezzar king of Assyria sent word to all the people of Persia, and to those who lived to the west, and to those who lived in Cilicia and Damascus, Lebanon and Anti-Lebanon, and to all those along the sea coast,",
      "links": "<a href='/AIV/23/10/8-14'>Isa. 10:8-14</a>",
      "comment": "Nebuchadnezzar’s summons signals a call to alliance, attempting universal power. This models how empires broker alliances but, ultimately, all authority is subject to God (Dan. 2:21)."
    },
    {
      "pk": 18001008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 8,
      "text": "And to those among the nations of Carmel and Gilead, the upper Galilee, and the great plain of Esdraelon,",
      "links": "<a href='/AIV/07/1/27-28'>Judg. 1:27-28</a>",
      "comment": "This wide geographic sweep shows the reach of Nebuchadnezzar’s ambition, highlighting the world’s diversity but also its subjection to God’s sovereignty (Ps. 22:28)."
    },
    {
      "pk": 18001009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 9,
      "text": "And to all those in Samaria and its surrounding cities, and beyond Jordan as far as Jerusalem, Batane, Chelous, Kadesh, and the river of Egypt.",
      "links": "<a href='/AIV/06/13/5-6'>Josh. 13:5-6</a>",
      "comment": "The inclusion of Jerusalem region foreshadows the later importance of God’s people in the narrative, recalling God’s covenant promises (Gen. 17:7)."
    },
    {
      "pk": 18001010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 10,
      "text": "But all the inhabitants throughout the whole region ignored the call to join him in war, for they were not afraid of Nebuchadnezzar, but considered him only as a man. They sent his messengers back empty-handed and without honor.",
      "links": "<a href='/AIV/09/8/19'>1 Sam. 8:19</a>; <a href='/AIV/19/2/4'>Ps. 2:4</a>",
      "comment": "Rejecting earthly might demonstrates the limits of human authority. This echoes Psalm 2, where nations ignore God’s anointed but ultimately answer to His reign."
    },
    {
      "pk": 18001011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 11,
      "text": "Then Nebuchadnezzar was greatly angered with all those nations, and swore by his throne and kingdom to take revenge on all the territories of Cilicia, Damascus, and Syria, and to kill everyone in Moab, the lands of the Ammonites, and all Judea, and all those in Egypt as far as the borders of the two seas.",
      "links": "<a href='/AIV/19/83/4'>Ps. 83:4</a>",
      "comment": "Nebuchadnezzar’s oath by his throne is an act of self-deification, common in ancient rulers, but Scripture repeatedly corrects such pride with God’s true kingship (Dan. 4:34-37)."
    },
    {
      "pk": 18001012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 12,
      "text": "In the seventeenth year he marched out with his great army against King Arphaxad, and won the victory in the battle, overthrowing all his forces, the entire army, horses, and chariots.",
      "links": "<a href='/AIV/02/14/28'>Ex. 14:28</a>",
      "comment": "The defeat of Arphaxad’s army echoes themes in Exodus, such as the overthrow of Pharaoh’s chariots, illustrating the impermanence of human might compared to God’s providence."
    },
    {
      "pk": 18001013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 13,
      "text": "He took possession of his cities, came to Ecbatana, captured its towers, plundered its markets, and turned its beauty into shame.",
      "links": "<a href='/AIV/35/2/8'>Hab. 2:8</a>",
      "comment": "The plundering of cities serves as a warning against placing trust in wealth or security outside of God, a theme revisited by Jesus when He teaches about storing treasures in heaven (Matt. 6:19-21)."
    },
    {
      "pk": 18001014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 14,
      "text": "He pursued Arphaxad into the mountains of Ragau, struck him with his spears, and utterly destroyed him that day.",
      "links": "<a href='/AIV/09/17/51'>1 Sam. 17:51</a>",
      "comment": "The total defeat of Arphaxad sets the stage for the display of God’s ability to humble the proud (cf. 1 Sam. 2:7)."
    },
    {
      "pk": 18001015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 15,
      "text": "Then he returned with all his vast forces, and a great multitude of warriors who had joined him. They ate, drank, and celebrated for one hundred and twenty days.",
      "links": "<a href='/AIV/17/1/4'>Esth. 1:4</a>",
      "comment": "The celebration mirrors feasting seen in royal courts, yet is a fleeting joy, in contrast with the everlasting joy God offers to the faithful (Isa. 25:6)."
    },
    {
      "pk": 18001016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 1,
      "verse": 16,
      "text": "On the one hundred and twentieth day, the judgment of the Lord was set against all the nations who had rejected Nebuchadnezzar, and he resolved to utterly destroy all the lands spoken of.",
      "links": "<a href='/AIV/24/25/12-14'>Jer. 25:12-14</a>",
      "comment": "God’s judgment through Nebuchadnezzar reflects the mysterious ways God uses even pagan rulers to accomplish His purposes (Isa. 45:1). This subtly points to God’s providence working through both visible and hidden means, a theme vital in understanding the unity and universality of divine salvation history."
    }
  ],
  "translatedAt": "2025-12-24T05:00:23.165Z"
}