{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 7,
  "verses": [
    {
      "pk": 710701,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 1,
      "text": "The next day, Holofernes commanded all his army and all the people who had joined with him to move against Bethulia, and to seize the passes up into the mountains.",
      "links": "<a href='/AIV/44/6/4'>Judith 6:4</a>; <a href='/AIV/6/10/7'>Josh. 10:7</a>",
      "comment": "The strategy of controlling vital mountain passes is a repeated theme in Israel’s military history (cf. Joshua’s campaigns)."
    },
    {
      "pk": 710702,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 2,
      "text": "So all their fighting men moved on that day, and their forces surrounded Bethulia: the men of Assyria, their footsoldiers and charioteers, camped below the valley near the city.",
      "links": "<a href='/AIV/44/4/7'>Judith 4:7</a>; <a href='/AIV/7/6/1'>Judg. 6:1</a>",
      "comment": "The complete encirclement emphasizes the severity of the siege and the helplessness of the city, echoing other moments of Israelite testing."
    },
    {
      "pk": 710703,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 3,
      "text": "He stationed the remainder of his army, his north wing, east of the city to face the Israelite defenders. The west wing was positioned toward the mountains, encircling the city.",
      "links": "<a href='/AIV/44/4/7'>Judith 4:7</a>",
      "comment": "Strategic positioning by Holofernes foreshadows the overwhelming threat. The detail about troop placements reflects careful military planning."
    },
    {
      "pk": 710704,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 4,
      "text": "Their camp extended for miles and covered the whole plain. The troops were numerous, like locusts or the grains of the earth.",
      "links": "<a href='/AIV/07/06/5'>Judg. 6:5</a>",
      "comment": "The metaphor is borrowed from Judges 6:5, emphasizing human helplessness against immense adversaries, a frequent motif before God’s intervention."
    },
    {
      "pk": 710705,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 5,
      "text": "All the Israelites within Bethulia cried out to the Lord their God, because they saw themselves hemmed in with no way to escape.",
      "links": "<a href='/AIV/44/4/9'>Judith 4:9</a>; <a href='/AIV/19/107/6'>Ps. 107:6</a>",
      "comment": "Israel’s prayer in distress is a central and recurring biblical theme, reminding us of God’s faithfulness to respond to the cry of His people."
    },
    {
      "pk": 710706,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 6,
      "text": "For thirty-four days, all the army of Assyria surrounded the city with their infantry, chariots, and cavalry. They cut off all access to water for those inside.",
      "links": "<a href='/AIV/44/8/27'>Judith 8:27</a>; <a href='/AIV/11/6/4'>1 Kings 6:4</a>",
      "comment": "The cutting-off of water makes the situation dire, drawing out the spiritual significance of thirst and suffering connected to purification and trial."
    },
    {
      "pk": 710707,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 7,
      "text": "They seized the springs and fountains that were outside the city, stationing guards at every source.",
      "links": "<a href='/AIV/44/7/11'>Judith 7:11</a>; <a href='/AIV/44/6/12'>Judith 6:12</a>",
      "comment": "Control of water sources symbolizes control of life itself, and has spiritual resonance with Jesus as the source of living water (cf. John 4:14)."
    },
    {
      "pk": 710708,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 8,
      "text": "The children of Edom and Ammon came and camped in the mountains opposite Dothan, along with certain mercenaries from the east.",
      "links": "<a href='/AIV/44/7/18'>Judith 7:18</a>; <a href='/AIV/01/25/6'>Gen. 25:6</a>",
      "comment": "The coalition of enemies against Israel reflects the repeated pattern of opposition in salvation history, with echoes of Psalm 83:5-8."
    },
    {
      "pk": 710709,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 9,
      "text": "When the Israelites in Bethulia saw themselves surrounded, they cried out, urging every elder to come together for counsel.",
      "links": "<a href='/AIV/44/6/16'>Judith 6:16</a>; <a href='/AIV/02/18/21'>Ex. 18:21</a>",
      "comment": "The gathering of elders is an ancient tradition reflecting the importance of unity and hierarchy among the people of God."
    },
    {
      "pk": 710710,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 10,
      "text": "All the people, young and old, women and children, gathered at the city gate. They raised their voices and begged for mercy from the Lord.",
      "links": "<a href='/AIV/19/130/1'>Ps. 130:1–2</a>; <a href='/AIV/44/4/9'>Judith 4:9</a>",
      "comment": "The communal prayer shows deep solidarity and dependence on God, pointing to the spiritual necessity of perseverance amid adversity."
    },
    {
      "pk": 710711,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 11,
      "text": "Uzziah, son of Micah, and the leaders of the city addressed the people, calming their shouting and saying, “Be patient, brothers, and let us wait five days more. Perhaps the Lord will have mercy and open for us the springs.”",
      "links": "<a href='/AIV/44/8/29'>Judith 8:29</a>; <a href='/AIV/19/130/5'>Ps. 130:5–6</a>",
      "comment": "Uzziah’s words encourage perseverance and trust in divine providence. The five-day wait hints at liturgical patience and the importance of steadfast faith."
    },
    {
      "pk": 710712,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 12,
      "text": "If these days pass with no help, we will do as you say.”",
      "links": "<a href='/AIV/44/8/31'>Judith 8:31</a>",
      "comment": "The conditional trust shows human frailty, contrasting with God’s call to perseverance. Similar themes found in Exodus 14:13-14."
    },
    {
      "pk": 710713,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 13,
      "text": "Then he dismissed the assembly, and everyone returned to their own positions upon the walls and towers of the city.",
      "links": "<a href='/AIV/44/7/31'>Judith 7:31</a>; <a href='/AIV/16/4/13'>Neh. 4:13</a>",
      "comment": "Guarding the city walls is reminiscent of Nehemiah’s rebuilding, symbolizing spiritual vigilance and readiness."
    },
    {
      "pk": 710714,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 14,
      "text": "Women and children inside the city grew desperate, for thirst overwhelmed them and their tongues stuck to the roofs of their mouths.",
      "links": "<a href='/AIV/19/22/15'>Ps. 22:15</a>; <a href='/AIV/04/20/5'>Num. 20:5</a>",
      "comment": "The agony of thirst has messianic echoes in Psalm 22, which is later fulfilled in Christ’s crucifixion (John 19:28)."
    },
    {
      "pk": 710715,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 15,
      "text": "The children collapsed in the streets, and the people were weakened by the lack of water.",
      "links": "<a href='/AIV/19/63/1'>Ps. 63:1</a>; <a href='/AIV/25/4/4'>Lam. 4:4</a>",
      "comment": "Physical suffering reflects spiritual drought and longing for God. See Psalm 63:1 for the yearning for God amid desolation."
    },
    {
      "pk": 710716,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 16,
      "text": "All the people, young and old, gathered again and called out to the city’s nobles and leaders.",
      "links": "<a href='/AIV/02/16/2'>Ex. 16:2–3</a>",
      "comment": "Repeated protests mirror the Israelites’ murmurings in the wilderness. The need for ordered leadership arises."
    },
    {
      "pk": 710717,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 17,
      "text": "They declared, “God has judged between us and you! You have brought this misery upon us by not surrendering to the Assyrians.”",
      "links": "<a href='/AIV/01/31/53'>Gen. 31:53</a>",
      "comment": "The language of divine judgment recalls the appeals to God as Judge throughout Scripture (cf. Gen. 31:53)."
    },
    {
      "pk": 710718,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 18,
      "text": "Now, call them and hand over the city to Holofernes and his army. We would rather become their captives than die of thirst and see our wives and children perish before our eyes.”",
      "links": "<a href='/AIV/44/7/24'>Judith 7:24</a>; <a href='/AIV/44/7/29'>Judith 7:29</a>",
      "comment": "Desperation leads to a willingness to surrender, reminiscent of other moments in Israel’s history when the people considered abandoning God’s path under extreme pressure."
    },
    {
      "pk": 710719,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 19,
      "text": "They cried out loudly before the city’s leaders with bitter tears and pleaded, “The Lord will judge between us and you. You have done us wrong!”",
      "links": "<a href='/AIV/44/7/17'>Judith 7:17</a>",
      "comment": "The invocation of God’s judgment and communal lament highlight the weight of leadership and moral responsibility."
    },
    {
      "pk": 710720,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 20,
      "text": "Uzziah attempted to calm them, saying, “Take courage, brothers! Let us wait five more days. By that time, the Lord God might show mercy and rescue us.”",
      "links": "<a href='/AIV/44/7/11'>Judith 7:11</a>",
      "comment": "The appeal to patience and supernatural rescue emphasizes the virtue of trusting God amid adversity."
    },
    {
      "pk": 710721,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 21,
      "text": "But if these days pass and nothing happens, I will do as you ask.”",
      "links": "<a href='/AIV/44/7/12'>Judith 7:12</a>",
      "comment": "Again, conditional faith shows the tension between trust and human impatience—a recurring biblical theme."
    },
    {
      "pk": 710722,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 22,
      "text": "He dispersed the people, and they returned to their posts on the walls and towers. The women and children went back to their homes, weakened from thirst.",
      "links": "<a href='/AIV/44/7/13'>Judith 7:13</a>",
      "comment": "Order and obedience are restored for a time, despite suffering—foreshadowing that deliverance must come from God."
    },
    {
      "pk": 710723,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 23,
      "text": "Throughout the city, the suffering from thirst was so intense that even small children collapsed in the streets, and the gates could no longer keep them safe.",
      "links": "<a href='/AIV/25/4/4'>Lam. 4:4</a>",
      "comment": "The gates, usually symbols of protection, become ineffective, underscoring vulnerability apart from divine help."
    },
    {
      "pk": 710724,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 24,
      "text": "Their strength failed and their cries rose to heaven.",
      "links": "<a href='/AIV/02/2/23'>Ex. 2:23</a>; <a href='/AIV/19/34/17'>Ps. 34:17</a>",
      "comment": "The motif of cries ascending to heaven points to God’s ready ear toward human suffering."
    },
    {
      "pk": 710725,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 25,
      "text": "Holofernes’ servants came to him and said, “Let us not delay any longer. Let us persuade the Israelites to surrender so they will not die by thirst, and we will gain glory from their defeat.”",
      "links": "<a href='/AIV/44/6/12'>Judith 6:12</a>",
      "comment": "Human plans for glory contrast with divine purposes. God often works greatest wonders when His people are at their weakest."
    },
    {
      "pk": 710726,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 26,
      "text": "Let us approach the city and call down to them, and urge them to surrender before calamity overtakes them and everyone perishes.”",
      "links": "<a href='/AIV/44/7/18'>Judith 7:18</a>",
      "comment": "The rhetoric of mercy thinly veils ambitions for conquest, reminding us that only God’s mercy truly delivers."
    },
    {
      "pk": 710727,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 27,
      "text": "So they called out on the city walls and spoke with Uzziah and the city’s elders with loud voices.",
      "links": "<a href='/AIV/44/7/16'>Judith 7:16</a>",
      "comment": "Dialogue between opposing leaders highlights diplomacy, yet the solution must come from above, not from human compromise."
    },
    {
      "pk": 710728,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 28,
      "text": "They said, “Surrender to Holofernes, and you and your families will be spared. You will become servants of his army, but your lives will be saved.”",
      "links": "<a href='/AIV/44/7/25'>Judith 7:25</a>",
      "comment": "The offer of earthly survival at the cost of freedom mirrors temptations in scripture where trust in God versus compromise is tested."
    },
    {
      "pk": 710729,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 29,
      "text": "Uzziah replied, “We will not surrender today. Let us endure these last days of trial in hope that the Lord will have mercy on us.”",
      "links": "<a href='/AIV/19/27/14'>Ps. 27:14</a>; <a href='/AIV/44/7/10'>Judith 7:10</a>",
      "comment": "Faithfulness to God, even when options seem exhausted, points to the biblical call for perseverance—a virtue important for spiritual growth."
    },
    {
      "pk": 710730,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 30,
      "text": "He turned away the envoys and they returned to their camp. The siege became harsher, and the people in the city were tormented by hunger and thirst.",
      "links": "<a href='/AIV/44/7/6'>Judith 7:6</a>",
      "comment": "The increasing severity of trial sets the stage for divine intervention. Spiritual lessons include the purification that often precedes deliverance."
    },
    {
      "pk": 710731,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 31,
      "text": "Their children and women fainted from thirst in the streets, and the young men collapsed from hunger upon the city walls.",
      "links": "<a href='/AIV/25/4/4'>Lam. 4:4</a>",
      "comment": "Physical suffering prefigures spiritual dryness, reminding believers of the necessity of God’s grace."
    },
    {
      "pk": 710732,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 32,
      "text": "The entire city cried out to God with one voice, in great anguish.",
      "links": "<a href='/AIV/19/34/17'>Ps. 34:17</a>; <a href='/AIV/19/107/6'>Ps. 107:6</a>",
      "comment": "The final verse concludes with communal prayer in affliction—a foreshadowing of the power of united intercession, which can move God to act amazingly through His servant (Judith). Note: The narrative sets up the need for mediation, pointing to high biblical themes later fulfilled in Christ's role as the ultimate Deliverer and the importance of enduring faith through sacrificial suffering."
    }
  ],
  "translatedAt": "2025-12-23T09:15:10.986Z"
}