{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 14,
  "verses": [
    {
      "pk": 3501401,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 1,
      "text": "Then Judith said to them, “Listen to me, my brothers. Take this head and hang it on the parapet of your city wall.",
      "links": "<a href='/AIV/17/13/15'>Judith 13:15</a>; <a href='/AIV/7/7/25'>Judg. 7:25</a>",
      "comment": "Judith instructs the people to make visible the defeat of their enemy, paralleling Old Testament practices of displaying God’s victory (cf. Judg. 7:25)."
    },
    {
      "pk": 3501402,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 2,
      "text": "And as soon as morning comes and the sun rises on the earth, each of you shall take up your weapons. Every able man must leave the city. Set a leader over them, as though you were about to go down to the plain against the Assyrians. But do not go down.",
      "links": "<a href='/AIV/7/7/16-18'>Judg. 7:16–18</a>",
      "comment": "Judith commands strategic obedience, showing her wisdom and authority among the people; a prefiguration of spiritual leadership."
    },
    {
      "pk": 3501403,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 3,
      "text": "Then they will take up their arms and go to their camp to wake their commanders. And when they see the headless body of Holofernes, panic will seize them and they will scatter. Then you pursue them fearlessly, for the Lord will crush them under your feet.",
      "links": "<a href='/AIV/2/15/15'>Ex. 15:15</a>; <a href='/AIV/19/18/37-40'>Ps. 18:37–40</a>",
      "comment": "The defeat comes through God’s intervention, not human might (cf. Ex. 15:15); there is a Christological typology of victory over evil."
    },
    {
      "pk": 3501404,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 4,
      "text": "Then Achior, who had seen all that the God of Israel had done, was brought and shown the head of Holofernes.",
      "links": "<a href='/AIV/17/6/21-22'>Judith 6:21–22</a>",
      "comment": "Achior, a foreigner, witnesses God’s power, emphasizing inclusion by faith—a foreshadowing of Gentile inclusion in salvation history."
    },
    {
      "pk": 3501405,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 5,
      "text": "And when Achior saw it, he fell face down to the ground in worship before Judith, and blessed her, saying, 'May you be blessed in all the tents of Judah and among every nation, because all the nations will tremble when they hear your name.'",
      "links": "<a href='/AIV/1/27/29'>Gen. 27:29</a>; <a href='/AIV/42/1/48'>Luke 1:48</a>",
      "comment": "Achior’s blessing of Judith echoes Old Testament blessings and Mary's Magnificat (Luke 1:48), highlighting the role of a holy woman in bringing salvation."
    },
    {
      "pk": 3501406,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 6,
      "text": "All the people were greatly amazed. They bowed down and worshiped God, calling out with one voice, 'Blessed are you, our God, who have today humiliated our enemies.'",
      "links": "<a href='/AIV/2/15/21'>Ex. 15:21</a>",
      "comment": "The communal blessing reflects the Old Testament song of Moses (Ex. 15:21), celebrating deliverance as a people."
    },
    {
      "pk": 3501407,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 7,
      "text": "Then Uzziah sent for Judith to come out to see the people, and he and all the elders of the city congratulated her.",
      "links": "<a href='/AIV/17/8/10'>Judith 8:10</a>",
      "comment": "Judith is honored by the leaders, recognition of her vital role—a pattern resembling the veneration of great saints in spiritual tradition."
    },
    {
      "pk": 3501408,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 8,
      "text": "And everyone ran together to see her, from the least to the greatest, and they blessed her with one voice, 'You are the glory of Jerusalem! You are the joy of Israel! You are the pride of our people!'",
      "links": "<a href='/AIV/17/15/9'>Judith 15:9</a>; <a href='/AIV/1/49/8'>Gen. 49:8</a>",
      "comment": "The phrases used here are echoed later in praises of Mary (see Judith 15:9; Luke 1:42), typologically connecting Old Testament heroines to the New Testament."
    },
    {
      "pk": 3501409,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 9,
      "text": "Then Judith, with all the people, fell down and worshiped God, and said, 'Bless the Lord, all people, who has this day made my name a subject of praise throughout Israel.'",
      "links": "<a href='/AIV/19/115/1'>Ps. 115:1</a>; <a href='/AIV/42/1/49'>Luke 1:49</a>",
      "comment": "Judith gives glory to God, not herself—a model for humility. The language parallels Mary’s Magnificat, blending the Old with the New Testament."
    },
    {
      "pk": 3501410,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 10,
      "text": "And the people spent the rest of the night in their camp. When morning came, they hung the head of Holofernes on the city wall, and every man of Israel took up his weapons, and together with a great noise, they went out to the slopes toward the plain.",
      "links": "<a href='/AIV/17/13/15'>Judith 13:15</a>",
      "comment": "A fulfillment of Judith’s command; the unity and obedience of the people play a key role in God’s deliverance."
    },
    {
      "pk": 3501411,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 11,
      "text": "When the Assyrians saw them, they sent word to their commanders. They went to the commanders’ tent, but they did not find Holofernes. They were deeply shaken.",
      "links": "<a href='/AIV/7/7/21-22'>Judg. 7:21–22</a>",
      "comment": "Here we see God’s enemies thrown into confusion, as often occurs in Israel’s history (Judg. 7:22), again emphasizing divine agency in salvation."
    },
    {
      "pk": 3501412,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 12,
      "text": "They rushed into his tent but did not find him lying on his bed. So they started shouting and weeping and making a loud noise in their camp.",
      "links": "<a href='/AIV/2/14/25'>Ex. 14:25</a>",
      "comment": "The noise and confusion highlight the sudden reversal brought by God, echoing Exodus themes."
    },
    {
      "pk": 3501413,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 13,
      "text": "Then Bagoas entered, and finding Holofernes dead and his head missing, cried out and tore his clothes in anguish.",
      "links": "<a href='/AIV/17/13/4-9'>Judith 13:4–9</a>",
      "comment": "Bagoas’ lament expresses total defeat. Rending garments is an Old Testament sign of mourning and catastrophe."
    },
    {
      "pk": 3501414,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 14,
      "text": "He rushed out to the tent where Judith had stayed, but did not find her, and he ran to the troops yelling, 'The slaves have deceived us! One Hebrew woman has brought shame upon the house of King Nebuchadnezzar!'",
      "links": "<a href='/AIV/17/11/17'>Judith 11:17</a>",
      "comment": "The humility and faithfulness that brings victory through the hands of a woman challenge expectations and prefigure the humble means by which God brings about salvation."
    },
    {
      "pk": 3501415,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 15,
      "text": "While he was still speaking, the Assyrian commanders heard what had happened. Their courage failed them, and, filled with dread and trembling, they rushed off, giving orders for the soldiers to flee.",
      "links": "<a href='/AIV/7/8/12'>Judg. 8:12</a>",
      "comment": "This recalls many victories in which God brings defeat on Israel’s enemies by confusion and fear (Judg. 8:12)."
    },
    {
      "pk": 3501416,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 16,
      "text": "And when all the officers and leaders of the Assyrian army saw what had happened, they tore their clothes in despair. Then, filled with terror, they left, fleeing in all directions.",
      "links": "<a href='/AIV/2/15/15'>Ex. 15:15</a>",
      "comment": "The total rout demonstrates God’s deliverance. Acts of tearing clothes signal total disaster in the Old Testament."
    },
    {
      "pk": 3501417,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 17,
      "text": "But the Israelites, uniting with one accord, fell upon their fleeing enemies, destroying as many as they could.",
      "links": "<a href='/AIV/17/7/18'>Judith 7:18</a>",
      "comment": "Unified action among God’s people leads to lasting victory—a spiritual reminder of the strength of unity in faith."
    },
    {
      "pk": 3501418,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 18,
      "text": "Meanwhile, the rest of Bethulia plundered the Assyrian camp, gathering much wealth and goods for themselves.",
      "links": "<a href='/AIV/2/12/36'>Ex. 12:36</a>",
      "comment": "As in Exodus, victory yields a transfer of wealth from oppressors to the faithful, a recurring sign of God’s blessing."
    },
    {
      "pk": 3501419,
      "translation": "AIV",
      "book": 17,
      "chapter": 14,
      "verse": 19,
      "text": "And the people, both men and women, rejoiced greatly, praising God with songs of thanksgiving for their deliverance.",
      "links": "<a href='/AIV/2/15/1'>Ex. 15:1</a>; <a href='/AIV/19/98/1'>Ps. 98:1</a>",
      "comment": "Deliverance naturally turns into worship and song, echoing the pattern of Israel’s history (Ex. 15:1), and points forward to the Church’s liturgy of thanksgiving."
    }
  ],
  "translatedAt": "2025-12-23T09:18:08.095Z"
}