{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 1,
  "verses": [
    {
      "pk": 1101001,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 1,
      "text": "In the twelfth year of the reign of Nebuchadnezzar, who ruled over the Assyrians in the great city of Nineveh, in those days, Arphaxad ruled over the Medes in Ecbatana.",
      "links": "<a href='/AIV/27/1/1'>Daniel 1:1</a>",
      "comment": "This introduction dates the events to the reign of Nebuchadnezzar, though historically he was king of Babylon, not Assyria (see Daniel 1:1). The author intends to set the stage for God’s providential work among foreign nations."
    },
    {
      "pk": 1101002,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 2,
      "text": "He built a wall around Ecbatana with hewn stones, three cubits wide and six cubits long, and made the wall seventy cubits high and fifty cubits thick.",
      "links": "",
      "comment": "The precise dimensions emphasize the grandeur and strength of Ecbatana’s fortifications, depicting Arphaxad’s might."
    },
    {
      "pk": 1101003,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 3,
      "text": "He set its towers at its gates one hundred cubits high and its width at sixty cubits, making its gateways rise up to the fortifications.",
      "links": "",
      "comment": "These details reveal the human tendency to trust in worldly strength and grandeur rather than divine protection (see <a href='/AIV/19/127/1'>Psalm 127:1</a>)."
    },
    {
      "pk": 1101004,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 4,
      "text": "He made its gates thirty-five cubits high and twenty cubits wide, so that his powerful army could march out with their ranks and shields and align themselves for battle.",
      "links": "",
      "comment": "A continued emphasis on military preparation, setting up a contrast for how true deliverance comes from God, not armies."
    },
    {
      "pk": 1101005,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 5,
      "text": "At that time, King Nebuchadnezzar waged war against King Arphaxad in the great plain, which is on the border with Ragau.",
      "links": "",
      "comment": "The scene sets the background of a conflict between two of the greatest powers of the region, underscoring the vastness of the players in this narrative."
    },
    {
      "pk": 1101006,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 6,
      "text": "All those who lived in the hill country, and all who dwelt along the Euphrates, the Tigris, and the Hydaspes, and in the plain of Arioch, the king of the Elymeans, took the side of King Arphaxad.",
      "links": "<a href='/AIV/01/2/14'>Genesis 2:14</a>",
      "comment": "Details the alliances against Nebuchadnezzar, with echoes of the gathering of nations in Genesis and later prophetic texts concerning the nations (see Gen 2:14)."
    },
    {
      "pk": 1101007,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 7,
      "text": "Then Nebuchadnezzar, the king of the Assyrians, sent messages to all who lived in Persia, and to all who lived westward over Cilicia, Damascus, Lebanon, and Anti-Lebanon, and to all who lived along the seacoast,",
      "links": "",
      "comment": "The extent of Nebuchadnezzar’s reach is described as a way of showing the vastness of his ambitions, but also setting the stage for the testing of the faithful remnant."
    },
    {
      "pk": 1101008,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 8,
      "text": "And to those in Carmel, Gilead, Upper Galilee, the great plain of Esdraelon,",
      "links": "<a href='/AIV/07/4/6'>Judges 4:6</a>",
      "comment": "These areas are significant biblical regions. This list demonstrates the interconnectedness of the region and hints at the coming deliverance of Israel from oppression (compare Judges 4:6)."
    },
    {
      "pk": 1101009,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 9,
      "text": "And to all in Samaria and its towns, and beyond the Jordan as far as Jerusalem, Batane, Chelous, Kadesh, and the Egyptian river.",
      "links": "<a href='/AIV/06/15/23'>Joshua 15:23</a>",
      "comment": "The narrative’s sweep extends even to Jerusalem, foreshadowing trials for the holy city and opportunities for God’s glory to be revealed."
    },
    {
      "pk": 1101010,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 10,
      "text": "But all the people of those lands ignored the summons of Nebuchadnezzar, king of the Assyrians, and would not join him in battle, for they were not afraid of him, but considered him just a man; so they sent his messengers back with empty hands and with no support.",
      "links": "",
      "comment": "Their rejection of Nebuchadnezzar shows a rejection of earthly power and sets the stage for God’s intervention. Faithfulness often means resisting the world’s demands—even against great odds."
    },
    {
      "pk": 1101011,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 11,
      "text": "Then Nebuchadnezzar grew furious with all these nations, and he swore by his throne and his kingdom that he would take revenge on all the territories of Cilicia, Damascus, and Syria, and would kill with his sword everyone who opposed him.",
      "links": "",
      "comment": "His oath is in the tradition of pagan kings who trust in their own power, a contrast to the trust the faithful are called to have in the true Lord (<a href='/AIV/19/2/4'>Psalm 2:4</a>)."
    },
    {
      "pk": 1101012,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 12,
      "text": "In the seventeenth year of his reign, Nebuchadnezzar went forth to fight with the great army he had assembled, and he conquered Arphaxad in the great plain, the land of Ragau.",
      "links": "",
      "comment": "This battle fulfills Nebuchadnezzar’s wrathful intent and begins a period of persecution and testing for the people, anticipating deliverance by steadfast faith."
    },
    {
      "pk": 1101013,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 13,
      "text": "He struck down all his forces, and destroyed all his chariots and horsemen.",
      "links": "",
      "comment": "The destruction of Arphaxad’s forces prefigures the recurring biblical theme of the downfall of the proud (see <a href='/AIV/19/33/16-17'>Psalm 33:16–17</a>)."
    },
    {
      "pk": 1101014,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 14,
      "text": "Then he occupied his cities, came to Ecbatana, captured its towers, plundered its streets, and turned its glory into shame.",
      "links": "",
      "comment": "Humiliation follows pride; Nebuchadnezzar’s rise over Ecbatana is a warning of the fleeting nature of worldly glory, and subtly the need for a kingdom that cannot be shaken (<a href='/AIV/58/12/28'>Hebrews 12:28</a>)."
    },
    {
      "pk": 1101015,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 15,
      "text": "He captured King Arphaxad in the mountains of Ragau, pierced him with his spears, and utterly destroyed him that day.",
      "links": "",
      "comment": "Nebuchadnezzar’s violence further sets the context for God’s vindication and the eventual deliverance that comes only through His chosen path."
    },
    {
      "pk": 1101016,
      "translation": "AIV",
      "book": 17,
      "chapter": 1,
      "verse": 16,
      "text": "Then he returned with all his vast army, and with the people he had gathered, who had joined from a multitude of nations, and they celebrated and rested in Nineveh, he and his army, for one hundred and twenty days.",
      "links": "<a href='/AIV/32/3/3-5'>Jonah 3:3–5</a>",
      "comment": "The celebration in Nineveh not only recalls the themes of repentance and mercy tied to that city (as in the book of Jonah), but also foreshadows how God works through historical events to humble the proud and exalt the humble. The motif of a period of rest anticipates messianic rest through the promised deliverer."
    }
  ],
  "translatedAt": "2025-12-23T09:12:47.077Z"
}