{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 8,
  "verses": [
    {
      "pk": 108001,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 1,
      "text": "When Judith heard of all this, she fell to her knees and prayed to the Lord.",
      "links": "<a href='/AIV/19/119/25'>Ps. 119:25</a>; <a href='/AIV/16/1/4'>Neh. 1:4</a>",
      "comment": "Judith responds to crisis with prayer, setting the stage for her faith-filled actions. Like Nehemiah and David, her first reaction is to seek God."
    },
    {
      "pk": 108002,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 2,
      "text": "Judith was a widow, living in Bethulia. Her husband, Manasseh, had died during the barley harvest, struck by sunstroke.",
      "links": "<a href='/AIV/44/8/26'>Judith 8:26</a>; <a href='/AIV/44/8/4'>Judith 8:4</a>",
      "comment": "Introduces Judith's background as a widow, similar to figures like Ruth (Ruth 1:3-5), highlighting her vulnerability yet strength."
    },
    {
      "pk": 108003,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 3,
      "text": "He had died in Bethulia and was buried with his ancestors in a field between Dothan and Balamon.",
      "links": "<a href='/AIV/44/8/29'>Judith 8:29</a>",
      "comment": "Provides geographical context, placing Judith in relation to other Israelites."
    },
    {
      "pk": 108004,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 4,
      "text": "Judith had lived as a widow for three years and four months.",
      "links": "<a href='/AIV/44/8/22'>Judith 8:22</a>",
      "comment": "Her prolonged widowhood is reminiscent of Anna in Luke 2:36-37, both models of piety and continual prayer."
    },
    {
      "pk": 108005,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 5,
      "text": "She made a tent on her roof, wore sackcloth around her waist, and fasted every day, except on the Sabbath and the feast days.",
      "links": "<a href='/AIV/19/35/13'>Ps. 35:13</a>; <a href='/AIV/44/8/6'>Judith 8:6</a>",
      "comment": "Judith’s lifestyle shows devoutness and discipline, mirroring OT prophets’ self-denial (see Daniel 9:3; Psalm 35:13). Note the respect for sabbath and feasts, connecting to liturgical practices."
    },
    {
      "pk": 108006,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 6,
      "text": "She was beautiful in appearance and had a wise heart. Her late husband, Manasseh, had left her gold, silver, servants, livestock, and fields, and she managed it all herself.",
      "links": "<a href='/AIV/20/31/10-31'>Prov. 31:10-31</a>",
      "comment": "Judith as an exemplar of virtue and wisdom, similar to the Proverbs 31 woman. Her beauty and integrity foreshadow biblical archetypes fulfilled in figures like Mary."
    },
    {
      "pk": 108007,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 7,
      "text": "No one ever spoke ill of her, for she feared God greatly.",
      "links": "<a href='/AIV/20/31/28-30'>Prov. 31:28-30</a>",
      "comment": "Her reputation rooted in godliness, a recurring biblical motif where reverence for God leads to honor."
    },
    {
      "pk": 108008,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 8,
      "text": "When she heard what the people were upset about—their lack of water and the demands on Uzziah to surrender the city to the Assyrians—",
      "links": "<a href='/AIV/44/7/29-32'>Judith 7:29-32</a>",
      "comment": "Connects directly with the previous chapter’s crisis, underlining the gravity of the situation in Bethulia."
    },
    {
      "pk": 108009,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 9,
      "text": "she sent her female servant to call Uzziah, Chabris, and Charmis, the elders of the city.",
      "links": "<a href='/AIV/44/6/15-16'>Judith 6:15-16</a>",
      "comment": "Judith exercises initiative and authority, a prefiguration of strong female leadership in salvation history."
    },
    {
      "pk": 108010,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 10,
      "text": "When they came to her, she said to them, “Listen to me, leaders of Bethulia. You have spoken rashly today, giving God a deadline for rescuing us.",
      "links": "<a href='/AIV/44/7/30-32'>Judith 7:30-32</a>",
      "comment": "Judith rebukes the elders, highlighting the folly of testing God. Compare with Deuteronomy 6:16 (do not test the Lord)."
    },
    {
      "pk": 108011,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 11,
      "text": "You’ve appointed yourselves as judges over God’s decisions, instead of seeking mercy for our sins before Him.",
      "links": "<a href='/AIV/23/45/9-11'>Isa. 45:9-11</a>; <a href='/AIV/19/51/1-19'>Ps. 51</a>",
      "comment": "Judith contrasts presumption with humble penitence, echoing the themes of Isaiah and the Psalms."
    },
    {
      "pk": 108012,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 12,
      "text": "You remind us of God’s judgments against our ancestors for idolatry, but you forget that we must seek reconciliation through grace and steadfast faith.",
      "links": "<a href='/AIV/03/26/39-42'>Lev. 26:39-42</a>; <a href='/AIV/44/5/17-18'>Judith 5:17-18</a>",
      "comment": "References themes of repentance and forgiveness. Note the subtle encouragement of sacramental reconciliation and the necessity of grace."
    },
    {
      "pk": 108013,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 13,
      "text": "Do not threaten God, demanding that He act within the time you have set. God is patient and merciful; He will not abandon us as long as we seek Him.",
      "links": "<a href='/AIV/19/103/8'>Ps. 103:8</a>; <a href='/AIV/60/5/6'>1 Pet. 5:6</a>",
      "comment": "Judith points to God’s steadfast mercy and patience, essential aspects of biblical theology."
    },
    {
      "pk": 108014,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 14,
      "text": "Let us wait for His salvation and persevere in faith—He will rescue us, even if He tests us first.",
      "links": "<a href='/AIV/18/13/15'>Job 13:15</a>; <a href='/AIV/40/24/13'>Matt. 24:13</a>",
      "comment": "Endurance in suffering as a virtue, mirrored in Job and Jesus’ teaching. The text models redemptive suffering—a key element of spiritual growth."
    },
    {
      "pk": 108015,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 15,
      "text": "He did not punish our ancestors without cause; nor will He abandon us. He teaches us through these trials, but He also leads us back to Himself.",
      "links": "<a href='/AIV/58/12/5-11'>Heb. 12:5-11</a>",
      "comment": "God’s discipline as fatherly correction, reaffirming trust in divine providence (see Hebrews 12:5-11)."
    },
    {
      "pk": 108016,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 16,
      "text": "Do not doubt His promises. Our faith is not in men, but in the Lord, who alone saves.",
      "links": "<a href='/AIV/19/146/3-5'>Ps. 146:3-5</a>; <a href='/AIV/44/8/17'>Judith 8:17</a>",
      "comment": "Centrality of faith in God alone for deliverance—echoes the biblical rejection of trusting in human power."
    },
    {
      "pk": 108017,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 17,
      "text": "He will not turn away forever. Let us plead with Him and trust in His sovereignty.",
      "links": "<a href='/AIV/25/3/31-32'>Lam. 3:31-32</a>",
      "comment": "Judith assures the people of God’s faithfulness. Note lament literature promising restoration."
    },
    {
      "pk": 108018,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 18,
      "text": "Remember, Abraham was tested, and so was Isaac, Jacob, Moses, and all who pleased the Lord.",
      "links": "<a href='/AIV/01/22/1-19'>Gen. 22:1-19</a>; <a href='/AIV/02/3/1-22'>Ex. 3:1-22</a>",
      "comment": "Judith recalls patriarchal testing, implying the necessity of perseverance. Christ himself underwent testing (see Hebrews 4:15)."
    },
    {
      "pk": 108019,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 19,
      "text": "They remained faithful under trial. God never rejected those who trusted Him, even when He tried them with fire.",
      "links": "<a href='/AIV/27/3/16-28'>Dan. 3:16-28</a>; <a href='/AIV/60/1/6-7'>1 Pet. 1:6-7</a>",
      "comment": "Connects the Old Testament motif of testing with spiritual refinement, continued into the New Testament teachings."
    },
    {
      "pk": 108020,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 20,
      "text": "But we must not demand anything from Him; we must pray for mercy and for His will to be done.",
      "links": "<a href='/AIV/40/6/10'>Matt. 6:10</a>; <a href='/AIV/19/123/2'>Ps. 123:2</a>",
      "comment": "Submission to God’s will, aligning with Christ’s prayer in Gethsemane (Matthew 26:39)."
    },
    {
      "pk": 108021,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 21,
      "text": "Therefore, brothers, let us wait for His help. He will rescue us if we do not abandon Him.",
      "links": "<a href='/AIV/66/2/10'>Rev. 2:10</a>; <a href='/AIV/19/27/14'>Ps. 27:14</a>",
      "comment": "Judith encourages perseverance; promise of reward for faithfulness is a theme throughout Scripture."
    },
    {
      "pk": 108022,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 22,
      "text": "We do not have family, tribe, or inheritance outside this land. Surrender would mean destruction for our sanctuary and inheritance.",
      "links": "<a href='/AIV/44/5/21-22'>Judith 5:21-22</a>; <a href='/AIV/03/25/23'>Lev. 25:23</a>",
      "comment": "Emphasizes the unity of the people and the sanctity of the land and sanctuary—prefigures the church’s continuity and stewardship."
    },
    {
      "pk": 108023,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 23,
      "text": "For our sanctuary—the temple, altar, and sacred vessels—would be defiled, and God would punish us.",
      "links": "<a href='/AIV/27/11/31'>Dan. 11:31</a>; <a href='/AIV/26/8/5-6'>Ezek. 8:5-6</a>",
      "comment": "Sacred vessels and temple—Judith underlines the importance of the worship space, foreshadowing the new covenant emphasis on liturgy and sacrament."
    },
    {
      "pk": 108024,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 24,
      "text": "The blood of our brothers, the captivity of our people, and the destruction of our inheritance would be upon us if we do not stand firm.",
      "links": "<a href='/AIV/09/14/30-34'>1 Sam. 14:30-34</a>",
      "comment": "Consequences of cowardice and abandoning divine inheritance—theme echoed in Hebrews 10:39."
    },
    {
      "pk": 108025,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 25,
      "text": "We must not make ourselves responsible for all this. It is better to ask for God’s mercy than to surrender.",
      "links": "<a href='/AIV/44/8/11'>Judith 8:11</a>; <a href='/AIV/44/8/20'>Judith 8:20</a>",
      "comment": "Judith repeats the need for humble penitence, emphasizing confidence in divine mercy."
    },
    {
      "pk": 108026,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 26,
      "text": "Call to mind how our ancestors were rescued in Egypt, at the Red Sea, and in the wilderness—none of those times did they test God, but they trusted and prayed.",
      "links": "<a href='/AIV/02/14/13-31'>Ex. 14:13-31</a>",
      "comment": "Reminds Israel’s history of deliverance—model of trust and prayer for later generations."
    },
    {
      "pk": 108027,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 27,
      "text": "So now let us pray for mercy and await the Lord’s help. He will hear our cry, if it pleases Him.",
      "links": "<a href='/AIV/19/34/17'>Ps. 34:17</a>",
      "comment": "Focuses on prayer for mercy and trust in divine providence. Echoes Psalm themes."
    },
    {
      "pk": 108028,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 28,
      "text": "Then Uzziah said to Judith, 'All you said is true. Nothing you said contradicts our need for faith.'",
      "links": "<a href='/AIV/44/8/29'>Judith 8:29</a>",
      "comment": "Judith’s wisdom is affirmed by the elders, similar to Deborah (Judges 4:4-5)."
    },
    {
      "pk": 108029,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 29,
      "text": "'From the very beginning, your heart has shown wisdom, and your prayer for us is righteous.'",
      "links": "<a href='/AIV/44/8/2'>Judith 8:2</a>",
      "comment": "Echoes the value of intercessory prayer and wisdom in spiritual leadership."
    },
    {
      "pk": 108030,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 30,
      "text": "'But the people are thirsty and suffering. They forced us to make this promise to surrender in five days.'",
      "links": "<a href='/AIV/44/7/32'>Judith 7:32</a>",
      "comment": "Relays the human limits and pressures facing the leaders, highlighting the need for God’s intervention."
    },
    {
      "pk": 108031,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 31,
      "text": "'Now pray for us. You are a God-fearing woman, and God will hear your prayers. We will stay here with you until the Lord sends rain and fills our cisterns.'",
      "links": "<a href='/AIV/44/8/5'>Judith 8:5</a>; <a href='/AIV/44/8/27'>Judith 8:27</a>",
      "comment": "Affirms the efficacy of the prayers of the righteous (see James 5:16)."
    },
    {
      "pk": 108032,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 32,
      "text": "Judith answered, 'Listen to me. Tonight, stand at the gate. I will go out with my servant. Before the time you set expires, the Lord will act to save Israel through me.'",
      "links": "<a href='/AIV/44/13/4-8'>Judith 13:4-8</a>",
      "comment": "Judith’s promise sets the stage for deliverance. Her role as a mediator foreshadows the typology of intercessors in salvation history."
    },
    {
      "pk": 108033,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 33,
      "text": "'Do not ask me what I am going to do. I will not tell you until it is finished.'",
      "links": "<a href='/AIV/44/8/34'>Judith 8:34</a>",
      "comment": "Judith’s secrecy is part of her strategy, trusting in God rather than human plans."
    },
    {
      "pk": 108034,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 34,
      "text": "Uzziah and the elders replied, 'Go in peace. May the Lord God guide your way to bring vengeance on our enemies.'",
      "links": "<a href='/AIV/07/4/23'>Judg. 4:23</a>",
      "comment": "The elders entrust Judith to divine providence; see Judges 4 on Deborah’s decisive leadership."
    },
    {
      "pk": 108035,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 35,
      "text": "They returned to their posts, while Judith went to her house and worshipped God.",
      "links": "<a href='/AIV/44/8/1'>Judith 8:1</a>; <a href='/AIV/44/8/5'>Judith 8:5</a>",
      "comment": "Judith’s consistent pattern of prayer and worship before acting is a model for discernment and faithfulness."
    },
    {
      "pk": 108036,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 36,
      "text": "She called her servant and prepared to fulfill the plan God had placed in her heart.",
      "links": "<a href='/AIV/44/13/1-9'>Judith 13:1-9</a>",
      "comment": "Judith’s obedience and decisive action prepare for her role as God’s instrument for salvation—foreshadowing the importance of both faith and action."
    }
  ],
  "translatedAt": "2025-12-23T09:15:40.834Z"
}