{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 12,
  "verses": [
    {
      "pk": 4001201,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 1,
      "text": "Then Judith was brought into Holofernes' tent, and she waited until he came in. He was greatly impressed by her, and ordered his servants to set a meal before her.",
      "links": "<a href='/AIV/17/10/20'>Judith 10:20</a>",
      "comment": "Judith’s entrance before Holofernes continues her mission. The emphasis on her presence and Holofernes’ admiration for her beauty sets up the unfolding events. Her patience and composure foreshadow her divine mission."
    },
    {
      "pk": 4001202,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 2,
      "text": "But Judith said, ‘I will not eat of it, so that you do not offend your laws. Only the provisions I have brought will I eat.’",
      "links": "<a href='/AIV/17/10/5-6'>Judith 10:5-6</a>; <a href='/ESV/27/1/8'>Dan. 1:8</a>",
      "comment": "Judith’s refusal echoes Daniel’s resolve not to defile himself with foreign food (Daniel 1:8). Her adherence to her faith highlights purity and obedience to God’s law even in foreign courts—a theme seen throughout Scripture."
    },
    {
      "pk": 4001203,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 3,
      "text": "Holofernes asked her, ‘But if your supplies run out, where would we get more food as good as what you have?’",
      "links": "",
      "comment": "Holofernes' question highlights Judith’s separation and the integrity she maintains, not relying on pagan provisions. The concern about her sustenance foreshadows divine providence."
    },
    {
      "pk": 4001204,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 4,
      "text": "Judith answered, ‘As your servant, I will not run out until the Lord accomplishes by my hand what He has purposed.’",
      "links": "<a href='/AIV/17/8/33'>Judith 8:33</a>",
      "comment": "Judith’s faith in divine providence and her mission is evident; she trusts that God will provide until her task is complete. This anticipates themes of unwavering faith found in the Gospels, especially in Mary’s fiat (<a href='/AIV/42/1/38'>Luke 1:38</a>)."
    },
    {
      "pk": 4001205,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 5,
      "text": "Then the servants brought her into the tent and she rested until midnight. She rose at the first watch and sent word to Holofernes, saying, ‘Let my lord command that I may go out to pray.’",
      "links": "<a href='/AIV/17/9/1'>Judith 9:1</a>",
      "comment": "Judith’s dedication to prayer is highlighted repeatedly. Her request to pray, even in enemy territory, is reminiscent of the spiritual discipline seen in figures like Daniel."
    },
    {
      "pk": 4001206,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 6,
      "text": "Holofernes commanded his guards not to prevent her. So Judith remained in the camp three days and went out each night to the valley of Bethulia. She washed herself at the spring as a purification rite.",
      "links": "<a href='/AIV/17/8/6'>Judith 8:6</a>; <a href='/ESV/3/11/45'>Lev. 11:45</a>",
      "comment": "Judith’s ritual purification points to the importance of holiness before God, strongly connecting to themes of sanctification and the necessity of spiritual purity."
    },
    {
      "pk": 4001207,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 7,
      "text": "When she returned, she prayed to the Lord God of Israel to direct her way for the liberation of her people.",
      "links": "<a href='/AIV/17/9/5'>Judith 9:5</a>; <a href='/AIV/02/14/13'>Ex. 14:13</a>",
      "comment": "Judith’s prayer for deliverance echoes Moses’ prayers for Israel’s salvation. Her spiritual leadership is a prefiguration of later mediators in salvation history."
    },
    {
      "pk": 4001208,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 8,
      "text": "On the fourth day, Holofernes gave a banquet for his officials. He invited Judith to the feast.",
      "links": "<a href='/AIV/17/10/22'>Judith 10:22</a>",
      "comment": "The banquet scene sets a dramatic turning point. Judith’s invitation to the inner circle shows her acceptance and foreshadows the reversal brought by God through unlikely means."
    },
    {
      "pk": 4001209,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 9,
      "text": "Bagoas came to Judith and said, ‘Let this pretty captive not hesitate to come to my lord and be honored in his presence, and to drink and be merry with him. You will become great in his heart.’",
      "links": "<a href='/AIV/17/12/14'>Judith 12:14</a>",
      "comment": "Judith’s rise in Holofernes’ favor hints at God’s hand working through her, as seen in Joseph’s and Esther’s stories. The language of ‘great in his heart’ foreshadows the power God grants to His faithful."
    },
    {
      "pk": 4001210,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 10,
      "text": "Judith said, ‘Who am I to refuse my lord? Whatever pleases him, I will do at once. Everything will be to his liking.’",
      "links": "<a href='/AIV/17/11/5'>Judith 11:5</a>",
      "comment": "Judith’s humility and submission here are tactical, mirroring themes of servanthood in Scripture. This act conceals intentionality, which God will use for good."
    },
    {
      "pk": 4001211,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 11,
      "text": "So Judith went and Bagoas brought her into the tent. There she found Holofernes reclining on his bed, surrounded by silver tableware.",
      "links": "<a href='/AIV/17/10/21'>Judith 10:21</a>",
      "comment": "The opulence in Holofernes’ tent sets up a contrast between earthly power and God’s quiet strength working through the humble."
    },
    {
      "pk": 4001212,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 12,
      "text": "Holofernes said to her, ‘Drink and be merry with us!’",
      "links": "<a href='/AIV/17/5/5'>Judith 5:5</a>",
      "comment": "The offer to drink is significant, given Judith’s vows and the discipline of the faithful. Accepting or refusing such invitations often becomes a spiritual test, as seen with Daniel."
    },
    {
      "pk": 4001213,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 13,
      "text": "Judith said, ‘I will gladly drink, my lord, for today is a great day all my life.’",
      "links": "",
      "comment": "Judith’s words are ambiguous—she speaks of celebration, but with deeper meaning. Her feigned compliance is part of God’s plan to overcome evil with cunning and virtue, reminiscent of Christ’s teaching on wise innocence (<a href='/AIV/40/10/16'>Matthew 10:16</a>)."
    },
    {
      "pk": 4001214,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 14,
      "text": "So she took what he gave her to eat, and had some of the food she brought with her.",
      "links": "<a href='/AIV/17/12/2'>Judith 12:2</a>",
      "comment": "Judith’s mixing of her own provisions with Holofernes’ food shows her discernment and carefulness. This balance exhibits prudence and an adherence to her spiritual discipline."
    },
    {
      "pk": 4001215,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 15,
      "text": "Holofernes was captivated by her, and drank much more wine than he had ever done before.",
      "links": "<a href='/AIV/17/13/2'>Judith 13:2</a>; <a href='/AIV/20/20/1'>Prov. 20:1</a>",
      "comment": "Here excessive drinking is shown as a snare—contrasted with Judith’s self-control. The narrative prepares the reader for an imminent downfall of pride and indulgence."
    },
    {
      "pk": 4001216,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 16,
      "text": "When the evening was late, the servants hurried away. Bagoas shut the tent from outside and left Holofernes and Judith alone.",
      "links": "<a href='/AIV/17/13/2'>Judith 13:2</a>",
      "comment": "This intimate setting sets the stage for a pivotal turning point. Such moments of apparent vulnerability often become times of divine intervention and reversal, as seen elsewhere in Scripture."
    },
    {
      "pk": 4001217,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 17,
      "text": "Holofernes was delighted with her and drank far too much wine, more than any other day since he was born.",
      "links": "<a href='/AIV/17/12/15'>Judith 12:15</a>",
      "comment": "The repetition draws attention to Holofernes’ lack of self-mastery, a sharp contrast against Judith’s spiritual discipline. It functions as a warning against excess and serves as a prelude to his defeat."
    },
    {
      "pk": 4001218,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 18,
      "text": "Judith remained dignified, while Holofernes lost his self-control.",
      "links": "",
      "comment": "The contrast between Judith and Holofernes is emblematic; virtue triumphs over vice. Such themes prefigure the ultimate victory of righteousness in the New Testament, as in Christ’s victory over temptation (<a href='/AIV/40/4/1-11'>Matthew 4:1-11</a>)."
    },
    {
      "pk": 4001219,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 19,
      "text": "Judith waited, relying on God’s timing and wisdom.",
      "links": "<a href='/AIV/17/8/17'>Judith 8:17</a>; <a href='/AIV/19/27/14'>Ps. 27:14</a>",
      "comment": "Judith’s patience under pressure points to the virtue of waiting on God, frequently encouraged in the Psalms and in the lives of saints. Her faith in God’s timing is a lesson echoing the trust Christ taught his followers."
    },
    {
      "pk": 4001220,
      "translation": "AIV",
      "book": 17,
      "chapter": 12,
      "verse": 20,
      "text": "So as she waited for the right moment, the Lord watched over Judith, preparing the way for deliverance.",
      "links": "<a href='/AIV/17/13/4'>Judith 13:4</a>; <a href='/AIV/02/14/14'>Ex. 14:14</a>",
      "comment": "The text makes it clear that God is orchestrating events for the good of His people. Judith’s cooperation with divine providence is a lesson in obedience to the will of God, a theme fulfilled perfectly in Christ’s own submission to the Father in Gethsemane (<a href='/AIV/42/22/42'>Luke 22:42</a>)."
    }
  ],
  "translatedAt": "2025-12-23T09:17:21.398Z"
}