{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 12,
  "verses": [
    {
      "pk": 18012001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 1,
      "text": "Then he commanded her to be brought in where the silverware was kept, and ordered that they set a table for her with his own delicacies. But Judith said, she would not eat those.",
      "links": "<a href='/AIV/18/10/5'>Jdt 10:5</a>; <a href='/AIV/18/12/2'>Jdt 12:2</a>",
      "comment": "Judith insists on keeping her own customs and food. This shows her fidelity to the law of her fathers, which points to the importance of tradition in spiritual life (see Daniel 1:8-16)."
    },
    {
      "pk": 18012002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 2,
      "text": "But Judith said, 'I will not eat these things, lest there be an offense, but provisions are given to me by my maid.'",
      "links": "<a href='/AIV/17/4/14'>Est. 4:14</a>; <a href='/AIV/27/1/8'>Dan. 1:8</a>",
      "comment": "Judith's refusal prefigures those who keep themselves set apart for God. The idea of set-apartness reflects later New Testament themes of holiness (cf. 1 Peter 1:16)."
    },
    {
      "pk": 18012003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 3,
      "text": "Holofernes said to her, 'But if your stores run out, where will we get more for you? We have none of your people with us.'",
      "links": "<a href='/AIV/18/13/12'>Jdt 13:12</a>",
      "comment": "The concern over food highlights the theme of hospitality and divine provision, anticipated also in the feeding miracles of Jesus (see Mark 6:41-44)."
    },
    {
      "pk": 18012004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 4,
      "text": "Judith answered, 'As surely as you live, my lord, your servant will not use up her supplies until the Lord accomplishes by my hand what he has determined.'",
      "links": "<a href='/AIV/18/8/33'>Jdt 8:33</a>; <a href='/AIV/07/4/9'>Judg. 4:9</a>",
      "comment": "Judith speaks with faith that God will use her, recalling OT judges like Deborah. Her reliance on God, not on the comforts of the world, foreshadows Mary's fiat (Luke 1:38)."
    },
    {
      "pk": 18012005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 5,
      "text": "So Holofernes' servants brought her to the tent where she stayed until she went out in the middle of the night to pray.",
      "links": "<a href='/AIV/18/9/1'>Jdt 9:1</a>; <a href='/AIV/19/55/17'>Ps. 55:17</a>",
      "comment": "Judith praying at night shows devotion to constant prayer, echoing Daniel's prayer habits. Such prayerful discipline is echoed in New Testament passages (1 Thess. 5:17)."
    },
    {
      "pk": 18012006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 6,
      "text": "Every evening and morning she would go out into the valley of Bethulia and pray to the Lord God of Israel.",
      "links": "<a href='/AIV/19/55/17'>Ps. 55:17</a>; <a href='/AIV/27/6/10'>Dan. 6:10</a>",
      "comment": "Judith's daily prayer rhythm reflects Old Testament piety and anticipates the pattern of morning and evening prayer, connecting to Christian liturgical practices."
    },
    {
      "pk": 18012007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 7,
      "text": "She remained clean, and after her prayer, she returned and stayed pure in the tent until she ate her food at evening.",
      "links": "<a href='/AIV/03/11/44'>Lev. 11:44</a>",
      "comment": "Judith's emphasis on purity and dietary laws is a sign of obedience to God's commands. Purity as a theme foreshadows the New Testament call to holiness (Matthew 5:8)."
    },
    {
      "pk": 18012008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 8,
      "text": "On the fourth day, Holofernes held a banquet for his servants and said to Bagoas, the eunuch who was in charge over all he had, 'Go and persuade the Hebrew woman who is with you to come and eat and drink with us.'",
      "links": "<a href='/AIV/18/5/3'>Jdt 5:3</a>",
      "comment": "The fourth day motif recalls times of testing in Scripture (cf. John 11:39). The invitation signifies the mixing of the sacred with the profane, a common theme in biblical narratives."
    },
    {
      "pk": 18012009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 9,
      "text": "Bagoas went to Judith and said, 'Let this beautiful servant not hesitate to come to my lord, to be honored in his presence, and to drink wine with us, as you did before.'",
      "links": "<a href='/AIV/18/10/23'>Jdt 10:23</a>",
      "comment": "The flattery here is reminiscent of temptations faced by figures like Daniel and Esther in the courts of foreign kings. Judith's steadfastness becomes a model for living in the world but not being of it (John 17:14-16)."
    },
    {
      "pk": 18012010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 10,
      "text": "Judith replied, 'Who am I to refuse my lord? I will do all he wants, and I will gladly eat and drink what pleases him.'",
      "links": "<a href='/AIV/18/11/20'>Jdt 11:20</a>",
      "comment": "Judith speaks diplomatically, masking her true purpose. This recalls Jesus' wisdom in answering hostile opponents (Matthew 22:15-22), and shows prudence as a virtue."
    },
    {
      "pk": 18012011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 11,
      "text": "So Judith got up, and she adorned herself with splendid clothing and all her woman's attire. Her maid went ahead and spread sheep fleece on the ground for her in front of Holofernes.",
      "links": "<a href='/AIV/18/10/3-4'>Jdt 10:3-4</a>",
      "comment": "Judith's adornment recalls Esther's preparation before the king (Esther 5:1). The use of sheep fleece can be seen as symbolizing innocence or sacrifice, themes fulfilled in Christ (John 1:29)."
    },
    {
      "pk": 18012012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 12,
      "text": "Judith came in and lay down, but Holofernes' heart was inflamed with desire for her. He was deeply moved and had been waiting for the time to seduce her ever since the first day he saw her.",
      "links": "<a href='/AIV/18/16/21'>Jdt 16:21</a>; <a href='/AIV/07/16/4-21'>Judg. 16:4-21</a>",
      "comment": "The text reveals the lustful intent of Holofernes, paralleling Delilah and Samson. Judith's virtue triumphs where others have fallen, alluding to Mary's purity amid a corrupt world."
    },
    {
      "pk": 18012013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 13,
      "text": "Holofernes said to her, 'Drink now with us and be joyful with us!'",
      "links": "<a href='/AIV/19/104/15'>Ps. 104:15</a>",
      "comment": "This invitation echoes the recurring biblical motif of banquet invitations, with choices for faithfulness or compromise (Luke 14:15-24)."
    },
    {
      "pk": 18012014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 14,
      "text": "Judith said, 'Yes, my lord, I will gladly eat of what you give me, for from this day on I will honor you all the days of my life.'",
      "links": "<a href='/AIV/18/11/5'>Jdt 11:5</a>",
      "comment": "Judith's response is shrewd and ambiguous. Such wisdom in speech has precedent with Jesus before Pilate (John 18:37), and Daniel before Nebuchadnezzar."
    },
    {
      "pk": 18012015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 15,
      "text": "She got up, put on her festive garments, and all her woman's adornments. Her maid went before her and laid her sheep fleece on the ground for her. Judith came in and lay down.",
      "links": "<a href='/AIV/18/10/3'>Jdt 10:3</a>",
      "comment": "Repetition underscores the importance of Judith's preparation and her purposeful use of beauty. In the spiritual sense, the Church is described as a bride prepared for Christ (Rev. 21:2)."
    },
    {
      "pk": 18012016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 16,
      "text": "Holofernes was overwhelmed with desire for her, and drank more wine than he had ever drunk in his life.",
      "links": "<a href='/AIV/20/23/31-32'>Prov. 23:31-32</a>; <a href='/AIV/18/13/2'>Jdt 13:2</a>",
      "comment": "Wine often symbolizes both blessing and judgment in biblical literature. Here, it is linked with Holofernes' downfall, reminiscent of warnings against drunkenness (Eph. 5:18)."
    },
    {
      "pk": 18012017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 17,
      "text": "When it was late, the servants withdrew, and Bagoas closed the tent from the outside and sent away the guests.",
      "links": "<a href='/AIV/18/13/1'>Jdt 13:1</a>",
      "comment": "The privacy sets the stage for the coming deliverance. Such scenes often prelude an act of God using weak instruments as instruments of deliverance (cf. 1 Cor. 1:27)."
    },
    {
      "pk": 18012018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 18,
      "text": "All went to their beds for they were weary from the long banquet.",
      "links": "<a href='/AIV/18/13/1'>Jdt 13:1</a>",
      "comment": "The weariness of the banqueters further sets Judith in contrast as vigilant and sober, recalling Jesus’ call to spiritual watchfulness (Mark 13:33-37)."
    },
    {
      "pk": 18012019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 19,
      "text": "Judith was left alone in the tent, with Holofernes stretched out, drunk on his bed.",
      "links": "<a href='/AIV/18/13/2'>Jdt 13:2</a>; <a href='/AIV/07/4/21'>Judg. 4:21</a>",
      "comment": "Judith’s courage alone before the enemy mirrors Jael’s bravery, and foreshadows the trust in God demonstrated by Christ before his Passion."
    },
    {
      "pk": 18012020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 12,
      "verse": 20,
      "text": "Now Judith had told her maid to stand outside the bedchamber, and to watch for her coming out just as every day; for she said she would be going out to pray, and would speak with her servant about it afterwards; and she spoke the same words to Bagoas.",
      "links": "<a href='/AIV/18/13/3'>Jdt 13:3</a>; <a href='/AIV/18/9/1'>Jdt 9:1</a>",
      "comment": "Judith’s careful planning shows prudence and reliance on her faith practice. God sometimes works through human preparation as well as supernatural intervention."
    }
  ],
  "translatedAt": "2025-12-24T05:06:03.791Z"
}