{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 9,
  "verses": [
    {
      "pk": 900901,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 1,
      "text": "Then Judith fell facedown, put ashes on her head, and uncovered the sackcloth she was wearing. At the very time when the evening incense was being offered in the house of God in Jerusalem, Judith cried out to the Lord with a loud voice, and said:",
      "links": "<a href='/AIV/03/16/12-14'>Lev. 16:12-14</a>; <a href='/AIV/11/18/36-39'>1 Kgs 18:36-39</a>; <a href='/AIV/19/141/2'>Ps. 141:2</a>",
      "comment": "Judith's posture and the use of ashes and sackcloth signify deep penitence and humility before God (cf. Joel 2:12-13). The timing of her prayer during the incense offering connects her personal plea with the temple worship, implying a unity between individual and communal prayer, anticipating the integration of personal devotion with the worship of God's people."
    },
    {
      "pk": 900902,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 2,
      "text": "\"Lord, God of my ancestor Simeon, who took up his sword and struck down two leaders of the Canaanites in his anger when they tried to defile your people with violence, and exposed their disgrace at the well—\"",
      "links": "<a href='/AIV/01/34/25-26'>Gen. 34:25-26</a>",
      "comment": "Judith addresses God as Lord of her ancestor Simeon, recalling the story in Genesis 34, connecting present deliverance to God's past interventions for Israel. She highlights purity and the defense of the people as central themes."
    },
    {
      "pk": 900903,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 3,
      "text": "\"For you said, ‘It is not right for them to do so,’ and you brought their sin back upon their own heads. You gave their leaders to slaughter, and their bed, which was filled with deceit, to blood and shame, because they tried to violate your covenant.\"",
      "links": "<a href='/AIV/01/34/7-31'>Gen. 34:7-31</a>; <a href='/AIV/02/32/27'>Exod. 32:27</a>",
      "comment": "God’s defense of the covenant and divine justice are highlighted here. God intervenes to judge those who threaten the sanctity of His people, reinforcing the importance of fidelity to God’s covenant."
    },
    {
      "pk": 900904,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 4,
      "text": "\"You helped your people against their oppressors. You delivered the weak into the hands of the strong and the powerless into the hands of those with might, so that those who trusted in you might be exalted.\"",
      "links": "<a href='/AIV/07/07/2-7'>Judg. 7:2-7</a>; <a href='/AIV/19/18/27'>Ps. 18:27</a>; <a href='/AIV/46/1/27-29'>1 Cor. 1:27-29</a>",
      "comment": "The theme of God exalting the humble and delivering His people through unlikely means foreshadows the victory of Christ through seeming weakness (cf. 1 Cor. 1:27-29). God’s method lifts up those who rely on Him alone, revealing His saving power."
    },
    {
      "pk": 900905,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 5,
      "text": "\"O Lord, my God, hear me, a widow. For you have done these things in the past, and what happened before, you have planned for now. All that you desire comes to pass.\"",
      "links": "<a href='/AIV/10/14/14'>2 Sam. 14:14</a>; <a href='/AIV/23/46/10'>Isa. 46:10</a>",
      "comment": "Judith’s prayer expresses faith in divine providence—that God is sovereign over all history. Her humility as a widow echoes God’s care for the lowly and marginalized, anticipating the theme of God’s special favor upon the humble found in Mary's Magnificat (Luke 1:52-53)."
    },
    {
      "pk": 900906,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 6,
      "text": "\"See now the Assyrians gather in their strength to defile your sanctuary, to pollute the tent where your glorious name dwells, and to topple the horn of your altar with iron.\"",
      "links": "<a href='/AIV/02/29/43'>Exod. 29:43</a>; <a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "The sanctuary and altar are presented as precious, set apart for the divine presence. The threat to the temple is a spiritual as well as physical assault, revealing the connection between earthly and heavenly worship (cf. Hebrews 8:5)."
    },
    {
      "pk": 900907,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 7,
      "text": "\"See their pride and anger, and pour your wrath upon their heads. Give me, your servant, a widow, the strength to act as you have promised.\"",
      "links": "<a href='/AIV/19/79/6'>Ps. 79:6</a>; <a href='/AIV/23/37/23-36'>Isa. 37:23-36</a>",
      "comment": "Judith again humbles herself and appeals for divine help, aligning herself as a servant who trusts in God’s promises. Her self-identification as a widow highlights God’s preference for working through the humble and the lowly."
    },
    {
      "pk": 900908,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 8,
      "text": "\"Strike down the enemy by the deceit of my lips; a slave with those in power, a woman with a man, and the weak by the strong. For you are the God of the humble, the helper of the little, the supporter of the weak, the protector of the rejected, the savior of those without hope.\"",
      "links": "<a href='/AIV/07/04/21'>Judg. 4:21</a>; <a href='/AIV/19/10/14'>Ps. 10:14</a>; <a href='/AIV/42/01/52'>Luke 1:52</a>",
      "comment": "Judith’s request to prevail over the enemy by her words (“deceit of my lips”) refers to her strategy of outwitting Holofernes. This points to God's mysterious ways, using what is lowly to confound the strong (cf. 1 Cor. 1:27). This verse anticipates the New Testament theme of God’s preferential care for the humble."
    },
    {
      "pk": 900909,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 9,
      "text": "\"Hear me, O God of my ancestors, and grant victory at this hour; give strength to the resolve of your people, so that all the nations who plan evil against your inheritance may know that you alone are God.\"",
      "links": "<a href='/AIV/02/14/4'>Exod. 14:4</a>; <a href='/AIV/19/83/18'>Ps. 83:18</a>",
      "comment": "Judith’s prayer recognizes Israel as God's special inheritance, recalling God’s covenant with His people. Her emphasis on the nations coming to know the one true God foreshadows the eventual inclusion of all nations into the family of God (see Rom. 11:17-24)."
    },
    {
      "pk": 900910,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 10,
      "text": "\"Let all your nation and every tribe know and understand that you are God, the God of all power and strength, and there is no other who protects the people of Israel—except you alone.\"",
      "links": "<a href='/AIV/05/32/39'>Deut. 32:39</a>; <a href='/AIV/23/45/5-6'>Isa. 45:5-6</a>",
      "comment": "This exclusive claim echoes the Shema (Deut. 6:4) and the monotheistic affirmation found through scripture. It deepens the identity of God as the only true protector and savior, preparing the way for full trust in divine mediation."
    },
    {
      "pk": 900911,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 11,
      "text": "\"See me now, a widow, and look upon my suffering. For I have done only what pleases you and followed your commands.\"",
      "links": "<a href='/AIV/19/25/16'>Ps. 25:16</a>; <a href='/AIV/42/01/38'>Luke 1:38</a>",
      "comment": "Judith’s innocence and devotion parallel Mary's fiat in Luke 1:38. Her suffering and obedience point toward the value of redemptive suffering and faithfulness in God’s plan."
    },
    {
      "pk": 900912,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 12,
      "text": "\"Now make my words and plans successful, to strike down those who rose up against us and against your holy covenant, and cause your whole assembly to praise your name.\"",
      "links": "<a href='/AIV/14/20/6-9'>2 Chr. 20:6-9</a>",
      "comment": "Judith’s appeal to the ‘assembly’ lifts her prayer beyond personal desires, asking for the good of the gathered people of God. This reflects the close relationship between individual and communal worship and salvation."
    },
    {
      "pk": 900913,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 13,
      "text": "\"Let every nation and all people know that you are God, the God of all power and might, and there is no other who protects the people of Israel but you.\"",
      "links": "<a href='/AIV/19/96/5'>Ps. 96:5</a>; <a href='/AIV/05/4/39'>Deut. 4:39</a>",
      "comment": "Here, Judith repeats the confession of God’s uniqueness. This re-emphasis reveals Israel’s mission to bear witness to the nations—a calling fulfilled in the Gospel's universal proclamation (Matt. 28:19)."
    },
    {
      "pk": 900914,
      "translation": "AIV",
      "book": 17,
      "chapter": 9,
      "verse": 14,
      "text": "Then Judith finished all her prayer.",
      "links": "<a href='/AIV/05/26/19'>Deut. 26:19</a>",
      "comment": "Judith’s prayer ends with silent trust. Her prayer, filled with Old Testament themes, points to the role of intercession, feminine courage, and humble faith—important motifs for understanding redemptive history."
    }
  ],
  "translatedAt": "2025-12-23T09:16:04.564Z"
}