{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 11,
  "verses": [
    {
      "pk": 18011001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 1,
      "text": "Then Holofernes said to her, \"Take courage, woman. Do not be afraid in your heart, for I have never harmed anyone who chose to serve Nebuchadnezzar, the king of all the earth.",
      "links": "<a href='/AIV/27/3/4'>Dan 3:4</a>; <a href='/AIV/12/18/25'>2 Kgs 18:25</a>",
      "comment": "Holofernes presents himself as merciful to those who submit, echoing the theme of rulers demanding ultimate loyalty. Nebuchadnezzar's title, 'king of all the earth,' points towards rulers claiming divine authority, which has parallels in later biblical prophecy."
    },
    {
      "pk": 18011002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 2,
      "text": "Now, if your people who live in these mountains had not despised me, I would not have lifted my spear against them. But they did this to themselves.",
      "links": "<a href='/AIV/07/8/34'>Judg 8:34</a>; <a href='/AIV/14/20/23'>2 Chr 20:23</a>",
      "comment": "The assertion that people bring punishment on themselves points to the recurring biblical principle of reaping what one sows (see Gal 6:7). It sets up the narrative contrast between prideful resistance and humble submission."
    },
    {
      "pk": 18011003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 3,
      "text": "But now, tell me for what reason you have fled from them and have come to us. It is clear that you have come for your own safety. Take heart—you will live tonight, and no harm will come to you.",
      "links": "<a href='/AIV/06/2/13'>Josh 2:13</a>; <a href='/AIV/08/3/13'>Ruth 3:13</a>",
      "comment": "Holofernes offers Judith safety, reminiscent of Rahab’s negotiation with the Israelite spies (Josh 2:13). The importance of refuge and safety ties into the biblical theme of God as a protector."
    },
    {
      "pk": 18011004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 4,
      "text": "But tell me the people’s plan, for no one will harm you if you speak truthfully.",
      "links": "<a href='/AIV/06/2/14'>Josh 2:14</a>",
      "comment": "This offer for protection if the truth is given mirrors Old Testament examples of cunning and wise negotiation, echoing the narrative with Rahab."
    },
    {
      "pk": 18011005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 5,
      "text": "Judith replied, \"Accept the words of your servant. Allow your servant to speak to you, and I will tell you nothing false tonight.",
      "links": "<a href='/AIV/01/24/33'>Gen 24:33</a>; <a href='/AIV/18/32/21'>Job 32:21-22</a>",
      "comment": "Judith’s humble approach aligns with biblical examples of wise speech and honest petitioning before authority (cf. Esther and Daniel)."
    },
    {
      "pk": 18011006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 6,
      "text": "If you follow the words of your servant, God will accomplish something through you, and my lord will not fail in any of his purposes.",
      "links": "<a href='/AIV/01/50/20'>Gen 50:20</a>; <a href='/AIV/27/2/21'>Dan 2:21</a>",
      "comment": "Judith’s statement recognizes divine providence working through human instruments, recalling Joseph’s words (Gen 50:20) and Daniel’s prayers (Dan 2:21). Subtly, it highlights how God works His purposes even through the hands of others, emphasizing trust in His sovereign guidance."
    },
    {
      "pk": 18011007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 7,
      "text": "As surely as Nebuchadnezzar lives, who rules over all living things, and as surely as your authority is real under him, you will not fail in what I say.",
      "links": "<a href='/AIV/27/3/9'>Dan 3:9</a>",
      "comment": "Judith cleverly appeals to Holofernes’ sense of power, but ultimately, her loyalty remains with God, whom she never names directly in this moment. The interplay of temporal and divine authority is a key biblical theme."
    },
    {
      "pk": 18011008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 8,
      "text": "For by your hand, the house of Israel will not stand again against the power of my lord,",
      "links": "<a href='/AIV/07/7/3'>Judg 7:3</a>",
      "comment": "Judith speaks with deliberate ambiguity. She prophesies apparent defeat, but is actually setting the stage for a reversal. The motif of seeming defeat followed by deliverance recurs throughout salvation history."
    },
    {
      "pk": 18011009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 9,
      "text": "nor will sword overcome them, unless they sin against their God.",
      "links": "<a href='/AIV/14/15/2'>2 Chr 15:2</a>; <a href='/AIV/05/28/15'>Deut 28:15</a>",
      "comment": "Judith bluntly teaches that sin brings defeat, a firm principle in Deuteronomy 28 and echoed in the prophets. God defends His people unless they break His covenant."
    },
    {
      "pk": 18011010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 10,
      "text": "But now, in order that my lord may not be defeated and God may not forsake them, I will explain their fault and how they have sinned.",
      "links": "<a href='/AIV/07/10/6'>Judg 10:6</a>; <a href='/AIV/02/32/7'>Ex 32:7</a>",
      "comment": "Judith promises to reveal Israel’s sin, mirroring the prophetic role of calling out transgression and acting as an intercessor."
    },
    {
      "pk": 18011011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 11,
      "text": "They are running short of food and water and have determined to eat things which the Law forbids them,",
      "links": "<a href='/AIV/27/1/8'>Dan 1:8</a>; <a href='/AIV/03/11/47'>Lev 11:47</a>",
      "comment": "Reference to the Law’s dietary rules connects to Daniel refusing defiled food (Dan 1:8), emphasizing the holiness present in obedience to sacred law and tradition."
    },
    {
      "pk": 18011012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 12,
      "text": "so they plan to consume their first fruits and tithes of wine and oil, which they have set apart and not touched, because priests who serve in Jerusalem were forbidden even to touch them.",
      "links": "<a href='/AIV/03/2/12'>Lev 2:12</a>; <a href='/AIV/04/18/28-32'>Num 18:28-32</a>",
      "comment": "Observance of sacred offerings is central in the Old Testament (cf. Num 18:28-32). This hints at the purity and mediating role reserved for consecrated ministers, which continues mystically in the tradition of offering."
    },
    {
      "pk": 18011013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 13,
      "text": "But they have sent people to Jerusalem—since they live there as strangers—to bring them permission from the elders.",
      "links": "<a href='/AIV/15/10/8'>Ezra 10:8</a>; <a href='/AIV/16/8/1'>Neh 8:1</a>",
      "comment": "The involvement of elders and Jerusalem as the religious center reflects the unity and authority found within the sacred assembly."
    },
    {
      "pk": 18011014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 14,
      "text": "If they receive no response soon, they will eat these holy things and be destroyed by your hand.",
      "links": "<a href='/AIV/03/22/9'>Lev 22:9</a>",
      "comment": "Eating what is set apart for the sanctuary was seen as a grave offense (Lev 22:9). Maintaining the holiness of offerings is seen as essential for remaining in God's favor—a practice with enduring spiritual meaning."
    },
    {
      "pk": 18011015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 15,
      "text": "That is why I, your servant, knowing all this, have fled from them. God has sent me to perform with you things that will astonish the whole earth, as many as hear about them.",
      "links": "<a href='/AIV/02/9/16'>Exod 9:16</a>;<a href='/AIV/27/6/26-27'>Dan 6:26-27</a>",
      "comment": "God’s wonders are linked to His universal plan of salvation. Miraculous acts are meant to evoke faith across nations, foreshadowing future revelations."
    },
    {
      "pk": 18011016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 16,
      "text": "For your servant is godfearing and serves the God of heaven, and I will stay with you, my lord, but every night your servant will go out into the valley and pray to God. He will tell me when they have committed their sins.",
      "links": "<a href='/AIV/01/20/7'>Gen 20:7</a>; <a href='/AIV/27/6/10'>Dan 6:10</a>",
      "comment": "Judith’s request for time to pray recalls Daniel’s daily prayer (Dan 6:10). Continual prayer is a spiritual discipline taught throughout the scriptures."
    },
    {
      "pk": 18011017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 17,
      "text": "Then I will return and let you know, so you can go out with all your army. Not one of them will be able to resist.",
      "links": "<a href='/AIV/07/4/14'>Judg 4:14</a>",
      "comment": "Judith seeks to be both an instrument and a channel of God’s will. Her intercession has significant power, a pattern found often in biblical mediators."
    },
    {
      "pk": 18011018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 18,
      "text": "I will lead you through the territory of Judea until you reach Jerusalem, and I will set your throne in the midst of it. You will drive them out like sheep that have no shepherd, and not even a dog will bark at you.",
      "links": "<a href='/AIV/04/23/22'>Num 23:22'>Num 23:22</a>; <a href='/AIV/26/34/5'>Ezek 34:5</a>",
      "comment": "The imagery of a people 'without a shepherd' recalls prophetic descriptions of spiritual need (Ezek 34:5; cf. Matt 9:36). Judith speaks prophetically, blending truth and irony, preparing the way for a decisive act."
    },
    {
      "pk": 18011019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 19,
      "text": "All these things have been told to me in advance, and I was sent to declare them to you.",
      "links": "<a href='/AIV/09/3/11'>1 Sam 3:11</a>",
      "comment": "Judith’s claim of revelation marks her as a prophet-like figure. Such authority to declare God’s will is rare and carries deep responsibility."
    },
    {
      "pk": 18011020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 20,
      "text": "Your servant is good-looking, and those who will follow me will not be deceived.",
      "links": "<a href='/AIV/01/39/6'>Gen 39:6</a>; <a href='/AIV/10/14/25'>2 Sam 14:25</a>",
      "comment": "Judith’s beauty is highlighted, as is often the case with biblical heroines. Outward beauty accompanies inner faithfulness, reminiscent of figures like Esther."
    },
    {
      "pk": 18011021,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 21,
      "text": "This night, my lord, everything that I have spoken to you will be completed.",
      "links": "<a href='/AIV/06/21/45'>Josh 21:45</a>",
      "comment": "God’s actions are always fulfilled without fail (Josh 21:45). Judith’s assurance shows unwavering confidence in the Lord's faithfulness."
    },
    {
      "pk": 18011022,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 22,
      "text": "Then Holofernes’ attendants said to him, \"No other woman from one end of the earth to the other looks so beautiful or speaks so wisely.\"",
      "links": "<a href='/AIV/11/10/23-24'>1 Kgs 10:23-24</a>",
      "comment": "This praise echoes the worldwide reputation of Solomon’s wisdom and the Queen of Sheba’s reactions (1 Kgs 10:23-24). Physical beauty and wisdom together are seen as signs of divine favor."
    },
    {
      "pk": 18011023,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 11,
      "verse": 23,
      "text": "Holofernes said to her, \"God has done well to send you ahead of the people, so you may have power in their midst. You are beautiful and wise in your speech. If you do as you have promised, your God will be my God, and you shall live in the palace of King Nebuchadnezzar and be known throughout all the earth.\"",
      "links": "<a href='/AIV/08/1/16'>Ruth 1:16</a>; <a href='/AIV/27/6/26'>Dan 6:26</a>",
      "comment": "Holofernes’ declaration parallels Ruth's words of conversion (Ruth 1:16), foreshadowing the universality and outreach of the faith. The idea of becoming renowned among all peoples points to God's desire for His truth to reach all nations through the holy example of His servants."
    }
  ],
  "translatedAt": "2025-12-24T05:05:36.303Z"
}