{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 4,
  "verses": [
    {
      "pk": 3240101,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 1,
      "text": "When the Israelites living in Judea heard all that Holofernes, the commander of Nebuchadnezzar king of Assyria, had done to the nations, and how he had plundered all their temples and destroyed them,",
      "links": "<a href='/AIV/2/17/14'>Exod. 17:14</a>; <a href='/AIV/9/4/1-2'>1 Sam. 4:1-2</a>",
      "comment": "This verse sets the context by highlighting Holofernes' assaults on surrounding nations and their sanctuaries. The emphasis on the destruction of temples foreshadows the threat to the sanctity of Israel's worship and the need for divine intervention."
    },
    {
      "pk": 3240102,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 2,
      "text": "They were greatly terrified, and they feared greatly for Jerusalem and the temple of the Lord their God—for it had just been returned from captivity, and the people recently gathered together from Babylon, and the sacred vessels, the altar, and the house had been purified after profanation.",
      "links": "<a href='/AIV/15/6/16'>Ezra 6:16</a>; <a href='/AIV/16/12/43'>Neh. 12:43</a>",
      "comment": "This verse reflects a period of restoration following exile, reminiscent of other post-exilic periods. The sacred vessels and altar's purification symbolically foreshadows spiritual purification and the renewal of worship, seen as necessary before God's deliverance."
    },
    {
      "pk": 3240103,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 3,
      "text": "So they sent word to all the districts of Samaria, to Kona, Beth-horon, Belmain, and Jericho; to Choba, Aesora, and the valley of Salem,",
      "links": "<a href='/AIV/6/18/21-28'>Josh. 18:21-28</a>",
      "comment": "A list of cities is named, indicating organized defensive measures. Their unity recalls the importance of the entire community rallying around the worship of God, often prefiguring spiritual unity in the New Covenant."
    },
    {
      "pk": 3240104,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 4,
      "text": "and they occupied all the high places on the mountains and fortified the villages on them, along with stored provisions for war—since recently they had just harvested their fields.",
      "links": "<a href='/AIV/7/6/2'>Judg. 6:2</a>; <a href='/AIV/2/17/9-11'>Exod. 17:9-11</a>",
      "comment": "Physical preparation for battle is both prudent and an act of faithfulness, demonstrating the balance between human effort and trust in divine protection."
    },
    {
      "pk": 3240105,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 5,
      "text": "Joakim, the high priest in Jerusalem at that time, wrote to those living in Bethulia and Betomesthaim, which faces Esdraelon opposite the plain near Dothan,",
      "links": "<a href='/AIV/6/19/18'>Josh. 19:18</a>; <a href='/AIV/1/2/22'>Gen. 37:17</a>",
      "comment": "Joakim’s role as high priest illustrates the spiritual leadership’s responsibility over civil affairs, an image later reflected in the continuing leadership of the priesthood in God’s people."
    },
    {
      "pk": 3240106,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 6,
      "text": "instructing them to seize the mountain passes, since through them the way into Judea could be held easily, and it would be difficult to penetrate except by ascending them.",
      "links": "<a href='/AIV/7/3/27'>Judg. 3:27</a>; <a href='/AIV/6/2/23-24'>Josh. 2:23-24</a>",
      "comment": "Strategic defense aligns with themes seen elsewhere, but the call to actively defend their land is depicted as part of their spiritual duty to protect what is holy."
    },
    {
      "pk": 3240107,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 7,
      "text": "The Israelites did exactly as Joakim, the high priest, and the elders of all the people of Israel, who were in session at Jerusalem, commanded them.",
      "links": "<a href='/AIV/6/1/16-18'>Josh. 1:16-18</a>; <a href='/AIV/2/24/3'>Exod. 24:3</a>",
      "comment": "Obedience to the central high priest and the elders suggests an organized, authoritative leadership guiding the people in times of crisis—anticipating the unified spiritual leadership in later revelation."
    },
    {
      "pk": 3240108,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 8,
      "text": "Every man of Israel cried out fervently to God, and they humbled themselves greatly before Him.",
      "links": "<a href='/AIV/2/34/8'>Exod. 34:8</a>; <a href='/AIV/14/7/14'>2 Chr. 7:14</a>",
      "comment": "Corporate prayer and humility are shown as essential in seeking God's favor, a pattern continued by the church through collective fasting, prayer, and acts of repentance."
    },
    {
      "pk": 3240109,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 9,
      "text": "They, their wives, their children, their livestock, and every sojourner, hired worker, and servant—they all wore sackcloth on their bodies.",
      "links": "<a href='/AIV/32/3/5-8'>Jonah 3:5-8</a>",
      "comment": "A universal act of penance, extended to the entire community, underscores the idea that repentance and intercession are communal responsibilities and spiritually effective."
    },
    {
      "pk": 3240110,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 10,
      "text": "All the people of Israel, men and women, children, those living in Jerusalem, as well as those who had returned, all sat before the temple and poured out ashes on their heads, and spread out sackcloth before the Lord.",
      "links": "<a href='/AIV/16/9/1'>Neh. 9:1</a>; <a href='/AIV/18/42/6'>Job 42:6</a>",
      "comment": "Gathering before the temple illustrates an understanding of sacred space, highlighting both the sacramentality of God’s presence and the importance of visible acts of repentance."
    },
    {
      "pk": 3240111,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 11,
      "text": "They placed sackcloth even on the altar, and with one voice they cried out to the God of Israel, praying not to let their children be carried off, their wives become prey, the inherited cities ruined, and the temple defiled and disgraced for all the nations to gloat over.",
      "links": "<a href='/AIV/19/79/5-7'>Ps. 79:5-7</a>; <a href='/AIV/25/1/10'>Lam. 1:10</a>",
      "comment": "Intercession at the temple altar displays a deep faith in the power of united prayer and the sanctity of the offering place, prefiguring the intercessory role of priests as mediators for the people."
    },
    {
      "pk": 3240112,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 12,
      "text": "The Lord heard their voices and looked upon their distress. The people kept fasting for many days throughout Judea and before the sanctuary of the Lord Almighty.",
      "links": "<a href='/AIV/10/12/16'>2 Sam. 12:16</a>; <a href='/AIV/19/34/15'>Ps. 34:15</a>",
      "comment": "God's attentiveness to their prayers reveals the efficacy of heartfelt, communal acts of penance and fasting—a pattern seen fulfilled in how prayer and fasting remain deep expressions of seeking God."
    },
    {
      "pk": 3240113,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 13,
      "text": "Joakim, the high priest, and all the priests before the Lord, and those who ministered to the Lord—kept their loins girded in sackcloth, and offered daily burnt offerings, vows, and freewill gifts of the people.",
      "links": "<a href='/AIV/3/6/12'>Lev. 6:12</a>; <a href='/AIV/4/28/3'>Num. 28:3</a>",
      "comment": "The priesthood's sacrificial ministry continues during crisis, reinforcing the ongoing necessity and power of priestly mediation and sacrificial worship."
    },
    {
      "pk": 3240114,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 14,
      "text": "With ash on their turbans, they earnestly called upon the Lord to look with favor upon all the house of Israel.",
      "links": "<a href='/AIV/19/132/9'>Ps. 132:9</a>; <a href='/AIV/3/16/6'>Lev. 16:6</a>",
      "comment": "Priestly intercession is again emphasized. The visible sign of ash mirrors attitudes of penitence within worship, which continues in Christian practice, particularly in times of national or communal distress."
    },
    {
      "pk": 3240115,
      "translation": "AIV",
      "book": 17,
      "chapter": 4,
      "verse": 15,
      "text": "At the same time, all the men and women, and all the children living in Jerusalem fell prostrate before the temple and covered their heads with ashes, spreading out their sackcloth before the Lord. Even the altar was surrounded by them, and together they begged for mercy from the God of Israel with one voice, so that their children would not be destroyed and their city not handed over to ruin.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/32/3/8-10'>Jonah 3:8-10</a>",
      "comment": "Communal agony reaches its peak as the people surround the altar and call out in unity. Spiritual and physical unity in prayer is shown to move the heart of God, echoing later teachings that God is especially present and attentive when His people pray with genuine repentance—anticipating the power and necessity of collective worship and prayer in the life of the Church."
    }
  ],
  "translatedAt": "2025-12-23T09:13:50.546Z"
}