{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 13,
  "verses": [
    {
      "pk": 2313001,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 1,
      "text": "When evening came, the servants hurried out. Bagoas closed the tent from the outside, dismissing all who were around their master; they departed for their beds, for they were all tired from drinking.",
      "links": "<a href='/AIV/44/12/19'>Judith 12:19</a>",
      "comment": "This verse sets the stage for Judith's action, underlining the vulnerability and isolation of Holofernes, which is reminiscent of how God uses humble instruments to achieve victory. See <a href='/AIV/7/4/21'>Judges 4:21</a>."
    },
    {
      "pk": 2313002,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 2,
      "text": "Judith was left alone in the tent with Holofernes, who lay stretched out on his bed, drunk to excess.",
      "links": "<a href='/AIV/44/12/20'>Judith 12:20</a>",
      "comment": "Judith's courage appears here; she is isolated but specifically chosen for this moment, reminiscent of the way God calls individuals to fulfill His purpose."
    },
    {
      "pk": 2313003,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 3,
      "text": "She said to herself, 'O Lord, God of all power, look at this moment to the work of my hands so that Jerusalem may be lifted up.'",
      "links": "<a href='/AIV/2/15/32'>Ex. 15:32</a>; <a href='/AIV/19/121/2-3'>Ps. 121:2–3</a>",
      "comment": "Judith’s prayer highlights reliance on divine strength, foreshadowing the Christian understanding that grace empowers us for spiritual battles (see <a href='/AIV/47/12/9-10'>2 Cor. 12:9</a>)."
    },
    {
      "pk": 2313004,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 4,
      "text": "Then she went over to the bedpost near Holofernes’ head and took his sword from its sheath.",
      "links": "<a href='/AIV/7/4/21'>Judges 4:21</a>; <a href='/AIV/9/3/21-22'>1 Sam. 17:51–52</a>",
      "comment": "Judith's act mirrors other deliverers in Israel’s history, notably Jael. The sword parallels the spiritual sword of God's word (<a href='/AIV/58/4/12'>Heb. 4:12</a>)."
    },
    {
      "pk": 2313005,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 5,
      "text": "She approached the bed, grasped the hair of his head, and said, 'Strengthen me, Lord God of Israel, at this moment.'",
      "links": "<a href='/AIV/19/18/32'>Ps. 18:32</a>",
      "comment": "Judith's prayer for divine strength directly before the act displays humble dependence. This foreshadows later saints who act with confidence in God’s power, not their own."
    },
    {
      "pk": 2313006,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 6,
      "text": "With all her might, she struck twice, severing his head.",
      "links": "<a href='/AIV/9/3/31'>1 Sam. 17:51</a>",
      "comment": "Judith's decisive blow echoes David's defeat of Goliath. The motif of victory over evil through unexpected means is a recurring biblical theme."
    },
    {
      "pk": 2313007,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 7,
      "text": "She rolled his body off the bed and removed the canopy from the pillars.",
      "links": "<a href='/AIV/44/13/15'>Judith 13:15</a>",
      "comment": "Judith ensures the deed is public and undeniable. The removal of the canopy symbolizes the stripping away of pagan pride and the defeat of worldly powers."
    },
    {
      "pk": 2313008,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 8,
      "text": "She gave Holofernes’ head to her maid, who placed it in her food bag.",
      "links": "<a href='/AIV/44/13/15'>Judith 13:15</a>",
      "comment": "This act demonstrates practical wisdom and strategy, noteworthy among biblical heroines. The cooperation between Judith and her maid speaks to the importance of fellowship in mission."
    },
    {
      "pk": 2313009,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 9,
      "text": "Then they left together, just as they were accustomed, as if they were going out to pray; they crossed the camp, circling the valley, and went up to Bethulia’s gates.",
      "links": "<a href='/AIV/44/8/5'>Judith 8:5</a>",
      "comment": "Their silent passing shows divine protection and discretion in moments of peril. The disguise reflects the wisdom of the serpent and the innocence of a dove (<a href='/AIV/40/10/16'>Matt. 10:16</a>)."
    },
    {
      "pk": 2313010,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 10,
      "text": "Judith shouted to the sentries at the gate, 'Open the gate! God is with us, and He has shown His strength in Israel.'",
      "links": "<a href='/AIV/44/8/33'>Judith 8:33</a>; <a href='/AIV/2/15/6'>Ex. 15:6</a>",
      "comment": "Judith declares her faith and victory. The phrase 'God is with us' echoes Emmanuel (<a href='/AIV/23/7/14'>Isa. 7:14</a>), prefiguring Christ’s incarnation."
    },
    {
      "pk": 2313011,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 11,
      "text": "When the men of the city heard her voice, they hurried to the city gate and called the elders.",
      "links": "<a href='/AIV/44/8/33'>Judith 8:33</a>",
      "comment": "The calling of elders shows the importance of communal discernment and leadership, a theme echoed in apostolic tradition."
    },
    {
      "pk": 2313012,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 12,
      "text": "Everyone ran together, from the youngest to the oldest, for it seemed incredible that she had returned safely. They opened the gates and welcomed them, kindling fires to light their way.",
      "links": "<a href='/AIV/44/8/33'>Judith 8:33</a>; <a href='/AIV/44/13/16'>Judith 13:16</a>",
      "comment": "Images of light and community evoke the theme of the faithful gathered before God, anticipating liturgical assembly."
    },
    {
      "pk": 2313013,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 13,
      "text": "She told them, 'Stand with me. Praise God with a loud voice!'",
      "links": "<a href='/AIV/19/95/1'>Ps. 95:1</a>",
      "comment": "Judith leads a liturgical act of praise, signifying the role of individuals in calling others to worship with unity and joy."
    },
    {
      "pk": 2313014,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 14,
      "text": "As soon as she spoke, she took the head out of the bag and displayed it to them, saying, 'Here is the head of Holofernes, commander of the Assyrian army.'",
      "links": "<a href='/AIV/44/13/6'>Judith 13:6</a>",
      "comment": "The visual proof of victory echoes Old Testament events, reinforcing faith in God’s intervention and manifest triumph over evil powers."
    },
    {
      "pk": 2313015,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 15,
      "text": "'The Lord struck him down by my hand, as you see.'",
      "links": "<a href='/AIV/7/5/24'>Judges 5:24–27</a>",
      "comment": "Judith gives glory to God, not herself, emphasizing that human participation in God’s plan is by grace and faithfulness."
    },
    {
      "pk": 2313016,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 16,
      "text": "All the people were amazed and bowed down, worshiping God and saying with one voice, 'Blessed are you, O our God, who has this day destroyed the enemies of your people.'",
      "links": "<a href='/AIV/19/72/18'>Ps. 72:18</a>; <a href='/AIV/44/8/25'>Judith 8:25</a>",
      "comment": "Communal worship and blessing recall the tradition of offering praise after deliverance, a pattern embedded in biblical faith and fulfilled in the Church's liturgy."
    },
    {
      "pk": 2313017,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 17,
      "text": "Uzziah said to her, 'May you be blessed, my daughter, by the Most High God beyond all women on earth. And blessed be the Lord God who created the heavens and the earth.'",
      "links": "<a href='/AIV/1/1/1'>Gen. 1:1</a>; <a href='/AIV/42/1/28'>Luke 1:28</a>; <a href='/AIV/42/1/42'>Luke 1:42</a>",
      "comment": "This blessing echoes the words spoken to Mary in the New Testament, hinting at a typology between Judith and Mary's unique role in salvation history."
    },
    {
      "pk": 2313018,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 18,
      "text": "'Who has guided you to cut off the head of the leader of our enemies.'",
      "links": "<a href='/AIV/44/13/6'>Judith 13:6</a>",
      "comment": "This divine guidance exemplifies the role of providence in victory, a theme central to both the personal and communal faith experience."
    },
    {
      "pk": 2313019,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 19,
      "text": "Your trust will not be forgotten forever. People will remember what you did, honoring you throughout all generations.'",
      "links": "<a href='/AIV/19/45/17'>Ps. 45:17</a>; <a href='/AIV/42/1/48'>Luke 1:48</a>",
      "comment": "Like Mary’s Magnificat, Judith’s act becomes a memorial. God raises up those who humble themselves for His purposes, demonstrating lasting fruitfulness and remembrance through faithfulness."
    },
    {
      "pk": 2313020,
      "translation": "AIV",
      "book": 44,
      "chapter": 13,
      "verse": 20,
      "text": "Then all the people praised God, shouting, 'May God bless those who revere Him!' And the people continued to praise Judith for many days.",
      "links": "<a href='/AIV/19/112/1'>Ps. 112:1</a>; <a href='/AIV/42/2/20'>Luke 2:20</a>",
      "comment": "The enduring praise for Judith models the honor given to those who are faithful to God, pointing toward veneration of notable figures in salvation history. The ongoing praise foreshadows the gathering of the saints for eternal worship."
    }
  ],
  "translatedAt": "2025-12-23T09:17:44.925Z"
}