{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 2,
  "verses": [
    {
      "pk": 4402001,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 1,
      "text": "In the eighteenth year, on the twenty-second day of the first month, word was sent in the palace of Nebuchadnezzar, king of Assyria, that he would take revenge on all the earth, as he had spoken.",
      "links": "<a href='/AIV/27/5/29'>Daniel 5:29</a>",
      "comment": "This opening sets the scene in Nebuchadnezzar's court, establishing a grand decree of vengeance. The historical context echoes the practice of ancient kings asserting dominance over nations."
    },
    {
      "pk": 4402002,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 2,
      "text": "He called together all his officials and nobles, set before them his secret counsel, and declared to them his deep plans.",
      "links": "<a href='/AIV/27/2/12'>Daniel 2:12</a>",
      "comment": "Nebuchadnezzar’s secret consultations recall how leaders seek advice from their inner circle, hinting at the power dynamics at play."
    },
    {
      "pk": 4402003,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 3,
      "text": "He said, 'My thoughts dwell on how I may subdue all the regions of Assyria under my control.'",
      "links": "",
      "comment": "The ambition for empire is a recurring biblical theme. Compare with Pharaoh’s ambitions in Exodus (Ex. 1:9-10)."
    },
    {
      "pk": 4402004,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 4,
      "text": "Every voice in the council agreed: none should oppose his decision.",
      "links": "",
      "comment": "Consensus among officials mirrors moments in Scripture when leaders’ decisions shape history—sometimes against God’s people (see Acts 4:27)."
    },
    {
      "pk": 4402005,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 5,
      "text": "Then Nebuchadnezzar, king of Assyria, sent out throughout all the provinces and territories under his rule.",
      "links": "<a href='/AIV/27/6/25'>Daniel 6:25</a>",
      "comment": "Sending decrees by messenger is characteristic of ancient empires, framing the king’s authority as universal."
    },
    {
      "pk": 4402006,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 6,
      "text": "He summoned Holofernes, the chief general of his army, second to himself and greatly honored in the court.",
      "links": "<a href='/AIV/17/1/6'>Judith 1:6</a>",
      "comment": "Holofernes as the king’s chosen agent sets the stage for conflict; similar to other biblical strongmen like Goliath (1 Sam. 17)."
    },
    {
      "pk": 4402007,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 7,
      "text": "He said, 'Thus says the great king, lord of all the earth: Go out from my presence, and take with you men of proven strength, one hundred and twenty thousand foot soldiers and twelve thousand mounted archers.'",
      "links": "",
      "comment": "The immense army described points to the overwhelming force about to be unleashed on the nations. See parallels with Pharaoh’s armies (Ex. 14:7)."
    },
    {
      "pk": 4402008,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 8,
      "text": "'Appoint your officers over the entire army. Prepare the whole region west of Assyria to be ready for battle.'",
      "links": "",
      "comment": "Holofernes is given full military authority, reminiscent of Joseph’s appointment by Pharaoh (Gen. 41:40-41)."
    },
    {
      "pk": 4402009,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 9,
      "text": "'Tell all the peoples to yield to Nebuchadnezzar. Those who refuse shall pay with death and plunder.'",
      "links": "<a href='/AIV/17/2/22'>Judith 2:22</a>",
      "comment": "The king’s demand for submission through threat or violence is a recurring motif—compare with Daniel 3:6."
    },
    {
      "pk": 4402010,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 10,
      "text": "'Go through every land—Cilicia, Damascus, Syria, and into the territory of Israel, until you reach the western sea.'",
      "links": "<a href='/AIV/11/9/17'>1 Kings 9:17</a>",
      "comment": "The geographic sweep stresses the vast extent of the campaign. For the Israelites, this threat foreshadows later invasions."
    },
    {
      "pk": 4402011,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 11,
      "text": "'If they surrender, you shall spare them, but if they resist, do not leave a single soul alive.'",
      "links": "",
      "comment": "The king’s terms are absolute, highlighting the deadly seriousness of his campaign, which sets up God’s deliverance of Israel."
    },
    {
      "pk": 4402012,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 12,
      "text": "Holofernes assembled his officers and all the distinguished men of Assyria.",
      "links": "",
      "comment": "The organizational aspect is similar to how armies are mustered in Numbers 1:3 and Joshua 4:12."
    },
    {
      "pk": 4402013,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 13,
      "text": "He mobilized one hundred and twenty thousand fighting men and twelve thousand cavalry, as the king had commanded.",
      "links": "",
      "comment": "The repetition of army numbers stresses the kingdom’s power. Militaristic themes in the OT often set the scene for God’s intervention."
    },
    {
      "pk": 4402014,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 14,
      "text": "Holofernes organized the supply wagons, camels, and horses for transportation, and gathered vast quantities of food for the army and support troops.",
      "links": "",
      "comment": "Provisioning details remind us of the logistics undertaken in the exodus (Ex. 12:38)."
    },
    {
      "pk": 4402015,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 15,
      "text": "He commanded additional men from his own land and from the territories under his rule to join the campaign, numbering many more than originally listed.",
      "links": "",
      "comment": "The expansion of forces recalls how God sometimes allows overwhelming odds against Israel to show His saving power (Judg. 7:2)."
    },
    {
      "pk": 4402016,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 16,
      "text": "A great multitude from all over the earth joined the expedition, their numbers like locusts or the sand on the seashore.",
      "links": "<a href='/AIV/06/11/4'>Joshua 11:4</a>; <a href='/AIV/01/22/17'>Genesis 22:17</a>",
      "comment": "The imagery of countless numbers recalls God’s promise to Abraham (Gen. 22:17) and Old Testament descriptions of enemy forces."
    },
    {
      "pk": 4402017,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 17,
      "text": "Holofernes and his army set out, advancing toward the western region with all their chariots, horsemen, and foot soldiers.",
      "links": "",
      "comment": "The motion westward puts Israel in direct peril. This mirrors the book of Exodus, where God protects His people from advancing forces."
    },
    {
      "pk": 4402018,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 18,
      "text": "Like a storm, they swept through the plains, ravaged the land, and destroyed all they encountered.",
      "links": "",
      "comment": "Destructive force is a recurring description of invaders in Scripture, which is often ultimately defeated by God’s intervention."
    },
    {
      "pk": 4402019,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 19,
      "text": "He destroyed Put and Lud, pillaged all the Rassisites and Ishmaelites by the edge of the desert to the south of Chelon.",
      "links": "<a href='/AIV/01/10/6'>Genesis 10:6</a>; <a href='/AIV/01/25/13'>Genesis 25:13</a>",
      "comment": "The mention of Put, Lud, and the Ishmaelites ties back to Genesis, highlighting ancient tribal hostilities."
    },
    {
      "pk": 4402020,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 20,
      "text": "He crossed the Euphrates, and advanced through Mesopotamia, tearing down every fortified city within reach.",
      "links": "<a href='/AIV/01/2/14'>Genesis 2:14</a>",
      "comment": "The destruction of cities is reminiscent of Joshua’s conquests (Josh. 6:20), but here it’s the enemies of God’s people doing the conquering."
    },
    {
      "pk": 4402021,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 21,
      "text": "He moved onward to the borders of Cilicia, cut down everyone who resisted, and continued to the southern borders of Japheth, facing Arabia.",
      "links": "",
      "comment": "Border regions named are ancient lands; the reference echoes the universality of God’s kingdom stretching over every border (Isaiah 2:2)."
    },
    {
      "pk": 4402022,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 22,
      "text": "He encamped near the frontiers of Damascus during the harvest season, devastated all the fields, and took many flocks and herds by force.",
      "links": "<a href='/AIV/23/17/1'>Isaiah 17:1</a>",
      "comment": "The destruction of harvest recalls the famines that often followed war; also see similar events in Joel 1:4."
    },
    {
      "pk": 4402023,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 23,
      "text": "He burned down cities, leveled the fields, and wiped out every young man by the sword.",
      "links": "",
      "comment": "The completeness of devastation accentuates the threat to God’s people, setting the tension for divine rescue."
    },
    {
      "pk": 4402024,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 24,
      "text": "Fear and dread of him fell upon all the inhabitants of the western lands; entire cities and villages surrendered peacefully.",
      "links": "<a href='/AIV/06/2/9-11'>Joshua 2:9-11</a>",
      "comment": "As with Rahab’s fear in Joshua 2, the reputation of Holofernes precedes his arrival, emphasizing the scale of the threat."
    },
    {
      "pk": 4402025,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 25,
      "text": "They sent messengers to Holofernes, offering peace, saying, ‘We are your servants; do not destroy us.’",
      "links": "",
      "comment": "Contrast with Joshua 9, where the Gibeonites seek peace with Israel out of fear; surrender is sometimes seen as prudence in overwhelming circumstances."
    },
    {
      "pk": 4402026,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 26,
      "text": "Holofernes accepted their surrender and stationed garrisons in their cities. Their men were chosen as auxiliaries for his army.",
      "links": "",
      "comment": "Subjugation and use of conquered peoples in the victor’s armies is classic ancient practice (compare 2 Kings 24:16)."
    },
    {
      "pk": 4402027,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 27,
      "text": "After these conquests, Holofernes with his entire force advanced toward the region of Esdraelon, near the mountains that border Judah.",
      "links": "",
      "comment": "Esdraelon (Jezreel Valley) was a significant site of many ancient conflicts. This progression foreshadows the coming confrontation with Israel."
    },
    {
      "pk": 4402028,
      "translation": "AIV",
      "book": 17,
      "chapter": 2,
      "verse": 28,
      "text": "He camped between Geba and Scythopolis, where he remained for thirty days, gathering all the supplies his army needed.",
      "links": "",
      "comment": "The pause at Geba and Scythopolis sets up the narrative for what follows—a time of preparation that reflects strategic patience. In spiritual terms, periods of waiting often precede God’s interventions, as with Israel at the Red Sea (Ex. 14:10-14)."
    }
  ],
  "translatedAt": "2025-12-23T09:13:11.856Z"
}