{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 10,
  "verses": [
    {
      "pk": 5001001,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 1,
      "text": "When Judith had finished praying to the Lord, she arose from the floor, called her maid, and went down into the house, where she spent the Sabbath, and after the day of fasting.",
      "links": "<a href='/AIV/17/9/14'>Judith 9:14</a>; <a href='/AIV/3/16/31'>Lev. 16:31</a>",
      "comment": "Judith rises from prayer, connecting her actions to liturgical rhythm and fasting, which later Christians saw as prefiguring Christian practice (see Matt. 6:16-18)."
    },
    {
      "pk": 5001002,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 2,
      "text": "She took off the sackcloth she had been wearing, removed her widow's garments, washed herself, anointed herself with expensive ointment, arranged her hair, and put on the rich clothes she used to wear when her husband Manasseh was alive.",
      "links": "<a href='/AIV/17/8/5'>Judith 8:5</a>; <a href='/AIV/2/2/11'>Exodus 2:11</a>",
      "comment": "Changing garments and anointing mirrors Israelite purification and preparation for sacred purposes (cf. Ruth 3:3; Esther 5:1)."
    },
    {
      "pk": 5001003,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 3,
      "text": "She put on sandals for her feet, wore her bracelets, rings, earrings, and all her jewelry, and made herself very beautiful to look upon, so she would charm the eyes of all men who might see her.",
      "links": "<a href='/AIV/17/16/7'>Judith 16:7</a>; <a href='/AIV/17/8/7'>Judith 8:7</a>",
      "comment": "Judith's beauty is highlighted as a gift God uses for His purposes (cf. Esther 2:17)."
    },
    {
      "pk": 5001004,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 4,
      "text": "She gave her maid a skin of wine and a flask of oil, filled a bag with roasted grain, dried fig cakes, and fine bread, and wrapped all her possessions together, handing them to her servant.",
      "links": "<a href='/AIV/17/12/1'>Judith 12:1</a>",
      "comment": "Judith prepares food according to her customs, keeping her faith even among foreigners, reflecting Israelite dietary practices (see Daniel 1:8).\n"
    },
    {
      "pk": 5001005,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 5,
      "text": "Then they left the city at night and went down to the valley. The watchmen at the city gate opened the gate for them. They went out, and passed through the valley, watched by all the men of Bethulia until they had gone down the mountain slope and crossed the valley, until they could no longer be seen.",
      "links": "<a href='/AIV/17/7/19'>Judith 7:19</a>",
      "comment": "Departing at night highlights courage and trust in God."
    },
    {
      "pk": 5001006,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 6,
      "text": "As they were walking straight through the valley, an Assyrian patrol met them and arrested them. They asked her, 'Who are you? Where are you coming from, and where are you going?'",
      "links": "<a href='/AIV/17/3/2'>Judith 3:2</a>",
      "comment": "Encounter with foreign soldiers intensifies the narrative tension; Judith responds with wisdom (see Prov. 31:26)."
    },
    {
      "pk": 5001007,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 7,
      "text": "She answered, 'I am a Hebrew woman, fleeing from them, for they will be handed over to you to be destroyed.",
      "links": "<a href='/AIV/17/6/2'>Judith 6:2</a>",
      "comment": "Judith’s answer is shrewd yet vague, introducing a pivotal moment that aligns with God’s providence."
    },
    {
      "pk": 5001008,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 8,
      "text": "I am on my way to see the great commander Holofernes, to give him trustworthy information. I will show him a way by which he can conquer all the hill country without losing a single man from his ranks.'",
      "links": "<a href='/AIV/17/11/5'>Judith 11:5-6</a>",
      "comment": "Her clever offer recalls other instances where God’s chosen intervene in unexpected ways (cf. Rahab in Joshua 2:4)."
    },
    {
      "pk": 5001009,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 9,
      "text": "When her words pleased them, they admired her beauty, and said to her, 'You have saved your life by hurrying to our lord. Go to his tent, and some of us will escort you until we hand you over to him.'",
      "links": "<a href='/AIV/17/10/14'>Judith 10:14</a>",
      "comment": "God uses even human admiration and intentions for His larger plan, redeeming even worldly motives."
    },
    {
      "pk": 5001010,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 10,
      "text": "When they had chosen a hundred men from among them to escort her and her maid, they brought them to Holofernes' camp.",
      "links": "<a href='/AIV/17/11/14'>Judith 11:14</a>",
      "comment": "The number and military escort show the seriousness and attention Judith’s mission commands."
    },
    {
      "pk": 5001011,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 11,
      "text": "There was a great commotion throughout the whole camp as the news spread. The tents were empty, for the crowd had gathered around Judith, as she stood waiting for Holofernes to come out and meet her.",
      "links": "<a href='/AIV/17/14/5'>Judith 14:5</a>",
      "comment": "Judith immediately draws massive attention, symbolizing the powerful role of the faithful and courageous individual."
    },
    {
      "pk": 5001012,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 12,
      "text": "Those of Holofernes' camp and all who were gathered from the seacoast and Moab said, 'Who is this woman who dares to come through the camp at night, alone, and into the presence of the commander?'",
      "links": "<a href='/AIV/17/8/29'>Judith 8:29</a>",
      "comment": "Her bravery and distinction echoes unique roles given to faithful women in salvation history (see Deborah in Judges 4-5)."
    },
    {
      "pk": 5001013,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 13,
      "text": "They brought her, from the middle of the camp, before Holofernes, with an escort of men. Both his tent and all his household stood about him in wonder at what they saw.",
      "links": "<a href='/AIV/17/12/14'>Judith 12:14</a>",
      "comment": "Judith is welcomed with awe, prefiguring themes of those whom God sends finding favor (see Genesis 41:39-41)."
    },
    {
      "pk": 5001014,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 14,
      "text": "Judith stood in Holofernes' presence, while all began to marvel at the beauty of her face. She bowed her face to the ground in respect before him, but the servants lifted her up.",
      "links": "<a href='/AIV/17/14/7'>Judith 14:7</a>; <a href='/AIV/17/12/15'>Judith 12:15</a>",
      "comment": "Her humility and reverence prefigure the humility seen in holy women in the New Testament (cf. Luke 1:38; 1 Peter 3:4-5)."
    },
    {
      "pk": 5001015,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 15,
      "text": "Then Holofernes said to her, 'Take courage, woman! Do not be afraid in your heart, for I have never done harm to anyone who has chosen to serve Nebuchadnezzar, king of all the earth.",
      "links": "<a href='/AIV/17/2/15'>Judith 2:15</a>",
      "comment": "Holofernes’ words echo false reassurance from worldly rulers, contrasting with the authentic security found in trusting God."
    },
    {
      "pk": 5001016,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 16,
      "text": "The same shall be true for your nation. If your people had not defied me, I would never have lifted my spear against them. But now tell me why you fled from them and came to us. What purpose do you have in coming here?'",
      "links": "<a href='/AIV/17/5/22'>Judith 5:22</a>",
      "comment": "Holofernes’ attempt at diplomacy cannot replace divine justice; the worldly ruler is limited, while God’s plan prevails."
    },
    {
      "pk": 5001017,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 17,
      "text": "Judith replied, 'Please listen to the words of your servant. If you allow your handmaid to speak with you tonight, I will explain to you what happened among the people, and tell you how you can prevail without losing a man.'",
      "links": "<a href='/AIV/17/11/5'>Judith 11:5</a>",
      "comment": "Judith’s speech, with humility and respectful address, elicits favor and embodies the wise response. (cf. Esther before the king in Esther 7:3-4)."
    },
    {
      "pk": 5001018,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 18,
      "text": "Holofernes and all his attendants greatly admired her wisdom, and said, 'No other woman from one end of the earth to the other is as beautiful in appearance or as wise in speech.'",
      "links": "<a href='/AIV/17/11/21'>Judith 11:21</a>",
      "comment": "Her combination of external and internal excellence mirrors the fullness of virtue portrayed in Proverbs 31:10-31 and admired in the tradition of holy women."
    },
    {
      "pk": 5001019,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 19,
      "text": "Then Holofernes said to her, 'God has done well to send you ahead of your people to give them into my hands, and those who have scorned my lord will not survive.",
      "links": "<a href='/AIV/17/11/23'>Judith 11:23</a>",
      "comment": "He unwittingly recognizes God's guidance, not knowing Judith’s real mission. There is true irony here, as God’s instrument comes in humility and apparent weakness (cf. 1 Cor. 1:27-29)."
    },
    {
      "pk": 5001020,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 20,
      "text": "Now you are as beautiful as you are wise. If you do as you have promised, your God shall be my God, and you shall live in the house of King Nebuchadnezzar and be famous throughout the earth.'",
      "links": "<a href='/AIV/17/11/23'>Judith 11:23</a>; <a href='/AIV/8/1/16'>1 Kings 10:24</a>",
      "comment": "Holofernes’ flattery is self-serving, but the statement 'your God shall be my God' recalls Ruth 1:16, prefiguring wider covenant inclusion as seen in the new covenant (Romans 11:17)."
    },
    {
      "pk": 5001021,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 21,
      "text": "Then he ordered his servants to bring her into his tent and prepare a meal for her from his own food and wine.",
      "links": "<a href='/AIV/17/12/1'>Judith 12:1</a>",
      "comment": "Being invited to the kingly feast foreshadows Eucharistic images, echoing Purity of the chosen in the midst of foreigners (Daniel 1:8)."
    },
    {
      "pk": 5001022,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 22,
      "text": "But Judith said, 'I will not eat it, lest it be a stumbling block to me. Instead, I have brought food for myself that your servant may eat.'",
      "links": "<a href='/AIV/17/12/2'>Judith 12:2</a>; <a href='/AIV/27/1/8'>Daniel 1:8</a>",
      "comment": "Judith’s abstention points to faithfulness under trial and clarifies the importance of remaining set apart, which prefigures Christian practices of penance and spiritual discipline."
    },
    {
      "pk": 5001023,
      "translation": "AIV",
      "book": 17,
      "chapter": 10,
      "verse": 23,
      "text": "Holofernes said to her, 'If what you have planned turns out well, you and your maid will be blessed in my house. The hearts of all the people in the land will thank you.'",
      "links": "<a href='/AIV/17/13/18'>Judith 13:18</a>",
      "comment": "This blessing is ironic, as Judith’s work will result in her people's deliverance, ultimately highlighting God's providential design in the defeat of the enemy."
    }
  ],
  "translatedAt": "2025-12-23T09:16:39.722Z"
}