{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 11,
  "verses": [
    {
      "pk": 2801111,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 1,
      "text": "Then Holofernes said to Judith, \"Be at ease, woman, and do not fear in your heart, for I have never hurt anyone who chose to serve Nebuchadnezzar, the king of all the earth.",
      "links": "<a href='/AIV/17/10/19-20'>Judith 10:19-20</a>; <a href='/AIV/27/3/2'>Daniel 3:2</a>",
      "comment": "Holofernes assures Judith he is merciful to those who show loyalty to his king, echoing a recurring theme in the book of Daniel, where Gentile rulers expect devotion (Daniel 3:2)."
    },
    {
      "pk": 2801112,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 2,
      "text": "If your people had not despised me, I would have never lifted my spear against them.",
      "links": "<a href='/AIV/17/7/29'>Judith 7:29</a>",
      "comment": "Holofernes places responsibility for the conflict on the choices of the Israelites, similar to earlier OT passages emphasizing the consequences of rejecting God's agents."
    },
    {
      "pk": 2801113,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 3,
      "text": "But now tell me why you have fled from them and come to us. It would have been better for you to be saved by them than to be destroyed by us.",
      "links": "<a href='/AIV/17/10/12'>Judith 10:12</a>",
      "comment": "The suggestion Judith is seeking her own salvation foreshadows biblical themes of seeking refuge, yet here Judith is playing a role in God's providential plan."
    },
    {
      "pk": 2801114,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 4,
      "text": "Judith replied, \"Listen to the words of your servant, my lord, for I will not lie to you tonight.",
      "links": "<a href='/AIV/17/8/32'>Judith 8:32</a>; <a href='/AIV/23/43/10'>Isa. 43:10</a>",
      "comment": "Judith humbly calls herself servant, reminiscent of humility before authority. Isa. 43:10 states Israel is God's witness—Judith will now witness to God's plan."
    },
    {
      "pk": 2801115,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 5,
      "text": "\"If you follow my advice, God will accomplish things for you as you please, and my lord will not fail in any of his plans.",
      "links": "<a href='/AIV/17/8/34'>Judith 8:34</a>; <a href='/AIV/17/9/4'>Judith 9:4</a>",
      "comment": "Judith connects God's power to human action. Implies that leaders succeed by aligning with God's will—prefigures later Christian teachings about cooperation with God's grace."
    },
    {
      "pk": 2801116,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 6,
      "text": "\"As surely as Nebuchadnezzar lives, the king of all the earth, and as long as you keep your resolve, you will prevail against them.",
      "links": "<a href='/AIV/17/8/34'>Judith 8:34</a>; <a href='/AIV/17/5/19'>Judith 5:19</a>",
      "comment": "Acknowledges Nebuchadnezzar’s authority, but underlying context—Judith’s true loyalty—is to God. This tension foreshadows the distinction between earthly and heavenly authority."
    },
    {
      "pk": 2801117,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 7,
      "text": "\"For your people have become so desperate that their hunger and thirst drive them to give up their city. They are ready to fall into your hands.",
      "links": "<a href='/AIV/17/7/21'>Judith 7:21</a>; <a href='/AIV/17/8/25'>Judith 8:25</a>",
      "comment": "Judith describes the suffering of Israel, invoking the recurring trial motif in salvation history, showing God's people must endure before deliverance comes."
    },
    {
      "pk": 2801118,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 8,
      "text": "\"But they have a secret: their sin has provoked their God to anger, so that he lets them be afflicted.",
      "links": "<a href='/AIV/17/5/17'>Judith 5:17</a>; <a href='/AIV/19/106/43'>Psalm 106:43</a>",
      "comment": "Judith interprets the trial as allowed by God for the people's sins, a theme echoed throughout OT history—see Psalm 106:43, Israel chastened for transgressions."
    },
    {
      "pk": 2801119,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 9,
      "text": "\"So, they resolved to use up all the holy offerings, which are set aside for their God, out of hunger and thirst.",
      "links": "<a href='/AIV/2/16/18'>Exodus 16:18</a>; <a href='/AIV/3/10/12'>Leviticus 10:12</a>",
      "comment": "Referring to violation of temple practice. The respect for holy offerings is significant; links to Levitical laws emphasizing ritual purity—see Lev. 10:12."
    },
    {
      "pk": 2801120,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 10,
      "text": "\"They intend to eat what has been forbidden by God's law, and even consume first fruits and tithes dedicated to the priests who minister in the presence of God.",
      "links": "<a href='/AIV/3/27/30'>Leviticus 27:30</a>; <a href='/AIV/4/18/26'>Numbers 18:26</a>",
      "comment": "Judith highlights profanation of religious offerings, drawing on Levitical law and pointing to the set-apartness of priests, who act as mediators (Num. 18:26)."
    },
    {
      "pk": 2801121,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 11,
      "text": "\"Unless God turns away his wrath and forgives their sin, they are destined to perish before you.",
      "links": "<a href='/AIV/19/51/1'>Psalm 51:1</a>; <a href='/AIV/23/64/9'>Isaiah 64:9</a>",
      "comment": "Judith recognizes the need for divine mercy—a signal that repentance is the way to restore relationship, drawing parallels to Psalm 51 and Isa. 64:9."
    },
    {
      "pk": 2801122,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 12,
      "text": "\"I have come to tell you all this, my lord, for your servant is devout, and I serve God both night and day.",
      "links": "<a href='/AIV/17/8/6'>Judith 8:6</a>; <a href='/AIV/19/134/1'>Ps. 134:1</a>",
      "comment": "Judith claims devout service—compare to OT figures who perform regular worship, with strong implications for perseverance and steadfastness in faith."
    },
    {
      "pk": 2801123,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 13,
      "text": "\"Now, I know that what your people are planning will be revealed to me by divine inspiration, and I will report it to you.",
      "links": "<a href='/AIV/17/8/33'>Judith 8:33</a>; <a href='/AIV/27/2/22'>Daniel 2:22</a>",
      "comment": "Judith’s claim to receive revelation prefigures the importance of God’s revelation through chosen vessel—cf. Daniel receiving dreams and interpretations (Dan. 2:22)."
    },
    {
      "pk": 2801124,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 14,
      "text": "\"I will come to you and reveal everything as it happens, so that you can go and attack them with all your army.",
      "links": "<a href='/AIV/17/10/13'>Judith 10:13</a>",
      "comment": "Judith plays the part of informer, foreshadowing God's use of individuals to defeat enemies through wisdom and strategy, as seen throughout biblical history."
    },
    {
      "pk": 2801125,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 15,
      "text": "\"Then you will lead them through the countryside without losing a single soul among your men.\"",
      "links": "<a href='/AIV/17/5/18'>Judith 5:18</a>; <a href='/AIV/6/8/12'>Joshua 8:12</a>",
      "comment": "Judith’s assurance draws a connection to divine protection in military campaigns—like Israel under Joshua, all will remain unharmed if they follow divine plan."
    },
    {
      "pk": 2801126,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 16,
      "text": "Holofernes and all his servants listened to her words and marveled at her wisdom, saying,",
      "links": "<a href='/AIV/17/8/28'>Judith 8:28</a>",
      "comment": "Holofernes is impressed by Judith's wisdom, echoing earlier appraisals of God-given insight—note repeated biblical motif: wisdom as gift from above."
    },
    {
      "pk": 2801127,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 17,
      "text": "\"No woman from so far away has ever spoken such words in the presence of Holofernes.\"",
      "links": "<a href='/AIV/17/10/18'>Judith 10:18</a>; <a href='/AIV/7/15/5'>Judges 15:5</a>",
      "comment": "Her fame for wisdom foreshadows other OT heroines, like Deborah; the distance highlights her singular role in salvation history."
    },
    {
      "pk": 2801128,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 18,
      "text": "Then Holofernes said to her, \"God has done well in sending you ahead of your people to give us victory.",
      "links": "<a href='/AIV/17/13/17'>Judith 13:17</a>; <a href='/AIV/17/8/33'>Judith 8:33</a>",
      "comment": "Ironically, Holofernes thinks Judith is divinely sent for his benefit, unaware she acts on God’s sovereignty—pointing to God's mysterious providence."
    },
    {
      "pk": 2801129,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 19,
      "text": "\"Your wisdom is excellent, and your appearance is beautiful.",
      "links": "<a href='/AIV/17/8/7'>Judith 8:7</a>; <a href='/AIV/1/24/16'>Genesis 24:16</a>",
      "comment": "Praise for both wisdom and beauty—echoes biblical combined ideals (Genesis 24:16, Rebecca's beauty and virtue). Judith’s physical and spiritual gifts are united."
    },
    {
      "pk": 2801130,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 20,
      "text": "\"If you do as you have promised, your God will be my God, and you shall dwell in the house of King Nebuchadnezzar and be famous throughout the whole world.\"",
      "links": "<a href='/AIV/8/1/16'>Ruth 1:16</a>; <a href='/AIV/17/16/21'>Judith 16:21</a>",
      "comment": "Holofernes' words echo Ruth 1:16—‘your God will be my God.’ It shows openness to truth through personal testimony; also points to rewards after faithful witness."
    },
    {
      "pk": 2801131,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 21,
      "text": "Then Holofernes ordered his servants to bring her into his tent and prepare her a feast from his own food and wine.",
      "links": "<a href='/AIV/17/12/1'>Judith 12:1</a>; <a href='/AIV/1/18/6'>Genesis 18:6</a>",
      "comment": "Judith offered special hospitality, akin to Abraham's reception of angels. The sharing of food signifies covenant relationship and foreshadows Eucharistic themes."
    },
    {
      "pk": 2801132,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 22,
      "text": "But Judith said, \"I will not eat your food, or drink your wine, lest I offend my God.",
      "links": "<a href='/AIV/27/1/8'>Daniel 1:8</a>; <a href='/AIV/3/11/47'>Leviticus 11:47</a>",
      "comment": "Her refusal to eat is reminiscent of Daniel 1:8—keeping purity in exile. Demonstrates the importance of upholding one's faith even in hostile environments."
    },
    {
      "pk": 2801133,
      "translation": "AIV",
      "book": 17,
      "chapter": 11,
      "verse": 23,
      "text": "Judith accepted what she had brought with her, and Holofernes said to her, \"If your counsel proves true, may your God be mine, and you will live in the palace as honored among my household.\"",
      "links": "<a href='/AIV/17/16/21'>Judith 16:21</a>; <a href='/AIV/8/1/16'>Ruth 1:16</a>",
      "comment": "Again, Holofernes promises reward and honors for faithfulness, echoing Ruth’s devotion and foreshadowing themes of faithful witness leading to conversion and elevation."
    }
  ],
  "translatedAt": "2025-12-23T09:17:02.016Z"
}