{
  "book": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 6,
  "verses": [
    {
      "pk": 5906001,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 1,
      "text": "When the uproar among the men surrounding Holofernes died down, and the assembly grew quiet, Bagoas stood before the commander of the Assyrian army and said, \"Let’s not ignore what Achior has said. Let’s not count his words as insignificant, for they may lead to our downfall if Israel is not destroyed.\"",
      "links": "<a href='/AIV/17/5/5'>Judith 5:5</a>; <a href='/AIV/17/5/21'>Judith 5:21</a>",
      "comment": "This verse sets the context and references Achior's previous speech defending Israel’s God. Notice the Gentile fear of Israel’s covenant protection—a theme pointing toward God's sovereign power and His people's unique role (cf. <a href='/AIV/1/12/3'>Gen. 12:3</a>)."
    },
    {
      "pk": 5906002,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 2,
      "text": "For if the Israelites are not sinful, their Lord will protect them, and we will be shamed before the whole earth.\"",
      "links": "<a href='/AIV/17/5/17'>Judith 5:17</a>; <a href='/AIV/2/23/20-22'>Ex. 23:20-22</a>",
      "comment": "The commander’s advisor acknowledges divine intervention for those who remain faithful—a foreshadowing of God’s promises to His obedient people."
    },
    {
      "pk": 5906003,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 3,
      "text": "But if they are led astray and rebel against their God, then we will see them consumed like any other people. So let us find out if there is any wrongdoing among them.\"",
      "links": "<a href='/AIV/1/15/13-16'>Gen. 15:13-16</a>; <a href='/AIV/3/26/30'>Lev. 26:30</a>",
      "comment": "The connection between Israel’s sin and vulnerability is highlighted, echoing the covenant blessings and curses (cf. <a href='/AIV/5/28/14-68'>Deut. 28:14–68</a>)."
    },
    {
      "pk": 5906004,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 4,
      "text": "When Holofernes heard this, all the leaders of the army turned against Achior, saying he should be executed for speaking against the mighty army of the king.",
      "links": "<a href='/AIV/17/5/5'>Judith 5:5</a>; <a href='/AIV/17/6/13'>Judith 6:13</a>",
      "comment": "Typical ancient reaction against defending the enemy; prophetic reminders of God protecting His own despite worldly threats."
    },
    {
      "pk": 5906005,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 5,
      "text": "And Holofernes said to Achior, \"Who are you, and who among you is a mercenary of Ephraim, that you should prophesy to us as you did today and tell us not to attack the descendants of Israel?",
      "links": "<a href='/AIV/17/5/6-21'>Judith 5:6–21</a>",
      "comment": "Achior's speech is considered subversive and even prophetic by the enemy, hinting at the truthfulness of God’s warnings to Gentiles through unexpected voices."
    },
    {
      "pk": 5906006,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 6,
      "text": "You claim that their God will defend them. I will show you, and all the people, that there is no god but Nebuchadnezzar, who will send his armies and destroy them from the face of the earth.",
      "links": "<a href='/AIV/17/5/21'>Judith 5:21</a>; <a href='/AIV/27/3/1-7'>Dan. 3:1–7</a>",
      "comment": "Holofernes invokes his king as divine, displaying pagan arrogance in contrast to Israel’s faith. Later prophetic writings (cf. Daniel) further contrast real and false worship."
    },
    {
      "pk": 5906007,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 7,
      "text": "You shall not see my face again until I have punished this people who came out of Egypt. Then, after I have scattered them, you and all who join you shall perish with them.",
      "links": "<a href='/AIV/2/14/30'>Ex. 14:30</a>; <a href='/AIV/23/9/6'>Isa. 9:6</a>",
      "comment": "Draws parallel with earlier deliverances of Israel from Egypt; Gentile rulers repeat errors of the past, missing God’s greater plan for His people."
    },
    {
      "pk": 5906008,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 8,
      "text": "And how have you ever doubted the strength of my command? You shall discover soon enough, when my sword passes through you and the Israelites alike.",
      "links": "<a href='/AIV/19/2/4-5'>Ps. 2:4-5</a>; <a href='/AIV/19/46/6'>Ps. 46:6</a>",
      "comment": "Holofernes positions himself as bringer of judgment, further echoing themes of God vs. human pride (cf. Psalm 2)."
    },
    {
      "pk": 5906009,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 9,
      "text": "So Bagoas commanded the guards who stood around Achior to seize him, take him to Bethulia, and hand him over to the Israelites.",
      "links": "<a href='/AIV/17/7/1'>Judith 7:1</a>; <a href='/AIV/17/8/14'>Judith 8:14</a>",
      "comment": "Achior’s fate is sealed by the hands of the enemy, but providence has another plan; foreshadows God using outsiders to deliver His people."
    },
    {
      "pk": 5906010,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 10,
      "text": "The men took Achior, led him from the camp into the plain, and, approaching the foothills, left him nearby. Then they returned to their lord.",
      "links": "<a href='/AIV/17/6/14'>Judith 6:14</a>",
      "comment": "Achior’s rejection by enemies sets the stage for his acceptance among Israel; similar to many biblical stories of outsiders chosen for God’s purposes."
    },
    {
      "pk": 5906011,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 11,
      "text": "The Israelites came down from Bethulia, took Achior, brought him into the city, and set him before their elders.",
      "links": "<a href='/AIV/17/6/15'>Judith 6:15</a>; <a href='/AIV/17/7/23'>Judith 7:23</a>",
      "comment": "Acceptance by Israel prefigures God’s welcoming of repentant outsiders and points to future themes of spiritual inclusion."
    },
    {
      "pk": 5906012,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 12,
      "text": "The elders, including Uzziah son of Micah, Chabris son of Gothoniel, and Charmis son of Melchiel, called together all the men of Israel.",
      "links": "<a href='/AIV/17/6/14'>Judith 6:14</a>",
      "comment": "The naming of elders lends historical and communal authority, reinforcing the biblical principle of leadership and order among God’s people."
    },
    {
      "pk": 5906013,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 13,
      "text": "Achior stood before them and reported all Holofernes had said, the conversation among the Assyrian commanders, and all he had witnessed.",
      "links": "<a href='/AIV/17/6/2-6'>Judith 6:2–6</a>; <a href='/AIV/17/8/14'>Judith 8:14</a>",
      "comment": "Achior’s testimony is pivotal, paralleling biblical accounts of Gentiles witnessing to God’s truth against their own former masters."
    },
    {
      "pk": 5906014,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 14,
      "text": "When the people heard these words, they were shocked and greatly afraid for their city and for all Israel.",
      "links": "<a href='/AIV/2/14/10-12'>Ex. 14:10–12</a>; <a href='/AIV/6/2/11'>Josh. 2:11</a>",
      "comment": "Fear and awe after hearing enemy plans recall moments when Israel depended solely on God for deliverance."
    },
    {
      "pk": 5906015,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 15,
      "text": "Uzziah said, \"Take Achior into your homes, give him comfort until God acts.\"",
      "links": "<a href='/AIV/17/7/23'>Judith 7:23</a>; <a href='/AIV/19/23/4'>Ps. 23:4</a>",
      "comment": "Israel’s hospitality reflects biblical virtues of mercy and care for the outsider; the expectation of divine intervention is crucial for understanding redemptive history."
    },
    {
      "pk": 5906016,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 16,
      "text": "Achior was welcomed into the house of Uzziah, and they provided everything he needed.",
      "links": "<a href='/AIV/17/6/15'>Judith 6:15</a>; <a href='/AIV/19/23/1'>Ps. 23:1</a>",
      "comment": "The kindness given Achior illustrates God’s people as stewards of compassion for all who seek refuge."
    },
    {
      "pk": 5906017,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 17,
      "text": "All the elders gathered together and prayed earnestly to God, crying out for His mercy over their nation and for help against their enemies.",
      "links": "<a href='/AIV/19/18/6'>Ps. 18:6</a>; <a href='/AIV/19/107/28'>Ps. 107:28</a>",
      "comment": "Here we see corporate prayer by leaders acting as intercessors for the people, a model that points to deeper spiritual authority and mediation (cf. Moses, <a href='/AIV/2/17/11'>Ex. 17:11</a>)."
    },
    {
      "pk": 5906018,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 18,
      "text": "They humbled themselves, laying ashes on their heads, and prayed with one heart to the God of Israel.",
      "links": "<a href='/AIV/27/9/3'>Dan. 9:3</a>; <a href='/AIV/32/3/6'>Jonah 3:6</a>",
      "comment": "Fasting and ashes symbolized deep penitence—echoed by prophets and New Testament calls to repentance (cf. <a href='/AIV/40/11/21'>Matt. 11:21</a>)."
    },
    {
      "pk": 5906019,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 19,
      "text": "And so they cried out to God, begging Him not to let their children or cities be lost, or their holy things to be desecrated, or their temple to be destroyed by enemies.",
      "links": "<a href='/AIV/19/79/1'>Ps. 79:1</a>; <a href='/AIV/2/15/13'>Ex. 15:13</a>",
      "comment": "Petition for protection of the sanctuary and their children underlines the sacredness of God’s dwelling and pointed anticipation of the eternal sanctity of worship."
    },
    {
      "pk": 5906020,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 20,
      "text": "The entire assembly remained in prayer for many days, fasting, weeping, and urgently pleading with the Lord God.",
      "links": "<a href='/AIV/19/35/13'>Ps. 35:13</a>; <a href='/AIV/40/6/16'>Matt. 6:16</a>",
      "comment": "Community-wide acts of fasting and prayer underscore the biblical tradition of seeking God together, vital for both personal and collective deliverance."
    },
    {
      "pk": 5906021,
      "translation": "AIV",
      "book": 17,
      "chapter": 6,
      "verse": 21,
      "text": "And Uzziah instructed the people, “Stay strong and faithful, for your deliverance is at hand. Let us watch until the Lord acts, for He will not abandon us to destruction.”",
      "links": "<a href='/AIV/19/27/14'>Ps. 27:14</a>; <a href='/AIV/45/8/24-25'>Rom. 8:24–25</a>",
      "comment": "Faithful waiting for God’s salvation anticipates the hope and perseverance fulfilled in Christ (cf. <a href='/AIV/45/8/24-25'>Rom. 8:24–25</a>). This verse also has a spiritual interpretation; Christians are called to steadfast trust even amid adversity."
    }
  ],
  "translatedAt": "2025-12-23T09:14:39.515Z"
}