{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 3,
  "verses": [
    {
      "pk": 10003001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 1,
      "text": "There was a long war between the house of Saul and the house of David. David grew stronger and stronger, but the house of Saul became weaker and weaker.",
      "links": "<a href='/AIV/9/31/1-7'>1 Sam. 31:1-7</a>; <a href='/AIV/10/5/2'>2 Sam. 5:2</a>",
      "comment": "This verse summarizes the shift of power from Saul to David, indicating divine favor toward David. The theme of God strengthening David foreshadows the Messianic kingship established later (see <a href='/AIV/19/89/19-20'>Ps. 89:19-20</a>)."
    },
    {
      "pk": 10003002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 2,
      "text": "Sons were born to David in Hebron: his firstborn was Amnon, by Ahinoam of Jezreel;",
      "links": "<a href='/AIV/10/13/1'>2 Sam. 13:1</a>; <a href='/AIV/10/2/2'>2 Sam. 2:2</a>",
      "comment": "David's sons are listed, showing the royal heritage. Amnon's story has moral lessons later in 2 Samuel. The listing of sons also highlights the importance of lineage."
    },
    {
      "pk": 10003003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 3,
      "text": "his second, Chileab, by Abigail the widow of Nabal of Carmel; the third, Absalom, son of Maacah, daughter of Talmai king of Geshur;",
      "links": "<a href='/AIV/10/13/20'>2 Sam. 13:20</a>; <a href='/AIV/10/15/1'>2 Sam. 15:1</a>",
      "comment": "Absalom will become a key figure in future chapters. The marriages to women from various backgrounds may represent political alliances."
    },
    {
      "pk": 10003004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 4,
      "text": "the fourth, Adonijah, son of Haggith; the fifth, Shephatiah, son of Abital;",
      "links": "<a href='/AIV/11/1/5'>1 Kings 1:5</a>",
      "comment": "Adonijah's name is notable: he will attempt to claim the throne in 1 Kings. Royal succession struggles foreshadow future conflicts."
    },
    {
      "pk": 10003005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 5,
      "text": "the sixth, Ithream, by David’s wife Eglah. These were born to David in Hebron.",
      "links": "<a href='/AIV/10/5/13'>2 Sam. 5:13</a>",
      "comment": "The six sons each have mothers of different backgrounds, hinting at the complexity of David’s family. This royal lineage foreshadows the Messiah, born from David's line (<a href='/AIV/40/1/1'>Matthew 1:1</a>)."
    },
    {
      "pk": 10003006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 6,
      "text": "While there was war between the house of Saul and the house of David, Abner was strengthening his position in the house of Saul.",
      "links": "<a href='/AIV/10/2/8'>2 Sam. 2:8</a>",
      "comment": "Abner, Saul’s military leader, seeks power for himself. The struggle between political figures mirrors the need for divinely appointed authority."
    },
    {
      "pk": 10003007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 7,
      "text": "Now Saul had a concubine whose name was Rizpah, the daughter of Aiah. And Ish-bosheth said to Abner, 'Why have you gone in to my father’s concubine?'",
      "links": "<a href='/AIV/10/21/8-10'>2 Sam. 21:8-10</a>",
      "comment": "Accusations of taking a royal concubine implied a claim to the throne. The inheritance of authority through such actions is part of ancient Near East custom."
    },
    {
      "pk": 10003008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 8,
      "text": "Abner was very angry over the words of Ish-bosheth and said, 'Am I a dog’s head that belongs to Judah? To this day I have shown kindness to the house of Saul, your father, and to his brothers and friends, and have not handed you over to David. Yet you now charge me with a fault concerning this woman.'",
      "links": "<a href='/AIV/10/2/10'>2 Sam. 2:10</a>",
      "comment": "Abner defends his loyalty and feels insulted by accusations. Abner’s language marks a break with Saul's house and foreshadows political shifts."
    },
    {
      "pk": 10003009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 9,
      "text": "'God do so to Abner, and more also, if I do not do for David as the LORD has sworn to him,'",
      "links": "<a href='/AIV/9/16/1'>1 Sam. 16:1</a>; <a href='/AIV/10/5/2'>2 Sam. 5:2</a>",
      "comment": "Abner recognizes David’s divine appointment as king, referencing God’s oath. This underlines legitimate authority coming from God, a theme echoed in later teachings about apostolic succession."
    },
    {
      "pk": 10003010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 10,
      "text": "'to transfer the kingdom from the house of Saul and establish the throne of David over Israel and Judah, from Dan to Beersheba.'",
      "links": "<a href='/AIV/10/5/5'>2 Sam. 5:5</a>",
      "comment": "'From Dan to Beersheba' refers to all Israel. The unification under David sets the stage for the eternal kingdom promised to his descendants (<a href='/AIV/10/7/12-16'>2 Sam. 7:12-16</a>)."
    },
    {
      "pk": 10003011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 11,
      "text": "Ish-bosheth could not answer Abner another word, because he was afraid of him.",
      "links": "<a href='/AIV/10/2/10'>2 Sam. 2:10</a>",
      "comment": "Ish-bosheth’s lack of response shows his weakness and dependence on Abner, contrasting with David's divinely-empowered kingship."
    },
    {
      "pk": 10003012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 12,
      "text": "Abner sent messengers to David on his behalf, saying, 'Whose land is it? Make a covenant with me, and I will help bring all Israel over to you.'",
      "links": "<a href='/AIV/10/5/3'>2 Sam. 5:3</a>",
      "comment": "Abner recognizes David’s right and seeks a covenant. Covenants are central in biblical theology, anticipating the new and everlasting covenant in Christ."
    },
    {
      "pk": 10003013,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 13,
      "text": "David said, 'Good; I will make a covenant with you. But one thing I require: you shall not see my face unless you first bring Michal, Saul’s daughter, when you come to see me.'",
      "links": "<a href='/AIV/9/18/27'>1 Sam. 18:27</a>; <a href='/AIV/10/6/16'>2 Sam. 6:16</a>",
      "comment": "Michal’s return is a requirement for the covenant. David’s insistence on legitimacy associates royal succession with rightful marriage."
    },
    {
      "pk": 10003014,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 14,
      "text": "Then David sent messengers to Ish-bosheth, Saul’s son, saying, 'Give me my wife Michal, whom I betrothed to myself for one hundred foreskins of the Philistines.'",
      "links": "<a href='/AIV/9/18/25-27'>1 Sam. 18:25-27</a>",
      "comment": "David reminds Ish-bosheth of his rightful claim to Michal, reinforcing lawfulness and faithfulness in marital covenants."
    },
    {
      "pk": 10003015,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 15,
      "text": "Ish-bosheth sent and took her from her husband, Paltiel the son of Laish.",
      "links": "<a href='/AIV/9/25/44'>1 Sam. 25:44</a>",
      "comment": "Michal was previously given to another, yet David claims the marriage; this upholds the permanence of marital bonds, a topic Jesus will later affirm (<a href='/AIV/40/19/5-6'>Matt. 19:5-6</a>)."
    },
    {
      "pk": 10003016,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 16,
      "text": "Her husband went with her, weeping as he followed her to Bahurim. But Abner said to him, 'Go, return.' So he returned.",
      "links": "<a href='/AIV/10/16/5'>2 Sam. 16:5</a>",
      "comment": "The emotional scene highlights the personal cost of political decisions. The restoration of legitimate marriage may mirror principles of fidelity and obedience to ordained authority."
    },
    {
      "pk": 10003017,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 17,
      "text": "Abner conferred with the elders of Israel, saying, 'For some time, you have wanted David to be your king.'",
      "links": "<a href='/AIV/10/5/1'>2 Sam. 5:1</a>",
      "comment": "Abner is aware of the people's desire for David. The primacy of a central figure as king is emphasized, just as unity is a scriptural priority."
    },
    {
      "pk": 10003018,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 18,
      "text": "'Now do it! For the LORD has spoken of David, saying, “By the hand of my servant David I will save my people Israel from the hand of the Philistines and from the hand of all their enemies.”'",
      "links": "<a href='/AIV/10/7/8-16'>2 Sam. 7:8-16</a>; <a href='/AIV/19/78/70-71'>Ps. 78:70-71</a>",
      "comment": "God’s promise to save Israel through David prefigures the Messiah who saves from spiritual enemies. Spiritual leadership through God’s chosen servant is central."
    },
    {
      "pk": 10003019,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 19,
      "text": "Abner also spoke to Benjamin. Then he went to David at Hebron and told him what Israel and the whole house of Benjamin wanted.",
      "links": "<a href='/AIV/10/5/3'>2 Sam. 5:3</a>; <a href='/AIV/9/9/1'>1 Sam. 9:1</a>",
      "comment": "Abner involves Benjamin, Saul's own tribe, stressing David's acceptance by all Israel. This unity under a single king points to the need for one shepherd over God’s people."
    },
    {
      "pk": 10003020,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 20,
      "text": "When Abner came with twenty men to David at Hebron, David made a feast for Abner and the men who were with him.",
      "links": "<a href='/AIV/10/6/19'>2 Sam. 6:19</a>",
      "comment": "A feast marks the covenant, echoing future covenant meals. Feasting is significant in biblical worship, prefiguring the Messianic banquet (<a href='/AIV/40/26/26-29'>Matt. 26:26-29</a>)."
    },
    {
      "pk": 10003021,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 21,
      "text": "Abner said to David, 'Let me go and gather all Israel for my lord the king, so they may make a covenant with you, and you may reign over all you desire.' So David sent Abner away, and he went in peace.",
      "links": "<a href='/AIV/10/7/16'>2 Sam. 7:16</a>",
      "comment": "Abner seeks to gather all Israel around David through covenant. The language reflects themes of unity and the gathering of God’s people under his anointed leader."
    },
    {
      "pk": 10003022,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 22,
      "text": "Just then, David’s servants and Joab came from a raid, bringing much spoil with them. But Abner was no longer with David at Hebron, for he had sent him away in peace.",
      "links": "<a href='/AIV/10/2/13'>2 Sam. 2:13</a>",
      "comment": "The peaceful departure of Abner contrasts with future conflict. The accumulation of spoil shows God’s provision for his chosen king."
    },
    {
      "pk": 10003023,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 23,
      "text": "When Joab and all the army with him arrived, they were told, 'Abner son of Ner came to the king, and the king sent him away, and he has gone in peace.'",
      "links": "<a href='/AIV/10/2/13'>2 Sam. 2:13</a>",
      "comment": "Joab is informed of Abner’s peaceful visit. The narrative sets up the tension between military and political considerations."
    },
    {
      "pk": 10003024,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 24,
      "text": "Then Joab went to the king and said, 'What have you done? Look, Abner came to you! Why did you send him away, so he is gone?'",
      "links": "<a href='/AIV/10/2/22-23'>2 Sam. 2:22-23</a>",
      "comment": "Joab challenges David’s actions. The struggle for control underlines the need for spiritual guidance beyond mere political maneuvering."
    },
    {
      "pk": 10003025,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 25,
      "text": "'You know Abner son of Ner came to deceive you and to find out your going and coming, and to know all that you do.'",
      "links": "<a href='/AIV/10/2/12'>2 Sam. 2:12</a>",
      "comment": "Joab suspects Abner’s intentions. Worldly wisdom contrasts with the trust David places in God's providence."
    },
    {
      "pk": 10003026,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 26,
      "text": "When Joab left David, he sent messengers after Abner, and they brought him back from the well of Sirah, but David did not know about it.",
      "links": "<a href='/AIV/10/11/14-15'>2 Sam. 11:14-15</a>",
      "comment": "Joab acts independently, recalling Abner without David’s knowledge. This foreshadows division and conflict, the opposite of the unity sought."
    },
    {
      "pk": 10003027,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 27,
      "text": "When Abner returned to Hebron, Joab took him aside in the gateway, as if to speak with him privately, and there he stabbed him in the stomach. So Abner died because of the blood of Asahel, Joab’s brother.",
      "links": "<a href='/AIV/10/2/23'>2 Sam. 2:23</a>",
      "comment": "Joab’s killing of Abner is revenge for Asahel’s death. The focus on Hebron, a city of refuge, highlights the tension between justice and personal vengeance."
    },
    {
      "pk": 10003028,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 28,
      "text": "Afterward, when David heard, he said, 'I and my kingdom are forever innocent before the LORD concerning the blood of Abner son of Ner.'",
      "links": "<a href='/AIV/10/1/16'>2 Sam. 1:16</a>; <a href='/AIV/10/4/11'>2 Sam. 4:11</a>",
      "comment": "David openly proclaims his innocence, submitting his kingship to God’s judgment. Innocence and purification themes point ahead to Christ’s leadership."
    },
    {
      "pk": 10003029,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 29,
      "text": "'May it fall on the head of Joab and all his father’s house! May there never be one who is without discharge, or leprous, or who holds the spindle, or who falls by the sword, or who lacks bread.'",
      "links": "<a href='/AIV/5/28/21-22'>Deut. 28:21-22</a>",
      "comment": "David calls for judgment on Joab, invoking curses found in the law. This shows the seriousness of unlawful bloodshed and emphasizes moral responsibility."
    },
    {
      "pk": 10003030,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 30,
      "text": "So Joab and his brother Abishai killed Abner, because he had killed their brother Asahel at Gibeon in battle.",
      "links": "<a href='/AIV/10/2/23'>2 Sam. 2:23</a>",
      "comment": "Joab’s act is motivated by revenge, not justice. Unforgiveness leads to division, contrasting the call for unity and reconciliation."
    },
    {
      "pk": 10003031,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 31,
      "text": "David said to Joab and all the people with him, 'Tear your clothes, put on sackcloth, and mourn before Abner.' King David himself walked behind the coffin.",
      "links": "<a href='/AIV/10/1/11-12'>2 Sam. 1:11-12</a>",
      "comment": "Public mourning for Abner by David distinguishes his righteous rule from Joab’s violence. Ritual mourning reflects a community response to injustice."
    },
    {
      "pk": 10003032,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 32,
      "text": "They buried Abner in Hebron, and the king wept aloud at Abner’s grave, and all the people wept.",
      "links": "<a href='/AIV/10/1/11-12'>2 Sam. 1:11-12</a>",
      "comment": "Hebron, a sacred site, is the place of Abner’s burial. David’s mourning with the people shows a leader who shares his people’s sorrow, prefiguring Christ’s empathy (<a href='/AIV/43/11/35'>John 11:35</a>)."
    },
    {
      "pk": 10003033,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 33,
      "text": "The king sang a lament over Abner and said, 'Should Abner die as a fool dies?'",
      "links": "<a href='/AIV/10/1/17'>2 Sam. 1:17</a>; <a href='/AIV/19/14/1'>Ps. 14:1</a>",
      "comment": "David’s lament shows respect despite Abner’s past, affirming the dignity of life and justice even for opponents."
    },
    {
      "pk": 10003034,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 34,
      "text": "'Your hands were not bound, nor your feet put in chains. You fell as one falls before the wicked.' And all the people wept over him again.",
      "links": "<a href='/AIV/10/11/14-17'>2 Sam. 11:14-17</a>",
      "comment": "David highlights Abner’s unjust death. The crowd's reaction shows the collective value of justice and righteousness in the community."
    },
    {
      "pk": 10003035,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 35,
      "text": "Then all the people came to persuade David to eat food while it was still day. But David swore, saying, 'God do so to me and more also if I taste bread or anything else until the sun goes down!'",
      "links": "<a href='/AIV/10/12/16'>2 Sam. 12:16</a>; <a href='/AIV/10/1/12'>2 Sam. 1:12</a>",
      "comment": "David’s fasting expresses genuine grief and spiritual discipline, connecting the physical to the spiritual act of mourning, a theme embraced in penitential practices."
    },
    {
      "pk": 10003036,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 36,
      "text": "All the people took notice, and it pleased them; whatever the king did, pleased all the people.",
      "links": "<a href='/AIV/10/15/13'>2 Sam. 15:13</a>",
      "comment": "David’s righteous conduct wins public approval, setting a model for godly leadership that seeks the good of the whole people."
    },
    {
      "pk": 10003037,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 37,
      "text": "So all the people and all Israel understood that day that it was not the king’s will to put Abner son of Ner to death.",
      "links": "<a href='/AIV/10/5/3'>2 Sam. 5:3</a>",
      "comment": "David’s innocence is publicly acknowledged, reinforcing the importance of transparency and just governance, reflected later in the ministry of Christ."
    },
    {
      "pk": 10003038,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 38,
      "text": "The king said to his servants, 'Do you not know that a leader and a great man has fallen in Israel this day?'",
      "links": "<a href='/AIV/10/1/19'>2 Sam. 1:19</a>",
      "comment": "David honors Abner, indicating respect for leadership and the fallen. The value placed on authority and order continues in scriptural tradition."
    },
    {
      "pk": 10003039,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 3,
      "verse": 39,
      "text": "'And I am weak today, though anointed king. These men, the sons of Zeruiah, are stronger than I. May the LORD repay the evildoer according to his evil.'",
      "links": "<a href='/AIV/10/2/18'>2 Sam. 2:18</a>; <a href='/AIV/19/62/12'>Ps. 62:12</a>",
      "comment": "David admits his human weakness despite divine anointing, relying on God for justice. The theme of anointed but suffering leader foreshadows Christ’s suffering and trust in the Father."
    }
  ],
  "translatedAt": "2025-12-24T03:10:07.564Z"
}