{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 12,
  "verses": [
    {
      "pk": 10012001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 1,
      "text": "The LORD sent Nathan to David. Nathan came to him and said, “There were two men in a certain city: one was rich and the other poor.",
      "links": "<a href='/AIV/10/7/2'>2Sam 7:2</a>; <a href='/AIV/11/21/17'>1 Kgs 21:17-19</a>",
      "comment": "Nathan the prophet is sent by God to confront David, showing the role of prophecy and accountability within God's people. Parables are often used by prophets to deliver a message that brings conviction (see also 2Sam 11; Matt 21:33-41)."
    },
    {
      "pk": 10012002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 2,
      "text": "The rich man had very many flocks and herds,",
      "links": "<a href='/AIV/10/3/2'>2Sam 3:2-5</a>",
      "comment": "The contrast is set up between abundance and lack, preparing for the parable's moral. The rich man's possession echoes Israel's kingship, possessing much."
    },
    {
      "pk": 10012003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 3,
      "text": "but the poor man had nothing except one little ewe lamb he had bought. He raised it, and it grew up with him and his children. It ate from his food, drank from his cup, and lay in his arms. It was like a daughter to him.",
      "links": "<a href='/AIV/16/5/1'>Neh 5:1</a>",
      "comment": "The ewe lamb symbolizes innocence and intimacy. In a spiritual sense, it points to the value God places on every soul (cf. Matt 18:12)."
    },
    {
      "pk": 10012004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 4,
      "text": "Now a traveler came to the rich man, but the rich man was unwilling to take from his own flock or herd to prepare a meal for the traveler who had come. Instead, he took the poor man’s lamb and prepared it for his guest.",
      "links": "<a href='/AIV/10/11/4'>2Sam 11:4</a>",
      "comment": "The injustice is highlighted; parallels to David's sin with Bathsheba are clear, showing prophetic veiled rebuke and social justice themes."
    },
    {
      "pk": 10012005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 5,
      "text": "David’s anger burned greatly against the man, and he said to Nathan, “As the LORD lives, the man who has done this deserves to die!",
      "links": "<a href='/AIV/10/11/27'>2Sam 11:27</a>; <a href='/AIV/10/14/9'>2Sam 14:9</a>",
      "comment": "David, not recognizing himself, pronounces judgment. Unintentional self-condemnation is a biblical pattern (see also Rom 2:1)."
    },
    {
      "pk": 10012006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 6,
      "text": "He must restore the lamb fourfold, because he did this thing and had no pity.”",
      "links": "<a href='/AIV/2/22/1'>Ex 22:1</a>",
      "comment": "David applies the law of restitution; cf. Ex 22:1. Mercy is absent in his assessment, foreshadowing his need for mercy."
    },
    {
      "pk": 10012007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 7,
      "text": "Nathan then said to David, “You are the man! Thus says the LORD God of Israel: ‘I anointed you king over Israel, and I delivered you out of the hand of Saul.",
      "links": "<a href='/AIV/10/16/13'>2Sam 16:13</a>; <a href='/AIV/9/16/1-13'>1Sam 16:1-13</a>",
      "comment": "Nathan reveals the parable's target. The prophetic confrontation mimics how God corrects His people through divinely appointed leaders—a pattern reflecting God’s orderly guidance of His people (cf. Acts 2:37)."
    },
    {
      "pk": 10012008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 8,
      "text": "I gave you your master’s house and your master’s wives into your care. I gave you the house of Israel and Judah. And if that had been too little, I would have given you even more.",
      "links": "<a href='/AIV/9/15/28'>1Sam 15:28</a>",
      "comment": "God’s generosity to David recalls covenant blessings and inheritance (cf. 1Sam 15:28). God’s will is abundant blessing, not taking by sinful means."
    },
    {
      "pk": 10012009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 9,
      "text": "Why have you despised the word of the LORD and done what is evil in His sight? You struck down Uriah the Hittite with the sword, took his wife to be your own, and killed him by the sword of the Ammonites.",
      "links": "<a href='/AIV/10/11/14-17'>2Sam 11:14-17</a>",
      "comment": "Violating the word of the LORD signals serious sin. Both murder and adultery are condemned, showing sin’s gravity."
    },
    {
      "pk": 10012010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 10,
      "text": "Now therefore, the sword will never depart from your house, because you have despised Me and taken the wife of Uriah the Hittite to be your wife.’",
      "links": "<a href='/AIV/10/13/28-29'>2Sam 13:28-29</a>; <a href='/AIV/10/18/14-15'>2Sam 18:14-15</a>",
      "comment": "Divine judgment brings lasting consequences. The perpetual ‘sword’ alludes to ongoing conflict in David’s house—historically fulfilled."
    },
    {
      "pk": 10012011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 11,
      "text": "Thus says the LORD: ‘I am going to raise up evil against you from your own house. I will take your wives before your eyes and give them to your neighbor, and he will lie with your wives in broad daylight.",
      "links": "<a href='/AIV/10/16/21-22'>2Sam 16:21-22</a>",
      "comment": "The fulfillment comes during Absalom’s rebellion (2Sam 16:21–22). Sin’s private acts lead to public consequences—spiritual and visible."
    },
    {
      "pk": 10012012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 12,
      "text": "For you did it secretly, but I will do this thing before all Israel and in broad daylight.”",
      "links": "<a href='/AIV/10/16/22'>2Sam 16:22</a>; <a href='/AIV/42/8/17'>Luke 8:17</a>",
      "comment": "Secret sin will be exposed. Jesus later teaches hidden things will be brought to light (Luke 8:17)."
    },
    {
      "pk": 10012013,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 13,
      "text": "Then David said to Nathan, “I have sinned against the LORD.” Nathan replied, “The LORD also has put away your sin; you shall not die.",
      "links": "<a href='/AIV/19/51/1-4'>Ps 51:1-4</a>; <a href='/AIV/19/32/5'>Ps 32:5</a>",
      "comment": "David’s confession is immediate and full, reflecting true repentance. God’s forgiveness, mediated through the prophet, offers a foreshadowing of sacramental confession and absolution (cf. John 20:23). Psalm 51 is traditionally associated with David’s repentance here."
    },
    {
      "pk": 10012014,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 14,
      "text": "However, because by this deed you have utterly scorned the LORD, the child who is born to you shall surely die.”",
      "links": "<a href='/AIV/10/12/18'>2Sam 12:18</a>",
      "comment": "Though forgiven, David still faces consequences. Sin’s temporal effects—contrasted with spiritual absolution—show God's justice and discipline."
    },
    {
      "pk": 10012015,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 15,
      "text": "Then Nathan went to his house. And the LORD struck the child that Uriah’s wife bore to David, and it became sick.",
      "links": "<a href='/AIV/10/11/27'>2Sam 11:27</a>",
      "comment": "The narrative refers to Bathsheba as 'Uriah's wife', highlighting the gravity and legacy of David’s actions."
    },
    {
      "pk": 10012016,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 16,
      "text": "David therefore sought God on behalf of the child. He fasted, went in, and lay all night on the ground.",
      "links": "<a href='/AIV/19/35/13'>Ps 35:13</a>",
      "comment": "David’s repentance is accompanied by fasting and prayer, showing the enduring scriptural connection between physical acts and spiritual contrition."
    },
    {
      "pk": 10012017,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 17,
      "text": "The elders of his house stood around him, trying to raise him from the ground, but he would not, nor would he eat food with them.",
      "links": "<a href='/AIV/10/13/31'>2Sam 13:31</a>",
      "comment": "Communal concern for David’s spiritual state; fasting here is an expression of grief and penitence."
    },
    {
      "pk": 10012018,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 18,
      "text": "On the seventh day the child died. David’s servants were afraid to tell him the child was dead. They said, “While the child was alive, we spoke to him, but he would not listen. How can we say to him the child is dead? He may do himself harm.”",
      "links": "<a href='/AIV/10/1/10'>2Sam 1:10</a>",
      "comment": "The seven days correspond to a period of mourning or trial (see also Gen 50:10)."
    },
    {
      "pk": 10012019,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 19,
      "text": "But when David saw that his servants were whispering, David understood that the child was dead. He asked his servants, 'Is the child dead?' They replied, 'He is dead.'",
      "links": "<a href='/AIV/10/13/32'>2Sam 13:32</a>",
      "comment": "David discerns the truth before being told, similar to other biblical figures who sense loss or tragedy."
    },
    {
      "pk": 10012020,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 20,
      "text": "Then David arose from the ground, washed and anointed himself, changed his clothes, and went into the house of the LORD and worshiped. Then he went home, and at his request, they set food before him, and he ate.",
      "links": "<a href='/AIV/19/51/16-17'>Ps 51:16-17</a>",
      "comment": "David’s actions symbolize resuming communion with God. External rituals align with internal repentance. The importance of worship and sacramental practice after sin is subtly foreshadowed here."
    },
    {
      "pk": 10012021,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 21,
      "text": "Then his servants said to him, 'What is this that you have done? While the child was alive, you fasted and wept, but now that the child is dead, you arise and eat food.'",
      "links": "<a href='/AIV/10/13/24'>2Sam 13:24</a>",
      "comment": "David’s servants are perplexed. They expect grief to continue, but David’s practice is a response to faith."
    },
    {
      "pk": 10012022,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 22,
      "text": "He said, 'While the child was still alive, I fasted and wept, for I said, "
    },
    {
      "pk": 10012023,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 23,
      "text": "But now he is dead. Why should I fast? Can I bring him back again? I will go to him, but he will not return to me.'",
      "links": "<a href='/AIV/19/49/15'>Ps 49:15</a>; <a href='/AIV/46/15/22'>1 Cor 15:22</a>",
      "comment": "David expresses a hope in the afterlife, seeing reunion in death, a subtle pointer to belief in the resurrection and communion of saints."
    },
    {
      "pk": 10012024,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 24,
      "text": "Then David comforted his wife Bathsheba. He went to her and lay with her, and she bore a son. He called his name Solomon. The LORD loved him,",
      "links": "<a href='/AIV/13/22/9-10'>1Chr 22:9-10</a>; <a href='/AIV/10/7/12-13'>2Sam 7:12-13</a>",
      "comment": "Solomon’s birth is marked by divine favor. The transition from mourning to blessing prefigures God's power to restore."
    },
    {
      "pk": 10012025,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 25,
      "text": "and He sent word through Nathan the prophet to name him Jedidiah, because of the LORD’s love.",
      "links": "<a href='/AIV/10/7/15'>2Sam 7:15</a>",
      "comment": "'Jedidiah' means 'beloved of the LORD'. God names and claims the child through His prophet. Naming in Scripture signifies identity and vocation, often through priestly or prophetic mediation."
    },
    {
      "pk": 10012026,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 26,
      "text": "Meanwhile, Joab fought against Rabbah of the Ammonites and captured the royal city.",
      "links": "<a href='/AIV/10/11/1'>2Sam 11:1</a>; <a href='/AIV/13/20/1'>1Chr 20:1</a>",
      "comment": "The narrative returns to the battle; the consequences of war are juxtaposed with David’s inner struggles."
    },
    {
      "pk": 10012027,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 27,
      "text": "Joab sent messengers to David and said, 'I have fought against Rabbah and have also captured the water supply of the city.'",
      "links": "<a href='/AIV/10/11/25'>2Sam 11:25</a>",
      "comment": "The capture of the water supply signals imminent conquest—a practical and symbolic victory."
    },
    {
      "pk": 10012028,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 28,
      "text": "Now then, gather the rest of the people together and encamp against the city and capture it, or I will capture the city myself and it will be called by my name.'",
      "links": "<a href='/AIV/10/8/13'>2Sam 8:13</a>",
      "comment": "Joab defers to David, giving him the honor of the conquest—a sign of order and deference to proper authority."
    },
    {
      "pk": 10012029,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 29,
      "text": "So David gathered all the people, went to Rabbah, fought against it, and captured it.",
      "links": "<a href='/AIV/10/11/1'>2Sam 11:1</a>",
      "comment": "David resumes kingly duties, reintegrated as leader after repentance and judgment."
    },
    {
      "pk": 10012030,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 30,
      "text": "He took the crown from David’s head—the crown weighed a talent of gold, and in it was a precious stone—and it was placed on David’s head. He brought out a great amount of spoil from the city.",
      "links": "<a href='/AIV/13/20/2'>1Chr 20:2</a>",
      "comment": "The placing of the crown recalls royal and messianic symbolism. The stone evokes priestly and kingly imagery later fulfilled in Christ as king and high priest (see Heb 7:1-3)."
    },
    {
      "pk": 10012031,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 12,
      "verse": 31,
      "text": "And he brought out the people who were there and set them to labor with saws, iron picks, and axes, and put them to work at the brick kilns. He did this to all the cities of the Ammonites. Then David and all the people returned to Jerusalem.",
      "links": "<a href='/AIV/13/20/3'>1Chr 20:3</a>",
      "comment": "David's administration of conquered peoples remains a complex topic; his return to Jerusalem ends the chapter, suggesting restoration and return to order after a period of sin and rebellion."
    }
  ],
  "translatedAt": "2025-12-24T03:17:27.152Z"
}