{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 18,
  "verses": [
    {
      "pk": 10018001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 1,
      "text": "Then David mustered the men who were with him and set captains of thousands and captains of hundreds over them.",
      "links": "<a href='/AIV/9/8/12'>1 Sam. 8:12</a>; <a href='/AIV/13/27/1'>1 Chr. 27:1</a>",
      "comment": "David organizes his forces in a military structure, displaying wise leadership. Cross-reference highlights similar practices of appointing leaders. Also reflects the order and structure seen in the united people of God."
    },
    {
      "pk": 10018002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 2,
      "text": "And David sent forth a third of the people under the command of Joab, a third under Abishai the son of Zeruiah, Joab's brother, and a third under Ittai the Gittite. And the king said to the people, 'I will also go out with you myself.'",
      "links": "<a href='/AIV/10/15/19'>2 Sam. 15:19-22</a>",
      "comment": "Threefold division emphasizes unity in diversity; see David’s willingness to go himself, reflecting a leader willing to suffer with his people, prefigures Christ’s willingness to share in our trials."
    },
    {
      "pk": 10018003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 3,
      "text": "But the people said, 'You must not go out, for if we flee, they will not care about us, and if half of us die, they will not care about us. But you are worth ten thousand of us. It is better that you support us from the city.'",
      "links": "<a href='/AIV/13/11/2'>1 Chr. 11:2</a>",
      "comment": "The people recognize the unique role of the anointed leader, signifying the importance of divinely appointed authority, a theological theme seen in the way Christ is valued above all."
    },
    {
      "pk": 10018004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 4,
      "text": "The king said to them, 'Whatever seems best to you, I will do.' So the king stood at the side of the gate while all the people marched out by hundreds and by thousands.",
      "links": "<a href='/AIV/11/19/8'>1 Kings 19:8</a>",
      "comment": "David humbly submits to wise counsel, showing a willingness to listen, a hallmark of a true shepherd, pointing forward to the humility of Christ."
    },
    {
      "pk": 10018005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 5,
      "text": "And the king ordered Joab and Abishai and Ittai, 'Deal gently for my sake with the young man Absalom.' And all the people heard when the king gave orders concerning Absalom to all the commanders.",
      "links": "<a href='/AIV/10/14/33'>2 Sam. 14:33</a>",
      "comment": "David’s mercy towards Absalom mirrors the mercy of God for fallen humanity. Compare also with Jesus’ instructions to forgive and show compassion (cf. Matt. 5:44)."
    },
    {
      "pk": 10018006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 6,
      "text": "So the army marched out into the field against Israel, and the battle was fought in the forest of Ephraim.",
      "links": "<a href='/AIV/7/12/5'>Judg. 12:5</a>",
      "comment": "Conflict occurs in a wooded area, highlighting divine providence even in seeming chaos. The setting will mediate justice against the rebellious son."
    },
    {
      "pk": 10018007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 7,
      "text": "And the army of Israel was defeated there by David’s servants, and the loss was great on that day—twenty thousand men.",
      "links": "<a href='/AIV/10/2/27'>2 Sam. 2:27</a>",
      "comment": "The numbers reflect the seriousness of rebellion against God’s anointed, similar to the consequences of resisting God’s will in salvation history."
    },
    {
      "pk": 10018008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 8,
      "text": "The battle spread over the whole region, and the forest devoured more people that day than the sword.",
      "links": "<a href='/AIV/10/23/13'>2 Sam. 23:13</a>; <a href='/AIV/2/14/27'>Ex. 14:27</a>",
      "comment": "Natural means (the forest) executes judgment, showing how creation serves God’s justice. Cf. how God uses nature in Exodus against Egypt."
    },
    {
      "pk": 10018009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 9,
      "text": "Then Absalom met the servants of David. Absalom was riding on his mule, and the mule went under the thick branches of a great oak, and Absalom’s head got caught in the oak. He was left hanging between heaven and earth, while the mule that was under him kept going.",
      "links": "<a href='/AIV/10/14/25'>2 Sam. 14:25</a>; <a href='/AIV/5/19/13'>Ps. 19:13</a>",
      "comment": "Absalom’s pride leads to humiliation, hanging 'between heaven and earth,' a symbolic foreshadowing of one punished for rebellion, recalling spiritual consequences for sin."
    },
    {
      "pk": 10018010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 10,
      "text": "A certain man saw it and told Joab, 'I saw Absalom hanging in an oak.'",
      "links": "<a href='/AIV/10/17/25'>2 Sam. 17:25</a>",
      "comment": "Reporting Absalom’s predicament signals the turning point for rebellious authority meeting divine justice."
    },
    {
      "pk": 10018011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 11,
      "text": "Joab said to the man who had told him, 'What? You saw him! Why didn’t you strike him to the ground right there? I would have given you ten silver pieces and a belt.'",
      "links": "<a href='/AIV/10/1/15'>2 Sam. 1:15</a>",
      "comment": "Joab’s impatience contrasts with David’s mercy, typifying the temptation to take justice into human hands rather than await divine providence."
    },
    {
      "pk": 10018012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 12,
      "text": "But the man said to Joab, 'Even if I were to receive a thousand silver pieces, I would not raise my hand against the king’s son. For in our hearing the king commanded you and Abishai and Ittai, “Protect the young man Absalom.”'",
      "links": "<a href='/AIV/10/18/5'>2 Sam. 18:5</a>",
      "comment": "The man's obedience to the king recalls the duty to obey legitimate authority, a core theme in Christian discipleship."
    },
    {
      "pk": 10018013,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 13,
      "text": "'Otherwise, if I had acted treacherously against his life, there is nothing hidden from the king. You yourself would have kept away from me.'",
      "links": "<a href='/AIV/10/14/33'>2 Sam. 14:33</a>",
      "comment": "Emphasizes accountability before the king, reminding us of our responsibility before God, who knows the heart (cf. Ps. 139:1-4)."
    },
    {
      "pk": 10018014,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 14,
      "text": "Then Joab said, 'I will not waste time like this with you.' So he took three darts in his hand and thrust them into Absalom’s heart while he was still alive in the oak tree.",
      "links": "<a href='/AIV/7/4/21'>Judg. 4:21</a>",
      "comment": "Threefold piercing echoes judicial completion; reminiscent of other judgments in Scripture. Compare the nails at crucifixion (cf. John 19:34), though Christ’s suffering is for salvation."
    },
    {
      "pk": 10018015,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 15,
      "text": "And ten young men, Joab’s armor-bearers, surrounded Absalom and struck and killed him.",
      "links": "<a href='/AIV/7/9/54'>Judg. 9:54</a>",
      "comment": "Collective action of the young men underlines the confirmation of the judgment. Ten, a number of fullness, often symbolizes completion in Scripture."
    },
    {
      "pk": 10018016,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 16,
      "text": "Then Joab blew the trumpet, and the troops stopped pursuing Israel, for Joab held them back.",
      "links": "<a href='/AIV/7/7/22'>Judg. 7:22</a>; <a href='/AIV/10/2/28'>2 Sam. 2:28</a>",
      "comment": "Joab’s authority to end the battle shines light on ordered leadership within God’s people, pointing to the principle of governance in the church."
    },
    {
      "pk": 10018017,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 17,
      "text": "They took Absalom, threw him into a large pit in the forest, and piled a very great heap of stones over him. And all Israel fled, each to his own home.",
      "links": "<a href='/AIV/6/7/26'>Josh. 7:26</a>; <a href='/AIV/7/9/5'>Judg. 9:5</a>",
      "comment": "Absalom’s burial under stones parallels punishments for serious crimes in the Law. This fate separates him from communal burial, reflecting the consequences of rebellion."
    },
    {
      "pk": 10018018,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 18,
      "text": "Now Absalom in his lifetime had set up for himself a pillar which is in the King’s Valley. For he said, 'I have no son to keep my name in remembrance.' He called the pillar after his own name, and it is called Absalom’s Monument to this day.",
      "links": "<a href='/AIV/1/35/14'>Gen. 35:14</a>",
      "comment": "Absalom’s attempt to perpetuate his memory shows human pride. Compare with the legacy given by God, rather than self-made remembrance (cf. Gen. 12:2)."
    },
    {
      "pk": 10018019,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 19,
      "text": "Then Ahimaaz the son of Zadok said, 'Let me run and carry news to the king that the LORD has delivered him from his enemies.'",
      "links": "<a href='/AIV/10/15/36'>2 Sam. 15:36</a>",
      "comment": "Ahimaaz’s eagerness to bring good news reflects the role of messengers in salvation history. Consider parallels with messengers announcing Christ’s victory."
    },
    {
      "pk": 10018020,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 20,
      "text": "Joab said to him, 'You shall not carry news today, but you shall carry news another day. Today you shall not do so, because the king’s son is dead.'",
      "links": "<a href='/AIV/10/8/10'>2 Sam. 8:10</a>",
      "comment": "Joab restrains Ahimaaz due to the sensitive news. The timing and content of the message matter greatly—a principle seen in the wisdom of the apostles."
    },
    {
      "pk": 10018021,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 21,
      "text": "Then Joab said to the Cushite, 'Go, tell the king what you have seen.' So the Cushite bowed before Joab and ran.",
      "links": "<a href='/AIV/10/15/21'>2 Sam. 15:21</a>",
      "comment": "The Cushite’s mission mirrors the inclusion of foreigners in God’s plan, like Cornelius in Acts 10, hinting at universal scope of salvation."
    },
    {
      "pk": 10018022,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 22,
      "text": "Ahimaaz the son of Zadok said again to Joab, 'Whatever happens, let me also run after the Cushite.' Joab said, 'Why do you want to run, my son, seeing you will not bear good news?'",
      "links": "<a href='/AIV/10/17/17'>2 Sam. 17:17</a>",
      "comment": "Ahimaaz’s desire to serve reveals the zeal for bringing news, even at the risk of bringing hard truths, paralleling the obedience of disciples."
    },
    {
      "pk": 10018023,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 23,
      "text": "'Come what may, I will run.' So he said to him, 'Run.' Then Ahimaaz ran by the way of the plain and outran the Cushite.",
      "links": "<a href='/AIV/10/15/36'>2 Sam. 15:36</a>",
      "comment": "Outrunning the Cushite portrays the passion of the gospel messengers, courageously carrying God’s message."
    },
    {
      "pk": 10018024,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 24,
      "text": "Now David was sitting between the two gates. And the watchman went up to the roof of the gate by the wall and looked out, and saw a man running alone.",
      "links": "<a href='/AIV/10/13/34'>2 Sam. 13:34</a>",
      "comment": "The king’s anticipation evokes the watching for news of salvation. Compare with parable of the prodigal son, whose father eagerly awaits news (Luke 15:20)."
    },
    {
      "pk": 10018025,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 25,
      "text": "The watchman called out and told the king. The king said, 'If he is alone, there is news in his mouth.' As he drew nearer and came closer,",
      "links": "<a href='/AIV/10/15/28'>2 Sam. 15:28</a>",
      "comment": "A lone runner is recognized as a messenger. This anticipation for good news echoes Isaiah’s proclamation: 'How beautiful are the feet of those who bring good news!' (Isa. 52:7; Rom. 10:15)."
    },
    {
      "pk": 10018026,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 26,
      "text": "the watchman saw another man running. The watchman called down to the gatekeeper and said, 'Look, another man is running alone.' The king said, 'He also brings news.'",
      "links": "<a href='/AIV/10/15/36'>2 Sam. 15:36</a>",
      "comment": "Multiple messengers symbolize the abundance of testimony to truth, prefiguring New Testament apostolic witness."
    },
    {
      "pk": 10018027,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 27,
      "text": "And the watchman said, 'I think the running of the first is like the running of Ahimaaz the son of Zadok.' The king said, 'He is a good man, and comes with good news.'",
      "links": "<a href='/AIV/10/17/20'>2 Sam. 17:20</a>",
      "comment": "David’s trust in Ahimaaz as a reliable witness highlights the key role of faithful ministers in sharing the message."
    },
    {
      "pk": 10018028,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 28,
      "text": "Then Ahimaaz called out to the king, 'All is well.' He bowed before the king with his face to the earth and said, 'Blessed be the LORD your God, who has delivered up the men who raised their hand against my lord the king.'",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>",
      "comment": "Announcement of deliverance and bowing in reverence to the king presents praise as worship, pointing towards liturgical worship and thanksgiving."
    },
    {
      "pk": 10018029,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 29,
      "text": "The king said, 'Is it well with the young man Absalom?' Ahimaaz answered, 'When Joab sent the king's servant and me your servant, I saw a great commotion, but I do not know what it was.'",
      "links": "<a href='/AIV/10/18/5'>2 Sam. 18:5</a>",
      "comment": "Ahimaaz withholds the full truth, showing human hesitation to deliver painful news. This situation underscores the complexity of obedience to authority and truthfulness."
    },
    {
      "pk": 10018030,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 30,
      "text": "The king said, 'Turn aside and stand here.' So he turned aside and stood still.",
      "links": "<a href='/AIV/10/13/38'>2 Sam. 13:38</a>",
      "comment": "David’s command to Ahimaaz reveals the respect for protocol and order, anticipating the careful management of messages in church leadership."
    },
    {
      "pk": 10018031,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 31,
      "text": "And behold, the Cushite came, and the Cushite said, 'Good news for my lord the king! For the LORD has delivered you this day from the hand of all who rose up against you.'",
      "links": "<a href='/AIV/19/124/2'>Ps. 124:2</a>",
      "comment": "Repetition of deliverance highlights divine intervention. Fulfills OT theme of the LORD saving His anointed, as in Psalms."
    },
    {
      "pk": 10018032,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 32,
      "text": "The king said to the Cushite, 'Is it well with the young man Absalom?' The Cushite answered, 'May the enemies of my lord the king and all who rise against you to do harm be like that young man.'",
      "links": "<a href='/AIV/10/16/12'>2 Sam. 16:12</a>",
      "comment": "The Cushite carefully relates the outcome, underscoring the sorrow of judgment. God’s justice and David’s pain highlight the cost of rebellion."
    },
    {
      "pk": 10018033,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 18,
      "verse": 33,
      "text": "Then the king trembled. He went up to the chamber over the gate and wept. As he went, he said, 'O my son Absalom! My son, my son Absalom! If only I had died instead of you—O Absalom, my son, my son!'",
      "links": "<a href='/AIV/10/12/23'>2 Sam. 12:23</a>; <a href='/AIV/19/22/1'>Ps. 22:1</a>",
      "comment": "David’s lament displays deep paternal love and grief, prefiguring the sacrificial love Christ shows in longing to bear our punishment. His repeated cry echoes the heart of God, foreshadowing Christ’s offering of Himself for sinners."
    }
  ],
  "translatedAt": "2025-12-24T03:22:04.471Z"
}