{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 11,
  "verses": [
    {
      "pk": 10011001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 1,
      "text": "At the turn of the year, at the time when kings go out to war, David sent Joab, his servants, and all Israel. They destroyed the Ammonites and besieged Rabbah. But David remained in Jerusalem.",
      "links": "<a href='/AIV/13/20/1'>1 Chron. 20:1</a>",
      "comment": "This verse sets the stage for what follows by showing David's absence from the battlefield, which is significant since kings usually led in war. David's staying behind reveals a moment of spiritual laxity, a reminder that spiritual vigilance is crucial."
    },
    {
      "pk": 10011002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 2,
      "text": "Late one afternoon, David got up from his bed and walked on the roof of the king’s house. From the roof he saw a woman bathing. The woman was very beautiful.",
      "links": "<a href='/AIV/19/51/1-4'>Ps. 51:1-4</a>",
      "comment": "David’s gaze on Bathsheba marks the beginning of temptation. This underlines the teaching that even great leaders can fall to sin if they allow themselves to be idle and avoid discipline."
    },
    {
      "pk": 10011003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 3,
      "text": "David sent and inquired about the woman. Someone said, 'Isn’t this Bathsheba, the daughter of Eliam, the wife of Uriah the Hittite?'",
      "links": "<a href='/AIV/13/3/5'>1 Chron. 3:5</a>; <a href='/AIV/10/23/34-39'>2 Sam. 23:34-39</a>",
      "comment": "Bathsheba’s identity is emphasized, with her familial and marital status stated plainly. This underscores the gravity of David’s actions since he knows she is married. The moral law is at stake."
    },
    {
      "pk": 10011004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 4,
      "text": "So David sent messengers and took her. She came to him, and he lay with her. (She had just purified herself from her uncleanness.) Then she returned to her house.",
      "links": "<a href='/AIV/03/15/19-30'>Lev. 15:19-30</a>",
      "comment": "The text notes her ritual purification, highlighting both moral and ceremonial law. David’s deliberate action reveals a willful transgression of God’s commandments."
    },
    {
      "pk": 10011005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 5,
      "text": "The woman conceived. She sent word to David, saying, 'I am pregnant.'",
      "links": "<a href='/AIV/04/32/23'>Num. 32:23</a>",
      "comment": "Sin often leads to further consequences. Bathsheba’s message forces David to confront his actions. The text does not excuse David but describes the natural outworkings of sin."
    },
    {
      "pk": 10011006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 6,
      "text": "So David sent word to Joab, 'Send me Uriah the Hittite.' Joab sent Uriah to David.",
      "links": "<a href='/AIV/10/23/39'>2 Sam. 23:39</a>",
      "comment": "Here begins David’s attempt to cover up his sin, showing how one transgression can foster deeper deception."
    },
    {
      "pk": 10011007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 7,
      "text": "When Uriah came to him, David asked about Joab, the army, and how the war was going.",
      "links": "<a href='/AIV/10/20/1-22'>2 Sam. 20:1-22</a>",
      "comment": "David’s feigned concern for the battle covers his real intent. The duplicity echoes the dangers of hidden sin and hypocrisy."
    },
    {
      "pk": 10011008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 8,
      "text": "Then David said to Uriah, 'Go down to your house and wash your feet.' So Uriah left the king’s house, and a gift from the king was sent after him.",
      "links": "<a href='/AIV/01/18/4'>Gen. 18:4</a>",
      "comment": "Washing feet is an idiom for resting at home. David’s gift is an attempt to induce Uriah to visit his wife, hoping to disguise Bathsheba’s pregnancy."
    },
    {
      "pk": 10011009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 9,
      "text": "But Uriah slept at the entrance of the king's house with all the servants of his master and did not go down to his house.",
      "links": "<a href='/AIV/10/15/21'>2 Sam. 15:21</a>",
      "comment": "Uriah’s loyalty and discipline is in stark contrast to David’s weakness. He models virtue under trial—an example reminiscent of true discipleship."
    },
    {
      "pk": 10011010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 10,
      "text": "When they told David, 'Uriah did not go down to his house,' David said to Uriah, 'Haven’t you come from a journey? Why didn’t you go to your house?'",
      "links": "<a href='/AIV/19/32/2'>Ps. 32:2</a>",
      "comment": "David is surprised at Uriah’s integrity, and this further foils his plan. The passage illustrates how unrighteousness cannot be hidden from God."
    },
    {
      "pk": 10011011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 11,
      "text": "Uriah answered David, 'The ark and Israel and Judah stay in tents, and my master Joab and your servants are camped in the open field. Should I then go to my house to eat and drink and lie with my wife? As you live, and as your soul lives, I will not do this thing.'",
      "links": "<a href='/AIV/09/4/3-11'>1 Sam. 4:3-11</a>",
      "comment": "Uriah’s commitment reflects a reverence for the presence of God indicated by the ark, and his words echo the necessity of sacrifice in faith."
    },
    {
      "pk": 10011012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 12,
      "text": "Then David said to Uriah, 'Stay here today also, and tomorrow I will send you back.' So Uriah remained in Jerusalem that day and the next.",
      "links": "<a href='/AIV/10/12/1'>2 Sam. 12:1</a>",
      "comment": "Despite Uriah’s uprightness, David increases his duplicity. The depth of David’s sin continues to grow, showing the dangers of a hardened heart."
    },
    {
      "pk": 10011013,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 13,
      "text": "David invited him, and he ate and drank in his presence and made him drunk. But in the evening, Uriah went out to lie on his bed with the servants of his master; he did not go down to his house.",
      "links": "<a href='/AIV/19/69/21'>Ps. 69:21</a>",
      "comment": "Even while under the influence, Uriah resists the temptation to abandon his duty. This intensifies the tragedy of David’s plotting."
    },
    {
      "pk": 10011014,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 14,
      "text": "In the morning, David wrote a letter to Joab and sent it by the hand of Uriah.",
      "links": "<a href='/AIV/10/12/9'>2 Sam. 12:9</a>",
      "comment": "David’s willingness to use Uriah to deliver his own death warrant exposes the hardening effect of sin and the depth of human depravity."
    },
    {
      "pk": 10011015,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 15,
      "text": "In the letter he wrote, 'Set Uriah in the front line where the fighting is fiercest, then draw back from him, so that he may be struck down and die.'",
      "links": "<a href='/AIV/10/12/9'>2 Sam. 12:9</a>; <a href='/AIV/02/20/13'>Ex. 20:13</a>",
      "comment": "David commands murder by proxy, violating both personal and divine law. Sin grows worse when not confessed."
    },
    {
      "pk": 10011016,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 16,
      "text": "So as Joab besieged the city, he assigned Uriah to the place where he knew there were valiant men.",
      "links": "<a href='/AIV/10/23/8'>2 Sam. 23:8</a>",
      "comment": "Joab follows the king’s orders without protest, a picture of hierarchical obedience with tragic consequences. The dangers of misplaced obedience are warned against elsewhere in Scripture."
    },
    {
      "pk": 10011017,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 17,
      "text": "When the men of the city came out and fought with Joab, some of David’s servants fell. Uriah the Hittite also died.",
      "links": "<a href='/AIV/10/12/9'>2 Sam. 12:9</a>",
      "comment": "David's order leads to the deaths of the innocent, showing how sin affects more than just the individual sinner."
    },
    {
      "pk": 10011018,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 18,
      "text": "Then Joab sent and reported to David all the things concerning the war.",
      "links": "<a href='/AIV/10/12/26-28'>2 Sam. 12:26-28</a>",
      "comment": "Joab notifies David of the outcome, part of the chain of deception and misplaced priorities evident in leadership gone astray."
    },
    {
      "pk": 10011019,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 19,
      "text": "He instructed the messenger, 'When you have finished telling the king all about the battle,",
      "links": "<a href='/AIV/10/18/19-32'>2 Sam. 18:19-32</a>",
      "comment": "Joab anticipates David may be displeased, displaying the delicate relationship between kings and their commanders."
    },
    {
      "pk": 10011020,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 20,
      "text": "if the king’s anger rises and he says to you, ‘Why did you go so near to the city to fight? Didn’t you know they would shoot from the wall?",
      "links": "<a href='/AIV/07/9/53-54'>Judg. 9:53-54</a>",
      "comment": "War tactics are brought up—a warning about prudence, and a subtle hint to David's misplaced anger given his covert objectives."
    },
    {
      "pk": 10011021,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 21,
      "text": "Who killed Abimelech the son of Jerubbesheth? Didn’t a woman throw an upper millstone on him from the wall so that he died in Thebez? Why did you go so near the wall?’ Then you shall say, ‘Your servant Uriah the Hittite is also dead.’”",
      "links": "<a href='/AIV/07/9/50-54'>Judg. 9:50-54</a>",
      "comment": "The comparison to Abimelech’s death shows Joab’s expectation of criticism, yet he knows that Uriah’s death is David’s true concern."
    },
    {
      "pk": 10011022,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 22,
      "text": "So the messenger set out, and he came and told David all that Joab had sent him to report.",
      "links": "<a href='/AIV/10/12/26-28'>2 Sam. 12:26-28</a>",
      "comment": "The messenger relays all the battlefield events faithfully, showing the obedience and trust embedded in royal service."
    },
    {
      "pk": 10011023,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 23,
      "text": "The messenger said to David, 'The men prevailed against us and came out to us in the field, but we drove them back to the entrance of the gate.",
      "links": "",
      "comment": "The focus is on the larger battle report, providing cover for the true purpose of Joab’s actions, which was the murder of Uriah."
    },
    {
      "pk": 10011024,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 24,
      "text": "Then the archers shot at your servants from the wall, and some of the king’s servants died. Your servant Uriah the Hittite is also dead.'",
      "links": "<a href='/AIV/10/12/9'>2 Sam. 12:9</a>",
      "comment": "Uriah's death, reported casually, illustrates how Joab follows David’s intent but at the cost of innocent blood. The shedding of innocent blood is seen as an offense before God."
    },
    {
      "pk": 10011025,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 25,
      "text": "David said to the messenger, 'Say this to Joab: Don’t let this matter trouble you, for the sword devours one as well as another. Strengthen your attack against the city and overthrow it.' So encourage him.",
      "links": "<a href='/AIV/10/12/10'>2 Sam. 12:10</a>",
      "comment": "David tries to minimize the moral weight of Uriah’s death. This rationalization is common with kingly power unchecked—a spiritual reality also addressed by Christ, who calls for inner transformation as well as outward restitution."
    },
    {
      "pk": 10011026,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 26,
      "text": "When Uriah’s wife heard that her husband was dead, she mourned for him.",
      "links": "<a href='/AIV/19/51/1-19'>Ps. 51:1-19</a>",
      "comment": "Bathsheba’s mourning obeys the law regarding mourning for the dead. True contrition and mourning are both necessary to prepare for healing and forgiveness."
    },
    {
      "pk": 10011027,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 11,
      "verse": 27,
      "text": "When the time of mourning was over, David sent and brought her to his house. She became his wife and bore him a son. But what David had done displeased the LORD.",
      "links": "<a href='/AIV/10/12/1-15'>2 Sam. 12:1-15</a>; <a href='/AIV/19/51/1-19'>Ps. 51:1-19</a>",
      "comment": "Although David’s actions were outwardly finalized, God Himself remains the final judge. This prefigures the New Testament call to repentance and the role of spiritual authority, confession, and penance for restoration (cf. <a href='/AIV/43/20/22-23'>John 20:22-23</a>). The consequences of sin endured but also forgiveness available if sincerely sought."
    }
  ],
  "translatedAt": "2025-12-24T03:16:38.654Z"
}