{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 20,
  "verses": [
    {
      "pk": 10020001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 1,
      "text": "Now there happened to be a worthless man there, whose name was Sheba, the son of Bichri, a Benjaminite. He blew the trumpet and said, \"We have no portion in David, nor inheritance in the son of Jesse; every man to his tents, O Israel!\"",
      "links": "<a href='/AIV/11/12/16'>1 Kings 12:16</a>; <a href='/AIV/07/8/35'>Judg. 8:35</a>",
      "comment": "Sheba’s rebellion echoes Israel’s later division from the house of David (cf. 1 Kings 12:16). Early Protestant and traditional interpretations see this as foreshadowing schism and the danger of breaking unity with the God-ordained king. David, the chosen king, prefigures the greater Son of David, Christ, the true and everlasting King (cf. Luke 1:32-33)."
    },
    {
      "pk": 10020002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 2,
      "text": "So all the men of Israel withdrew from David, following Sheba the son of Bichri. But the men of Judah stuck with their king, from the Jordan to Jerusalem.",
      "links": "<a href='/AIV/10/19/41-43'>2 Sam. 19:41-43</a>; <a href='/AIV/11/12/20'>1 Kings 12:20</a>",
      "comment": "Judah’s loyalty mirrors the faithful remnant theme. The division anticipates later splits, with implications for perseverance in the true faith and unity under the legitimate authority. The 'king' is not only a political leader but also a spiritual figurehead in Israel."
    },
    {
      "pk": 10020003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 3,
      "text": "When David came to his house at Jerusalem, the king took the ten concubines whom he had left to care for the house, and put them in custody. He provided for them, but did not go in to them. So they were shut away until the day of their death, living as widows.",
      "links": "<a href='/AIV/10/16/21-22'>2 Sam. 16:21-22</a>",
      "comment": "David’s treatment of the concubines reflects both compassion and consequence after Absalom’s rebellion (2 Sam. 16:21-22). Their perpetual widowhood marks the tragic fallout of past sin, showing the intertwining of personal and communal purity with royal integrity."
    },
    {
      "pk": 10020004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 4,
      "text": "Then the king said to Amasa, \"Call the men of Judah together within three days, and be here yourself.\"",
      "links": "<a href='/AIV/10/19/13'>2 Sam. 19:13</a>",
      "comment": "David's command to Amasa—freshly appointed as commander—demonstrates his intent to unify and restore peace. Failure of leadership or timeliness in the Lord’s work often leads to division or disaster."
    },
    {
      "pk": 10020005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 5,
      "text": "So Amasa went to assemble Judah, but he delayed longer than the set time which David had appointed him.",
      "links": "<a href='/AIV/10/19/13'>2 Sam. 19:13</a>; <a href='/AIV/07/5/23-24'>Judg. 5:23-24</a>",
      "comment": "Amasa’s delay hints at human limitations and the need for prompt obedience to authority, prefiguring the importance of timely response in the service of God’s kingdom."
    },
    {
      "pk": 10020006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 6,
      "text": "David said to Abishai, \"Now Sheba the son of Bichri will do us more harm than Absalom. Take your lord’s servants and pursue him, or he will find fortified cities and escape us.\"",
      "links": "<a href='/AIV/10/15/14'>2 Sam. 15:14</a>",
      "comment": "David’s urgency shows the danger of rebellion spreading. Notice how quick action is always essential in preserving unity and order in the people of God."
    },
    {
      "pk": 10020007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 7,
      "text": "So Joab’s men, the Cherethites, the Pelethites, and all the mighty men went out after Abishai; they left Jerusalem to pursue Sheba the son of Bichri.",
      "links": "<a href='/AIV/10/8/18'>2 Sam. 8:18</a>; <a href='/AIV/10/15/18'>2 Sam. 15:18</a>",
      "comment": "Joab’s forces include foreign mercenaries, signifying the inclusiveness of God’s army, but always under the legitimate king’s authority."
    },
    {
      "pk": 10020008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 8,
      "text": "When they were at the great stone which is in Gibeon, Amasa came to meet them. Joab was wearing his military garment, and over it was a belt with a sword in its sheath at his side. As he went forward, the sword fell out.",
      "links": "<a href='/AIV/06/9/3'>Josh. 9:3</a>; <a href='/AIV/09/17/39'>1 Sam. 17:39</a>",
      "comment": "Joab’s calculated approach with Amasa reveals the darker side of political power and betrayal, a recurring theme in fallen human leadership."
    },
    {
      "pk": 10020009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 9,
      "text": "Joab said to Amasa, \"Is it well with you, my brother?\" Joab took Amasa by the beard with his right hand to kiss him.",
      "links": "<a href='/AIV/10/3/27'>2 Sam. 3:27</a>; <a href='/AIV/41/14/45'>Mark 14:45</a>",
      "comment": "Joab’s kiss, a sign of friendship, becomes an act of treachery—just as Judas later betrays Christ with a kiss. This highlights the need for caution even among leaders and the call to faithfulness in every relationship."
    },
    {
      "pk": 10020010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 10,
      "text": "But Amasa did not notice the sword in Joab’s hand. So Joab struck him in the stomach with it and spilled his entrails to the ground without needing to strike again, and he died. Then Joab and Abishai his brother pursued Sheba the son of Bichri.",
      "links": "<a href='/AIV/10/3/27'>2 Sam. 3:27</a>; <a href='/AIV/10/2/23'>2 Sam. 2:23</a>",
      "comment": "The recurring violence among David’s commanders warns against ambition and emphasizes the cost when unity is threatened. Ultimate unity and peace is only found under the new and eternal King, not through worldly power."
    },
    {
      "pk": 10020011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 11,
      "text": "And one of Joab’s young men stood by Amasa and said, \"Whoever favors Joab, and whoever is for David, let him follow Joab!\"",
      "links": "<a href='/AIV/10/18/2'>2 Sam. 18:2</a>",
      "comment": "Allegiance to the rightful king is marked by following the legitimate leadership. The drama prefigures the necessity for fidelity to David's line."
    },
    {
      "pk": 10020012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 12,
      "text": "Amasa lay wallowing in his blood in the middle of the highway. When the man saw that all the people stood still, he removed Amasa from the road into the field, and threw a garment over him, because everyone who came by saw him and stopped.",
      "links": "<a href='/AIV/10/19/13'>2 Sam. 19:13</a>",
      "comment": "Removal of Amasa’s body is a practical act, yet points spiritually to the removal of scandal or division among God’s people to restore order and mission."
    },
    {
      "pk": 10020013,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 13,
      "text": "As soon as he was removed out of the road, all the people went on after Joab to pursue Sheba the son of Bichri.",
      "links": "<a href='/AIV/10/20/12'>2 Sam. 20:12</a>",
      "comment": "The progress of the army resumes once the obstacle—division or scandal—is removed, foreshadowing the necessity of having unity restored for God’s purposes to advance."
    },
    {
      "pk": 10020014,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 14,
      "text": "Sheba passed through all the tribes of Israel to Abel of Beth-maacah, and all the Bichrites assembled and followed him in.",
      "links": "<a href='/AIV/10/10/8'>2 Sam. 10:8</a>",
      "comment": "Sheba’s support grew among his clan, illuminating the danger of rebellious factions within God’s chosen people."
    },
    {
      "pk": 10020015,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 15,
      "text": "All the people who were with Joab came and besieged him in Abel of Beth-maacah. They cast up a mound against the city, and stood against the rampart. All the men with Joab battered the wall, trying to bring it down.",
      "links": "<a href='/AIV/10/11/20'>2 Sam. 11:20</a>; <a href='/AIV/06/6/5'>Josh. 6:5</a>",
      "comment": "The siege imagery recalls Israel's earlier conflicts and the divine justice that falls upon those who rebel against God’s anointed leader."
    },
    {
      "pk": 10020016,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 16,
      "text": "Then a wise woman called from the city, \"Listen! Listen! Tell Joab, ‘Come here, so I may speak to you.’\"",
      "links": "<a href='/AIV/10/14/2'>2 Sam. 14:2</a>",
      "comment": "The intervention by a wise woman aligns with the frequent biblical motif of unexpected deliverers. Wisdom’s role in peacemaking and the protection of the community are key spiritual themes."
    },
    {
      "pk": 10020017,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 17,
      "text": "He came near, and the woman said, \"Are you Joab?\" He answered, \"I am.\" She said to him, \"Hear the words of your servant.\" And he answered, \"I am listening.\"",
      "links": "<a href='/AIV/10/14/2-20'>2 Sam. 14:2-20</a>",
      "comment": "Dialogue and attentiveness between the wise and those in authority is presented as God’s channel for peace and resolution."
    },
    {
      "pk": 10020018,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 18,
      "text": "She said, \"They used to say in former times, ‘Let them ask counsel at Abel,’ and so they settled a matter.\"",
      "links": "<a href='/AIV/07/5/9-11'>Judg. 5:9-11</a>",
      "comment": "Abel was renowned for wisdom and peaceful resolution—mirroring the need for tradition, wise counsel, and continuous consultation in spiritual matters. This speaks to the idea of seeking lasting solutions guided by tradition and community wisdom."
    },
    {
      "pk": 10020019,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 19,
      "text": "\"I am one of those who are peaceable and faithful in Israel. You seek to destroy a city which is a mother in Israel. Why would you swallow up the heritage of the LORD?\"",
      "links": "<a href='/AIV/05/32/9'>Deut. 32:9</a>; <a href='/AIV/19/127/3'>Ps. 127:3</a>",
      "comment": "Describing the city as a 'mother' points to the important concept of spiritual motherhood and the value of inheritance among God’s people—a biblical echo underlying the church’s maternal dimension."
    },
    {
      "pk": 10020020,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 20,
      "text": "Joab answered, \"Far be it from me, far be it, that I should swallow up or destroy!\"",
      "links": "<a href='/AIV/09/20/20'>1 Sam. 20:20</a>",
      "comment": "Joab affirms that his campaign is not against the innocent or the just, reflecting God’s desire for mercy and restraint—even in judgment."
    },
    {
      "pk": 10020021,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 21,
      "text": "\"That is not the case. But a man of the hill country of Ephraim, named Sheba the son of Bichri, has lifted up his hand against King David. Give him up alone, and I will withdraw from the city.\" The woman said to Joab, \"Look, his head shall be thrown to you over the wall.\"",
      "links": "<a href='/AIV/10/20/1'>2 Sam. 20:1</a>",
      "comment": "Delivering Sheba to preserve the city typifies the principle of rooting out division to save the community—a spiritual dynamic seen throughout redemptive history."
    },
    {
      "pk": 10020022,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 22,
      "text": "Then the woman went to all the people in her wisdom. They cut off the head of Sheba the son of Bichri and threw it to Joab. So he blew the trumpet, and they dispersed from the city, each to his home. Joab returned to Jerusalem to the king.",
      "links": "<a href='/AIV/07/9/53-57'>Judg. 9:53-57</a>",
      "comment": "Wisdom and decisive action resolve the crisis. The imagery of powerful intercession leading to salvation prefigures key New Testament structures of mediation and authority in the church."
    },
    {
      "pk": 10020023,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 23,
      "text": "Now Joab was in command of all the army of Israel; Benaiah the son of Jehoiada was over the Cherethites and the Pelethites;",
      "links": "<a href='/AIV/10/8/16-18'>2 Sam. 8:16-18</a>; <a href='/AIV/11/2/35'>1 Kings 2:35</a>",
      "comment": "Joab’s return to command and Benaiah’s delegated authority illustrate the orderly structure of leadership—which carries forward into New Testament structures and the necessity for hierarchy in the people of God."
    },
    {
      "pk": 10020024,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 24,
      "text": "Adoram was in charge of forced labor, Jehoshaphat the son of Ahilud was the recorder,",
      "links": "<a href='/AIV/11/4/6'>1 Kings 4:6</a>",
      "comment": "These administrative offices point to the well-ordered nature of God’s people—a model for the organization of community life."
    },
    {
      "pk": 10020025,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 25,
      "text": "Sheva was scribe, Zadok and Abiathar were priests,",
      "links": "<a href='/AIV/10/8/17'>2 Sam. 8:17</a>",
      "comment": "The priests’ presence in the king’s court demonstrates the inseparability of liturgical life and governance, prefiguring the harmony between spiritual and temporal authority anticipated in Christ’s kingdom."
    },
    {
      "pk": 10020026,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 20,
      "verse": 26,
      "text": "And Ira the Jairite was also David’s chief minister.",
      "links": "<a href='/AIV/10/8/18'>2 Sam. 8:18</a>",
      "comment": "Ira’s role as a chief minister confirms the need for devoted, trustworthy service to the king, and by extension, to God’s people. This anticipates the principle of hierarchical service and order within the broader context of God’s everlasting kingdom."
    }
  ],
  "translatedAt": "2025-12-24T03:23:41.868Z"
}