{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 2,
  "verses": [
    {
      "pk": 10002001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 1,
      "text": "After this, David inquired of the LORD, 'Should I go up to one of the cities of Judah?' The LORD said to him, 'Go up.' David asked, 'To which shall I go up?' He answered, 'To Hebron.'",
      "links": "<a href='/AIV/09/23/2'>1 Sam. 23:2</a>; <a href='/AIV/09/30/8'>1 Sam. 30:8</a>; <a href='/AIV/13/11/1'>1 Chron. 11:1</a>",
      "comment": "David seeks divine guidance before acting, showing the importance of God’s direction for leadership. Compare with David’s earlier inquiries. Spiritually, this models trust in ordained authority (cf. Heb. 13:7)."
    },
    {
      "pk": 10002002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 2,
      "text": "So David went up there, with his two wives—Ahinoam of Jezreel and Abigail, the widow of Nabal of Carmel.",
      "links": "<a href='/AIV/09/25/42-43'>1 Sam. 25:42-43</a>; <a href='/AIV/09/30/5'>1 Sam. 30:5</a>",
      "comment": "David’s family accompanies him, showing that God’s call often involves those close to us. Abigail’s history provides an example of faithfulness and redemption (cf. Ruth 3)."
    },
    {
      "pk": 10002003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 3,
      "text": "David also brought up his men who were with him, each with his household, and they settled in the towns around Hebron.",
      "links": "<a href='/AIV/09/27/3'>1 Sam. 27:3</a>; <a href='/AIV/13/11/3'>1 Chron. 11:3</a>",
      "comment": "David’s followers remain loyal, illustrating the concept of the gathered flock under a shepherd. This foreshadows the unity of believers under rightful leadership (cf. John 10:16)."
    },
    {
      "pk": 10002004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 4,
      "text": "Then the men of Judah came, and there they anointed David king over the house of Judah. They told David, 'The men of Jabesh-gilead are the ones who buried Saul.'",
      "links": "<a href='/AIV/09/10/1'>1 Sam. 10:1</a>; <a href='/AIV/09/16/13'>1 Sam. 16:13</a>",
      "comment": "David’s anointing by Judah shows legitimate succession. The act of anointing connects to the sacramental concept of being set apart by God's authority (cf. 1 Sam. 16:13; Luke 4:18)."
    },
    {
      "pk": 10002005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 5,
      "text": "So David sent messengers to the men of Jabesh-gilead and said to them, 'May you be blessed by the LORD, because you showed this loyalty to Saul your lord and buried him.'",
      "links": "<a href='/AIV/09/31/11-13'>1 Sam. 31:11-13</a>",
      "comment": "David honors loyalty to the rightful king, emphasizing respect for God-given authority and the reward for faithfulness (cf. Matt. 25:21)."
    },
    {
      "pk": 10002006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 6,
      "text": "Now may the LORD show lovingkindness and faithfulness to you. And I, too, will show you goodness because you have done this thing.",
      "links": "<a href='/AIV/19/18/25'>Ps. 18:25</a>; <a href='/AIV/40/5/7'>Matt. 5:7</a>",
      "comment": "The reward for mercy reflects the spiritual principle of blessing upon those who act with compassion. This points to Christ’s teaching on mercy."
    },
    {
      "pk": 10002007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 7,
      "text": "Now, let your hands be strong and be brave, for your master Saul is dead, and the house of Judah has anointed me king over them.'",
      "links": "<a href='/AIV/06/1/9'>Josh. 1:9</a>",
      "comment": "David encourages strength and loyalty, tying rightful authority to God's choice. The anointing as king reflects the typology of Christ, the anointed King."
    },
    {
      "pk": 10002008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 8,
      "text": "But Abner son of Ner, commander of Saul’s army, took Ish-bosheth, the son of Saul, and brought him over to Mahanaim.",
      "links": "<a href='/AIV/13/8/33'>1 Chron. 8:33</a>",
      "comment": "Abner’s opposition sets the stage for conflict. Mahanaim ('two camps') hints at division—paralleling the need for true unity in God’s people (cf. John 17:21)."
    },
    {
      "pk": 10002009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 9,
      "text": "He made him king over Gilead, over the Ashurites, over Jezreel, Ephraim, Benjamin, and all Israel.",
      "links": "<a href='/AIV/09/13/1-2'>1 Sam. 13:1-2</a>",
      "comment": "Ish-bosheth is made king by human decision, not divine appointment, stressing the distinction between human authority and God-ordained leadership."
    },
    {
      "pk": 10002010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 10,
      "text": "Ish-bosheth, Saul’s son, was forty years old when he began to reign over Israel, and he reigned two years. But the house of Judah followed David.",
      "links": "<a href='/AIV/13/8/33'>1 Chron. 8:33</a>; <a href='/AIV/13/12/23'>1 Chron. 12:23</a>",
      "comment": "This split signifies division within God’s people. Unity under rightful leadership is repeatedly shown as God’s desire for his people (cf. Ezek. 37:24)."
    },
    {
      "pk": 10002011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 11,
      "text": "The time that David was king in Hebron over the house of Judah was seven years and six months.",
      "links": "<a href='/AIV/13/29/27'>1 Chron. 29:27</a>",
      "comment": "The number seven echoes divine completeness. David’s reign from Hebron prefigures Christ’s patient establishment of his kingdom."
    },
    {
      "pk": 10002012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 12,
      "text": "Abner son of Ner and the servants of Ish-bosheth son of Saul went out from Mahanaim to Gibeon.",
      "links": "<a href='/AIV/09/10/26'>1 Sam. 10:26</a>",
      "comment": "The movement from Mahanaim to Gibeon marks a challenge to David’s rule, underscoring the tension between rival authorities."
    },
    {
      "pk": 10002013,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 13,
      "text": "Joab son of Zeruiah and David’s servants also went out and met them by the pool of Gibeon. They sat down, one group on one side of the pool, and the other on the opposite side.",
      "links": "<a href='/AIV/09/26/6'>1 Sam. 26:6</a>",
      "comment": "The pool of Gibeon becomes a site of decision. The confrontation reflects human divisions in contrast to the unity of God’s kingdom."
    },
    {
      "pk": 10002014,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 14,
      "text": "Abner said to Joab, 'Let the young men arise and compete before us.' Joab said, 'Let them arise.'",
      "links": "<a href='/AIV/07/20/18-34'>Judges 20:18-34</a>",
      "comment": "This suggestion for single combat recalls tribal contests for resolution, again showing the need for higher divine authority over human rivalry."
    },
    {
      "pk": 10002015,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 15,
      "text": "So they arose and counted off—twelve for Benjamin and Ish-bosheth son of Saul, and twelve from David’s servants.",
      "links": "<a href='/AIV/04/13/2-16'>Num. 13:2-16</a>",
      "comment": "The number twelve is symbolic of Israel’s tribes, later reflected in Jesus’ twelve apostles. This acts as a sign of the completeness of God’s chosen people."
    },
    {
      "pk": 10002016,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 16,
      "text": "And each one seized his opponent by the head and thrust his sword into the side of his opponent, and they fell down together. So that place in Gibeon was called Helkath-hazzurim.",
      "links": "<a href='/AIV/09/17/49-51'>1 Sam. 17:49-51</a>",
      "comment": "The mutual destruction highlights the futility of civil strife among God’s people, and the need to seek unity and peace under rightful authority."
    },
    {
      "pk": 10002017,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 17,
      "text": "The battle was very fierce that day, and Abner and the men of Israel were defeated before the servants of David.",
      "links": "<a href='/AIV/09/18/6-7'>1 Sam. 18:6-7</a>",
      "comment": "David’s army prevails, signifying divine favor for the true anointed. Spiritual discernment involves recognizing the rightful leadership God appoints."
    },
    {
      "pk": 10002018,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 18,
      "text": "The three sons of Zeruiah were there: Joab, Abishai, and Asahel. Asahel was as swift-footed as a wild gazelle.",
      "links": "<a href='/AIV/13/2/16'>1 Chron. 2:16</a>",
      "comment": "The mention of speed and family highlights the valor and natural gifts among David’s followers—echoing individual spiritual gifts meant to serve the one mission (cf. 1 Cor. 12:4-7)."
    },
    {
      "pk": 10002019,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 19,
      "text": "Asahel pursued Abner, and in going he did not turn to the right or to the left from following Abner.",
      "links": "<a href='/AIV/06/1/7'>Josh. 1:7</a>",
      "comment": "Asahel’s determination is commendable but also rash, highlighting zeal that can lead to unintended conflict—a lesson for the virtue of prudence."
    },
    {
      "pk": 10002020,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 20,
      "text": "Then Abner looked back and said, 'Is that you, Asahel?' He answered, 'It is I.'",
      "links": "",
      "comment": "Abner’s recognition reflects personal knowledge within the community, but also the tragedy that occurs when internal conflicts arise among God’s people."
    },
    {
      "pk": 10002021,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 21,
      "text": "Abner said to him, 'Turn aside to your right or to your left, and take one of the young men and take his armor.' But Asahel refused to turn aside from following him.",
      "links": "",
      "comment": "Abner’s warning reveals an attempt to avoid unnecessary bloodshed within the family of Israel, reflecting Christ’s call to reconciliation among brethren (cf. Matt. 5:24)."
    },
    {
      "pk": 10002022,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 22,
      "text": "Abner again said to Asahel, 'Turn aside from following me. Why should I strike you down? How then could I face your brother Joab?'",
      "links": "",
      "comment": "Abner’s appeal stresses the consequences of internal struggle and the responsibility to avoid harm to the greater family. This is a call for peacemaking."
    },
    {
      "pk": 10002023,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 23,
      "text": "But he refused to turn aside. So Abner struck him in the stomach with the butt of his spear, so that the spear came out his back. He fell there and died on the spot. And all who came to the place where Asahel fell and died stopped and stood still.",
      "links": "<a href='/AIV/09/4/12'>1 Sam. 4:12</a>",
      "comment": "Asahel’s death was tragic and unnecessary, a potent lesson against zeal without discernment. His death causes mourning, reminding of unity in sorrow (cf. Rom. 12:15)."
    },
    {
      "pk": 10002024,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 24,
      "text": "But Joab and Abishai pursued Abner. And when the sun was going down, they came to the hill of Ammah, east of Giah, on the road to the wilderness of Gibeon.",
      "links": "",
      "comment": "Pursuit continues into the evening, symbolic of unresolved conflict. The details show the persistence of enmity even among brethren."
    },
    {
      "pk": 10002025,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 25,
      "text": "The men of Benjamin gathered together behind Abner and formed themselves into one group. They stood on the top of a hill.",
      "links": "",
      "comment": "The gathering reflects temporary unity against a common foe, highlighting true unity’s necessity under God-chosen leadership."
    },
    {
      "pk": 10002026,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 26,
      "text": "Then Abner called to Joab and said, 'Shall the sword devour forever? Do you not know that the end will be bitter? How long before you tell the people to turn back from pursuing their brothers?'",
      "links": "",
      "comment": "Abner’s question stresses reconciliation, an Old Testament anticipation of Jesus’ teaching against fraternal conflict (cf. John 13:34)."
    },
    {
      "pk": 10002027,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 27,
      "text": "And Joab said, 'As God lives, if you had not spoken, surely the people would have continued after their brothers until morning.'",
      "links": "",
      "comment": "Joab acknowledges Abner’s call to peace, recognizing the futility of relentless contention. Leaders must heed the call for peace and unity."
    },
    {
      "pk": 10002028,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 28,
      "text": "So Joab blew the trumpet, and all the people halted and pursued Israel no more, nor did they fight any more.",
      "links": "",
      "comment": "The trumpet signals the end of battle—a turning to peace. The cessation recalls moments of divine intervention for peace, ultimately fulfilled in Christ, the Prince of Peace."
    },
    {
      "pk": 10002029,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 29,
      "text": "Abner and his men went through the Arabah all that night. They crossed the Jordan, marched all morning, and came to Mahanaim.",
      "links": "",
      "comment": "Retreat to Mahanaim signals unresolved division, pointing to Israel’s ongoing need for restoration and unification."
    },
    {
      "pk": 10002030,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 30,
      "text": "Joab returned from pursuing Abner, and when he had gathered all the people together, there were missing from David's servants nineteen men, plus Asahel.",
      "links": "",
      "comment": "David’s losses are counted, a reminder that even in victory, division brings grief and cost. Leaders are called to mourn with those who mourn."
    },
    {
      "pk": 10002031,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 31,
      "text": "But the servants of David had struck down from Benjamin, and from Abner’s men, three hundred sixty men who died.",
      "links": "",
      "comment": "The stark contrast in casualties underscores God’s favor on David, but also the tragedy of civil strife—calling believers to seek unity and peace."
    },
    {
      "pk": 10002032,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 2,
      "verse": 32,
      "text": "They took Asahel and buried him in his father’s tomb, which was in Bethlehem. Joab and his men marched all night and came to Hebron at daybreak.",
      "links": "<a href='/AIV/09/17/12'>1 Sam. 17:12</a>",
      "comment": "Asahel’s burial in Bethlehem, David’s city, hints at the connection between the house of David and the future Messiah (cf. Mic. 5:2; Luke 2:4). The return to Hebron signals hope for restored unity under the true king."
    }
  ],
  "translatedAt": "2025-12-24T03:09:28.441Z"
}