{
  "book": 10,
  "bookName": "2 Samuel",
  "bookAbbreviation": "2Sam",
  "chapter": 16,
  "verses": [
    {
      "pk": 10016001,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 1,
      "text": "When David had passed a little beyond the summit, Ziba, the servant of Mephibosheth, met him with a pair of saddled donkeys, and on them two hundred loaves of bread, one hundred clusters of raisins, one hundred cakes of figs, and a skin of wine.",
      "links": "<a href='/AIV/10/9/2-10'>2Sam 9:2-10</a>; <a href='/AIV/10/19/17,27'>2Sam 19:17,27</a>",
      "comment": "David encounters Ziba, who brings generous provisions. The mention of Mephibosheth reminds us of David's ongoing kindness and fidelity to the house of Saul, foreshadowing themes of mercy and covenant faithfulness (see 2Sam 9:1-13)."
    },
    {
      "pk": 10016002,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 2,
      "text": "The king asked Ziba, 'Why have you brought these?' Ziba answered, 'The donkeys are for the king’s household to ride on. The bread and summer fruit are for the young men to eat, and the wine is for those who become weary in the wilderness to drink.'",
      "links": "<a href='/AIV/10/15/23,28'>2Sam 15:23,28</a>",
      "comment": "Ziba presents his supplies as practical support for David’s journey, demonstrating the provision made for God’s anointed in time of trial—a spiritual reminder of God’s care for His chosen ones (cf. Ps. 23:5)."
    },
    {
      "pk": 10016003,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 3,
      "text": "Then the king said, 'And where is your master’s son?' Ziba replied to the king, 'He is staying in Jerusalem, for he said, “Today the house of Israel will restore the kingdom of my father to me.”'",
      "links": "<a href='/AIV/10/9/7'>2Sam 9:7</a>; <a href='/AIV/10/19/27'>2Sam 19:27</a>",
      "comment": "Ziba claims Mephibosheth expects the restoration of Saul's throne. The issue of loyalty and truthfulness arises, and later events reveal complexities around this claim (see 2Sam 19:24-30)."
    },
    {
      "pk": 10016004,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 4,
      "text": "So the king said to Ziba, 'Behold, all that belonged to Mephibosheth is now yours.' Ziba said, 'I bow before you; may I find favor in your sight, my lord the king.'",
      "links": "<a href='/AIV/10/9/9-10'>2Sam 9:9-10</a>",
      "comment": "David rewards Ziba based on his testimony, though later the truth of the matter is questioned. This passage highlights the theme of stewardship and authority given by the king (cf. Matt. 25:14-30)."
    },
    {
      "pk": 10016005,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 5,
      "text": "When King David came to Bahurim, behold, a man from the family of Saul came out—his name was Shimei son of Gera. He came out and cursed continuously as he came.",
      "links": "<a href='/AIV/11/2/8'>1Kings 2:8</a>; <a href='/AIV/10/19/16'>2Sam 19:16</a>",
      "comment": "Shimei, a relative of Saul, curses David, reflecting the conflict and tension remaining between the house of Saul and David’s anointed kingship."
    },
    {
      "pk": 10016006,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 6,
      "text": "He threw stones at David and at all the servants of King David, and all the people and all the mighty men who were at his right hand and at his left.",
      "links": "<a href='/AIV/10/19/21'>2Sam 19:21</a>",
      "comment": "Shimei’s attack is not just verbal but physical, signifying open contempt against God’s ordained ruler—a foreshadowing of how the righteous suffer unjustly (see Ps. 22:6-7; Luke 23:35)."
    },
    {
      "pk": 10016007,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 7,
      "text": "Shimei said as he cursed, 'Get out, get out, you man of blood, you worthless man!'",
      "links": "<a href='/AIV/10/21/1'>2Sam 21:1</a>",
      "comment": "Shimei accuses David of being a 'man of blood', referencing the bloodshed under David’s reign but misunderstanding the role of God’s justice and mercy in David’s kingship."
    },
    {
      "pk": 10016008,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 8,
      "text": "'The LORD has returned upon you all the blood of the house of Saul, in whose place you have reigned, and the LORD has given the kingdom into the hand of Absalom your son. See, you are caught in your own evil, for you are a man of blood.'",
      "links": "<a href='/AIV/10/12/10'>2Sam 12:10</a>; <a href='/AIV/09/15/28'>1Sam 15:28</a>",
      "comment": "Shimei sees David’s suffering as judgment, but the narrative reveals that the LORD’s providence encompasses both justice and mercy. The king bears the burdens even of sins he did not personally commit, a theme echoed in the suffering of Christ (see Isa. 53:4-6)."
    },
    {
      "pk": 10016009,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 9,
      "text": "Then Abishai son of Zeruiah said to the king, 'Why should this dead dog curse my lord the king? Let me go over and take off his head.'",
      "links": "<a href='/AIV/10/19/21'>2Sam 19:21</a>; <a href='/AIV/10/3/39'>2Sam 3:39</a>",
      "comment": "Abishai proposes swift retribution, revealing the temptation to respond to dishonor with violence—a common challenge for those entrusted with authority."
    },
    {
      "pk": 10016010,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 10,
      "text": "But the king said, 'What have I to do with you, sons of Zeruiah? If he curses, and if the LORD has said to him, “Curse David,” who then shall say, “Why have you done so?”'",
      "links": "<a href='/AIV/10/19/22'>2Sam 19:22</a>; <a href='/AIV/09/24/15'>1Sam 24:15</a>",
      "comment": "David yields to God’s sovereignty, accepting that even curses may be divinely permitted. This humble submission prefigures Christ’s silence before accusers (cf. Matt. 26:63; 1Pet. 2:23)."
    },
    {
      "pk": 10016011,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 11,
      "text": "David said to Abishai and to all his servants, 'See how my own son, who came out from me, seeks my life; how much more now this Benjaminite? Let him curse, for the LORD has told him to.'",
      "links": "<a href='/AIV/10/12/11'>2Sam 12:11</a>; <a href='/AIV/10/19/22'>2Sam 19:22</a>",
      "comment": "David’s words reflect deep understanding of suffering from family betrayal and strangers alike. His acceptance of suffering purposefully resonates with the acceptance of suffering seen in the lives of saints and Christ Himself."
    },
    {
      "pk": 10016012,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 12,
      "text": "Perhaps the LORD will look upon my affliction, and restore good to me instead of his curse today.",
      "links": "<a href='/AIV/19/25/18'>Ps. 25:18</a>; <a href='/AIV/19/109/28'>Ps. 109:28</a>",
      "comment": "David expresses hope that God will transform his suffering into blessing—a pattern of redemptive suffering that points toward Christ’s passion, wherein evil is turned to good (see Rom. 8:28)."
    },
    {
      "pk": 10016013,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 13,
      "text": "So David and his men went on the way, but Shimei went along the hillside across from him, cursing as he went, throwing stones and flinging dust at him.",
      "links": "<a href='/AIV/10/19/18'>2Sam 19:18</a>",
      "comment": "Shimei’s persistence in cursing underlines the completeness of David’s humiliation, reinforcing the motif of the righteous suffering unjust reproach for the greater good."
    },
    {
      "pk": 10016014,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 14,
      "text": "The king and all the people who were with him became weary, and he refreshed himself there.",
      "links": "<a href='/AIV/19/69/3'>Ps. 69:3</a>",
      "comment": "After endurance, David finds rest—a precursor to the spiritual truth that suffering and perseverance lead to consolation and renewal, as reflected in Christ’s invitation: 'Come to me, all who labor...' (Matt. 11:28)."
    },
    {
      "pk": 10016015,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 15,
      "text": "Now Absalom and all the people, the men of Israel, came to Jerusalem, and Ahithophel was with him.",
      "links": "<a href='/AIV/10/15/12'>2Sam 15:12</a>; <a href='/AIV/10/17/1'>2Sam 17:1</a>",
      "comment": "Absalom’s entry into Jerusalem marks the height of his rebellion. Ahithophel, once David’s counselor, now sides with Absalom, emphasizing themes of betrayal and false counsel."
    },
    {
      "pk": 10016016,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 16,
      "text": "When Hushai the Arkite, David’s friend, came to Absalom, Hushai said to Absalom, 'Long live the king! Long live the king!'",
      "links": "<a href='/AIV/10/15/32-37'>2Sam 15:32-37</a>",
      "comment": "Hushai pretends loyalty to Absalom while secretly supporting David, demonstrating the subtlety of God’s providence, safeguarding the true king through unexpected means."
    },
    {
      "pk": 10016017,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 17,
      "text": "Absalom said to Hushai, 'Is this your loyalty to your friend? Why did you not go with your friend?'",
      "links": "<a href='/AIV/10/15/37'>2Sam 15:37</a>",
      "comment": "Absalom questions Hushai's seeming betrayal, which sets the stage for Hushai’s role as a protector of David—echoing the complex dynamics of obedience and prudence in service to the true king."
    },
    {
      "pk": 10016018,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 18,
      "text": "Hushai said to Absalom, 'No, but whom the LORD, and this people, and all the men of Israel have chosen—his I will be, and with him I will remain.'",
      "links": "<a href='/AIV/10/5/3'>2Sam 5:3</a>",
      "comment": "Hushai cleverly phrases his answer, alluding to God’s sovereign will in establishment of kingship—a subtle reminder that true authority is divinely ordained."
    },
    {
      "pk": 10016019,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 19,
      "text": "'And again, whom should I serve? Should it not be his son? As I have served your father, so will I serve you.'",
      "links": "<a href='/AIV/10/15/34'>2Sam 15:34</a>",
      "comment": "Hushai pledges service to Absalom, though covertly for David’s interest. His dual loyalty recalls the biblical exhortation to be 'wise as serpents and innocent as doves' (Matt. 10:16)."
    },
    {
      "pk": 10016020,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 20,
      "text": "Absalom then said to Ahithophel, 'Give us your advice about what we should do.'",
      "links": "<a href='/AIV/10/15/31'>2Sam 15:31</a>",
      "comment": "Ahithophel is recognized for his wisdom, yet his counsel will soon be defeated by the providence of God, reminding us of the limits of human wisdom against divine purpose."
    },
    {
      "pk": 10016021,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 21,
      "text": "Ahithophel answered Absalom, 'Go in to your father’s concubines, whom he left to take care of the house, and all Israel will hear that you have made yourself abhorrent to your father; then the hands of all who are with you will be strengthened.'",
      "links": "<a href='/AIV/10/12/11-12'>2Sam 12:11-12</a>; <a href='/AIV/10/15/16'>2Sam 15:16</a>",
      "comment": "Ahithophel’s advice fulfills Nathan’s prophecy (2Sam 12:11-12), manifesting the gravity of sin acted publicly. The open violation underscores the distinction between mere occupation of authority and divinely sanctioned rulership."
    },
    {
      "pk": 10016022,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 22,
      "text": "So they set up a tent on the roof for Absalom, and Absalom went in to his father’s concubines in the sight of all Israel.",
      "links": "<a href='/AIV/10/12/12'>2Sam 12:12</a>; <a href='/AIV/03/18/8'>Lev. 18:8</a>",
      "comment": "Absalom’s act performed in public fulfills judgment predicted upon David's house, illustrating the serious consequences of sin yet also the outworking of God’s faithful promises, even through discipline."
    },
    {
      "pk": 10016023,
      "translation": "AIV",
      "book": 10,
      "bookName": "2 Samuel",
      "bookAbbreviation": "2Sam",
      "chapter": 16,
      "verse": 23,
      "text": "Now in those days the advice Ahithophel gave was regarded as if one was consulting the word of God; so was all the advice of Ahithophel to both David and Absalom.",
      "links": "<a href='/AIV/10/17/14'>2Sam 17:14</a>; <a href='/AIV/10/15/31'>2Sam 15:31</a>",
      "comment": "Ahithophel’s wisdom was esteemed like divine oracle, yet his counsel ultimately failed, showing that even the greatest human insight must bow before the higher plans of God. True wisdom is found not just in knowledge, but in obedience to divine will—a lesson that shapes the spiritual life of every disciple."
    }
  ],
  "translatedAt": "2025-12-24T03:20:21.192Z"
}