{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 5,
  "verses": [
    {
      "pk": 18005001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 1,
      "text": "When it was reported to Holofernes, the commander of the Assyrian army, that the Israelites had prepared for war, had blocked the mountain passes, fortified every high place, and set up obstacles in the plains,",
      "links": "<a href='/AIV/7/3/27-28'>Judges 3:27-28</a>; <a href='/AIV/14/32/1-6'>2 Chr. 32:1-6</a>",
      "comment": "The Israelites' strategy of fortifying mountain passes echoes similar actions in the time of Judges and Hezekiah, revealing continuity in faith and tactical wisdom through the generations."
    },
    {
      "pk": 18005002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 2,
      "text": "he was enraged and called together all the rulers of Moab, the leaders of Ammon, and all the governors of the seacoast.",
      "links": "<a href='/AIV/7/3/12'>Judges 3:12</a>; <a href='/AIV/1/36/35'>Gen. 36:35</a>",
      "comment": "Holofernes’ reaction shows the tension between the surrounding nations and Israel, foreshadowing the spiritual warfare described throughout Scripture."
    },
    {
      "pk": 18005003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 3,
      "text": "He said to them, 'Tell me, you men of Canaan, who is this people that dwells in the hill country? What cities do they inhabit, how large is their army, and wherein is their strength and power? Who rules them as king, and leads their army?'",
      "links": "<a href='/AIV/4/13/29'>Num. 13:29</a>; <a href='/AIV/6/9/1-2'>Josh. 9:1-2</a>",
      "comment": "Holofernes seeks intelligence about Israel—reflecting how worldly powers often misunderstand God’s spiritual people, as in 1 Cor. 2:14."
    },
    {
      "pk": 18005004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 4,
      "text": "Why have they refused to come out and meet me like all those who dwell in the west?'",
      "links": "<a href='/AIV/6/10/2-4'>Josh. 10:2-4</a>",
      "comment": "The Israelites’ distinct reaction foreshadows the distinctiveness of God’s chosen people who respond first to Him, and not to the world’s expectations."
    },
    {
      "pk": 18005005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 5,
      "text": "Then Achior, the leader of all the Ammonites, said to him, 'Let my lord listen to the words from the mouth of your servant, and I will tell you the truth about this people that dwells in the hill country near you. No falsehood shall come out of your servant’s mouth.'",
      "links": "<a href='/AIV/9/42/18'>Neh. 9:7-8</a>; <a href='/AIV/4/22/1-3'>Num. 22:1-3</a>",
      "comment": "Achior’s willingness to speak truthfully, despite danger, anticipates testimonies for God throughout salvation history (cf. John 18:37)."
    },
    {
      "pk": 18005006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 6,
      "text": "'This people descended from the Chaldeans.",
      "links": "<a href='/AIV/1/11/31'>Gen. 11:31</a>; <a href='/AIV/4/24/9'>Num. 24:9</a>",
      "comment": "Tracing their origins to the Chaldeans, indicating Abraham’s calling and the foundational importance of faith and covenant."
    },
    {
      "pk": 18005007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 7,
      "text": "At first they sojourned in Mesopotamia, because they would not follow the gods of their fathers, who were in the land of the Chaldeans.",
      "links": "<a href='/AIV/1/12/1'>Gen. 12:1</a>; <a href='/AIV/6/24/2'>Josh. 24:2</a>",
      "comment": "Their pilgrimage begins with a rejection of idolatry and a commitment to the one true God, prefiguring the spiritual journey every believer undertakes."
    },
    {
      "pk": 18005008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 8,
      "text": "They left the way of their ancestors, worshiped the God of heaven, and were driven out from the presence of their gods, so they fled to Mesopotamia and lived there for a long time.",
      "links": "<a href='/AIV/1/31/19-21'>Gen. 31:19-21</a>",
      "comment": "Like Abraham, Israel’s forefathers chose true worship even at great cost, setting the pattern for God’s call to holiness and separation from the world."
    },
    {
      "pk": 18005009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 9,
      "text": "Later, when their God commanded them to leave the place where they sojourned, they moved into the land of Canaan. There they multiplied and became a great host.",
      "links": "<a href='/AIV/1/17/1-6'>Gen. 17:1-6</a>",
      "comment": "Obedience to God’s command leads to fruitfulness, modeling the blessings of faith and perseverance."
    },
    {
      "pk": 18005010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 10,
      "text": "But when a famine struck the land, they went down to Egypt and lived there as long as they could find food. There they became a great multitude, such that they could not be counted.",
      "links": "<a href='/AIV/1/46/3-7'>Gen. 46:3-7</a>",
      "comment": "God turns adversity, like famine and exile, into opportunities for His people to grow and be prepared for greater deliverance."
    },
    {
      "pk": 18005011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 11,
      "text": "But the king of Egypt oppressed them, forced them to build his cities with hard labor, and humiliated them. Yet, they cried out to their God, and He struck all the land of Egypt with plagues for which there was no cure.",
      "links": "<a href='/AIV/2/1/13-14'>Ex. 1:13-14</a>; <a href='/AIV/2/7/14-25'>Ex. 7:14-25</a>",
      "comment": "This recalls the Exodus—a central event of deliverance that points forward to God's ultimate deliverance in Christ."
    },
    {
      "pk": 18005012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 12,
      "text": "So the Egyptians drove them out from their presence. God dried up the Red Sea before them, and He led them by the way of Sinai and Kadesh-Barnea, and drove out all those who lived in the wilderness.",
      "links": "<a href='/AIV/2/14/21-22'>Ex. 14:21-22</a>; <a href='/AIV/6/5/4'>Josh. 5:4</a>",
      "comment": "God leads His people with might and signs, prefiguring the redemptive acts fulfilled in the New Covenant."
    },
    {
      "pk": 18005013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 13,
      "text": "They lived in the land of the Amorites, destroyed by their strength all who opposed them, and dwelt there for many years. Then, they destroyed every inhabitant of Heshbon, and, crossing over the Jordan, they took possession of all the hill country.",
      "links": "<a href='/AIV/4/21/21-35'>Num. 21:21-35</a>; <a href='/AIV/6/12/1'>Josh. 12:1</a>",
      "comment": "The conquest demonstrates both God’s promise and His authority to give the land to whom He chooses, showing His faithfulness."
    },
    {
      "pk": 18005014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 14,
      "text": "They drove out before them the Canaanites, the Perizzites, the Jebusites, the Shechemites, and all the Gergesites, and lived there for many years.",
      "links": "<a href='/AIV/1/10/15-18'>Gen. 10:15-18</a>; <a href='/AIV/6/24/11-12'>Josh. 24:11-12</a>",
      "comment": "The completeness of God’s promise is evident in the removal of all opposition, a symbol of God’s complete victory over spiritual foes through Christ."
    },
    {
      "pk": 18005015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 15,
      "text": "But when they turned aside from the way which He commanded them, disasters overtook them in battle, and they were carried captive into a land not their own. Many of them died, and those who survived were scattered.",
      "links": "<a href='/AIV/12/17/18-20'>2 Kings 17:18-20</a>; <a href='/AIV/24/13/17'>Jer. 13:17</a>",
      "comment": "Faithfulness is always required to remain under God’s favor. Israel’s exile prefigures spiritual loss that comes from sin and the necessity of repentance."
    },
    {
      "pk": 18005016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 16,
      "text": "But now, having returned to their God, they have come back from where they were scattered, and have seized Jerusalem, where their sanctuary is, and have settled in the hill country because it was desolate.",
      "links": "<a href='/AIV/15/1/3'>Ezra 1:3</a>; <a href='/AIV/16/11/1'>Neh. 11:1</a>",
      "comment": "Repentance and return restore favor and inheritance. This foreshadows the reunion of God’s people around one sanctuary, anticipating unity in worship."
    },
    {
      "pk": 18005017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 17,
      "text": "Therefore, my lord and master, if there is any iniquity in their nation, let us observe if they sin against their God; then we shall be able to overthrow them. But if there is no offense in this people, let my lord pass them by, for their Lord and God will defend them, and we will become a mockery before all the world.'",
      "links": "<a href='/AIV/2/23/21-22'>Ex. 23:21-22</a>; <a href='/AIV/4/22/6-12'>Num. 22:6-12</a>",
      "comment": "Achior insists that obedience to God ensures divine protection, introducing the theme of spiritual warfare and God's sovereign defense of the faithful."
    },
    {
      "pk": 18005018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 18,
      "text": "When Achior had finished saying these things, all the people standing around the tent began to murmur. The commanders of Holofernes and all the residents of the seacoast mocked him and insisted that he be put to death.",
      "links": "<a href='/AIV/7/7/4-6'>Judges 7:4-6</a>",
      "comment": "God’s truth often brings scorn from the world, yet is always vindicated. The call to witness, even in adversity, is shown in the lives of the saints."
    },
    {
      "pk": 18005019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 19,
      "text": "They said, 'We are not afraid of the Israelites! See, they are people without strength, nor power for battle.",
      "links": "<a href='/AIV/7/13/2'>Judges 13:2</a>",
      "comment": "Unbelief blinds the enemies of God—throughout Scripture, those who trust in their own strength fall before the humble whom God protects."
    },
    {
      "pk": 18005020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 20,
      "text": "So then, let us go up, Lord Holofernes, and they will be devoured by your vast army.'",
      "links": "<a href='/AIV/9/15/20'>1 Sam. 15:20</a>",
      "comment": "The overconfidence of the enemies of God prefigures their ultimate downfall, echoing the theme that God opposes the proud but gives grace to the humble (James 4:6)."
    },
    {
      "pk": 18005021,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 21,
      "text": "Then their adviser, Achior, finished speaking, and the anger of Holofernes and the assembled leaders blazed against him.",
      "links": "<a href='/AIV/2/5/21'>Ex. 5:21</a>",
      "comment": "Those who defend the truth of God’s promises often suffer persecution—standing firm is a mark of authentic faith."
    },
    {
      "pk": 18005022,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 22,
      "text": "Holofernes said to Achior, 'You have spoken like a hired mercenary! You will not see my face again until the day I take vengeance on this race that came up out of Egypt.",
      "links": "<a href='/AIV/2/1/1'>Ex. 1:1</a>",
      "comment": "Holofernes' reply underlines how earthly rulers cannot recognize the spiritual meaning behind Israel's history, trusting instead in violence and vengeance."
    },
    {
      "pk": 18005023,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 23,
      "text": "But then, when I return, I will punish you and all those in your territory with the punishment they deserve.'",
      "links": "<a href='/AIV/1/34/12'>Gen. 34:12</a>",
      "comment": "Holofernes threatens retribution, but his arrogance sets the stage for God to display His glory through deliverance, foreshadowing the defeat of all those opposed to the true faith."
    },
    {
      "pk": 18005024,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 5,
      "verse": 24,
      "text": "Then Holofernes commanded his servants who waited on him in the tent to seize and hand over Achior to the sons of Israel, and to wait until he was delivered into their hands.",
      "links": "<a href='/AIV/7/7/12-16'>Judges 7:12-16</a>",
      "comment": "Achior's fate hangs in the balance, yet in God’s providence, those who stand for Him are often preserved and honored—foreshadowing salvation and vindication for all who trust in the Lord."
    }
  ],
  "translatedAt": "2025-12-24T05:02:03.717Z"
}