{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 6,
  "verses": [
    {
      "pk": 18006001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 1,
      "text": "When the commotion among the people gathered around the chief men of the Assyrians had died down, Holofernes, the commander of the army, said in the presence of all the foreign people and of all the sons of Moab,",
      "links": "<a href='/AIV/07/7/23'>Judg. 7:23</a>; <a href='/AIV/04/31/8'>Num. 31:8</a>",
      "comment": "This verse introduces Holofernes, the Assyrian commander, and shows his authority over both foreigners and the Moabites. The setting echoes Old Testament gatherings of leaders before important pronouncements."
    },
    {
      "pk": 18006002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 2,
      "text": "\"Listen to me, you men of Moab, and to the leaders of the people of Canaan. Why do you think Israel can withstand me?",
      "links": "<a href='/AIV/09/1/1'>1 Sam. 17:10</a>; <a href='/AIV/19/2/1'>Ps. 2:1</a>",
      "comment": "This challenge echoes Goliath's taunt to Israel (1 Sam. 17:10). There is a contrast between human pride and God's hidden plan, seen throughout salvation history."
    },
    {
      "pk": 18006003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 3,
      "text": "No one among their ranks can stand against the might of my army. I will march throughout all their land, and the mountains filled with them will become drunk with their blood, and the valleys will be filled, and every footstep will be wiped out.",
      "links": "<a href='/AIV/23/34/3'>Isa. 34:3</a>; <a href='/AIV/19/79/3'>Ps. 79:3</a>",
      "comment": "The imagery of blood and devastation recalls prophetic warnings against Israel's enemies. Holofernes' arrogance foreshadows his downfall, highlighting the biblical theme of divine justice."
    },
    {
      "pk": 18006004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 4,
      "text": "Their mountains will be leveled, their young men struck down by the sword, their infants dashed, their youth destroyed, and their entire army wiped out in a single day.",
      "links": "<a href='/AIV/23/13/16'>Isa. 13:16</a>; <a href='/AIV/19/137/9'>Ps. 137:9</a>",
      "comment": "Holofernes claims total victory, echoing prophetic oracles against nations hostile to Israel (compare Isa. 13:16). Yet biblical history often shows God using the weak to confound the strong."
    },
    {
      "pk": 18006005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 5,
      "text": "\"For has their god truly delivered them before? Has any god delivered any nation from the hand of Nebuchadnezzar, my lord?",
      "links": "<a href='/AIV/27/3/15'>Dan. 3:15</a>; <a href='/AIV/24/37/10'>Jer. 37:10</a>",
      "comment": "Holofernes blasphemes God, suggesting Israel is defenseless. This challenge directly sets up the demonstration of God's power—an important motif fulfilled in Christ's victory over sin and death."
    },
    {
      "pk": 18006006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 6,
      "text": "All their gods are powerless, and they have not saved their people from my hands or the hands of my ancestors. How much less will God save these people from me now?",
      "links": "<a href='/AIV/23/36/18'>Isa. 36:18-20</a>; <a href='/AIV/19/115/4-8'>Ps. 115:4-8</a>",
      "comment": "Holofernes repeats the mistake of other conquerors who underestimated the one true God. By exalting himself, he sets the stage for God's intervention, a theme closely connected with the resurrection and vindication of the righteous."
    },
    {
      "pk": 18006007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 7,
      "text": "Therefore, do not be afraid. Their defeat is certain, just as none of my lord's words have failed. Let us press on, and they shall be wiped out with their mountains filled with their dead.",
      "links": "<a href='/AIV/23/14/23'>Isa. 14:23</a>; <a href='/AIV/06/10/11'>Josh. 10:11</a>",
      "comment": "Holofernes’s confidence in worldly power sets up the biblical theme that God alone is Judge, often working through unexpected means and humble instruments."
    },
    {
      "pk": 18006008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 8,
      "text": "Then Achior, leader of all the Ammonites, said to him, 'Let my lord please listen to what your servant will say, and allow me to speak, since what I have said previously is true.'",
      "links": "<a href='/AIV/18/5/5'>Jdt. 5:5</a>; <a href='/AIV/09/25/24'>1 Sam. 25:24</a>",
      "comment": "Achior’s plea to speak truth reflects the importance of wisdom and openness to counsel, themes echoed throughout the Wisdom literature (e.g., Proverbs) and the apostolic tradition."
    },
    {
      "pk": 18006009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 9,
      "text": "'Why, O lord, would you treat your people as criminals? For what you are planning will not succeed against the house of Israel.'",
      "links": "<a href='/AIV/02/1/12'>Ex. 1:12</a>; <a href='/AIV/19/33/10'>Ps. 33:10</a>",
      "comment": "Achior’s warning points out the futility of human pride against God's chosen. God's providence for Israel anticipates that protection later offered through the new covenant."
    },
    {
      "pk": 18006010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 10,
      "text": "'Rather, the sword may be lifted against them if they sin against their God, but even their God punishes them for their iniquity—then they are not to be feared. But if they are obedient to their God, then no one can defeat them.'",
      "links": "<a href='/AIV/03/26/17'>Lev. 26:17</a>; <a href='/AIV/05/28/1'>Deut. 28:1</a>",
      "comment": "Achior understands the biblical truth: fidelity brings blessing, and rebellion brings discipline. This mirrors the call to ongoing faithfulness not just to the Law, but to God’s established community and sacramental life."
    },
    {
      "pk": 18006011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 11,
      "text": "'Now then, my lord, let us consider whether there is any offense among this people. If there is, let us go up and attack them. But if not, let my lord leave them alone, for their Lord and God will defend them, and we would become a disgrace to all the earth.'",
      "links": "<a href='/AIV/04/23/8'>Num. 23:8</a>; <a href='/AIV/09/12/23'>1 Sam. 12:23</a>",
      "comment": "God's unique protective relationship with Israel serves as a foreshadowing of the Church, called to holiness, receiving divine protection when faithful."
    },
    {
      "pk": 18006012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 12,
      "text": "When Achior finished speaking, all the people surrounding the tent began to grumble. The chief men of Holofernes’s army, all those from Moab, and all the other foreigners, threatened to kill him.",
      "links": "<a href='/AIV/07/6/29'>Judg. 6:29</a>; <a href='/AIV/24/26/11'>Jer. 26:11</a>",
      "comment": "Achior's peril due to speaking truth recalls the persecution faced by prophets. This foreshadows the hostility often experienced by those sent to speak God's word—fulfilled perfectly in Christ, who suffered for truth."
    },
    {
      "pk": 18006013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 13,
      "text": "They said, 'We will not be afraid of the Israelites! If you think so, you are deluding yourself. We will go up, and they will be swallowed up by your death, Achior.'",
      "links": "<a href='/AIV/19/14/1'>Ps. 14:1</a>",
      "comment": "This dismissal and threat again illustrate the folly of ignoring God's voice and concerning oneself only with worldly might."
    },
    {
      "pk": 18006014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 14,
      "text": "Then Holofernes, filled with anger against Achior, said, 'Because you have spoken these words, you shall not see my face from this day until I take vengeance on this people coming from Egypt.'",
      "links": "<a href='/AIV/17/4/11'>Esth. 4:11</a>; <a href='/AIV/19/83/4'>Ps. 83:4</a>",
      "comment": "Refusing to see Achior foreshadows the divide between truth and power. Holofernes' reference to 'this people coming from Egypt' reinforces Israel's identity as an Exodus people—a theological marker later seen in the Church's pilgrim journey."
    },
    {
      "pk": 18006015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 15,
      "text": "Then Holofernes ordered his guards who were standing around his tent, 'Take Achior and lead him to Bethulia. Hand him over to the Israelites, and when you seize them, kill him along with them.'",
      "links": "<a href='/AIV/17/7/9-10'>Esth. 7:9-10</a>; <a href='/AIV/18/7/18'>Jdt. 7:18</a>",
      "comment": "Achior becomes a scapegoat, similar to how the prophets and Christ Himself bore the consequences of standing for truth (cf. Isa. 53:7-12)."
    },
    {
      "pk": 18006016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 16,
      "text": "So the men led Achior out from the tents into the plain, and from the plain into the valleys. They made Achior leave near the springs below Bethulia,",
      "links": "<a href='/AIV/01/21/19'>Gen. 21:19</a>",
      "comment": "Achior is left at a place of water—a symbol throughout Scripture of life and purification (Gen. 21:19; John 4:10). This imagery anticipates both baptism and deliverance through faith."
    },
    {
      "pk": 18006017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 17,
      "text": "Then the men returned to their master, but the people of Israel came down from Bethulia, found Achior, untied him, and brought him into the city.",
      "links": "<a href='/AIV/42/10/33-34'>Luke 10:33-34</a>; <a href='/AIV/01/40/13'>Gen. 40:13</a>",
      "comment": "Israel's rescuing of Achior hints at the motif of charity and welcoming the stranger, paralleling the Good Samaritan parable (Luke 10:33-34) and Christ’s command to love even outsiders."
    },
    {
      "pk": 18006018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 18,
      "text": "They set him in the midst of the people and asked him what had happened, and he reported to them the words of Holofernes and all that he had said in the assembly of the Assyrians.",
      "links": "<a href='/AIV/09/17/27'>1 Sam. 17:27</a>",
      "comment": "The community discerning and listening to Achior models the importance of receiving testimony, a principle foundational to the apostolic faith."
    },
    {
      "pk": 18006019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 19,
      "text": "Then the people fell down and worshiped God. They cried out, 'O Lord God of heaven, look upon their arrogance, and have mercy on the humble of your people, and look favorably this day upon those who are set apart to you.'",
      "links": "<a href='/AIV/14/7/14'>2 Chr. 7:14</a>; <a href='/AIV/23/66/2'>Isa. 66:2</a>",
      "comment": "True worship and humble prayer are the proper response to danger and pride. God exalts the humble and brings down the proud—a theme fulfilled in the Beatitudes (Matt. 5:3-12)."
    },
    {
      "pk": 18006020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 20,
      "text": "Then they comforted Achior and praised him greatly. Uzziah took him from the assembly to his own house and held a banquet for the elders, and they invoked the God of Israel throughout the whole night for help.",
      "links": "<a href='/AIV/01/18/3-5'>Gen. 18:3-5</a>; <a href='/AIV/44/12/12'>Acts 12:12</a>",
      "comment": "This hospitality and prayerful vigil echoes the pattern of communal intercession and the enduring value of gathering together to seek God’s will—fundamental in the life of the Church."
    },
    {
      "pk": 18006021,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 6,
      "verse": 21,
      "text": "And everyone remained fervent in prayer before the God of Israel, waiting for the dawn to come.",
      "links": "<a href='/AIV/19/130/6'>Ps. 130:6</a>; <a href='/AIV/42/6/12'>Luke 6:12</a>",
      "comment": "Waiting through the night in prayer signifies perseverance and hope, a pattern mirrored by Christ’s own nights of prayer (Luke 6:12) and reflected in the tradition of vigil and watchfulness before great acts of God."
    }
  ],
  "translatedAt": "2025-12-24T05:02:33.031Z"
}