{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 13,
  "verses": [
    {
      "pk": 18013001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 1,
      "text": "When evening came, his servants hurried to their beds, and Bagoas closed the tent from outside and dismissed those who were waiting. All withdrew, not suspecting anything, because they believed he would rest with Judith.",
      "links": "<a href='/AIV/18/12/5'>Jdt 12:5</a>; <a href='/AIV/18/12/19'>Jdt 12:19</a>",
      "comment": "The scene is set at night after Holofernes' servants leave, expecting Judith to remain with him as planned. This secrecy is crucial for what follows."
    },
    {
      "pk": 18013002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 2,
      "text": "None remained in the bedroom, neither small nor great. Then Judith, standing beside his bed, prayed in her heart for strength from the Lord.",
      "links": "<a href='/AIV/18/9/1-14'>Jdt 9:1-14</a>; <a href='/AIV/7/16/28'>Judg. 16:28</a>",
      "comment": "Judith seeks divine help before acting, anticipating Old Testament figures like Samson who also prayed for strength before delivering Israel."
    },
    {
      "pk": 18013003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 3,
      "text": "She looked at Holofernes stretched out on his bed, for he was overcome with wine.",
      "links": "<a href='/AIV/18/12/20'>Jdt 12:20</a>; <a href='/AIV/19/78/65'>Ps. 78:65</a>",
      "comment": "Holofernes' drunkenness is his downfall, reminiscent of times in Scripture when overindulgence leads to judgment or defeat."
    },
    {
      "pk": 18013004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 4,
      "text": "Judith said, 'Give me strength today, Lord God of Israel.'",
      "links": "<a href='/AIV/18/9/14'>Jdt 9:14</a>; <a href='/AIV/7/16/28'>Judg. 16:28</a>",
      "comment": "Her short prayer echoes the faithful reliance on God seen in Israel's judges. This direct invocation of God highlights her personal relationship with Him."
    },
    {
      "pk": 18013005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 5,
      "text": "She approached the head of the bed, took the sword that hung there,",
      "links": "<a href='/AIV/18/12/7'>Jdt 12:7</a>",
      "comment": "Judith’s action is deliberate and calculated, showing courage similar to other women in scripture like Jael (Judg. 4:21)."
    },
    {
      "pk": 18013006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 6,
      "text": "and, approaching his bed, grasped his hair and said, 'Strengthen me, Lord God of Israel, this day.'",
      "links": "<a href='/AIV/7/16/28'>Judg. 16:28</a>; <a href='/AIV/18/9/13'>Jdt 9:13</a>",
      "comment": "Repeated prayer underlines the gravity of her task and her total dependence on God's intervention."
    },
    {
      "pk": 18013007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 7,
      "text": "Then she struck his neck twice with all her might and cut off his head.",
      "links": "<a href='/AIV/7/4/21'>Judg. 4:21</a>",
      "comment": "The described decapitation mirrors Jael’s slaying of Sisera, underscoring God’s ability to deliver Israel through unexpected instruments."
    },
    {
      "pk": 18013008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 8,
      "text": "She rolled his body off the bed and then pulled down the canopy from the posts. After a moment, she left and gave Holofernes' head to her maid,",
      "links": "<a href='/AIV/7/4/21'>Judg. 4:21</a>; <a href='/AIV/18/10/5'>Jdt 10:5</a>",
      "comment": "The use of her maid as helper signals the importance of cooperation among the faithful, and the thoroughness of Judith ensures the mission’s success."
    },
    {
      "pk": 18013009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 9,
      "text": "who put it into her food bag. Then the two of them went out together, as they were accustomed to go to prayer. They passed through the camp and circled the valley, and went up to the gate of the city.",
      "links": "<a href='/AIV/18/10/10-11'>Jdt 10:10-11</a>",
      "comment": "Judith’s careful and prayerful routine foreshadows the Christian liturgical emphasis on routine prayer and community."
    },
    {
      "pk": 18013010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 10,
      "text": "Judith called from afar to the watchmen at the city gates: 'Open! Open the gate! God is with us! He has shown His power in Israel and against the enemy, as He has done today.'",
      "links": "<a href='/AIV/18/8/33'>Jdt 8:33</a>; <a href='/AIV/2/14/30'>Ex. 14:30</a>",
      "comment": "Judith publicly attributes victory to God, a model for giving praise and public witness of God’s deeds."
    },
    {
      "pk": 18013011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 11,
      "text": "When the men of her city heard her voice, they hurried down to the gate of the city and called for the elders. All ran together, from the youngest to the oldest, for her return seemed incredible. They opened the gate and welcomed them. They kindled a fire to give light and surrounded them.",
      "links": "<a href='/AIV/18/8/10'>Jdt 8:10</a>; <a href='/AIV/18/15/12'>Jdt 15:12</a>",
      "comment": "The entire community comes together, showing the unity and hierarchical gathering of the faithful to witness God’s salvation."
    },
    {
      "pk": 18013012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 12,
      "text": "Judith said to them with a loud voice: 'Praise God! Praise Him! Praise God, who has not withheld His mercy from the house of Israel, but has crushed our enemies by my hand this night!'",
      "links": "<a href='/AIV/2/15/1'>Ex. 15:1</a>; <a href='/AIV/18/5/21'>Jdt 5:21</a>",
      "comment": "Judith points all glory to God. The repeated praise recalls the song of Moses after the Exodus victory (<a href='/AIV/2/15/1'>Ex. 15:1ff</a>)."
    },
    {
      "pk": 18013013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 13,
      "text": "Then, in their midst, she took the head out of the bag and showed it to them, saying, 'Behold the head of Holofernes, the commander of the Assyrian army, and here is the canopy under which he lay in his drunkenness. The Lord struck him down by the hand of a woman.'",
      "links": "<a href='/AIV/7/4/9'>Judg. 4:9</a>; <a href='/AIV/18/9/10'>Jdt 9:10</a>",
      "comment": "Judith’s triumph as a woman is a recurring Biblical theme, showing God's power perfected in apparent weakness and prefiguring Mary as 'the woman' of prophecy (Gen 3:15)."
    },
    {
      "pk": 18013014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 14,
      "text": "The Lord kept me on the right path when I went out, and brought me back safely. My face deceived him for his destruction, but he did not commit sin with me to defile or shame me.",
      "links": "<a href='/AIV/18/12/20'>Jdt 12:20</a>; <a href='/AIV/18/10/13'>Jdt 10:13</a>",
      "comment": "Judith maintains her holiness, resisting temptation and remaining undefiled. This reflects an ideal of purity and a higher standard for God’s chosen instruments."
    },
    {
      "pk": 18013015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 15,
      "text": "All the people were greatly amazed and fell down to worship God, declaring with one voice, 'Blessed are you, our God, who have today humbled our enemies!'",
      "links": "<a href='/AIV/7/5/2'>Judg. 5:2</a>; <a href='/AIV/19/18/47'>Ps. 18:47</a>",
      "comment": "The response is liturgical: united praise and worship. The communal participation mirrors Old Testament celebrations of deliverance."
    },
    {
      "pk": 18013016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 16,
      "text": "Uzziah said to her, 'O daughter, you are most blessed among all women upon the earth! May the Most High God be praised, who has directed you to cut off the head of our enemy.'",
      "links": "<a href='/AIV/42/1/28'>Lk. 1:28</a>; <a href='/AIV/42/1/42'>Lk. 1:42</a>",
      "comment": "Uzziah’s words closely echo Gabriel’s and Elizabeth’s greetings to Mary (Luke 1:28, 42), highlighting an Old Testament foreshadowing of the unique role a holy woman can play in salvation history."
    },
    {
      "pk": 18013017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 17,
      "text": "Judith answered, 'As the Lord lives, who has protected me on my journey, what I have done was by Him. It was the Lord who prevented me from falling into sin with him, so as to defile or shame myself.'",
      "links": "<a href='/AIV/18/8/35'>Jdt 8:35</a>; <a href='/AIV/18/10/13'>Jdt 10:13</a>",
      "comment": "Judith asserts God’s providence over personal morality, underlining a recognition that perseverance in holiness is itself a grace from God."
    },
    {
      "pk": 18013018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 18,
      "text": "All the people were greatly amazed and worshipped God, and said, 'Nothing like this has ever happened, since the time of Moses, since the day when the Lord led Israel out of Egypt until today.'",
      "links": "<a href='/AIV/2/15/1'>Ex. 15:1</a>; <a href='/AIV/18/5/1'>Jdt 5:1</a>",
      "comment": "Judith’s victory is compared to Exodus, the greatest act of saving mercy in Israel’s history. Like Moses, she becomes a deliverer for her people."
    },
    {
      "pk": 18013019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 19,
      "text": "Then Judith said to them, 'Sing a song to my God with tambourines! Sing to the Lord with cymbals! Make melody to Him! Praise Him and call on His name!'",
      "links": "<a href='/AIV/2/15/20'>Ex. 15:20</a>; <a href='/AIV/19/149/3'>Ps. 149:3</a>",
      "comment": "Judith calls for liturgical, musical praise, echoing the celebratory worship by Miriam after the Red Sea crossing (Ex. 15:20)."
    },
    {
      "pk": 18013020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 13,
      "verse": 20,
      "text": "For the Lord is the God who crushes wars. He delivered me out of the hands of my pursuers, and brought me out of the midst of the flames, as you have seen this day.",
      "links": "<a href='/AIV/7/5/11'>Judg. 5:11</a>; <a href='/AIV/19/66/12'>Ps. 66:12</a>",
      "comment": "God’s action as savior is further celebrated; this language anticipates the praise given to God in Christian worship as the one who delivers from evil."
    }
  ],
  "translatedAt": "2025-12-24T05:06:38.620Z"
}