{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 2,
  "verses": [
    {
      "pk": 18002001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 1,
      "text": "In the eighteenth year, on the twenty-second day of the first month, the words were spoken in the house of Nebuchadnezzar king of the Assyrians, that he would take vengeance on all the land, just as he had said.",
      "links": "<a href='/AIV/01/07/11'>Gen. 7:11</a>; <a href='/AIV/23/10/5-6'>Isa. 10:5-6</a>",
      "comment": "The verse sets the historical context. The mention of an exact date highlights the historicity of the narrative, and Nebuchadnezzar's resolve is reminiscent of other rulers God used as instruments of judgment (cf. Isa. 10:5-6)."
    },
    {
      "pk": 18002002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 2,
      "text": "He called together all his servants and all his nobles, and he set before them his secret plan and uttered in their hearts the wickedness of his purpose.",
      "links": "<a href='/AIV/27/06/3-5'>Dan. 6:3-5</a>",
      "comment": "Nebuchadnezzar's secret council mirrors that of many ancient kings, but wicked intent stands in contrast to divine counsel. Notably, the king’s words are set against the righteousness God desires, highlighting the difference between earthly and divine authority."
    },
    {
      "pk": 18002003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 3,
      "text": "\"You have heard what the people of Judea have spoken against me; they have refused to join with me in waging war against the people of Media.\"",
      "links": "<a href='/AIV/16/02/19'>Neh. 2:19</a>; <a href='/AIV/16/04/1-2'>Neh. 4:1-2</a>",
      "comment": "Here Judah’s distinctiveness and refusal to submit highlight their faithfulness to their identity and God’s law, despite living among foreign powers."
    },
    {
      "pk": 18002004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 4,
      "text": "\"Therefore, I swear by my kingdom and by my throne that I will take vengeance upon them all. I will do what I have said: every region belonging to my government shall be destroyed.\"",
      "links": "<a href='/AIV/07/11/30-31'>Judg. 11:30-31</a>; <a href='/AIV/10/19/12'>2 Sam. 19:12</a>",
      "comment": "Earthly oaths sworn by king and throne find a contrast with oaths made before God (see Matt. 5:33-37), underscoring the fleeting power of earthly rulers."
    },
    {
      "pk": 18002005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 5,
      "text": "\"You, then, shall summon to me all the rulers and leaders of the lands; bring them all to me, from every province and every people, who are under my dominion.\"",
      "links": "<a href='/AIV/27/03/2-3'>Dan. 3:2-3</a>",
      "comment": "This verse reflects the imperial structure of ancient empires and the gathering of leaders, similar to events in Daniel 3, where idolatry is enforced."
    },
    {
      "pk": 18002006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 6,
      "text": "\"Not one shall disobey my command; all shall come and help me in my vengeance.\"",
      "links": "<a href='/AIV/17/03/8-14'>Esth. 3:8-14</a>",
      "comment": "The demand for universal allegiance prefigures the totalitarian demands placed upon the faithful in later Jewish history, such as in the time of Esther."
    },
    {
      "pk": 18002007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 7,
      "text": "After he had finished speaking these words, Nebuchadnezzar king of the Assyrians summoned Holofernes, the chief commander of his army, second to himself, and said to him:",
      "links": "<a href='/AIV/39/03/1-6'>Mal. 3:1-6</a>; <a href='/AIV/01/41/41-44'>Gen. 41:41-44</a>",
      "comment": "Just as Joseph and other biblical figures held high positions under pagan rulers (Gen. 41:41-44), so Holofernes is elevated here to command."
    },
    {
      "pk": 18002008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 8,
      "text": "\"Thus says the great king, lord of all the earth: Go from my presence and take with you men of proven courage—one hundred and twenty thousand foot soldiers and twelve thousand cavalry.\"",
      "links": "<a href='/AIV/06/08/3'>Josh. 8:3</a>; <a href='/AIV/10/24/9'>2 Sam. 24:9</a>",
      "comment": "The massive forces described here signify the worldly might arrayed against the people of God. See also large army counts in Israel’s history (2 Sam. 24:9)."
    },
    {
      "pk": 18002009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 9,
      "text": "\"Go out against all the western regions, because they have disobeyed my command.\"",
      "links": "<a href='/AIV/23/37/24-25'>Isa. 37:24-25</a>",
      "comment": "The regions to the west, including the land of Israel, are here targeted because of their supposed rebellion, paralleling other instances of hostile edicts against Jerusalem."
    },
    {
      "pk": 18002010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 10,
      "text": "\"Declare to them that they must prepare earth and water, for I am coming against them in my wrath, and my feet will cover the whole plain with the dust of my soldiers, and I will fill their valleys and rivers with the slain.\"",
      "links": "<a href='/AIV/23/10/6'>Isa. 10:6</a>",
      "comment": "\"Earth and water\" is a symbol of submission. Nebuchadnezzar’s wrathful language highlights the desperation and severity of the threat faced by God's people, similar to the imagery in Isaiah."
    },
    {
      "pk": 18002011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 11,
      "text": "\"I will lead them away as captives to the ends of the earth.\"",
      "links": "<a href='/AIV/23/11/12'>Isa. 11:12</a>",
      "comment": "Threats of exile are a recurring theme in Israel’s history as both threat and fulfillment of covenant consequences (cf. Lev. 26:33; Deut. 28:64)."
    },
    {
      "pk": 18002012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 12,
      "text": "\"You shall go and seize all their territory for me, and if they surrender themselves to you, safeguard them for me until the day of their punishment.\"",
      "links": "<a href='/AIV/06/21/43-44'>Josh. 21:43-44</a>",
      "comment": "Conditional leniency maps onto ancient practices of trial and reprieve; it also prefigures spiritual themes such as temporal mercy and final judgment."
    },
    {
      "pk": 18002013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 13,
      "text": "\"But if they resist, let no eye have compassion on them; deliver them to slaughter and plunder throughout all your kingdom.\"",
      "links": "<a href='/AIV/24/21/7'>Jer. 21:7</a>",
      "comment": "This is a harsh and absolute command, mirroring some Old Testament judgments but here as an expression of pagan cruelty rather than divine justice."
    },
    {
      "pk": 18002014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 14,
      "text": "So Holofernes called all the commanders, generals, and officers of the Assyrian army.",
      "links": "<a href='/AIV/27/03/2-3'>Dan. 3:2-3</a>",
      "comment": "The military organization is recounted with precision, emphasizing the unstoppable might that appears to threaten God’s people—a classic setup for God’s deliverance."
    },
    {
      "pk": 18002015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 15,
      "text": "He mustered the chosen soldiers as his lord had commanded: one hundred and twenty thousand foot soldiers and twelve thousand skilled cavalrymen, arranged as a great army.",
      "links": "<a href='/AIV/11/20/29'>1 Kgs. 20:29</a>",
      "comment": "The abundant numbers underscore the scale of the threat faced by the faithful—a motif that recurs before God’s miraculous interventions throughout Scripture."
    },
    {
      "pk": 18002016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 16,
      "text": "He also took along a vast number of camels, donkeys, and mules for their transport, and countless sheep, cattle, and goats for their provisions.",
      "links": "<a href='/AIV/04/31/32-34'>Num. 31:32-34</a>",
      "comment": "Provisioning an army is as important as its size. The emphasis on material abundance contrasts with the spiritual resources of God's people."
    },
    {
      "pk": 18002017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 17,
      "text": "Every man received his supply of food and water from the storehouses; the order was given not to spare any expense for the army’s needs.",
      "links": "<a href='/AIV/02/12/32-36'>Exod. 12:32-36</a>",
      "comment": "The army’s thorough preparation foreshadows subsequent encounters in salvation history, where the faithful prevail not by might, but by God’s providence."
    },
    {
      "pk": 18002018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 18,
      "text": "He and all his army set out ahead of King Nebuchadnezzar to cover the entire western area with their chariots, horsemen, and chosen foot soldiers.",
      "links": "<a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "Reliance on chariots and armies is repeatedly shown in the Old Testament to be ultimately futile against God’s power (Ps. 20:7)."
    },
    {
      "pk": 18002019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 19,
      "text": "Countless men joined them, like a swarm of locusts or the sand on the seashore, for their numbers could not be counted.",
      "links": "<a href='/AIV/07/07/12'>Judg. 7:12</a>; <a href='/AIV/01/22/17'>Gen. 22:17</a>",
      "comment": "Imagery of innumerable multitudes draws from Israel’s own promises (Gen. 22:17) but here describes a threat—reminding us that God’s promises to His people are of spiritual, not merely numerical, value."
    },
    {
      "pk": 18002020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 20,
      "text": "They marched out of Nineveh on a three days’ journey toward the plain of Bectileth, and they set up camp near Bectileth, at the foot of the mountains to the north of Upper Cilicia.",
      "links": "<a href='/AIV/32/03/3'>Jonah 3:3</a>",
      "comment": "The details of the route echo historical campaigns, while the strategically set encampment shows the real human threat facing Israel."
    },
    {
      "pk": 18002021,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 21,
      "text": "Holofernes took all his forces, the infantry, the cavalry, and the chariots, and he advanced from there into the hill country.",
      "links": "<a href='/AIV/06/10/6-9'>Josh. 10:6-9</a>",
      "comment": "The movement into hill country is significant: throughout the Old Testament, such terrain often becomes the stage for miraculous deliverance by God."
    },
    {
      "pk": 18002022,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 22,
      "text": "He destroyed Put and Lud, and plundered all the Rassisites and Ishmaelites on the edge of the wilderness near the land of Chelon.",
      "links": "<a href='/AIV/24/46/9-11'>Jer. 46:9-11</a>; <a href='/AIV/01/25/13-18'>Gen. 25:13-18</a>",
      "comment": "References to neighboring peoples underscore the widespread scope of destruction, shaped by the pride of the conquering empire."
    },
    {
      "pk": 18002023,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 23,
      "text": "Then he crossed the Euphrates and entered Mesopotamia, destroying all the fortified cities that were near the river, all the way to the sea.",
      "links": "<a href='/AIV/01/15/18'>Gen. 15:18</a>",
      "comment": "The reach of Holofernes' campaign hints at the full extent of ancient empires; the mention of the Euphrates recalls the boundaries of the land promised to Abraham, but here under assault."
    },
    {
      "pk": 18002024,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 24,
      "text": "He captured the regions of Cilicia and cut down all who opposed him. Then he reached the southern borders of Japheth, facing toward Arabia.",
      "links": "<a href='/AIV/01/10/2-5'>Gen. 10:2-5</a>",
      "comment": "Names of ancient peoples tie this campaign to the Table of Nations, reminding us of the universal scope of God’s providence."
    },
    {
      "pk": 18002025,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 25,
      "text": "He surrounded all the Midianites, burned their tents, and plundered their livestock.",
      "links": "<a href='/AIV/04/31/7-9'>Num. 31:7-9</a>",
      "comment": "The defeat and destruction of the Midianites connects with their role in earlier opposition to Israel (see Num. 31), showing the cyclical nature of hostilities."
    },
    {
      "pk": 18002026,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 26,
      "text": "Then he descended into the plain of Damascus in the time of the wheat harvest and burned all their fields, destroying their flocks, herds, and cities.",
      "links": "<a href='/AIV/23/17/1-2'>Isa. 17:1-2</a>",
      "comment": "The burning of fields during harvest represents not only violence but also economic devastation—a curse reserved for times of judgment in the Old Testament."
    },
    {
      "pk": 18002027,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 27,
      "text": "The fear of him fell upon all the people who lived by the coast, in Sidon and Tyre, in Sur and Ocina, and all the inhabitants of Jamnia. Those living in Azotus and Ascalon were terrified.",
      "links": "<a href='/AIV/06/13/3'>Josh. 13:3</a>; <a href='/AIV/09/05/1'>1 Sam. 5:1</a>",
      "comment": "The focus on coastal cities recalls Philistine strongholds and old adversaries, suggesting the universal reach of Holofernes’s terror, but also setting the stage for God’s intervention."
    },
    {
      "pk": 18002028,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 2,
      "verse": 28,
      "text": "They were so afraid of him that they begged for peace with one voice, saying,",
      "links": "<a href='/AIV/07/08/28'>Judg. 8:28</a>",
      "comment": "As in earlier times, fear and the desire for peace pervade those facing oppression, a motif later reversed when God's people place their trust in Him and receive deliverance."
    }
  ],
  "translatedAt": "2025-12-24T05:00:59.048Z"
}