{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 9,
  "verses": [
    {
      "pk": 18009001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 1,
      "text": "Then Judith fell on her face, put ashes on her head, and uncovered the sackcloth she was wearing. At that time, when the evening sacrifice was being offered in the house of God in Jerusalem, Judith called out to the Lord with a loud voice and said:",
      "links": "<a href='/AIV/03/16/29-31'>Lev. 16:29-31</a>; <a href='/AIV/19/141/2'>Ps. 141:2</a>",
      "comment": "Judith’s humility and her use of ashes and sackcloth recall forms of repentance and supplication common throughout the Old Testament (see Daniel 9:3-4). Her prayer at the time of the evening sacrifice connects her private plea with public worship—a foreshadowing of communal and sacrificial prayer. The gesture parallels how Jesus prayed in the Garden (Luke 22:41), showing the continuity of true worshipers seeking God’s help."
    },
    {
      "pk": 18009002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 2,
      "text": "\"O Lord, God of my ancestor Simeon, you gave him the sword to take vengeance on those strangers who loosed the belt of a virgin to defile her, exposed her thighs to shame, and disgraced my mother's womb. For you said, 'It shall not be done'—yet they did it.\"",
      "links": "<a href='/AIV/01/34/25-31'>Gen. 34:25-31</a>; <a href='/AIV/19/106/30'>Ps. 106:30</a>",
      "comment": "Judith recalls Simeon’s zeal in avenging Dinah (Genesis 34)—an example of righteous anger against profaning God’s people. This sets the stage for her own plea for justice, aligning her mission with God’s will rather than personal vengeance. The focus is on purity and defense of the chosen people, elements echoed later in the protection of the Church."
    },
    {
      "pk": 18009003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 3,
      "text": "\"Therefore, you delivered their rulers to slaughter, and their bed, which was shamefully defiled in their deceit, you brought into blood, striking down the servants together with the princes.\"",
      "links": "<a href='/AIV/01/34/25-29'>Gen. 34:25-29</a>",
      "comment": "Judith names God as the true source of deliverance and justice, reminding the Israelites that any victory comes by God's hand. This humility and recognition of divine providence parallels later Christian understanding of salvation as a gift from God, not earned by human effort alone (Ephesians 2:8-9)."
    },
    {
      "pk": 18009004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 4,
      "text": "\"You handed over their wives and their daughters into captivity, and all their spoils to be divided among your beloved children, who were zealous for you and detested the defilement of their blood, and called on you for help. O God, my God, listen to me, a widow.\"",
      "links": "<a href='/AIV/01/34/27-29'>Gen. 34:27-29</a>; <a href='/AIV/19/68/6'>Ps. 68:6</a>",
      "comment": "By calling on God as her personal protector (‘my God’), Judith displays intimate trust in the Lord’s care for the marginalized, such as widows. The reference to God’s children detesting defilement anticipates Christian emphasis on holiness and the call to be ‘a chosen race, a royal priesthood’ (1 Peter 2:9)."
    },
    {
      "pk": 18009005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 5,
      "text": "\"You did these things, what you willed then, and all your plans have come to pass. The things you planned are present, and said, 'See, we are here!' For all your ways are prepared, and your judgments are with foreknowledge.\"",
      "links": "<a href='/AIV/23/14/24-27'>Isa. 14:24-27</a>; <a href='/AIV/45/11/33-36'>Rom. 11:33-36</a>",
      "comment": "Judith’s acknowledgment of God’s foreknowledge and sovereignty reflects biblical teaching on God’s providence and omniscience. This foreshadows later Christian doctrines about God’s governance of history and his faithfulness to his promises."
    },
    {
      "pk": 18009006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 6,
      "text": "\"See, the Assyrians are increased in their strength. They are exalted by their horses and riders. They boast in the power of their foot soldiers. They trust in shield, spear, bow, and sling. But they do not know that you are the Lord, the one who crushes wars.\"",
      "links": "<a href='/AIV/19/20/7-8'>Ps. 20:7-8</a>; <a href='/AIV/04/14/42-43'>Num. 14:42-43</a>",
      "comment": "Judith contrasts human power with divine power, just as David does in his psalms. This prepares the reader for the theme that ultimate victory belongs to God alone—a theme manifest in Christ’s victory achieved not through violence, but through self-giving love (1 Cor. 1:27)."
    },
    {
      "pk": 18009007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 7,
      "text": "\"You, Lord, is your name. Shatter their might with your strength. Bring down their power in your anger. For they plan to defile your sanctuary, pollute the dwelling where your glorious name rests, and to destroy the altar with sword and fire.\"",
      "links": "<a href='/AIV/02/3/15'>Exod. 3:15</a>; <a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "Judith prays for the protection of the sanctuary—the place where God's presence dwells. There is a spiritual connection to the concept of the Church as God’s dwelling and the Eucharist as a new form of holy altar. Defenders of the faith must pray for both spiritual and visible unity."
    },
    {
      "pk": 18009008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 8,
      "text": "\"See their arrogance, Lord! Pour out your wrath on their heads. Give to me, a widow, the strength to accomplish what I have planned. By the deceit of my lips strike down the servant together with the master, and their leader together with his attendants.\"",
      "links": "<a href='/AIV/19/94/1-2'>Ps. 94:1-2</a>; <a href='/AIV/07/4/9'>Judg. 4:9</a>",
      "comment": "Judith’s humble boldness—asking for the strength to carry out a plan aligned with God's will—recalls the repeated theme that God uses the weak to shame the strong (1 Cor. 1:27; Judges 4:9). Her willingness to be God’s instrument is a model for all believers, especially in serving God even when the world despises the humble."
    },
    {
      "pk": 18009009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 9,
      "text": "\"Crush their pride by a woman’s hand. For your power is not in numbers, nor does your might depend upon strong men; you are the God of the lowly, the helper of the oppressed, the sustainer of the weak, the protector of the forsaken, and the savior of those without hope.\"",
      "links": "<a href='/AIV/19/68/5'>Ps. 68:5</a>; <a href='/AIV/46/1/27-29'>1 Cor. 1:27-29</a>",
      "comment": "God’s victory through a woman's hand prefigures the lifting up of the humble and the exaltation of the lowly. This can be seen as a type of Mary’s Magnificat (Luke 1:51-52), and importantly highlights the unique and powerful role of women in God’s plan of salvation."
    },
    {
      "pk": 18009010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 10,
      "text": "\"Hear me, Lord, God of my ancestors, at this very hour, and give to me success in what I am about to do, so that it may be for the exaltation of Jerusalem and for your people. Let all the nations know and acknowledge that you are God, the God of all power and might, and that there is no other who protects the people of Israel but you.\"",
      "links": "<a href='/AIV/19/46/10'>Ps. 46:10</a>; <a href='/AIV/23/45/5-6'>Isa. 45:5-6</a>",
      "comment": "Judith’s prayer unites her mission to God’s glory and the good of all his people, showing a deep concern for the unity and sanctity of the worshiping community—a principle emphasized by the apostolic leadership of the early Church (Acts 2:42-47)."
    },
    {
      "pk": 18009011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 11,
      "text": "\"Now, Lord, hear my prayer, a widow. You have done the things of old, and those yet to come you design and plan. The things you have decided have come to pass, and the things you wish stand before you. The things you intend happen and declare, 'Here we are.'\"",
      "links": "<a href='/AIV/23/46/10'>Isa. 46:10</a>; <a href='/AIV/19/33/9-11'>Ps. 33:9-11</a>",
      "comment": "Judith again emphasizes God’s timeless foreknowledge and sovereignty, showing trust that history unfolds according to God’s wise plan and not by human will. This view finds fulfillment in the New Testament (Romans 8:28; Ephesians 1:11)."
    },
    {
      "pk": 18009012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 12,
      "text": "\"You see the things coming upon us, you see our distress. Have mercy now on me, the widow. Give me the strength, O Lord, God of the Most High. By the word of my lips let there be a wound and a bruise for those who have planned cruel things against your covenant and your consecrated house, Mount Zion and the house your children possess.\"",
      "links": "<a href='/AIV/19/102/13-14'>Ps. 102:13-14</a>; <a href='/AIV/23/37/17'>Isa. 37:17</a>",
      "comment": "The mention of the covenant and consecrated house links Judith’s prayer to the tradition of temple worship, the continuity of God’s chosen people, and the perpetual promise of divine protection (see Psalm 132:13-18). This has spiritual implications for the permanence and centrality of God’s worshiping community."
    },
    {
      "pk": 18009013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 13,
      "text": "\"Let all the nations, every tribe and tongue, know that you are God, all-powerful and mighty, and that there is no other who protects the offspring of Israel but you!\"",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>; <a href='/AIV/66/7/9'>Rev. 7:9</a>",
      "comment": "This verse prefigures the universal call of salvation, fulfilled in Christ, that ‘every tribe and tongue’ shall worship the Lord (Revelation 7:9). The exclusive faith in God who saves anticipates the unity of believers from all nations."
    },
    {
      "pk": 18009014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 9,
      "verse": 14,
      "text": "\"Let them know that you alone are God, glorious over all the earth.\"",
      "links": "<a href='/AIV/19/83/18'>Ps. 83:18</a>; <a href='/AIV/23/45/21-22'>Isa. 45:21-22</a>",
      "comment": "Judith ends her prayer with glorification of the one true God, echoing the Shema (Deuteronomy 6:4). This universal confession points toward the fulfillment in Christ, ‘at the name of Jesus every knee should bow’ (Philippians 2:10-11)."
    }
  ],
  "translatedAt": "2025-12-24T05:04:20.358Z"
}