{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 7,
  "verses": [
    {
      "pk": 18007001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 1,
      "text": "The next day, Holofernes ordered all his army and the allied forces to move against Bethulia, to take possession of the hill country and seize all the mountain passes.",
      "links": "<a href='/AIV/18/4/7'>Jdt 4:7</a>; <a href='/AIV/18/6/1'>Jdt 6:1</a>",
      "comment": "This verse shows the military strategy against the faithful in Bethulia, emphasizing the importance of defending the holy city, reminiscent of the defense of Jerusalem (Nehemiah 4:13)."
    },
    {
      "pk": 18007002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 2,
      "text": "All the fighting men moved up that night, taking positions near the springs on the slopes below Bethulia. They placed their main camp in the valley and deployed auxiliary troops to block the access roads.",
      "links": "<a href='/AIV/18/6/12'>Jdt 6:12</a>",
      "comment": "The besieging army not only plans to cut off water but also lines of escape. The motif of water and siege recalls other biblical moments of trial, such as Exodus 14:22, drawing a parallel to spiritual sustenance in difficult times."
    },
    {
      "pk": 18007003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 3,
      "text": "Their camp extended over the entire plain, covering it from Dothan to Belbaim, facing Bethulia.",
      "links": "<a href='/AIV/18/3/9'>Jdt 3:9</a>",
      "comment": "The scope of enemy presence surrounding the city underscores the dire situation, illustrating the overwhelming opposition often faced by the people of God."
    },
    {
      "pk": 18007004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 4,
      "text": "When the Israelites saw the immense multitude, they were greatly troubled and said to each other, 'These people are going to consume the whole land. Not even the highest mountain or deepest valley will escape their strength.'",
      "links": "<a href='/AIV/19/46/2'>Ps. 46:2</a>; <a href='/AIV/18/6/19'>Jdt 6:19</a>",
      "comment": "The fear and anxiety of the people reflect common human reactions to overwhelming trouble, yet God's providence is often revealed in such moments, foreshadowing Christ's own steadfastness during His Passion."
    },
    {
      "pk": 18007005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 5,
      "text": "Still, each man took up his arms. They lit fires on the ramparts and kept watch all night.",
      "links": "<a href='/AIV/16/4/21'>Neh. 4:21</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "The vigilance of the city’s defenders highlights the call for perseverance and spiritual alertness, a recurring theme seen in the Gospels (Mark 13:33)."
    },
    {
      "pk": 18007006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 6,
      "text": "On the second day, Holofernes called together all his officials and said to them, 'Tell me, how we can best subdue these Israelites who keep resisting us without direct combat.'",
      "links": "<a href='/AIV/18/5/1'>Jdt 5:1</a>",
      "comment": "Here, the enemy's craftiness echoes Satan’s temptation of Christ (Matthew 4:1-11), preparing for spiritual conquest, not merely physical battle."
    },
    {
      "pk": 18007007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 7,
      "text": "Achior and the leaders of Ammon replied, 'My lord, if you encircle the spring which flows out at the foot of the mountain, not one of them will hold out. Thirst will destroy them, and they will surrender their city.'",
      "links": "<a href='/AIV/18/6/7'>Jdt 6:7</a>; <a href='/AIV/02/17/3'>Ex. 17:3</a>",
      "comment": "Water as a source of life in the biblical narrative often foreshadows spiritual sustenance (John 4:14). Cutting off water parallels spiritual desolation and temptation."
    },
    {
      "pk": 18007008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 8,
      "text": "So Holofernes and his army of one hundred and seventy thousand infantry and twelve thousand cavalry deployed around the spring, occupying every entrance and exit to the city.",
      "links": "<a href='/AIV/18/2/5'>Jdt 2:5</a>",
      "comment": "The immense numbers stress the impossibility of human rescue—coinciding with God working through apparent hopelessness (see 2 Chronicles 20:15)."
    },
    {
      "pk": 18007009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 9,
      "text": "For thirty-four days, the entire army, along with all their chariots and supplies, remained around Bethulia. They allowed no one to come or go.",
      "links": "<a href='/AIV/18/7/20'>Jdt 7:20</a>; <a href='/AIV/20/21/9'>Prov. 21:9</a>",
      "comment": "Sustained siege echoes struggles of the saints persevering through trials, recalling James 1:3's blessing of endurance."
    },
    {
      "pk": 18007010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 10,
      "text": "The stores of water ran out in the city. The wells no longer gave enough for the people to drink. Their jars emptied, and their daily ration was strictly limited.",
      "links": "<a href='/AIV/18/8/21'>Jdt 8:21</a>; <a href='/AIV/02/17/1'>Ex. 17:1</a>",
      "comment": "Physical deprivation in the text also functions as spiritual allegory. Many church fathers read this scene as symbolic of the need for God’s grace during droughts of faith (cf. Amos 8:11)."
    },
    {
      "pk": 18007011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 11,
      "text": "Little children fainted. Women and young men collapsed in the streets from thirst, and the city’s gates were locked to prevent escape.",
      "links": "<a href='/AIV/25/2/11-12'>Lam. 2:11-12</a>",
      "comment": "Physical suffering draws a parallel to Lamentations, highlighting that faith communities are not immune to hardship."
    },
    {
      "pk": 18007012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 12,
      "text": "All the people—young, old, children—gathered around Uzziah and the city leaders, crying out with great lament:",
      "links": "<a href='/AIV/18/6/14'>Jdt 6:14</a>",
      "comment": "Assembling before the elders illustrates the proper role of spiritual authority and communal leadership, reminiscent of Acts 15:6."
    },
    {
      "pk": 18007013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 13,
      "text": "'May God be judge between us and you! You have done evil by not surrendering the city to the Assyrians. Now we will all die of thirst and starvation.'",
      "links": "<a href='/AIV/01/31/53'>Gen. 31:53</a>",
      "comment": "The desperate appeal to divine judgment reflects deep agony, echoing Israel's frequent cry for deliverance (Psalm 43:1)."
    },
    {
      "pk": 18007014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 14,
      "text": "'Call the Assyrians now! Surrender us to Holofernes’s army before we watch our little ones fall dead before our eyes.'",
      "links": "<a href='/AIV/18/6/11'>Jdt 6:11</a>; <a href='/AIV/02/14/11-12'>Ex. 14:11-12</a>",
      "comment": "Such complaints mirror those during the Exodus, when Israel cried for deliverance but doubted God's promise. Spiritual courage is tested most at breaking point."
    },
    {
      "pk": 18007015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 15,
      "text": "'It would be better for us to become captives and live than to watch these misfortunes befall our families and see death take over the city.'",
      "links": "<a href='/AIV/18/7/14'>Jdt 7:14</a>; <a href='/AIV/02/16/3'>Ex. 16:3</a>",
      "comment": "The people's crisis of faith recalls similar complaints in Exodus; human perspective contrasts with God’s providence, which often works through apparent defeat."
    },
    {
      "pk": 18007016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 16,
      "text": "They spoke bitterly and with strong emotion to the city’s officials. Their voices rose to the heavens in lamentation.",
      "links": "<a href='/AIV/19/55/17'>Ps. 55:17</a>",
      "comment": "Prayer and lament before God are fundamental in the Bible. Here, the people's grievances are part of the mystery of suffering as spiritual formation (Romans 8:18-28)."
    },
    {
      "pk": 18007017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 17,
      "text": "Uzziah and Chabris and Charmis, the city’s elders, tried to calm the people, saying, 'Be patient, brothers! Give us five more days to wait for the Lord’s mercy.'",
      "links": "<a href='/AIV/18/8/9'>Jdt 8:9</a>; <a href='/AIV/19/130/5'>Ps. 130:5</a>",
      "comment": "The elders urge patience and faith, reflecting the biblical theme of waiting for divine action and spiritual leadership through adversity."
    },
    {
      "pk": 18007018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 18,
      "text": "'If God does not help us in these days, we will surrender to Holofernes and face our fate. But do not force us to act rashly before God’s time.'",
      "links": "<a href='/AIV/18/7/17'>Jdt 7:17</a>; <a href='/AIV/19/27/14'>Ps. 27:14</a>",
      "comment": "Trust in God’s timing is a key biblical lesson. The leaders advocate for discernment, reminiscent of Christ in Gethsemane, awaiting the Father’s will (Luke 22:42)."
    },
    {
      "pk": 18007019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 19,
      "text": "They persuaded the people to stay in their positions on the walls through the night. Everyone returned to their homes, and the elders prayed earnestly to the God of Israel.",
      "links": "<a href='/AIV/16/4/9'>Neh. 4:9</a>; <a href='/AIV/19/34/4'>Ps. 34:4</a>",
      "comment": "The power of prayer in times of crisis is a recurring theme throughout Scripture, pointing to Christ’s example of persistent prayer (Luke 18:1)."
    },
    {
      "pk": 18007020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 20,
      "text": "But their thirst became more severe, and the city’s defenders lost all strength as water shortages increased.",
      "links": "<a href='/AIV/18/7/10'>Jdt 7:10</a>; <a href='/AIV/25/4/4'>Lam. 4:4</a>",
      "comment": "Suffering intensifies before deliverance. Just as Christ endured agony before resurrection, so spiritual life often deepens under adversity."
    },
    {
      "pk": 18007021,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 21,
      "text": "The children lost their courage. Women and young men collapsed from thirst and fell in the streets of the city.",
      "links": "<a href='/AIV/25/2/11-12'>Lam. 2:11-12</a>",
      "comment": "This verse reiterates the suffering seen earlier. The innocent endure hardship, pointing toward greater spiritual lessons about redemptive suffering."
    },
    {
      "pk": 18007022,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 22,
      "text": "All the people, young and old, gathered together and cried out to God with loud voices, begging for mercy.",
      "links": "<a href='/AIV/19/34/6'>Ps. 34:6</a>; <a href='/AIV/19/22/1'>Ps. 22:1</a>",
      "comment": "Communal prayer is a powerful biblical tool, foreshadowing the unity seen among the believers in Acts 2:42."
    },
    {
      "pk": 18007023,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 23,
      "text": "Uzziah spoke to them, 'Be strong, my brothers. Hold fast for five more days. By then, the Lord will send us deliverance.'",
      "links": "<a href='/AIV/19/27/14'>Ps. 27:14</a>; <a href='/AIV/07/7/7'>Judg. 7:7</a>",
      "comment": "His exhortation to endurance reflects the biblical virtue of steadfast hope (Romans 15:4)."
    },
    {
      "pk": 18007024,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 24,
      "text": "'But if these days pass without help, I will do as you have said.'",
      "links": "<a href='/AIV/18/7/18'>Jdt 7:18</a>",
      "comment": "Uzziah’s compromise illustrates the struggle between faith and fear, yet trust in God’s providence is viewed as a virtue throughout Scripture."
    },
    {
      "pk": 18007025,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 25,
      "text": "He dismissed the crowds, and each returned to their station on the wall and to their homes, still suffering greatly from thirst.",
      "links": "<a href='/AIV/18/7/19'>Jdt 7:19</a>",
      "comment": "Their perseverance, even in affliction, echoes themes of Christian endurance found throughout the New Testament (2 Corinthians 1:6)."
    },
    {
      "pk": 18007026,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 26,
      "text": "The women and children collapsed in the streets and at the gates, and there was no longer any strength in them.",
      "links": "<a href='/AIV/25/2/12'>Lam. 2:12</a>",
      "comment": "The weakness of the people foreshadows their utter dependence on divine intervention, a recurring spiritual principle (Isaiah 40:29)."
    },
    {
      "pk": 18007027,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 27,
      "text": "The whole city groaned in anguish.",
      "links": "<a href='/AIV/19/102/18-20'>Ps. 102:18-20</a>",
      "comment": "This collective suffering is a form of redemptive lament, a motif which later invites divine mercy (see Psalm 102)."
    },
    {
      "pk": 18007028,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 28,
      "text": "Then, all the people, men, women, and children, raised their voices with a loud cry to God.",
      "links": "<a href='/AIV/19/120/1'>Ps. 120:1</a>; <a href='/AIV/19/34/6'>Ps. 34:6</a>",
      "comment": "Crying out collectively to God recalls the communal prayers in times of national distress, uniting the faithful in petition (Joel 2:12-17)."
    },
    {
      "pk": 18007029,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 29,
      "text": "They pleaded before the Lord Almighty with hands raised, longing for mercy.",
      "links": "<a href='/AIV/19/28/2'>Ps. 28:2</a>; <a href='/AIV/54/2/8'>1 Tim. 2:8</a>",
      "comment": "Uplifted hands in prayer symbolize both worship and supplication. See the tradition of prayer posture in Psalm 28:2, connecting Old and New Testament practice."
    },
    {
      "pk": 18007030,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 30,
      "text": "Uzziah led the people in prayer, urging them to trust in God’s deliverance.",
      "links": "<a href='/AIV/19/34/17'>Ps. 34:17</a>; <a href='/AIV/12/19/20'>2 Kings 19:20</a>",
      "comment": "Leadership in prayer is key in biblical faith; spiritual authority guides the people toward hope and reliance upon the Lord’s salvation."
    },
    {
      "pk": 18007031,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 31,
      "text": "Even as all prayed continuously, the siege wore on and water supplies grew worse.",
      "links": "<a href='/AIV/19/88/18'>Ps. 88:18</a>",
      "comment": "Persistence in prayer despite worsening circumstances recalls Christ’s teaching on fervent, persistent prayer (Luke 18:1-8)."
    },
    {
      "pk": 18007032,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 7,
      "verse": 32,
      "text": "Their infants fainted, the women and young men wasted away from thirst, and the people lost all hope.",
      "links": "<a href='/AIV/25/2/12'>Lam. 2:12</a>; <a href='/AIV/19/37/39'>Ps. 37:39</a>",
      "comment": "Hopelessness seduces God’s people right before divine intervention. In the fullness of time, God will raise up an unexpected deliverer, foreshadowing Christ’s coming at a time of greatest need."
    }
  ],
  "translatedAt": "2025-12-24T05:03:10.351Z"
}