{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 8,
  "verses": [
    {
      "pk": 18008001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 1,
      "text": "At that time, news reached Judith, daughter of Merari, son of Ox, son of Joseph, son of Ozel, son of Elai, son of Jamnor, son of Gideon, son of Raphael, son of Ahithub, son of Elijah, son of Hilkiah, son of Eliab, son of Nathanael, son of Salamiel, son of Sarasaddai, son of Israel.",
      "links": "<a href='/AIV/1/46/20'>Gen. 46:20</a>; <a href='/AIV/4/1/7'>Num. 1:7</a>",
      "comment": "Judith’s genealogy is traced in detail, affirming her noble Jewish birth from a prominent lineage within Israel, which stresses the importance of tradition and inheritance, themes similarly reflected in the preservation of the faith and teachings throughout history."
    },
    {
      "pk": 18008002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 2,
      "text": "Her husband Manasseh had died during the barley harvest.",
      "links": "<a href='/AIV/1/35/20'>Gen. 35:20</a>; <a href='/AIV/20/31/10'>Prov. 31:10</a>",
      "comment": "Judith’s widowhood is significant, as it symbolizes both personal suffering and the enduring hope and faith in God’s providence, reflecting the biblical motif where widows often receive special care from God (cf. <a href='/AIV/19/68/5'>Ps. 68:5</a>)."
    },
    {
      "pk": 18008003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 3,
      "text": "He had suffered heatstroke in Bethulia, while he was supervising those who were binding sheaves in the fields.",
      "links": "<a href='/AIV/8/2/22'>Ruth 2:22</a>; <a href='/AIV/18/1/5'>Judith 1:5</a>",
      "comment": "The mention of Bethulia connects the setting to earlier parts of the story and grounds the events in a real community. Manasseh’s death during harvest calls to mind the cycle of life and God’s providence."
    },
    {
      "pk": 18008004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 4,
      "text": "He was carried back to Bethulia, where he died, and was buried with his ancestors in the field between Dothan and Balamon.",
      "links": "<a href='/AIV/1/23/19'>Gen. 23:19</a>; <a href='/AIV/6/24/33'>Josh. 24:33</a>",
      "comment": "Burial among ancestors highlights the continuity of faith across generations. It echoes Old Testament traditions of honoring the dead within one’s lineage."
    },
    {
      "pk": 18008005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 5,
      "text": "Judith remained a widow for three years and four months.",
      "links": "<a href='/AIV/42/2/36-37'>Luke 2:36-37</a>; <a href='/AIV/8/16/22'>Judith 16:22</a>",
      "comment": "The deliberate mention of her extended widowhood connects to the virtue of perseverance in holiness, similar to Anna the prophetess (Luke 2)."
    },
    {
      "pk": 18008006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 6,
      "text": "She made herself a tent on the roof of her house, and wore sackcloth around her waist. She fasted all the days of her widowhood except on the sabbaths, the new moons, and the feast days of Israel.",
      "links": "<a href='/AIV/3/29/33'>Lev. 23:33</a>; <a href='/AIV/19/35/13'>Ps. 35:13</a>",
      "comment": "Here, Judith exemplifies the spiritual discipline of fasting and prayer, echoing the value placed on ascetic practices. Her observance of sacred times mirrors the rhythm of worship established by God."
    },
    {
      "pk": 18008007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 7,
      "text": "She was very beautiful in appearance, and her husband Manasseh had left her gold and silver, servants and maidservants, cattle and lands; she owned all these.",
      "links": "<a href='/AIV/20/31/10-31'>Prov. 31:10-31</a>; <a href='/AIV/19/112/3'>Ps. 112:3</a>",
      "comment": "Judith’s beauty and resources recall the godly woman of Proverbs 31, showing that material blessings can be used for God’s glory while remaining humble and devout."
    },
    {
      "pk": 18008008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 8,
      "text": "No one spoke ill of her, for she greatly feared God.",
      "links": "<a href='/AIV/18/11/18'>Judith 11:18</a>; <a href='/AIV/20/31/30'>Prov. 31:30</a>",
      "comment": "Her reputation of holiness highlights that true fear of God is visible to others in one’s conduct (see also Proverbs 31)."
    },
    {
      "pk": 18008009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 9,
      "text": "She heard what the people said—that the water supply had failed, and she learned that the people were rebelling against Uzziah and the rulers because of thirst.",
      "links": "<a href='/AIV/18/7/1-7'>Judith 7:1-7</a>; <a href='/AIV/4/20/2'>Num. 20:2</a>",
      "comment": "The crisis of water scarcity recalls earlier biblical events (e.g., Exodus), where God's providence is contrasted with people's doubts."
    },
    {
      "pk": 18008010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 10,
      "text": "Judith sent her maid, who was in charge of all her things, to call Uzziah, Chabris, and Charmis, the elders of her city.",
      "links": "<a href='/AIV/18/6/16'>Judith 6:16</a>; <a href='/AIV/2/18/15'>Ex. 18:15</a>",
      "comment": "Judith’s initiative in approaching the city elders shows the critical role of spiritual leadership, reminiscent of the importance of wise counselors in salvation history."
    },
    {
      "pk": 18008011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 11,
      "text": "They came to her, and she said to them, 'Listen to me, rulers of the people of Bethulia! What you have said to the people today is not right; it will bring punishment.",
      "links": "<a href='/AIV/20/15/22'>Prov. 15:22</a>; <a href='/AIV/21/5/6'>Eccl. 5:6</a>",
      "comment": "Judith rebukes the elders for their poor judgment, showing the importance of speaking truth even to those in authority."
    },
    {
      "pk": 18008012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 12,
      "text": "You have set an oath between God and yourselves, promising to surrender the city to our enemies if the Lord does not help us within these days.",
      "links": "<a href='/AIV/3/27/2'>Lev. 27:2</a>; <a href='/AIV/4/30/2'>Num. 30:2</a>",
      "comment": "The making of oaths underscores the seriousness of promises before God. Judith critiques rash vows, which echoes the biblical caution against binding oaths except in submission to God’s will."
    },
    {
      "pk": 18008013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 13,
      "text": "Who are you to put God to the test today, and to set yourselves in the place of God among men?",
      "links": "<a href='/AIV/5/6/16'>Deut. 6:16</a>; <a href='/AIV/40/4/7'>Matt. 4:7</a>",
      "comment": "Judith’s rhetorical question echoes Deuteronomy: 'You shall not put the LORD your God to the test.' Her rebuke points toward deep trust and reliance on divine will, anticipating Jesus' own citation in the temptation narrative."
    },
    {
      "pk": 18008014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 14,
      "text": "You are testing the Lord Almighty, but you will never know anything unless he decides by his will.",
      "links": "<a href='/AIV/19/115/3'>Ps. 115:3</a>; <a href='/AIV/23/40/13'>Isa. 40:13</a>",
      "comment": "Judith boldly affirms God’s sovereignty. Her challenge highlights our dependence on divine initiative, a recurring biblical theme."
    },
    {
      "pk": 18008015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 15,
      "text": "You cannot force him to act as a man, or dictate to him as you might do to another human.",
      "links": "<a href='/AIV/19/50/21'>Ps. 50:21</a>; <a href='/AIV/45/9/20'>Rom. 9:20-21</a>",
      "comment": "God cannot be manipulated by human expectations, a humility echoed in Paul’s letters about God’s authority over the clay (Romans 9)."
    },
    {
      "pk": 18008016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 16,
      "text": "Therefore, wait for his salvation, and do not set a time limit for the Lord our God, for he is not like man to be threatened or compelled.",
      "links": "<a href='/AIV/19/27/14'>Ps. 27:14</a>; <a href='/AIV/45/8/24-25'>Rom. 8:24-25</a>",
      "comment": "The call to wait on God for salvation links beautifully to biblical patience; salvation comes in God’s timing, not ours."
    },
    {
      "pk": 18008017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 17,
      "text": "Call to mind what he did to Abraham, and how he tested Isaac, and everything that happened to Jacob in Mesopotamia, Syria, while he was tending the flocks for Laban, his mother’s brother.",
      "links": "<a href='/AIV/1/22/1-19'>Gen. 22:1-19</a>; <a href='/AIV/1/29/1-30/43'>Gen. 29-30</a>",
      "comment": "Judith appeals to the key patriarchs and God’s faithfulness to them under trial, invoking deep roots of tradition and the value of steadfastness."
    },
    {
      "pk": 18008018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 18,
      "text": "For he has not punished us for our sins as he did those who rebelled against him, nor has he brought major disasters upon us.",
      "links": "<a href='/AIV/4/16/41'>Num. 16:41</a>; <a href='/AIV/19/103/10'>Ps. 103:10</a>",
      "comment": "Acknowledging mercy, Judith reinforces the gratitude owed for divine patience and forgiveness, a recurrent theme in Psalms."
    },
    {
      "pk": 18008019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 19,
      "text": "Yet do not let us think, in this time of punishment, to seek vengeance against our enemies, but let us turn to the Lord with contrite hearts, and ask his favor.",
      "links": "<a href='/AIV/1/4/7'>Gen. 4:7</a>; <a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "Judith emphasizes contrition, penitential prayer, and seeking God’s mercy, reflecting important biblical values in approaching trials."
    },
    {
      "pk": 18008020,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 20,
      "text": "Let us wait for his deliverance and trust that he will answer us, if it pleases him.",
      "links": "<a href='/AIV/18/13/4'>Judith 13:4</a>; <a href='/AIV/19/37/7'>Ps. 37:7</a>",
      "comment": "Trusting in God’s timing for deliverance is a frequent scriptural encouragement, and here Judith models spiritual hope and patience."
    },
    {
      "pk": 18008021,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 21,
      "text": "For God will not forsake us, nor will he abandon our people; it would be inconsistent with his mercy and faithfulness.",
      "links": "<a href='/AIV/5/31/6'>Deut. 31:6</a>; <a href='/AIV/58/13/5'>Heb. 13:5</a>",
      "comment": "God’s enduring presence and mercy is reaffirmed; this is both a promise and a challenge to maintain faith and unity in the face of adversity."
    },
    {
      "pk": 18008022,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 22,
      "text": "For if we do not follow him, all of this land will be ruined, and the sanctuary will be destroyed, and God will hold us accountable for its desecration by the Gentiles.",
      "links": "<a href='/AIV/24/7/4'>Jer. 7:4</a>; <a href='/AIV/40/24/2'>Matt. 24:2</a>",
      "comment": "Judith reminds them of covenantal responsibility; faithfulness preserves both the community and the sanctuary, echoing later warnings of Jesus about the Temple’s destruction."
    },
    {
      "pk": 18008023,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 23,
      "text": "Our brothers throughout the land, and the sanctuary and the temple, depend on us; all of this must not fall.",
      "links": "<a href='/AIV/2/25/8'>Ex. 25:8</a>; <a href='/AIV/18/5/19'>Judith 5:19</a>",
      "comment": "This verse points to the unity of worship and community, which become themes of the one people of God entrusted with preserving both liturgy and moral life."
    },
    {
      "pk": 18008024,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 24,
      "text": "Therefore, let us give thanks to the Lord who tests us just as he tested our ancestors.",
      "links": "<a href='/AIV/5/8/2'>Deut. 8:2</a>; <a href='/AIV/19/26/7'>Ps. 26:7</a>",
      "comment": "The act of thanksgiving, even in hardship, reflects profound trust that connects to teachings on redemptive suffering and enduring faith."
    },
    {
      "pk": 18008025,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 25,
      "text": "Remember also how he dealt with Abraham, and how he tested Isaac, and what happened to Jacob in Mesopotamia, living as a shepherd for Laban.",
      "links": "<a href='/AIV/1/22/1-19'>Gen. 22:1-19</a>; <a href='/AIV/1/29/1'>Gen. 29:1</a>",
      "comment": "Repetition here highlights the importance of remembering past fidelities of God, feeding hope for present challenges."
    },
    {
      "pk": 18008026,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 26,
      "text": "He has not punished us as our sins deserved, nor as he did with those who provoked him.",
      "links": "<a href='/AIV/19/103/10'>Ps. 103:10</a>; <a href='/AIV/4/16/35'>Num. 16:35</a>",
      "comment": "The emphasis on mercy is repeated to anchor the theological foundation of forgiveness and the possibility of renewal for the faithful."
    },
    {
      "pk": 18008027,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 27,
      "text": "Now, therefore, let us humble our hearts and seek his favor, and pray that he will remember his covenant with our ancestors and not forsake us in this hour.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/6/2/17'>Josh. 2:17</a>",
      "comment": "Prayer for remembrance of God’s covenant reflects a deep sacramental awareness of God’s ongoing fidelity to his promises."
    },
    {
      "pk": 18008028,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 28,
      "text": "Uzziah said to her, 'All that you have spoken is true, and no one can contradict your words.",
      "links": "<a href='/AIV/20/23/12'>Prov. 23:12</a>; <a href='/AIV/18/11/19'>Judith 11:19</a>",
      "comment": "Uzziah’s acknowledgment of Judith’s wisdom suggests that leadership can come from unexpected people, as God raises up humble yet wise voices."
    },
    {
      "pk": 18008029,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 29,
      "text": "Today, your courage has inspired the people; your words have comforted their hearts.",
      "links": "<a href='/AIV/7/1/6'>Judges 1:6</a>; <a href='/AIV/19/119/50'>Ps. 119:50</a>",
      "comment": "Judith’s speech brings encouragement, modeling the gift of exhortation present throughout salvation history."
    },
    {
      "pk": 18008030,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 30,
      "text": "But if the siege continues and we run out of water, we will act as you have said.",
      "links": "<a href='/AIV/18/7/21'>Judith 7:21</a>; <a href='/AIV/1/42/2'>Gen. 42:2</a>",
      "comment": "The elders yield to Judith’s wisdom but maintain caution, signifying the need for prudence yet openness to grace amid crisis."
    },
    {
      "pk": 18008031,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 31,
      "text": "Pray for us, for you are a godly woman, and God may hear your prayers so that rain will fall and fill up our cisterns, and we will not faint.",
      "links": "<a href='/AIV/18/8/6'>Judith 8:6</a>; <a href='/AIV/59/5/16'>James 5:16</a>",
      "comment": "Requesting Judith’s intercession prefigures the value of community prayer and the intercessory role of holy men and women throughout the ages."
    },
    {
      "pk": 18008032,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 32,
      "text": "Judith answered, 'Hear me. I will do something that will be remembered by generations of our people.",
      "links": "<a href='/AIV/18/13/16'>Judith 13:16</a>; <a href='/AIV/42/1/48'>Luke 1:48</a>",
      "comment": "Her resolve to act recalls God working through humble servants, with echoes of Mary’s Magnificat ('all generations will call me blessed')."
    },
    {
      "pk": 18008033,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 33,
      "text": "Tonight, you will stand at the gate, and I will go out with my maid. Do not inquire about what I am doing until I return.",
      "links": "<a href='/AIV/18/10/1'>Judith 10:1</a>; <a href='/AIV/18/13/20'>Judith 13:20</a>",
      "comment": "Judith’s secrecy hints at obedience and trust, reminiscent of figures who step forward in faith, trusting God’s mysterious plan."
    },
    {
      "pk": 18008034,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 34,
      "text": "I trust God will accomplish deliverance for Israel by my hand.",
      "links": "<a href='/AIV/7/15/13'>Judges 15:13</a>; <a href='/AIV/18/13/4'>Judith 13:4</a>",
      "comment": "Judith’s faith anticipates salvation mediated through chosen instruments, echoing cycles of deliverance found with the Judges."
    },
    {
      "pk": 18008035,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 35,
      "text": "Then they said, 'Go in peace. May the Lord God go before you, to take vengeance on our enemies.'",
      "links": "<a href='/AIV/2/13/21'>Ex. 13:21</a>; <a href='/AIV/18/13/4'>Judith 13:4</a>",
      "comment": "A prayer of blessing recalls not only God as the guide, but the responsibility to let God’s justice come by his own means."
    },
    {
      "pk": 18008036,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 8,
      "verse": 36,
      "text": "So they left the tent and returned to their posts.",
      "links": "<a href='/AIV/18/10/6'>Judith 10:6</a>",
      "comment": "This closing notes the readiness and submission of the elders to Judith’s faith-driven leadership, prefiguring how humble and obedient service can prepare the way for God’s deliverance."
    }
  ],
  "translatedAt": "2025-12-24T05:03:47.494Z"
}