{
  "book": 18,
  "bookName": "Judith",
  "bookAbbreviation": "Jdt",
  "chapter": 14,
  "verses": [
    {
      "pk": 18014001,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 1,
      "text": "Then Judith said to them, \"Listen to me, my brothers. Take this head and hang it on the parapet of our city wall.",
      "links": "<a href='/AIV/18/13/15'>Jdt. 13:15</a>; <a href='/AIV/16/3/27'>Neh. 3:27</a>",
      "comment": "Judith takes leadership and offers commands to the people. Note her boldness and the custom of displaying enemy heads as a sign of victory and divine deliverance."
    },
    {
      "pk": 18014002,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 2,
      "text": "At sunrise, let each man take up his weapons, and every able man should go out of the city. Appoint a captain over them, as if you were going to descend to the valley toward the outposts of the Assyrians. But do not go down.",
      "links": "<a href='/AIV/7/7/16'>Judg. 7:16</a>; <a href='/AIV/9/31/6'>1 Sam. 31:6</a>",
      "comment": "Judith uses military tactics to give the appearance of an attack, stirring fear and confusion among the enemy. Her wisdom recalls other female deliverers in Israel’s history."
    },
    {
      "pk": 18014003,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 3,
      "text": "Then they will take up their armor and hurry to the camp of their leader, but they will not find him. Fear will fall upon them, and they will flee from you.",
      "links": "<a href='/AIV/23/37/36'>Isa. 37:36</a>; <a href='/AIV/18/16/2'>Jdt. 16:2</a>",
      "comment": "Judith prophesies the enemy’s confusion and flight, reminiscent of times God delivered Israel by causing panic among their foes (<a href='/AIV/7/7/21'>Judg. 7:21-22</a>)."
    },
    {
      "pk": 18014004,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 4,
      "text": "Then you and all who live in the land of Israel will pursue them and overthrow them as they flee.",
      "links": "<a href='/AIV/28/2/15'>Hos. 2:15</a>",
      "comment": "The people of God act in unity, following God’s deliverance. There is a sense here of communal participation in God’s victory, a theme developed later in Christian sacramental life."
    },
    {
      "pk": 18014005,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 5,
      "text": "But before you do all this, bring Achior the Ammonite to me so that he may see and recognize the man who despised the house of Israel and sent him to us as if to his death.",
      "links": "<a href='/AIV/18/6/5-10'>Jdt. 6:5-10</a>",
      "comment": "Judith recalls Achior’s prior testimony and his doubt, setting the stage for his conversion. The recognition of God’s intervention by outsiders is a repeated motif, hinting at God’s plan for all nations (<a href='/AIV/23/56/7'>Isa. 56:7</a>)."
    },
    {
      "pk": 18014006,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 6,
      "text": "So they called Achior from the house of Uzziah. As soon as he came and saw the head of Holofernes in a man’s hand in the assembly of the people, he collapsed and fell face down on the ground.",
      "links": "<a href='/AIV/18/13/15'>Jdt. 13:15</a>; <a href='/AIV/1/44/14'>Gen. 44:14</a>",
      "comment": "Achior’s reaction highlights the power of God’s works in converting hearts. This prefigures the reactions of Gentiles in the New Testament witnessing the miracles of Christ."
    },
    {
      "pk": 18014007,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 7,
      "text": "When they raised him up, he fell at Judith’s feet and bowed low, saying, 'Blessed are you in every dwelling of Judah! In every nation, when your name is mentioned, God will be remembered.'",
      "links": "<a href='/AIV/18/13/18'>Jdt. 13:18</a>; <a href='/AIV/19/72/17'>Ps. 72:17</a>",
      "comment": "Achior’s praise of Judith points to the honor given to chosen vessels of God. Such reverence for those through whom God acts signals an enduring pattern in the worshiping community."
    },
    {
      "pk": 18014008,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 8,
      "text": "When he saw all that God had done, he believed firmly in the God of Israel. He was circumcised and joined the house of Israel, remaining with them to this day.",
      "links": "<a href='/AIV/2/12/48'>Ex. 12:48</a>; <a href='/AIV/44/10/48'>Acts 10:48</a>",
      "comment": "Achior’s conversion is marked by a visible act—circumcision and incorporation into Israel—showing the importance of initiation into the people of God. This prefigures the New Covenant sacramental initiation through baptism."
    },
    {
      "pk": 18014009,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 9,
      "text": "As soon as it was dawn, the men hung the head of Holofernes on the wall, and every man of Israel took up his weapons and went out in ranks up the mountain slopes.",
      "links": "<a href='/AIV/18/14/1'>Jdt. 14:1</a>; <a href='/AIV/7/7/19'>Judg. 7:19</a>",
      "comment": "The people’s obedience to Judith’s instruction shows the value of following divinely appointed leaders. Their unity and order foreshadow the structured life of the early Christian community."
    },
    {
      "pk": 18014010,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 10,
      "text": "When the Assyrians saw them, they sent for their commanders. They went to the tent of Holofernes, but found no one there. They rushed inside, but did not find him.",
      "links": "<a href='/AIV/02/14/24'>Ex. 14:24</a>",
      "comment": "The enemy’s confusion is made clear—God frustrates the plans of the wicked. The missing leader symbolizes the futility of opposition to God’s people."
    },
    {
      "pk": 18014011,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 11,
      "text": "So they ran out and called together all the generals, the commanders and all the officers of the army. They came to Holofernes’ tent.",
      "links": "<a href='/AIV/18/14/10'>Jdt. 14:10</a>",
      "comment": "The officers’ panic at the tent of Holofernes echoes the sudden reversals seen elsewhere in Scripture, such as Egypt’s officers during the Exodus."
    },
    {
      "pk": 18014012,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 12,
      "text": "When they entered, they found Holofernes sprawled on the ground, with his head taken away.",
      "links": "<a href='/AIV/09/17/51'>1 Sam. 17:51</a>; <a href='/AIV/18/13/8'>Jdt. 13:8</a>",
      "comment": "Finding the body without a head heightens the sense of utter defeat. The beheading has typological resonance, prefiguring David’s victory over Goliath."
    },
    {
      "pk": 18014013,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 13,
      "text": "They cried out with loud voices, wept, groaned, and shouted aloud, tore their garments, and were deeply distraught.",
      "links": "<a href='/AIV/01/37/34'>Gen. 37:34</a>; <a href='/AIV/09/4/1'>1 Sam. 4:12</a>",
      "comment": "Tearing garments and lamenting were traditional signs of profound mourning and humiliation. God’s supremacy is revealed in the defeat of such proud enemies."
    },
    {
      "pk": 18014014,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 14,
      "text": "They called loudly in the camp, so that all came running to see what had happened. When they saw Holofernes’ body, leaders were stunned and lost their courage.",
      "links": "<a href='/AIV/01/45/3'>Gen. 45:3</a>",
      "comment": "The enemies’ hearts melt in fear. God’s intervention disarms even the mightiest, preparing the way for His people’s triumph and prefiguring spiritual victory through God’s power."
    },
    {
      "pk": 18014015,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 15,
      "text": "All the soldiers, seized with panic and trembling, rushed out in haste. They fled in disorder, not even pausing to talk with one another, but ran together through the open country.",
      "links": "<a href='/AIV/14/2/4'>Josh. 2:4</a>; <a href='/AIV/7/7/21'>Judg. 7:21-22</a>",
      "comment": "The flight of the enemy fulfills Judith’s earlier words. The chaos parallels the confusion sent by God to protect Israel, as seen in other Old Testament battles."
    },
    {
      "pk": 18014016,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 16,
      "text": "Then the Israelites, every warrior, burst out upon them, pursued them down the mountain, for the whole country was filled with fugitives.",
      "links": "<a href='/AIV/10/15/14'>2 Sam. 15:14</a>",
      "comment": "The Israelites pursue with discipline and unity, winning through faith and obedience. Their cooperation demonstrates the necessity of remaining together in the fight for God’s cause."
    },
    {
      "pk": 18014017,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 17,
      "text": "But those who remained in Bethulia came and seized all the possessions the Assyrians had left behind. The Israelites returned from the slaughter victorious.",
      "links": "<a href='/AIV/06/8/27'>Josh. 8:27</a>; <a href='/AIV/02/12/36'>Ex. 12:36</a>",
      "comment": "The people participate in the spoils of victory, reminiscent of Israel’s earlier campaigns. The sharing of blessings points to the later practice of distributing spiritual and temporal gifts in the Christian community."
    },
    {
      "pk": 18014018,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 18,
      "text": "But the high priest Joakim and the council of elders in Jerusalem came to witness the miraculous deeds that the Lord had accomplished for Israel, and to see Judith and greet her.",
      "links": "<a href='/AIV/03/16/32-34'>Lev. 16:32-34</a>; <a href='/AIV/42/1/68'>Luke 1:68</a>",
      "comment": "The authority of the high priest and elders is emphasized as they bear witness to God’s work and honor His chosen instrument. This mirrors the importance of spiritual authority given to overseers of God’s people."
    },
    {
      "pk": 18014019,
      "translation": "AIV",
      "book": 18,
      "bookName": "Judith",
      "bookAbbreviation": "Jdt",
      "chapter": 14,
      "verse": 19,
      "text": "When they came to her, they all blessed her with one voice and said, 'You are the exaltation of Jerusalem, the great glory of Israel, and the great pride of our nation. You have done all this with your own hand. May the Almighty bless you forever!' And all the people said, 'Amen.'",
      "links": "<a href='/AIV/18/15/10'>Jdt. 15:10</a>; <a href='/AIV/19/115/1'>Ps. 115:1</a>",
      "comment": "The language of blessing and veneration for Judith foreshadows honor given to holy men and women throughout salvation history. Intercession and communal response indicate the value of united prayer and recognition of God’s marvels through chosen vessels, a pattern continued in New Testament worship and devotion."
    }
  ],
  "translatedAt": "2025-12-24T05:07:05.680Z"
}