{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 25,
  "verses": [
    {
      "pk": 9025001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 1,
      "text": "Samuel died, and all Israel gathered and mourned for him. They buried him in his home town of Ramah. Then David went down to the wilderness of Paran.",
      "links": "<a href='/AIV/9/28/3'>1Sam 28:3</a>; <a href='/AIV/11/2/3'>1Kings 2:3</a>",
      "comment": "Samuel’s death marked the end of the prophetic leadership over Israel and the transition to kingship. David’s withdrawal to Paran hints at his desire to avoid conflict until God’s timing was fulfilled."
    },
    {
      "pk": 9025002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 2,
      "text": "Now there was a man in Maon whose possessions were in Carmel. He was very rich—he owned three thousand sheep and a thousand goats, and he was shearing his sheep in Carmel.",
      "links": "<a href='/AIV/9/23/24'>1Sam 23:24</a>; <a href='/AIV/26/34/12-13'>Ezek. 34:12-13</a>",
      "comment": "Sheep-shearing was a time of celebration and feasting, symbolizing abundance and opportunity for generosity."
    },
    {
      "pk": 9025003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 3,
      "text": "The man’s name was Nabal, and his wife’s name was Abigail. She was a woman of good understanding and beautiful appearance, but the man was harsh and evil in his doings. He was a Calebite.",
      "links": "<a href='/AIV/13/2/50'>1Chr 2:50'>1Chr 2:50</a>",
      "comment": "Nabal’s character contrasts with Abigail’s wisdom and beauty. Calebites were known for faithfulness, making Nabal’s behavior even more shameful."
    },
    {
      "pk": 9025004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 4,
      "text": "David heard in the wilderness that Nabal was shearing his sheep.",
      "links": "<a href='/AIV/9/23/15'>1Sam 23:15</a>",
      "comment": "David keeps aware of events in local society, seeking opportunities to provide for his followers."
    },
    {
      "pk": 9025005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 5,
      "text": "So David sent ten young men and said to them, 'Go up to Nabal at Carmel, greet him in my name,'",
      "links": "<a href='/AIV/9/22/3-4'>1Sam 22:3-4</a>",
      "comment": "Sending messengers respectfully, David sought hospitality and provision typical of covenantal relationships and ancient hospitality practices."
    },
    {
      "pk": 9025006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 6,
      "text": "'and tell him: ‘Peace be to you, peace to your house, and peace to all that you have.’",
      "links": "<a href='/AIV/9/1/17'>1Sam 1:17</a>; <a href='/AIV/40/10/13'>Matt 10:13</a>",
      "comment": "The ‘peace’ David offers reflects a biblical desire for shalom—a fullness and right relationship—setting the stage for true Christian charity."
    },
    {
      "pk": 9025007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 7,
      "text": "Now I hear that you have shearers. Your shepherds were with us, and we did not harm them, nor did they lose anything all the time they were in Carmel.",
      "links": "<a href='/AIV/9/22/2'>1Sam 22:2</a>",
      "comment": "David emphasizes his men’s integrity and their protection of Nabal’s property, signifying the fruit of grace and active charity."
    },
    {
      "pk": 9025008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 8,
      "text": "Ask your young men, and they will tell you. Therefore let my young men find favor in your eyes, for we come on a feast day. Please give whatever you have at hand to your servants and to your son David.’",
      "links": "<a href='/AIV/9/20/29'>1Sam 20:29</a>; <a href='/AIV/42/15/22'>Luke 15:22</a>",
      "comment": "David calls himself ‘your son’ and approaches with humility, foreshadowing Christ’s self-giving and the familial relationships built within the Church."
    },
    {
      "pk": 9025009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 9,
      "text": "When David’s young men came, they spoke all these words to Nabal on behalf of David, and waited.",
      "links": "<a href='/AIV/9/22/11'>1Sam 22:11</a>",
      "comment": "David’s messengers model patience and respect, anticipating Nabal’s response instead of seizing material goods by force."
    },
    {
      "pk": 9025010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 10,
      "text": "But Nabal answered David’s servants and said, 'Who is David? Who is the son of Jesse? There are many servants these days who are breaking away from their masters.'",
      "links": "<a href='/AIV/9/20/27'>1Sam 20:27</a>; <a href='/AIV/9/22/7'>1Sam 22:7</a>",
      "comment": "Nabal’s words reveal arrogance and ignorance of David’s anointing, representing spiritual blindness toward God’s chosen."
    },
    {
      "pk": 9025011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 11,
      "text": "'Should I take my bread, my water, and my meat that I have slaughtered for my shearers, and give it to men coming from I do not know where?'",
      "links": "<a href='/AIV/9/9/22'>1Sam 9:22</a>",
      "comment": "Nabal refers to everything as 'my'—showing selfishness. Generosity to strangers is a recurring biblical principle, foundational for Christian community life."
    },
    {
      "pk": 9025012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 12,
      "text": "So David’s young men turned back and went away. When they came and told David all these words,",
      "links": "<a href='/AIV/9/20/39'>1Sam 20:39</a>",
      "comment": "David’s servants return without fighting, continuing the recurring humble waiting seen in David before God’s appointed fulfillment."
    },
    {
      "pk": 9025013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 13,
      "text": "David said to his men, 'Each of you strap on your sword!' So they each strapped on their sword, and David also strapped on his sword. About four hundred men went up after David, and two hundred stayed with the supplies.",
      "links": "<a href='/AIV/9/22/2'>1Sam 22:2</a>",
      "comment": "David’s readiness for battle is human passion for justice, restrained later by Divine intervention. Christ later teaches to lay down the sword in His new covenant."
    },
    {
      "pk": 9025014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 14,
      "text": "But one of Nabal’s young men told Abigail, Nabal’s wife, 'David sent messengers from the wilderness to greet our master, but he insulted them.'",
      "links": "<a href='/AIV/20/31/11'>Prov 31:11</a>",
      "comment": "Abigail’s reputation for wisdom is foreshadowed—the spiritual gift to discern and act mediates peace and points to the role of mediation in salvation history."
    },
    {
      "pk": 9025015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 15,
      "text": "'But the men were very good to us. We were not harmed, nor did we miss anything when we were in the fields with them.'",
      "links": "<a href='/AIV/9/22/23'>1Sam 22:23</a>",
      "comment": "Testimony affirms the protection given by David, highlighting the value of communal stewardship and practical charity."
    },
    {
      "pk": 9025016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 16,
      "text": "'They were like a wall to us by day and by night, all the time we were with them keeping the sheep.'",
      "links": "<a href='/AIV/19/18/2'>Ps 18:2</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "David’s defense prefigures Christ as the Good Shepherd, protector of the flock, and the Church as a spiritual safeguard (cf. John 10:11)."
    },
    {
      "pk": 9025017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 17,
      "text": "'Now therefore consider what you should do, for harm is determined against our master and against all his household. He is so stubborn that no one can speak to him.'",
      "links": "<a href='/AIV/20/29/1'>Prov 29:1</a>",
      "comment": "Abigail must discern and act for peace—foreshadowing intercessory roles and spiritual stewardship to avert wrath."
    },
    {
      "pk": 9025018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 18,
      "text": "Then Abigail hurried and took two hundred loaves of bread, two skins of wine, five sheep already dressed, five seahs of roasted grain, a hundred clusters of raisins, and two hundred cakes of figs, and loaded them on donkeys.",
      "links": "<a href='/AIV/9/10/3'>1Sam 10:3</a>; <a href='/AIV/11/17/12'>1Kings 17:12</a>",
      "comment": "Abigail’s action illustrates generosity, wisdom, and the importance of material charity as a means of reconciliation, echoing Eucharistic hospitality."
    },
    {
      "pk": 9025019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 19,
      "text": "She said to her young men, 'Go on ahead of me; I am coming after you.' But she did not tell her husband Nabal.",
      "links": "<a href='/AIV/20/21/14'>Prov 21:14</a>",
      "comment": "Abigail’s initiative and prudence model the importance of wise, hidden intercession for the sake of peace."
    },
    {
      "pk": 9025020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 20,
      "text": "As she rode her donkey and went down under cover of the mountain, David and his men came down toward her, and she met them.",
      "links": "<a href='/AIV/9/24/8'>1Sam 24:8</a>",
      "comment": "Meeting David face-to-face, Abigail’s humility reflects intercessors approaching Christ, bringing what is needed for reconciliation."
    },
    {
      "pk": 9025021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 21,
      "text": "Now David had said, 'Surely in vain I have guarded all that this fellow has in the wilderness, so that nothing was missed of all that belonged to him. He has repaid me evil for good.'",
      "links": "<a href='/AIV/20/17/13'>Prov 17:13</a>",
      "comment": "David’s indignation highlights the biblical principle: evil repaid for good brings judgment. Divine mercy and justice both demand a proper response."
    },
    {
      "pk": 9025022,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 22,
      "text": "May God do so to the enemies of David, and more also, if by morning I leave alive even one male of all that belong to him!'",
      "links": "<a href='/AIV/9/3/17'>1Sam 3:17</a>; <a href='/AIV/27/6/24'>Dan 6:24</a>",
      "comment": "David’s oath calls for severe judgment, but this is interrupted by Abigail’s intercession—a model of grace overriding vengeance."
    },
    {
      "pk": 9025023,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 23,
      "text": "When Abigail saw David, she hurried and got down from her donkey, fell on her face before David, and bowed herself to the ground.",
      "links": "<a href='/AIV/42/7/38'>Luke 7:38</a>; <a href='/AIV/9/24/8'>1Sam 24:8</a>",
      "comment": "Her posture is one of profound respect and submission, fitting for intercessory prayer and the humility Christ teaches."
    },
    {
      "pk": 9025024,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 24,
      "text": "She fell at his feet and said, 'On me alone, my lord, be the blame. Please let your servant speak in your ears, and listen to the words of your servant.'",
      "links": "<a href='/AIV/9/20/28'>1Sam 20:28</a>; <a href='/AIV/23/53/4'>Isa 53:4</a>",
      "comment": "Abigail takes responsibility, foreshadowing substitution and Christ’s bearing of our sins—a sacrificial intercession."
    },
    {
      "pk": 9025025,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 25,
      "text": "'Let not my lord regard this worthless man, Nabal, for as his name is, so is he. Nabal means Fool, and folly is with him. But I, your servant, did not see the young men whom you sent.'",
      "links": "<a href='/AIV/19/14/1'>Ps 14:1</a>",
      "comment": "'Nabal' literally means 'fool,' tied to rebellion and sin. Abigail’s wisdom is contrasted spiritually to foolishness, as seen in Psalm 14:1."
    },
    {
      "pk": 9025026,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 26,
      "text": "'Now then, my lord, as the Lord lives and as your soul lives, since the Lord has held you back from bloodshed and from avenging yourself by your own hand, let your enemies and those who seek trouble for my lord be as Nabal.'",
      "links": "<a href='/AIV/45/12/19'>Rom 12:19</a>; <a href='/AIV/9/24/12'>1Sam 24:12</a>",
      "comment": "Divine restraint points to leaving vengeance to God, echoed in Romans 12:19 and the spirituality of forgiveness."
    },
    {
      "pk": 9025027,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 27,
      "text": "'Now let this gift your servant has brought to my lord be given to the young men who follow you.'",
      "links": "<a href='/AIV/40/5/23-24'>Matt 5:23-24</a>",
      "comment": "The gift serves as a peace offering—anticipating the importance of material hospitality and spiritual reconciliation seen in sacramental practice."
    },
    {
      "pk": 9025028,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 28,
      "text": "'Please forgive the trespass of your servant. For the Lord will surely make my lord a lasting house, because my lord fights the battles of the Lord, and evil will not be found in you all your days.'",
      "links": "<a href='/AIV/10/7/16'>2Sam 7:16</a>; <a href='/AIV/41/1/24'>Mark 1:24</a>",
      "comment": "Abigail prophesies David’s eternal dynasty (cf. 2Sam 7:16) which finds fulfillment in Christ, King and High Priest."
    },
    {
      "pk": 9025029,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 29,
      "text": "'Should anyone rise up to pursue you and seek your life, the life of my lord shall be bound in the bundle of the living with the Lord your God. But the lives of your enemies He will fling away as from a sling.'",
      "links": "<a href='/AIV/9/17/49'>1Sam 17:49</a>; <a href='/AIV/19/56/13'>Ps 56:13</a>",
      "comment": "‘Bundle of the living’ alludes to being kept safe among God’s chosen—a type for the hope and security of salvation in the communion of saints."
    },
    {
      "pk": 9025030,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 30,
      "text": "'And when the Lord has done to my lord all the good that He has spoken concerning you and has appointed you ruler over Israel,'",
      "links": "<a href='/AIV/9/16/1'>1Sam 16:1</a>; <a href='/AIV/10/7/23'>2Sam 7:23</a>",
      "comment": "Abigail affirms David’s divinely ordained kingship, foreshadowing the Messianic kingdom and the Church’s enduring authority."
    },
    {
      "pk": 9025031,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 31,
      "text": "'then my lord will have no cause for grief or a troubled conscience for having shed blood without cause or for taking revenge. When the Lord has dealt well with my lord, then remember your servant.'",
      "links": "<a href='/AIV/40/5/7'>Matt 5:7</a>; <a href='/AIV/42/23/34'>Luke 23:34</a>",
      "comment": "Abigail urges David to act justly, reminding us of mercy over vengeance and Christ’s teaching to forgive from the heart."
    },
    {
      "pk": 9025032,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 32,
      "text": "David said to Abigail, 'Blessed be the Lord, the God of Israel, who sent you this day to meet me!'",
      "links": "<a href='/AIV/1/24/27'>Gen 24:27</a>",
      "comment": "David recognizes divine providence at work through Abigail—a lesson in discernment for Christ’s followers."
    },
    {
      "pk": 9025033,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 33,
      "text": "'Blessed is your wisdom, and blessed are you who have kept me this day from bloodshed and from avenging myself with my own hand.'",
      "links": "<a href='/AIV/9/18/14'>1Sam 18:14</a>; <a href='/AIV/59/3/17-18'>James 3:17-18</a>",
      "comment": "David praises the wisdom that brings peace, highlighting spiritual fruitfulness and mediating grace seen throughout salvation history."
    },
    {
      "pk": 9025034,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 34,
      "text": "'If you had not hurried and come to meet me, surely by morning not one male belonging to Nabal would have been left alive.'",
      "links": "<a href='/AIV/9/25/22'>1Sam 25:22</a>",
      "comment": "David’s words affirm the seriousness of his oath and the power of timely intercession to save lives."
    },
    {
      "pk": 9025035,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 35,
      "text": "Then David received from her hand what she had brought him, and he said to her, 'Go up in peace to your house. See, I have listened to your voice and respected your request.'",
      "links": "<a href='/AIV/9/1/17'>1Sam 1:17</a>; <a href='/AIV/42/7/50'>Luke 7:50</a>",
      "comment": "Reconciliation is accomplished. David’s blessing of peace recalls Christ’s words of forgiveness and spiritual reconciliation."
    },
    {
      "pk": 9025036,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 36,
      "text": "Abigail came to Nabal, and he was holding a feast in his house, like the feast of a king. Nabal’s heart was merry within him, for he was very drunk. So she told him nothing, until the morning light.",
      "links": "<a href='/AIV/20/23/29-35'>Prov 23:29-35</a>; <a href='/AIV/9/30/16'>1Sam 30:16</a>",
      "comment": "Nabal’s excessive feasting and drunkenness stand as a warning against spiritual negligence and worldliness."
    },
    {
      "pk": 9025037,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 37,
      "text": "In the morning, when Nabal had sobered up, his wife told him what happened. His heart failed him, and he became like a stone.",
      "links": "<a href='/AIV/9/4/18'>1Sam 4:18</a>; <a href='/AIV/2/7/13'>Ex 7:13</a>",
      "comment": "Nabal’s sudden judgment recalls God’s wrath against hardened hearts; it is a theme found throughout Scripture."
    },
    {
      "pk": 9025038,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 38,
      "text": "About ten days later, the Lord struck Nabal, and he died.",
      "links": "<a href='/AIV/19/37/13'>Ps 37:13</a>; <a href='/AIV/44/12/23'>Acts 12:23</a>",
      "comment": "God’s judgment falls swiftly, illustrating divine justice and the consequence of folly and unrepentance."
    },
    {
      "pk": 9025039,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 39,
      "text": "When David heard that Nabal was dead, he said, 'Blessed be the Lord, who has pleaded my cause against Nabal’s insult and kept His servant from wrongdoing. The Lord has returned Nabal’s evil on his own head.' Then David sent and spoke to Abigail, to take her as his wife.",
      "links": "<a href='/AIV/19/7/16'>Ps 7:16</a>; <a href='/AIV/20/31/10'>Prov 31:10</a>",
      "comment": "David’s marriage to Abigail represents the union of wisdom and kingship, prefiguring the gathering of the faithful into the one household of God."
    },
    {
      "pk": 9025040,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 40,
      "text": "When David’s servants came to Abigail at Carmel, they said to her, 'David has sent us to you to take you as his wife.'",
      "links": "<a href='/AIV/9/18/27'>1Sam 18:27</a>",
      "comment": "Abigail’s acceptance into the household of David parallels believers’ invitation into covenant relationship and divine adoption."
    },
    {
      "pk": 9025041,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 41,
      "text": "She arose, bowed with her face to the earth, and said, 'Here is your maidservant, ready to wash the feet of the servants of my lord.'",
      "links": "<a href='/AIV/43/13/5'>John 13:5</a>; <a href='/AIV/42/7/38'>Luke 7:38</a>",
      "comment": "Abigail’s humility echoes Christ’s washing of the disciples’ feet, revealing servant leadership and the sanctity of humble service."
    },
    {
      "pk": 9025042,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 42,
      "text": "Then Abigail hurried and arose, and rode on a donkey, accompanied by five of her maidens. She went after David’s messengers and became his wife.",
      "links": "<a href='/AIV/9/18/27'>1Sam 18:27</a>; <a href='/AIV/19/45/14'>Ps 45:14</a>",
      "comment": "Abigail’s entry with her maidens can be seen as a type of the Church, adorned and betrothed to her King (cf. Ps 45)."
    },
    {
      "pk": 9025043,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 43,
      "text": "David also took Ahinoam of Jezreel, and both of them became his wives.",
      "links": "<a href='/AIV/9/27/3'>1Sam 27:3</a>",
      "comment": "The multiplication of wives in David’s life shows a transition period, but the spiritual meaning points to the gathering of all faithful under the one King."
    },
    {
      "pk": 9025044,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 25,
      "verse": 44,
      "text": "Now Saul had given his daughter Michal, David’s wife, to Palti the son of Laish, who was from Gallim.",
      "links": "<a href='/AIV/9/18/27'>1Sam 18:27</a>; <a href='/AIV/10/3/14-16'>2Sam 3:14-16</a>",
      "comment": "Michal’s change of loyalty by Saul’s command contrasts with Abigail’s willing acceptance, emphasizing true covenant relationship versus political maneuvering."
    }
  ],
  "translatedAt": "2025-12-24T03:05:28.853Z"
}