{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 18,
  "verses": [
    {
      "pk": 9018001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 1,
      "text": "After David had finished speaking with Saul, Jonathan’s soul became bound to the soul of David, and Jonathan loved him as his own soul.",
      "links": "<a href='/AIV/09/19/1'>1Sam 19:1</a>; <a href='/AIV/10/1/26'>2Sam 1:26</a>",
      "comment": "This verse introduces the deep, covenantal friendship between David and Jonathan—a relationship that is often seen as a symbol of true brotherhood, spiritual kinship, and the kind of unity found among saints. Some Church Fathers saw in this a foreshadowing of the love and unity expected among all members of the one Church (cf. John 17:21)."
    },
    {
      "pk": 9018002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 2,
      "text": "From that day, Saul kept David with him and did not let him return to his father's house.",
      "links": "<a href='/AIV/09/16/22'>1Sam 16:22</a>",
      "comment": "Saul recognizes David’s value and keeps him near, just as God places His chosen servants at the heart of His people to guide and protect them (cf. Acts 13:22)."
    },
    {
      "pk": 9018003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 3,
      "text": "Then Jonathan made a covenant with David, because he loved him as his own soul.",
      "links": "<a href='/AIV/09/20/16-17'>1Sam 20:16-17</a>",
      "comment": "Covenant relationships in the Old Testament often prefigure the New Covenant, showing the depth and sacredness of bonds in God’s plan (cf. John 15:13)."
    },
    {
      "pk": 9018004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 4,
      "text": "Jonathan stripped himself of the robe that was on him and gave it to David, along with his armor, even his sword, his bow, and his belt.",
      "links": "<a href='/AIV/09/17/38-39'>1Sam 17:38-39</a>",
      "comment": "Jonathan’s self-giving points to humility and self-emptying, virtues echoed powerfully in Philippians 2:6-8 where Christ gives Himself for others."
    },
    {
      "pk": 9018005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 5,
      "text": "Wherever Saul sent him, David acted wisely; and Saul set him over the men of war, and it was good in the eyes of all the people and also in the eyes of Saul’s servants.",
      "links": "<a href='/AIV/09/18/14-16'>1Sam 18:14-16</a>",
      "comment": "David’s wisdom and success are a sign of the Lord's favor, later echoed in the wisdom of Solomon (1 Kings 3:28), prefiguring Christ’s perfect wisdom (Col 2:3)."
    },
    {
      "pk": 9018006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 6,
      "text": "As they were returning, when David was coming back after striking down the Philistine, the women came out of all the cities of Israel, singing and dancing, to meet King Saul, with tambourines, with songs of joy, and with instruments of music.",
      "links": "<a href='/AIV/02/15/20'>Ex. 15:20</a>; <a href='/AIV/07/11/34'>Judg. 11:34</a>",
      "comment": "Public celebrations often accompany divine deliverance; see also Miriam’s song in Exodus 15. Music and liturgical celebration remain central to the worship of God’s people."
    },
    {
      "pk": 9018007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 7,
      "text": "The women sang to one another as they made merry, saying, \"Saul has struck down his thousands, and David his ten thousands.\"",
      "links": "<a href='/AIV/21/7/22'>Eccl. 7:22</a>; <a href='/AIV/09/21/11'>1Sam 21:11</a>",
      "comment": "The accolades for David sow jealousy in Saul, foreshadowing the conflict between worldly jealousy and God’s choice, later contrasted with Christ’s humility and glorification (Phil. 2:9)."
    },
    {
      "pk": 9018008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 8,
      "text": "Saul was very angry, and this saying displeased him. He said, \"They have ascribed to David ten thousands, and to me they have ascribed thousands. What more can he have but the kingdom?\"",
      "links": "<a href='/AIV/09/15/28'>1Sam 15:28</a>",
      "comment": "Saul’s jealousy reflects the struggle with pride and the loss of humility—the very basis of sin beginning with the devil (cf. Isa. 14:12-15)."
    },
    {
      "pk": 9018009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 9,
      "text": "So Saul eyed David from that day forward.",
      "links": "<a href='/AIV/09/19/1'>1Sam 19:1</a>",
      "comment": "The turning of Saul’s attitude toward David foreshadows the opposition righteous leaders and saints often face; see Christ’s treatment by the authorities (John 11:53)."
    },
    {
      "pk": 9018010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 10,
      "text": "The next day an evil spirit from God came upon Saul, and he raved within his house. David was playing his harp as he did day by day, and Saul had his spear in his hand.",
      "links": "<a href='/AIV/09/16/14'>1Sam 16:14</a>; <a href='/AIV/09/19/9'>1Sam 19:9</a>",
      "comment": "The expression 'evil spirit from God' shows God’s sovereign allowance for discipline and judgment (cf. Job 1:12), illustrating how refusing grace leads to turmoil."
    },
    {
      "pk": 9018011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 11,
      "text": "And Saul hurled the spear, for he thought, \"I will pin David to the wall.\" But David evaded him twice.",
      "links": "<a href='/AIV/09/19/10'>1Sam 19:10</a>",
      "comment": "David’s escape shows God’s providence in protecting His chosen; later, many saints will face persecution, yet God preserves His purpose (Acts 23:12-24)."
    },
    {
      "pk": 9018012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 12,
      "text": "Saul was afraid of David, because the LORD was with him but had left Saul.",
      "links": "<a href='/AIV/09/16/14'>1Sam 16:14</a>; <a href='/AIV/09/18/28'>1Sam 18:28</a>",
      "comment": "The importance of God’s presence distinguishes true leaders among God’s people. The withdrawal of the Spirit is reminiscent of Adam’s fall (Gen. 3)."
    },
    {
      "pk": 9018013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 13,
      "text": "So Saul removed him from his presence and made him a commander of a thousand; and he went out and came in before the people.",
      "links": "<a href='/AIV/07/11/34'>Judg. 11:34</a>; <a href='/AIV/09/18/16'>1Sam 18:16</a>",
      "comment": "Despite Saul’s intent, David is still raised to leadership, showing God’s sovereignty even amid opposition—a pattern often repeated in Church history."
    },
    {
      "pk": 9018014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 14,
      "text": "And David had success in all his undertakings, for the LORD was with him.",
      "links": "<a href='/AIV/09/18/5'>1Sam 18:5</a>; <a href='/AIV/09/18/12'>1Sam 18:12</a>",
      "comment": "Divine accompaniment brings true blessing; see also the promise to Joshua (Josh 1:8-9), fulfilled perfectly in Christ (Matt. 28:20)."
    },
    {
      "pk": 9018015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 15,
      "text": "And when Saul saw that David acted so wisely, he was afraid of him.",
      "links": "<a href='/AIV/09/18/12'>1Sam 18:12</a>",
      "comment": "The wisdom of God’s anointed is a cause for awe and even fear among those whose faith wavers (cf. Wisdom 7:27, Luke 2:47)."
    },
    {
      "pk": 9018016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 16,
      "text": "But all Israel and Judah loved David, because he went out and came in before them.",
      "links": "<a href='/AIV/09/18/5'>1Sam 18:5</a>; <a href='/AIV/09/18/13'>1Sam 18:13</a>",
      "comment": "David’s closeness to his people prefigures the Good Shepherd’s presence among the flock (John 10:4), and anticipates true kingship united with servant leadership."
    },
    {
      "pk": 9018017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 17,
      "text": "Then Saul said to David, \"Here is my elder daughter Merab. I will give her to you as a wife; only be valiant for me and fight the LORD’s battles.\" For Saul thought, \"Let not my hand be against him, but let the hand of the Philistines be against him.\"",
      "links": "<a href='/AIV/09/17/25'>1Sam 17:25</a>; <a href='/AIV/09/18/21'>1Sam 18:21</a>",
      "comment": "Saul’s diplomacy conceals deceit, paralleling later schemes against the righteous. The theme of testing loyal servants is a common pattern in salvation history."
    },
    {
      "pk": 9018018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 18,
      "text": "And David said to Saul, \"Who am I, and who are my relatives or my father’s clan in Israel, that I should become the king’s son-in-law?\"",
      "links": "<a href='/AIV/10/7/18'>2Sam 7:18</a>; <a href='/AIV/42/14/11'>Luke 14:11</a>",
      "comment": "David’s humility is exemplary, later echoed by the humility of Christ and the saints (Luke 14:10)."
    },
    {
      "pk": 9018019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 19,
      "text": "But when the time came for Merab, Saul’s daughter, to be given to David, she was given instead to Adriel the Meholathite as a wife.",
      "links": "<a href='/AIV/10/21/8'>2Sam 21:8</a>",
      "comment": "Saul’s promise is broken—a reminder of the frailty of human rulers. In contrast, God’s covenant is always faithful (cf. Heb. 6:18)."
    },
    {
      "pk": 9018020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 20,
      "text": "Now Saul’s daughter Michal loved David. When this was told to Saul, the thing pleased him.",
      "links": "<a href='/AIV/09/19/11'>1Sam 19:11</a>",
      "comment": "God works even through the affections of Saul’s family, showing that divine providence is always at work, even in the midst of human designs."
    },
    {
      "pk": 9018021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 21,
      "text": "Saul thought, \"I will give her to him, that she may be a snare for him and that the hand of the Philistines may be against him.\" So Saul said to David a second time, \"You shall now be my son-in-law.\"",
      "links": "<a href='/AIV/09/18/17'>1Sam 18:17</a>; <a href='/AIV/09/19/11'>1Sam 19:11</a>",
      "comment": "The motif of evil intentions failing because the Lord protects the innocent is recurrent in Scripture; see Joseph’s words in Genesis 50:20."
    },
    {
      "pk": 9018022,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 22,
      "text": "And Saul commanded his servants, \"Speak to David in private, and say, 'Look, the king has delight in you, and all his servants love you. Now then, become the king’s son-in-law.'\"",
      "links": "<a href='/AIV/09/18/21'>1Sam 18:21</a>",
      "comment": "Saul seeks to manipulate David indirectly—a lesson in the purity of motives, echoed in Jesus’ teaching about integrity (Matt. 5:37)."
    },
    {
      "pk": 9018023,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 23,
      "text": "And Saul’s servants said these words in David’s hearing. But David said, \"Does it seem to you a small thing to become the king’s son-in-law, seeing that I am a poor man and lightly esteemed?\"",
      "links": "<a href='/AIV/09/18/18'>1Sam 18:18</a>",
      "comment": "David’s lowliness prefigures the Beatitudes; the least are exalted in God’s Kingdom (Luke 1:52, Matt. 5:3)."
    },
    {
      "pk": 9018024,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 24,
      "text": "And the servants of Saul told him, \"Thus and so did David speak.\"",
      "links": "",
      "comment": "David’s humility is reported back, and the narrative builds toward Saul’s next test, contrasting the spirit of humility with ambition."
    },
    {
      "pk": 9018025,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 25,
      "text": "Then Saul said, \"Thus shall you say to David: ‘The king desires no bride-price except a hundred foreskins of the Philistines, to take vengeance on the king’s enemies.’\" Now Saul thought to make David fall by the hand of the Philistines.",
      "links": "<a href='/AIV/09/14/24'>1Sam 14:24</a>; <a href='/AIV/09/18/17'>1Sam 18:17</a>",
      "comment": "Saul sets an impossible bride-price, hoping to destroy David. The theme of God’s protection of His anointed continues."
    },
    {
      "pk": 9018026,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 26,
      "text": "When his servants told David these words, it pleased David well to become the king’s son-in-law. Before the time had expired,",
      "links": "",
      "comment": "David’s willingness to accept the challenge shows his courage rooted in faith, a hallmark of heroic sanctity."
    },
    {
      "pk": 9018027,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 27,
      "text": "David rose and went, he and his men, and struck down two hundred men of the Philistines. And David brought their foreskins, which were counted in full to the king, so that he became the king’s son-in-law. And Saul gave him his daughter Michal as a wife.",
      "links": "<a href='/AIV/09/25/44'>1Sam 25:44</a>",
      "comment": "God grants David twice the success Saul expected, underscoring the principle that God’s grace abundantly overcomes human obstacles."
    },
    {
      "pk": 9018028,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 28,
      "text": "When Saul saw and knew that the LORD was with David, and that all Israel loved him,",
      "links": "<a href='/AIV/09/18/12'>1Sam 18:12</a>",
      "comment": "Recognition of God’s favor is central here. True authority is always marked by the presence of the Lord and the love of God’s people."
    },
    {
      "pk": 9018029,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 29,
      "text": "Saul was even more afraid of David. So Saul became David’s enemy continually.",
      "links": "<a href='/AIV/09/18/15'>1Sam 18:15</a>; <a href='/AIV/09/19/1'>1Sam 19:1</a>",
      "comment": "Persistence in opposition to God’s chosen reveals the dire consequences of hardness of heart, a path seen in the rejection of prophets and ultimately of Christ Himself (Acts 7:51-52)."
    },
    {
      "pk": 9018030,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 18,
      "verse": 30,
      "text": "Then the commanders of the Philistines came out to battle, and as often as they came out, David had more success than all the servants of Saul, so that his name became highly esteemed.",
      "links": "<a href='/AIV/10/8/13'>2Sam 8:13</a>; <a href='/AIV/09/18/5'>1Sam 18:5</a>",
      "comment": "David’s rise to honor through faithfulness prefigures Christ’s glorification after humiliation (Phil. 2:8-11). This pattern is reflected in the saints who are honored in God’s household over time."
    }
  ],
  "translatedAt": "2025-12-24T02:59:25.523Z"
}