{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 3,
  "verses": [
    {
      "pk": 9003001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 1,
      "text": "Now the boy Samuel was ministering to the LORD before Eli. In those days the word of the LORD was rare; visions were not widespread.",
      "links": "<a href='/AIV/3/10/11'>Lev. 10:11</a>; <a href='/AIV/9/28/6'>1Sam 28:6</a>; <a href='/AIV/23/29/18'>Isa. 29:18</a>",
      "comment": "Samuel begins his service under Eli's oversight, showing the importance of faithful youth in spiritual ministry. The rarity of divine revelation emphasizes the spiritual dryness of the era."
    },
    {
      "pk": 9003002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 2,
      "text": "One night Eli, whose eyes had begun to grow dim and could not see well, was lying down in his usual place;",
      "links": "<a href='/AIV/9/4/15'>1Sam 4:15</a>; <a href='/AIV/21/12/3'>Eccl. 12:3</a>",
      "comment": "Eli's failing eyesight mirrors Israel's spiritual blindness at the time."
    },
    {
      "pk": 9003003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 3,
      "text": "and the lamp of God had not yet gone out, and Samuel was lying down in the temple of the LORD, where the ark of God was,",
      "links": "<a href='/AIV/2/27/20'>Exod. 27:20-21</a>; <a href='/AIV/9/1/9'>1Sam 1:9</a>",
      "comment": "The lamp of God burning points to the continual presence and light of God. The ark marks God's dwelling among His people. There is priestly imagery foreshadowing later temple worship."
    },
    {
      "pk": 9003004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 4,
      "text": "that the LORD called Samuel. He answered, \"Here I am!\"",
      "links": "<a href='/AIV/1/22/11'>Gen. 22:11</a>; <a href='/AIV/2/3/4'>Exod. 3:4</a>",
      "comment": "Samuel's immediate readiness echoes Abraham and Moses responding to God's call, showing youthful humility to listen."
    },
    {
      "pk": 9003005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 5,
      "text": "Samuel ran to Eli and said, \"Here I am, for you called me.\" But Eli said, \"I did not call you; go back and lie down.\" So he went and lay down.",
      "links": "<a href='/AIV/9/3/6'>1Sam 3:6</a>",
      "comment": "Samuel assumes Eli called him, reflecting his unfamiliarity with divine communication and the importance of spiritual mentorship."
    },
    {
      "pk": 9003006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 6,
      "text": "The LORD called again, \"Samuel!\" So Samuel got up and went to Eli and said, \"Here I am, for you called me.\" But Eli answered, \"I did not call, my son; go back and lie down.\"",
      "links": "<a href='/AIV/9/3/8'>1Sam 3:8</a>",
      "comment": "Samuel's repetition highlights his obedience and also the process by which God patiently reveals Himself."
    },
    {
      "pk": 9003007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 7,
      "text": "Now Samuel did not yet know the LORD, and the word of the LORD had not yet been revealed to him.",
      "links": "<a href='/AIV/7/2/10'>Judg. 2:10</a>; <a href='/AIV/9/3/1'>1Sam 3:1</a>",
      "comment": "This does not mean Samuel had no relationship with God, but that he had not yet experienced personal revelation. This reflects the difference between knowing about God and knowing God intimately, a key theme in the spiritual life."
    },
    {
      "pk": 9003008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 8,
      "text": "And the LORD called Samuel again, a third time. And he got up and went to Eli, and said, \"Here I am, for you called me.\" Then Eli understood that the LORD was calling the boy.",
      "links": "<a href='/AIV/9/3/4-6'>1Sam 3:4-6</a>",
      "comment": "The repeated call and Eli's eventual recognition show the role of tradition and elders in helping others discern God's voice."
    },
    {
      "pk": 9003009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 9,
      "text": "So Eli said to Samuel, \"Go, lie down, and if he calls you, say, 'Speak, LORD, for your servant is listening.'\" So Samuel went and lay down in his place.",
      "links": "<a href='/AIV/9/3/10'>1Sam 3:10</a>; <a href='/AIV/2/33/11'>Exod. 33:11</a>",
      "comment": "A format of response emerges—listening in humility. There is a liturgical tone here, as approach to God is taught and conducted with proper reverence."
    },
    {
      "pk": 9003010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 10,
      "text": "And the LORD came, stood there, and called as at the other times, \"Samuel! Samuel!\" Then Samuel said, \"Speak, for your servant is listening.\"",
      "links": "<a href='/AIV/2/3/4'>Exod. 3:4</a>; <a href='/AIV/9/3/4'>1Sam 3:4</a>",
      "comment": "God's personal presence is described vividly. The double naming signified significance (cf. Moses, Exodus 3:4). The act of listening is central to faith."
    },
    {
      "pk": 9003011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 11,
      "text": "Then the LORD said to Samuel, \"See, I am about to do a thing in Israel at which the ears of everyone who hears it will tingle.",
      "links": "<a href='/AIV/12/21/12'>2 Kgs. 21:12</a>; <a href='/AIV/24/19/3'>Jer. 19:3</a>",
      "comment": "A phrase used for astonishing judgment—God is intervening directly. This marks a turning point in salvation history."
    },
    {
      "pk": 9003012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 12,
      "text": "On that day I will carry out against Eli everything I have spoken concerning his house, from beginning to end.",
      "links": "<a href='/AIV/9/2/27-36'>1Sam 2:27-36</a>",
      "comment": "The prophecy against Eli is a direct consequence of his sons' sins and his failure to restrain them. God fulfills every word, highlighting the seriousness of priestly responsibility."
    },
    {
      "pk": 9003013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 13,
      "text": "I have told him that I am about to judge his house forever, for the iniquity he knew about—because his sons were blaspheming God, and he did not restrain them.",
      "links": "<a href='/AIV/9/2/12-17'>1Sam 2:12-17</a>",
      "comment": "Eli being held accountable for failure of discipline points to the need for stewardship and correction among those who lead the people of God."
    },
    {
      "pk": 9003014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 14,
      "text": "Therefore, I have sworn to the house of Eli that the iniquity of Eli's house shall not be atoned for by sacrifice or offering forever.\"",
      "links": "<a href='/AIV/23/1/13'>Isa. 1:13</a>; <a href='/AIV/9/2/17'>1Sam 2:17</a>",
      "comment": "God declares their sin irreversible by the temple's sacrificial system, hinting at the need for a perfect Sacrifice that truly atones for sin (cf. Heb. 10:4-10)."
    },
    {
      "pk": 9003015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 15,
      "text": "Samuel lay until morning; then he opened the doors of the house of the LORD. And Samuel was afraid to tell the vision to Eli.",
      "links": "<a href='/AIV/26/3/15'>Ezek. 3:15</a>",
      "comment": "Faithful service in liturgical duties is seen alongside the natural fear of bearing a hard prophetic message, a balance often faced by God's servants."
    },
    {
      "pk": 9003016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 16,
      "text": "But Eli called Samuel and said, \"Samuel, my son.\" And he said, \"Here I am.\"",
      "links": "",
      "comment": "Eli's fatherly address hints at a relationship of spiritual fatherhood and obedience."
    },
    {
      "pk": 9003017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 17,
      "text": "And Eli said, \"What was it that he told you? Do not hide it from me. May God deal with you, be it ever so severely, if you hide from me anything that he told you.\"",
      "links": "<a href='/AIV/8/20/13'>Ruth 1:17</a>; <a href='/AIV/9/25/22'>1Sam 25:22</a>",
      "comment": "Eli desires the full truth, even when it's painful—a model for leaders to receive correction."
    },
    {
      "pk": 9003018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 18,
      "text": "So Samuel told him everything, hiding nothing from him. And Eli said, \"He is the LORD; let him do what is good in his eyes.\"",
      "links": "<a href='/AIV/2/34/6'>Exod. 34:6</a>",
      "comment": "Eli's acceptance reflects humility before the will of God, accepting divine judgment—a theme later realized in the passion of Christ."
    },
    {
      "pk": 9003019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 19,
      "text": "Samuel grew, and the LORD was with him, and let none of his words fall to the ground.",
      "links": "<a href='/AIV/9/2/26'>1Sam 2:26</a>; <a href='/AIV/24/1/7-10'>Jer. 1:7-10</a>",
      "comment": "God confirms Samuel as prophet. This foreshadows the authority granted to God's chosen servants, with God Himself validating their teaching."
    },
    {
      "pk": 9003020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 20,
      "text": "And all Israel from Dan to Beersheba knew that Samuel was established as a prophet of the LORD.",
      "links": "<a href='/AIV/7/20/1'>Judg. 20:1</a>; <a href='/AIV/9/4/1'>1Sam 4:1</a>",
      "comment": "A united recognition of Samuel’s office—Israel’s recognition of authentic authority and prophecy comes through public affirmation, marking true leadership."
    },
    {
      "pk": 9003021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 3,
      "verse": 21,
      "text": "And the LORD continued to appear at Shiloh, for the LORD revealed himself to Samuel at Shiloh by the word of the LORD.",
      "links": "<a href='/AIV/9/3/1'>1Sam 3:1</a>; <a href='/AIV/9/4/1'>1Sam 4:1</a>",
      "comment": "God’s revelation through His chosen serves as foundation for the people. Regular divine revelation through the prophet points to the principle of authoritative revelation entrusted to select individuals, a concept fulfilled in the apostolic and ecclesial structure later fully established in the New Testament era."
    }
  ],
  "translatedAt": "2025-12-24T02:50:23.676Z"
}