{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 19,
  "verses": [
    {
      "pk": 9019001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 1,
      "text": "Saul spoke to Jonathan his son and to all his servants, telling them to put David to death. But Jonathan, Saul’s son, greatly delighted in David.",
      "links": "<a href='/AIV/9/18/1'>1Sam 18:1</a>; <a href='/AIV/10/1/26'>2Sam 1:26</a>",
      "comment": "Saul’s jealousy of David intensifies to the point of wanting him dead. Notice Jonathan’s love for David, foreshadowing self-sacrificial friendship, mirrored in Christ’s own sacrificial love (John 15:13)."
    },
    {
      "pk": 9019002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 2,
      "text": "So Jonathan told David, 'My father Saul seeks to kill you. Now, please be on your guard in the morning. Stay in a secret place and hide yourself.'",
      "links": "<a href='/AIV/9/18/3'>1Sam 18:3</a>; <a href='/AIV/19/64/2-4'>Ps. 64:2-4</a>",
      "comment": "Jonathan’s intercession saves David’s life. Notice the role of faithful mediation, a theme that points to the need for spiritual intercessors in the life of the faithful."
    },
    {
      "pk": 9019003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 3,
      "text": "'I will go out and stand beside my father in the field where you are. I will speak about you to my father. If I find out anything, I will tell you.'",
      "links": "<a href='/AIV/9/20/9-13'>1Sam 20:9-13</a>",
      "comment": "Jonathan acts as a go-between. This foreshadows the role of mediators in the story of salvation, where advocacy and intercession play important roles in God’s plan (cf. Hebrews 7:25)."
    },
    {
      "pk": 9019004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 4,
      "text": "Jonathan spoke well of David to Saul his father and said to him, 'Let the king not sin against his servant David, because he has not sinned against you and his deeds have greatly benefited you.'",
      "links": "<a href='/AIV/9/17/50'>1Sam 17:50</a>; <a href='/AIV/9/18/14'>1Sam 18:14</a>",
      "comment": "Jonathan’s courage to confront his father for justice and truth is notable. The motif of interceding for the innocent, especially when done before an authority, points to Christ’s own role as advocate (1 John 2:1)."
    },
    {
      "pk": 9019005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 5,
      "text": "'He took his life in his hand and struck down the Philistine, and the LORD brought about a great deliverance for all Israel. You saw it and rejoiced. Why then would you sin against innocent blood by killing David without cause?'",
      "links": "<a href='/AIV/9/17/49-51'>1Sam 17:49-51</a>; <a href='/AIV/9/25/31'>1Sam 25:31</a>; <a href='/AIV/5/19/10-13'>Deut. 19:10-13</a>",
      "comment": "Innocent blood is a theme that echoes throughout the Old and New Testaments, ultimately fulfilled in Christ’s innocence and sacrificial death (Matthew 27:4)."
    },
    {
      "pk": 9019006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 6,
      "text": "Saul listened to the voice of Jonathan. Saul swore, 'As the Lord lives, he shall not be put to death.'",
      "links": "<a href='/AIV/7/21/7'>Judg. 21:7</a>; <a href='/AIV/2/20/7'>Exod. 20:7</a>",
      "comment": "Saul relents temporarily, swearing an oath. Oaths in the Old Testament are binding, reflecting the seriousness of invoking God’s name—see Jesus’ teachings in Matthew 5:34-37."
    },
    {
      "pk": 9019007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 7,
      "text": "Jonathan called David, and Jonathan reported to him all these things. Then Jonathan brought David to Saul, and he was in his presence as before.",
      "links": "<a href='/AIV/9/16/21'>1Sam 16:21</a>",
      "comment": "David is restored to Saul’s court, foreshadowing cycles of suffering and restoration—a pattern seen throughout salvation history."
    },
    {
      "pk": 9019008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 8,
      "text": "Once again, there was war. David went out and fought with the Philistines and struck them with a great blow, so they fled before him.",
      "links": "<a href='/AIV/9/17/32'>1Sam 17:32</a>; <a href='/AIV/9/18/27'>1Sam 18:27</a>",
      "comment": "David’s continued military victories show God’s favor, reminding readers of chosen servants in salvation history who are divinely aided for a greater purpose."
    },
    {
      "pk": 9019009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 9,
      "text": "Then an evil spirit from the LORD came upon Saul as he was sitting in his house with his spear in his hand. David was playing the lyre.",
      "links": "<a href='/AIV/9/16/14'><1Sam 16:14</a>; <a href='/AIV/9/18/10'>1Sam 18:10</a>",
      "comment": "Spiritual affliction is seen here as permitted by God, drawing a line between obedience and disobedience. Note the use of music in spiritual warfare and divine service (cf. 2 Kings 3:15, Ephesians 5:19)."
    },
    {
      "pk": 9019010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 10,
      "text": "Saul tried to pin David to the wall with the spear, but David slipped away from Saul. So Saul struck the spear into the wall, and David fled and escaped that night.",
      "links": "<a href='/AIV/9/18/11'>1Sam 18:11</a>; <a href='/AIV/19/59/1-2'>Ps. 59:1-2</a>",
      "comment": "David’s escape is credited to divine providence, revealing God’s protection over His anointed, a theme preparing for the ultimate Anointed One."
    },
    {
      "pk": 9019011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 11,
      "text": "Saul sent messengers to David’s house to watch him and to kill him in the morning. But Michal, David’s wife, told him, 'If you don’t save your life tonight, tomorrow you’ll be killed.'",
      "links": "<a href='/AIV/9/18/20-21'>1Sam 18:20-21</a>; <a href='/AIV/9/19/17'>1Sam 19:17</a>",
      "comment": "Michal’s intercession assists David’s escape. The theme of a spouse assisting in God’s plan points to marital union ordered to a higher purpose (Ephesians 5:22-32)."
    },
    {
      "pk": 9019012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 12,
      "text": "So Michal let David down through the window. He fled and escaped.",
      "links": "<a href='/AIV/6/2/15'>Josh 2:15</a>; <a href='/AIV/44/9/25'>Acts 9:25</a>",
      "comment": "Escape through a window echoes prior stories (Joshua 2:15, Rahab aiding spies), showing God’s preservation of His chosen servants, which culminates in the protection of the lineage of Jesus."
    },
    {
      "pk": 9019013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 13,
      "text": "Michal took an idol, laid it in the bed, put a cushion of goats’ hair at its head, and covered it with clothes.",
      "links": "<a href='/AIV/9/19/16'>1Sam 19:16</a>; <a href='/AIV/1/31/19'>Gen. 31:19</a>",
      "comment": "The mention of an idol reveals the presence of household images in Israel. The incident highlights the imperfections even among God’s people, underlining the need for continual conversion and spiritual purification."
    },
    {
      "pk": 9019014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 14,
      "text": "And when Saul sent messengers to take David, she said, 'He is sick.'",
      "links": "<a href='/AIV/9/19/17'>1Sam 19:17</a>",
      "comment": "Michal’s act of deception here is in service of a greater good (cf. Rahab, Joshua 2). This raises significant moral questions, but divine providence works even through human imperfection."
    },
    {
      "pk": 9019015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 15,
      "text": "Then Saul sent the messengers to see David, saying, 'Bring him up to me in the bed, that I may put him to death.'",
      "links": "<a href='/AIV/9/19/11'>1Sam 19:11</a>",
      "comment": "Saul’s hardening of heart recalls Pharaoh in Exodus, showcasing the tension between human rebellion and God’s sovereignty."
    },
    {
      "pk": 9019016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 16,
      "text": "When the messengers entered, there was the idol in the bed, with the cushion of goats’ hair at its head.",
      "links": "<a href='/AIV/9/19/13'>1Sam 19:13</a>",
      "comment": "The idol was used as a ruse for David’s escape. This episode subtly warns about the hidden dangers of domestic idolatry, a recurrent biblical theme (Deut. 7:25)."
    },
    {
      "pk": 9019017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 17,
      "text": "Saul said to Michal, 'Why have you deceived me like this and let my enemy go, so that he has escaped?' Michal answered Saul, 'He said to me, ‘Let me go! Why should I kill you?’'",
      "links": "<a href='/AIV/2/1/17-20'>Exod. 1:17-20</a>",
      "comment": "Like the Hebrew midwives, Michal’s concealment serves a greater purpose, underlining the mysterious ways God delivers His people."
    },
    {
      "pk": 9019018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 18,
      "text": "Now David fled and escaped, and he went to Samuel at Ramah, and told him all that Saul had done to him. He and Samuel went and stayed at Naioth.",
      "links": "<a href='/AIV/9/7/17'>1Sam 7:17</a>; <a href='/AIV/9/19/19'>1Sam 19:19</a>",
      "comment": "David returns to the prophetic community, seeking refuge and spiritual guidance. This prefigures seeking safety in the company of God’s holy ones."
    },
    {
      "pk": 9019019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 19,
      "text": "It was told Saul, 'David is at Naioth in Ramah.'",
      "links": "<a href='/AIV/9/19/18'>1Sam 19:18</a>",
      "comment": "David’s location becomes known; the theme of God’s anointed being pursued recurs, connecting with the persecutions of righteous men—culminating in Christ (John 15:20)."
    },
    {
      "pk": 9019020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 20,
      "text": "Then Saul sent messengers to take David, but when they saw the group of prophets prophesying, with Samuel standing as ruler over them, the Spirit of God came upon Saul’s messengers, and they also prophesied.",
      "links": "<a href='/AIV/9/10/10-13'>1Sam 10:10-13</a>; <a href='/AIV/4/11/25'>Num. 11:25</a>",
      "comment": "God’s Spirit intervenes, revealing His power to thwart human plans. The gift of prophecy shows the Spirit’s sovereignty, foreshadowing the Church’s charisms (1 Cor. 12:7-11)."
    },
    {
      "pk": 9019021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 21,
      "text": "When Saul was told, he sent other messengers, and they also prophesied. Saul sent messengers again the third time, and they also prophesied.",
      "links": "<a href='/AIV/9/10/10'>1Sam 10:10</a>",
      "comment": "Three times God overrules Saul through the Spirit. The repetition invokes completeness, and the power of God’s Spirit supersedes hostile intent (Acts 5:39)."
    },
    {
      "pk": 9019022,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 22,
      "text": "Then he himself went to Ramah and came to the great well that is in Secu, and he asked, 'Where are Samuel and David?' Someone said, 'Behold, they are at Naioth in Ramah.'",
      "links": "<a href='/AIV/9/7/17'>1Sam 7:17</a>; <a href='/AIV/9/19/18'>1Sam 19:18</a>",
      "comment": "Saul’s relentless pursuit reflects the recurring drama of man’s opposition and God’s intervention in redemptive history."
    },
    {
      "pk": 9019023,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 23,
      "text": "He went there to Naioth in Ramah, and the Spirit of God came even upon him, and as he walked on, he prophesied until he came to Naioth in Ramah.",
      "links": "<a href='/AIV/9/10/10'>1Sam 10:10</a>; <a href='/AIV/4/24/2'>Num. 24:2</a>",
      "comment": "Even Saul cannot resist God’s Spirit. God’s sovereignty can take hold even of the disobedient, revealing His power and mystery, much like God using unlikely instruments for His glory (see Balaam, Num. 24:2)."
    },
    {
      "pk": 9019024,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 19,
      "verse": 24,
      "text": "He also stripped off his clothes and prophesied before Samuel, and lay down naked all that day and all that night. Therefore it is said, 'Is Saul also among the prophets?'",
      "links": "<a href='/AIV/9/10/11-12'>1Sam 10:11-12</a>; <a href='/AIV/18/24/10'>Job 24:10</a>",
      "comment": "Saul’s loss of royal dignity and prophetic compulsion shows the reversal of man’s pride. God humbles the mighty and exalts the lowly, a pattern culminating in the Gospel (Luke 1:52). The question 'Is Saul among the prophets?' becomes proverbial for God’s surprising choice and the cost of resisting His will."
    }
  ],
  "translatedAt": "2025-12-24T03:00:03.882Z"
}