{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 16,
  "verses": [
    {
      "pk": 9016001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 1,
      "text": "The LORD said to Samuel, 'How long will you mourn for Saul, since I have rejected him from being king over Israel? Fill your horn with oil, and go. I am sending you to Jesse of Bethlehem, for I have provided for myself a king among his sons.'",
      "links": "<a href='/AIV/09/15/23'>1Sam 15:23</a>; <a href='/AIV/19/78/70'>Ps 78:70</a>; <a href='/AIV/40/01/06'>Matt 1:6</a>",
      "comment": "God's sovereign choice moves from Saul to one from Bethlehem, foreshadowing the Messiah coming from the same town (Matt 2:6). The use of oil signifies anointing for kingship—a physical sign that also points forward to the anointing of Christ, whose name in Greek means 'anointed one'."
    },
    {
      "pk": 9016002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 2,
      "text": "Samuel said, 'How can I go? If Saul hears it, he will kill me.' The LORD said, 'Take a heifer with you, and say, “I have come to sacrifice to the LORD.”'",
      "links": "<a href='/AIV/09/09/12'>1Sam 9:12</a>; <a href='/AIV/09/20/29'>1Sam 20:29</a>",
      "comment": "God provides a means for Samuel to safely obey—a sacrifice, which again prefigures the sacrificial system ultimately fulfilled in Christ’s own offering (Heb 10:10)."
    },
    {
      "pk": 9016003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 3,
      "text": "'Invite Jesse to the sacrifice, and I will make known to you what you shall do. You shall anoint for me the one I indicate to you.'",
      "links": "<a href='/AIV/09/10/1'>1Sam 10:1</a>",
      "comment": "Samuel is to await the Lord’s revelation; leadership comes by divine appointment, not human ambition. This models apostolic succession—a passing on of authority as willed by God."
    },
    {
      "pk": 9016004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 4,
      "text": "Samuel did what the LORD had said and came to Bethlehem. The elders of the town trembled when they met him and said, 'Do you come in peace?'",
      "links": "<a href='/AIV/09/15/13'>1Sam 15:13</a>",
      "comment": "Prophets’ coming was often seen as connected to judgment or blessing. Samuel’s authority is respected, showing the high status of God’s representatives."
    },
    {
      "pk": 9016005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 5,
      "text": "He said, 'In peace. I have come to sacrifice to the LORD. Consecrate yourselves, and come with me to the sacrifice.' Then he consecrated Jesse and his sons, and invited them to the sacrifice.",
      "links": "<a href='/AIV/02/19/10'>Exod 19:10</a>; <a href='/AIV/03/08/10'>Lev 8:10</a>",
      "comment": "The call to consecration underlines the necessity of holiness before approaching God, hinting at the ongoing call to purification before God’s presence."
    },
    {
      "pk": 9016006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 6,
      "text": "When they came, he looked on Eliab and thought, 'Surely the LORD’s anointed stands here before him.'",
      "links": "<a href='/AIV/09/17/13'>1Sam 17:13</a>",
      "comment": "Even Samuel expects God’s choice to match human expectations, reminding us that divine selection often differs from worldly assumptions (1 Cor 1:27)."
    },
    {
      "pk": 9016007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 7,
      "text": "But the LORD said to Samuel, 'Do not look on his appearance or the height of his stature, for I have rejected him. For the LORD does not see as man sees. Man looks at the outward appearance, but the LORD looks at the heart.'",
      "links": "<a href='/AIV/09/09/02'>1Sam 9:2</a>; <a href='/AIV/19/51/6'>Ps 51:6</a>; <a href='/AIV/40/23/27'>Matt 23:27</a>",
      "comment": "This key verse teaches that God judges by the interior life, not merely by externals. The heart’s disposition toward God is primary—a principle echoed in Jesus’ teaching about inward purity."
    },
    {
      "pk": 9016008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 8,
      "text": "Then Jesse called Abinadab and made him pass before Samuel. He said, 'Neither has the LORD chosen this one.'",
      "links": "<a href='/AIV/09/17/13'>1Sam 17:13</a>",
      "comment": "Despite outward suitability, Abinadab is not chosen. God’s call is mysterious and often contrary to human understanding."
    },
    {
      "pk": 9016009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 9,
      "text": "Then Jesse made Shammah pass by. But he said, 'Neither has the LORD chosen this one.'",
      "links": "<a href='/AIV/09/17/13'>1Sam 17:13</a>",
      "comment": "Another son passes, still not chosen. The narrative emphasizes the specificity of God’s plan and the need for patience in discerning vocations."
    },
    {
      "pk": 9016010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 10,
      "text": "Jesse made seven of his sons pass before Samuel. Samuel said to Jesse, 'The LORD has not chosen these.'",
      "links": "<a href='/AIV/13/02/13-15'>1 Chr 2:13-15</a>",
      "comment": "God’s methodical process highlights discernment and God’s hidden wisdom—qualities essential for leadership in the community of faith."
    },
    {
      "pk": 9016011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 11,
      "text": "Then Samuel said to Jesse, 'Are all your sons here?' Jesse said, 'There remains yet the youngest, but behold, he is keeping the sheep.' Samuel said to Jesse, 'Send and get him, for we will not sit down until he comes here.'",
      "links": "<a href='/AIV/09/17/15'>1Sam 17:15</a>",
      "comment": "David’s humble occupation as shepherd foreshadows Jesus as the Good Shepherd (John 10:11). The youngest is honored in God’s plan—a recurring theme of reversal in salvation history."
    },
    {
      "pk": 9016012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 12,
      "text": "So he sent and brought him in. Now he was ruddy, with beautiful eyes and handsome. The LORD said, 'Arise, anoint him, for this is he.'",
      "links": "<a href='/AIV/19/78/70-71'>Ps 78:70-71</a>; <a href='/AIV/19/89/20'>Ps 89:20</a>",
      "comment": "David’s selection is based on God’s will, not merely physical traits, but the physical description signals the fittingness of God’s chosen king. The act of anointing prefigures the sacramental practice of conferring grace and office."
    },
    {
      "pk": 9016013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 13,
      "text": "Then Samuel took the horn of oil and anointed him in the midst of his brothers. And the Spirit of the LORD came mightily upon David from that day forward. Samuel then rose and went to Ramah.",
      "links": "<a href='/AIV/09/10/1'>1Sam 10:1</a>; <a href='/AIV/19/89/20'>Ps 89:20</a>; <a href='/AIV/44/13/22'>Acts 13:22</a>",
      "comment": "The Spirit's descent is a sign of true authority and empowerment, paralleling Jesus’ baptism and the descent of the Holy Spirit (Luke 3:22). The public anointing parallels ordination rites and confers spiritual power and legitimacy."
    },
    {
      "pk": 9016014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 14,
      "text": "Now the Spirit of the LORD departed from Saul, and an evil spirit from the LORD tormented him.",
      "links": "<a href='/AIV/07/09/23'>Judg 9:23</a>; <a href='/AIV/09/18/10'>1Sam 18:10</a>",
      "comment": "Saul’s loss of the Spirit signifies the withdrawal of divine favor. Allowing a spirit of judgment signifies God’s control even over instruments of chastisement."
    },
    {
      "pk": 9016015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 15,
      "text": "Saul’s servants said to him, 'See now, an evil spirit from God is tormenting you.'",
      "links": "<a href='/AIV/09/16/14'>1Sam 16:14</a>",
      "comment": "The ancient view identifies all events, even affliction, as permitted by God for a purpose; suffering here is seen as a consequence of Saul’s disobedience."
    },
    {
      "pk": 9016016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 16,
      "text": "'Let our lord command your servants to seek out a man who is skilled in playing the lyre. When the evil spirit from God is upon you, he will play, and you will feel better.'",
      "links": "<a href='/AIV/09/18/10'>1Sam 18:10</a>",
      "comment": "Music is used as an aid for soothing spiritual distress, hinting at the use of beauty and order in worship to restore the soul."
    },
    {
      "pk": 9016017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 17,
      "text": "So Saul said to his servants, 'Provide for me a man who can play well, and bring him to me.'",
      "links": "",
      "comment": "God works through the ordinary means of art and skill, highlighting the dignity of music as a gift from God instrumental in spiritual consolation."
    },
    {
      "pk": 9016018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 18,
      "text": "One of the young men answered, 'Behold, I have seen a son of Jesse of Bethlehem who is skilled in playing, a courageous man, a warrior, wise in speech, and handsome; and the LORD is with him.'",
      "links": "<a href='/AIV/09/17/12'>1Sam 17:12</a>",
      "comment": "David is commended not only for skill but for God’s presence with him. This foreshadows how the Lord's chosen one is both spiritually and morally equipped for leadership."
    },
    {
      "pk": 9016019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 19,
      "text": "So Saul sent messengers to Jesse and said, 'Send me David your son, who is with the sheep.'",
      "links": "",
      "comment": "God’s providential plan brings David, the shepherd, into the king’s service—a typological foreshadowing of Christ’s humility and service (Phil 2:6-8)."
    },
    {
      "pk": 9016020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 20,
      "text": "Jesse took a donkey loaded with bread, a skin of wine, and a young goat, and sent them by his son David to Saul.",
      "links": "<a href='/AIV/09/10/27'>1Sam 10:27</a>",
      "comment": "The gifts express respect and gratitude, recalling the practice of bringing offerings—a gesture later mirrored in the presentation of bread and wine in worship."
    },
    {
      "pk": 9016021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 21,
      "text": "David came to Saul and entered his service. Saul loved him greatly, and he became his armor-bearer.",
      "links": "<a href='/AIV/09/18/2'>1Sam 18:2</a>",
      "comment": "David is received with love, prefiguring the beloved Son who is to serve and uplift the people of God. David’s role as armor-bearer signals his gradual preparation and initiation for kingship."
    },
    {
      "pk": 9016022,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 22,
      "text": "Saul sent word to Jesse, saying, 'Let David remain in my service, for he has found favor in my sight.'",
      "links": "<a href='/AIV/01/39/4'>Gen 39:4</a>",
      "comment": "David’s finding favor parallels figures like Joseph in Egypt—chosen instruments raised up through humble service."
    },
    {
      "pk": 9016023,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 16,
      "verse": 23,
      "text": "Whenever the spirit from God was upon Saul, David would take the lyre and play, and Saul would be refreshed and relieved, and the evil spirit would depart from him.",
      "links": "<a href='/AIV/09/16/16'>1Sam 16:16</a>",
      "comment": "The power of sacred music and the ministry of the anointed bring true spiritual relief, echoing the later sacramental and liturgical life that brings healing to God’s people through material means joined to divine grace."
    }
  ],
  "translatedAt": "2025-12-24T02:57:59.508Z"
}