{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 27,
  "verses": [
    {
      "pk": 9027001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 27,
      "verse": 1,
      "text": "David said in his heart, 'One day I will be destroyed by the hand of Saul. The best thing I can do is to escape to the land of the Philistines. Then Saul will stop searching for me in all Israel, and I will escape from his hand.'",
      "links": "<a href='/AIV/9/23/14'>1Sam. 23:14</a>; <a href='/AIV/9/26/24'>1Sam. 26:24</a>",
      "comment": "David's discouragement leads him to seek refuge among Israel's enemies, the Philistines, displaying the human tendency toward fear even in the faithful. God will use this action as part of His providence, foreshadowing how even our moments of doubt can fit within a greater plan. Compare similar moments of discouragement in the lives of Moses (Num. 11:15) and Elijah (1 Kings 19:4)."
    },
    {
      "pk": 9027002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 27,
      "verse": 2,
      "text": "So David arose and went over, he and the six hundred men who were with him, to Achish son of Maoch, king of Gath.",
      "links": "<a href='/AIV/9/21/10'>1Sam. 21:10</a>; <a href='/AIV/13/18/1'>1Chr. 18:1</a>",
      "comment": "David's return to Achish is notable, as he had previously feigned insanity before this Philistine king. Now, he approaches openly, prepared for a more complex relationship. This movement to foreign territory shows a recurring biblical motif: God can bring good from apparent defeat or exile (cp. Joseph in Egypt, Gen. 50:20)."
    },
    {
      "pk": 9027003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 27,
      "verse": 3,
      "text": "David lived with Achish at Gath, he and his men, every man with his household; and David brought his two wives with him, Ahinoam of Jezreel and Abigail of Carmel, Nabal’s widow.",
      "links": "<a href='/AIV/9/25/42-43'>1Sam. 25:42-43</a>; <a href='/AIV/9/30/5'>1Sam. 30:5</a>",
      "comment": "David's action here mirrors the patriarchal journeys with households, signifying a rootedness and continuing promise. Notably, his leadership now encompasses guiding a whole community, not just warriors, prefiguring the shepherding role of the Messiah (cf. Jn 10:11)."
    },
    {
      "pk": 9027004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 27,
      "verse": 4,
      "text": "When Saul was told that David had fled to Gath, he no longer searched for him.",
      "links": "<a href='/AIV/9/23/14'>1Sam. 23:14</a>; <a href='/AIV/9/26/24'>1Sam. 26:24</a>",
      "comment": "Saul's pursuit ceases when he hears of David's escape, showing how God can use unlikely circumstances to provide protection for His chosen. Trust in divine providence is a recurring biblical principle (cf. Mt 2:13-15, the flight into Egypt)."
    },
    {
      "pk": 9027005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 27,
      "verse": 5,
      "text": "Then David said to Achish, 'If I have found favor in your eyes, let me be given a place in one of the country towns, so I may live there. Why should your servant dwell in the royal city with you?'",
      "links": "<a href='/AIV/9/21/10'>1Sam. 21:10</a>; <a href='/AIV/9/30/1'>1Sam. 30:1</a>",
      "comment": "David refers to himself as Achish's servant, showing humility and wisdom in navigating foreign courts. He seeks separation for his people, preserving their identity—paralleling how the faithful are called to be set apart, yet present in the world (cf. Jn 17:15-16)."
    },
    {
      "pk": 9027006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 27,
      "verse": 6,
      "text": "So that day Achish gave him Ziklag. Therefore, Ziklag has belonged to the kings of Judah until this day.",
      "links": "<a href='/AIV/9/30/1'>1Sam. 30:1</a>; <a href='/AIV/13/12/1'>1Chr. 12:1</a>",
      "comment": "Ziklag becomes a lasting inheritance for David's descendants. This act connects to the gift of promised land in earlier scripture, and prefigures the transfer of authority and territory that ultimately foreshadows David's kingship, from which the messianic line would come (cf. Lk 1:32-33)."
    },
    {
      "pk": 9027007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 27,
      "verse": 7,
      "text": "The length of time that David lived in Philistine territory was one year and four months.",
      "links": "<a href='/AIV/9/29/3'>1Sam. 29:3</a>",
      "comment": "David's temporary sojourn in exile reflects biblical cycles of exile and return, which find fulfillment in Christ's sojourn on earth, His apparent 'absence' from glory before being enthroned. Periods of trial can serve to purify and prepare for future mission."
    },
    {
      "pk": 9027008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 27,
      "verse": 8,
      "text": "David and his men went up and raided the Geshurites, the Girzites, and the Amalekites—peoples who had lived in the land from ancient times, from the way to Shur as far as the land of Egypt.",
      "links": "<a href='/AIV/9/15/7'>1Sam. 15:7</a>; <a href='/AIV/2/17/8'>Ex. 17:8</a>",
      "comment": "These nations were historic enemies of Israel, and David's actions are partly a fulfillment of Israel’s ancient mandates (see Ex 17:14, Deut 25:17-19). The notion of cleansing the land prefigures Christ’s confrontation with sin and evil during His ministry."
    },
    {
      "pk": 9027009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 27,
      "verse": 9,
      "text": "When David attacked an area, he left neither man nor woman alive, but took the sheep, cattle, donkeys, camels, and clothing, and returned and came to Achish.",
      "links": "<a href='/AIV/9/15/3'>1Sam. 15:3</a>; <a href='/AIV/9/15/8'>1Sam. 15:8</a>",
      "comment": "David's total destruction opposes Saul’s earlier disobedience (1 Sam 15). While these acts were specific to the ancient context, they point toward the absolute victory over evil that Christ wins, not by violence but by self-giving. Allegorically, the spiritual life requires relentless opposition to sin (cf. Mt 5:29-30)."
    },
    {
      "pk": 9027010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 27,
      "verse": 10,
      "text": "When Achish asked, 'Against whom have you made a raid today?' David would say, 'Against the Negev of Judah,' or 'Against the Negev of the Jerahmeelites,' or 'Against the Negev of the Kenites.'",
      "links": "<a href='/AIV/6/15/58'>Josh. 15:58</a>; <a href='/AIV/9/30/29'>1Sam. 30:29</a>",
      "comment": "David chooses to deceive Achish, masking his true actions. Scripture records this without approving deceit, but reveals the complexities of human choices, even among the anointed. God’s providence can work through imperfect human agency, as He guides salvation history (see Rom 8:28)."
    },
    {
      "pk": 9027011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 27,
      "verse": 11,
      "text": "David left neither man nor woman alive to bring to Gath, thinking, 'Otherwise, they might inform on us and say, “This is what David did.”' Such was his practice the whole time he lived in Philistine territory.",
      "links": "<a href='/AIV/9/27/9'>1Sam. 27:9</a>",
      "comment": "David’s strategy ensured secrecy and security for his people but involved morally fraught decisions. The relentless pursuit of safety for his “flock” anticipates leadership images taken up by Jesus (cf. Jn 10:11), but differs in method, hinting at the coming new law of grace."
    },
    {
      "pk": 9027012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 27,
      "verse": 12,
      "text": "Achish trusted David, thinking, 'He has made himself utterly abhorrent to his people Israel; therefore he will be my servant forever.'",
      "links": "<a href='/AIV/9/29/3'>1Sam. 29:3</a>",
      "comment": "Achish’s trust is based on a misunderstanding, showing how divine plans surpass human perception. David’s apparent rejection by his own prepares the way for his later exaltation. This finds ultimate fulfillment in Christ, who was rejected by His own people yet raised up as King (Acts 4:10-11)."
    }
  ],
  "translatedAt": "2025-12-24T03:06:31.566Z"
}