{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 14,
  "verses": [
    {
      "pk": 9014001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 1,
      "text": "One day Jonathan, son of Saul, said to the young man who carried his armor, “Let’s go over to the Philistine garrison that’s on the other side.” But he did not tell his father.",
      "links": "<a href='/AIV/9/13/3'>1Sam 13:3</a>",
      "comment": "Jonathan chooses to act with initiative and faith, not waiting for permission from Saul. This sets a pattern of courageous trust often seen in key biblical figures."
    },
    {
      "pk": 9014002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 2,
      "text": "Saul was staying on the outskirts of Gibeah under the pomegranate tree at Migron; the people with him numbered about six hundred.",
      "links": "<a href='/AIV/9/13/2'>1Sam 13:2</a>",
      "comment": "Saul’s position of waiting contrasts Jonathan’s bold action, reflecting different approaches to leadership and faith."
    },
    {
      "pk": 9014003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 3,
      "text": "Ahijah, son of Ahitub—Ichabod’s brother, son of Phinehas, son of Eli, the priest of the LORD at Shiloh—was wearing an ephod. The people did not know that Jonathan had gone.",
      "links": "<a href='/AIV/9/2/28'>1Sam 2:28</a>; <a href='/AIV/9/4/21'>1Sam 4:21</a>",
      "comment": "The priesthood’s lineage is confirmed here. The mention of the ephod highlights Israel’s reliance on God's guidance through established priestly authority."
    },
    {
      "pk": 9014004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 4,
      "text": "Between the passes by which Jonathan aimed to cross over to the Philistine garrison, there was a sharp crag on one side and a sharp crag on the other; the name of one was Bozez, and the other Seneh.",
      "links": "",
      "comment": "The physical difficulty underlines the challenge facing Jonathan, adding drama and historical detail."
    },
    {
      "pk": 9014005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 5,
      "text": "One crag rose on the north in front of Michmash, and the other on the south in front of Geba.",
      "links": "<a href='/AIV/9/13/16'>1Sam 13:16</a>",
      "comment": "Topography provided strategic military significance. The placement further indicates the risk Jonathan is taking."
    },
    {
      "pk": 9014006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 6,
      "text": "Jonathan said to the young man who carried his armor, “Let’s go across to the outpost of these uncircumcised. Maybe the LORD will act for us, for nothing can hinder the LORD from saving by many or by few.”",
      "links": "<a href='/AIV/7/7/7'>Judg 7:7</a>; <a href='/AIV/9/17/47'>1Sam 17:47</a>",
      "comment": "Jonathan expresses deep faith in God's unlimited power, echoing themes seen elsewhere in Scripture. The term 'uncircumcised' invokes covenantal identity."
    },
    {
      "pk": 9014007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 7,
      "text": "His armor-bearer replied, “Do all that you are inclined to do; I am with you heart and soul.”",
      "links": "",
      "comment": "The loyalty of Jonathan's companion sets a model for discipleship and unity in carrying out God’s mission."
    },
    {
      "pk": 9014008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 8,
      "text": "Jonathan said, “We’ll cross over to the men and show ourselves to them.",
      "links": "",
      "comment": "Jonathan willingly puts his faith on display, refusing to act in secrecy or deception."
    },
    {
      "pk": 9014009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 9,
      "text": "If they say, ‘Wait until we come to you,’ then we’ll stand still in our place and not go up to them.",
      "links": "",
      "comment": "Jonathan calls for discernment in action, relying on signs to interpret God’s will—showing openness to divine direction, much like the apostles sought guidance."
    },
    {
      "pk": 90140010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 10,
      "text": "But if they say, ‘Come up to us,’ then we’ll go up, because the LORD has given them into our hand. That will be the sign to us.”",
      "links": "<a href='/AIV/7/6/36-40'>Judg 6:36-40</a>",
      "comment": "Jonathan’s faith resembles Gideon’s seeking of signs. Signs as guidance appear throughout Scripture, in both Old and New Testaments."
    },
    {
      "pk": 90140011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 11,
      "text": "So both of them showed themselves to the Philistine garrison. The Philistines said, “Look, the Hebrews are coming out of the holes where they’ve been hiding.”",
      "links": "<a href='/AIV/9/13/6'>1Sam 13:6</a>",
      "comment": "The Philistines mock Israel’s perceived weakness, but God often acts through those considered least."
    },
    {
      "pk": 90140012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 12,
      "text": "The men of the garrison called out to Jonathan and his armor-bearer, “Come up to us and we'll show you something!” Jonathan said to his armor-bearer, “Come up after me, for the LORD has handed them over to Israel.”",
      "links": "<a href='/AIV/9/17/47'>1Sam 17:47</a>",
      "comment": "Jonathan interprets their words as the sign he sought, acting in faith."
    },
    {
      "pk": 90140013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 13,
      "text": "Jonathan climbed up on his hands and feet, with his armor-bearer behind him. He fell upon them, and his armor-bearer killed after him.",
      "links": "",
      "comment": "Jonathan’s courage and his companion’s support are key to the victory. The cooperation points to the value of close partnership in carrying out God’s purposes."
    },
    {
      "pk": 90140014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 14,
      "text": "In that first attack, Jonathan and his armor-bearer killed about twenty men within half an acre of land.",
      "links": "",
      "comment": "A remarkable result from a small group, emphasizing God’s power to deliver through the few."
    },
    {
      "pk": 90140015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 15,
      "text": "Then panic spread in the camp, across the field, and among all the people. The garrison and the raiders trembled, and the earth quaked, and there was a very great panic.",
      "links": "<a href='/AIV/2/23/14'>Exod 23:14</a>; <a href='/AIV/6/2/9'>Josh 2:9</a>",
      "comment": "The panic is supernatural in scope. Such acts recall other moments in Israel’s history when God directly causes the enemies to flee."
    },
    {
      "pk": 90140016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 16,
      "text": "Saul’s watchmen in Gibeah of Benjamin saw the multitude rushing away; they melted away, going in all directions.",
      "links": "",
      "comment": "Saul’s watchmen witness the outcome of Jonathan’s faith-led action. God often works in hidden ways that later become apparent."
    },
    {
      "pk": 90140017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 17,
      "text": "Saul said to the people who were with him, “Count and see who has gone from us.” When they had counted, Jonathan and his armor-bearer were not there.",
      "links": "",
      "comment": "Saul’s focus is administrative; the absence of Jonathan signals God has used unexpected agents for victory."
    },
    {
      "pk": 90140018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 18,
      "text": "Saul said to Ahijah, “Bring the ark of God here.” (For at that time the ark of God was with the Israelites.)",
      "links": "<a href='/AIV/9/4/3-4'>1Sam 4:3-4</a>",
      "comment": "Saul’s request shows a desire to seek God’s guidance, although his relationship with the priesthood often seems formal or strategic in the narrative."
    },
    {
      "pk": 90140019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 19,
      "text": "While Saul was speaking to the priest, the confusion in the Philistine camp grew greater and greater; so Saul said to the priest, “Withdraw your hand.”",
      "links": "",
      "comment": "Saul interrupts the seeking of God’s will in light of immediate events. This indicates a lack of patience, contrasting with Jonathan’s prayerful approach."
    },
    {
      "pk": 90140020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 20,
      "text": "Then Saul and all the people who were with him assembled and went into the battle; and behold, every Philistine’s sword was against his fellow, and there was great confusion.",
      "links": "<a href='/AIV/7/7/22'>Judg 7:22</a>",
      "comment": "God brings about victory for Israel through chaos in the enemy, echoing previous deliverances."
    },
    {
      "pk": 90140021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 21,
      "text": "The Hebrews who had been with the Philistines before and had gone up with them into their camp, also turned to join the Israelites who were with Saul and Jonathan.",
      "links": "",
      "comment": "Caught Israelites return to their true allegiance, pointing to themes of reconciliation and return echoed in God’s call to wayward believers."
    },
    {
      "pk": 90140022,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 22,
      "text": "All the men of Israel who had hidden in the hill country of Ephraim heard the Philistines were fleeing, so they also joined the battle and pursued them.",
      "links": "",
      "comment": "Those hiding in fear now come out, joining in the victory. God’s actions call forth courage and unity from His people."
    },
    {
      "pk": 90140023,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 23,
      "text": "So the LORD saved Israel that day. The battle passed beyond Beth-aven.",
      "links": "<a href='/AIV/2/14/13'>Exod 14:13</a>; <a href='/AIV/9/7/12'>1Sam 7:12</a>",
      "comment": "Divine intervention is explicitly credited. God alone is Israel’s savior, foreshadowing the ultimate deliverance through Christ."
    },
    {
      "pk": 90140024,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 24,
      "text": "The men of Israel were hard pressed that day, because Saul had put the people under an oath, saying: “Cursed is the man who eats food until evening, before I have avenged my enemies!” So none of the people tasted food.",
      "links": "",
      "comment": "Saul’s rash oath burdens his people and shows the dangers of impulsive vows, which later church teaching cautions against."
    },
    {
      "pk": 90140025,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 25,
      "text": "Now all the people came into the forest; and there was honey on the ground.",
      "links": "",
      "comment": "The abundance of honey suggests God’s provision, which the people miss because of Saul’s oath."
    },
    {
      "pk": 90140026,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 26,
      "text": "When the people entered the forest and saw the honey dripping, none of them tasted it because they feared the oath.",
      "links": "",
      "comment": "Fear of Saul’s curse outweighs natural need; the narrative warns of strict human commands that can obscure God’s blessings."
    },
    {
      "pk": 90140027,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 27,
      "text": "But Jonathan had not heard his father’s oath, so he stretched out the end of the staff in his hand, dipped it in the honeycomb, and raised his hand to his mouth. His eyes brightened.",
      "links": "",
      "comment": "Jonathan, unaware, is refreshed—which illustrates the life-giving nature of God’s provision when unhampered by unjust restrictions."
    },
    {
      "pk": 90140028,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 28,
      "text": "Then one of the people said, “Your father strictly charged the people with an oath, saying, ‘Cursed is anyone who eats food today.’” The people were faint.",
      "links": "",
      "comment": "This demonstrates the harmful consequences of ill-advised vows and the need for wise and merciful leadership."
    },
    {
      "pk": 90140029,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 29,
      "text": "Jonathan said, “My father has troubled the land. See how my eyes have brightened because I tasted this honey.",
      "links": "",
      "comment": "Jonathan openly rebukes Saul’s decision, emphasizing discernment and the value of God’s natural gifts."
    },
    {
      "pk": 90140030,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 30,
      "text": "If only the people had eaten freely today from the spoil of their enemies, the slaughter of the Philistines would have been greater.”",
      "links": "<a href='/AIV/9/30/22-24'>1Sam 30:22-24</a>",
      "comment": "Jonathan observes the missed opportunity for a greater victory, suggesting that spiritual leaders must also care for the well-being of those they serve."
    },
    {
      "pk": 90140031,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 31,
      "text": "They struck down the Philistines that day from Michmash to Aijalon, and the people were very faint.",
      "links": "",
      "comment": "The exhaustion underscores how Saul’s oath weakened Israel’s fighting strength."
    },
    {
      "pk": 90140032,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 32,
      "text": "The people pounced on the spoil and took sheep, cattle, and calves, and slaughtered them on the ground. They ate them with the blood.",
      "links": "<a href='/AIV/3/17/10-14'>Lev 17:10-14</a>",
      "comment": "Eating blood was forbidden—this display of desperate disobedience arises from the harsh oath. The importance of proper sacramental observance is underscored."
    },
    {
      "pk": 90140033,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 33,
      "text": "Someone told Saul, “Look, the people are sinning against the LORD by eating with the blood.” Saul said, “You have acted faithlessly. Roll a great stone to me here.”",
      "links": "<a href='/AIV/3/17/10-14'>Lev 17:10-14</a>",
      "comment": "Saul attempts to restore order by enforcing the law of God, showing the role of king as steward and enforcer of divine law."
    },
    {
      "pk": 90140034,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 34,
      "text": "Saul said, “Disperse yourselves among the people and tell them, ‘Let each man bring his ox or sheep and slaughter it here, and do not sin against the LORD by eating with the blood.’” So everyone brought his ox and slaughtered it there.",
      "links": "",
      "comment": "Here, Saul exercises priestly responsibilities, foreshadowing the role of kings as spiritual leaders and prefiguring the fullness of this office fulfilled by Christ."
    },
    {
      "pk": 90140035,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 35,
      "text": "Saul built an altar to the LORD; it was the first altar he had built to the LORD.",
      "links": "<a href='/AIV/1/4/1'>Gen 4:1</a>; <a href='/AIV/1/12/7'>Gen 12:7</a>",
      "comment": "Building an altar reflects formal worship and atonement. Altars throughout Scripture point to the importance of sacrificial worship."
    },
    {
      "pk": 90140036,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 36,
      "text": "Saul said, “Let’s go down after the Philistines by night and take spoil until morning. Don’t let one of them escape.” They replied, “Do whatever seems good to you.” But the priest said, “Let’s draw near to God here.”",
      "links": "",
      "comment": "The priest’s intervention highlights the primacy of seeking God’s will before action—a vital lesson in faithful stewardship and spiritual humility."
    },
    {
      "pk": 90140037,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 37,
      "text": "So Saul asked God, “Shall I go down after the Philistines? Will you give them into Israel’s hand?” But God did not answer him that day.",
      "links": "<a href='/AIV/7/20/18'>Judg 20:18</a>",
      "comment": "God’s silence often serves as a time of reflection and examination of one's heart and motives. Such divine withholding is common in periods of disobedience or lack of faith."
    },
    {
      "pk": 90140038,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 38,
      "text": "Saul said, “Come here, all of you leaders of the people, and find out how this sin has happened today.”",
      "links": "",
      "comment": "Saul recognizes there is sin that has blocked God’s answer. Corporate discernment is sought, paralleling times when the community would gather for judgment or guidance."
    },
    {
      "pk": 90140039,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 39,
      "text": "For as the LORD lives, who saves Israel, even if the guilt is found in Jonathan my son, he shall surely die.” But none of the people answered him.",
      "links": "",
      "comment": "Saul vows impartial justice, even against his own son. The seriousness of sin is emphasized, yet the people remain silent—possibly out of respect, fear, or knowledge of the truth."
    },
    {
      "pk": 90140040,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 40,
      "text": "Then Saul said to all Israel, “You be on one side, and I and Jonathan my son will be on the other side.” The people said to Saul, “Do what seems good to you.”",
      "links": "",
      "comment": "Saul sets a process for discernment, embodying a kind of trial. The separation recalls how leaders and people would gather in spiritual discernment."
    },
    {
      "pk": 90140041,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 41,
      "text": "Then Saul prayed to the LORD, the God of Israel, “Why have you not answered your servant? If the guilt is in me or in Jonathan my son, LORD God of Israel, give Urim; but if it’s in your people Israel, give Thummim.” Jonathan and Saul were indicated by lot, and the people went free.",
      "links": "<a href='/AIV/2/28/30'>Exod 28:30</a>",
      "comment": "Use of Urim and Thummim for divine direction shows Israel’s tradition of discerning God’s will through established means. These forms prefigure the role of authoritative, sacramental signs in later tradition."
    },
    {
      "pk": 90140042,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 42,
      "text": "Saul said, “Cast the lot between me and Jonathan my son.” Jonathan was selected.",
      "links": "",
      "comment": "Jonathan is found by lot—divine providence overrules human plans. This emphasizes trust in God's sovereignty."
    },
    {
      "pk": 90140043,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 43,
      "text": "Then Saul said to Jonathan, “Tell me what you’ve done.” Jonathan told him, “I merely tasted a little honey with the end of my staff. Here I am; I will die.”",
      "links": "",
      "comment": "Jonathan’s honesty and willingness to face the consequences embody the courage and integrity expected of the righteous."
    },
    {
      "pk": 90140044,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 44,
      "text": "Saul said, “God do so to me and more also, for you shall surely die, Jonathan.”",
      "links": "",
      "comment": "Saul binds himself with a formal oath, showing both the seriousness and the limitations of human justice."
    },
    {
      "pk": 90140045,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 45,
      "text": "But the people said to Saul, “Shall Jonathan die, who has brought about this great victory in Israel? Never! As the LORD lives, not a hair of his head shall fall to the ground, for he worked with God this day.” So the people rescued Jonathan, and he was not put to death.",
      "links": "<a href='/AIV/40/10/30'>Matt 10:30</a>",
      "comment": "The people's intervention is reminiscent of divine protection upon the innocent. The phrase 'not a hair of his head' is echoed by Christ in the New Testament, showing God’s care for the righteous."
    },
    {
      "pk": 90140046,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 46,
      "text": "Then Saul left off pursuing the Philistines, and the Philistines went to their own place.",
      "links": "",
      "comment": "The narrative closes the immediate conflict, setting up the ongoing tension and struggle between Israel and the Philistines."
    },
    {
      "pk": 90140047,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 47,
      "text": "After taking the kingship over Israel, Saul fought against all his surrounding enemies—against Moab, Ammon, Edom, the kings of Zobah, and the Philistines. Wherever he turned, he defeated them.",
      "links": "<a href='/AIV/9/11/1'>1Sam 11:1</a>; <a href='/AIV/10/8/3'>2Sam 8:3</a>",
      "comment": "This summary underscores Saul’s military accomplishments, despite his spiritual deficiencies. God’s plan works through both strengths and weaknesses in His chosen leaders."
    },
    {
      "pk": 90140048,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 48,
      "text": "He acted valiantly and struck the Amalekites, delivering Israel from those who plundered them.",
      "links": "<a href='/AIV/9/15/1-3'>1Sam 15:1-3</a>",
      "comment": "Saul’s leadership delivers Israel from oppression, though as later shown, incomplete obedience brings trouble. Obedience in totality is key."
    },
    {
      "pk": 90140049,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 49,
      "text": "The sons of Saul were Jonathan, Ishvi, and Malchishua. He had two daughters: the name of the firstborn was Merab, and the name of the younger, Michal.",
      "links": "<a href='/AIV/9/18/17-27'>1Sam 18:17-27</a>",
      "comment": "These family details become significant in Saul’s later history, particularly Michal’s role in David’s life."
    },
    {
      "pk": 90140050,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 50,
      "text": "The name of Saul’s wife was Ahinoam, the daughter of Ahimaaz. The name of the commander of his army was Abner son of Ner, Saul’s uncle.",
      "links": "<a href='/AIV/10/2/8'>2Sam 2:8</a>",
      "comment": "Mention of Abner introduces another significant leader whose loyalty and involvement shape later events in Israel."
    },
    {
      "pk": 90140051,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 51,
      "text": "Kish was Saul’s father, and Ner, Abner’s father, was the son of Abiel.",
      "links": "<a href='/AIV/9/9/1'>1Sam 9:1</a>",
      "comment": "Genealogical details in Scripture remind us of the importance of lineage and continuity in divine history, further reflected in the genealogies of Jesus."
    },
    {
      "pk": 90140052,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 14,
      "verse": 52,
      "text": "There was hard fighting against the Philistines all the days of Saul. Whenever Saul saw any strong or valiant man, he took him into his service.",
      "links": "<a href='/AIV/9/8/11'>1Sam 8:11</a>; <a href='/AIV/10/23/8-39'>2Sam 23:8-39</a>",
      "comment": "Saul’s practical policy fulfills the earlier warning about the monarchy. God still uses flawed human systems to accomplish His will—pointing forward to a perfected kingdom accomplished by Christ as priest, king, and prophet."
    }
  ],
  "translatedAt": "2025-12-24T02:56:56.915Z"
}