{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 7,
  "verses": [
    {
      "pk": 9007001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 1,
      "text": "The men of Kiriath-jearim came and took up the Ark of the LORD. They brought it to the house of Abinadab on the hill, and they consecrated his son Eleazar to guard the Ark of the LORD.",
      "links": "<a href='/AIV/9/6/21'>1Sam 6:21</a>; <a href='/AIV/13/13/6-7'>1Chr 13:6–7</a>",
      "comment": "Abinadab's son is specially set apart to care for the Ark, emphasizing the importance of consecration in worship. This priestly role foreshadows the New Testament idea of specific service to God (Luke 1:8-9)."
    },
    {
      "pk": 9007002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 2,
      "text": "The Ark remained at Kiriath-jearim for a long time, twenty years in all. All the house of Israel mourned after the LORD.",
      "links": "<a href='/AIV/10/6/3'>2Sam 6:3</a>",
      "comment": "Israel's mourning signifies longing for restored relationship with God. The Ark's long stay points to a period of preparation before renewal, prefiguring how sometimes God readies hearts before restoration (cf. Matt 3:1-3)."
    },
    {
      "pk": 9007003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 3,
      "text": "Then Samuel spoke to all the house of Israel, saying, 'If you are returning to the LORD with all your heart, put away the foreign gods and the Ashtaroth from among you. Direct your hearts to the LORD and serve him only, and he will deliver you from the hand of the Philistines.'",
      "links": "<a href='/AIV/5/6/5'>Deut 6:5</a>; <a href='/AIV/7/2/12-13'>Judges 2:12-13</a>; <a href='/AIV/40/4/10'>Matt 4:10</a>",
      "comment": "True conversion requires exclusive devotion and the rejection of idols. The call to serve God 'only' echoes the Shema of Deuteronomy 6:5 and prefigures Jesus’ command to worship God alone. Spiritual renewal always begins with the heart’s full surrender."
    },
    {
      "pk": 9007004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 4,
      "text": "So the Israelites removed the Baals and the Ashtaroth, and they served the LORD only.",
      "links": "<a href='/AIV/7/10/16'>Judges 10:16</a>; <a href='/AIV/2/20/3'>Exod 20:3</a>",
      "comment": "Israel’s renunciation of idols is an act of public repentance, a necessary response before God’s deliverance. This points to the importance of concrete actions, not just inner faith, in spiritual renewal (cf. Acts 19:18-19)."
    },
    {
      "pk": 9007005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 5,
      "text": "And Samuel said, 'Gather all Israel at Mizpah, and I will pray to the LORD for you.'",
      "links": "<a href='/AIV/9/10/17'>1Sam 10:17</a>; <a href='/AIV/18/42/8'>Job 42:8</a>",
      "comment": "Samuel acts as an intercessor, praying for the people. This mediation foreshadows the priestly ministry seen in the New Covenant (see 1 Tim 2:5). The gathering highlights the unity of God's people for communal worship and repentance."
    },
    {
      "pk": 9007006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 6,
      "text": "They gathered at Mizpah and drew water and poured it out before the LORD, and they fasted that day and said, 'We have sinned against the LORD.' And Samuel judged the people of Israel at Mizpah.",
      "links": "<a href='/AIV/15/9/5-7'>Ezra 9:5-7</a>; <a href='/AIV/19/32/5'>Ps 32:5</a>",
      "comment": "Pouring out water and fasting are physical signs of repentance. Confession of sin is key to forgiveness and restoration (cf. 1 John 1:9). Samuel's judging role combines spiritual and civic leadership, reflecting a unified authority over Israel."
    },
    {
      "pk": 9007007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 7,
      "text": "Now when the Philistines heard that the Israelites had gathered at Mizpah, the rulers of the Philistines went up against Israel. When the Israelites heard of it, they were afraid of the Philistines.",
      "links": "<a href='/AIV/7/10/17'>Judges 10:17</a>",
      "comment": "Israel’s vulnerability in worship is met by foreign threat—often, spiritual renewal is tested by opposition. Fear here foreshadows the need to trust God’s deliverance amidst trial, anticipating greater spiritual battles (Eph 6:12)."
    },
    {
      "pk": 9007008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 8,
      "text": "And the people of Israel said to Samuel, 'Do not stop crying out to the LORD our God for us, that he may save us from the hand of the Philistines.'",
      "links": "<a href='/AIV/9/12/19'>1Sam 12:19</a>",
      "comment": "The people recognize Samuel’s role as an intercessor and mediator, demonstrating the importance of a divinely-appointed leader who prays on behalf of God’s people. This anticipates Christ’s role as the ultimate intercessor (Heb 7:25)."
    },
    {
      "pk": 9007009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 9,
      "text": "So Samuel took a nursing lamb and offered it as a whole burnt offering to the LORD. He cried out to the LORD for Israel, and the LORD answered him.",
      "links": "<a href='/AIV/8/22/9'>Ruth 2:14</a>; <a href='/AIV/2/29/38-39'>Exod 29:38-39</a>",
      "comment": "Samuel offers a lamb as a burnt offering, pointing to the need for atoning sacrifice—ultimately fulfilled in Jesus, the Lamb of God (John 1:29). Intercessory prayer linked with sacrifice is a pattern that persists into Christian worship."
    },
    {
      "pk": 9007010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 10,
      "text": "As Samuel was offering up the burnt offering, the Philistines came near to attack Israel. But the LORD thundered with a mighty sound against the Philistines that day and threw them into confusion, and they were struck down before Israel.",
      "links": "<a href='/AIV/7/5/20'>Judges 5:20</a>; <a href='/AIV/19/18/13-14'>Ps 18:13-14</a>",
      "comment": "God displays his power in direct intervention, reaffirming his sovereignty. Thunder and confusion as divine weapons show God fights for his people, paralleling the redemptive events like the Exodus (Exod 14:24). God’s response is tied to priestly intercessory action."
    },
    {
      "pk": 9007011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 11,
      "text": "The men of Israel went out from Mizpah and pursued the Philistines, and struck them down as far as below Beth-car.",
      "links": "<a href='/AIV/9/14/31'>1Sam 14:31</a>",
      "comment": "Israel's victory flows from God's intervention, not military might. Human cooperation with divine action is a biblical theme, prefiguring later cooperation between grace and response in salvation."
    },
    {
      "pk": 9007012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 12,
      "text": "Then Samuel took a stone and set it up between Mizpah and Shen, and named it Ebenezer, saying, 'Thus far the LORD has helped us.'",
      "links": "<a href='/AIV/9/4/1'>1Sam 4:1</a>",
      "comment": "The memorial ‘Ebenezer’ is a reminder of God’s saving help, similar to earlier memorial stones (Josh 4:7). Physical commemorations of God’s acts serve as faith-building signs, a practice reflected in later worship and tradition."
    },
    {
      "pk": 9007013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 13,
      "text": "So the Philistines were subdued and did not enter the territory of Israel again. The hand of the LORD was against the Philistines all the days of Samuel.",
      "links": "<a href='/AIV/7/13/1'>Judges 13:1</a>",
      "comment": "God’s favor brings sustained protection. The phrase ‘all the days of Samuel’ highlights the blessing that follows faithful leadership and obedience."
    },
    {
      "pk": 9007014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 14,
      "text": "The towns the Philistines had taken from Israel were restored to Israel, from Ekron to Gath, and Israel rescued their territory from the hand of the Philistines. There was also peace between Israel and the Amorites.",
      "links": "<a href='/AIV/7/1/1-4'>Judges 1:1-4</a>",
      "comment": "Restoration and peace are the fruit of God’s intervention. Restoration of land foreshadows spiritual inheritance. Peace with neighbors reflects the reconciling work that God desires among His people."
    },
    {
      "pk": 9007015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 15,
      "text": "Samuel judged Israel all the days of his life.",
      "links": "<a href='/AIV/7/2/16'>Judges 2:16</a>",
      "comment": "Samuel's lifelong leadership mirrors the stability and continuity valued in the people of God. His role as judge, prophet, and priest makes him a type of the coming perfect leader."
    },
    {
      "pk": 9007016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 16,
      "text": "He went on a circuit year by year to Bethel, Gilgal, and Mizpah and judged Israel in all those places.",
      "links": "<a href='/AIV/7/4/3'>Judges 4:3</a>",
      "comment": "Samuel’s circuit demonstrates pastoral care and the importance of accessible spiritual leadership. Traveling to judge all Israel models a unified, shepherding ministry."
    },
    {
      "pk": 9007017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 7,
      "verse": 17,
      "text": "But he would return to Ramah, for his home was there, and he judged Israel there, and he built an altar to the LORD.",
      "links": "<a href='/AIV/9/1/19'>1Sam 1:19</a>; <a href='/AIV/8/21/4'>Ruth 1:19</a>",
      "comment": "Building an altar in his hometown shows Samuel’s personal devotion and the centrality of worship in daily life. Establishing a center for worship highlights the importance of sacred space and ongoing sacrifice, which is foundational to covenant worship and is later fulfilled in a more perfect and lasting way (see John 4:21-24)."
    }
  ],
  "translatedAt": "2025-12-24T02:52:14.629Z"
}