{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 31,
  "verses": [
    {
      "pk": 9031001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 1,
      "text": "The Philistines fought against Israel, and the men of Israel fled from before the Philistines and fell slain on Mount Gilboa.",
      "links": "<a href='/AIV/13/10/1'>1 Chr. 10:1</a>; <a href='/AIV/9/28/4'>1 Sam. 28:4</a>",
      "comment": "This verse begins the account of Israel's defeat at Mount Gilboa, leading to the death of Saul. This sets the stage for the transition to David's kingship. Note the spiritual consequences of Israel's disobedience and the importance of faithful leaders (see <a href='/AIV/9/15/23'>1 Sam. 15:23</a>)."
    },
    {
      "pk": 9031002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 2,
      "text": "The Philistines pursued Saul and his sons, and they killed Jonathan, Abinadab, and Malchishua, Saul's sons.",
      "links": "<a href='/AIV/13/10/2'>1 Chr. 10:2</a>; <a href='/AIV/9/14/49'>1 Sam. 14:49</a>",
      "comment": "The death of Saul’s sons, including Jonathan (David’s beloved friend), highlights the tragedy of Saul’s downfall. There are parallels here with dynastic succession and covenantal friendship, anticipating the kingdom to come (<a href='/AIV/10/1/26'>2 Sam. 1:26</a>)."
    },
    {
      "pk": 9031003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 3,
      "text": "The battle grew fierce against Saul. The archers overtook him, and he was badly wounded by the archers.",
      "links": "<a href='/AIV/13/10/3'>1 Chr. 10:3</a>",
      "comment": "Saul’s mortal wounding by archers emphasizes the vulnerability of even a king without the Lord’s favor. This is also a literary foreshadowing of leadership that fails in faith and obedience (<a href='/AIV/9/13/13'>1 Sam. 13:13</a>)."
    },
    {
      "pk": 9031004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 4,
      "text": "Then Saul said to his armor-bearer, 'Draw your sword and run me through with it, so that these uncircumcised may not come and abuse me.' But his armor-bearer was afraid and refused, so Saul took his own sword and fell on it.",
      "links": "<a href='/AIV/13/10/4'>1 Chr. 10:4</a>; <a href='/AIV/7/9/54'>Judg. 9:54</a>",
      "comment": "Saul's request and suicide show both the fear of dishonor and the absence of hope outside God’s providence. The theme of dying with dignity was important in ancient times and points to Christian ideas about suffering and redemptive death (see <a href='/AIV/19/22/1'>Ps. 22:1</a> for Christological parallels in suffering)."
    },
    {
      "pk": 9031005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 5,
      "text": "When his armor-bearer saw that Saul was dead, he also fell on his sword and died with him.",
      "links": "<a href='/AIV/13/10/5'>1 Chr. 10:5</a>",
      "comment": "The armor-bearer’s loyalty and tragic end reinforce the consequences of broken authority. Spiritual interpretation sees this as cautioning against misplaced trust in earthly leaders in contrast to ultimate fidelity owed to God alone (<a href='/AIV/19/118/8'>Ps. 118:8</a>)."
    },
    {
      "pk": 9031006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 6,
      "text": "So Saul died, and his three sons, and all his men died together on that same day.",
      "links": "<a href='/AIV/13/10/6'>1 Chr. 10:6</a>",
      "comment": "This all-encompassing defeat marks the end of Saul’s dynasty. Theologically, it prepares the way for the righteous king, prefiguring the need for the true anointed one, which is later fulfilled in Christ, the Davidic descendant (<a href='/AIV/19/132/11'>Ps. 132:11</a>)."
    },
    {
      "pk": 9031007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 7,
      "text": "Now when the men of Israel who were on the other side of the valley and those beyond the Jordan saw that Israel had fled and that Saul and his sons were dead, they abandoned their cities and fled; and the Philistines came and lived in them.",
      "links": "<a href='/AIV/9/28/4'>1 Sam. 28:4</a>; <a href='/AIV/13/10/7'>1 Chr. 10:7</a>",
      "comment": "Israel's abandonment of their land further shows the effects of failed spiritual and civil leadership. This theme recurs in salvation history, where the loss and restoration of the people tie directly to fidelity to God and legitimate authority (<a href='/AIV/19/80/13'>Ps. 80:13</a>)."
    },
    {
      "pk": 9031008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 8,
      "text": "The next day, when the Philistines came to strip the dead, they found Saul and his sons fallen on Mount Gilboa.",
      "links": "<a href='/AIV/9/28/4'>1 Sam. 28:4</a>",
      "comment": "The desecration of Saul's body symbolizes the humiliation of Israel. This relates to biblical teachings about respectful treatment of the dead—foreshadowing later doctrines of bodily resurrection and dignity (<a href='/AIV/26/37/1-14'>Ezek. 37:1–14</a>)."
    },
    {
      "pk": 9031009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 9,
      "text": "They cut off his head and stripped off his armor, and sent word throughout the land of the Philistines to proclaim the news in the temple of their idols and among their people.",
      "links": "<a href='/AIV/9/17/51'>1 Sam. 17:51</a>; <a href='/AIV/13/10/9'>1 Chr. 10:9</a>",
      "comment": "Saul’s decapitation and humiliation in idolatrous temples heighten the contrast between the worship of the living God and paganism. This anticipates the deeper separation between false religion and true worship, a central theme for the one true church and sacramental practices (<a href='/AIV/9/5/2-5'>1 Sam. 5:2–5</a>)."
    },
    {
      "pk": 9031010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 10,
      "text": "They put his armor in the temple of Ashtaroth, and fastened his body to the wall of Beth-shan.",
      "links": "<a href='/AIV/9/21/9'>1 Sam. 21:9</a>; <a href='/AIV/9/9/15'>1 Sam. 9:15</a>",
      "comment": "The display of Saul’s body reflects the theological conflict between true worship and idolatry. Thematically, the loss of Saul, Israel’s fleshly king, points to the need for a spiritual, anointed king who would sanctify the people and restore dignity (<a href='/AIV/19/2/7'>Ps. 2:7</a>)."
    },
    {
      "pk": 9031011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 11,
      "text": "When the people of Jabesh-gilead heard what the Philistines had done to Saul,",
      "links": "<a href='/AIV/9/11/1'>1 Sam. 11:1</a>",
      "comment": "Jabesh-gilead’s loyalty to Saul recalls Saul’s earlier deliverance of their city, demonstrating the enduring gratitude and the power of sacred memory—a model for veneration and remembrance among the faithful (<a href='/AIV/19/112/6'>Ps. 112:6</a>)."
    },
    {
      "pk": 9031012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 12,
      "text": "all their brave men arose and traveled all night. They took the body of Saul and the bodies of his sons from the wall of Beth-shan, and they went to Jabesh and burned them there.",
      "links": "<a href='/AIV/13/10/12'>1 Chr. 10:12</a>",
      "comment": "This act of courage and charity by Jabesh-gilead offers a glimpse of true fellowship and love in action. Burning the bodies was unusual, showing sense of urgency and respect. Spiritual implication: the faithful honor the dead and look toward hope beyond death (<a href='/AIV/19/16/10'>Ps. 16:10</a>)."
    },
    {
      "pk": 9031013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 31,
      "verse": 13,
      "text": "They took their bones and buried them under the tamarisk tree at Jabesh, and fasted seven days.",
      "links": "<a href='/AIV/9/22/6'>1 Sam. 22:6</a>; <a href='/AIV/15/9/3-4'>Ezra 9:3-4</a>",
      "comment": "The burial and seven-day fast close the chapter with ritual and mourning. The use of tree and fasting underscores the prefigurement of penitential practices, communal intercession for the dead, and the importance of sacred tradition (<a href='/AIV/19/35/13'>Ps. 35:13</a>), themes central to the fullness of the faith."
    }
  ],
  "translatedAt": "2025-12-24T03:08:27.965Z"
}