{
  "book": 9,
  "bookName": "1 Samuel",
  "bookAbbreviation": "1Sam",
  "chapter": 26,
  "verses": [
    {
      "pk": 9026001,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 1,
      "text": "Then the Ziphites came to Saul at Gibeah, saying, 'Is not David hiding on the hill of Hachilah, which is opposite Jeshimon?'",
      "links": "<a href='/AIV/9/23/19'>1 Sam. 23:19</a>; <a href='/AIV/9/23/14'>1 Sam. 23:14</a>",
      "comment": "The Ziphites again betray David’s location to Saul (see 1 Sam. 23:19). This points to the ongoing theme of betrayal and fidelity, foreshadowing Judas’s betrayal of Christ (<a href='/AIV/40/26/14-16'>Matt. 26:14-16</a>)."
    },
    {
      "pk": 9026002,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 2,
      "text": "So Saul rose and went down to the wilderness of Ziph, taking three thousand chosen men of Israel with him to seek David in the wilderness of Ziph.",
      "links": "<a href='/AIV/9/24/2'>1 Sam. 24:2</a>; <a href='/AIV/9/23/23'>1 Sam. 23:23</a>",
      "comment": "Saul’s pursuit demonstrates the lengths authorities will go to suppress a perceived threat, paralleling the actions of religious leaders against Jesus (<a href='/AIV/40/27/1-2'>Matt. 27:1-2</a>). The use of three thousand chosen men echoes previous attempts to confront David."
    },
    {
      "pk": 9026003,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 3,
      "text": "Saul camped beside the road on the hill of Hachilah, which faces Jeshimon. But David stayed in the wilderness. When he saw that Saul had come after him into the wilderness,",
      "links": "<a href='/AIV/9/23/14-24'>1 Sam. 23:14-24</a>",
      "comment": "David’s caution and strategic withdrawal parallel Christ’s wisdom in avoiding danger until his appointed time had come (<a href='/AIV/43/7/1'>John 7:1</a>)."
    },
    {
      "pk": 9026004,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 4,
      "text": "David sent out spies and learned that Saul had definitely come.",
      "links": "<a href='/AIV/9/23/23-24'>1 Sam. 23:23-24</a>",
      "comment": "David’s prudence is notable; even the anointed must use wisdom. This recalls the call to discernment in the Christian life (<a href='/AIV/40/10/16'>Matt. 10:16</a>)."
    },
    {
      "pk": 9026005,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 5,
      "text": "Then David arose and came to the place where Saul had camped. He saw the place where Saul lay, and Abner son of Ner, the commander of his army. Saul was lying inside the camp, and the army was camped around him.",
      "links": "<a href='/AIV/10/2/8'>2 Sam. 2:8</a>; <a href='/AIV/9/17/55'>1 Sam. 17:55</a>",
      "comment": "This sets the stage for David’s demonstration of mercy. The inner circle guarding Saul echoes future apostolic succession and authority in the kingdom."
    },
    {
      "pk": 9026006,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 6,
      "text": "David said to Ahimelech the Hittite and to Abishai the son of Zeruiah, Joab’s brother, 'Who will go down with me to Saul in the camp?' And Abishai said, 'I will go down with you.'",
      "links": "<a href='/AIV/10/2/18'>2 Sam. 2:18</a>; <a href='/AIV/13/11/20'>1 Chr. 11:20</a>",
      "comment": "Abishai’s willingness recalls the commitment Christ calls forth in his disciples (<a href='/AIV/40/16/24'>Matt. 16:24</a>). The mention of Ahimelech the Hittite shows inclusion of non-Israelites within God’s larger plan."
    },
    {
      "pk": 9026007,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 7,
      "text": "So David and Abishai came to the army by night. There Saul lay sleeping within the camp, with his spear stuck in the ground at his head, and Abner and the army lay around him.",
      "links": "<a href='/AIV/9/17/7'>1 Sam. 17:7</a>; <a href='/AIV/9/26/12'>1 Sam. 26:12</a>",
      "comment": "The spear symbolizes Saul’s authority and later becomes an instrument of attempted violence. David’s approach in humility foreshadows Christ’s meek entry into hostile territory (<a href='/AIV/43/18/4-8'>John 18:4-8</a>)."
    },
    {
      "pk": 9026008,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 8,
      "text": "Then Abishai said to David, 'Today God has delivered your enemy into your hand. Now let me pin him to the ground with one thrust of the spear; I will not strike him twice.'",
      "links": "<a href='/AIV/9/24/4'>1 Sam. 24:4</a>; <a href='/AIV/10/16/9'>2 Sam. 16:9</a>",
      "comment": "Abishai’s zeal represents human thinking, seeking justice and revenge quickly, in contrast to divine patience and mercy. The motif of refraining from violence echoes Jesus’s example (<a href='/AIV/40/26/52-54'>Matt. 26:52-54</a>)."
    },
    {
      "pk": 9026009,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 9,
      "text": "But David said to Abishai, 'Do not destroy him! For who can lay a hand on the LORD’s anointed and be guiltless?'",
      "links": "<a href='/AIV/9/24/6'>1 Sam. 24:6</a>; <a href='/AIV/9/24/10'>1 Sam. 24:10</a>",
      "comment": "David respects the office and anointing, regardless of Saul’s failings. This prefigures respect for divinely-instituted authority within the Church (<a href='/AIV/45/13/1-2'>Rom. 13:1-2</a>), even when individuals are flawed."
    },
    {
      "pk": 9026010,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 10,
      "text": "David continued, 'As the LORD lives, the LORD himself will strike him down, or his day will come to die, or he will go into battle and perish.'",
      "links": "<a href='/AIV/9/25/38'>1 Sam. 25:38</a>; <a href='/AIV/9/31/6'>1 Sam. 31:6</a>",
      "comment": "David entrusts judgment to God alone, a theme picked up by Paul (<a href='/AIV/45/12/19'>Rom. 12:19</a>). Genuine justice comes from the Lord in His timing."
    },
    {
      "pk": 9026011,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 11,
      "text": "But the LORD forbid that I should lay a hand on the LORD’s anointed. Now, take the spear that is at his head and the jar of water, and let us go.'",
      "links": "<a href='/AIV/9/24/6'>1 Sam. 24:6</a>; <a href='/AIV/9/24/10'>1 Sam. 24:10</a>",
      "comment": "David’s refusal to murder Saul highlights respect for sacred offices and objects. The taking of the spear and water jug creates proof of David’s righteousness, paralleling sacraments as visible signs of inward grace."
    },
    {
      "pk": 9026012,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 12,
      "text": "So David took the spear and the water jar from near Saul’s head, and they went away. No one saw or knew, nor did anyone wake up, for they were all sleeping because a deep sleep from the LORD had fallen upon them.",
      "links": "<a href='/AIV/1/2/21'>Gen. 2:21</a>; <a href='/AIV/1/15/12'>Gen. 15:12</a>",
      "comment": "The sleep from the Lord recalls God’s sovereignty in pivotal moments (<a href='/AIV/1/15/12'>Gen. 15:12</a>), highlighting divine protection over God’s chosen."
    },
    {
      "pk": 9026013,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 13,
      "text": "Then David crossed over to the other side and stood on top of the hill, far away, with a great distance between them.",
      "links": "<a href='/AIV/9/24/8'>1 Sam. 24:8</a>",
      "comment": "David’s distance maintains his safety but allows him to speak truth. Distance as a theme echoes the separation between sin and grace, and necessity of mediation."
    },
    {
      "pk": 9026014,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 14,
      "text": "David called out to the army and to Abner son of Ner, 'Will you not answer, Abner?' Then Abner answered, 'Who are you who calls to the king?'",
      "links": "<a href='/AIV/9/17/55'>1 Sam. 17:55</a>; <a href='/AIV/9/26/5'>1 Sam. 26:5</a>",
      "comment": "David appeals to the leader, not directly to Saul, showing respect for hierarchy. This passage can foreshadow intercessory roles later attached to spiritual leadership."
    },
    {
      "pk": 9026015,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 15,
      "text": "David said to Abner, 'Are you not a man? Who is like you in Israel? Why then have you not kept watch over your lord the king? For one of the people came in to destroy your lord, the king.'",
      "links": "<a href='/AIV/10/2/8'>2 Sam. 2:8</a>; <a href='/AIV/10/3/6-11'>2 Sam. 3:6-11</a>",
      "comment": "David’s rebuke reinforces accountability and the seriousness of spiritual vigilance, as Jesus later teaches (<a href='/AIV/41/13/33-37'>Mark 13:33-37</a>)."
    },
    {
      "pk": 9026016,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 16,
      "text": "This thing you have done is not good. As the LORD lives, you deserve to die because you have not guarded your lord, the LORD’s anointed. Now see where the king’s spear is and the jar of water that was at his head.'",
      "links": "<a href='/AIV/9/26/11-12'>1 Sam. 26:11-12</a>",
      "comment": "Neglect of duty leads to just penalty. Loyalty to the Lord’s anointed and protecting the sacred are foundational for the spiritual life."
    },
    {
      "pk": 9026017,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 17,
      "text": "Saul recognized David’s voice and said, 'Is that your voice, my son David?' David said, 'It is my voice, my lord, O king.'",
      "links": "<a href='/AIV/9/24/16'>1 Sam. 24:16</a>",
      "comment": "Saul’s recognition of David’s voice and David’s humility point toward eventual reconciliation and the willingness to forgive, foreshadowing Christ’s forgiveness."
    },
    {
      "pk": 9026018,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 18,
      "text": "And he said, 'Why does my lord pursue his servant? What have I done? What evil is in my hands?'",
      "links": "<a href='/AIV/9/24/9'>1 Sam. 24:9</a>",
      "comment": "David’s innocence and questioning echo Christ before his accusers (<a href='/AIV/43/18/23'>John 18:23</a>), highlighting the motif of the righteous sufferer."
    },
    {
      "pk": 9026019,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 19,
      "text": "'Now therefore, let my lord the king hear the words of his servant: If it is the LORD who has stirred you up against me, may he accept an offering; but if it is men, cursed are they before the LORD, for they have driven me out this day so that I cannot share in the LORD’s inheritance, saying, “Go, serve other gods.”'",
      "links": "<a href='/AIV/9/20/3'>1 Sam. 20:3</a>; <a href='/AIV/9/24/15'>1 Sam. 24:15</a>",
      "comment": "David hints at the value of offering sacrifices for reconciliation and the gravity of being cut off from the Lord’s inheritance (i.e., the assembly and worship), a theme fulfilled in the New Covenant worship."
    },
    {
      "pk": 9026020,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 20,
      "text": "Now, do not let my blood fall to the ground, far from the LORD's presence. For the king of Israel has come out to seek a flea, just as one hunts a partridge in the mountains.'",
      "links": "<a href='/AIV/9/24/14'>1 Sam. 24:14</a>",
      "comment": "David’s humility underscores the value God places on each person, anticipating Christ’s teaching (<a href='/AIV/40/10/29-31'>Matt. 10:29-31</a>)."
    },
    {
      "pk": 9026021,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 21,
      "text": "Then Saul said, 'I have sinned. Return, my son David, for I will do you no more harm, because my life was precious in your eyes this day. Behold, I have acted foolishly and have made a great mistake.'",
      "links": "<a href='/AIV/9/24/17-19'>1 Sam. 24:17-19</a>",
      "comment": "Saul confesses his sin openly, modeling repentance, though imperfect. Recognition of the value of mercy foreshadows the teaching of forgiveness in the Lord’s Prayer (<a href='/AIV/40/6/12'>Matt. 6:12</a>)."
    },
    {
      "pk": 9026022,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 22,
      "text": "David answered, 'Here is the king’s spear. Let one of the young men come over and take it.'",
      "links": "<a href='/AIV/9/26/12'>1 Sam. 26:12</a>",
      "comment": "The return of the spear is an act of reconciliation. David gives back the symbol of authority, emphasizing that all authority comes from God and not personal vengeance."
    },
    {
      "pk": 9026023,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 23,
      "text": "The LORD rewards each man for his righteousness and faithfulness. For the LORD delivered you into my hand today, but I would not lay a hand on the LORD’s anointed.",
      "links": "<a href='/AIV/19/18/20-24'>Ps. 18:20-24</a>; <a href='/AIV/9/24/6'>1 Sam. 24:6</a>",
      "comment": "David points to divine reward for virtue and faithfulness, a theme amplified by Christ’s teachings on reward (<a href='/AIV/40/25/21'>Matt. 25:21</a>)."
    },
    {
      "pk": 9026024,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 24,
      "text": "As your life was precious today in my eyes, so may my life be precious in the LORD’s eyes, and may he deliver me from all distress.'",
      "links": "<a href='/AIV/19/34/19'>Ps. 34:19</a>",
      "comment": "David looks to God for ultimate deliverance. This prayer finds fulfillment in Christ’s resurrection, where the Father delivers Him from death (<a href='/AIV/58/5/7'>Heb. 5:7</a>)."
    },
    {
      "pk": 9026025,
      "translation": "AIV",
      "book": 9,
      "bookName": "1 Samuel",
      "bookAbbreviation": "1Sam",
      "chapter": 26,
      "verse": 25,
      "text": "Then Saul said to David, 'Blessed be you, my son David! You will do many things and will succeed.' So David went his way, and Saul returned to his place.",
      "links": "<a href='/AIV/9/24/19-22'>1 Sam. 24:19-22</a>",
      "comment": "Saul blesses David, recognizing his future greatness. The separation of their paths marks a providential transition, anticipating the messianic line which David’s house will establish, ultimately fulfilled in Christ."
    }
  ],
  "translatedAt": "2025-12-24T03:06:10.864Z"
}