{
  "book": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 13,
  "verses": [
    {
      "pk": 2009001,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 1,
      "text": "Whoever touches pitch will be stained by it; and anyone who associates with the arrogant will become like them.",
      "links": "<a href='/AIV/20/6/27'>Prov. 6:27</a>; <a href='/AIV/19/1/1'>Ps. 1:1</a>",
      "comment": "The image of pitch (tar) is used to warn about the corrupting influence of bad company. This recalls Psalm 1:1, which blesses those who avoid the company of the wicked."
    },
    {
      "pk": 2009002,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 2,
      "text": "Do not lift a burden beyond your strength, and do not associate with someone stronger or richer than yourself. How can a clay pot stand next to an iron pot? The clay pot will always be broken.",
      "links": "<a href='/AIV/20/19/4'>Prov. 19:4</a>",
      "comment": "The proverb cautions about the dangers of unequal relationships, both for practical and moral reasons. See also Prov. 19:4 on the social risks of poverty."
    },
    {
      "pk": 2009003,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 3,
      "text": "If the rich person wrongs the poor, the poor cry out; but if the poor wrong the rich, the rich have the power to bring them down.",
      "links": "<a href='/AIV/20/22/7'>Prov. 22:7</a>",
      "comment": "Highlights the imbalanced justice between rich and poor. The spiritual interpretation points toward God's ultimate justice (see Prov. 22:7)."
    },
    {
      "pk": 2009004,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 4,
      "text": "If you are useful, the rich will make friends with you; but if you become poor, they will abandon you.",
      "links": "<a href='/AIV/20/19/7'>Prov. 19:7</a>",
      "comment": "Reflects on human relationships determined by advantage, echoing Proverbs 19:7. This is a call to seek virtue rather than admiration from the world."
    },
    {
      "pk": 2009005,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 5,
      "text": "If you own something, people will live with you; they will serve you for as long as you succeed.",
      "links": "<a href='/AIV/20/14/20'>Prov. 14:20</a>",
      "comment": "The pursuit of material gain often leads to superficial friendships. True riches come from a life of virtue and grace."
    },
    {
      "pk": 2009006,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 6,
      "text": "If you fall into hard times, they will hide from you. Verses like these uncover the fickleness of human affection.",
      "links": "<a href='/AIV/20/19/4'>Prov. 19:4</a>",
      "comment": "This echoes the theme found in Proverbs about the instability of relationships based on wealth. A call for hope in lasting, spiritual friendships."
    },
    {
      "pk": 2009007,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 7,
      "text": "Stay away from your enemies, and be careful with your friends.",
      "links": "<a href='/AIV/20/16/28'>Prov. 16:28</a>",
      "comment": "Cautious wisdom is advised even among friends. Christ calls us to love our enemies, but also to be wise as serpents (Matthew 10:16)."
    },
    {
      "pk": 2009008,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 8,
      "text": "A friend will sometimes turn into an enemy, and reveal your quarrels to shame you.",
      "links": "<a href='/AIV/20/16/28'>Prov. 16:28</a>; <a href='/AIV/19/41/9'>Ps. 41:9</a>",
      "comment": "Even Jesus was betrayed by a close friend (Ps. 41:9; John 13:18), showing this is not a uniquely human problem."
    },
    {
      "pk": 2009009,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 9,
      "text": "Let no one put you to shame by speaking against you, and when you meet with someone wealthy, remain silent.",
      "links": "<a href='/AIV/20/17/28'>Prov. 17:28</a>",
      "comment": "Humility before the powerful is wisdom. Such humility prepares the heart for grace (Luke 18:14)."
    },
    {
      "pk": 2009010,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 10,
      "text": "Do not exalt yourself, lest you be cast down, nor draw near only to be rejected.",
      "links": "<a href='/AIV/20/25/6-7'>Prov. 25:6-7</a>; <a href='/AIV/42/14/8-11'>Luke 14:8-11</a>",
      "comment": "Jesus teaches a similar principle in Luke 14:8-11. True honor is received, not seized."
    },
    {
      "pk": 2009011,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 11,
      "text": "Do not stand far off, lest you be forgotten.",
      "links": "",
      "comment": "Balance between humility and presence is advised here—neither pride nor neglect, but a healthy sense of self rooted in God’s call."
    },
    {
      "pk": 2009012,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 12,
      "text": "Do not think yourself equal to a superior, nor trust in excessive words. Many have been deceived by their own pride.",
      "links": "<a href='/AIV/20/16/18'>Prov. 16:18</a>",
      "comment": "Pride leads to a fall (Prov. 16:18). Spiritual wisdom lies in humility."
    },
    {
      "pk": 2009013,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 13,
      "text": "If a powerful person invites you, be reserved, for someone greater than you may be invited; then you will be humbled.",
      "links": "<a href='/AIV/42/14/8-11'>Luke 14:8-11</a>",
      "comment": "Again, this reflects Jesus’ teaching on choosing the lowest place (see Luke 14:10)."
    },
    {
      "pk": 2009014,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 14,
      "text": "Do not offend, so you are not pushed away; and do not stand far away, lest you be forgotten.",
      "links": "",
      "comment": "This verse echoes the earlier theme: finding the golden mean between presumption and timidity."
    },
    {
      "pk": 2009015,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 15,
      "text": "Do not force your way into conversation, and do not crowd others with your talk.",
      "links": "<a href='/AIV/20/17/27-28'>Prov. 17:27-28</a>",
      "comment": "A gentle tongue and discerning silence mark true wisdom (see also James 1:19)."
    },
    {
      "pk": 2009016,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 16,
      "text": "Do not be greedy for food at someone else's table, or take advantage of their generosity.",
      "links": "<a href='/AIV/20/23/1-3'>Prov. 23:1-3</a>",
      "comment": "The warnings about covetousness point to the virtue of temperance (self-restraint). In Christian tradition, such balance is a fruit of the Spirit (Gal. 5:22-23)."
    },
    {
      "pk": 2009017,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 17,
      "text": "A wise and disciplined man will be careful in all things, but the foolish and brash will offend with their boldness.",
      "links": "<a href='/AIV/20/14/16'>Prov. 14:16</a>",
      "comment": "Wisdom is always paired with prudence, a quality highly valued in both Old and New Testaments."
    },
    {
      "pk": 2009018,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 18,
      "text": "If a rich person calls you, he may use you; he will smile at you and test you with his words.",
      "links": "",
      "comment": "Such warnings uncover the deceptive nature of flattery. Throughout Scripture, true worth comes in God’s sight—not from the rich or influential."
    },
    {
      "pk": 2009019,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 19,
      "text": "Again and again, he will lavish you with food and drink, until he has exhausted you two or three times, and finally he will mock you.",
      "links": "",
      "comment": "This demonstrates the fleeting nature of worldly approval. Earthly honors are temporary; spiritual rewards are eternal (cf. Matt. 6:19-20)."
    },
    {
      "pk": 2009020,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 20,
      "text": "If you do not do as he says, he will abandon you, and the only thing you will hear from him is contempt.",
      "links": "",
      "comment": "Worldly relationships often come with conditions. Christ calls us to unconditional love and faithfulness."
    },
    {
      "pk": 2009021,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 21,
      "text": "Guard yourself against being deceived, and pay attention, lest you suffer disgrace.",
      "links": "",
      "comment": "This is a call to vigilance and discernment—qualities encouraged throughout wisdom literature and vital in the Christian life (1 Pet. 5:8)."
    },
    {
      "pk": 2009022,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 22,
      "text": "When you hear these things, awake from sleep, and in all your life, love the Lord and call upon Him for help.",
      "links": "<a href='/AIV/19/34/15'>Ps. 34:15</a>",
      "comment": "A keynote of the spiritual life: vigilance and prayer (cf. Luke 21:36). In Christ, such devotion is fulfilled perfectly."
    },
    {
      "pk": 2009023,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 23,
      "text": "A poor man is honored for his wisdom, but a rich man is honored for his wealth.",
      "links": "<a href='/AIV/20/22/2'>Prov. 22:2</a>; <a href='/AIV/20/17/16'>Prov. 17:16</a>",
      "comment": "Worldly values elevate achievements, not virtue. This anticipates the teaching of Jesus about the first being last and the last first (Matt. 19:30)."
    },
    {
      "pk": 2009024,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 24,
      "text": "If someone is great in poverty, how much more when he has wealth? But if someone is worthless in poverty, how much more disgraceful will he be in wealth?",
      "links": "",
      "comment": "Here is a subtle encouragement toward spiritual riches, seen as the foundation of any lasting honor, with a hint at the biblical tradition of 'poverty of spirit' (Matt. 5:3)."
    },
    {
      "pk": 2009025,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 25,
      "text": "A poor person may be admired for wisdom and despised for riches.",
      "links": "",
      "comment": "Earthly measures are fickle. The true treasure is found in wisdom, viewed as a gift received through faith and practice in the mystery of Christ."
    },
    {
      "pk": 2009026,
      "translation": "AIV",
      "book": 51,
      "chapter": 13,
      "verse": 26,
      "text": "When a rich man speaks, everyone keeps silent, and his word is praised to the clouds; but when a poor man speaks, people say, 'Who is this?' And if he stumbles, they push him down even further.",
      "links": "<a href='/AIV/20/18/23'>Prov. 18:23</a>",
      "comment": "A meditation on the injustice and partiality of men. The wisdom literature points beyond earthly life to a final judgment, where all will be seen in the light of God’s justice and mercy."
    }
  ],
  "translatedAt": "2025-12-23T09:56:04.059Z"
}