{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 22,
  "verses": [
    {
      "pk": 28022001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 1,
      "text": "A lazy person is compared to a filthy stone, everyone will hiss at his disgrace.",
      "links": "<a href='/AIV/20/6/9-11'>Prov. 6:9-11</a>; <a href='/AIV/23/56/10'>Isa. 56:10</a>",
      "comment": "Sirach opens with a sharp warning against sloth, using vivid imagery familiar to Proverbs. Laziness soils the soul and reputation, echoing the tradition that virtue demands personal effort."
    },
    {
      "pk": 28022002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 2,
      "text": "A lazy person is compared to a heap of dung: everyone who touches it shakes off their hands.",
      "links": "<a href='/AIV/18/17/16'>Job 17:16</a>",
      "comment": "Here, idleness is shown as unclean, a spiritual danger defiling those it contacts. Note the strong association between sloth and impurity, anticipating New Testament admonitions to diligence (cf. <a href='/AIV/45/12/11'>Rom. 12:11</a>)."
    },
    {
      "pk": 28022003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 3,
      "text": "A father's shame is to have an undisciplined child, and among daughters, any daughter who brings dishonor is his loss.",
      "links": "<a href='/AIV/20/17/25'>Prov. 17:25</a>; <a href='/AIV/20/10/1'>Prov. 10:1</a>",
      "comment": "Family discipline is central to biblical wisdom; the consequences of raising foolish children impact parents deeply. The focus on daughters highlights the traditional role of honor in community life."
    },
    {
      "pk": 28022004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 4,
      "text": "A prudent daughter will inherit her father, but one who brings shame causes him to lose his wealth.",
      "links": "<a href='/AIV/20/31/10'>Prov. 31:10</a>",
      "comment": "The inheritance of wisdom and virtue is a theme echoing throughout the Old Testament, pointing toward the transmission of spiritual and practical blessings within the family."
    },
    {
      "pk": 28022005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 5,
      "text": "A daughter who acts boldly brings shame and sorrow, and she will be despised by everyone.",
      "links": "<a href='/AIV/20/29/15'>Prov. 29:15</a>",
      "comment": "Boldness here refers to rebellious or shameless conduct, undermining family honor. The consequences of sin ripple outward, affecting the community, a concept foundational to Christian teaching on scandal."
    },
    {
      "pk": 28022006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 6,
      "text": "Do not instruct a fool, for he will not appreciate your wisdom; avoid speaking to an ignorant person.",
      "links": "<a href='/AIV/20/23/9'>Prov. 23:9</a>",
      "comment": "The futility of instructing the hardened heart is repeatedly taught. This foreshadows Jesus' advice about casting pearls before swine (<a href='/AIV/40/7/6'>Matt. 7:6</a>)."
    },
    {
      "pk": 28022007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 7,
      "text": "If you speak to a foolish person, it is like talking to someone who is drowsy; at the end he will say, 'What was it?'",
      "links": "<a href='/AIV/20/26/4'>Prov. 26:4</a>",
      "comment": "Folly is likened to spiritual sleep. The theme of wakefulness is echoed in Christ's admonition to 'keep watch' (<a href='/AIV/41/13/33'>Mark 13:33</a>)."
    },
    {
      "pk": 28022008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 8,
      "text": "Weep less for the dead, for they have found rest; but weep more bitterly for the fool—for his life is worse than death.",
      "links": "<a href='/AIV/20/4/18-19'>Prov. 4:18-19</a>; <a href='/AIV/42/16/19-31'>Luke 16:19-31</a>",
      "comment": "The spiritual death of folly surpasses physical death; the concern for the immortal soul is paramount, resonating with later teaching on salvation and damnation."
    },
    {
      "pk": 28022009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 9,
      "text": "Mourning for the dead lasts seven days, but mourning for a fool or ungodly person lasts all his life.",
      "links": "<a href='/AIV/01/50/10'>Gen. 50:10</a>",
      "comment": "The seven-day period recalls traditional Jewish mourning, while the permanent grief over spiritual death foreshadows eternal consequences highlighted in New Testament eschatology."
    },
    {
      "pk": 28022010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 10,
      "text": "Do not speak much with a foolish person, or you will become defiled; flee from him and you will find rest, and your spirit will not be wearied by his folly.",
      "links": "<a href='/AIV/19/1/1'>Ps. 1:1</a>; <a href='/AIV/20/13/20'>Prov. 13:20</a>",
      "comment": "Spiritual purity is maintained by wise association, underscoring both personal holiness and community sanctity, central to Christian life."
    },
    {
      "pk": 28022011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 11,
      "text": "A blow hurts the body and mockery wounds the heart, but the damage from a fool is worse than both.",
      "links": "<a href='/AIV/20/12/18'>Prov. 12:18</a>",
      "comment": "Emotional and spiritual wounds are presented as more damaging than physical ones, illuminating the depth of harm foolishness can inflict. This notion runs deeper in Christ's teaching about the heart (see <a href='/AIV/40/15/18-19'>Matt. 15:18-19</a>)."
    },
    {
      "pk": 28022012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 12,
      "text": "For mourning over death is like pouring water upon sand, but mourning over a fool or ungodly person is like pouring it into a pit.",
      "links": "<a href='/AIV/20/27/22'>Prov. 27:22</a>",
      "comment": "The futility of sorrow over folly and wickedness reminds us of the tragic persistence of sin without repentance, a theme deeply embedded in biblical warnings."
    },
    {
      "pk": 28022013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 13,
      "text": "Instruction to a fool is like gluing a broken bowl together, or like waking someone from deep sleep.",
      "links": "<a href='/AIV/20/23/9'>Prov. 23:9</a>",
      "comment": "The imagery of hopeless restoration calls to mind the necessity of divine grace for true transformation—foreshadowing the New Covenant work of the Spirit (<a href='/AIV/43/3/5-8'>John 3:5-8</a>)."
    },
    {
      "pk": 28022014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 14,
      "text": "If you explain something to a fool, he will ask, 'What is it?' but if one is shackled, his chains do not break.",
      "links": "<a href='/AIV/20/26/7-9'>Prov. 26:7-9</a>",
      "comment": "Stubborn foolishness is compared to bondage—only divine intervention can unshackle the soul, reflecting the necessity of sacramental grace over mere human effort."
    },
    {
      "pk": 28022015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 15,
      "text": "Teaching wisdom to a fool is like trying to heal a wound with a sharp instrument, or pouring water into a sieve.",
      "links": "<a href='/AIV/20/1/7'>Prov. 1:7</a>",
      "comment": "The texts illustrate the need for humility and openness to wisdom as prerequisites for spiritual growth—a principle echoed in Christ’s parables."
    },
    {
      "pk": 28022016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 16,
      "text": "A wise person, when he hears wisdom, will praise it and add to it; but a senseless person, when he hears it, dislikes it and casts it behind his back.",
      "links": "<a href='/AIV/20/9/8-9'>Prov. 9:8-9</a>; <a href='/AIV/43/6/66'>John 6:66</a>",
      "comment": "Acceptance of wisdom is linked to spiritual growth. Contrast with rejection recalls those who walked away from Jesus, setting up the call to perseverance in faith."
    },
    {
      "pk": 28022017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 17,
      "text": "Speaking to a fool is like speaking to someone asleep, at the end they will say, 'What is it?'",
      "links": "<a href='/AIV/20/18/2'>Prov. 18:2</a>",
      "comment": "Repeating the sleep motif, spiritual drowsiness is a major theme in Jesus’ teachings on being watchful and ready."
    },
    {
      "pk": 28022018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 18,
      "text": "Weep for the dead, because the light has departed; weep for a fool, for understanding has left him.",
      "links": "<a href='/AIV/20/10/21'>Prov. 10:21</a>; <a href='/AIV/40/13/13-15'>Matt. 13:13-15</a>",
      "comment": "Spiritual blindness is equated with the loss of life, a precursor to the deeper doctrine of spiritual rebirth through Christ."
    },
    {
      "pk": 28022019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 19,
      "text": "Keep your words far from the ignorant and foolish lest they despise your wisdom.",
      "links": "<a href='/AIV/20/9/7'>Prov. 9:7</a>",
      "comment": "Guarding speech is wisdom, echoing James’ admonition to tame the tongue (<a href='/AIV/59/3/6'>James 3:6</a>)."
    },
    {
      "pk": 28022020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 20,
      "text": "Do not give honor to a fool, lest your ancestors be ashamed.",
      "links": "<a href='/AIV/20/26/8'>Prov. 26:8</a>",
      "comment": "Honor is reserved for the wise and virtuous, tying personal conduct to communal heritage—a thread that runs through biblical calls for holiness."
    },
    {
      "pk": 28022021,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 21,
      "text": "Do not tell your troubles to someone senseless, since he cannot help you.",
      "links": "<a href='/AIV/20/27/3'>Prov. 27:3</a>",
      "comment": "Reliance belongs in wisdom and godly counsel, recalling the scriptural emphasis on seeking guidance from the spiritually mature (cf. <a href='/AIV/59/5/16'>James 5:16</a>)."
    },
    {
      "pk": 28022022,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 22,
      "text": "Do not consult with a coward about war, or with a merchant about trade, or with a buyer about selling, or with a malicious person about gratitude, or with the lazy about any work, or with a worker about the harvest; do not rely on these for advice.",
      "links": "<a href='/AIV/19/1/1'>Ps. 1:1</a>",
      "comment": "Practical wisdom aligns with spiritual discernment—seeking counsel from those equipped with virtue and right judgment, prefiguring the role of apostolic leadership."
    },
    {
      "pk": 28022023,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 23,
      "text": "But always be with a devout man, whom you know keeps the commandments, who is humble in spirit and wise in fear of the Lord.",
      "links": "<a href='/AIV/19/119/63'>Ps. 119:63</a>; <a href='/AIV/20/13/20'>Prov. 13:20</a>",
      "comment": "Devotion, obedience, humility, and holy fear form the character of true friendship. This connects to discipleship and participation in the community of saints."
    },
    {
      "pk": 28022024,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 24,
      "text": "With such a person, remain steadfast; if you fall, he will raise you up, and if you wander, he will guide you back.",
      "links": "<a href='/AIV/21/4/9-10'>Eccl. 4:9-10</a>",
      "comment": "Spiritual companionship is a means of perseverance and restoration, alluding to the church as a family where mutual support is lived out."
    },
    {
      "pk": 28022025,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 25,
      "text": "Give no power to the foolish, lest they harm you and bring you sorrow; stay away from them, and you will find peace.",
      "links": "<a href='/AIV/20/29/9'>Prov. 29:9</a>",
      "comment": "Once more, Sirach urges separation from folly in order to guard personal and communal well-being. This foreshadows the biblical doctrine of spiritual discernment in choosing leaders."
    },
    {
      "pk": 28022026,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 26,
      "text": "What is heavier than lead? What else can have another name than 'fool'?",
      "links": "<a href='/AIV/20/27/3'>Prov. 27:3</a>",
      "comment": "Foolishness is depicted as the ultimate burden. This connects metaphorically to sin’s weight, echoing the call to cast off all that hinders spiritual progress (<a href='/AIV/58/12/1'>Heb. 12:1</a>)."
    },
    {
      "pk": 28022027,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 22,
      "verse": 27,
      "text": "Sand, salt, and a chunk of iron are easier to bear than a foolish person.",
      "links": "<a href='/AIV/21/10/1'>Eccl. 10:1</a>",
      "comment": "The final verse underscores the immense suffering folly brings, emphasizing the importance of wisdom and spiritual formation for life in Christ and the fellowship of the holy."
    }
  ],
  "translatedAt": "2025-12-24T07:34:43.517Z"
}