{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 12,
  "verses": [
    {
      "pk": 28012001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 1,
      "text": "If you do good, understand to whom you are doing it, and you will be thanked for your kindness.",
      "links": "<a href='/AIV/20/3/27'>Prov. 3:27</a>; <a href='/AIV/47/9/7'>2 Cor. 9:7</a>",
      "comment": "This verse begins by calling for intentional generosity. Know who you help and seek meaningful charity. The biblical principle of discernment in doing good works is echoed in the New Testament (see 2 Corinthians 9:7). Note that true gratitude is given when charity is not naively given, but guided by wisdom and prudence."
    },
    {
      "pk": 28012002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 2,
      "text": "Do good to the righteous, and you will find a reward—if not from them, then from the Most High.",
      "links": "<a href='/AIV/19/41/1'>Ps. 41:1</a>; <a href='/AIV/40/10/42'>Matt. 10:42</a>",
      "comment": "Doing good to the righteous is both a human and divine obligation. God's providence ensures that righteous deeds are ultimately rewarded, even if people do not repay. This links to Christ's teaching that even a cup of cold water, given for His sake, has a heavenly reward (Matthew 10:42)."
    },
    {
      "pk": 28012003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 3,
      "text": "No good comes to one who always deals evil, nor to the one who refuses to give charity.",
      "links": "<a href='/AIV/19/112/10'>Ps. 112:10</a>; <a href='/AIV/59/2/13'>James 2:13</a>",
      "comment": "This verse warns that those acting with malice or who refuse mercy will not prosper in God's eyes. The principle of divine justice—mercy shown is mercy received—connects with New Testament teachings about judgment and mercy (see James 2:13)."
    },
    {
      "pk": 28012004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 4,
      "text": "Give to the godly, but do not help the sinner.",
      "links": "<a href='/AIV/19/1/1'>Ps. 1:1</a>; <a href='/AIV/58/13/16'>Heb. 13:16</a>",
      "comment": "Here, charity should be guided by prudence: our help should strengthen the just, not enable evil. Scriptural wisdom protects against aiding wrongdoing, while promoting generosity to those living righteously."
    },
    {
      "pk": 28012005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 5,
      "text": "Do good to the humble, but do not give to the ungodly; hold back your bread and do not give it to them, or else they may hold sway over you.",
      "links": "<a href='/AIV/20/25/21-22'>Prov. 25:21-22</a>; <a href='/AIV/19/37/21'>Ps. 37:21</a>",
      "comment": "Giving to the humble echoes Christ's call to serve the lowly (see Matthew 25:40). But enabling the arrogant or unrepentant is cautioned against, to prevent fostering evil or dependence. The balance shows early Christian wisdom in discerning whom to help."
    },
    {
      "pk": 28012006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 6,
      "text": "For you will receive twice as much evil for all the good you do for them, because the Most High hates sinners and will repay the wicked.",
      "links": "<a href='/AIV/19/34/21'>Ps. 34:21</a>; <a href='/AIV/45/6/23'>Rom. 6:23</a>",
      "comment": "A warning that aiding the unrepentant can result in harm. God’s justice is sure. This anchors the principle of just retaliation, later expanded by Christ’s call to love enemies—but with discernment and purity of motive, not blind enabling (see Matt. 5:44)."
    },
    {
      "pk": 28012007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 7,
      "text": "Give to the good, but do not help sinners.",
      "links": "<a href='/AIV/20/14/7'>Prov. 14:7</a>; <a href='/AIV/48/6/10'>Gal. 6:10</a>",
      "comment": "A further emphasis that charity ought to be judicious. Compare this with Paul’s instruction in Galatians 6:10 to ‘do good to all, especially to those who are of the household of faith.’"
    },
    {
      "pk": 28012008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 8,
      "text": "A friend cannot be known in prosperity, nor an enemy hidden in adversity.",
      "links": "<a href='/AIV/20/19/4'>Prov. 19:4</a>; <a href='/AIV/43/13/18'>John 13:18</a>",
      "comment": "Adversity tests the true nature of relationships. Christ’s experience with Judas (John 13:18) is a profound fulfillment—enemies reveal themselves when the faithful are under trial."
    },
    {
      "pk": 28012009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 9,
      "text": "When one prospers, even his enemies are friendly; but in adversity, even his friends turn against him.",
      "links": "<a href='/AIV/20/14/20'>Prov. 14:20</a>; <a href='/AIV/19/41/9'>Ps. 41:9</a>",
      "comment": "Reflects the fickleness of human loyalty, reminding us of loyalty's deeper spiritual meaning. See how David’s sufferings and Christ’s betrayal by friends are paralleled here."
    },
    {
      "pk": 28012010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 10,
      "text": "Never trust an enemy, for his wickedness is like corroding bronze.",
      "links": "<a href='/AIV/19/55/21'>Ps. 55:21</a>; <a href='/AIV/40/10/16'>Matt. 10:16</a>",
      "comment": "Scripture warns against naïveté: the malice of evil is persistent. Compare Christ’s wisdom: ‘be wise as serpents, innocent as doves’ (Matthew 10:16). This highlights prudence as a virtue."
    },
    {
      "pk": 28012011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 11,
      "text": "Even if he humbles himself and walks bowed down, stay on guard. Be to him as one who polishes a mirror, for you will find that rust has not been removed completely.",
      "links": "<a href='/AIV/20/26/24-25'>Prov. 26:24-25</a>",
      "comment": "An enemy’s apparent remorse may be an act. The metaphor of rust on a mirror points to original sin—a reality which can be forgiven by God but which requires ongoing conversion and vigilance."
    },
    {
      "pk": 28012012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 12,
      "text": "Do not set him by your side, or he may overthrow you and take your place. Do not let him sit at your right, or he may seek your seat, and in the end you will realize my words and be pierced with regret.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>; <a href='/AIV/19/109/8'>Ps. 109:8</a>",
      "comment": "A warning against placing enemies in positions of trust. Betrayal from within—seen in both David’s and Christ’s lives—is foreshadowed here."
    },
    {
      "pk": 28012013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 13,
      "text": "Who will pity a charmer bitten by a snake, or all those who go near wild beasts?",
      "links": "<a href='/AIV/20/23/32'>Prov. 23:32</a>; <a href='/AIV/19/58/4'>Ps. 58:4</a>",
      "comment": "Natural consequences follow reckless choices. The one who willingly associates with evil invites disaster, similar to Jesus' condemnation of those who persist in sin knowingly (see John 9:41)."
    },
    {
      "pk": 28012014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 14,
      "text": "So it is with one who goes near a sinner and becomes entangled in his sins.",
      "links": "<a href='/AIV/20/22/24-25'>Prov. 22:24-25</a>; <a href='/AIV/46/15/33'>1 Cor. 15:33</a>",
      "comment": "The danger of moral contamination is emphasized here; evil company corrupts good morals (see 1 Corinthians 15:33). The Church consistently calls for discernment to preserve holiness."
    },
    {
      "pk": 28012015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 15,
      "text": "He will remain with you for a while, but when you fall, he will not be there.",
      "links": "<a href='/AIV/20/17/17'>Prov. 17:17</a>; <a href='/AIV/19/41/9'>Ps. 41:9</a>",
      "comment": "False friends abandon you in adversity. Christ’s parable of the Good Samaritan (Luke 10:30-37) illuminates the virtue of faithful friendship. Spiritual companionship is a gift to be discerned and treasured."
    },
    {
      "pk": 28012016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 16,
      "text": "An enemy speaks sweetly with his lips, but in his heart he plans to throw you into a pit. An enemy weeps with his eyes, but if he finds an opportunity, he will never have enough of your blood.",
      "links": "<a href='/AIV/19/55/21'>Ps. 55:21</a>; <a href='/AIV/40/26/48-50'>Matt. 26:48-50</a>",
      "comment": "Hypocrisy and treachery are exposed here, with clear biblical incidents such as Judas’s betrayal of Jesus (Matthew 26:48-50) as a notable fulfillment."
    },
    {
      "pk": 28012017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 17,
      "text": "If evil comes upon you, you will find him there ahead of you, pretending to help but undermining you.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>; <a href='/AIV/19/55/12-14'>Ps. 55:12-14</a>",
      "comment": "Enemies may act as friends, but in times of trouble, their betrayal is revealed. Christian virtue calls for love and wisdom in relationships."
    },
    {
      "pk": 28012018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 12,
      "verse": 18,
      "text": "He will shake his head and clap his hands, and whisper much, but all he means is to bring you down.",
      "links": "<a href='/AIV/19/35/15-16'>Ps. 35:15-16</a>; <a href='/AIV/19/109/25'>Ps. 109:25</a>",
      "comment": "The enemy's mockery and derision are apparent here. Christ on the Cross encountered such scorn (Ps. 35:15-16). The verse reminds believers that only steadfast communion with God and a united fellowship can overcome the snares of evil."
    }
  ],
  "translatedAt": "2025-12-24T07:29:14.414Z"
}