{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 45,
  "verses": [
    {
      "pk": 28045001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 1,
      "text": "He brought out from him a man of mercy, who found favor in the sight of all flesh: beloved by God and men, Moses, whose memory is blessed.",
      "links": "<a href='/AIV/2/2/2'>Ex. 2:2</a>; <a href='/AIV/5/34/10'>Deut. 34:10</a>",
      "comment": "Moses is introduced as a model of divine election and human cooperation. His being 'blessed' echoes patterns of veneration and remembering those faithful to God—which holds implications for honoring the saints."
    },
    {
      "pk": 28045002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 2,
      "text": "God made him equal in glory to the holy ones and made him great in the sight of his enemies.",
      "links": "<a href='/AIV/2/11/10'>Ex. 11:10</a>; <a href='/AIV/2/34/29'>Ex. 34:29</a>",
      "comment": "Moses is described as set among the 'holy ones.' This title is often interpreted as angels or patriarchs (see <a href='/AIV/19/89/7'>Ps. 89:7</a>). Moses’ elevated status prefigures the honored role of God’s leaders."
    },
    {
      "pk": 28045003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 3,
      "text": "God made him mighty in the fear of his enemies, and by his words he caused signs and miracles to cease.",
      "links": "<a href='/AIV/2/7/1-3'>Ex. 7:1-3</a>; <a href='/AIV/5/34/11-12'>Deut. 34:11-12</a>",
      "comment": "Moses' words possess power to bring about signs, reflecting the importance of both faith and words as means for God to act."
    },
    {
      "pk": 28045004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 4,
      "text": "For His glory, God sanctified him, faithful and meek. He chose him out of all mankind.",
      "links": "<a href='/AIV/5/18/17'>Num. 12:3</a>; <a href='/AIV/4/12/7'>Num. 12:7</a>",
      "comment": "Moses' qualities of faithfulness and meekness are singled out by God, paralleling virtues later modeled by Christ (<a href='/AIV/40/11/29'>Matt. 11:29</a>)."
    },
    {
      "pk": 28045005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 5,
      "text": "He made him hear His voice and brought him into the dark cloud, and gave him commands before the face of the law and the covenant, to teach Jacob His statutes and Israel His judgments.",
      "links": "<a href='/AIV/2/24/18'>Ex. 24:18</a>; <a href='/AIV/5/5/1'>Deut. 5:1</a>",
      "comment": "God’s intimate self-revelation to Moses, with the setting of the dark cloud, is foundational for understanding the nature of sacred revelation and mediators of God's will."
    },
    {
      "pk": 28045006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 6,
      "text": "God exalted Aaron, a holy man like him, who was his brother, of the tribe of Levi.",
      "links": "<a href='/AIV/2/28/1'>Ex. 28:1</a>; <a href='/AIV/4/17/1-3'>Num. 17:1-3</a>",
      "comment": "Aaron is here shown as set apart and raised to holy service, the foundation of the high priesthood (see <a href='/AIV/58/5/4'>Heb. 5:4</a>)."
    },
    {
      "pk": 28045007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 7,
      "text": "He established with him an everlasting covenant, and gave him the priesthood of the people. He adorned him with splendid vestments and clothed him in glorious robes.",
      "links": "<a href='/AIV/2/28/2-5'>Ex. 28:2-5</a>; <a href='/AIV/4/25/13'>Num. 25:13</a>",
      "comment": "The description of Aaron’s priestly garments and covenant underlines the enduring institution and visible signs accompanying rites of worship (<a href='/AIV/58/7/21-22'>Heb. 7:21-22</a>)."
    },
    {
      "pk": 28045008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 8,
      "text": "He clothed him in perfect splendor and strengthened him with symbols of authority: linen undergarments, a long robe, and an ephod.",
      "links": "<a href='/AIV/2/28/6-8'>Ex. 28:6-8</a>",
      "comment": "The detailed mention of priestly robes emphasizes ritual order, continuity, and visual sanctity. These foreshadow the order and solemnity of Christian liturgical life."
    },
    {
      "pk": 28045009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 9,
      "text": "He placed on him a breastplate with oracular stones, set in gold, with engraved symbols as a sign of truth and authority.",
      "links": "<a href='/AIV/2/28/15-21'>Ex. 28:15-21</a>",
      "comment": "The Urim and Thummim symbolize discernment from God through His chosen leaders. This typifies how God's guidance is mediated by established offices."
    },
    {
      "pk": 28045010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 10,
      "text": "He set a scarlet robe upon him, and clothed him with glorious attire, with the work of embroiderers: the judgment of truth, bands of blue and purple, fine linen, twisted and woven into perfection.",
      "links": "<a href='/AIV/2/28/31'>Ex. 28:31</a>; <a href='/AIV/2/39/1-2'>Ex. 39:1-2</a>",
      "comment": "The colors and beauty of the priestly vestments reflect both dignity and sanctity. This anticipates the beautiful symbolism adopted in later Christian worship."
    },
    {
      "pk": 28045011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 11,
      "text": "Precious stones, engraved as signets in gold settings—the work of a jeweler—were a memorial to the tribes of Israel, as the Lord commanded.",
      "links": "<a href='/AIV/2/28/21'>Ex. 28:21</a>",
      "comment": "Each stone signifying one tribe represents the unity and diversity God desires in His people, reflected in the one family of believers."
    },
    {
      "pk": 28045012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 12,
      "text": "He set a crown of gold on his mitre, inscribed with holiness, a badge of honor—a glorious work, rich and splendid—, delightful to the eyes.",
      "links": "<a href='/AIV/2/28/36-38'>Ex. 28:36-38</a>",
      "comment": "The 'holiness' inscription marks visible sanctification. The outward mastery points to the deeper spiritual significance of consecration."
    },
    {
      "pk": 28045013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 13,
      "text": "Before him, none had such adornment; no stranger ever wore it, but only his sons and their descendants always.",
      "links": "<a href='/AIV/4/3/10'>Lev. 3:10</a>",
      "comment": "The exclusive, hereditary priesthood is established here, pointing to God's call to visible and lineage-based leadership in worship."
    },
    {
      "pk": 28045014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 14,
      "text": "His offerings were to be consumed by fire twice every day, as a perpetual reminder for Moses, with constant sacrifices to make peace for the people.",
      "links": "<a href='/AIV/3/6/20'>Lev. 6:20</a>; <a href='/AIV/4/28/3'>Num. 28:3</a>",
      "comment": "The sacrifices foreshadow the need for an ongoing, perfect atonement, a theme that finds fulfillment in Christ's eternal sacrifice (<a href='/AIV/58/10/12'>Heb. 10:12</a>)."
    },
    {
      "pk": 28045015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 15,
      "text": "God gave him authority to bless the people and to bear His glorious name, so that he might honor Him with sacrifices and maintain harmony with His people.",
      "links": "<a href='/AIV/4/6/22-27'>Num. 6:22-27</a>",
      "comment": "The power to bless in God’s name is given by God to specific leaders. This principle is later echoed in apostolic succession and sacramental ministry."
    },
    {
      "pk": 28045016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 16,
      "text": "God chose him out of all mankind to offer sacrifices, incense, and a memorial of sweet aroma, as a pleasing offering to make atonement for the people.",
      "links": "<a href='/AIV/4/16/40'>Num. 16:40</a>; <a href='/AIV/3/4/7'>Lev. 4:7</a>",
      "comment": "Incense and sacrifice signal the importance of offering worship through divinely appointed means. These actions prefigure the spiritual and physical offerings of Christ and the Church."
    },
    {
      "pk": 28045017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 17,
      "text": "God gave him the right to declare His commandments and judge His statutes, to teach Jacob His decrees and enlighten Israel with His law.",
      "links": "<a href='/AIV/5/33/10'>Deut. 33:10</a>",
      "comment": "Aaron’s teaching authority is emphasized, anticipating the later role of leaders who govern and instruct God’s people in true doctrine."
    },
    {
      "pk": 28045018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 18,
      "text": "Strangers conspired against him, envied him in the wilderness—men of Dathan and Abiram and Korah’s company. They strove against Moses and against the Lord.",
      "links": "<a href='/AIV/4/16/1-3'>Num. 16:1-3</a>",
      "comment": "The rebellion of Korah shows both the danger of pride and the importance of divine authority in community governance."
    },
    {
      "pk": 28045019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 19,
      "text": "The earth opened its mouth and swallowed them with their households, and all Korah's men and possessions, consumed by fire for their arrogance.",
      "links": "<a href='/AIV/4/16/31-33'>Num. 16:31-33</a>",
      "comment": "God's fierce judgment against rebellion marks the sacredness of leadership and the danger of division among God’s people."
    },
    {
      "pk": 28045020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 20,
      "text": "But the Lord increased the glory of Aaron and gave him an inheritance: the holy offerings He apportioned to him as his share.",
      "links": "<a href='/AIV/4/18/8-9'>Num. 18:8-9</a>",
      "comment": "Aaron is rewarded for his faithfulness. His receiving holy offerings stresses God's continuing provision through sacred ministry."
    },
    {
      "pk": 28045021,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 21,
      "text": "Food offerings of the Lord, which He gave to him and his descendants, but not to others;",
      "links": "<a href='/AIV/3/6/16'>Lev. 6:16</a>",
      "comment": "Priestly privilege and stewardship center upon the dedicated share God gives for service, again paralleling the special vocation of church ministers."
    },
    {
      "pk": 28045022,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 22,
      "text": "They eat the sacrifices offered to the Lord, which He gave to him and his descendants; but in the people’s land He has not given them any inheritance.",
      "links": "<a href='/AIV/4/18/20'>Num. 18:20</a>",
      "comment": "The priests' inheritance is the Lord Himself and their share comes from offerings—not land—signifying a life of dedicated spiritual service."
    },
    {
      "pk": 28045023,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 23,
      "text": "For the Lord Himself is their inheritance, and He has set apart the holy things for them.",
      "links": "<a href='/AIV/4/18/20'>Num. 18:20</a>;",
      "comment": "God is described as the true inheritance—the heart of consecrated life and complete devotion."
    },
    {
      "pk": 28045024,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 24,
      "text": "Phinehas, son of Eleazar, ranks third in glory, because he was zealous in reverence for the Most High and made atonement for Israel.",
      "links": "<a href='/AIV/4/25/10-13'>Num. 25:10-13</a>",
      "comment": "Phinehas’s zeal and priesthood anticipate the key principle of spiritual continuity through zeal and fidelity to God's law."
    },
    {
      "pk": 28045025,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 25,
      "text": "Therefore, God made a covenant of peace with him, to be leader of the sanctuary and His people, so that he and his descendants should have the dignity of the priesthood forever.",
      "links": "<a href='/AIV/4/25/13'>Num. 25:13</a>",
      "comment": "The 'covenant of peace' and perpetual priesthood point beyond Phinehas to the enduring and unbroken spiritual leadership, ultimately fulfilled in Christ, the eternal High Priest (<a href='/AIV/58/7/24'>Heb. 7:24</a>)."
    },
    {
      "pk": 28045026,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 45,
      "verse": 26,
      "text": "May the Lord grant you wisdom in your heart to judge His people righteously, so that their blessings may not be forgotten and their glory may endure for every generation.",
      "links": "<a href='/AIV/11/3/9'>1 Ki. 3:9</a>; <a href='/AIV/19/72/1-6'>Ps. 72:1-6</a>",
      "comment": "A concluding blessing for wisdom and righteous leadership, echoing prayers for the preservation and blessing of God’s chosen leaders and people."
    }
  ],
  "translatedAt": "2025-12-24T07:48:03.992Z"
}