{
  "book": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 12,
  "verses": [
    {
      "pk": 3151201,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 1,
      "text": "If you do good, know to whom you are doing it; and you will be thanked for your kindness.",
      "links": "<a href='/AIV/40/5/46'>Matt. 5:46</a>; <a href='/AIV/19/41/1'>Ps. 41:1</a>",
      "comment": "This verse emphasizes discernment in charitable deeds, encouraging intentionality. Jesus also highlights the blessedness of generosity (see Matt. 5:46)."
    },
    {
      "pk": 3151202,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 2,
      "text": "Do good to the godly, and you will find a reward, if not from them, then certainly from the Most High.",
      "links": "<a href='/AIV/42/6/35'>Luke 6:35</a>; <a href='/AIV/19/112/9'>Ps. 112:9</a>",
      "comment": "God Himself is the ultimate rewarder of our good deeds. Paul echoes this truth (see Col. 3:23-24)."
    },
    {
      "pk": 3151203,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 3,
      "text": "No good will come to the one who persists in doing evil, or to one who does not give with sincerity.",
      "links": "<a href='/AIV/20/21/27'>Prov. 21:27</a>; <a href='/AIV/40/6/1-4'>Matt. 6:1–4</a>",
      "comment": "The intention behind the gift matters; hypocrisy or insincerity empties charity of its value (cf. Matt. 6:1–4). This anticipates Christ's teaching on inner motives."
    },
    {
      "pk": 3151204,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 4,
      "text": "Give to the godly, but do not help the sinner.",
      "links": "<a href='/AIV/20/28/4'>Prov. 28:4</a>",
      "comment": "Sirach presents a tough principle distinguishing between recipients of generosity. It emphasizes spiritual well-being over indiscriminate giving, resonating with Paul's exhortations concerning the faith community (see Gal. 6:10). Note: this does not contradict Christ’s call to love even enemies (Matt. 5:44), but points to the prudence of supporting the righteous."
    },
    {
      "pk": 3151205,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 5,
      "text": "Do good to the humble and faithful, do not give to the ungodly; hold back your bread, and do not give it to them, lest they use it against you. For you will receive twice as much evil for all the good you have done to them.",
      "links": "<a href='/AIV/20/28/17'>Prov. 28:17</a>",
      "comment": "This verse warns against enabling the ungodly, a nuance sometimes softened in modern contexts. The early church also practiced discernment in community life (2 Thess. 3:10–15)."
    },
    {
      "pk": 3151206,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 6,
      "text": "For the Most High also hates sinners, and will repay the wicked with punishment.",
      "links": "<a href='/AIV/19/5/5'>Ps. 5:5</a>; <a href='/AIV/45/1/18'>Rom. 1:18</a>",
      "comment": "A clear statement on divine justice. While God’s mercy is boundless, His justice is uncompromising (see Rom. 1:18)."
    },
    {
      "pk": 3151207,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 7,
      "text": "Give to the good, but do not help the sinner.",
      "links": "<a href='/AIV/19/125/4'>Ps. 125:4</a>",
      "comment": "Repetition for emphasis. Christian tradition calls for both generosity and discernment; helping the good fosters virtue and strengthens the community."
    },
    {
      "pk": 3151208,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 8,
      "text": "A friend will not be known in prosperity, nor will an enemy be hidden in adversity.",
      "links": "<a href='/AIV/20/17/17'>Prov. 17:17</a>",
      "comment": "True character is revealed in times of trouble. This foreshadows Christ’s teaching on authentic friendship and true community found in Him (John 15:13–15)."
    },
    {
      "pk": 3151209,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 9,
      "text": "When someone is successful, even enemies are friendly; but in misfortune, a friend will be distant.",
      "links": "<a href='/AIV/20/14/20'>Prov. 14:20</a>; <a href='/AIV/42/15/16'>Luke 15:16</a>",
      "comment": "Human relationships are often self-interested, but Christ calls us to a higher fidelity in friendship (see John 13:34)."
    },
    {
      "pk": 3151210,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 10,
      "text": "Never trust your enemy; like rust, his wickedness corrodes.",
      "links": "<a href='/AIV/19/55/21'>Ps. 55:21</a>",
      "comment": "Realism about fallen human nature pervades Scripture (see Jer. 17:9). Christians are called to charity, but with the wisdom of ‘wise as serpents’ (Matt. 10:16)."
    },
    {
      "pk": 3151211,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 11,
      "text": "Even though he humbles himself and walks with his head bowed, watch yourself and be on guard. Treat him as a mirror that has been polished, and know that in the end rust will return.",
      "links": "<a href='/AIV/20/26/24–25'>Prov. 26:24–25</a>",
      "comment": "Even apparent repentance may hide future malice; this wisdom is foundational for healthy boundaries in community life."
    },
    {
      "pk": 3151212,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 12,
      "text": "Do not seat him at your right hand, or he may take your place and seek your position, and you will finally understand my words and be pierce with regret.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>; <a href='/AIV/43/13/18'>John 13:18</a>",
      "comment": "This verse prefigures the betrayal Christ experienced from Judas (John 13:18). The right hand signifies authority; be wise with whom you trust."
    },
    {
      "pk": 3151213,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 13,
      "text": "Who will pity a snake charmer bitten by a snake, or those who approach wild beasts?",
      "links": "<a href='/AIV/20/22/3'>Prov. 22:3</a>",
      "comment": "A warning: engaging repeatedly with the dangerous is ultimately a self-inflicted wound. Avoiding near occasions of sin is wise."
    },
    {
      "pk": 3151214,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 14,
      "text": "So it is with one who keeps company with sinners and becomes involved in their sins.",
      "links": "<a href='/AIV/19/1/1'>Ps. 1:1</a>; <a href='/AIV/46/15/33'>1 Cor. 15:33</a>",
      "comment": "The warnings about ‘bad company’ are consistent throughout Scripture. Holiness involves setting boundaries, echoing Jesus’ separation from sin yet seeking the lost."
    },
    {
      "pk": 3151215,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 15,
      "text": "He will stay with you for a while, but when you falter he will not remain faithful.",
      "links": "<a href='/AIV/20/19/4'>Prov. 19:4</a>",
      "comment": "Fickle friendships are fleeting. Relying on true community—those rooted in Christ—protects us from such abandonment."
    },
    {
      "pk": 3151216,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 16,
      "text": "The enemy will speak sweetly with his lips, but in his heart he plans to throw you into a pit. The enemy will weep with his eyes, but if he finds an opportunity he will never have enough of your blood.",
      "links": "<a href='/AIV/19/28/3'>Ps. 28:3</a>",
      "comment": "Deceit and pretense are common in a fallen world. The Psalms echo this warning; true charity involves prudence."
    },
    {
      "pk": 3151217,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 17,
      "text": "If misfortune comes upon you, you will find him there first; pretending to help, he will trip you up.",
      "links": "<a href='/AIV/20/6/13–15'>Prov. 6:13–15</a>",
      "comment": "Beware of false aid from those who intend harm. St. Paul also warns the church to be vigilant (Acts 20:29–30)."
    },
    {
      "pk": 3151218,
      "translation": "AIV",
      "book": 51,
      "chapter": 12,
      "verse": 18,
      "text": "He will shake his head and clap his hands, whispering much and changing his face.",
      "links": "<a href='/AIV/19/35/15-16'>Ps. 35:15–16</a>",
      "comment": "Mockery and duplicity betray an unconverted heart. The wisdom literature often warns against such scornful conduct."
    }
  ],
  "translatedAt": "2025-12-23T09:55:38.667Z"
}