{
  "book": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 23,
  "verses": [
    {
      "pk": 2102301,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 1,
      "text": "O Lord, Father and Master of my life, do not abandon me to their counsels, nor let me fall because of my own desires.",
      "links": "<a href='/AIV/19/141/3-4'>Ps. 141:3-4</a>",
      "comment": "The prayer begins by referencing God as both Father and Master, expressing humility and dependence. This sets the spiritual tone for the rest of the chapter."
    },
    {
      "pk": 2102302,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 2,
      "text": "O Lord, place a guard at my mouth, a secure barrier at my lips, so that I may not fall through them, and my tongue does not destroy me.",
      "links": "<a href='/AIV/19/141/3'>Ps. 141:3</a>; <a href='/AIV/20/13/3'>Prov. 13:3</a>; <a href='/AIV/59/3/2'>Jas. 3:2</a>",
      "comment": "Emphasizes the need for divine help in restraining speech, connecting to New Testament teachings about the dangers of the tongue (James 3)."
    },
    {
      "pk": 2102303,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 3,
      "text": "O Lord, do not let me be led astray by my lips, nor allow pride to overtake me.",
      "links": "<a href='/AIV/19/19/13'>Ps. 19:13</a>; <a href='/AIV/20/21/23'>Prov. 21:23</a>",
      "comment": "Again, the theme of humility and self-control arises, showing that strength to resist sin comes from God’s grace."
    },
    {
      "pk": 2102304,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 4,
      "text": "O Lord, do not let my heart be inclined toward evil, nor excuse my faults.",
      "links": "<a href='/AIV/19/139/23-24'>Ps. 139:23-24</a>",
      "comment": "Echoes Psalm 139, asking God to search and guide the heart away from evil inclinations—an important aspect of spiritual purification."
    },
    {
      "pk": 2102305,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 5,
      "text": "Do not allow sinful desires to rule over me, nor give me to the company of shameless men.",
      "links": "<a href='/AIV/19/119/133'>Ps. 119:133</a>; <a href='/AIV/19/1/1'>Ps. 1:1</a>",
      "comment": "Warns of the corrupting influence of companions and asks for deliverance from sinful passions—a common wisdom theme."
    },
    {
      "pk": 2102306,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 6,
      "text": "O Lord, keep me from the desire of lust, and do not let gluttony or impurity possess me.",
      "links": "<a href='/AIV/40/5/28'>Matt. 5:28</a>; <a href='/AIV/46/6/13'>1 Cor. 6:13</a>",
      "comment": "Connects with Jesus’ teachings about purity of heart (Matthew 5:28), hinting at the importance of inner transformation, not just outward obedience."
    },
    {
      "pk": 2102307,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 7,
      "text": "Hear, my children, instruction about the tongue. The one who keeps it will not be caught up in evils.",
      "links": "<a href='/AIV/20/18/21'>Prov. 18:21</a>; <a href='/AIV/59/3/2-6'>James 3:2-6</a>",
      "comment": "Wisdom passed to the next generation: controlling the tongue prevents many sins. Such discipline reflects a maturing spiritual life."
    },
    {
      "pk": 2102308,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 8,
      "text": "The sinner is trapped by his own lips; the reviler and the arrogant fall because of their speech.",
      "links": "<a href='/AIV/20/12/13'>Prov. 12:13</a>",
      "comment": "Speech is portrayed as betraying the inner state, and careless words lead to ruin. It foreshadows Jesus’ teaching that 'out of the abundance of the heart the mouth speaks' (Matthew 12:34)."
    },
    {
      "pk": 2102309,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 9,
      "text": "Do not accustom your mouth to swearing oaths, nor use the Name of the Holy One lightly.",
      "links": "<a href='/AIV/19/15/4'>Ps. 15:4</a>; <a href='/AIV/40/5/34'>Matt. 5:34</a>",
      "comment": "Warnings against careless or profane use of God’s name, in line with the third commandment and Jesus’ instructions against swearing oaths unnecessarily."
    },
    {
      "pk": 2102310,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 10,
      "text": "Just as a servant who is repeatedly examined will not be found without bruises, so the one who swears and takes oaths continually will not be found guiltless.",
      "links": "<a href='/AIV/20/10/19'>Prov. 10:19</a>",
      "comment": "Repetition of careless swearing leads to guilt, just as repeated correction eventually leaves its marks—a warning about taking the sacred lightly."
    },
    {
      "pk": 2102311,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 11,
      "text": "A man who swears much is filled with iniquity, and punishment will never leave his house.",
      "links": "<a href='/AIV/20/6/12'>Prov. 6:12</a>",
      "comment": "Swearing is shown as a doorway to sin and trouble in life, suggesting deeper harm than may be immediately visible."
    },
    {
      "pk": 2102312,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 12,
      "text": "If he slips, his sin is on him; if he ignores it, he sins doubly. If he has sworn falsely, he will not be justified, and his house will be filled with disaster.",
      "links": "<a href='/AIV/24/7/9-11'>Jer. 7:9-11</a>",
      "comment": "This verse stresses personal responsibility and warns that doubling down on sin only increases guilt. There are implications for the need for confession and reconciliation."
    },
    {
      "pk": 2102313,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 13,
      "text": "There is a way of speaking comparable to death—may it never be found in the inheritance of Jacob.",
      "links": "<a href='/AIV/02/20/7'>Ex. 20:7</a>",
      "comment": "Strong language used for the misuse of words, associating it with the ultimate penalty."
    },
    {
      "pk": 2102314,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 14,
      "text": "From the devout all these things will be kept far away, and they will not wallow in sin.",
      "links": "<a href='/AIV/19/1/6'>Ps. 1:6</a>",
      "comment": "Purity and devotion keep the faithful from grievous sin, suggesting ongoing sanctification and participation in holiness."
    },
    {
      "pk": 2102315,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 15,
      "text": "Do not let your mouth become used to indecent or offensive speech, for such words have no place in uprightness.",
      "links": "<a href='/AIV/49/4/29'>Eph. 4:29</a>",
      "comment": "Echoes New Testament exhortations to pure and edifying speech among believers (Ephesians 4:29). Growth in holiness involves even our language."
    },
    {
      "pk": 2102316,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 16,
      "text": "Remember your father and your mother when you sit among leaders, lest you forget before them and become like a fool, and wish you had not been born.",
      "links": "<a href='/AIV/02/20/12'>Ex. 20:12</a>; <a href='/AIV/20/10/1'>Prov. 10:1</a>",
      "comment": "This verse brings in family and honor, suggesting that the formation received from parents is vital for public conduct and self-respect."
    },
    {
      "pk": 2102317,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 17,
      "text": "Because of bad habits you may curse the day of your birth, and by dying you would leave behind your shame.",
      "links": "<a href='/AIV/18/3/1-3'>Job 3:1-3</a>",
      "comment": "Draws parallels to Job’s lament but ties it directly to sin and shame rather than innocent suffering."
    },
    {
      "pk": 2102318,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 18,
      "text": "A man who is in the habit of improper speech will not be corrected all his life; he will be filled with condemnation.",
      "links": "<a href='/AIV/20/29/1'>Prov. 29:1</a>",
      "comment": "Warns that hardened sin becomes entrenched, making repentance harder. The role of community in calling others to correction is implied."
    },
    {
      "pk": 2102319,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 19,
      "text": "Two kinds multiply sins, and a third brings wrath: a burning passion like fire will not be quenched until it has consumed, a man who gives in to his own flesh will not rest until the fire burns him up.",
      "links": "<a href='/AIV/20/6/27-28'>Prov. 6:27-28</a>",
      "comment": "The imagery of fire for sinful passion is reminiscent of teachings about the consequences of unchecked lust and gluttony."
    },
    {
      "pk": 2102320,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 20,
      "text": "A man who commits fornication with his own flesh, saying to himself, 'Who sees me? Darkness surrounds me, the walls hide me, and no one sees me. Why should I fear?' The Most High will not remember my sins.'",
      "links": "<a href='/AIV/19/10/11'>Ps. 10:11</a>; <a href='/AIV/42/12/2-3'>Luke 12:2-3</a>",
      "comment": "This verse speaks to self-deception and the presumption of hidden sin. Jesus later teaches in the Gospels that 'nothing is hidden that will not be revealed' (Luke 12:2)."
    },
    {
      "pk": 2102321,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 21,
      "text": "He only fears the eyes of men, and does not realize that the eyes of the Lord are a thousand times brighter than the sun, watching all the ways of men and examining the hidden places.",
      "links": "<a href='/AIV/20/15/3'>Prov. 15:3</a>; <a href='/AIV/58/4/13'>Heb. 4:13</a>",
      "comment": "Points to God's omniscience, echoed in both Old and New Testament passages, enforcing moral responsibility even in secret."
    },
    {
      "pk": 2102322,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 22,
      "text": "All things were known to him even before they were created; so also, after completion, nothing is hidden from him.",
      "links": "<a href='/AIV/45/11/33-36'>Rom. 11:33-36</a>",
      "comment": "Affirms God's eternal knowledge, before and after creation. For believers, this calls for deep trust and awe."
    },
    {
      "pk": 2102323,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 23,
      "text": "A man will be punished in the city for the woman with whom he commits adultery, and he will be seized for his disregard of the law.",
      "links": "<a href='/AIV/03/20/10'>Lev. 20:10</a>; <a href='/AIV/40/5/27'>Matt. 5:27</a>",
      "comment": "References Old Testament penalties for adultery, and ties to Jesus’ internalized standard for purity."
    },
    {
      "pk": 2102324,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 24,
      "text": "So it is with every woman who leaves her husband and sets up an heir by another man.",
      "links": "<a href='/AIV/20/6/32'>Prov. 6:32</a>",
      "comment": "Continues the theme of marital fidelity, warning about consequences for infidelity from both men and women—a holistic moral teaching."
    },
    {
      "pk": 2102325,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 25,
      "text": "First, she has disobeyed the law of the Most High; second, she has been unfaithful to her husband; and third, she has committed adultery and brought forth children by another man.",
      "links": "<a href='/AIV/24/3/20'>Jer. 3:20</a>",
      "comment": "Lays out three-fold guilt—against God, husband, and family integrity. The literary progression emphasizes the seriousness of adultery."
    },
    {
      "pk": 2102326,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 26,
      "text": "Such a woman will be brought before the assembly, and her children will not take root, and her branches will not bear fruit.",
      "links": "<a href='/AIV/23/5/4-6'>Isa. 5:4-6</a>",
      "comment": "Consequences are communal and generational, reflecting both justice and a call to communal purity. The assembly here hints at the role of the congregation in upholding discipline."
    },
    {
      "pk": 2102327,
      "translation": "AIV",
      "book": 51,
      "chapter": 23,
      "verse": 27,
      "text": "She will leave her memory as a curse, and her reproach will never be blotted out.",
      "links": "<a href='/AIV/20/10/7'>Prov. 10:7</a>",
      "comment": "The conclusion warns that sinful actions have permanent consequences but leaves open the hope of repentance and restoration, in line with mercy offered throughout Scripture."
    }
  ],
  "translatedAt": "2025-12-23T10:00:40.943Z"
}