{
  "book": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 8,
  "verses": [
    {
      "pk": 2193080,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 1,
      "text": "Do not argue with a powerful person, or you might fall into their hands.",
      "links": "<a href='/AIV/20/22/24'>Prov. 22:24–25</a>",
      "comment": "Sirach begins with practical advice about not provoking those who have greater power, reflecting a wisdom tradition found throughout Proverbs."
    },
    {
      "pk": 2193081,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 2,
      "text": "Do not quarrel with someone rich, lest they overpower you. For wealth has ruined many.",
      "links": "<a href='/AIV/20/13/8'>Prov. 13:8</a>",
      "comment": "This verse emphasizes the danger of quarreling with the wealthy, who have influence and resources that can be used against you."
    },
    {
      "pk": 2193082,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 3,
      "text": "Do not argue with someone who talks much; do not heap more wood on their fire.",
      "links": "<a href='/AIV/20/10/19'>Prov. 10:19</a>",
      "comment": "Arguing with those who love disputes only stirs up more conflict, echoing wisdom themes from the Book of Proverbs."
    },
    {
      "pk": 2193083,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 4,
      "text": "Do not mock someone who is repentant for sin; remember that all of us deserve punishment.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "Encouraging compassion for the penitent, this verse reflects humility before God, a foundation for reconciliation and mercy (see the parable of the Prodigal Son, <a href='/AIV/42/15/11-32'>Luke 15:11–32</a>)."
    },
    {
      "pk": 2193084,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 5,
      "text": "Do not spurn someone when they are old, for we too will grow old.",
      "links": "<a href='/AIV/20/16/31'>Prov. 16:31</a>",
      "comment": "Honoring the aged is a recurring theme rooted in the wisdom literature and in the commandment to honor your father and mother (<a href='/AIV/2/20/12'>Exodus 20:12</a>)."
    },
    {
      "pk": 2193085,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 6,
      "text": "Do not rejoice over someone's death; remember that we are all mortal.",
      "links": "<a href='/AIV/19/39/4'>Ps. 39:4</a>",
      "comment": "This passage points to the universality of death and subtly hints at the doctrine of the final judgment and the hope of resurrection as revealed later in the New Testament (<a href='/AIV/46/15/12-26'>1 Cor. 15:12–26</a>)."
    },
    {
      "pk": 2193086,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 7,
      "text": "Do not reject the story told by the wise, but reflect on their teachings; for you will learn wisdom from them.",
      "links": "<a href='/AIV/20/19/20'>Prov. 19:20</a>",
      "comment": "Listening to and pondering the words of the wise is a practice modeled by seeking understanding from those who have walked with God."
    },
    {
      "pk": 2193087,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 8,
      "text": "Do not disregard the traditions of the elders; they were established for a reason.",
      "links": "<a href='/AIV/05/32/7'>Deut. 32:7</a>",
      "comment": "Respecting spiritual tradition points to the continuity of wisdom and faith across generations, subtly underlining the importance of apostolic succession and sacred tradition for understanding God's revelation."
    },
    {
      "pk": 2193088,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 9,
      "text": "Do not argue with someone for their words; sometimes they may speak from bitter knowledge.",
      "links": "<a href='/AIV/18/6/24'>Job 6:24</a>",
      "comment": "Recognizing that people's words may come from deep pain calls for patience and empathy, as Christ himself demonstrated compassion for those who suffered."
    },
    {
      "pk": 2193089,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 10,
      "text": "Do not despise someone who turns to God; instead, learn from their humility.",
      "links": "<a href='/AIV/42/18/13'>Luke 18:13</a>",
      "comment": "This echoes Christ's teaching of the tax collector in Luke 18, reminding us that contrition opens the door to grace."
    },
    {
      "pk": 2193090,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 11,
      "text": "Do not hold back from speaking in time of danger, for people may rely on your words.",
      "links": "<a href='/AIV/17/4/14'>Esther 4:14</a>",
      "comment": "God sometimes places us in moments where speaking up may save others, as in the story of Esther. True wisdom discerns the moment for speech and silence."
    },
    {
      "pk": 2193091,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 12,
      "text": "Do not base judgment on rumors; do not fall into danger through careless words.",
      "links": "<a href='/AIV/20/18/13'>Prov. 18:13</a>",
      "comment": "Gossip and rash judgment are condemned throughout Scripture. The call to careful speech is part of living out the love of neighbor."
    },
    {
      "pk": 2193092,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 13,
      "text": "Do not associate with a violent person, lest you learn their ways and become ensnared yourself.",
      "links": "<a href='/AIV/20/22/24-25'>Prov. 22:24–25</a>",
      "comment": "The company we keep can corrupt our morals. This echoes Paul's teaching in <a href='/AIV/46/15/33'>1 Cor. 15:33</a>."
    },
    {
      "pk": 2193093,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 14,
      "text": "Do not quarrel with someone who is angry; do not walk with them through desolate places, for harm may come to you.",
      "links": "<a href='/AIV/20/29/22'>Prov. 29:22</a>",
      "comment": "Sirach warns against the association with those whose anger might lead to recklessness and danger, reminding us that prudence is a virtue."
    },
    {
      "pk": 2193094,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 15,
      "text": "Do not take counsel with fools, for they cannot give good advice.",
      "links": "<a href='/AIV/20/14/7'>Prov. 14:7</a>",
      "comment": "Choosing wise counselors is essential to spiritual health; see James 1:5 for encouragement to ask God for wisdom."
    },
    {
      "pk": 2193095,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 16,
      "text": "Do not keep secrets from someone who cannot keep them.",
      "links": "<a href='/AIV/20/11/13'>Prov. 11:13</a>",
      "comment": "Trust must be wisely placed and, as Christ taught, our yes must be yes and our no, no (<a href='/AIV/40/5/37'>Matt. 5:37</a>)."
    },
    {
      "pk": 2193096,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 17,
      "text": "Do not do evil, and evil will not overcome you.",
      "links": "<a href='/AIV/20/13/21'>Prov. 13:21</a>; <a href='/AIV/45/12/21'>Romans 12:21</a>",
      "comment": "The principle of repaying evil with good is affirmed by Jesus; resisting evil is a call to holiness and perseverance."
    },
    {
      "pk": 2193097,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 18,
      "text": "Do not dishonor yourself before others, or your reputation will suffer.",
      "links": "<a href='/AIV/20/22/1'>Prov. 22:1</a>",
      "comment": "The virtue of integrity preserves one's reputation and witness, vital for being a light to others (see <a href='/AIV/40/5/16'>Matt. 5:16</a>)."
    },
    {
      "pk": 2193098,
      "translation": "AIV",
      "book": 51,
      "chapter": 8,
      "verse": 19,
      "text": "Do not sit at the table with many people, nor with them do not repeat all your words.",
      "links": "<a href='/AIV/20/17/27-28'>Prov. 17:27–28</a>",
      "comment": "Prudence in speech and company guards against scandal and indiscretion. Even at table, careful words foster peace and understanding."
    }
  ],
  "translatedAt": "2025-12-23T09:53:52.247Z"
}