{
  "book": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 22,
  "verses": [
    {
      "pk": 3902201,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 1,
      "text": "A lazy man is compared to a worthless stone, and everyone mocks his sluggishness.",
      "links": "<a href='/AIV/20/10/26'>Prov. 10:26</a>",
      "comment": "The image of a worthless stone highlights the biblical condemnation of sloth (cf. Prov. 6:6–11). Diligence is seen as a virtue, reflecting the value of active participation in the life of faith."
    },
    {
      "pk": 3902202,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 2,
      "text": "A lazy son brings dishonor to his father, and people mock the foolish offspring.",
      "links": "<a href='/AIV/20/17/25'>Prov. 17:25</a>",
      "comment": "This verse emphasizes the importance of honoring one's parents by living wisely. Parental authority and respect for family are consistent themes throughout Scripture."
    },
    {
      "pk": 3902203,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 3,
      "text": "A fool's disgrace is more burdensome than his father's loss, for folly is an ongoing shame.",
      "links": "<a href='/AIV/20/19/13'>Prov. 19:13</a>",
      "comment": "Foolishness causes lasting pain, affecting family and community. The continuation of folly can have deep spiritual consequences."
    },
    {
      "pk": 3902204,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 4,
      "text": "Death is preferable to the life of a fool, for his existence accomplishes nothing.",
      "links": "<a href='/AIV/20/27/22'>Prov. 27:22</a>",
      "comment": "Strong language sharply contrasts wise and foolish living. The text implies that spiritual death begins in persistent folly."
    },
    {
      "pk": 3902205,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 5,
      "text": "Spending time with a mindless man is like life in a dark cave.",
      "links": "<a href='/AIV/19/82/5'>Ps. 82:5</a>",
      "comment": "Folly equates to spiritual blindness, a theme that recurs throughout the wisdom tradition."
    },
    {
      "pk": 3902206,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 6,
      "text": "Mocking a fool is the same as waking a sleeper from deep slumber.",
      "links": "<a href='/AIV/20/26/4'>Prov. 26:4</a>",
      "comment": "Correcting folly is difficult—often fruitless—yet Christians are called to exercise patience and strive for the salvation of souls."
    },
    {
      "pk": 3902207,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 7,
      "text": "Explaining wisdom to a fool is like speaking to someone who is asleep; at the end he will say, 'What was it?'",
      "links": "<a href='/AIV/20/23/9'>Prov. 23:9</a>",
      "comment": "Wisdom requires an open heart. The verse suggests the necessity of grace and receptivity, key themes in spiritual growth."
    },
    {
      "pk": 3902208,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 8,
      "text": "Weep less for the dead, since he has found rest, but weep bitterly for a fool, for his life is worse than death.",
      "links": "<a href='/AIV/53/4/13'>1 Thess. 4:13</a>",
      "comment": "The concept of 'rest' prefigures Christian teaching on the hope of resurrection. Persistent sin is worse than physical death, echoing the tragic consequences of spiritual separation from God."
    },
    {
      "pk": 3902209,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 9,
      "text": "Mourning for the dead lasts seven days, but mourning for a fool or the ungodly lasts a lifetime.",
      "links": "<a href='/AIV/01/50/10'>Gen. 50:10</a>",
      "comment": "Jewish custom prescribed mourning periods, but spiritual death leaves a longer mark. The liturgy's concern for the souls of the departed echoes this focus on the destiny of the soul."
    },
    {
      "pk": 3902210,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 10,
      "text": "Do not speak much with a foolish man, and do not associate with him. Guard yourself from trouble and avoid injury.",
      "links": "<a href='/AIV/20/14/7'>Prov. 14:7</a>",
      "comment": "The advice against fellowship with fools is found throughout wisdom literature. Keeping company with the wise fosters virtue."
    },
    {
      "pk": 3902211,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 11,
      "text": "He will stain you by association, and you will inherit his disgrace.",
      "links": "<a href='/AIV/20/13/20'>Prov. 13:20</a>",
      "comment": "Bad company corrupts good morals. The spiritual life demands careful discernment concerning friendship and influence."
    },
    {
      "pk": 3902212,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 12,
      "text": "Avoid gazing at a fool, and do not sit with him among elders. Do not listen to his words.",
      "links": "<a href='/AIV/20/24/7'>Prov. 24:7</a>",
      "comment": "Wisdom is to be found among the righteous, and the importance of good counsel is stressed here."
    },
    {
      "pk": 3902213,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 13,
      "text": "Protect yourself from him, so that you may not become like him. Stay far from his mischief, and you will find rest and peace.",
      "links": "<a href='/AIV/20/4/14'>Prov. 4:14</a>",
      "comment": "Sanctification often involves separation from those committed to evil, reinforcing the biblical call to holiness."
    },
    {
      "pk": 3902214,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 14,
      "text": "A blow to the body makes most people feel, but a fool only learns through much suffering.",
      "links": "<a href='/AIV/20/27/22'>Prov. 27:22</a>",
      "comment": "The discipline required to teach wisdom recalls the fatherly correction central to the spiritual tradition."
    },
    {
      "pk": 3902215,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 15,
      "text": "As a dog always returns to its vomit, so a fool repeats his foolishness.",
      "links": "<a href='/AIV/20/26/11'>Prov. 26:11</a>; <a href='/AIV/61/2/22'>2 Pet. 2:22</a>",
      "comment": "Scripture draws a memorable parallel, comparing persistent folly to unclean habits. The New Testament echoes this in warning against apostasy."
    },
    {
      "pk": 3902216,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 16,
      "text": "Talking with a fool is like talking to someone fast asleep; at the end he asks, 'What was it?'",
      "links": "<a href='/AIV/20/23/9'>Prov. 23:9</a>",
      "comment": "The verse repeats earlier imagery to stress the difficulty of imparting wisdom to the unteachable."
    },
    {
      "pk": 3902217,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 17,
      "text": "While you mourn a fool, his soul lacks hope; but the soul of the dead finds rest.",
      "links": "<a href='/AIV/53/4/13'>1 Thess. 4:13</a>",
      "comment": "There is greater spiritual emptiness in the fool than in the dead, foreshadowing Christian ideas of spiritual resurrection and the ultimate rest found in Christ."
    },
    {
      "pk": 3902218,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 18,
      "text": "Throwing stones at a grave shows disrespect for the dead, and insulting a fool is useless.",
      "links": "<a href='/AIV/19/23/4'>Ps. 23:4</a>",
      "comment": "Respect for the dead was an important tradition; the analogy warns against wasting effort on hardened folly."
    },
    {
      "pk": 3902219,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 19,
      "text": "Sand and salt and a lump of iron are easier to bear than a foolish person.",
      "links": "<a href='/AIV/20/27/3'>Prov. 27:3</a>",
      "comment": "The cumbersome nature of a fool outweighs even heavy burdens, emphasizing the strain folly creates in community life."
    },
    {
      "pk": 3902220,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 20,
      "text": "A wooden beam bound together is not easily broken, but the heart of a fool is stubborn and hard to change.",
      "links": "<a href='/AIV/24/5/3'>Jer. 5:3</a>",
      "comment": "Unlike physical objects that can be altered, spiritual stubbornness in folly resists correction, underscoring the need for confirmed conversion."
    },
    {
      "pk": 3902221,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 21,
      "text": "One who corrects a foolish man is like one who glues fractured pottery—it will break again.",
      "links": "<a href='/AIV/23/30/14'>Isa. 30:14</a>",
      "comment": "Foolishness is deeply ingrained and often recurs. Spiritual transformation requires internal change by grace."
    },
    {
      "pk": 3902222,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 22,
      "text": "Mocking a foolish person aggravates his wounds, just as a captive suffers repeated blows.",
      "links": "<a href='/AIV/20/27/22'>Prov. 27:22</a>",
      "comment": "Harsh correction may do more harm than good. Mercy and patience are emphasized in biblical teaching."
    },
    {
      "pk": 3902223,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 23,
      "text": "If you protect your friend from misfortune, loyalty will remain; but if you reveal his secrets, you will lose trust forever.",
      "links": "<a href='/AIV/20/17/9'>Prov. 17:9</a>",
      "comment": "Guarding your friend's reputation is a mark of true friendship. Discretion and trust are highly valued—see also David and Jonathan's friendship (1 Sam. 20)."
    },
    {
      "pk": 3902224,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 24,
      "text": "Love your neighbor and be faithful to him; but if you betray his trust, do not follow him.",
      "links": "<a href='/AIV/40/22/39'>Matt. 22:39</a>",
      "comment": "Loving one's neighbor reflects Christ's commandment and the spiritual dimension of charity and forgiveness."
    },
    {
      "pk": 3902225,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 25,
      "text": "Like a lost friend, if you reveal secrets, you cannot regain his trust.",
      "links": "<a href='/AIV/20/16/28'>Prov. 16:28</a>",
      "comment": "Once betrayed, trust is hard to restore. Scripture upholds reconciliation but warns of consequences for repeated offense."
    },
    {
      "pk": 3902226,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 26,
      "text": "Even if you get back a friend's trust through many prayers, a wound once opened may still bleed.",
      "links": "<a href='/AIV/20/18/19'>Prov. 18:19</a>",
      "comment": "The power of prayer in reconciliation is implied here; still, healing takes time and effort. The verse hints at the value of persistence in both prayer and forgiveness, a pattern found in Jesus' teaching."
    },
    {
      "pk": 3902227,
      "translation": "AIV",
      "book": 51,
      "chapter": 22,
      "verse": 27,
      "text": "Anyone who throws stones at birds chases them away, and anyone who insults a friend breaks the relationship.",
      "links": "<a href='/AIV/20/11/9'>Prov. 11:9</a>",
      "comment": "Relationships flourish with gentleness and are broken by carelessness or malice. Maintaining harmony reflects a spiritual call to unity, echoing the prayers for peace in the community of believers."
    }
  ],
  "translatedAt": "2025-12-23T10:00:13.443Z"
}