{
  "book": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 6,
  "verses": [
    {
      "pk": 1936601,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 1,
      "text": "Do not desire to be friends with many, and do not be quick to embrace everyone.",
      "links": "",
      "comment": "This begins a reflection on genuine friendship. Later verses affirm the value of faithful companions. The caution here echoes Proverbs 18:24 (<a href='/AIV/20/18/24'>Prov. 18:24</a>), warning against superficial relationships."
    },
    {
      "pk": 1936602,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 2,
      "text": "For by being too intimate, you may become entangled, and fall into disgrace.",
      "links": "<a href='/AIV/20/17/9'>Prov. 17:9</a>",
      "comment": "A concern for honor and prudence in relationships. The 'entanglement' is moral and social, hinting at wisdom's protective role."
    },
    {
      "pk": 1936603,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 3,
      "text": "If your enemies hear about it, they will mock you, and will never stop slandering you.",
      "links": "",
      "comment": "Consequences of imprudence are social, not just personal. Keeping one's affairs private preserves reputation."
    },
    {
      "pk": 1936604,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 4,
      "text": "Have you ever fallen into the hands of a friend who turns against you? Then pray that God will protect you.",
      "links": "",
      "comment": "True friends are rare. Trust must be combined with prayer and discernment. Christ's example of trusting the Father and selecting disciples is a spiritual parallel (<a href='/AIV/43/15/13-15'>John 15:13–15</a>)."
    },
    {
      "pk": 1936605,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 5,
      "text": "Give no place to scandal and do not speak deceitfully.",
      "links": "<a href='/AIV/20/10/19'>Prov. 10:19</a>",
      "comment": "Speech is to be measured. This reflects the wisdom in James 3:5–10 (<a href='/AIV/59/3/5-10'>James 3:5–10</a>) on speaking carefully."
    },
    {
      "pk": 1936606,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 6,
      "text": "Let your acquaintance be many, but your confidant one in a thousand.",
      "links": "",
      "comment": "A principle of discernment: many acquaintances, but deep trust reserved for a tried companion. Jesus' choosing of the apostles mirrors this (<a href='/AIV/42/6/12-13'>Luke 6:12–13</a>)."
    },
    {
      "pk": 1936607,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 7,
      "text": "When you find a friend, test him first, and do not be too quick to trust him.",
      "links": "",
      "comment": "Trust is earned through patience. The testing of friendship calls to mind the testing of faith in 1 Thess. 5:21 (<a href='/AIV/52/5/21'>1 Thess. 5:21</a>)."
    },
    {
      "pk": 1936608,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 8,
      "text": "For some are friends in times of prosperity, but will not remain in trouble.",
      "links": "",
      "comment": "Conditional friendship is warning against. Compare to Proverbs 19:6–7 (<a href='/AIV/20/19/6-7'>Prov. 19:6–7</a>)."
    },
    {
      "pk": 1936609,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 9,
      "text": "There are friends who turn into enemies and reveal your quarrels to disgrace you.",
      "links": "",
      "comment": "A transition from false friends to genuine loyalty. Betrayal echoes Judas's betrayal of Christ (<a href='/AIV/40/26/47-50'>Matt. 26:47–50</a>)."
    },
    {
      "pk": 1936610,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 10,
      "text": "There are friends who share in your table, but will not stand by you in your distress.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>",
      "comment": "Superficial friendship is contrasted here with faithful companionship. The table motif is prophetic of the Last Supper."
    },
    {
      "pk": 1936611,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 11,
      "text": "If you are successful, they are like you; but in adversity, they stand apart from you.",
      "links": "",
      "comment": "The reality of fair-weather friends. True spiritual unity requires loyalty, as Christ's disciples are called to remain with Him even in suffering."
    },
    {
      "pk": 1936612,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 12,
      "text": "Do not trust your enemy forever; for as rust corrodes iron, so wickedness corrupts the heart.",
      "links": "<a href='/AIV/19/55/21'>Ps. 55:21</a>",
      "comment": "Evil is described as corrosive. A call to vigilance."
    },
    {
      "pk": 1936613,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 13,
      "text": "Even if an enemy humbles himself and walks with bowed head, be careful and guard yourself from him.",
      "links": "",
      "comment": "Caution not to confuse outward appearance with genuine repentance. The spiritual interpretation warns against false conversions."
    },
    {
      "pk": 1936614,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 14,
      "text": "Faithful friends are a safe refuge; whoever finds one has found a treasure.",
      "links": "",
      "comment": "True friendship is described as a spiritual blessing. The language hints at the sacramental bonds found in the community of believers (<a href='/AIV/19/133/1'>Ps. 133:1</a>)."
    },
    {
      "pk": 1936615,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 15,
      "text": "A faithful friend is beyond price; nothing equals his worth.",
      "links": "",
      "comment": "Portrays faithful friendship as inestimable, reflecting the value God places on charity and true unity."
    },
    {
      "pk": 1936616,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 16,
      "text": "A faithful friend is a medicine for life; those who fear the Lord will find one.",
      "links": "<a href='/AIV/20/27/9'>Prov. 27:9</a>",
      "comment": "Friendship brings healing. 'Fear of the Lord' links faithfulness to God with the blessing of friendship."
    },
    {
      "pk": 1936617,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 17,
      "text": "Those who fear the Lord will direct their friendships rightly, because as he is, so will his friend be.",
      "links": "",
      "comment": "Spiritual friendship reflects God's love. The spiritual interpretation suggests unity of will and communion with God, echoing John 15:12 (<a href='/AIV/43/15/12'>John 15:12</a>)."
    },
    {
      "pk": 1936618,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 18,
      "text": "My child, from your youth choose instruction, and you will find wisdom even in old age.",
      "links": "<a href='/AIV/20/4/7'>Prov. 4:7</a>",
      "comment": "Early formation in wisdom leads to lasting fruit. Spiritual interpretation: lifelong discipleship."
    },
    {
      "pk": 1936619,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 19,
      "text": "Come to her as a worker and a sower, and wait patiently for her good fruits.",
      "links": "",
      "comment": "'Her' refers to wisdom personified as a woman. Waiting alludes to perseverance (see James 5:7 <a href='/AIV/59/5/7'>James 5:7</a>)."
    },
    {
      "pk": 1936620,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 20,
      "text": "For while cultivating her, you will labor little, but soon you will eat of her produce.",
      "links": "",
      "comment": "A promise of reward for diligence. Wisdom yields abundant fruit. Echoes the teaching on sowing and reaping in 2 Cor. 9:6 (<a href='/AIV/47/9/6'>2 Cor. 9:6</a>)."
    },
    {
      "pk": 1936621,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 21,
      "text": "She is harsh at first to the ignorant, and does not reveal herself to the foolish.",
      "links": "",
      "comment": "Wisdom requires humility and effort, not ease or instant gratification. Compare Prov. 1:7 (<a href='/AIV/20/1/7'>Prov. 1:7</a>)."
    },
    {
      "pk": 1936622,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 22,
      "text": "She will put her burden upon him until she tests him with her decrees.",
      "links": "",
      "comment": "Wisdom tests and disciplines; the spiritual parallel is the formation of saints through trials."
    },
    {
      "pk": 1936623,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 23,
      "text": "Then she will return him to the right path and reveal her secrets to him.",
      "links": "",
      "comment": "Initiation into wisdom includes both trial and revelation. Spiritual growth involves gradual enlightenment."
    },
    {
      "pk": 1936624,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 24,
      "text": "If you stray, she will reject you and turn you over to your own ruin.",
      "links": "",
      "comment": "Abandoning wisdom leads to ruin. The principle of sowing and reaping is upheld."
    },
    {
      "pk": 1936625,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 25,
      "text": "Watch for opportunities to learn and do not neglect instruction.",
      "links": "",
      "comment": "Encouragement to remain teachable. Compare Prov. 8:34 (<a href='/AIV/20/8/34'>Prov. 8:34</a>)."
    },
    {
      "pk": 1936626,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 26,
      "text": "If you love hearing, you will become wise; if you listen, your understanding will grow.",
      "links": "",
      "comment": "A call to love learning and be open to truth. Spiritual growth requires humility."
    },
    {
      "pk": 1936627,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 27,
      "text": "Stand with the gathering of elders, and cling to their wisdom.",
      "links": "",
      "comment": "Learning in community and from elders is encouraged. The concept of apostolic succession is subtly echoed, as wisdom is handed down."
    },
    {
      "pk": 1936628,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 28,
      "text": "Be eager to listen to every godly discourse, and do not let wise sayings escape you.",
      "links": "",
      "comment": "The oral transmission of wisdom is valued. Compare Deut. 6:6–7 (<a href='/AIV/5/6/6-7'>Deut. 6:6–7</a>)."
    },
    {
      "pk": 1936629,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 29,
      "text": "If you see an intelligent man, rise early to find him, and let your foot wear out his doorstep.",
      "links": "",
      "comment": "Pursuit of wisdom requires effort and humility."
    },
    {
      "pk": 1936630,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 30,
      "text": "Study the words of God and meditate on his commandments.",
      "links": "",
      "comment": "Personal meditation and devotion. Compare Ps. 119:15 (<a href='/AIV/19/119/15'>Ps. 119:15</a>)."
    },
    {
      "pk": 1936631,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 31,
      "text": "He will establish your heart, and wisdom will be your counselor.",
      "links": "",
      "comment": "God's indwelling presence guides the heart. Spiritual interpretation: the guidance of the Holy Spirit."
    },
    {
      "pk": 1936632,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 32,
      "text": "If you desire wisdom, keep the commandments, and the Lord will give her to you.",
      "links": "<a href='/AIV/19/111/10'>Ps. 111:10</a>",
      "comment": "Obedience is linked to receiving wisdom. Shows that Grace works through observance, not just faith alone."
    },
    {
      "pk": 1936633,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 33,
      "text": "Fear the Lord and seek wisdom with sincerity.",
      "links": "",
      "comment": "True fear of the Lord is reverence and leads to spiritual growth."
    },
    {
      "pk": 1936634,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 34,
      "text": "If you seek her, she will be found; if you hold to her, do not let her go.",
      "links": "",
      "comment": "Persistence is rewarded. Wisdom is portrayed as 'her' in a maternal role, recalling Prov. 3:18 (<a href='/AIV/20/3/18'>Prov. 3:18</a>)."
    },
    {
      "pk": 1936635,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 35,
      "text": "For in the end you will rest in her, and she will turn your sorrow into joy.",
      "links": "",
      "comment": "Wisdom brings consolation. The tradition of spiritual joy through union with wisdom."
    },
    {
      "pk": 1936636,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 36,
      "text": "Within wisdom, you will become wise yourself, and you will be praised by all who know you.",
      "links": "",
      "comment": "Consistent with the biblical view that wisdom brings honor. Compare Daniel 12:3 (<a href='/AIV/27/12/3'>Dan. 12:3</a>)."
    },
    {
      "pk": 1936637,
      "translation": "AIV",
      "book": 51,
      "chapter": 6,
      "verse": 37,
      "text": "Draw near to wisdom and remain close to her, so that you may be taught the fear of the Lord, and your heart may be enlightened.",
      "links": "",
      "comment": "Ends with the exhortation to remain close to Wisdom. Spiritual meaning: discipleship, formation through devotion, and openness to enlightenment. Echoes New Testament calls to 'abide in Christ' (<a href='/AIV/43/15/4'>John 15:4</a>)."
    }
  ],
  "translatedAt": "2025-12-23T09:52:32.574Z"
}