{
  "book": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 9,
  "verses": [
    {
      "pk": 1949001,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 1,
      "text": "Do not be jealous of your wife's beauty, and do not let her draw you away with your eyes.",
      "links": "<a href='/AIV/20/6/25'>Prov. 6:25</a>; <a href='/AIV/40/5/28'>Matt. 5:28</a>",
      "comment": "This verse warns against both jealousy and lust, emphasizing trust and respect within marriage. The New Testament deepens this teaching with Christ's call to purity of heart (<a href='/AIV/40/5/28'>Matt 5:28</a>)."
    },
    {
      "pk": 1949002,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 2,
      "text": "Do not give your soul to a woman, so that she may trample on your strength.",
      "links": "<a href='/AIV/24/4/30'>Jer. 4:30</a>; <a href='/AIV/20/31/3'>Prov. 31:3</a>",
      "comment": "This echoes earlier wisdom literature warning that immoral relationships can weaken spiritual strength. Compare with Proverbs 31:3 and a christological call to holiness."
    },
    {
      "pk": 1949003,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 3,
      "text": "Do not meet with a harlot, or you may fall into her snares.",
      "links": "<a href='/AIV/20/7/21-23'>Prov. 7:21-23</a>",
      "comment": "Contact with sexual sin is seen as a snare. The literal meaning affirms traditional sexual ethics rooted in wisdom literature."
    },
    {
      "pk": 1949004,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 4,
      "text": "Do not linger with a singer, or you may be caught by her tricks.",
      "links": "<a href='/AIV/20/7/5'>Prov. 7:5</a>",
      "comment": "This refers to women who might seduce through entertainment. The theme is guarding the senses and heart, a principle valued in ascetic spiritual traditions."
    },
    {
      "pk": 1949005,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 5,
      "text": "Do not gaze upon a young girl, or you may be ensnared with her beauty.",
      "links": "<a href='/AIV/20/6/25'>Prov. 6:25</a>",
      "comment": "Originating in the wisdom tradition, purity of heart is a universal Christian value. Jesus' intensification in Matthew 5:28 is foreshadowed here."
    },
    {
      "pk": 1949006,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 6,
      "text": "Do not give yourself to prostitutes, or you may destroy your inheritance.",
      "links": "<a href='/AIV/20/29/3'>Prov. 29:3</a>",
      "comment": "Wasting blessings through vice is an ancient theme, underlining the need for chastity to preserve spiritual inheritance."
    },
    {
      "pk": 1949007,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 7,
      "text": "Do not look around in the streets of a city, or wander about in deserted places.",
      "links": "<a href='/AIV/20/7/8-9'>Prov. 7:8-9</a>",
      "comment": "Idle behavior in public can lead to temptation. Tradition encourages vigilance and avoidance of occasions of sin."
    },
    {
      "pk": 1949008,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 8,
      "text": "Turn your eye away from a beautiful woman, and do not gaze upon another's beauty.",
      "links": "<a href='/AIV/40/5/28'>Matt. 5:28</a>",
      "comment": "Closely tied to Christ’s warning against lust in the heart. Maintaining custody of the eyes is a longstanding spiritual practice."
    },
    {
      "pk": 1949009,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 9,
      "text": "With a married woman do not dine, or you will cause your heart to slip toward her and be destroyed by your passion.",
      "links": "<a href='/AIV/20/6/25'>Prov. 6:25</a>",
      "comment": "There are repeated warnings about emotional and physical infidelity. The literal and spiritual sense both reinforce marital fidelity."
    },
    {
      "pk": 1949010,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 10,
      "text": "Do not abandon an old friend, for a new one cannot take his place.",
      "links": "<a href='/AIV/20/18/24'>Prov. 18:24</a>",
      "comment": "Faithfulness in friendship parallels God’s steadfast faithfulness. The continuity of relationship echoes divine covenant continuity."
    },
    {
      "pk": 1949011,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 11,
      "text": "Do not despise a wise teacher, for you do not know his true worth.",
      "links": "<a href='/AIV/20/4/7'>Prov. 4:7</a>; <a href='/AIV/40/10/41'>Matt. 10:41</a>",
      "comment": "Valuing those who impart wisdom is critical. Jesus affirms the reward for receiving a prophet or righteous person."
    },
    {
      "pk": 1949012,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 12,
      "text": "Delight not in the downfall of sinners; remember, we are all subject to punishment.",
      "links": "<a href='/AIV/19/51/1-3'>Ps. 51:1-3</a>; <a href='/AIV/40/7/1'>Matt. 7:1</a>",
      "comment": "This verse invites humility and mercy, recalling Jesus’ teaching to avoid judging others."
    },
    {
      "pk": 1949013,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 13,
      "text": "Do not turn away from someone who is humble, but remember that those who are unseen may be greatly esteemed.",
      "links": "<a href='/AIV/42/14/11'>Luke 14:11</a>",
      "comment": "God exalts the humble—see Jesus in Luke 14:11. The spiritual sense points to the dignity of humility and hidden sanctity."
    },
    {
      "pk": 1949014,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 14,
      "text": "Do not look down on anyone who is old, for some among them also learn wisdom.",
      "links": "<a href='/AIV/20/16/31'>Prov. 16:31</a>",
      "comment": "Respect for age and wisdom is a recurring theme in Scripture and the tradition of the Church."
    },
    {
      "pk": 1949015,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 15,
      "text": "Do not rejoice at the death of anyone. Remember, we will all face death.",
      "links": "<a href='/AIV/19/90/12'>Ps. 90:12</a>; <a href='/AIV/45/14/10-12'>Rom. 14:10-12</a>",
      "comment": "A call to reflect on our mortality, fostering humility and preparation for judgement—a theme echoed in Christian tradition."
    },
    {
      "pk": 1949016,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 16,
      "text": "Speak with those who are wise, and let your conversation be about the Law of the Most High.",
      "links": "<a href='/AIV/19/1/2'>Ps. 1:2</a>; <a href='/AIV/44/17/11'>Acts 17:11</a>",
      "comment": "The Law here anticipates the fullness of revelation, encouraging ongoing meditation and community grounded in God's Word."
    },
    {
      "pk": 1949017,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 17,
      "text": "Let righteous people be at your table, for your glory will be in the fear of the Lord.",
      "links": "<a href='/AIV/19/112/1'>Ps. 112:1</a>",
      "comment": "Table fellowship is a sign of holiness and communion; sharing with the righteous foreshadows the heavenly banquet."
    },
    {
      "pk": 1949018,
      "translation": "AIV",
      "book": 51,
      "chapter": 9,
      "verse": 18,
      "text": "A work is praised for the skill of the craftsman, so a ruler is proved wise in the counsel of elders.",
      "links": "<a href='/AIV/20/11/14'>Prov. 11:14</a>; <a href='/AIV/44/15/6'>Acts 15:6</a>",
      "comment": "Good leadership relies on wise counsel—a model mirrored in the New Testament Church’s decisions (Acts 15:6). Wise guidance and unity are enduring principles for the Christian community."
    }
  ],
  "translatedAt": "2025-12-23T09:54:10.489Z"
}