{
  "book": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 17,
  "verses": [
    {
      "pk": 1933001,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 1,
      "text": "The Lord created humanity out of earth, and returns them to it again.",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/1/3/19'>Gen. 3:19</a>",
      "comment": "Sirach begins with creation language echoing Genesis—emphasizing the origin and destiny of man. Humanity is both formed and returned to dust, reminding us of our dependence on God as Creator."
    },
    {
      "pk": 1933002,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 2,
      "text": "He gave them limited days, and a fixed number of years, and also gave them power over everything upon the earth.",
      "links": "<a href='/AIV/1/1/28'>Gen. 1:28</a>; <a href='/AIV/18/14/5'>Job 14:5</a>",
      "comment": "God grants stewardship, echoing man's royal vocation over creation but also the temporality of human life. This authority prefigures Christ, who restores true dominion."
    },
    {
      "pk": 1933003,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 3,
      "text": "He endowed them with strength similar to his own, and made them in his own image.",
      "links": "<a href='/AIV/1/1/27'>Gen. 1:27</a>",
      "comment": "The image of God in humanity points to dignity, rationality, and the call to holiness, with Christ as the perfect image (Col. 1:15)."
    },
    {
      "pk": 1933004,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 4,
      "text": "He put the fear of them upon all living creatures, so that they might have dominion over beasts and birds.",
      "links": "<a href='/AIV/1/9/2'>Gen. 9:2</a>",
      "comment": "Authority over creation recalls the Genesis mandate; it reminds us of man's vocation to care for the created world rather than exploit it."
    },
    {
      "pk": 1933005,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 5,
      "text": "He gave them reasoning, a tongue, and eyes, ears, and a heart for understanding.",
      "links": "<a href='/AIV/20/20/12'>Prov. 20:12</a>; <a href='/AIV/19/94/9'>Ps. 94:9</a>",
      "comment": "Human faculties signal the spiritual dimension of man; 'heart for understanding' suggests an interior formation echoing spiritual interpretations."
    },
    {
      "pk": 1933006,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 6,
      "text": "He filled them with knowledge and wisdom, and showed them what is good and evil.",
      "links": "<a href='/AIV/1/2/17'>Gen. 2:17</a>; <a href='/AIV/20/2/6'>Prov. 2:6</a>",
      "comment": "Reference to moral discernment and wisdom connects to the tree of knowledge, foreshadowing Christ, the full revelation of good."
    },
    {
      "pk": 1933007,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 7,
      "text": "He set his eye upon their hearts, to reveal to them the greatness of his works.",
      "links": "<a href='/AIV/19/66/5'>Ps. 66:5</a>; <a href='/AIV/19/111/2'>Ps. 111:2</a>",
      "comment": "God's intimate concern for the heart echoes biblical spirituality, emphasizing an interior relationship with God and the personal call to recognize his mighty works."
    },
    {
      "pk": 1933008,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 8,
      "text": "He gave them reason so that they might praise his name, and declare the greatness of his works.",
      "links": "<a href='/AIV/19/150/2'>Ps. 150:2</a>",
      "comment": "Purpose of intellect and speech is ultimately worship—man's highest calling. All faculties directed toward God’s glory manifest a spiritual interpretation."
    },
    {
      "pk": 1933009,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 9,
      "text": "He divided them by nations and languages, and assigned them to different tribes.",
      "links": "<a href='/AIV/1/11/7-9'>Gen. 11:7–9</a>",
      "comment": "Echoes Tower of Babel; diversity is God’s design, ultimately reconciled in Christ (Acts 2:6-11)."
    },
    {
      "pk": 1933010,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 10,
      "text": "He established instruction for them, and gave them statutes for living.",
      "links": "<a href='/AIV/3/18/5'>Lev. 18:5</a>; <a href='/AIV/19/19/7'>Ps. 19:7</a>",
      "comment": "God's Law as a gift to humanity prefigures the law of Christ and the new covenant where instruction leads to holiness."
    },
    {
      "pk": 1933011,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 11,
      "text": "He saw their ways and divided them, and appointed laws for every nation.",
      "links": "<a href='/AIV/1/10/32'>Gen. 10:32</a>",
      "comment": "Differentiation among nations through law reflects providence; spiritual application implies unity through faith in Christ."
    },
    {
      "pk": 1933012,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 12,
      "text": "But he did not take away his mercy from them, nor abandon them, though they sinned.",
      "links": "<a href='/AIV/19/103/8-10'>Ps. 103:8-10</a>; <a href='/AIV/20/28/13'>Prov. 28:13</a>",
      "comment": "Persistent mercy is God’s character; anticipates redemption—fulfilled perfectly in Christ."
    },
    {
      "pk": 1933013,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 13,
      "text": "He provided a ruler for each nation, but Israel became the Lordʼs own inheritance.",
      "links": "<a href='/AIV/5/32/8-9'>Deut. 32:8-9</a>",
      "comment": "God's particular favor toward Israel prefigures the Church as the chosen people (1 Peter 2:9)."
    },
    {
      "pk": 1933014,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 14,
      "text": "All his deeds are before them, and nothing can be hidden from his eyes.",
      "links": "<a href='/AIV/19/139/1-4'>Ps. 139:1-4</a>; <a href='/AIV/58/4/13'>Heb. 4:13</a>",
      "comment": "Affirms God’s omniscience; highlights the futility of hiding sin, and sets the foundation for confession and repentance."
    },
    {
      "pk": 1933015,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 15,
      "text": "He gave every man commandment about his neighbor.",
      "links": "<a href='/AIV/3/19/18'>Lev. 19:18</a>; <a href='/AIV/40/22/39'>Matt. 22:39</a>",
      "comment": "Echoes command to love neighbor; Christ affirms this as core of the law, linking Old Testament to New Testament ethics."
    },
    {
      "pk": 1933016,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 16,
      "text": "Their ways are always before him; they cannot be concealed from his sight.",
      "links": "<a href='/AIV/19/33/13-15'>Ps. 33:13-15</a>; <a href='/AIV/19/90/8'>Ps. 90:8</a>",
      "comment": "Repetition for emphasis: God’s omnipresence demands humility, accountability, and sincere contrition."
    },
    {
      "pk": 1933017,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 17,
      "text": "He appointed leaders for every nation, but Israel has been set apart for himself.",
      "links": "<a href='/AIV/5/7/6'>Deut. 7:6</a>; <a href='/AIV/19/135/4'>Ps. 135:4</a>",
      "comment": "Election and separation foretell God’s plan for sanctified community, later expanded to all through Christ."
    },
    {
      "pk": 1933018,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 18,
      "text": "All their deeds, whether as light or as the sun, are before him; and his eyes watch continually over their ways.",
      "links": "<a href='/AIV/19/139/11-12'>Ps. 139:11-12</a>",
      "comment": "Light symbolism connects to Christ, 'the light of the world' (John 8:12), stressing spiritual transparency before God."
    },
    {
      "pk": 1933019,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 19,
      "text": "Their deeds are not hidden from him, neither is their sin concealed.",
      "links": "<a href='/AIV/24/16/17'>Jer. 16:17</a>",
      "comment": "Reiteration reinforces the call for true repentance and honesty; hidden sin is always visible to God."
    },
    {
      "pk": 1933020,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 20,
      "text": "He has appointed each man to remember his deeds, and to return to the Lord in repentance.",
      "links": "<a href='/AIV/19/32/5'>Ps. 32:5</a>; <a href='/AIV/44/3/19'>Acts 3:19</a>",
      "comment": "Invitation to repentance aligns with biblical faith; the act of remembering integrates personal responsibility with spiritual renewal."
    },
    {
      "pk": 1933021,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 21,
      "text": "Repent, turn away from sin, and pray before the Lord; lessen your offenses.",
      "links": "<a href='/AIV/24/26/13'>Jer. 26:13</a>; <a href='/AIV/62/1/9'>1 John 1:9</a>",
      "comment": "Central call to repentance; prayer is means of restoring relationship with God, culminating in forgiveness."
    },
    {
      "pk": 1933022,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 22,
      "text": "Return to the Most High, and keep away from injustice, and hate exceedingly what he abhors.",
      "links": "<a href='/AIV/19/97/10'>Ps. 97:10</a>; <a href='/AIV/20/8/13'>Prov. 8:13</a>",
      "comment": "Call to uprightness and hatred of sin forecasts the sanctification demanded in the New Testament (1 Thess. 4:3)."
    },
    {
      "pk": 1933023,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 23,
      "text": "Recognize what is right before you, for this is the way to be pleasing before God.",
      "links": "<a href='/AIV/45/12/2'>Rom. 12:2</a>",
      "comment": "Discernment of righteousness is foundational for Christian living; echoes 'renew your mind' in Romans."
    },
    {
      "pk": 1933024,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 24,
      "text": "Turn back to the Lord, forsake your sins; pray before him and make your offenses few.",
      "links": "<a href='/AIV/19/32/5'>Ps. 32:5</a>",
      "comment": "Repeats call to repentance; the act of returning is essential—a spiritual renewal always open to God’s mercy."
    },
    {
      "pk": 1933025,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 25,
      "text": "Go back to the Most High, and turn away from unrighteousness, and hate violently what is evil.",
      "links": "<a href='/AIV/19/97/10'>Ps. 97:10</a>",
      "comment": "Strong language calling for moral conversion, underscoring God’s holiness and the necessity to align with him."
    },
    {
      "pk": 1933026,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 26,
      "text": "Who will praise the Most High in the grave, or honor him from the place of the departed? The living and the healthy will praise the Lord.",
      "links": "<a href='/AIV/19/6/5'>Ps. 6:5</a>; <a href='/AIV/19/30/9'>Ps. 30:9</a>",
      "comment": "Echoes Psalms: worship is proper to the living. Implied urgency—repentance and worship are for this life before judgment."
    },
    {
      "pk": 1933027,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 27,
      "text": "How great is the mercy of the Lord, and his forgiveness to those who turn back to him!",
      "links": "<a href='/AIV/19/103/8-12'>Ps. 103:8-12</a>",
      "comment": "Emphasizes divine mercy and readiness to forgive. Invitation is universal—mercy bestowed on repentance prefigures grace in Christ."
    },
    {
      "pk": 1933028,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 28,
      "text": "The Lord cannot be pleased with offerings from the unrighteous, nor will he forgive the multitude of their sins.",
      "links": "<a href='/AIV/23/1/11-15'>Isa. 1:11-15</a>",
      "comment": "Sacrificial worship is only meaningful with righteousness; outward rituals without repentance lack power, anticipating the New Covenant focus on inward cleansing (Heb. 10:22)."
    },
    {
      "pk": 1933029,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 29,
      "text": "Heed to return to the Lord, leave behind injustice, and pray before him. Do not lessen your offenses intentionally.",
      "links": "<a href='/AIV/24/4/1'>Jer. 4:1</a>",
      "comment": "Calls for genuine conversion, not superficial improvement. Prayer is an aid but must be coupled with sincere change of heart."
    },
    {
      "pk": 1933030,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 30,
      "text": "Do not say, 'I will be hidden from the Lord; who will remember me from on high?' In the great assembly, many will remember me.",
      "links": "<a href='/AIV/19/44/21'>Ps. 44:21</a>; <a href='/AIV/19/139/7-8'>Ps. 139:7-8</a>",
      "comment": "Rejects false security in anonymity; God's presence in both personal and communal worship. The 'assembly' concept hints at sacramental communal worship."
    },
    {
      "pk": 1933031,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 31,
      "text": "For now, understand this: before God mercy and wrath both exist, his compassion rests on the repentant.",
      "links": "<a href='/AIV/19/103/13'>Ps. 103:13</a>; <a href='/AIV/45/11/22'>Rom. 11:22</a>",
      "comment": "Dual aspect of mercy and justice; God’s compassion is reserved for the penitent. Spiritual interpretation underscores the ongoing need for humility, frequent repentance, and trust in divine mercy."
    },
    {
      "pk": 1933032,
      "translation": "AIV",
      "book": 51,
      "chapter": 17,
      "verse": 32,
      "text": "Do not hesitate to turn to him, nor delay it day by day. Suddenly his wrath goes forth, and in the time of vengeance you will be destroyed.",
      "links": "<a href='/AIV/23/55/6'>Isa. 55:6</a>; <a href='/AIV/19/95/7-8'>Ps. 95:7-8</a>",
      "comment": "Sense of urgency: don’t procrastinate repentance. The language of 'wrath' and 'vengeance' brings a sobering reminder of final judgment, harmonizing both literal preparation and spiritual readiness for encountering God."
    }
  ],
  "translatedAt": "2025-12-23T09:57:42.906Z"
}