{
  "book": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 19,
  "verses": [
    {
      "pk": 1933190,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 1,
      "text": "A workman fond of wine will never grow rich, and he who despises small things will fall little by little.",
      "links": "<a href='/AIV/20/21/17'>Prov. 21:17</a>; <a href='/AIV/42/16/10'>Luke 16:10</a>",
      "comment": "This verse reminds us that discipline and attention to detail are needed for spiritual and material growth. Jesus also honors faithfulness in small things (Luke 16:10). Small acts done faithfully participate in building up God’s kingdom."
    },
    {
      "pk": 1933191,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 2,
      "text": "Wine and women make men of understanding stumble, and he who keeps company with prostitutes grows very bold.",
      "links": "<a href='/AIV/20/31/3'>Prov. 31:3</a>; <a href='/AIV/20/23/31-32'>Prov. 23:31-32</a>",
      "comment": "Wisdom literature often warns against the dangers of excess wine and immoral relationships. See also Proverbs 31:3 about kings avoiding such dangers. The body is a temple (1 Cor. 6:19), so purity is a deep theme."
    },
    {
      "pk": 1933192,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 3,
      "text": "Moths and worms will inherit him, and a reckless soul will be snatched away.",
      "links": "<a href='/AIV/18/27/18-20'>Job 27:18-20</a>; <a href='/AIV/23/51/8'>Isa. 51:8</a>",
      "comment": "Using images from nature, the verse speaks of the end of those who act recklessly. Their fate is like that of all flesh (see Job 27 and Isa. 51:8)."
    },
    {
      "pk": 1933193,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 4,
      "text": "One who trusts quickly is light-minded; and one who sins does wrong against himself.",
      "links": "<a href='/AIV/20/14/15'>Prov. 14:15</a>",
      "comment": "Naiveté in trust can bring ruin, as can sin—Proverbs 14:15 echoes this: 'The simple believes every word.' Sin is always self-destructive."
    },
    {
      "pk": 1933194,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 5,
      "text": "Who rejoices in evil will be condemned, but he who resists pleasures crowns his life.",
      "links": "<a href='/AIV/20/28/14'>Prov. 28:14</a>; <a href='/AIV/59/1/12'>James 1:12</a>",
      "comment": "True blessedness comes from resisting sinful pleasures. This speaks to the importance of self-mastery in the Christian walk, a theme echoed throughout the apostles’ letters (James 1:12)."
    },
    {
      "pk": 1933195,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 6,
      "text": "He who hates gossip lessens evil, but whoever repeats a word breaks his own peace.",
      "links": "<a href='/AIV/20/11/13'>Prov. 11:13</a>; <a href='/AIV/59/3/5-6'>James 3:5-6</a>",
      "comment": "Controlling our speech is central to wisdom (James 3:5-6). Keeping confidences is a mark of spiritual maturity."
    },
    {
      "pk": 1933196,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 7,
      "text": "Do not explain the matter to friend or enemy, and unless it is a sin for you, do not reveal it.",
      "links": "<a href='/AIV/20/17/9'>Prov. 17:9</a>",
      "comment": "Prudence in speech prevents unnecessary strife. There is a strong biblical value placed on discretion (cf. Prov. 17:9)."
    },
    {
      "pk": 1933197,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 8,
      "text": "For you would hear dishonor, and having heard it, your spirit will be stabbed.",
      "links": "<a href='/AIV/19/55/3-4'>Ps. 55:3-4</a>",
      "comment": "Learning of shameful things can deeply wound. Psalm 55 expresses similar pain at betrayal."
    },
    {
      "pk": 1933198,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 9,
      "text": "If you have heard a word, let it die with you. Be assured, it will not burst you.",
      "links": "<a href='/AIV/20/10/19'>Prov. 10:19</a>",
      "comment": "Learning to keep silent preserves peace and relationships. See also Proverbs 10:19 on the wisdom of few words."
    },
    {
      "pk": 1933199,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 10,
      "text": "A fool will be in labor, like a child in childbirth, to bring forth something he heard, like an arrow stuck in a man’s thigh.",
      "links": "<a href='/AIV/20/18/8'>Prov. 18:8</a>",
      "comment": "The image here is of uncontrollable urge to gossip. Words can wound deeply, as Proverbs 18:8 teaches."
    },
    {
      "pk": 1933200,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 11,
      "text": "If you hear something against your neighbor, question it well; perhaps he did not do it. And if he did do it, do not repeat it.",
      "links": "<a href='/AIV/20/25/9'>Prov. 25:9</a>; <a href='/AIV/40/18/15'>Matt. 18:15</a>",
      "comment": "This verse anticipates Jesus’ teaching in Matthew 18:15 about first confronting a person privately. Mercy is to be shown before judgment."
    },
    {
      "pk": 1933201,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 12,
      "text": "If you heard something, let it die with you; do not be afraid, it will not crush you.",
      "links": "<a href='/AIV/20/17/27'>Prov. 17:27</a>",
      "comment": "Repeats the wisdom to keep silent, assuring that not speaking will not cause harm. Discretion is repeatedly valued in biblical wisdom literature."
    },
    {
      "pk": 1933202,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 13,
      "text": "A fool will travail over a word just as a woman in labor over a child.",
      "links": "<a href='/AIV/20/11/13'>Prov. 11:13</a>",
      "comment": "Repeats the idea that a fool cannot keep a secret; this is compared to the agony of childbirth, highlighting the power of restraint."
    },
    {
      "pk": 1933203,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 14,
      "text": "Like an arrow that sticks in a man’s thigh, so is a secret in a fool’s mouth.",
      "links": "<a href='/AIV/20/26/22'>Prov. 26:22</a>",
      "comment": "Words have power to do harm; repeated in Proverbs 26:22: 'The words of a whisperer are like delicious morsels.'"
    },
    {
      "pk": 1933204,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 15,
      "text": "Question a friend, maybe he did not do it, and if he did anything, so that he may not do it again.",
      "links": "<a href='/AIV/03/19/17'>Lev. 19:17</a>",
      "comment": "This echoes Leviticus 19:17 about correcting your neighbor out of love. Restoration, not condemnation, is the purpose."
    },
    {
      "pk": 1933205,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 16,
      "text": "Question your neighbor, for it may be that he did not say it, and if he did say it, that he may not say it again.",
      "links": "<a href='/AIV/20/25/9'>Prov. 25:9</a>",
      "comment": "Once again, the need to resolve matters directly and privately is reinforced, minimizing gossip and discord."
    },
    {
      "pk": 1933206,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 17,
      "text": "Question a friend, for often it is slander; do not believe everything you hear.",
      "links": "<a href='/AIV/20/18/8'>Prov. 18:8</a>",
      "comment": "Warns against credulity and spreading slander. Discretion and seeking truth are a spiritual discipline."
    },
    {
      "pk": 1933207,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 18,
      "text": "A man may slip without intending it. Who has not sinned with his tongue?",
      "links": "<a href='/AIV/59/3/2'>James 3:2</a>",
      "comment": "Acknowledges human weakness and frailty, especially concerning speech. James 3:2 echoes that 'we all stumble in many ways.'"
    },
    {
      "pk": 1933208,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 19,
      "text": "Blessed is the man who is protected from it, who has not slipped with his tongue, nor been wounded in sin.",
      "links": "<a href='/AIV/19/141/3'>Ps. 141:3</a>",
      "comment": "Righteousness is shown in self-control of speech. The Psalmist prays for God to 'set a guard over my mouth.'"
    },
    {
      "pk": 1933209,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 20,
      "text": "There is one who keeps silent but is found wise, and another detested for much talking.",
      "links": "<a href='/AIV/20/17/28'>Prov. 17:28</a>",
      "comment": "Consistent with the wisdom books: even a fool who remains silent is considered wise."
    },
    {
      "pk": 1933210,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 21,
      "text": "One who keeps silent, not knowing what to reply, and another who keeps silent, knowing when to speak.",
      "links": "<a href='/AIV/21/3/7'>Eccl. 3:7</a>",
      "comment": "Wisdom discerns the proper time for silence and speech (Eccl. 3:7)."
    },
    {
      "pk": 1933211,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 22,
      "text": "A wise man will keep silent until the right time, but a chatterer and fool misses the right moment.",
      "links": "<a href='/AIV/21/5/2'>Eccl. 5:2</a>",
      "comment": "Discernment and the timing of words is a hallmark of true wisdom."
    },
    {
      "pk": 1933212,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 23,
      "text": "He who speaks much will be hated; and he who takes authority upon himself will be hated.",
      "links": "<a href='/AIV/20/10/19'>Prov. 10:19</a>; <a href='/AIV/59/3/1'>James 3:1</a>",
      "comment": "Consistent with James 3:1, which warns that not many should be teachers because of stricter judgment. Humility is prized."
    },
    {
      "pk": 1933213,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 24,
      "text": "There is one who brings destruction though not out of malice; lacking wisdom, he will slip.",
      "links": "<a href='/AIV/19/19/12'>Ps. 19:12</a>",
      "comment": "Even unintended actions can cause harm. This points to the need for grace to cover sins of ignorance (see Psalm 19:12)."
    },
    {
      "pk": 1933214,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 25,
      "text": "There is one who keeps silent, judging as wise, and another who keeps silent, out of fear or weakness.",
      "links": "<a href='/AIV/21/3/7'>Eccl. 3:7</a>",
      "comment": "Silence can be either a mark of wisdom or of cowardice. The heart’s intent matters."
    },
    {
      "pk": 1933215,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 26,
      "text": "A man who covers his mouth pretends to be righteous, but his inward heart is revealed.",
      "links": "<a href='/AIV/40/15/18'>Matt. 15:18</a>",
      "comment": "Jesus echoes this—what proceeds from the heart defiles a man (see Matt. 15:18). Both words and silence can mask the real heart."
    },
    {
      "pk": 1933216,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 27,
      "text": "There is one who turns away his face and pretends not to hear, but when you are not watching, he will take advantage of you.",
      "links": "<a href='/AIV/20/16/28'>Prov. 16:28</a>",
      "comment": "Warns against dissemblance and deceit—Proverbs 16:28: 'A dishonest man spreads strife.'"
    },
    {
      "pk": 1933217,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 28,
      "text": "If for lack of power he is prevented from sinning, if he finds an opportunity, he will do evil.",
      "links": "<a href='/AIV/20/4/23'>Prov. 4:23</a>",
      "comment": "Guarding the heart is primary; righteousness is more than avoiding sin by chance. It must be chosen intentionally."
    },
    {
      "pk": 1933218,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 29,
      "text": "A man is known by his appearance, and a wise man's face is known by his countenance.",
      "links": "<a href='/AIV/21/8/1'>Eccl. 8:1</a>",
      "comment": "External appearance can reveal much, yet only God sees the heart (1 Sam. 16:7; cf. Eccl. 8:1 on wisdom's effect on the face)."
    },
    {
      "pk": 1933219,
      "translation": "AIV",
      "book": 51,
      "chapter": 19,
      "verse": 30,
      "text": "A man’s clothing, a smile, and how he walks show what he is.",
      "links": "<a href='/AIV/40/7/20'>Matt. 7:20</a>",
      "comment": "As Jesus says, 'By their fruits you will know them' (Matthew 7:20). Wisdom literature values outward expression that flows from inner virtue."
    }
  ],
  "translatedAt": "2025-12-23T09:58:54.406Z"
}