{
  "book": 28,
  "bookName": "Sirach",
  "bookAbbreviation": "Sir",
  "chapter": 50,
  "verses": [
    {
      "pk": 28050001,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 1,
      "text": "Simon, son of Onias, the high priest, repaired the house of the Lord in his lifetime, and in his days he fortified the temple.",
      "links": "<a href='/AIV/14/29/12'>2 Chr. 29:12</a>; <a href='/AIV/16/3/8'>Neh. 3:8</a>",
      "comment": "Simon II, a revered high priest, initiated building and fortifying efforts in Jerusalem, typifying the role of a spiritual leader as restorer and guardian of true worship."
    },
    {
      "pk": 28050002,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 2,
      "text": "He also laid the foundations for the wall surrounding the sanctuary and raised high the double height of the temple enclosure.",
      "links": "<a href='/AIV/16/3/1-32'>Neh. 3:1-32</a>",
      "comment": "The strengthening of the temple boundaries emphasizes the sacredness of worship and the need for clear separation between holy and common things, prefiguring the spiritual boundaries around the Church."
    },
    {
      "pk": 28050003,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 3,
      "text": "In his days a great reservoir, like a sea, was dug, encircled by bronze as a protection against fire from above.",
      "links": "<a href='/AIV/11/7/23-26'>1 Kgs. 7:23-26</a>",
      "comment": "The reservoir recalls the 'sea' in Solomon's temple (1 Kgs 7:23-26), a symbol of cleansing and preparation for offering, foreshadowing the role of sacraments for ongoing purification."
    },
    {
      "pk": 28050004,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 4,
      "text": "He cared for his people, protecting them from disaster, and strengthened the city against siege.",
      "links": "<a href='/AIV/19/122/7'>Ps. 122:7</a>",
      "comment": "The high priest acts as guardian, defending the people and city. This reflects Christ as the ultimate intercessor and shepherd (cf. John 10:11)."
    },
    {
      "pk": 28050005,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 5,
      "text": "How glorious he was, surrounded by his people, as he came out of the sanctuary!",
      "links": "<a href='/AIV/03/16/17'>Lev. 16:17</a>; <a href='/AIV/58/9/7'>Heb. 9:7</a>",
      "comment": "The high priest's emergence echoes the Day of Atonement, foreshadowing Christ, our high priest, who enters and emerges from the heavenly sanctuary for us (Heb. 9:24)."
    },
    {
      "pk": 28050006,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 6,
      "text": "He was like the morning star among the clouds, like the full moon at a festival season,",
      "links": "<a href='/AIV/19/89/37'>Ps. 89:37</a>; <a href='/AIV/40/2/2'>Matt. 2:2</a>",
      "comment": "The high priest as a luminary prefigures Christ, the 'bright morning star' (Rev. 22:16), and the illumination the true Church brings to the world."
    },
    {
      "pk": 28050007,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 7,
      "text": "like the sun shining on the temple of the Most High, and like the rainbow gleaming in glorious clouds,",
      "links": "<a href='/AIV/01/9/13'>Gen. 9:13</a>; <a href='/AIV/26/1/28'>Ezek. 1:28</a>",
      "comment": "Imagery of light and the rainbow signifies God's glory and covenant. The high priest reflects the divine presence, pointing toward Christ, the true temple and revelation of God's glory."
    },
    {
      "pk": 28050008,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 8,
      "text": "like roses in the days of spring, like lilies by a stream of water, like a branch of frankincense during the summer,",
      "links": "<a href='/AIV/22/2/1'>Song. 2:1</a>; <a href='/AIV/23/35/1-2'>Isa. 35:1-2</a>",
      "comment": "Floral imagery refers to the beauty and fragrance of holiness. The priesthood's role in offering incense hints at the prayers and offerings continuing in the one, true Church (Rev. 5:8)."
    },
    {
      "pk": 28050009,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 9,
      "text": "like fire and incense in the censer, like a golden vessel adorned with every kind of precious stone,",
      "links": "<a href='/AIV/02/30/7'>Ex. 30:7</a>; <a href='/AIV/66/8/3'>Rev. 8:3</a>",
      "comment": "Incense and gold symbolize prayer and holiness (cf. Ps. 141:2; Rev. 8:3-4). The use of valuable vessels in worship points to ongoing reverence toward holy things."
    },
    {
      "pk": 28050010,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 10,
      "text": "like an olive tree loaded with fruit, and like a cypress towering among the clouds.",
      "links": "<a href='/AIV/19/52/8'>Ps. 52:8</a>; <a href='/AIV/23/41/19'>Isa. 41:19</a>",
      "comment": "The olive tree and cypress are symbols of fruitfulness and endurance, traits of the righteous and the lasting leadership within the true continuity of God's people."
    },
    {
      "pk": 28050011,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 11,
      "text": "When he donned his glorious robe and clothed himself in perfect splendor, ascending the holy altar, he made the court of the sanctuary glorious.",
      "links": "<a href='/AIV/02/28/4'>Ex. 28:4</a>; <a href='/AIV/19/93/1'>Ps. 93:1</a>",
      "comment": "The priest's garments stress the dignity of the office instituted by God, anticipating Christ’s priesthood and the visible rituals that continue to honor God."
    },
    {
      "pk": 28050012,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 12,
      "text": "When he received the portions from the hands of his fellow priests, as he stood by the altar surrounded by the circle of his brothers, he was like a young cedar in Lebanon; and they encircled him like branches of palm trees.",
      "links": "<a href='/AIV/03/2/2'>Lev. 2:2</a>; <a href='/AIV/19/92/12'>Ps. 92:12</a>",
      "comment": "The unity of priests around the altar foreshadows participation in a higher liturgy and models the unity God desires for His people (John 17:21)."
    },
    {
      "pk": 28050013,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 13,
      "text": "All the sons of Aaron in their glorious attire, with the Lord’s offerings in their hands, stood before the whole assembly of Israel.",
      "links": "<a href='/AIV/02/28/1-43'>Ex. 28:1-43</a>; <a href='/AIV/03/9/22-23'>Lev. 9:22-23</a>",
      "comment": "The public role of offering sacrifice points to the priesthood’s function in mediating between God and His people, a ministry still central in the worship of the New Covenant."
    },
    {
      "pk": 28050014,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 14,
      "text": "When he had finished the service at the altars, arranging the offering of the Most High, the Almighty,",
      "links": "<a href='/AIV/03/1/7-9'>Lev. 1:7-9</a>; <a href='/AIV/58/5/1'>Heb. 5:1</a>",
      "comment": "The priestly function in offering sacrifices foreshadows the one perfect sacrifice of Christ, continually re-presented for the sanctification of the faithful."
    },
    {
      "pk": 28050015,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 15,
      "text": "he reached out his hand to the cup and poured out the drink offering of the blood of the grape; he poured it out at the foot of the altar, as a pleasing aroma to the Most High, the King of all.",
      "links": "<a href='/AIV/03/23/13'>Lev. 23:13</a>; <a href='/AIV/40/26/27-28'>Matt. 26:27-28</a>",
      "comment": "Pouring out wine as an offering prefigures the Eucharist, where Christ gives His blood for the forgiveness of sins, an act central to Christian worship."
    },
    {
      "pk": 28050016,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 16,
      "text": "Then the sons of Aaron shouted, they blew the trumpets of hammered silver, and made a mighty sound as a memorial before the Most High.",
      "links": "<a href='/AIV/04/10/2-10'>Num. 10:2-10</a>; <a href='/AIV/66/8/2'>Rev. 8:2</a>",
      "comment": "The trumpets mark sacred acts and memorials in worship, themes taken up in heaven’s liturgy and in the Church's own remembrance of Christ’s sacrifice."
    },
    {
      "pk": 28050017,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 17,
      "text": "Then all the people together hurried, and they fell with their faces to the ground to worship their Lord, the Almighty, the Most High God.",
      "links": "<a href='/AIV/03/9/24'>Lev. 9:24</a>; <a href='/AIV/66/7/11'>Rev. 7:11</a>",
      "comment": "Prostrate worship displays profound reverence, a posture mirrored by worshippers on earth and in heaven, reinforcing the call to humility before God."
    },
    {
      "pk": 28050018,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 18,
      "text": "The singers gave praise with their voices to make beautiful music, and the sound was sweet and full.",
      "links": "<a href='/AIV/14/5/12-13'>2 Chr. 5:12-13</a>; <a href='/AIV/19/150/1-6'>Ps. 150:1-6</a>",
      "comment": "Sacred music enriches Divine worship, echoing throughout salvation history and into the worship of heaven (cf. Rev. 14:2-3)."
    },
    {
      "pk": 28050019,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 19,
      "text": "The people all prayed together, and when the worship was over, they would bow and give thanks to their Lord, the Most High.",
      "links": "<a href='/AIV/19/95/6'>Ps. 95:6</a>; <a href='/AIV/52/5/18'>1 Thess. 5:18</a>",
      "comment": "Liturgy concludes in thanksgiving, showing both corporate and private worship has always involved structured praise, a tradition continued in the Christian life."
    },
    {
      "pk": 28050020,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 20,
      "text": "Then Simon would come down and lift his hands over the whole assembly of Israel, to give the Lord’s blessing from his lips and to glory in his name;",
      "links": "<a href='/AIV/04/6/23-27'>Num. 6:23-27</a>",
      "comment": "The blessing of the assembly is an ancient practice, continued in ministerial functions, pointing to Christ who confers ultimate blessing and peace (Luke 24:50)."
    },
    {
      "pk": 28050021,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 21,
      "text": "and all bowed in worship a second time to receive the blessing from the Most High.",
      "links": "<a href='/AIV/02/34/8'>Ex. 34:8</a>",
      "comment": "Receiving a priestly blessing signifies God acting through His chosen ministers, echoing Christ’s granting of peace and blessing upon His gathered disciples."
    },
    {
      "pk": 28050022,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 22,
      "text": "Now bless the God of all, who in every way does great things, who exalts our days from the womb and deals with us according to His mercy.",
      "links": "<a href='/AIV/19/103/1-5'>Ps. 103:1-5</a>; <a href='/AIV/42/1/68'>Luke 1:68</a>",
      "comment": "God’s mercy and blessing extend from womb to old age. Here is a call to perpetual gratitude, echoed in Mary’s Magnificat (Luke 1:46–55)."
    },
    {
      "pk": 28050023,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 23,
      "text": "May He grant us gladness of heart, and may there be peace in our days for Israel as long as the sun endures.",
      "links": "<a href='/AIV/19/72/5'>Ps. 72:5</a>; <a href='/AIV/43/14/27'>John 14:27</a>",
      "comment": "Peace and gladness are divine gifts, fulfilled in Christ’s gift of peace, which is not just external but spiritual (John 14:27)."
    },
    {
      "pk": 28050024,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 24,
      "text": "May He be merciful to us, and let Him redeem us in our days.",
      "links": "<a href='/AIV/19/130/7-8'>Ps. 130:7-8</a>; <a href='/AIV/42/1/68'>Luke 1:68</a>",
      "comment": "Prayer for mercy and redemption finds ultimate answer in the coming of the Redeemer, whose offering won eternal salvation."
    },
    {
      "pk": 28050025,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 25,
      "text": "There are two nations that my soul detests, and the third is not even a nation:",
      "links": "<a href='/AIV/18/34/7-9'>Job 34:7-9</a>",
      "comment": "The author’s denunciation underscores Israel’s unique calling and the dangers of division from true worship, a subtle call to maintain full unity in the one faith."
    },
    {
      "pk": 28050026,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 26,
      "text": "those who live in Seir, and the Philistines, and the foolish people who dwell in Shechem.",
      "links": "<a href='/AIV/08/15/1-2'>Judg. 15:1-2</a>; <a href='/AIV/43/4/9'>John 4:9</a>",
      "comment": "Reference to Shechem and other Gentiles reflects tension between Israel and surrounding peoples, later healed through Christ bringing all into His covenant (Eph. 2:14-18)."
    },
    {
      "pk": 28050027,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 27,
      "text": "Instruction in wise understanding and knowledge has been written in this book by Jesus, the son of Sirach, son of Eleazar, from Jerusalem, who poured out wisdom from his heart.",
      "links": "<a href='/AIV/20/1/1-7'>Prov. 1:1-7</a>",
      "comment": "The author’s attribution connects the wisdom here with other wisdom literature, emphasizing that sound teaching in faith and morals is meant to guide God’s people."
    },
    {
      "pk": 28050028,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 28,
      "text": "Blessed is the one who meditates on these things, and takes them to heart; he will become wise.",
      "links": "<a href='/AIV/19/1/2'>Ps. 1:2</a>; <a href='/AIV/59/1/5'>Jas. 1:5</a>",
      "comment": "Meditation on divine wisdom brings true understanding; it is through faithful adherence to revealed teaching that one grows wise."
    },
    {
      "pk": 28050029,
      "translation": "AIV",
      "book": 28,
      "bookName": "Sirach",
      "bookAbbreviation": "Sir",
      "chapter": 50,
      "verse": 29,
      "text": "If he practices them, he will be strong in all circumstances, for the light of the Lord is his path.",
      "links": "<a href='/AIV/19/119/105'>Ps. 119:105</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "Obedience to wisdom brings steadfastness, with the Lord Himself as guide—the true light, fulfilled perfectly in Christ (John 8:12), leading His people along the path of truth to everlasting life."
    }
  ],
  "translatedAt": "2025-12-24T07:50:20.112Z"
}