{
  "book": "Lamentations",
  "bookAbbreviation": "Lam",
  "chapter": 5,
  "verses": [
    {
      "pk": 1005001,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 1,
      "text": "Remember, O LORD, what has happened to us; look and see our disgrace.",
      "links": "<a href='/AIV/19/44/24'>Ps. 44:24</a>; <a href='/AIV/23/64/9'>Isa. 64:9</a>",
      "comment": "This verse begins as a prayer for God to notice the suffering of His people, recalling the psalms and the prophets where intercession is made for Israel. It emphasizes personal and communal lament."
    },
    {
      "pk": 1005002,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 2,
      "text": "Our inheritance has been turned over to strangers, our homes to foreigners.",
      "links": "<a href='/AIV/23/1/7'>Isa. 1:7</a>; <a href='/AIV/05/28/43'>Deut. 28:43'</a>",
      "comment": "Loss of inheritance echoes the covenant curses in Deuteronomy. The reversal of fortune is also linked to Israel’s sin and need for repentance."
    },
    {
      "pk": 1005003,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 3,
      "text": "We have become orphans, fatherless; our mothers are like widows.",
      "links": "<a href='/AIV/19/109/9'>Ps. 109:9</a>; <a href='/AIV/23/9/17'>Isa. 9:17</a>",
      "comment": "Describes the utter vulnerability and loss of protection of the people, connecting to the Torah’s call to care for orphans and widows (Deut 10:18)."
    },
    {
      "pk": 1005004,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 4,
      "text": "We must buy the water we drink; our wood is sold to us.",
      "links": "<a href='/AIV/05/28/48'>Deut. 28:48</a>",
      "comment": "Symbolized the total dispossession of God’s people—even basic needs come at a price. Exile away from the Promised Land’s blessings."
    },
    {
      "pk": 1005005,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 5,
      "text": "Those who pursue us are at our heels; we are weary and have no rest.",
      "links": "<a href='/AIV/05/28/65'>Deut. 28:65</a>; <a href='/AIV/19/6/6'>Ps. 6:6</a>",
      "comment": "Evokes both physical and spiritual exhaustion. The lack of rest connects to the spiritual rest promised in God, ultimately fulfilled in Christ (Heb. 4:9)."
    },
    {
      "pk": 1005006,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 6,
      "text": "We have submitted to Egypt and to Assyria, to get enough bread.",
      "links": "<a href='/AIV/24/2/18'>Jer. 2:18</a>; <a href='/AIV/28/7/11'>Hos. 7:11</a>",
      "comment": "Turning to foreign nations for help rather than to God reveals spiritual adultery. Israel’s history shows dependence should be upon God alone, not on pagan nations."
    },
    {
      "pk": 1005007,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 7,
      "text": "Our fathers sinned and are no more, and we bear their punishment.",
      "links": "<a href='/AIV/02/34/7'>Ex. 34:7</a>; <a href='/AIV/24/31/29-30'>Jer. 31:29–30</a>",
      "comment": "The collective consequences of sin are underscored. This reveals the depth of solidarity among the people, important for understanding the communal aspect of God’s covenant."
    },
    {
      "pk": 1005008,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 8,
      "text": "Slaves rule over us; there is no one to deliver us from their hand.",
      "links": "<a href='/AIV/19/106/41'>Ps. 106:41</a>; <a href='/AIV/23/3/4'>Isa. 3:4</a>",
      "comment": "The reversal of social order—God’s people are now subject to those who were once beneath them."
    },
    {
      "pk": 1005009,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 9,
      "text": "We risk our lives to get our bread, because of the sword in the wilderness.",
      "links": "<a href='/AIV/03/26/36'>Lev. 26:36</a>",
      "comment": "Survival itself is fraught with danger. This echoes the curse of living under constant threat and foreshadows New Testament teaching on spiritual warfare."
    },
    {
      "pk": 1005010,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 10,
      "text": "Our skin is hot as an oven, burned with the fever of famine.",
      "links": "<a href='/AIV/24/14/18'>Jer. 14:18</a>; <a href='/AIV/05/28/22'>Deut. 28:22</a>",
      "comment": "A vivid physical description connecting to the curses for breaking covenant (Deut. 28). Famine was frequently a sign of divine discipline."
    },
    {
      "pk": 1005011,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 11,
      "text": "Women in Zion are violated, virgins in the towns of Judah.",
      "links": "<a href='/AIV/23/13/16'>Isa. 13:16</a>",
      "comment": "Violence against women highlights the full extent of Jerusalem’s devastation. This compels the reader to reflect on the moral collapse that comes with rejecting God’s law."
    },
    {
      "pk": 1005012,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 12,
      "text": "Princes are hanged by their hands; elders are shown no respect.",
      "links": "<a href='/AIV/18/12/18'>Job 12:18</a>",
      "comment": "A total shaming of leadership. No one is exempt from judgment—human authority is powerless before divine justice."
    },
    {
      "pk": 1005013,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 13,
      "text": "Young men carry millstones, boys stumble under loads of wood.",
      "links": "<a href='/AIV/07/16/21'>Judg. 16:21</a>",
      "comment": "Represents forced labor and child suffering. The breakdown of society impacts the entire community."
    },
    {
      "pk": 1005014,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 14,
      "text": "The elders are gone from the city gate, the young men from their music.",
      "links": "<a href='/AIV/24/7/34'>Jer. 7:34</a>",
      "comment": "Loss of elders means loss of wisdom and order; loss of joy among the youth. God’s blessings are absent in the face of judgment."
    },
    {
      "pk": 1005015,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 15,
      "text": "Joy has left our hearts; our dancing has turned to mourning.",
      "links": "<a href='/AIV/19/30/11'>Ps. 30:11</a>; <a href='/AIV/23/24/11'>Isa. 24:11</a>",
      "comment": "A reversal of salvation imagery. Genuine joy is only restored after repentance and trust in God’s saving action."
    },
    {
      "pk": 1005016,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 16,
      "text": "The crown has fallen from our head. Woe to us, for we have sinned.",
      "links": "<a href='/AIV/19/89/39'>Ps. 89:39</a>; <a href='/AIV/23/3/1'>Isa. 3:1</a>",
      "comment": "Confession of sin is the key point here. The loss of kingship points to the need for a righteous ruler—fulfilled in Christ, the true King (Luke 1:32-33)."
    },
    {
      "pk": 1005017,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 17,
      "text": "Because of this our hearts are sick; because of these things our eyes grow dim:",
      "links": "<a href='/AIV/19/6/7'>Ps. 6:7</a>",
      "comment": "Deep internal grief over sin and its consequences. This is not just external suffering, but an affliction of the heart and soul."
    },
    {
      "pk": 1005018,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 18,
      "text": "for Mount Zion is desolate; jackals roam over it.",
      "links": "<a href='/AIV/19/74/3-8'>Ps. 74:3-8</a>; <a href='/AIV/23/34/13'>Isa. 34:13</a>",
      "comment": "The Holy Place is in ruins. Yet throughout the Bible, desolation precedes renewal, prefiguring ultimate restoration."
    },
    {
      "pk": 1005019,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 19,
      "text": "But you, O LORD, reign forever; your throne endures through all generations.",
      "links": "<a href='/AIV/19/102/12'>Ps. 102:12</a>; <a href='/AIV/66/11/15'>Rev. 11:15</a>",
      "comment": "Amid grief, God’s sovereignty is confessed. This points forward to the eternal kingship of Christ, echoing New Testament declarations of Jesus’ reign (Heb. 1:8)."
    },
    {
      "pk": 1005020,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 20,
      "text": "Why do you forget us forever, why do you forsake us for so long?",
      "links": "<a href='/AIV/19/13/1'>Ps. 13:1</a>; <a href='/AIV/24/14/19'>Jer. 14:19</a>",
      "comment": "The question expresses deep longing for God’s presence. Such laments are ultimately answered in the Incarnation, where God is truly with His people (Matthew 1:23)."
    },
    {
      "pk": 1005021,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 21,
      "text": "Restore us to yourself, O LORD, that we may be restored! Renew our days as of old—",
      "links": "<a href='/AIV/19/80/3'>Ps. 80:3</a>; <a href='/AIV/24/31/18'>Jer. 31:18</a>",
      "comment": "Restoration and renewal depend completely on God’s initiative. This anticipates the New Covenant and sacraments of grace that bring true restoration to God’s people (see Ezek. 36:26-27)."
    },
    {
      "pk": 1005022,
      "translation": "AIV",
      "book": 25,
      "chapter": 5,
      "verse": 22,
      "text": "unless you have utterly rejected us, and you remain exceedingly angry with us.",
      "links": "<a href='/AIV/23/54/7-8'>Isa. 54:7-8</a>; <a href='/AIV/19/77/7'>Ps. 77:7</a>",
      "comment": "The final note hangs between despair and hope, inviting trust that God’s steadfast love will ultimately prevail (Lam. 3:22-23). This creates the context for the expectation of a Redeemer who brings full reconciliation."
    }
  ],
  "translatedAt": "2025-12-23T06:46:15.767Z"
}