{
  "book": "Lamentations",
  "bookAbbreviation": "Lam",
  "chapter": 4,
  "verses": [
    {
      "pk": 1944001,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 1,
      "text": "How the gold has lost its luster, the fine gold is dimmed! The sacred stones are scattered at every street corner.",
      "links": "<a href='/AIV/19/74/7'>Ps. 74:7</a>; <a href='/AIV/25/1/10'>Lam. 1:10</a>",
      "comment": "Jerusalem’s former glory and the temple’s treasures are disgraced. Gold's fading shines a light on deep spiritual fall—a symbol for when God’s people abandon His presence."
    },
    {
      "pk": 1944002,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 2,
      "text": "The precious sons of Zion, worth their weight in fine gold, are now viewed as clay jars, made by a potter’s hand.",
      "links": "<a href='/AIV/23/13/12'>Isa. 13:12</a>; <a href='/AIV/24/18/4-6'>Jer. 18:4–6</a>",
      "comment": "The people once considered noble have become common; echoes of God as the potter (see Jer. 18:6). There’s a hint of the Incarnation—God takes humble form among men."
    },
    {
      "pk": 1944003,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 3,
      "text": "Even jackals offer their young the breast and nurse their cubs, but my people have become cruel, like ostriches in the wilderness.",
      "links": "<a href='/AIV/18/39/13-16'>Job 39:13–16</a>; <a href='/AIV/28/9/14'>Hos. 9:14</a>",
      "comment": "This verse highlights the depth of the moral collapse: even animals show more compassion than the people under judgment."
    },
    {
      "pk": 1944004,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 4,
      "text": "The tongue of a nursing infant sticks to the roof of its mouth for thirst; children beg for bread, but no one breaks it for them.",
      "links": "<a href='/AIV/05/28/57'>Deut. 28:57</a>; <a href='/AIV/25/2/12'>Lam. 2:12</a>",
      "comment": "The horrific famine fulfills covenant curses (see Deut. 28); the breakdown of care for the young is a sign of utter desolation."
    },
    {
      "pk": 1944005,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 5,
      "text": "Those who once feasted on delicacies perish in the streets; those brought up in scarlet embrace piles of ash.",
      "links": "<a href='/AIV/25/1/11'>Lam. 1:11</a>",
      "comment": "No matter one’s former status, all suffer alike in judgment. The reversal imagery foreshadows Christ’s own self-emptying and humility (Phil. 2:6–8)."
    },
    {
      "pk": 1944006,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 6,
      "text": "The punishment of the daughter of my people is greater than the judgment of Sodom, which was overthrown in a moment, with no hands turned to help her.",
      "links": "<a href='/AIV/01/19/24-25'>Gen. 19:24–25</a>; <a href='/AIV/05/29/23'>Deut. 29:23</a>",
      "comment": "Suffering in Jerusalem exceeds even Sodom’s destruction. Spiritual interpretation: rejecting the covenant brings the harshest consequences."
    },
    {
      "pk": 1944007,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 7,
      "text": "Her princes were purer than snow, whiter than milk; their bodies more ruddy than coral, their appearance was like sapphire.",
      "links": "<a href='/AIV/07/13/6'>Judg. 13:6</a>; <a href='/AIV/05/32/14'>Deut. 32:14</a>",
      "comment": "Describes the exalted state of the leaders before their fall. Purity here has both literal and spiritual meaning, echoing the biblical link between holiness and beauty."
    },
    {
      "pk": 1944008,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 8,
      "text": "Now their face is blacker than soot; they are not recognized in the streets; their skin clings to their bones, it has become as dry as wood.",
      "links": "<a href='/AIV/19/102/3-5'>Ps. 102:3–5</a>",
      "comment": "From splendor to disgrace. The physical decay is a sign of a deeper spiritual rupture—a pattern we later see restored in Christ’s own resurrection body."
    },
    {
      "pk": 1944009,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 9,
      "text": "Those killed by the sword are better off than those who die of hunger, who waste away, struck for lack of the fruits of the field.",
      "links": "<a href='/AIV/25/2/20'>Lam. 2:20</a>",
      "comment": "Death by sword is swift; famine brings slow agony. This contrast deepens the tragedy of God’s judgment when the nation is cut off from the land’s blessing."
    },
    {
      "pk": 1944010,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 10,
      "text": "The hands of compassionate women have boiled their own children; they became their food during the destruction of the daughter of my people.",
      "links": "<a href='/AIV/05/28/53'>Deut. 28:53</a>; <a href='/AIV/12/6/28-29'>2 Kings 6:28–29</a>",
      "comment": "The horror here is part of the covenant curse (Deut. 28). It warns that sin cuts people off from life itself—a reversal healed by Christ, who gives his own flesh for the life of the world (John 6:51)."
    },
    {
      "pk": 1944011,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 11,
      "text": "The LORD gave full vent to his wrath; he poured out his fierce anger. He kindled a fire in Zion, which consumed her foundations.",
      "links": "<a href='/AIV/23/64/11'>Isa. 64:11</a>; <a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "Divine judgment here points to God’s justice, but also His faithfulness in fulfilling His word. The theme of consuming fire recurs in both Testaments (Heb. 12:29)."
    },
    {
      "pk": 1944012,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 12,
      "text": "The kings of the earth did not believe, nor any of the inhabitants of the world, that an adversary or enemy could enter the gates of Jerusalem.",
      "links": "<a href='/AIV/23/5/5'>Isa. 5:5</a>; <a href='/AIV/19/48/4-8'>Ps. 48:4–8</a>",
      "comment": "Jerusalem’s fall was unimaginable—a warning against pride and self-sufficiency without God’s guidance."
    },
    {
      "pk": 1944013,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 13,
      "text": "All this happened because of the sins of her prophets and the iniquities of her priests, who shed the blood of the righteous within her.",
      "links": "<a href='/AIV/24/23/11-12'>Jer. 23:11–12</a>; <a href='/AIV/26/22/26'>Ezek. 22:26</a>",
      "comment": "The leaders’ sin brings collective disaster. This anticipates Christ’s condemnation of religious leaders (Matt. 23:35–37). Righteous blood is a key biblical theme."
    },
    {
      "pk": 1944014,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 14,
      "text": "They wandered blind in the streets; they were so defiled with blood that no one could touch their garments.",
      "links": "<a href='/AIV/03/21/1-12'>Lev. 21:1–12</a>; <a href='/AIV/19/82/5'>Ps. 82:5</a>",
      "comment": "Moral blindness and defilement separate the people from worship. Holiness laws are broken—a reminder of the need for pure, sacrificial mediation."
    },
    {
      "pk": 1944015,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 15,
      "text": "'Go away! Unclean!' people shouted at them; 'Away! Away! Do not touch!' So they became fugitives and wanderers; it was said among the nations, 'They shall stay here no longer.'",
      "links": "<a href='/AIV/03/13/45-46'>Lev. 13:45–46</a>",
      "comment": "Levitical language reflects how ritual impurity leads to exile, prefiguring deeper spiritual separation—something healed only by the work of Christ (see Hebrews 9:13–14)."
    },
    {
      "pk": 1944016,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 16,
      "text": "The LORD himself has scattered them; he no longer regards them. People do not respect the priests or show favor to the elders.",
      "links": "<a href='/AIV/24/13/24-27'>Jer. 13:24–27</a>",
      "comment": "Divine action is behind the exile. The loss of priestly authority points to the need for a divinely established and enduring mediatorial role."
    },
    {
      "pk": 1944017,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 17,
      "text": "As for us, our eyes grew dim, watching vainly for help; in our watching we watched for a nation that could not save.",
      "links": "<a href='/AIV/24/37/7'>Jer. 37:7</a>; <a href='/AIV/23/30/1-7'>Isa. 30:1–7</a>",
      "comment": "Misplaced trust in foreign powers brings only disappointment. True salvation comes from steadfast adherence to God's covenant and not from earthly alliances."
    },
    {
      "pk": 1944018,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 18,
      "text": "They hunted our steps, so that we could not walk in our streets; our end drew near; our days were numbered, for our end had come.",
      "links": "<a href='/AIV/25/1/20'>Lam. 1:20</a>",
      "comment": "The relentless pursuit by enemies reflects the fullness of God’s judgment, but also sets up the hope for mercy and redemption."
    },
    {
      "pk": 1944019,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 19,
      "text": "Our pursuers were swifter than the eagles of the sky; they chased us on the mountains, they lay in wait for us in the wilderness.",
      "links": "<a href='/AIV/24/4/13'>Jer. 4:13</a>",
      "comment": "No escape remained. Eagle imagery often points to judgment but also elsewhere hints at God's power to restore (see Isa. 40:31 for contrast)."
    },
    {
      "pk": 1944020,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 20,
      "text": "The LORD’s anointed, the breath of our life, was caught in their traps—he of whom we said, 'Under his shadow we shall live among the nations.'",
      "links": "<a href='/AIV/19/105/15'>Ps. 105:15</a>; <a href='/AIV/25/2/9'>Lam. 2:9'</a>",
      "comment": "Likely refers to the king, but points forward to the need for a suffering and victorious Anointed One. This foreshadows Christ, taken for the people’s sake."
    },
    {
      "pk": 1944021,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 21,
      "text": "Rejoice and be glad, O daughter of Edom, you who dwell in the land of Uz; but to you also the cup shall pass, you will become drunk and stripped naked.",
      "links": "<a href='/AIV/24/25/15-21'>Jer. 25:15–21</a>; <a href='/AIV/18/1/1'>Job 1:1</a>",
      "comment": "God’s justice is impartial; Edom’s temporary triumph will not last. The image of the 'cup' is often picked up in the New Testament concerning God’s wrath and Christ’s cup of suffering (Matthew 26:39)."
    },
    {
      "pk": 1944022,
      "translation": "AIV",
      "book": 25,
      "chapter": 4,
      "verse": 22,
      "text": "The punishment of your iniquity, O daughter of Zion, is accomplished; he will no longer keep you in exile. But he will punish your iniquity, O daughter of Edom; he will reveal your sins.",
      "links": "<a href='/AIV/25/1/22'>Lam. 1:22</a>; <a href='/AIV/28/1/6'>Hos. 1:6</a>",
      "comment": "Hope begins to dawn—exile will end for God’s people, but judgment continues for the unrepentant. This anticipates the restoration found in Christ’s resurrection and the full forgiveness held in store for those in the new covenant."
    }
  ],
  "translatedAt": "2025-12-23T06:45:46.503Z"
}