{
  "book": "Lamentations",
  "bookAbbreviation": "Lam",
  "chapter": 1,
  "verses": [
    {
      "pk": 2100001,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 1,
      "text": "How lonely sits the city, once full of people! She who was great among the nations is now like a widow; the princess among provinces has become a servant.",
      "links": "<a href='/AIV/23/47/8'>Isaiah 47:8</a>; <a href='/AIV/28/2/6'>Hosea 2:6</a>",
      "comment": "The opening verse sets a tone of mourning over Jerusalem, depicted as a widow now in servitude. Note the personification of the city as feminine, common in Hebrew poetry. The loss of status invokes themes of covenant and judgment that are echoed throughout the prophets."
    },
    {
      "pk": 2100002,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 2,
      "text": "She weeps bitterly at night, with tears on her cheeks; among all her lovers, there is no one to comfort her. All her friends have betrayed her; they have become her enemies.",
      "links": "<a href='/AIV/24/4/30'>Jer. 4:30</a>; <a href='/AIV/19/137/1'>Psalm 137:1</a>",
      "comment": "Jerusalem’s isolation signifies the abandonment even by those once allied to her, hinting at the spiritual fallout of infidelity to the covenant. 'Lovers' refers to political allies turned hostile—a metaphor for Israel's unfaithfulness."
    },
    {
      "pk": 2100003,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 3,
      "text": "Judah has gone into exile because of affliction and hard servitude; she dwells among the nations but finds no rest; her pursuers have overtaken her in the midst of her distress.",
      "links": "<a href='/AIV/05/28/65'>Deut. 28:65</a>; <a href='/AIV/24/52/27'>Jer. 52:27</a>",
      "comment": "Echoes covenant curses (Deut. 28). The scattering among nations prefigures a longing for ultimate restoration, a theme developed in later prophetic texts and seen fulfilled in New Testament promises."
    },
    {
      "pk": 2100004,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 4,
      "text": "The roads to Zion mourn, for no one comes to the appointed feasts; all her gates are desolate. Her priests groan, her virgins sorrow, and she herself suffers bitterly.",
      "links": "<a href='/AIV/24/9/1'>Jer. 9:1</a>; <a href='/AIV/19/42/4'>Ps. 42:4</a>",
      "comment": "The cessation of liturgical worship and pilgrimage to Zion underscores the loss of sacred rituals, pointing to the necessity of right worship and priestly intercession for spiritual renewal."
    },
    {
      "pk": 2100005,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 5,
      "text": "Her foes have become her master; her enemies prosper, because the LORD has afflicted her for the greatness of her transgressions. Her children have gone into exile before the adversary.",
      "links": "<a href='/AIV/24/30/14'>Jer. 30:14</a>; <a href='/AIV/09/2/7'>1 Sam. 2:7</a>",
      "comment": "God’s sovereign justice is emphasized as a cause for exile. Suffering here is presented as both consequence and opportunity for conversion and return, anticipating later doctrines of redemptive suffering."
    },
    {
      "pk": 2100006,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 6,
      "text": "From daughter Zion all her splendor has departed. Her princes have become like deer that find no pasture, fleeing without strength before the pursuer.",
      "links": "<a href='/AIV/24/39/4'>Jer. 39:4</a>; <a href='/AIV/19/42/1'>Ps. 42:1</a>",
      "comment": "Princely leadership is shown ineffective, suggesting the need for a new and faithful shepherd—a motif connected to messianic expectation and fulfilled in Christ."
    },
    {
      "pk": 2100007,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 7,
      "text": "Jerusalem remembers in her days of affliction and wandering all the precious things that were hers from days of old. Her people fell into the hand of her enemies, and there was no one to help her; enemies saw her and mocked at her downfall.",
      "links": "<a href='/AIV/19/137/7'>Ps. 137:7</a>; <a href='/AIV/24/30/14'>Jer. 30:14</a>",
      "comment": "Memory plays a critical role in biblical spirituality; recalling former blessings encourages repentance and a hope of restoration, as echoed in liturgical traditions and prayers."
    },
    {
      "pk": 2100008,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 8,
      "text": "Jerusalem sinned gravely; therefore she has become an object of scorn. All who honored her despise her, for they have seen her nakedness; and she herself groans and turns away.",
      "links": "<a href='/AIV/23/3/9'>Isaiah 3:9</a>; <a href='/AIV/19/44/13'>Ps. 44:13</a>",
      "comment": "Sin is presented not only as moral but as a cause for public humiliation, aligning with concepts of communal responsibility and ritual purification in the worshiping community."
    },
    {
      "pk": 2100009,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 9,
      "text": "Her uncleanness was in her skirts; she did not consider her end. Her fall was astonishing; there was no one to comfort her. 'O LORD, look at my distress, for the enemy has triumphed!'",
      "links": "<a href='/AIV/24/13/22'>Jer. 13:22</a>; <a href='/AIV/19/25/16'>Ps. 25:16</a>",
      "comment": "This lament highlights the consequences of forsaking God's law, and the cry for God to ‘look’ anticipates themes of divine compassion and intercession."
    },
    {
      "pk": 2100010,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 10,
      "text": "The enemy has stretched out his hand over all her precious things, for she has seen nations enter her sanctuary—those whom you commanded not to enter your assembly.",
      "links": "<a href='/AIV/19/79/1'>Ps. 79:1</a>; <a href='/AIV/04/18/4'>Num. 18:4</a>",
      "comment": "Sanctuary defilement points to the broken relationship between God and his people, underlining the importance of maintaining sacred boundaries and the holiness of worship."
    },
    {
      "pk": 2100011,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 11,
      "text": "All her people groan as they search for bread; they have given their precious things for food to restore their lives. 'Look, O LORD, and see, for I am despised.'",
      "links": "<a href='/AIV/19/22/1'>Ps. 22:1</a>; <a href='/AIV/24/5/17'>Jer. 5:17</a>",
      "comment": "Material desperation reflects spiritual destitution. The cry is reminiscent of the Psalms, connecting lament as a path to spiritual transformation and restoration."
    },
    {
      "pk": 2100012,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 12,
      "text": "'Is it nothing to you, all you who pass by? Look and see if there is any sorrow like my sorrow, which was brought upon me, which the LORD inflicted on the day of his fierce anger.'",
      "links": "<a href='/AIV/19/69/20'>Ps. 69:20</a>; <a href='/AIV/24/4/8'>Jer. 4:8</a>",
      "comment": "Jerusalem’s suffering is presented as unique, calling for empathy and contemplation—a motif later echoed in the suffering servant and Christ’s passion (<a href='/AIV/23/53/3'>Isaiah 53:3</a>)."
    },
    {
      "pk": 2100013,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 13,
      "text": "From on high he sent fire into my bones; he spread a net for my feet and turned me back; he left me desolate, faint all day long.",
      "links": "<a href='/AIV/19/38/3-8'>Ps. 38:3-8</a>; <a href='/AIV/05/32/22'>Deut. 32:22</a>",
      "comment": "Images of fire and entrapment recall divine judgment but also purification, implying suffering can be redemptive and transformative."
    },
    {
      "pk": 2100014,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 14,
      "text": "My transgressions are bound into a yoke; by his hand they are fastened together. They rise upon my neck; he has made my strength fail. The Lord delivered me into the hands of those I cannot withstand.",
      "links": "<a href='/AIV/23/47/6'>Isaiah 47:6</a>; <a href='/AIV/24/7/19'>Jer. 7:19</a>",
      "comment": "The yoke symbolism ties personal and collective sin with consequences, evoking New Testament imagery of freedom found in Christ’s yoke (<a href='/AIV/40/11/29'>Matt. 11:29</a>)."
    },
    {
      "pk": 2100015,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 15,
      "text": "The Lord rejected all my mighty men in my midst; he summoned an assembly against me to crush my young men. The Lord has trampled the virgin daughter of Judah as in a winepress.",
      "links": "<a href='/AIV/23/63/3'>Isaiah 63:3</a>; <a href='/AIV/24/6/11'>Jer. 6:11</a>",
      "comment": "The winepress imagery symbolizes judgment and is re-used in prophecy and the Book of Revelation (<a href='/AIV/66/14/19-20'>Rev. 14:19-20</a>). The loss of youth signifies devastating consequences for the chosen people."
    },
    {
      "pk": 2100016,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 16,
      "text": "For these things I weep; my eye, my eye pours out tears; for a comforter is far from me, one to revive my spirit. My children are desolate, for the enemy has prevailed.",
      "links": "<a href='/AIV/19/119/136'>Ps. 119:136</a>; <a href='/AIV/24/8/21'>Jer. 8:21</a>",
      "comment": "The lack of a comforter highlights the need for spiritual mediation and intercessory prayer, foundational themes in Christian worship."
    },
    {
      "pk": 2100017,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 17,
      "text": "Zion stretches out her hands, but there is no one to comfort her; the LORD has commanded against Jacob that his neighbors should become his foes; Jerusalem has become a filthy thing among them.",
      "links": "<a href='/AIV/24/6/22-24'>Jer. 6:22-24</a>; <a href='/AIV/19/79/4'>Ps. 79:4</a>",
      "comment": "Divine command directs even the nation’s fate; the lack of comfort is contrasted with later prophecies of consolation through Messiah, typified by Mary at the cross (<a href='/AIV/43/19/26-27'>John 19:26-27</a>)."
    },
    {
      "pk": 2100018,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 18,
      "text": "'The LORD is righteous, for I rebelled against his word; hear, all you peoples, and see my suffering. My young women and men have gone into captivity.'",
      "links": "<a href='/AIV/05/32/4'>Deut. 32:4</a>; <a href='/AIV/19/51/4'>Ps. 51:4</a>",
      "comment": "Public confession of God’s righteousness and personal rebellion provides a template for humble acknowledgment of sin and the communal need for sacramental reconciliation."
    },
    {
      "pk": 2100019,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 19,
      "text": "'I called to my lovers, but they deceived me; my priests and my elders perished in the city while they sought food for themselves to restore their lives.'",
      "links": "<a href='/AIV/24/2/25'>Jer. 2:25</a>; <a href='/AIV/26/7/26'>Ezek. 7:26'>",
      "comment": "Spiritual leadership is seen failing amidst crisis, prompting the necessity for authentic spiritual authority, a theme developed in apostolic tradition and New Testament leadership."
    },
    {
      "pk": 2100020,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 20,
      "text": "'Look, LORD, for I am in distress; my stomach churns, my heart is troubled within me, for I have been very rebellious. In the street the sword bereaves; in the house it is like death.'",
      "links": "<a href='/AIV/19/31/9'>Ps. 31:9</a>; <a href='/AIV/24/14/18'>Jer. 14:18</a>",
      "comment": "The holistic lament (body and soul) reflects biblical anthropology—a unity of physical and spiritual suffering pointing toward the doctrine of resurrection."
    },
    {
      "pk": 2100021,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 21,
      "text": "'They have heard my groaning, but there is no one to comfort me. All my enemies have heard of my trouble; they rejoice that you have done it. Bring the day you have announced; let them become like me!'",
      "links": "<a href='/AIV/19/13/2'>Ps. 13:2</a>; <a href='/AIV/24/17/18'>Jer. 17:18</a>",
      "comment": "Call for divine justice reflects the imprecatory Psalms. The cycle of suffering and vindication foreshadows the ultimate triumph of God’s righteousness and the victory of the faithful remnant."
    },
    {
      "pk": 2100022,
      "translation": "AIV",
      "book": 25,
      "chapter": 1,
      "verse": 22,
      "text": "'Let all their evil come before you; deal with them as you have dealt with me because of all my transgressions. My groans are many, and my heart is faint.'",
      "links": "<a href='/AIV/19/94/1-3'>Ps. 94:1-3</a>; <a href='/AIV/23/64/9'>Isaiah 64:9</a>",
      "comment": "The penitential tone concludes with an appeal for justice and recognition of personal failure, encouraging ongoing conversion, restoration, and hope in divine mercy."
    }
  ],
  "translatedAt": "2025-12-23T06:43:52.853Z"
}