{
  "book": "Lamentations",
  "bookAbbreviation": "Lam",
  "chapter": 2,
  "verses": [
    {
      "pk": 1942001,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 1,
      "text": "How the Lord in his anger has covered Daughter Zion with a cloud! He has cast down the splendor of Israel from heaven to earth and has not remembered his footstool on the day of his wrath.",
      "links": "<a href='/AIV/19/99/5'>Ps. 99:5</a>; <a href='/AIV/10/7/6'>2 Sam. 7:6</a>",
      "comment": "The 'footstool' refers to the temple, showing the seriousness of God's judgment in withdrawing his presence from Israel's place of worship. The language evokes awe at God's holiness and justice."
    },
    {
      "pk": 1942002,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 2,
      "text": "The Lord has swallowed up without pity all the dwellings of Jacob; in his wrath he has torn down the strongholds of Daughter Judah. He has brought down to the ground, he has dishonored the kingdom and its rulers.",
      "links": "<a href='/AIV/19/89/39'>Ps. 89:39</a>; <a href='/AIV/23/29/2'>Isa. 29:2</a>",
      "comment": "Here, royal authority and sacred places are brought low by God's hand, underscoring that no human institution stands apart from divine judgment."
    },
    {
      "pk": 1942003,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 3,
      "text": "He has cut off in fierce anger every horn of Israel; he has withdrawn his right hand in the face of the enemy. He has burned in Jacob like a flaming fire that devours everything around.",
      "links": "<a href='/AIV/19/75/10'>Ps. 75:10</a>; <a href='/AIV/26/15/6'>Ezek. 15:6</a>",
      "comment": "The 'horn' symbolizes strength and kingship. God's retraction of his saving hand points to the depth of abandonment Israel suffers as a result of sin."
    },
    {
      "pk": 1942004,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 4,
      "text": "He has bent his bow like an enemy; he has set his right hand like an adversary, and has slain all who were delightful to see. He has poured out his wrath like fire on the tent of Daughter Zion.",
      "links": "<a href='/AIV/19/64/7'>Ps. 64:7</a>; <a href='/AIV/23/13/8'>Isa. 13:8</a>",
      "comment": "The image of God as an enemy is shocking, emphasizing that persistent covenant unfaithfulness leads even to God’s opposition."
    },
    {
      "pk": 1942005,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 5,
      "text": "The Lord has become like an enemy; he has swallowed up Israel. He has demolished all its palaces, destroyed its strongholds, and multiplied grief and lamentation to Daughter Judah.",
      "links": "<a href='/AIV/23/5/5'>Isa. 5:5</a>; <a href='/AIV/26/7/21-22'>Ezek. 7:21–22</a>",
      "comment": "The destruction of palaces and defenses highlights the totality of the judgment, connecting to Jesus' foretelling of the Temple’s destruction (<a href='/AIV/40/24/2'>Matt. 24:2</a>)."
    },
    {
      "pk": 1942006,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 6,
      "text": "He has violently torn down his own dwelling like a garden; he has destroyed the place of assembly. The Lord has caused solemn feasts and Sabbaths to be forgotten in Zion, and in his fierce anger has rejected king and priest.",
      "links": "<a href='/AIV/19/74/7'>Ps. 74:7</a>; <a href='/AIV/19/89/38'>Ps. 89:38</a>",
      "comment": "The loss of feasts and Sabbath observance shows how worship is interrupted by judgment. Both king and priest suffer, indicating the need for a true Mediator between God and man (see <a href='/AIV/58/4/14'>Heb. 4:14</a>)."
    },
    {
      "pk": 1942007,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 7,
      "text": "The Lord has rejected his altar and abandoned his sanctuary; he has handed over the walls of her palaces to the enemy. They have raised a shout in the house of the LORD as on the day of a festival.",
      "links": "<a href='/AIV/19/78/60-61'>Ps. 78:60–61</a>; <a href='/AIV/24/21/10'>Jer. 21:10</a>",
      "comment": "God’s rejection of altar and sanctuary underscores that ritual alone is not enough; only right relationship with God matters. The invaders’ shouts profane a place set apart for worship."
    },
    {
      "pk": 1942008,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 8,
      "text": "The Lord has determined to destroy the wall of Daughter Zion; he measured and did not hold back his hand from demolishing. He made rampart and wall lament; together they waste away.",
      "links": "<a href='/AIV/23/5/5'>Isa. 5:5</a>; <a href='/AIV/19/80/12'>Ps. 80:12</a>",
      "comment": "The destruction is seen as purposeful and measured—it is not random punishment but just, planned judgment. The image of walls lamenting emphasizes the sorrow touching every part of Jerusalem."
    },
    {
      "pk": 1942009,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 9,
      "text": "Her gates have sunk into the ground; he has broken and destroyed her bars. Her king and her princes are among the nations; the Law is no more, and her prophets find no vision from the LORD.",
      "links": "<a href='/AIV/19/74/9'>Ps. 74:9</a>; <a href='/AIV/26/7/26'>Ezek. 7:26</a>",
      "comment": "With leaders exiled and prophetic vision halted, the people experience spiritual desolation—a foreshadowing of the longing for renewed revelation and true kingship (<a href='/AIV/43/1/14'>John 1:14</a>)."
    },
    {
      "pk": 1942010,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 10,
      "text": "The elders of Daughter Zion sit on the ground in silence; they have thrown dust on their heads and clothed themselves in sackcloth. The young women of Jerusalem bow their heads down to the ground.",
      "links": "<a href='/AIV/18/2/12'>Job 2:12</a>; <a href='/AIV/15/9/3'>Ezra 9:3</a>",
      "comment": "Expressions of mourning demonstrate deep sorrow for lost dignity. Silence before God’s judgment is recognized in Scripture as humble submission (<a href='/AIV/19/46/10'>Ps. 46:10</a>)."
    },
    {
      "pk": 1942011,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 11,
      "text": "My eyes are exhausted from weeping; my stomach churns, my heart pours itself out because of the destruction of my people, because children and infants faint in the streets of the city.",
      "links": "<a href='/AIV/19/6/6'>Ps. 6:6</a>; <a href='/AIV/24/9/1'>Jer. 9:1</a>",
      "comment": "The suffering of the most vulnerable—the children—heightens the tragedy and the urgent need for God’s mercy and restoration, pointing ahead to Christ’s compassion for the broken (<a href='/AIV/40/19/14'>Matt. 19:14</a>)."
    },
    {
      "pk": 1942012,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 12,
      "text": "They say to their mothers, 'Where is bread and wine?' as they faint like wounded men in the streets of the city, as their lives ebb away in their mothers’ arms.",
      "links": "<a href='/AIV/25/4/4'>Lam. 4:4</a>; <a href='/AIV/19/37/25'>Ps. 37:25</a>",
      "comment": "The lack of bread and wine during judgment is also significant, as these are staples of life and symbols of joy and covenant. It prefigures a longing for the true Bread and Wine given in the New Covenant (<a href='/AIV/43/6/35'>John 6:35</a>; <a href='/AIV/40/26/27'>Matt. 26:27</a>)."
    },
    {
      "pk": 1942013,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 13,
      "text": "What can I say for you, to what can I compare you, Daughter Jerusalem? To what can I liken you, that I may comfort you, Virgin Daughter Zion? For your wound is as deep as the sea. Who can heal you?",
      "links": "<a href='/AIV/19/77/2'>Ps. 77:2</a>; <a href='/AIV/23/1/6'>Isa. 1:6</a>",
      "comment": "The lament points to the inability of human efforts to heal spiritual brokenness. Only God provides true healing, a theme taken up fully in the ministry of Christ, the Divine Physician (<a href='/AIV/41/2/17'>Mark 2:17</a>)."
    },
    {
      "pk": 1942014,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 14,
      "text": "Your prophets have seen false and deceptive visions for you; they did not expose your iniquity to turn back your captivity, but saw for you oracles that were empty and misleading.",
      "links": "<a href='/AIV/24/23/16'>Jer. 23:16</a>; <a href='/AIV/26/13/6'>Ezek. 13:6</a>",
      "comment": "Authentic prophetic ministry must expose sin so God’s people can repent. When truth is withheld, judgment inevitably follows."
    },
    {
      "pk": 1942015,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 15,
      "text": "All who pass by clap their hands at you; they hiss and shake their heads at Daughter Jerusalem. 'Is this the city that was called the perfection of beauty, the joy of all the earth?'",
      "links": "<a href='/AIV/19/48/2'>Ps. 48:2</a>; <a href='/AIV/19/50/2'>Ps. 50:2</a>",
      "comment": "The mockery from outsiders reverses Jerusalem’s former glory, underscoring both the fleeting nature of earthly power and the deeper meaning of beauty restored in the heavenly city (<a href='/AIV/66/21/2'>Rev. 21:2</a>)."
    },
    {
      "pk": 1942016,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 16,
      "text": "All your enemies opened their mouths against you; they hiss and gnash their teeth. They say, 'We have swallowed her up! Surely this is the day we have long awaited. Now we have seen it.'",
      "links": "<a href='/AIV/19/35/21'>Ps. 35:21</a>; <a href='/AIV/19/124/3'>Ps. 124:3</a>",
      "comment": "Enemies gloat at Israel’s downfall, yet later prophecy and Christ’s life demonstrate that God brings redemption out of apparent defeat (<a href='/AIV/45/8/28'>Rom. 8:28</a>)."
    },
    {
      "pk": 1942017,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 17,
      "text": "The LORD has done what he planned; he has fulfilled his word which he commanded long ago. He has overthrown you without compassion, allowing the enemy to rejoice over you and has strengthened the might of your adversaries.",
      "links": "<a href='/AIV/26/5/13'>Ezek. 5:13</a>; <a href='/AIV/03/26/18'>Lev. 26:18</a>",
      "comment": "The fulfillment of prophetic warnings shows the faithfulness of God to both promise and warning. This prepares the narrative ground for restoration and the ultimate fulfillment of the promises in Christ."
    },
    {
      "pk": 1942018,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 18,
      "text": "Their hearts cried out to the Lord. O wall of Daughter Zion, let your tears flow like a river day and night; give yourself no relief, let your eyes have no rest.",
      "links": "<a href='/AIV/19/42/3'>Ps. 42:3</a>; <a href='/AIV/19/119/136'>Ps. 119:136</a>",
      "comment": "Persistent weeping is encouraged as prayerful lament, an essential spiritual discipline found throughout Scripture. True repentance is heartfelt and constant."
    },
    {
      "pk": 1942019,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 19,
      "text": "Arise, cry out in the night, at the beginning of the night watches; pour out your heart like water before the face of the Lord. Lift up your hands toward him for the lives of your children, who faint from hunger at every street corner.",
      "links": "<a href='/AIV/19/134/2'>Ps. 134:2</a>; <a href='/AIV/19/62/8'>Ps. 62:8</a>",
      "comment": "Nighttime prayer—watchful, fervent, and intercessory—is presented as vital. The lifting of hands and pouring out one’s heart prefigures forms of spiritual devotion carried forward into Christian worship."
    },
    {
      "pk": 1942020,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 20,
      "text": "Look, O LORD, and consider: Whom have you ever afflicted like this? Should women eat the offspring whom they care for? Should priest and prophet be killed in the sanctuary of the Lord?",
      "links": "<a href='/AIV/05/28/53'>Deut. 28:53</a>; <a href='/AIV/25/4/10'>Lam. 4:10</a>",
      "comment": "The horror under siege is depicted powerfully. Even those set apart for God—priests and prophets—share in judgment, underscoring the urgency of repentance and the necessity of a perfect sacrificial mediator."
    },
    {
      "pk": 1942021,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 21,
      "text": "Young and old lie together on the ground in the streets. My young men and maidens have fallen by the sword. On the day of your anger, you have killed them; you have slaughtered them without mercy.",
      "links": "<a href='/AIV/19/78/62'>Ps. 78:62</a>; <a href='/AIV/24/15/2'>Jer. 15:2</a>",
      "comment": "Generational destruction demonstrates that all bear the consequences of sin. Still, this drives the longing for a new and abiding mercy, later fulfilled in Christ."
    },
    {
      "pk": 1942022,
      "translation": "AIV",
      "book": 25,
      "chapter": 2,
      "verse": 22,
      "text": "You have summoned, as though to a festival day, terrors from every side. In the day of the LORD’s anger, no one escaped or survived; those whom I cared for and raised, my enemy has destroyed.",
      "links": "<a href='/AIV/19/31/13'>Ps. 31:13</a>; <a href='/AIV/25/1/15'>Lam. 1:15</a>",
      "comment": "Painful reversal of festival joy into judgment reveals the seriousness of God's holiness. Divine justice does not spare even the beloved, yet God’s plan through suffering anticipates ultimate redemption."
    }
  ],
  "translatedAt": "2025-12-23T06:44:23.919Z"
}