{
  "book": 31,
  "bookName": "Lamentations",
  "bookAbbreviation": "Lam",
  "chapter": 4,
  "verses": [
    {
      "pk": 31004001,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 1,
      "text": "How the gold has grown dim, how the pure gold is changed! The holy stones are scattered at the head of every street.",
      "links": "<a href='/AIV/25/2/19'>Lam. 2:19</a>; <a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "Here the gold and stones symbolize both physical riches and the dignity of Jerusalem's people. The term 'holy stones' may refer to those associated with the temple, alluding to the spiritual ruin resulting from sin and neglect of God's law."
    },
    {
      "pk": 31004002,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 2,
      "text": "The precious sons of Zion, worth their weight in fine gold, are now counted as earthen pots, the work of a potter’s hands.",
      "links": "<a href='/AIV/23/13/12'>Isa. 13:12</a>; <a href='/AIV/18/10/9'>Job 10:9</a>",
      "comment": "This mourns the loss of Israel’s glory. God's people, once precious, are now considered common and fragile. This links to the notion of spiritual transformation and dignity restored in Christ (cf. 1 Pet. 2:9)."
    },
    {
      "pk": 31004003,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 3,
      "text": "Even jackals offer their breasts, they nurse their young; but the daughter of my people has become cruel, like ostriches in the wilderness.",
      "links": "<a href='/AIV/23/49/15'>Isa. 49:15</a>; <a href='/AIV/18/39/13-16'>Job 39:13-16</a>",
      "comment": "The comparison highlights a loss of maternal compassion due to extreme suffering. Historically, ostriches were seen as neglectful mothers. This echoes God's lament for Israel’s hard-heartedness (cf. Hos. 11:1-4)."
    },
    {
      "pk": 31004004,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 4,
      "text": "The tongue of the nursing infant clings to the roof of its mouth because of thirst; the children beg for bread, but no one gives it to them.",
      "links": "<a href='/AIV/19/22/15'>Ps. 22:15</a>; <a href='/AIV/25/2/11-12'>Lam. 2:11-12</a>",
      "comment": "The dire conditions in Jerusalem recall the suffering described in Psalm 22, a passage with deep messianic significance, showing both literal and spiritual deprivation."
    },
    {
      "pk": 31004005,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 5,
      "text": "Those who once ate delicacies perish in the streets; those brought up in purple now lie on heaps of ash.",
      "links": "<a href='/AIV/25/1/7'>Lam. 1:7</a>; <a href='/AIV/26/27/7'>Ezek. 27:7</a>",
      "comment": "This contrasts the former luxury with present destitution, sobering evidence of how fleeting earthly treasures are when separated from God's favor."
    },
    {
      "pk": 31004006,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 6,
      "text": "For the punishment of the daughter of my people is greater than the punishment of Sodom, which was overthrown in a moment, though no hands struggled against her.",
      "links": "<a href='/AIV/01/19/24-25'>Gen. 19:24-25</a>; <a href='/AIV/40/11/23-24'>Matt. 11:23-24</a>",
      "comment": "Jerusalem’s suffering surpasses Sodom's. Both received judgment, but Jerusalem’s was slow and agonizing, warning of alienation from God. Christ references Sodom as a lesson for repentance (Matt. 11:24)."
    },
    {
      "pk": 31004007,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 7,
      "text": "Her princes were purer than snow, whiter than milk; their bodies were ruddy, their form like sapphire, now their appearance is darker than soot; they are not recognized in the streets.",
      "links": "<a href='/AIV/19/51/7'>Ps. 51:7</a>; <a href='/AIV/25/5/10'>Lam. 5:10</a>",
      "comment": "The dramatic shift in appearance suggests a profound loss of dignity brought about by sin and suffering—spiritually reminiscent of the human condition before and after Christ's redemptive work."
    },
    {
      "pk": 31004008,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 8,
      "text": "Their skin is shriveled on their bones; it has become as dry as wood.",
      "links": "<a href='/AIV/18/19/20'>Job 19:20</a>; <a href='/AIV/25/5/10'>Lam. 5:10</a>",
      "comment": "This portrays severe famine. The physical suffering invites spiritual reflection on the need for God’s restorative grace and the hope of resurrection (cf. Ezek. 37:1-14)."
    },
    {
      "pk": 31004009,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 9,
      "text": "Those slain by the sword are better than those who die of hunger, who waste away, pierced by lack of the fruits of the field.",
      "links": "<a href='/AIV/19/59/15'>Ps. 59:15</a>; <a href='/AIV/25/2/20'>Lam. 2:20</a>",
      "comment": "A sword death is swift, but hunger is endless suffering. The passage indirectly alludes to the necessity of physical and spiritual sustenance, ultimately fulfilled by Christ, the true bread of life (John 6:35)."
    },
    {
      "pk": 31004010,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 10,
      "text": "The hands of compassionate women have boiled their own children; they became their food in the destruction of the daughter of my people.",
      "links": "<a href='/AIV/05/28/53'>Deut. 28:53</a>; <a href='/AIV/12/6/28-29'>2 Kings 6:28-29</a>",
      "comment": "This tragic fulfillment of prophecy shows the utter horror of judgment, echoing curses warned in Deuteronomy. It illustrates how sin leads to dire consequences, demonstrating our need for mercy and redemption."
    },
    {
      "pk": 31004011,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 11,
      "text": "The LORD completed his wrath, he poured out his fierce anger. He kindled a fire in Zion that consumed its foundations.",
      "links": "<a href='/AIV/24/7/20'>Jer. 7:20</a>; <a href='/AIV/19/79/5'>Ps. 79:5</a>",
      "comment": "God's judgment reaches its course: wrath fulfilled. The consuming fire reminds us of divine justice and purification, themes echoed in the New Testament's teaching on refining trials (1 Pet. 1:7)."
    },
    {
      "pk": 31004012,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 12,
      "text": "The kings of the earth did not believe, nor any of the world’s inhabitants, that the adversary and the enemy could enter the gates of Jerusalem.",
      "links": "<a href='/AIV/19/48/4-5'>Ps. 48:4-5</a>; <a href='/AIV/25/1/9'>Lam. 1:9</a>",
      "comment": "Jerusalem seemed invincible, yet fell. This foreshadows how even strongholds fall without God’s protection, recalling Jesus’ prophecies regarding Jerusalem (Luke 19:41-44)."
    },
    {
      "pk": 31004013,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 13,
      "text": "This happened because of the sins of her prophets and the iniquities of her priests, who shed within her the blood of the righteous.",
      "links": "<a href='/AIV/23/9/17'>Isa. 9:17</a>; <a href='/AIV/26/22/26'>Ezek. 22:26</a>",
      "comment": "Sin corrupts even spiritual leaders. The blood of the righteous prefigures Christ’s own rejection by those meant to preserve holiness—a call to recognize God’s ongoing guidance through valid spiritual authority."
    },
    {
      "pk": 31004014,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 14,
      "text": "They wander blindly in the streets, defiled with blood, so that none can touch their garments.",
      "links": "<a href='/AIV/03/13/45-46'>Lev. 13:45-46</a>; <a href='/AIV/24/14/8'>Jer. 14:8</a>",
      "comment": "Spiritual blindness through sin is depicted here. The image is reminiscent of lepers separated from the community, indicating the seriousness of spiritual uncleanness and the need for sacramental restoration."
    },
    {
      "pk": 31004015,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 15,
      "text": "Away! Unclean! they cry at them. Away, away, do not touch! So they became fugitives and wanderers; people say among the nations, 'They shall not dwell with us.'",
      "links": "<a href='/AIV/03/13/45'>Lev. 13:45</a>; <a href='/AIV/19/109/10'>Ps. 109:10</a>",
      "comment": "Those corrupted are cast out for impurity. This underscores the concept of holiness and separation, a theme amplified in the life and actions of Christ (cf. Mark 1:40-42), who restored the outcast."
    },
    {
      "pk": 31004016,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 16,
      "text": "The LORD himself scattered them; he regards them no more. They did not honor the priests nor show favor to the elders.",
      "links": "<a href='/AIV/24/29/18'>Jer. 29:18</a>; <a href='/AIV/19/106/16'>Ps. 106:16</a>",
      "comment": "This verse highlights the loss of divine favor due to disregard for divinely established hierarchy and spiritual leadership, suggesting the importance of adhering to the structure God sets within His people."
    },
    {
      "pk": 31004017,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 17,
      "text": "Still our eyes failed, watching for help in vain; in our watching we watched for a nation that could not save.",
      "links": "<a href='/AIV/23/30/1-3'>Isa. 30:1-3</a>; <a href='/AIV/25/4/22'>Lam. 4:22</a>",
      "comment": "Dependence on worldly assistance proves futile when God is neglected. This recalls Israel’s alliances with foreign nations, which could not save them, and points ahead to the sole saving work of Christ."
    },
    {
      "pk": 31004018,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 18,
      "text": "They hunted our steps so that we could not walk in our streets. Our end drew near; our days were finished, for our end had come.",
      "links": "<a href='/AIV/19/143/7'>Ps. 143:7</a>; <a href='/AIV/25/1/20'>Lam. 1:20</a>",
      "comment": "Freedom and hope are lost, signifying the consequence of persistent sin. Yet, such distress often drives hearts to repentance and prayer for divine intervention."
    },
    {
      "pk": 31004019,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 19,
      "text": "Our pursuers were swifter than eagles in the sky; they chased us over the mountains, they lay in wait for us in the wilderness.",
      "links": "<a href='/AIV/05/28/49'>Deut. 28:49</a>; <a href='/AIV/25/3/52'>Lam. 3:52</a>",
      "comment": "The enemies’ relentless pursuit echoes prophecy in Deuteronomy about foreign nations. The spiritual implication is that sin separates us and leaves us vulnerable without God’s protection."
    },
    {
      "pk": 31004020,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 20,
      "text": "The breath of our nostrils, the LORD’s anointed, was captured in their pits, he of whom we said, 'Under his shadow we shall live among the nations.'",
      "links": "<a href='/AIV/10/19/21'>2 Sam. 19:21</a>; <a href='/AIV/25/2/9'>Lam. 2:9</a>",
      "comment": "Most interpret 'the LORD’s anointed' as the king, but it reminds us of the messianic hope and points ahead to the ultimate anointed one, Christ. Living 'under his shadow' hints at protection and sacramental mediation."
    },
    {
      "pk": 31004021,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 21,
      "text": "Rejoice and be glad, O daughter of Edom, you who dwell in the land of Uz; but to you also the cup shall pass—you shall become drunk and strip yourself bare.",
      "links": "<a href='/AIV/35/2/16'>Hab. 2:16</a>; <a href='/AIV/19/60/3'>Ps. 60:3</a>",
      "comment": "Edom’s momentary triumph will end in judgment—the 'cup' symbolizes God’s wrath. This links to the imagery of the cup Christ drank for humanity’s redemption (Matt. 26:39)."
    },
    {
      "pk": 31004022,
      "translation": "AIV",
      "book": 31,
      "bookName": "Lamentations",
      "bookAbbreviation": "Lam",
      "chapter": 4,
      "verse": 22,
      "text": "Your punishment, O daughter of Zion, is accomplished; he will keep you in exile no longer. But your iniquity, O daughter of Edom, he will punish; he will uncover your sins.",
      "links": "<a href='/AIV/24/46/27'>Jer. 46:27</a>; <a href='/AIV/23/40/2'>Isa. 40:2</a>",
      "comment": "Restoration is promised to Zion—judgment is not forever. This foreshadows God’s mercy and the restoration of his people, fulfilled ultimately through Christ in the new covenant. The uncovering of Edom’s sin points to universal accountability before God’s justice."
    }
  ],
  "translatedAt": "2025-12-24T08:54:04.141Z"
}