{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 17,
  "verses": [
    {
      "pk": 4301701,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 1,
      "text": "After passing through Amphipolis and Apollonia, they came to Thessalonica, where there was a synagogue of the Jews.",
      "links": "<a href='/AIV/52/1/1'>1 Thess. 1:1</a>",
      "comment": "Paul often began his ministry in synagogues, emphasizing the continuity between Old Testament faith and Christ’s fulfillment (cf. Rom. 1:16)."
    },
    {
      "pk": 4301702,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 2,
      "text": "And as was his custom, Paul went in, and for three Sabbaths he reasoned with them from the Scriptures,",
      "links": "<a href='/AIV/44/13/5'>Acts 13:5</a>",
      "comment": "Paul’s reasoning over three Sabbaths highlights the importance of Scriptural tradition in conversion and catechesis."
    },
    {
      "pk": 4301703,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 3,
      "text": "explaining and proving that it was necessary for the Messiah to suffer and to rise from the dead, and saying, 'This Jesus, whom I proclaim to you, is the Messiah.'",
      "links": "<a href='/AIV/42/24/26'>Luke 24:26</a>; <a href='/AIV/23/53/3-11'>Isaiah 53:3-11</a> ; <a href='/AIV/19/16/10'>Psalm 16:10</a>",
      "comment": "Paul uses Old Testament prophecies to show Jesus was to suffer and rise. This demonstrates both a literal and spiritual fulfillment of prophecy."
    },
    {
      "pk": 4301704,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 4,
      "text": "Some of them were persuaded and joined Paul and Silas, along with a large number of God-fearing Greeks and quite a few prominent women.",
      "links": "<a href='/AIV/44/16/14'>Acts 16:14</a>; <a href='/AIV/44/13/48'>Acts 13:48</a>",
      "comment": "The Gospel draws both Jews and gentile God-fearers—the early inclusion of diverse peoples prefigures the universality of the Church."
    },
    {
      "pk": 4301705,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 5,
      "text": "But the Jews became jealous, and rounding up some wicked men from the marketplace, they started a riot in the city. They attacked Jason’s house, seeking to bring them out to the crowd.",
      "links": "<a href='/AIV/44/13/45'>Acts 13:45</a>",
      "comment": "Opposition often arises when the message of Christ threatens the powers and prejudices of the age."
    },
    {
      "pk": 4301706,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 6,
      "text": "When they did not find them, they dragged Jason and some brothers before the city officials, shouting, 'These men who have turned the world upside down have come here, too.'",
      "links": "<a href='/AIV/44/16/20'>Acts 16:20</a>",
      "comment": "The Gospel’s spread is seen as revolutionary, threatening existing order—yet ultimately bringing true peace (cf. John 14:27)."
    },
    {
      "pk": 4301707,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 7,
      "text": "And Jason has welcomed them, and they all act against Caesar’s decrees, saying that there is another king—Jesus.",
      "links": "<a href='/AIV/43/18/36-37'>John 18:36-37</a>",
      "comment": "Early Christians openly confessed the kingship of Jesus, implying loyalty to a higher, spiritual authority."
    },
    {
      "pk": 4301708,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 8,
      "text": "The people and the city officials were disturbed when they heard these things.",
      "links": "",
      "comment": "The proclamation of Christ as King was radical at the time, hinting at the eventual transformation of government and culture through the faith."
    },
    {
      "pk": 4301709,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 9,
      "text": "After taking money as security from Jason and the others, they let them go.",
      "links": "",
      "comment": "Jason’s willingness to suffer loss for the faith shows the cost of discipleship and the endurance of the Christian community."
    },
    {
      "pk": 4301710,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 10,
      "text": "That very night, the brothers sent Paul and Silas away to Berea. When they arrived, they went into the Jewish synagogue.",
      "links": "<a href='/AIV/44/17/2'>Acts 17:2</a>",
      "comment": "Persecution led to further missionary activity, showing God can use even opposition for the spread of the Gospel."
    },
    {
      "pk": 4301711,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 11,
      "text": "Now these Jews were more noble than those in Thessalonica, for they received the word with eagerness, examining the Scriptures daily to see if these things were so.",
      "links": "<a href='/AIV/19/1/2'>Ps. 1:2</a>",
      "comment": "The Bereans’ diligent study under apostolic preaching shows the value of authoritative teaching and Scriptural inquiry together."
    },
    {
      "pk": 4301712,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 12,
      "text": "Many of them therefore believed, along with not a few prominent Greek women and men.",
      "links": "",
      "comment": "The faith’s ability to attract people of influence hints at the transforming power of the Gospel for entire societies."
    },
    {
      "pk": 4301713,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 13,
      "text": "But when the Jews from Thessalonica learned that the word of God was being proclaimed by Paul in Berea, they came there too, stirring up and agitating the crowds.",
      "links": "",
      "comment": "Persistence of opposition highlights the need for perseverance; through adversity, the mission continues to grow."
    },
    {
      "pk": 4301714,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 14,
      "text": "Then immediately the brothers sent Paul away to the coast, but Silas and Timothy remained there.",
      "links": "<a href='/AIV/44/15/40'>Acts 15:40</a>",
      "comment": "Paul’s allies play essential roles; the early Church’s communal action is foundational to its mission."
    },
    {
      "pk": 4301715,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 15,
      "text": "Those who escorted Paul brought him as far as Athens, and after receiving instructions for Silas and Timothy to come to him as soon as possible, they departed.",
      "links": "<a href='/AIV/44/18/5'>Acts 18:5</a>",
      "comment": "Paul’s leadership and planning provide a model for apostolic succession and structure in Church evangelism."
    },
    {
      "pk": 4301716,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 16,
      "text": "Now while Paul was waiting for them in Athens, his spirit was provoked within him as he saw that the city was full of idols.",
      "links": "<a href='/AIV/05/6/14'>Deut. 6:14</a>",
      "comment": "Paul’s zeal against idolatry echoes the prophets and underlines the uniqueness of true worship."
    },
    {
      "pk": 4301717,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 17,
      "text": "So he reasoned in the synagogue with the Jews and the devout persons, and in the marketplace every day with those who happened to be there.",
      "links": "<a href='/AIV/44/13/16'>Acts 13:16</a>",
      "comment": "The universality of the message is seen in reaching both Jews and gentiles, and in the public witness given daily."
    },
    {
      "pk": 4301718,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 18,
      "text": "Some of the Epicurean and Stoic philosophers also conversed with him. And some said, 'What does this babbler wish to say?' Others said, 'He seems to be a proclaimer of foreign divinities,' because he was preaching Jesus and the resurrection.",
      "links": "<a href='/AIV/44/4/2'>Acts 4:2</a>; <a href='/AIV/46/1/23'>1 Cor. 1:23</a>",
      "comment": "The apostles’ message of Christ and the resurrection initially sounded strange to Greek philosophers—yet it would become the center of western culture."
    },
    {
      "pk": 4301719,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 19,
      "text": "And they took him and brought him to the Areopagus, saying, 'May we know what this new teaching is that you are presenting?'",
      "links": "",
      "comment": "The Areopagus was the premier court and forum for ideas—Paul is given a significant platform to proclaim the Gospel."
    },
    {
      "pk": 4301720,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 20,
      "text": "'For you bring some strange things to our ears. We wish to know, therefore, what these things mean.'",
      "links": "",
      "comment": "Openness to new ideas provided the opportunity for the Gospel to be preached among the learned."
    },
    {
      "pk": 4301721,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 21,
      "text": "Now all the Athenians and the foreigners who lived there would spend their time in nothing except telling or hearing something new.",
      "links": "",
      "comment": "Paul’s approach fits his hearers—he meets people where they are, a form of evangelization through dialogue."
    },
    {
      "pk": 4301722,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 22,
      "text": "Then Paul stood in the middle of the Areopagus and said: 'Men of Athens, I perceive that you are very religious in every way.'",
      "links": "",
      "comment": "Paul affirms their search for the divine, beginning with common ground—a model for apologetic engagement."
    },
    {
      "pk": 4301723,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 23,
      "text": "'For as I passed along and observed the objects of your worship, I found also an altar with this inscription: “To an unknown god.” What therefore you worship as unknown, this I proclaim to you.'",
      "links": "",
      "comment": "Paul uses their altar as a bridge to proclaim the true God—Christianity fulfills humanity’s search for the divine."
    },
    {
      "pk": 4301724,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 24,
      "text": "'The God who made the world and everything in it, being Lord of heaven and earth, does not live in temples made by human hands,'",
      "links": "<a href='/AIV/01/1/1'>Gen. 1:1</a>; <a href='/AIV/11/8/27'>1 Kings 8:27</a>",
      "comment": "Paul proclaims the Creator God, transcending pagan temple worship, referencing Old Testament revelation."
    },
    {
      "pk": 4301725,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 25,
      "text": "'Nor is he served by human hands, as though he needed anything, since he himself gives to all mankind life and breath and everything.'",
      "links": "<a href='/AIV/19/50/12'>Ps. 50:12</a>; <a href='/AIV/23/42/5'>Isa. 42:5</a>",
      "comment": "God’s self-sufficiency and providence are underlined; worship is our response to God's initiative, not mere ritual."
    },
    {
      "pk": 4301726,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 26,
      "text": "'And he made from one man every nation of mankind to live on all the face of the earth, having determined allotted periods and the boundaries of their dwelling place,'",
      "links": "<a href='/AIV/01/3/20'>Gen. 3:20</a>; <a href='/AIV/05/32/8'>Deut. 32:8</a>",
      "comment": "The unity of mankind is emphasized, which anticipates the global unity of Christ’s Church."
    },
    {
      "pk": 4301727,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 27,
      "text": "'so that they should seek God, and perhaps feel their way toward him and find him. Yet he is not far from each one of us,'",
      "links": "<a href='/AIV/24/23/23'>Jer. 23:23</a>",
      "comment": "God’s nearness and desire for relationship are deeply personal and universal—inviting all to seek him."
    },
    {
      "pk": 4301728,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 28,
      "text": "'For “In him we live and move and have our being”; as even some of your own poets have said, “For we are indeed his offspring.”'",
      "links": "<a href='/AIV/05/32/6'>Deut. 32:6</a>; <a href='/AIV/23/64/8'>Isa. 64:8</a>",
      "comment": "Paul integrates Greek culture to reveal God’s deeper truth, showing that natural reason and revelation are not opposed."
    },
    {
      "pk": 4301729,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 29,
      "text": "'Being then God’s offspring, we ought not to think that the divine nature is like gold, or silver, or stone, an image formed by human art and imagination.'",
      "links": "<a href='/AIV/02/20/4'>Exodus 20:4</a>",
      "comment": "Paul teaches against idolatry, in line with the Ten Commandments. Faith seeks the living God."
    },
    {
      "pk": 4301730,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 30,
      "text": "'The times of ignorance God overlooked, but now he commands all people everywhere to repent,'",
      "links": "<a href='/AIV/42/24/47'>Luke 24:47</a>",
      "comment": "God’s universal call to repentance is linked to the coming of Christ; repentance is not optional but necessary."
    },
    {
      "pk": 4301731,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 31,
      "text": "'because he has fixed a day on which he will judge the world in righteousness by a man whom he has appointed; and he has given assurance to all by raising him from the dead.'",
      "links": "<a href='/AIV/19/9/8'>Ps. 9:8</a>; <a href='/AIV/40/25/31-32'>Matt. 25:31-32</a>; <a href='/AIV/44/2/24'>Acts 2:24</a>",
      "comment": "The risen Christ is appointed as judge—a strong implicit claim to Jesus’ divinity and fulfillment of prophecy."
    },
    {
      "pk": 4301732,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 32,
      "text": "Now when they heard of the resurrection of the dead, some mocked, but others said, 'We will hear you again about this.'",
      "links": "",
      "comment": "The resurrection is the central claim of apostolic preaching; it divides listeners and calls for a response."
    },
    {
      "pk": 4301733,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 33,
      "text": "So Paul went out from their midst.",
      "links": "",
      "comment": "The seed of the Gospel had been sown; not all believed immediately, but some hearts were prepared."
    },
    {
      "pk": 4301734,
      "translation": "AIV",
      "book": 44,
      "chapter": 17,
      "verse": 34,
      "text": "But some men joined him and believed, among whom also were Dionysius the Areopagite and a woman named Damaris, and others with them.",
      "links": "",
      "comment": "The faith immediately gathers a community, including both men and women, and figures like Dionysius who would later be revered in Christian tradition."
    }
  ],
  "translatedAt": "2025-12-23T03:23:55.514Z"
}