{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 2,
  "verses": [
    {
      "pk": 2100201,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 1,
      "text": "When the day of Pentecost arrived, they were all together in one place.",
      "links": "<a href='/AIV/3/23/15-21'>Lev. 23:15-21</a>; <a href='/AIV/44/1/14'>Acts 1:14</a>",
      "comment": "Pentecost was a Jewish feast celebrating the harvest and the giving of the Law. The disciples were unified and waiting as Jesus had instructed. This unity reflects the communal nature of the early Church."
    },
    {
      "pk": 2100202,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 2,
      "text": "Suddenly a sound came from heaven, like a mighty rushing wind, and it filled the whole house where they were sitting.",
      "links": "<a href='/AIV/43/3/8'>John 3:8</a>; <a href='/AIV/26/37/9'>Ezek. 37:9</a>",
      "comment": "The wind symbolizes the Spirit’s power and presence. Similar imagery is seen in the Old Testament, where the Spirit revives and empowers, pointing to God’s direct action."
    },
    {
      "pk": 2100203,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 3,
      "text": "Then divided tongues as of fire appeared to them, and rested on each one of them.",
      "links": "<a href='/AIV/40/3/11'>Matt. 3:11</a>; <a href='/AIV/2/3/2'>Ex. 3:2</a>",
      "comment": "Fire represents purification and divine presence. The resting of the ‘tongues’ on all believers highlights the Spirit's universal gift to the Church."
    },
    {
      "pk": 2100204,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 4,
      "text": "All of them were filled with the Holy Spirit and began to speak in other languages, as the Spirit enabled them.",
      "links": "<a href='/AIV/44/1/5'>Acts 1:5</a>; <a href='/AIV/44/10/46'>Acts 10:46</a>",
      "comment": "The Spirit empowers believers with gifts, fulfilling Jesus’ promise. This event reverses Babel (Gen. 11:9), signifying the universal mission of the Church to every nation."
    },
    {
      "pk": 2100205,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 5,
      "text": "Now there were staying in Jerusalem devout men from every nation under heaven.",
      "links": "<a href='/AIV/44/8/27'>Acts 8:27</a>; <a href='/AIV/44/21/15'>Acts 21:15</a>",
      "comment": "The global gathering in Jerusalem prepared the way for the gospel's universal spread. This foreshadows the Church’s worldwide reach."
    },
    {
      "pk": 2100206,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 6,
      "text": "When they heard the sound, a crowd came together in confusion, because each one heard them speaking in his own language.",
      "links": "<a href='/AIV/44/2/11'>Acts 2:11</a>; <a href='/AIV/1/11/7-9'>Gen. 11:7-9</a>",
      "comment": "Here, the miracle of languages points to the undoing of Babel's division and anticipates the unity of all peoples in the Church."
    },
    {
      "pk": 2100207,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 7,
      "text": "They were amazed and astonished, saying, 'Are not all these who are speaking Galileans?'",
      "links": "<a href='/AIV/44/1/11'>Acts 1:11</a>",
      "comment": "Galileans were considered uneducated by many. The fact that they spoke foreign languages enhanced the miracle’s impact and authenticity."
    },
    {
      "pk": 2100208,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 8,
      "text": "'How is it that each of us hears them in our own native language?'",
      "links": "<a href='/AIV/44/2/6'>Acts 2:6</a>",
      "comment": "The Spirit’s gift transcends human limitations. The Church’s mission is for all nations, languages, and peoples."
    },
    {
      "pk": 2100209,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 9,
      "text": "'Parthians and Medes and Elamites, and residents of Mesopotamia, Judea and Cappadocia, Pontus and Asia,'",
      "links": "<a href='/AIV/1/10/2-5'>Gen. 10:2-5</a>",
      "comment": "The list of nations emphasizes the diversity gathered at Pentecost, symbolizing the Church’s universal calling."
    },
    {
      "pk": 2100210,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 10,
      "text": "'Phrygia and Pamphylia, Egypt and the parts of Libya near Cyrene, and visitors from Rome,'",
      "links": "<a href='/AIV/44/18/2'>Acts 18:2</a>",
      "comment": "Rome's mention is significant, representing the empire’s center and hinting at the future importance of the Church’s outreach there."
    },
    {
      "pk": 2100211,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 11,
      "text": "'Both Jews and converts to Judaism, Cretans and Arabians—we hear them declaring in our own tongues the mighty works of God.'",
      "links": "<a href='/AIV/44/2/4'>Acts 2:4</a>; <a href='/AIV/19/96/3'>Ps. 96:3</a>",
      "comment": "All hear the mighty acts of God proclaimed, pointing to the Church’s role as the continuing witness to God’s saving deeds."
    },
    {
      "pk": 2100212,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 12,
      "text": "And all were amazed and perplexed, saying to one another, 'What does this mean?'",
      "links": "<a href='/AIV/44/10/45'>Acts 10:45</a>",
      "comment": "The people’s confusion opens the way for Peter’s explanation, highlighting the need for authoritative teaching in the Church."
    },
    {
      "pk": 2100213,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 13,
      "text": "But some mocked, saying, 'They are filled with new wine.'",
      "links": "<a href='/AIV/44/26/24'>Acts 26:24</a>",
      "comment": "Skepticism and misunderstanding often accompany God’s work; spiritual gifts can be subject to ridicule or misinterpretation."
    },
    {
      "pk": 2100214,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 14,
      "text": "But Peter, standing with the eleven, raised his voice and addressed them: 'Men of Judea and all who dwell in Jerusalem, let this be known to you, and listen to my words.'",
      "links": "<a href='/AIV/40/16/18-19'>Matt. 16:18-19</a>; <a href='/AIV/44/1/15'>Acts 1:15</a>",
      "comment": "Peter, from among the apostles, steps forward as the chief spokesperson, exercising authority in teaching—significance for the continuing leadership structure of the Church."
    },
    {
      "pk": 2100215,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 15,
      "text": "'For these people are not drunk, as you suppose, since it is only the third hour of the day.'",
      "links": "<a href='/AIV/44/2/13'>Acts 2:13</a>",
      "comment": "The third hour was about 9 am, too early for drunkenness. Peter refutes the mockers with reason and clarity."
    },
    {
      "pk": 2100216,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 16,
      "text": "'But this is what was spoken by the prophet Joel:'",
      "links": "<a href='/AIV/29/2/28-32'>Joel 2:28-32</a>",
      "comment": "Peter begins to interpret Pentecost prophetically, showing the continuity between Old and New Covenants. The apostolic hermeneutic is based on fulfillment of prophecy."
    },
    {
      "pk": 2100217,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 17,
      "text": "'“And in the last days, God declares, I will pour out my Spirit on all flesh; your sons and daughters shall prophesy, your young men shall see visions, and your old men shall dream dreams.'",
      "links": "<a href='/AIV/29/2/28'>Joel 2:28</a>",
      "comment": "The pouring of the Spirit on ‘all flesh’ marks a new stage in salvation history, transcending former limitations and signifying a new people of God empowered for prophecy."
    },
    {
      "pk": 2100218,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 18,
      "text": "'Even on my male servants and female servants in those days, I will pour out my Spirit, and they shall prophesy.'",
      "links": "<a href='/AIV/29/2/29'>Joel 2:29</a>",
      "comment": "God’s Spirit is not limited by social status, highlighting the inclusive nature of the Church’s gifts."
    },
    {
      "pk": 2100219,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 19,
      "text": "'And I will show wonders in heaven above and signs on the earth below: blood and fire and vapor of smoke.'",
      "links": "<a href='/AIV/29/2/30'>Joel 2:30</a>",
      "comment": "Apocalyptic signs often accompany new covenant moments; they point to both literal and symbolic fulfillments in Christ’s life and in the Church’s mission."
    },
    {
      "pk": 2100220,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 20,
      "text": "'The sun shall be turned to darkness and the moon to blood, before the great and glorious day of the Lord comes.'",
      "links": "<a href='/AIV/29/2/31'>Joel 2:31</a>; <a href='/AIV/40/24/29'>Matt. 24:29</a>",
      "comment": "Language reminiscent of the prophets signals a transformative moment in history, fulfilled in part by the coming of the Messiah and the Church."
    },
    {
      "pk": 2100221,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 21,
      "text": "'And it shall come to pass that everyone who calls on the name of the Lord will be saved.'",
      "links": "<a href='/AIV/29/2/32'>Joel 2:32</a>; <a href='/AIV/45/10/13'>Rom. 10:13</a>",
      "comment": "Calling on the Lord’s name implies faith lived out in obedience; it is not merely intellectual assent but participation in the life of the Church and sacraments."
    },
    {
      "pk": 2100222,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 22,
      "text": "'Men of Israel, hear these words: Jesus of Nazareth, a man attested to you by God with mighty works and wonders and signs that God did through Him among you, as you yourselves know—'",
      "links": "<a href='/AIV/43/20/30'>John 20:30</a>; <a href='/AIV/5/18/18'>Deut. 18:18</a>",
      "comment": "Jesus' miracles authenticate His divine mission in line with Old Testament prophecy concerning the coming Prophet."
    },
    {
      "pk": 2100223,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 23,
      "text": "'this Jesus, delivered up according to the definite plan and foreknowledge of God, you crucified and killed by the hands of lawless men.'",
      "links": "<a href='/AIV/23/53/10'>Isa. 53:10</a>; <a href='/AIV/44/4/28'>Acts 4:28</a>",
      "comment": "Both divine sovereignty and human responsibility are affirmed. The cross was no accident, but fulfillment of God’s foreordained plan. Links to Isaiah’s Suffering Servant."
    },
    {
      "pk": 2100224,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 24,
      "text": "'God raised Him up, freeing Him from the agony of death, because it was not possible for Him to be held by it.'",
      "links": "<a href='/AIV/19/16/10'>Ps. 16:10</a>; <a href='/AIV/43/2/19'>John 2:19</a>",
      "comment": "The resurrection of Jesus demonstrates His divinity and the defeat of death. It fulfills prophecy, such as Psalm 16:10."
    },
    {
      "pk": 2100225,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 25,
      "text": "'For David says concerning Him, “I saw the Lord always before me, for He is at my right hand that I may not be shaken.”'",
      "links": "<a href='/AIV/19/16/8'>Ps. 16:8</a>",
      "comment": "Peter applies a Davidic psalm to Jesus, showing continuity between the promises to Israel and their fulfillment in Christ."
    },
    {
      "pk": 2100226,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 26,
      "text": "'“Therefore my heart was glad and my tongue rejoiced; my flesh also will dwell in hope.”'",
      "links": "<a href='/AIV/19/16/9'>Ps. 16:9</a>",
      "comment": "Peter sees these words pointing not only to David’s faith, but to the resurrection hope fulfilled in Christ."
    },
    {
      "pk": 2100227,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 27,
      "text": "'“For You will not abandon my soul to Hades, nor let Your Holy One see decay.”'",
      "links": "<a href='/AIV/19/16/10'>Ps. 16:10</a>",
      "comment": "A prophecy of the resurrection. ‘Holy One’ refers to Jesus, whose body did not see decay, proving His divinity and the truth of the resurrection."
    },
    {
      "pk": 2100228,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 28,
      "text": "'“You have made known to me the ways of life; You will fill me with joy in Your presence.”'",
      "links": "<a href='/AIV/19/16/11'>Ps. 16:11</a>",
      "comment": "The resurrection leads to joy and fullness of life in God’s presence, echoed in the promise of eternal communion for believers."
    },
    {
      "pk": 2100229,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 29,
      "text": "'Brothers, I may confidently say to you about the patriarch David that he both died and was buried, and his tomb is with us to this day.'",
      "links": "<a href='/AIV/11/2/10'>1 Kings 2:10</a>",
      "comment": "David’s physical death and burial prove that the prophecy applies to someone greater than David, namely, Jesus."
    },
    {
      "pk": 2100230,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 30,
      "text": "'Since he was a prophet, and knew that God had sworn to him with an oath to set one of his descendants on his throne,'",
      "links": "<a href='/AIV/10/7/12-16'>2 Sam. 7:12-16</a>",
      "comment": "Peter calls David a prophet, interpreting messianic prophecies about a permanent throne as fulfilled in Jesus."
    },
    {
      "pk": 2100231,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 31,
      "text": "'he foresaw and spoke of the resurrection of the Messiah, that He was not abandoned to Hades, nor did His flesh see decay.'",
      "links": "<a href='/AIV/19/16/10'>Ps. 16:10</a>",
      "comment": "Peter’s interpretation links prophetic and historical fulfillment—key for understanding Scripture’s deeper spiritual meaning."
    },
    {
      "pk": 2100232,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 32,
      "text": "'This Jesus God raised up; and of that we all are witnesses.'",
      "links": "<a href='/AIV/44/1/22'>Acts 1:22</a>; <a href='/AIV/46/15/5'>1 Cor. 15:5</a>",
      "comment": "The apostolic witness is central to transmission of the message of Christ. The credibility of the Church’s teaching rests on this testimony."
    },
    {
      "pk": 2100233,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 33,
      "text": "'Being therefore exalted at the right hand of God, and having received from the Father the promise of the Holy Spirit, He has poured out this which you now see and hear.'",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/44/1/4'>Acts 1:4</a>",
      "comment": "Jesus is depicted in divine glory sharing authority with the Father, and as dispensator of the Spirit to the Church; note the royal and priestly roles."
    },
    {
      "pk": 2100234,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 34,
      "text": "'For David did not ascend into the heavens, but he himself says, “The Lord said to my Lord, ‘Sit at my right hand,'”'",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/40/22/44'>Matt. 22:44</a>",
      "comment": "Peter interprets David’s Psalm as pointing to someone greater than David, affirming the messiah's divine status."
    },
    {
      "pk": 2100235,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 35,
      "text": "'“until I make Your enemies Your footstool.”'",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>",
      "comment": "Christ’s exaltation fulfills messianic prophecy of divine kingship and reign over all."
    },
    {
      "pk": 2100236,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 36,
      "text": "'Let all the house of Israel therefore know for certain that God has made Him both Lord and Messiah, this Jesus whom you crucified.'",
      "links": "<a href='/AIV/44/2/22'>Acts 2:22</a>; <a href='/AIV/45/1/4'>Rom. 1:4</a>",
      "comment": "Peter’s declaration explicitly proclaims Jesus’ divinity as ‘Lord’ and fulfillment of prophecy as ‘Messiah.’"
    },
    {
      "pk": 2100237,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 37,
      "text": "Now when they heard this, they were cut to the heart, and said to Peter and the rest of the apostles, 'Brothers, what shall we do?'",
      "links": "<a href='/AIV/44/16/30'>Acts 16:30</a>",
      "comment": "The Word convicts, prompting response. The apostles' authority to direct the response is key to Church teaching and practice."
    },
    {
      "pk": 2100238,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 38,
      "text": "Peter said to them, 'Repent and be baptized, each of you, in the name of Jesus Christ for the forgiveness of your sins, and you will receive the gift of the Holy Spirit.'",
      "links": "<a href='/AIV/3/16/4-5'>Lev. 16:4-5</a>; <a href='/AIV/44/22/16'>Acts 22:16</a>; <a href='/AIV/60/3/21'>1 Pet. 3:21</a>",
      "comment": "Peter places sacramental baptism at the heart of entrance into the Church, linking forgiveness and receiving the Spirit to this act—a foundational doctrine and practice from the Church's inception."
    },
    {
      "pk": 2100239,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 39,
      "text": "'For the promise is for you and your children and for all who are far off, everyone whom the Lord our God will call.'",
      "links": "<a href='/AIV/23/59/21'>Isa. 59:21</a>; <a href='/AIV/44/10/45'>Acts 10:45</a>",
      "comment": "The promise extends through generations, signifying the Church’s enduring mission and the inclusion of families—roots for infant baptism traditions."
    },
    {
      "pk": 2100240,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 40,
      "text": "With many other words he bore witness and continued to exhort them, saying, 'Save yourselves from this corrupt generation.'",
      "links": "<a href='/AIV/40/12/39'>Matt. 12:39</a>",
      "comment": "The Gospel requires continual response and conversion. Peter’s exhortation shows the pastoral nature of apostolic teaching."
    },
    {
      "pk": 2100241,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 41,
      "text": "So those who received his word were baptized, and about three thousand souls were added that day.",
      "links": "<a href='/AIV/44/4/4'>Acts 4:4</a>",
      "comment": "Faith and baptism were inseparable in the earliest Church, with clear apostolic authority over admission to the Church. This marks the visible beginning of the Church’s growth."
    },
    {
      "pk": 2100242,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 42,
      "text": "They devoted themselves to the apostles’ teaching and fellowship, to the breaking of bread and to the prayers.",
      "links": "<a href='/AIV/46/10/16'>1 Cor. 10:16</a>; <a href='/AIV/44/20/7'>Acts 20:7</a>",
      "comment": "‘Breaking of bread’ likely refers to the Eucharist, centralizing the sacramental life of the Church alongside apostolic teaching and communal prayer."
    },
    {
      "pk": 2100243,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 43,
      "text": "And awe came upon every soul, and many wonders and signs were done through the apostles.",
      "links": "<a href='/AIV/44/5/12'>Acts 5:12</a>",
      "comment": "Miracles validated the apostolic mission and the authority of the early Church’s leaders; spiritual and physical works accompanied their ministry."
    },
    {
      "pk": 2100244,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 44,
      "text": "All who believed were together and had everything in common.",
      "links": "<a href='/AIV/44/4/32'>Acts 4:32</a>",
      "comment": "The new community practiced profound unity, a model for Christian life that includes spiritual and material sharing."
    },
    {
      "pk": 2100245,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 45,
      "text": "They sold their possessions and goods and distributed them to anyone as had need.",
      "links": "<a href='/AIV/44/4/34-35'>Acts 4:34-35</a>",
      "comment": "Radical charity was a sign of the Church’s living faith and participation in Christ’s love, as established by apostolic leadership."
    },
    {
      "pk": 2100246,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 46,
      "text": "Day by day, they attended the temple together and broke bread in their homes, receiving their food with glad and sincere hearts.",
      "links": "<a href='/AIV/44/5/42'>Acts 5:42</a>",
      "comment": "Believers worshipped in the temple but also in homes, combining continuity with Jewish traditions and the emerging distinctiveness of Christian practice; ‘breaking bread’ has both Eucharistic and communal connotations."
    },
    {
      "pk": 2100247,
      "translation": "AIV",
      "book": 44,
      "chapter": 2,
      "verse": 47,
      "text": "They praised God and had favor with all the people. And the Lord added to their number day by day those who were being saved.",
      "links": "<a href='/AIV/44/5/14'>Acts 5:14</a>; <a href='/AIV/19/107/1'>Ps. 107:1</a>",
      "comment": "God Himself grows the Church. The continual addition of believers shows the Spirit’s ongoing work through the Church, and the communal aspect of salvation."
    }
  ],
  "translatedAt": "2025-12-23T03:13:38.641Z"
}