{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 14,
  "verses": [
    {
      "pk": 1400101,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 1,
      "text": "Now in Iconium, they entered together into the Jewish synagogue and spoke in such a way that a great number of both Jews and Greeks believed.",
      "links": "<a href='/AIV/44/13/51'>Acts 13:51</a>; <a href='/AIV/44/17/1'>Acts 17:1-2</a>",
      "comment": "The missionary pattern continues: Paul and Barnabas preach first to the Jews, then to the Gentiles. Many believe, showing the Church's universality (cf. Acts 13:46)."
    },
    {
      "pk": 1400102,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 2,
      "text": "But the unbelieving Jews stirred up the Gentiles and poisoned their minds against the brothers.",
      "links": "<a href='/AIV/44/13/50'>Acts 13:50</a>",
      "comment": "Opposition frequently arises against the apostles, echoing Jesus' prediction of persecution (cf. John 16:2)."
    },
    {
      "pk": 1400103,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 3,
      "text": "So they remained for a long time, speaking boldly for the Lord, who testified to the word of his grace, granting signs and wonders to be done by their hands.",
      "links": "<a href='/AIV/44/4/29-30'>Acts 4:29-30</a>; <a href='/AIV/16/2/3'>Mark 16:20</a>",
      "comment": "Signs and wonders confirm the apostolic message, emphasizing the close connection between Church authority, preaching, and miracles."
    },
    {
      "pk": 1400104,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 4,
      "text": "But the people of the city were divided; some sided with the Jews and some with the apostles.",
      "links": "<a href='/AIV/44/28/24'>Acts 28:24</a>",
      "comment": "Division over Christ fulfills his own words (cf. Luke 12:51-53) and underscores the radical challenge presented by the gospel."
    },
    {
      "pk": 1400105,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 5,
      "text": "When an attempt was made by both Gentiles and Jews, with their rulers, to mistreat and stone them,",
      "links": "<a href='/AIV/44/14/19'>Acts 14:19</a>",
      "comment": "Hostility grows from both Jews and Gentiles, prefiguring the universal call to perseverance in faith amid persecution."
    },
    {
      "pk": 1400106,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 6,
      "text": "they became aware of it and fled to Lystra and Derbe, cities of Lycaonia, and to the surrounding region,",
      "links": "<a href='/AIV/44/13/51'>Acts 13:51</a>",
      "comment": "Paul and Barnabas practice prudent flight from danger, following Christ's advice to flee persecution when necessary (cf. Matthew 10:23)."
    },
    {
      "pk": 1400107,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 7,
      "text": "and there they continued to proclaim the good news.",
      "links": "<a href='/AIV/44/8/4'>Acts 8:4</a>",
      "comment": "The mission is never abandoned, even when facing adversity, showing apostolic zeal."
    },
    {
      "pk": 1400108,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 8,
      "text": "Now at Lystra there was a man sitting who could not use his feet; he was lame from birth and had never walked.",
      "links": "<a href='/AIV/44/3/2'>Acts 3:2</a>",
      "comment": "This healing echoes that of the lame man by Peter (Acts 3:2-10), showing continuity among the apostles' miraculous works."
    },
    {
      "pk": 1400109,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 9,
      "text": "He listened to Paul speaking. Paul, looking intently at him and seeing that he had faith to be healed,",
      "links": "<a href='/AIV/40/9/2'>Matthew 9:2</a>",
      "comment": "Faith precedes healing, a key principle in the ministry of Jesus and the apostles."
    },
    {
      "pk": 1400110,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 10,
      "text": "said in a loud voice, 'Stand upright on your feet.' And he sprang up and began to walk.",
      "links": "<a href='/AIV/44/3/6'>Acts 3:6-8</a>",
      "comment": "Parallels to Peter's miracle affirm unity and authority among the apostles; the acts of the apostles are Christ working through his Church."
    },
    {
      "pk": 1400111,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 11,
      "text": "And when the crowds saw what Paul had done, they lifted up their voices, saying in the Lycaonian language, 'The gods have come down to us in human form!'",
      "links": "<a href='/AIV/44/28/6'>Acts 28:6</a>",
      "comment": "The people's response reveals pagan misunderstandings, yet attests to the extraordinary power at work."
    },
    {
      "pk": 1400112,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 12,
      "text": "They called Barnabas Zeus, and Paul, Hermes, because he was the chief speaker.",
      "links": "<a href='/AIV/44/19/35'>Acts 19:35</a>",
      "comment": "The apostles are mistaken for gods; this error demonstrates the challenge of communicating the true gospel in different cultures."
    },
    {
      "pk": 1400113,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 13,
      "text": "And the priest of Zeus, whose temple was just outside the city, brought oxen and garlands to the gates, intending to offer sacrifice with the crowds.",
      "links": "",
      "comment": "Here we see the seriousness of the people's devotion to their gods, intensifying the challenge the apostles faced."
    },
    {
      "pk": 1400114,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 14,
      "text": "But when the apostles Barnabas and Paul heard of it, they tore their garments and rushed out into the crowd, crying out,",
      "links": "<a href='/AIV/40/26/65'>Matthew 26:65</a>",
      "comment": "Tearing garments was a sign of horror at blasphemy, reflecting Jewish tradition (cf. Matthew 26:65). The apostles reject worship offered to them."
    },
    {
      "pk": 1400115,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 15,
      "text": "'Men, why are you doing these things? We also are men, with the same nature as you, and we bring you good news, that you should turn from these worthless things to the living God, who made the heaven and the earth and the sea and all that is in them.'",
      "links": "<a href='/AIV/44/17/24'>Acts 17:24</a>; <a href='/AIV/19/146/6'>Psalm 146:6</a>; <a href='/AIV/66/14/7'>Revelation 14:7</a>",
      "comment": "Paul uses natural theology to appeal to Gentiles (see Romans 1:19-20), affirming the living God as Creator."
    },
    {
      "pk": 1400116,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 16,
      "text": "In past generations he allowed all the nations to walk in their own ways.",
      "links": "<a href='/AIV/44/17/30'>Acts 17:30</a>",
      "comment": "God's forbearance in earlier times is emphasized (see also Acts 17:30); now, all are called to repentance and faith."
    },
    {
      "pk": 1400117,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 17,
      "text": "Yet he did not leave himself without witness, for he did good by giving you rains from heaven and fruitful seasons, satisfying your hearts with food and gladness.",
      "links": "<a href='/AIV/19/104/14'>Psalm 104:14</a>; <a href='/AIV/24/5/24'>Jeremiah 5:24</a>",
      "comment": "Even without special revelation, God's goodness is revealed in creation, an argument later used in Romans 1:20."
    },
    {
      "pk": 1400118,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 18,
      "text": "Even with these words, they barely restrained the people from offering sacrifice to them.",
      "links": "",
      "comment": "The crowd's persistence shows the depth of pagan beliefs and the slow process of converting hearts and minds."
    },
    {
      "pk": 1400119,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 19,
      "text": "But Jews came from Antioch and Iconium, and having persuaded the crowds, they stoned Paul and dragged him out of the city, supposing that he was dead.",
      "links": "<a href='/AIV/47/11/25'>2 Corinthians 11:25</a>",
      "comment": "Paul suffers stoning, foreshadowing the martyrdom required of faithful witnesses and the endurance asked of all true disciples."
    },
    {
      "pk": 1400120,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 20,
      "text": "But when the disciples gathered around him, he rose up and entered the city; and on the next day he went with Barnabas to Derbe.",
      "links": "",
      "comment": "Paul's apparent miraculous recovery is a testimony that God protects his servants for the completion of their mission."
    },
    {
      "pk": 1400121,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 21,
      "text": "When they had preached the good news to that city and had made many disciples, they returned to Lystra and to Iconium and to Antioch,",
      "links": "<a href='/AIV/44/20/24'>Acts 20:24</a>",
      "comment": "Evangelizing and strengthening new believers recall Christ’s commission to make disciples (cf. Matthew 28:19-20)."
    },
    {
      "pk": 1400122,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 22,
      "text": "strengthening the souls of the disciples, encouraging them to remain in the faith, and saying, 'Through many tribulations we must enter the kingdom of God.'",
      "links": "<a href='/AIV/41/10/30'>Mark 10:30</a>; <a href='/AIV/45/8/17'>Romans 8:17</a>",
      "comment": "Suffering is part of the journey to the kingdom. The apostles nurture the new believers, highlighting the need for ongoing instruction and perseverance."
    },
    {
      "pk": 1400123,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 23,
      "text": "And when they had appointed elders for them in every church, with prayer and fasting, they committed them to the Lord in whom they had believed.",
      "links": "<a href='/AIV/44/20/17'>Acts 20:17</a>; <a href='/AIV/56/1/5'>Titus 1:5</a>",
      "comment": "The apostles establish leadership through the laying on of hands and prayer, demonstrating apostolic succession and the importance of order and continuity in the Church. This passage is key for understanding the foundation of a visible, organized Church."
    },
    {
      "pk": 1400124,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 24,
      "text": "Then they passed through Pisidia and came to Pamphylia.",
      "links": "<a href='/AIV/44/13/13'>Acts 13:13</a>",
      "comment": "The apostles continue their missionary journey, retracing their steps to encourage the communities they founded."
    },
    {
      "pk": 1400125,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 25,
      "text": "And when they had spoken the word in Perga, they went down to Attalia;",
      "links": "<a href='/AIV/44/13/13'>Acts 13:13</a>",
      "comment": "Proclaiming the word in every city reveals the missionary scope and persistence of the apostles."
    },
    {
      "pk": 1400126,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 26,
      "text": "and from there they sailed to Antioch, where they had been commended to the grace of God for the work that they had fulfilled.",
      "links": "<a href='/AIV/44/13/1-3'>Acts 13:1-3</a>",
      "comment": "Paul and Barnabas return to the Church that sent them, completing their mission under the community's authority and blessing. This models proper obedience and unity within the Church structure."
    },
    {
      "pk": 1400127,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 27,
      "text": "And when they arrived and gathered the church together, they declared all that God had done with them, and how he had opened a door of faith to the Gentiles.",
      "links": "<a href='/AIV/44/15/4'>Acts 15:4</a>; <a href='/AIV/66/3/8'>Revelation 3:8</a>",
      "comment": "Missionaries report back to the assembled Church; the spread of faith among the Gentiles fulfills Old Testament prophecies (e.g., Isaiah 49:6). The importance of Church unity and shared mission is highlighted."
    },
    {
      "pk": 1400128,
      "translation": "AIV",
      "book": 44,
      "chapter": 14,
      "verse": 28,
      "text": "And they remained no little time with the disciples.",
      "links": "",
      "comment": "The apostles provide ongoing presence and teaching, reinforcing the need for continued formation and community—vital aspects for the maturing and perseverance of the Church."
    }
  ],
  "translatedAt": "2025-12-23T03:21:58.014Z"
}