{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 15,
  "verses": [
    {
      "pk": 2001501,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 1,
      "text": "Certain men came down from Judea and were teaching the brothers, 'Unless you are circumcised according to the custom of Moses, you cannot be saved.'",
      "links": "<a href='/AIV/1/17/9-14'>Gen. 17:9–14</a>; <a href='/AIV/3/12/3'>Lev. 12:3</a>",
      "comment": "The issue of circumcision recalls the Abrahamic covenant. The question at stake is whether salvation in Christ requires observance of Mosaic law or is founded on faith—Paul will argue the latter elsewhere (<a href='/AIV/48/5/2-6'>Gal. 5:2–6</a>), pointing to fulfillment in Christ."
    },
    {
      "pk": 2001502,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 2,
      "text": "After Paul and Barnabas had no small disagreement and debate with them, they and some others were appointed to go up to Jerusalem to the apostles and elders about this question.",
      "links": "<a href='/AIV/48/2/1'>Gal. 2:1</a>",
      "comment": "Notice how authoritative discernment is sought from Jerusalem, to the apostles and elders, showing the need for a central and unified leadership in doctrinal matters."
    },
    {
      "pk": 2001503,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 3,
      "text": "So, being sent on their way by the church, they passed through Phoenicia and Samaria, telling in detail about the conversion of the Gentiles, and brought great joy to all the brothers.",
      "links": "<a href='/AIV/8/14/1'>Acts 8:14</a>",
      "comment": "The church in Antioch commissions the journey, reflecting communal action and not individual autonomy. The conversion of Gentiles brings unity and joy—fulfilling God’s promise to bless all nations through Abraham."
    },
    {
      "pk": 2001504,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 4,
      "text": "When they arrived in Jerusalem, they were welcomed by the church, the apostles, and the elders, and reported all that God had done with them.",
      "links": "<a href='/AIV/11/8/1'>1 Kings 8:1</a>",
      "comment": "There is a visible unity and structure in leadership—apostles and elders together. Decisions affecting faith are ultimately received and confirmed by this body."
    },
    {
      "pk": 2001505,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 5,
      "text": "But some believers from the party of the Pharisees stood up and said, 'It is necessary to circumcise them and to order them to keep the law of Moses.'",
      "links": "<a href='/AIV/9/23/1-3'>Luke 23:1–3</a>",
      "comment": "Some believers argued for adherence to the Mosaic law, showing that early Christians still debated the continuity between the Old and New Covenants."
    },
    {
      "pk": 2001506,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 6,
      "text": "The apostles and the elders gathered together to consider this matter.",
      "links": "<a href='/AIV/16/8/2'>Acts 6:2</a>",
      "comment": "Doctrinal decisions are deliberated by the apostolic leadership, indicating a council or synod, foreshadowing later ecumenical responses to disputes."
    },
    {
      "pk": 2001507,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 7,
      "text": "After much debate, Peter stood up and said to them, 'Brothers, you know that in the early days God made a choice among you, that by my mouth the Gentiles should hear the word of the gospel and believe.'",
      "links": "<a href='/AIV/10/10/34-43'>Acts 10:34–43</a>",
      "comment": "Peter’s prominent place in the council demonstrates his leadership role. The initiative to the Gentiles traces to God’s sovereign choice—a pattern of divine authority flowing through human leadership."
    },
    {
      "pk": 2001508,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 8,
      "text": "And God, who knows the heart, bore witness to them by giving them the Holy Spirit just as he did to us.",
      "links": "<a href='/AIV/9/15/8'>Acts 9:15</a>; <a href='/AIV/44/10/44-47'>Acts 10:44–47</a>",
      "comment": "God’s gift of the Spirit to Gentiles shows the New Covenant transcends ethnic boundaries. Spiritual unity is confirmed by visible signs."
    },
    {
      "pk": 2001509,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 9,
      "text": "He made no distinction between us and them, having cleansed their hearts by faith.",
      "links": "<a href='/AIV/45/10/12'>Rom. 10:12</a>; <a href='/AIV/51/3/11'>Col. 3:11</a>",
      "comment": "God's act of cleansing aligns with prophecies of a new heart (<a href='/AIV/26/36/25-27'>Ezek. 36:25–27</a>). Faith is now the means of inclusion in God’s people."
    },
    {
      "pk": 2001510,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 10,
      "text": "Now then, why are you testing God by placing a yoke on the neck of the disciples that neither our fathers nor we were able to bear?",
      "links": "<a href='/AIV/40/23/4'>Matt. 23:4</a>",
      "comment": "Peter rejects imposing the Mosaic law, describing it as an unbearable yoke. Christ’s fulfillment of the law liberates believers."
    },
    {
      "pk": 2001511,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 11,
      "text": "But we believe that we will be saved through the grace of the Lord Jesus, just as they will.",
      "links": "<a href='/AIV/49/2/8-9'>Eph. 2:8–9</a>",
      "comment": "Salvation is by grace through the Lord Jesus, not by keeping the law. Both Jews and Gentiles are saved the same way—showing early unity of faith."
    },
    {
      "pk": 2001512,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 12,
      "text": "The whole assembly fell silent, and they listened to Barnabas and Paul as they described all the signs and wonders God had done among the Gentiles through them.",
      "links": "<a href='/AIV/41/16/20'>Mark 16:20</a>",
      "comment": "Miracles serve as confirmation of God's work among the Gentiles, validating the message and mission of Paul and Barnabas."
    },
    {
      "pk": 2001513,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 13,
      "text": "After they finished speaking, James replied, 'Brothers, listen to me.'",
      "links": "<a href='/AIV/59/1/1'>James 1:1</a>",
      "comment": "James, a leader in the Jerusalem church, has significant authority. His speaking last demonstrates his position of respect and oversight over the assembly."
    },
    {
      "pk": 2001514,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 14,
      "text": "'Simeon has related how God first visited the Gentiles, to take from them a people for his name.'",
      "links": "<a href='/AIV/1/12/1-3'>Gen. 12:1–3</a>; <a href='/AIV/28/1/10'>Hos. 1:10</a>",
      "comment": "James affirms the universal mission of the Church, rooted in Old Testament promises fulfilled in Christ."
    },
    {
      "pk": 2001515,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 15,
      "text": "'And with this the words of the prophets agree, just as it is written,'",
      "links": "<a href='/AIV/30/9/11-12'>Amos 9:11–12</a>",
      "comment": "Scripture confirms God’s plan to include Gentiles, linking apostolic decisions to prophetic fulfillment."
    },
    {
      "pk": 2001516,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 16,
      "text": "'After this I will return, and I will rebuild the tent of David that has fallen; I will rebuild its ruins, and I will restore it,'",
      "links": "<a href='/AIV/30/9/11'>Amos 9:11</a>",
      "comment": "The 'tent of David' is restored through Christ. The rebuilt house of David signals the messianic fulfillment and new people of God."
    },
    {
      "pk": 2001517,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 17,
      "text": "'so that the rest of mankind may seek the Lord, and all the Gentiles who are called by my name, says the Lord, who makes these things known from of old.'",
      "links": "<a href='/AIV/23/11/10'>Isa. 11:10</a>",
      "comment": "The inclusion of the Gentiles is a fulfillment of prophecy—God’s people now comprise all nations who seek the Lord."
    },
    {
      "pk": 2001518,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 18,
      "text": "'known from long ago.'",
      "links": "<a href='/AIV/23/45/21'>Isa. 45:21</a>",
      "comment": "God’s salvific plan was revealed long ago; apostolic teaching aligns with the prophetic Scriptures."
    },
    {
      "pk": 2001519,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 19,
      "text": "Therefore my judgment is that we should not trouble those of the Gentiles who turn to God,",
      "links": "<a href='/AIV/11/3/23'>1 Kings 3:23</a>",
      "comment": "James renders judgment—a sign that early leaders exercised authoritative interpretation and binding judgments for the whole Church."
    },
    {
      "pk": 2001520,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 20,
      "text": "but should write to them to abstain from the things polluted by idols, from sexual immorality, from what has been strangled, and from blood.",
      "links": "<a href='/AIV/3/17/10-14'>Lev. 17:10–14</a>; <a href='/AIV/3/18/6-30'>Lev. 18:6–30</a>",
      "comment": "These instructions reflect rules for Gentiles living among Israelites (Noahide laws), focusing on unity and holiness. It also shows leadership’s authority in binding disciplinary standards."
    },
    {
      "pk": 2001521,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 21,
      "text": "For from ancient generations, Moses has had in every city those who proclaim him, for he is read every Sabbath in the synagogues.",
      "links": "<a href='/AIV/2/20/8-11'>Exod. 20:8–11</a>",
      "comment": "James points out that Jewish customs remain widely known; Gentile believers should be considerate of Jewish Christians’ sensitivities."
    },
    {
      "pk": 2001522,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 22,
      "text": "Then it seemed good to the apostles and the elders, with the whole church, to choose men from among them and send them to Antioch with Paul and Barnabas. They sent Judas called Barsabbas, and Silas, leading men among the brothers,",
      "links": "<a href='/AIV/1/1/26'>Acts 1:26</a>",
      "comment": "Doctrinal pronouncements are delivered through appointed representatives—showing a process of delegation and trust in authoritative, visible leaders."
    },
    {
      "pk": 2001523,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 23,
      "text": "With the following letter: 'The apostles and the elders, your brothers, to the Gentile brothers in Antioch, Syria, and Cilicia: Greetings.'",
      "links": "<a href='/AIV/45/1/7'>Rom. 1:7</a>",
      "comment": "This is one of the earliest preserved letters from church leadership, sent to multiple congregations—demonstrating concern for clarity and unity of teaching."
    },
    {
      "pk": 2001524,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 24,
      "text": "'Since we have heard that some persons have gone out from us and troubled you with words, unsettling your minds, although we gave them no such instructions,'",
      "links": "<a href='/AIV/48/2/4'>Gal. 2:4</a>",
      "comment": "The central leadership disavows unauthorized teachers, indicating early control over doctrinal boundaries and correction of error."
    },
    {
      "pk": 2001525,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 25,
      "text": "'it has seemed good to us, having come to one accord, to choose men and send them to you with our beloved Barnabas and Paul,'",
      "links": "<a href='/AIV/46/1/10'>1 Cor. 1:10</a>",
      "comment": "The phrase 'one accord' shows unity of belief and a collective, binding decision—one faith, one teaching."
    },
    {
      "pk": 2001526,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 26,
      "text": "'men who have risked their lives for the name of our Lord Jesus Christ.'",
      "links": "<a href='/AIV/44/9/16'>Acts 9:16</a>",
      "comment": "Suffering for Christ is considered honorable, continuing the apostolic tradition of sacrifice and witness."
    },
    {
      "pk": 2001527,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 27,
      "text": "'Therefore we have sent Judas and Silas, who themselves will tell you the same things by word of mouth.'",
      "links": "<a href='/AIV/40/18/16'>Matt. 18:16</a>",
      "comment": "Oral as well as written tradition confirms the message. This validates the use of living tradition alongside scripture."
    },
    {
      "pk": 2001528,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 28,
      "text": "'For it has seemed good to the Holy Spirit and to us to lay upon you no greater burden than these essential things:'",
      "links": "",
      "comment": "The formula 'it seemed good to the Holy Spirit and to us' expresses the belief that God guides the leadership’s decisions—a precursor of later Church synods and councils."
    },
    {
      "pk": 2001529,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 29,
      "text": "'that you abstain from what has been sacrificed to idols, and from blood, and from what has been strangled, and from sexual immorality. If you keep yourselves from these, you will do well. Farewell.'",
      "links": "<a href='/AIV/46/8/1-13'>1 Cor. 8:1–13</a>",
      "comment": "Early Christian practice preserves some Old Testament restrictions for unity’s sake. These are not requirements for salvation, but practical provisions for harmony."
    },
    {
      "pk": 2001530,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 30,
      "text": "So when they were sent off, they went down to Antioch, and having gathered the congregation together, they delivered the letter.",
      "links": "",
      "comment": "Messenger leadership acts as authorized bearers of doctrinal decisions, emphasizing unity between communities."
    },
    {
      "pk": 2001531,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 31,
      "text": "And when they read it, they rejoiced because of its encouragement.",
      "links": "",
      "comment": "Acceptance of the apostolic letter brings joy, reflecting trust and unity within the larger Church."
    },
    {
      "pk": 2001532,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 32,
      "text": "And Judas and Silas, who were themselves prophets, encouraged and strengthened the brothers with many words.",
      "links": "<a href='/AIV/11/13/1'>Acts 13:1</a>",
      "comment": "Prophetic ministry, guided by the Spirit, strengthens the church—revealing the importance of gifts exercised in communion with apostolic leadership."
    },
    {
      "pk": 2001533,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 33,
      "text": "And after they had spent some time, they were sent off in peace by the brothers to those who had sent them.",
      "links": "",
      "comment": "Mutual fellowship and the sending of envoys in peace demonstrate the connectedness of the early Christian community."
    },
    {
      "pk": 2001534,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 34,
      "text": "<i>(But it seemed good to Silas to remain there.)</i>",
      "links": "",
      "comment": "Some manuscripts include this verse; others omit it. It reflects the flexibility and discernment in apostolic ministry."
    },
    {
      "pk": 2001535,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 35,
      "text": "But Paul and Barnabas stayed in Antioch, teaching and preaching the word of the Lord, with many others also.",
      "links": "",
      "comment": "Ongoing instruction and preaching are crucial to community strengthening; leadership rests not only with apostles but also with fellow workers."
    },
    {
      "pk": 2001536,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 36,
      "text": "After some days Paul said to Barnabas, 'Let us return and visit the brothers in every city where we proclaimed the word of the Lord, and see how they are.'",
      "links": "<a href='/AIV/44/13/1'>Acts 13:1</a>",
      "comment": "Pastoral care and oversight remain essential, showing apostolic concern for the growth and persistence of newfound churches."
    },
    {
      "pk": 2001537,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 37,
      "text": "Now Barnabas wanted to take with them John, who was called Mark.",
      "links": "<a href='/AIV/44/12/12'>Acts 12:12</a>",
      "comment": "John Mark reappears as a companion after previously departing—foreshadowing future reconciliation and his enduring contribution."
    },
    {
      "pk": 2001538,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 38,
      "text": "But Paul thought best not to take with them one who had withdrawn from them in Pamphylia and had not continued with them in the work.",
      "links": "<a href='/AIV/44/13/13'>Acts 13:13</a>",
      "comment": "Paul’s insistence reflects the seriousness of apostolic mission and the importance of reliability among co-workers."
    },
    {
      "pk": 2001539,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 39,
      "text": "And there arose a sharp disagreement, so that they separated from each other. Barnabas took Mark with him and sailed to Cyprus,",
      "links": "",
      "comment": "Even great apostles sometimes disagreed, but God’s mission continues by different routes, emphasizing the divine sovereignty even in human disagreements."
    },
    {
      "pk": 2001540,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 40,
      "text": "but Paul chose Silas and departed, being commended by the brothers to the grace of the Lord.",
      "links": "",
      "comment": "Commendation to the Lord’s grace involves prayerful sending and continued fellowship in the faith—signs of ongoing spiritual unity despite physical separation."
    },
    {
      "pk": 2001541,
      "translation": "AIV",
      "book": 44,
      "chapter": 15,
      "verse": 41,
      "text": "And he went through Syria and Cilicia, strengthening the churches.",
      "links": "<a href='/AIV/44/16/5'>Acts 16:5</a>",
      "comment": "Strengthening the churches highlights apostolic oversight, and the ongoing growth and perseverance of the communities established by the original apostles."
    }
  ],
  "translatedAt": "2025-12-23T03:22:48.524Z"
}