{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 1,
  "verses": [
    {
      "pk": 2000001,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 1,
      "text": "In my first account, O Theophilus, I wrote about all that Jesus began to do and to teach",
      "links": "<a href='/AIV/42/24/19'>Luke 24:19</a>",
      "comment": "Acts is a continuation of Luke's Gospel, addressed to Theophilus. The use of 'began' hints that Jesus' work continues through the Church established by Him."
    },
    {
      "pk": 2000002,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 2,
      "text": "until the day He was taken up, after He had given instructions through the Holy Spirit to the apostles whom He had chosen.",
      "links": "<a href='/AIV/40/28/19-20'>Matt. 28:19–20</a>; <a href='/AIV/42/24/51'>Luke 24:51</a>",
      "comment": "Emphasizes Jesus' unique role in founding His apostolic community. The giving of instructions through the Holy Spirit highlights the divine guidance and authority of the apostles."
    },
    {
      "pk": 2000003,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 3,
      "text": "To them He presented Himself alive after His suffering by many convincing proofs, appearing to them over forty days and speaking about the kingdom of God.",
      "links": "<a href='/AIV/46/15/5-6'>1 Cor. 15:5–6</a>; <a href='/AIV/42/24/36-43'>Luke 24:36–43</a>",
      "comment": "The resurrection of Christ is a historical, eyewitness event. The forty days symbolize preparation and completeness (see Moses in Exodus 24:18 and Jesus in the wilderness, Matt 4:2)."
    },
    {
      "pk": 2000004,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 4,
      "text": "And while staying with them, He ordered them not to leave Jerusalem, but to wait for the promise of the Father, 'which,' He said, 'you heard from Me.'",
      "links": "<a href='/AIV/42/24/49'>Luke 24:49</a>; <a href='/AIV/43/14/16-17'>John 14:16–17</a>",
      "comment": "Jesus calls the apostles to unity and obedience, preparing them to receive the Holy Spirit. The promised gift is the Paraclete, linking the Church to the divine mission."
    },
    {
      "pk": 2000005,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 5,
      "text": "For John baptized with water, but you will be baptized with the Holy Spirit not many days from now.",
      "links": "<a href='/AIV/40/3/11'>Matt. 3:11</a>; <a href='/AIV/43/1/33'>John 1:33</a>",
      "comment": "Contrast between John’s baptism and the new spiritual baptism pointing to a new covenant reality. Baptism is an outward sign of inward grace, and here points to the sacramental nature of Christian initiation."
    },
    {
      "pk": 2000006,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 6,
      "text": "So when they had come together, they asked Him, 'Lord, will You at this time restore the kingdom to Israel?'",
      "links": "<a href='/AIV/42/24/21'>Luke 24:21</a>; <a href='/AIV/23/9/7'>Isa. 9:7</a>",
      "comment": "The apostles still have an earthly, nationalistic expectation. Jesus will later clarify the true nature of the kingdom, emphasizing its spiritual and universal scope."
    },
    {
      "pk": 2000007,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 7,
      "text": "He said to them, 'It is not for you to know times or seasons that the Father has fixed by His own authority.'",
      "links": "<a href='/AIV/40/24/36'>Matt. 24:36</a>; <a href='/AIV/27/2/21'>Dan. 2:21</a>",
      "comment": "The times and seasons are in God's providence alone. The Church must trust and await God's timing for the fulfillment of all things, learning humility and obedience."
    },
    {
      "pk": 2000008,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 8,
      "text": "But you will receive power when the Holy Spirit has come upon you, and you will be My witnesses in Jerusalem, and in all Judea and Samaria, and to the end of the earth.",
      "links": "<a href='/AIV/42/24/47'>Luke 24:47</a>; <a href='/AIV/23/49/6'>Isa. 49:6</a>; <a href='/AIV/40/28/19'>Matt. 28:19</a>",
      "comment": "Jesus commissions the apostles for a worldwide mission, fulfilling Old Testament prophecy of salvation extending to the nations. The Church is meant to be universal in scope and unity."
    },
    {
      "pk": 2000009,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 9,
      "text": "After He had said these things, He was lifted up while they were looking on, and a cloud took Him out of their sight.",
      "links": "<a href='/AIV/42/24/51'>Luke 24:51</a>; <a href='/AIV/27/7/13'>Dan. 7:13</a>",
      "comment": "The ascension shows Christ’s exaltation and fulfillment of prophecy (see Daniel 7). The cloud recalls the divine presence in the Old Testament: Jesus enters divine glory."
    },
    {
      "pk": 2000010,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 10,
      "text": "And as they were gazing into heaven as He went, suddenly two men stood by them in white robes.",
      "links": "<a href='/AIV/42/24/4'>Luke 24:4</a>; <a href='/AIV/01/19/1'>Gen. 19:1</a>",
      "comment": "Heavenly messengers regularly appear at key salvation-history moments. White robes signal purity and glory, linking Jesus’ resurrection and ascension as divine events."
    },
    {
      "pk": 2000011,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 11,
      "text": "'Men of Galilee,' they said, 'why do you stand looking into heaven? This Jesus, who was taken up from you into heaven, will come in the same way as you saw Him go into heaven.'",
      "links": "<a href='/AIV/40/24/30'>Matt. 24:30</a>; <a href='/AIV/27/7/13'>Dan. 7:13</a>",
      "comment": "Declares the visible, bodily return of Christ. Christ’s second coming is physically and spiritually certain, forming the hope and expectation of the Church."
    },
    {
      "pk": 2000012,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 12,
      "text": "Then they returned to Jerusalem from the mount called Olivet, which is near Jerusalem, a Sabbath day's journey away.",
      "links": "<a href='/AIV/42/19/29'>Luke 19:29</a>; <a href='/AIV/38/14/4'>Zech. 14:4</a>",
      "comment": "Significant connection to prophecy in Zechariah, which sees God’s presence coming to the Mount of Olives. The apostles obey and return to Jerusalem, preparing for Pentecost."
    },
    {
      "pk": 2000013,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 13,
      "text": "And when they entered, they went up to the upper room, where they were staying: Peter, John, James, Andrew, Philip, Thomas, Bartholomew, Matthew, James son of Alphaeus, Simon the Zealot, and Judas son of James.",
      "links": "<a href='/AIV/42/6/13-15'>Luke 6:13–15</a>",
      "comment": "All eleven apostles named, showing the Church’s foundation on apostolic authority and unity. The upper room may also recall the Last Supper, showing continuity (see Luke 22:11–12)."
    },
    {
      "pk": 2000014,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 14,
      "text": "All these were united in prayer, with the women, and Mary the mother of Jesus, and His brothers.",
      "links": "<a href='/AIV/42/8/2-3'>Luke 8:2–3</a>; <a href='/AIV/43/19/25'>John 19:25</a>",
      "comment": "Shows the early community in unity and prayer, anticipating the coming of the Holy Spirit. Mary’s presence highlights her unique role in the life of the Church."
    },
    {
      "pk": 2000015,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 15,
      "text": "In those days Peter stood up among the brothers (the number of people together was about one hundred and twenty) and said,",
      "links": "<a href='/AIV/40/16/18-19'>Matt. 16:18–19</a>",
      "comment": "Peter emerges as the leader, a sign of his special authority in guiding the Church. 120 represents fullness, suggesting the Church’s foundational nature."
    },
    {
      "pk": 2000016,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 16,
      "text": "'Brothers, the Scripture had to be fulfilled, which the Holy Spirit spoke beforehand through David concerning Judas, who became guide to those who arrested Jesus.'",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>; <a href='/AIV/43/13/18'>John 13:18</a>",
      "comment": "Peter connects these events to prophecy and the inspiration of the Holy Spirit, establishing the Church’s scriptural foundation and continuity with Davidic promises."
    },
    {
      "pk": 2000017,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 17,
      "text": "'For he was numbered among us and received a share in this ministry.'",
      "links": "<a href='/AIV/40/10/4'>Matt. 10:4</a>; <a href='/AIV/43/6/70'>John 6:70</a>",
      "comment": "Judas held true apostolic ministry, confirming the seriousness of his betrayal. The sacramental nature of apostolic ministry is highlighted by the language of “share.”"
    },
    {
      "pk": 2000018,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 18,
      "text": "(Now this man purchased a field with the reward of his wickedness, and falling headfirst, he burst open in the middle and all his insides spilled out.)",
      "links": "<a href='/AIV/40/27/5-8'>Matt. 27:5–8</a>",
      "comment": "Acts gives a vivid description of Judas's death, differing slightly in detail from Matthew’s account but complementary. It emphasizes the reality and consequence of betrayal."
    },
    {
      "pk": 2000019,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 19,
      "text": "And it became known to all those living in Jerusalem, so that the field was called in their own language Akeldama, that is, 'Field of Blood.'",
      "links": "<a href='/AIV/40/27/8'>Matt. 27:8</a>",
      "comment": "Shows how Judas’s betrayal became a warning and sign to all, fulfilling prophecy and highlighting the consequences of turning away from grace."
    },
    {
      "pk": 2000020,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 20,
      "text": "'For it is written in the Book of Psalms, “Let his homestead be desolate, and let no one dwell in it”; and, “Let another take his office.”'",
      "links": "<a href='/AIV/19/69/25'>Ps. 69:25</a>; <a href='/AIV/19/109/8'>Ps. 109:8</a>",
      "comment": "Peter interprets the Psalms typologically: Judas’s loss of office is fulfilled by the restoration of apostolic authority through succession—an early indication of structure and continuity."
    },
    {
      "pk": 2000021,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 21,
      "text": "'Therefore, from among the men who have accompanied us all the time that the Lord Jesus went in and out among us,'",
      "links": "<a href='/AIV/42/6/13-16'>Luke 6:13–16</a>",
      "comment": "The requirements for apostolic ministry stress the necessity of continuity and faithful witness to the ministry of Christ."
    },
    {
      "pk": 2000022,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 22,
      "text": "'beginning with the baptism of John until the day He was taken up from us, one of these must become a witness with us of His resurrection.'",
      "links": "<a href='/AIV/42/3/3'>Luke 3:3</a>; <a href='/AIV/46/15/4'>1 Cor. 15:4</a>",
      "comment": "The apostolic witness hinges on the resurrection, confirming the historical and theological foundation of the Church. Apostolic succession ensures fidelity to Christ’s message."
    },
    {
      "pk": 2000023,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 23,
      "text": "So they put forward two men: Joseph called Barsabbas (also known as Justus), and Matthias.",
      "links": "<a href='/AIV/44/15/22'>Acts 15:22</a>",
      "comment": "The community discerns through prayer, underscoring the importance of communal leadership and participation. Choice of Matthias shows adherence to apostolic tradition."
    },
    {
      "pk": 2000024,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 24,
      "text": "And they prayed and said, 'Lord, You know the hearts of all. Show which of these two You have chosen.'",
      "links": "<a href='/AIV/09/16/7'>1 Sam. 16:7</a>; <a href='/AIV/19/139/1'>Ps. 139:1</a>",
      "comment": "Prayer is essential for discerning God’s will. Leadership in the Church is established by divine choice, not human effort alone."
    },
    {
      "pk": 2000025,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 25,
      "text": "'to take the place in this ministry and apostleship from which Judas turned aside to go to his own place.'",
      "links": "<a href='/AIV/19/109/8'>Ps. 109:8</a>",
      "comment": "Restores the fullness of apostolic office, ensuring that Christ’s original intent is maintained. Succession in ministry is a key theme for the Church’s structure."
    },
    {
      "pk": 2000026,
      "translation": "AIV",
      "book": 44,
      "chapter": 1,
      "verse": 26,
      "text": "And they cast lots for them, and the lot fell on Matthias, and he was counted with the eleven apostles.",
      "links": "<a href='/AIV/20/16/33'>Prov. 16:33</a>; <a href='/AIV/44/6/6'>Acts 6:6</a>",
      "comment": "Use of lots reflects trust in God’s sovereignty. Matthias becomes the twelfth apostle, restoring the fullness and symbolic foundation of the Church as founded by Christ."
    }
  ],
  "translatedAt": "2025-12-23T03:13:00.528Z"
}