{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 16,
  "verses": [
    {
      "pk": 3161601,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 1,
      "text": "Paul also came to Derbe and to Lystra. A disciple was there named Timothy, the son of a believing Jewish woman, but his father was Greek.",
      "links": "<a href='/AIV/55/1/5'>2 Tim. 1:5</a>",
      "comment": "Timothy’s mixed heritage foreshadows the expanding Gospel mission - uniting Jews and Gentiles. Timothy later becomes a key leader."
    },
    {
      "pk": 3161602,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 2,
      "text": "The brothers in Lystra and Iconium spoke well of him.",
      "links": "<a href='/AIV/54/4/14'>1 Tim. 4:14</a>",
      "comment": "The early Christian communities affirmed new leaders, showing the importance of community testimony for ministry."
    },
    {
      "pk": 3161603,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 3,
      "text": "Paul wanted Timothy to travel with him, so he circumcised him because of the Jews in those places, since they all knew that his father was Greek.",
      "links": "<a href='/AIV/48/2/3'>Gal. 2:3</a>; <a href='/AIV/51/3/11'>Col. 3:11</a>",
      "comment": "Though Paul opposed circumcision for salvation, he had Timothy circumcised to avoid unnecessary barriers for preaching—a model of pastoral sensitivity and unity."
    },
    {
      "pk": 3161604,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 4,
      "text": "As they traveled through the cities, they delivered the decisions reached by the apostles and elders in Jerusalem for the believers to observe.",
      "links": "<a href='/AIV/44/15/28-29'>Acts 15:28–29</a>",
      "comment": "The authoritative teaching from Jerusalem was binding on local churches, highlighting the principle of unified doctrine under apostolic oversight."
    },
    {
      "pk": 3161605,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 5,
      "text": "So the churches were strengthened in the faith and increased in number daily.",
      "links": "<a href='/AIV/44/2/47'>Acts 2:47</a>",
      "comment": "The importance of both fidelity to apostolic teaching and visible growth is emphasized. The word 'churches' refers to visible communities, not just individuals."
    },
    {
      "pk": 3161606,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 6,
      "text": "They passed through the region of Phrygia and Galatia, having been forbidden by the Holy Spirit to speak the word in Asia.",
      "links": "<a href='/AIV/46/16/7'>1 Cor. 16:7</a>",
      "comment": "The Spirit specifically directs missionary work—an example of divine guidance continuing after Christ’s Ascension."
    },
    {
      "pk": 3161607,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 7,
      "text": "When they came to Mysia, they tried to go into Bithynia, but the Spirit of Jesus did not permit them.",
      "links": "<a href='/AIV/60/1/1'>1 Pet. 1:1</a>",
      "comment": "'Spirit of Jesus' equates the Spirit’s direction with Christ’s authority—affirming the divinity of Christ and his ongoing leadership of the Church."
    },
    {
      "pk": 3161608,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 8,
      "text": "So passing by Mysia, they came down to Troas.",
      "links": "<a href='/AIV/55/4/13'>2 Tim. 4:13</a>",
      "comment": "Troas becomes a key launching point for the mission into Europe, prefiguring the Church’s move westward."
    },
    {
      "pk": 3161609,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 9,
      "text": "During the night Paul saw a vision: a man of Macedonia was standing there urging him, 'Come over to Macedonia and help us.'",
      "links": "<a href='/AIV/44/18/9'>Acts 18:9</a>",
      "comment": "God’s call through a vision recalls similar Old Testament experiences (cf. Daniel 7), showing the continuity of divine revelation."
    },
    {
      "pk": 3161610,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 10,
      "text": "After Paul had seen the vision, we immediately tried to go to Macedonia, concluding that God had called us to preach the gospel to them.",
      "links": "<a href='/AIV/44/20/6'>Acts 20:6</a>",
      "comment": "The 'we' here introduces the first-person narrative, suggesting the author (Luke) joined them. This shows the historicity and eyewitness nature of Acts."
    },
    {
      "pk": 3161611,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 11,
      "text": "Sailing from Troas, we ran a straight course to Samothrace, and the next day to Neapolis.",
      "links": "",
      "comment": "Details like the travel route underline the historical reality of the events."
    },
    {
      "pk": 3161612,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 12,
      "text": "From there we traveled to Philippi, which is a leading city of the district of Macedonia and a Roman colony. We stayed in that city for several days.",
      "links": "<a href='/AIV/50/1/1'>Phil. 1:1</a>",
      "comment": "Philippi’s significance as a Roman colony anticipates the spread of the Gospel to important social centers."
    },
    {
      "pk": 3161613,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 13,
      "text": "On the Sabbath day we went outside the city gate to a riverside, where we thought there was a place of prayer. We sat down and spoke to the women gathered there.",
      "links": "<a href='/AIV/44/13/14'>Acts 13:14</a>",
      "comment": "Paul seeks a place of prayer where Jews typically gathered when there was no synagogue, demonstrating respect for tradition and prayerful preparation."
    },
    {
      "pk": 3161614,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 14,
      "text": "A woman named Lydia, a seller of purple cloth from the city of Thyatira and a worshiper of God, was listening. The Lord opened her heart to pay attention to what was spoken by Paul.",
      "links": "<a href='/AIV/66/2/18'>Rev. 2:18</a>",
      "comment": "Lydia’s conversion highlights divine initiative in salvation—'the Lord opened her heart.' The opening of the heart prefigures the deeper spiritual work associated with sacramental regeneration."
    },
    {
      "pk": 3161615,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 15,
      "text": "When she and her household were baptized, she urged us, saying, 'If you have judged me to be faithful to the Lord, come and stay at my house.' And she persuaded us.",
      "links": "<a href='/AIV/44/2/41'>Acts 2:41</a>",
      "comment": "Her whole household receives baptism, reflecting the ancient practice of family baptism. This supports the view that Christianity was embraced as a communal faith, including children."
    },
    {
      "pk": 3161616,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 16,
      "text": "As we were going to the place of prayer, a slave girl with a spirit of divination met us. She brought her owners much profit by fortune-telling.",
      "links": "<a href='/AIV/44/8/9'>Acts 8:9</a>",
      "comment": "Spiritual powers outside the faith are shown to be real but not from God. The contrast between service to God and exploitation by others is clear."
    },
    {
      "pk": 3161617,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 17,
      "text": "She followed Paul and us, shouting, 'These men are servants of the Most High God, who proclaim to you the way of salvation.'",
      "links": "<a href='/AIV/41/1/24'>Mark 1:24</a>",
      "comment": "Even evil spirits can recognize the truth, but their testimony is not considered legitimate for evangelizing."
    },
    {
      "pk": 3161618,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 18,
      "text": "She kept this up for many days. But Paul, greatly annoyed, turned and said to the spirit, 'I command you in the name of Jesus Christ to come out of her.' And it left her that very moment.",
      "links": "<a href='/AIV/40/10/1'>Matt. 10:1</a>",
      "comment": "Paul’s authority is exercised through the name of Jesus, demonstrating apostolic power at work, similar to Christ’s own exorcisms."
    },
    {
      "pk": 3161619,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 19,
      "text": "But when her owners saw that their hope of profit was gone, they seized Paul and Silas and dragged them into the marketplace before the authorities.",
      "links": "<a href='/AIV/44/19/25'>Acts 19:25</a>",
      "comment": "The Gospel’s power threatens worldly interests, leading to opposition from those exploiting others."
    },
    {
      "pk": 3161620,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 20,
      "text": "And when they had brought them to the magistrates, they said, 'These men are disturbing our city. They are Jews.'",
      "links": "",
      "comment": "Ethnic and religious prejudices are exploited by the accusers."
    },
    {
      "pk": 3161621,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 21,
      "text": "'They are teaching customs that are not lawful for us as Romans to accept or practice.'",
      "links": "<a href='/AIV/44/17/7'>Acts 17:7</a>",
      "comment": "The claim is that the faith’s practices are contrary to Roman laws—a common early accusation."
    },
    {
      "pk": 3161622,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 22,
      "text": "The crowd joined in attacking them. The magistrates tore the garments off them and ordered them to be beaten with rods.",
      "links": "<a href='/AIV/47/11/25'>2 Cor. 11:25</a>",
      "comment": "Paul and Silas suffer unjustly, sharing in Christ’s own sufferings (cf. Is. 53:3; Matt. 5:11-12)."
    },
    {
      "pk": 3161623,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 23,
      "text": "And when they had inflicted many blows on them, they threw them into prison, ordering the jailer to keep them securely.",
      "links": "",
      "comment": "Imprisonment for the faith foreshadows later widespread persecution of Christians."
    },
    {
      "pk": 3161624,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 24,
      "text": "Having received such orders, he put them into the inner cell and fastened their feet in the stocks.",
      "links": "",
      "comment": "The severity of their imprisonment heightens the miraculous deliverance to come."
    },
    {
      "pk": 3161625,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 25,
      "text": "About midnight Paul and Silas were praying and singing hymns to God, and the prisoners were listening to them.",
      "links": "<a href='/AIV/19/42/8'>Ps. 42:8</a>",
      "comment": "Their praise in the midst of suffering is a model for Christian perseverance and liturgical worship even in hardship."
    },
    {
      "pk": 3161626,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 26,
      "text": "Suddenly there was a great earthquake, so that the foundations of the prison were shaken. Immediately all the doors were opened, and everyone’s chains came loose.",
      "links": "<a href='/AIV/12/19/35'>2 Kgs. 19:35</a>",
      "comment": "Miraculous deliverance is not just for Paul and Silas—everyone in the prison is affected, prefiguring the liberation from sin when the Church sings praise."
    },
    {
      "pk": 3161627,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 27,
      "text": "When the jailer woke and saw the prison doors open, he drew his sword and was about to kill himself, supposing that the prisoners had escaped.",
      "links": "<a href='/AIV/27/6/27'>Dan. 6:27</a>",
      "comment": "The jailer's reaction reflects the strict Roman penalty for lost prisoners."
    },
    {
      "pk": 3161628,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 28,
      "text": "But Paul shouted with a loud voice, 'Do not harm yourself, for we are all here!'",
      "links": "",
      "comment": "Paul’s concern for the jailer’s life shows Christian charity even to one's captors."
    },
    {
      "pk": 3161629,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 29,
      "text": "The jailer called for lights, rushed in, and trembling with fear, he fell down before Paul and Silas.",
      "links": "",
      "comment": "The jailer's response is reverence and awe—he recognizes something supernatural."
    },
    {
      "pk": 3161630,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 30,
      "text": "Then he brought them out and said, 'Sirs, what must I do to be saved?'",
      "links": "<a href='/AIV/44/2/37'>Acts 2:37</a>",
      "comment": "His question echoes the repentant in Acts 2; a key moment for teaching the integrated, sacramental path to salvation."
    },
    {
      "pk": 3161631,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 31,
      "text": "They said, 'Believe in the Lord Jesus, and you will be saved, you and your household.'",
      "links": "<a href='/AIV/43/3/16'>John 3:16</a>",
      "comment": "Faith is necessary but this declaration foreshadows the wider economy of salvation, which is further enacted through sacraments (see v.33)."
    },
    {
      "pk": 3161632,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 32,
      "text": "And they spoke the word of the Lord to him, along with everyone in his house.",
      "links": "<a href='/AIV/44/10/44'>Acts 10:44</a>",
      "comment": "The whole household receives instruction in the Gospel, not just the individual jailer, reflecting the communal scope of Christian faith."
    },
    {
      "pk": 3161633,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 33,
      "text": "He took them that very hour of the night and washed their wounds; then he and all his family were baptized at once.",
      "links": "<a href='/AIV/44/2/38'>Acts 2:38</a>",
      "comment": "Baptism immediately follows conversion—an example of the integral link between profession of faith and the sacrament of initiation."
    },
    {
      "pk": 3161634,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 34,
      "text": "Then he brought them into his house and set food before them. And he rejoiced with his whole household because he had believed in God.",
      "links": "<a href='/AIV/44/2/46'>Acts 2:46</a>",
      "comment": "Sharing a meal together is a sign of Christian fellowship, which in early Christianity often included Eucharistic celebrations."
    },
    {
      "pk": 3161635,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 35,
      "text": "When it was day, the magistrates sent their officers, saying, 'Release those men.'",
      "links": "",
      "comment": "Legal recognition of their release points to the innocence of Christian leaders."
    },
    {
      "pk": 3161636,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 36,
      "text": "The jailer reported these words to Paul, saying, 'The magistrates have sent to let you go. Now therefore, come out and go in peace.'",
      "links": "",
      "comment": "‘Go in peace’ echoes Christ’s frequent words to His followers, indicating divine favor."
    },
    {
      "pk": 3161637,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 37,
      "text": "But Paul said to them, 'They have beaten us publicly, without trial—men who are Roman citizens—and have thrown us into prison. Do they now throw us out secretly? No, let them come themselves and lead us out.'",
      "links": "<a href='/AIV/44/22/25'>Acts 22:25</a>",
      "comment": "Paul asserts his rights as a Roman, giving example to Christians of lawful defense without compromising Christian witness."
    },
    {
      "pk": 3161638,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 38,
      "text": "The officers reported these words to the magistrates. They were afraid when they heard that Paul and Silas were Roman citizens.",
      "links": "",
      "comment": "Their legal status provided protection; the early Church often benefited from Roman law."
    },
    {
      "pk": 3161639,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 39,
      "text": "So they came and apologized to them. Then they brought them out and asked them to leave the city.",
      "links": "",
      "comment": "The apology and respectful release show a public vindication of Paul and Silas."
    },
    {
      "pk": 3161640,
      "translation": "AIV",
      "book": 44,
      "chapter": 16,
      "verse": 40,
      "text": "After leaving the prison, they visited Lydia. When they had seen the brothers and encouraged them, they departed.",
      "links": "<a href='/AIV/44/16/15'>Acts 16:15</a>",
      "comment": "Paul’s visit to Lydia emphasizes the role of her house as an early center for Christian gathering, signifying the beginning of local structured communities with lay leaders and communal prayer."
    }
  ],
  "translatedAt": "2025-12-23T03:23:22.034Z"
}