{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 5,
  "verses": [
    {
      "pk": 2005001,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 1,
      "text": "But a man named Ananias, together with his wife Sapphira, sold a piece of property.",
      "links": "",
      "comment": "This begins the account contrasting true communal generosity with hypocrisy. The context shows the seriousness of dishonesty before God (cf. Joshua 7:1)."
    },
    {
      "pk": 2005002,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 2,
      "text": "He kept back part of the money for himself, with his wife’s full knowledge, and brought a portion and laid it at the apostles’ feet.",
      "links": "<a href='/AIV/44/4/34-37'>Acts 4:34-37</a>",
      "comment": "‘Laid it at the apostles’ feet’ is an expression showing submission to church authority and stewardship (see Acts 4:35)."
    },
    {
      "pk": 2005003,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 3,
      "text": "Peter said, ‘Ananias, why has Satan filled your heart to lie to the Holy Spirit and keep back part of the proceeds of the land?’",
      "links": "<a href='/AIV/43/13/2'>John 13:2</a>",
      "comment": "Peter’s discernment comes through a spiritual gift and authority in the community. The reference to lying to the Holy Spirit affirms the Spirit’s personal divinity."
    },
    {
      "pk": 2005004,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 4,
      "text": "‘While it remained unsold, was it not your own? And after it was sold, was the money not at your disposal? Why have you conceived this deed in your heart? You have not lied to men but to God.’",
      "links": "<a href='/AIV/19/51/4'>Psalm 51:4</a>",
      "comment": "Peter declares the gravity of lying to God, affirming the Holy Spirit’s divine status (see also Isaiah 63:10)."
    },
    {
      "pk": 2005005,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 5,
      "text": "When Ananias heard these words, he fell down and died. Great fear came on all those who heard about it.",
      "links": "<a href='/AIV/3/10/1-2'>Leviticus 10:1-2</a>",
      "comment": "Immediate judgment recalls Old Testament acts of divine discipline for sacrilege in worship (cf. Leviticus 10:1–2, Numbers 16:1–35)."
    },
    {
      "pk": 2005006,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 6,
      "text": "The young men arose, wrapped him up, and carried him out to bury him.",
      "links": "<a href='/AIV/8/18/19'>1 Samuel 18:19</a>",
      "comment": "Burial customs are quickly executed, honoring the seriousness of defiling holy community."
    },
    {
      "pk": 2005007,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 7,
      "text": "After about three hours, his wife came in, not knowing what had happened.",
      "links": "",
      "comment": "A separation in time heightens the dramatic nature and justice of God’s response."
    },
    {
      "pk": 2005008,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 8,
      "text": "Peter said to her, ‘Tell me whether you sold the land for this price.’ She said, ‘Yes, for that price.’",
      "links": "",
      "comment": "Peter’s questioning reveals not only truth but also the leadership’s call to transparency and accountability."
    },
    {
      "pk": 2005009,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 9,
      "text": "Then Peter said to her, ‘How is it that you have agreed together to test the Spirit of the Lord? Look, the feet of those who buried your husband are at the door, and they will carry you out as well.’",
      "links": "<a href='/AIV/24/23/24'>Jeremiah 23:24</a>",
      "comment": "Testing God’s Spirit recalls warnings against trying the Lord in the wilderness (Deuteronomy 6:16)."
    },
    {
      "pk": 2005010,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 10,
      "text": "Immediately she fell down at his feet and died. When the young men came in, they found her dead, and carried her out and buried her beside her husband.",
      "links": "",
      "comment": "The repetition of immediate judgment enforces reverence for the things of God, especially concerning stewardship."
    },
    {
      "pk": 2005011,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 11,
      "text": "And great fear came upon the whole church, and upon all who heard these things.",
      "links": "<a href='/AIV/44/2/43'>Acts 2:43</a>",
      "comment": "The term 'church' here indicates the gathered community under apostolic authority. It marks the first direct reference to the word in Acts."
    },
    {
      "pk": 2005012,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 12,
      "text": "Many signs and wonders were done among the people by the hands of the apostles. They were all together in Solomon’s Colonnade.",
      "links": "<a href='/AIV/44/3/11'>Acts 3:11</a>",
      "comment": "The gathering at Solomon’s Colonnade reflects continuity with Jewish tradition and the open witness before all (cf. Acts 3:11)."
    },
    {
      "pk": 2005013,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 13,
      "text": "None of the rest dared join them, but the people held them in high esteem.",
      "links": "",
      "comment": "This verse highlights the unique holiness and distinctiveness of the apostolic community. There's a reverent awe among outsiders."
    },
    {
      "pk": 2005014,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 14,
      "text": "Yet more believers in the Lord, men and women, were added to their number.",
      "links": "<a href='/AIV/44/2/41'>Acts 2:41</a>",
      "comment": "God continues to grow the Church through the apostolic ministry, fulfilling Jesus’ promise to build his community (cf. Matthew 16:18)."
    },
    {
      "pk": 2005015,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 15,
      "text": "People even carried the sick out into the streets and laid them on cots and mats, so that as Peter passed by, at least his shadow might fall on some of them.",
      "links": "<a href='/AIV/40/9/20-21'>Matthew 9:20-21</a>",
      "comment": "The extraordinary acts through Peter recall similar acts by Jesus and the prophets (cf. Matthew 9:20-21; 2 Kings 4:29-37)."
    },
    {
      "pk": 2005016,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 16,
      "text": "Crowds gathered from the towns around Jerusalem, bringing the sick and those tormented by unclean spirits, and they were all healed.",
      "links": "<a href='/AIV/40/4/24'>Matthew 4:24</a>",
      "comment": "The scope is expanding, prefiguring the mission beyond Jerusalem. Healing continues through apostolic ministry, reflecting Christ’s own miracles."
    },
    {
      "pk": 2005017,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 17,
      "text": "But the high priest rose up, along with all those who were with him (that is, the party of the Sadducees), and they were filled with jealousy.",
      "links": "<a href='/AIV/40/27/18'>Matthew 27:18</a>",
      "comment": "The religious authorities’ opposition was motivated by envy, as with Jesus (cf. Matthew 27:18)."
    },
    {
      "pk": 2005018,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 18,
      "text": "They arrested the apostles and put them in the public prison.",
      "links": "<a href='/AIV/44/4/3'>Acts 4:3</a>",
      "comment": "This follows a pattern of persecution of God’s messengers, seen throughout biblical history."
    },
    {
      "pk": 2005019,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 19,
      "text": "But during the night, an angel of the Lord opened the prison doors and brought them out.",
      "links": "<a href='/AIV/12/6/17'>2 Kings 6:17</a>",
      "comment": "Angelic deliverance echoes Old Testament rescues of God’s servants (cf. Daniel 6:22, 2 Kings 6:17)."
    },
    {
      "pk": 2005020,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 20,
      "text": "The angel said, 'Go and stand in the temple, and tell the people all about this life.'",
      "links": "<a href='/AIV/44/3/11'>Acts 3:11</a>",
      "comment": "‘This life’ speaks to the fullness of salvation and the new way opened through Jesus."
    },
    {
      "pk": 2005021,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 21,
      "text": "When they heard this, they entered the temple at daybreak and began to teach. Now when the high priest and those with him arrived, they called together the council, all the elders of Israel, and sent to the prison to have them brought.",
      "links": "",
      "comment": "The apostles’ obedience underscores authority through divine command before human courts."
    },
    {
      "pk": 2005022,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 22,
      "text": "But when the officers came, they did not find them in the prison. So they returned and reported,",
      "links": "",
      "comment": "Divine intervention frustrates earthly powers and advances God’s plan."
    },
    {
      "pk": 2005023,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 23,
      "text": "'We found the prison locked, and the guards standing at the doors, but when we opened them, we found no one inside.'",
      "links": "",
      "comment": "The miraculous nature of the escape highlights God’s protection of His servants."
    },
    {
      "pk": 2005024,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 24,
      "text": "When the captain of the temple and the chief priests heard these words, they wondered what this would lead to.",
      "links": "",
      "comment": "Jerusalem’s leaders are repeatedly confounded by God’s power at work through His messengers."
    },
    {
      "pk": 2005025,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 25,
      "text": "Then someone came and told them, 'Look, the men you put in prison are standing in the temple and teaching the people!'",
      "links": "<a href='/AIV/44/4/19-20'>Acts 4:19-20</a>",
      "comment": "The apostles' boldness to teach regardless of cost echoes their prior conviction (Acts 4:19-20)."
    },
    {
      "pk": 2005026,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 26,
      "text": "Then the captain went with the officers and brought them, but not by force, for they were afraid of being stoned by the people.",
      "links": "",
      "comment": "Public esteem for the apostles keeps the authorities cautious; the community recognizes divine intervention."
    },
    {
      "pk": 2005027,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 27,
      "text": "When they had brought them, they set them before the council, and the high priest questioned them,",
      "links": "",
      "comment": "The apostles stand before the Sanhedrin, recalling Jesus’ own trial."
    },
    {
      "pk": 2005028,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 28,
      "text": "'We strictly ordered you not to teach in this name. Yet here you have filled Jerusalem with your teaching, and you intend to bring this man’s blood upon us.'",
      "links": "<a href='/AIV/40/27/25'>Matthew 27:25</a>",
      "comment": "'This man’s blood’ refers to responsibility for Jesus’ death (see Matthew 27:25). The apostles’ teaching is already reshaping Jerusalem’s spiritual landscape."
    },
    {
      "pk": 2005029,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 29,
      "text": "But Peter and the apostles answered, 'We must obey God rather than men.'",
      "links": "<a href='/AIV/44/4/19'>Acts 4:19</a>; <a href='/AIV/27/3/18'>Daniel 3:18</a>",
      "comment": "The primacy of obedience to God above human authority echoes Daniel’s example (Daniel 3:18)."
    },
    {
      "pk": 2005030,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 30,
      "text": "'The God of our fathers raised up Jesus, whom you killed by hanging him on a tree.'",
      "links": "<a href='/AIV/5/21/23'>Deuteronomy 21:23</a>",
      "comment": "‘Hanging on a tree’ references the curse in Deuteronomy 21:23, fulfilled in Christ’s sacrificial death."
    },
    {
      "pk": 2005031,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 31,
      "text": "'God exalted him at his right hand as Leader and Savior, to give repentance to Israel and forgiveness of sins.'",
      "links": "<a href='/AIV/19/110/1'>Psalm 110:1</a>",
      "comment": "Christ’s exaltation at God’s right hand fulfills Old Testament prophecy (Psalm 110:1), establishing Him as both ruler and source of forgiveness."
    },
    {
      "pk": 2005032,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 32,
      "text": "'We are witnesses of these things, and so is the Holy Spirit, whom God has given to those who obey him.'",
      "links": "<a href='/AIV/44/2/4'>Acts 2:4</a>",
      "comment": "Apostolic witness—empowered by the Holy Spirit—is the foundation of the Church’s teaching and authority."
    },
    {
      "pk": 2005033,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 33,
      "text": "When they heard this, they were enraged and wanted to kill them.",
      "links": "",
      "comment": "Like the prophets, the apostles face intense opposition, sharing in Christ’s sufferings (see Matthew 5:11-12)."
    },
    {
      "pk": 2005034,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 34,
      "text": "But a Pharisee named Gamaliel, a teacher of the law, respected by all the people, stood up in the council and ordered that the men be put outside for a little while.",
      "links": "<a href='/AIV/44/22/3'>Acts 22:3</a>",
      "comment": "Gamaliel’s role is significant; he later teaches Paul (Acts 22:3)."
    },
    {
      "pk": 2005035,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 35,
      "text": "He said to them, 'Men of Israel, consider carefully what you intend to do to these men.'",
      "links": "",
      "comment": "Gamaliel counsels wisdom and restraint, reflecting God's sovereignty over human plans."
    },
    {
      "pk": 2005036,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 36,
      "text": "'For before these days Theudas rose up, claiming to be somebody, and a number of men about four hundred joined him. He was killed, and all who followed him were scattered and came to nothing.'",
      "links": "",
      "comment": "Gamaliel recalls failed movements, contrasting them with the enduring nature of Christ’s Church."
    },
    {
      "pk": 2005037,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 37,
      "text": "'After him, Judas the Galilean arose in the days of the census and led a revolt. He too perished, and all his followers were scattered.'",
      "links": "",
      "comment": "As above, human-led movements falter, while God-ordained mission endures."
    },
    {
      "pk": 2005038,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 38,
      "text": "'So in the present case I say to you, keep away from these men and let them alone, for if this plan or this work is of men, it will fail;'",
      "links": "",
      "comment": "The principle: only God’s designs truly prosper; human plans without Him will fail."
    },
    {
      "pk": 2005039,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 39,
      "text": "'But if it is of God, you will not be able to overthrow them. You may even be found fighting against God.' So they took his advice.",
      "links": "<a href='/AIV/18/42/2'>Job 42:2</a>",
      "comment": "God’s purposes will always stand—echoing the certainty of His sovereignty (Job 42:2)."
    },
    {
      "pk": 2005040,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 40,
      "text": "They called in the apostles, beat them, and commanded them not to speak in the name of Jesus, then let them go.",
      "links": "",
      "comment": "Physical suffering is part of the Church’s early witness; the apostles are persecuted yet remain faithful."
    },
    {
      "pk": 2005041,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 41,
      "text": "So they departed from the presence of the council, rejoicing that they were counted worthy to suffer dishonor for the Name.",
      "links": "<a href='/AIV/40/5/11-12'>Matthew 5:11-12</a>",
      "comment": "Their joy in suffering for Jesus reflects the beatitudes; martyrdom was seen as a blessing (Matthew 5:11-12)."
    },
    {
      "pk": 2005042,
      "translation": "AIV",
      "book": 44,
      "chapter": 5,
      "verse": 42,
      "text": "And every day, in the temple and from house to house, they never stopped teaching and proclaiming Jesus as the Messiah.",
      "links": "<a href='/AIV/44/2/46'>Acts 2:46</a>",
      "comment": "Both public and private ministry are marks of apostolic authority. This continual stewardship is the foundation of the Church’s unity and sacramental life."
    }
  ],
  "translatedAt": "2025-12-23T03:15:22.225Z"
}