{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 10,
  "verses": [
    {
      "pk": 1940010,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 1,
      "text": "At Caesarea there was a man named Cornelius, a centurion of what was called the Italian Regiment.",
      "links": "<a href='/AIV/42/7/2'>Luke 7:2</a>; <a href='/AIV/44/8/40'>Acts 8:40</a>",
      "comment": "Cornelius, a Gentile and Roman officer, becomes the first non-Jewish convert through the apostles. This signals the opening of salvation to the Gentiles by divine initiative, a fulfillment promised in the Old Testament (Isaiah 49:6)."
    },
    {
      "pk": 1940011,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 2,
      "text": "He was a devout man who feared God with all his household, giving generously to the people and continually praying to God.",
      "links": "<a href='/AIV/44/13/16'>Acts 13:16</a>; <a href='/AIV/44/16/14'>Acts 16:14</a>",
      "comment": "Cornelius is described as a 'God-fearer,' a Gentile who worshiped the God of Israel but was not a proselyte. His example shows the universality of God's offer of salvation."
    },
    {
      "pk": 1940012,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 3,
      "text": "About the ninth hour of the day, he saw clearly in a vision an angel of God come in and say to him, 'Cornelius.'",
      "links": "<a href='/AIV/44/3/1'>Acts 3:1</a>; <a href='/AIV/27/9/21'>Daniel 9:21</a>",
      "comment": "The ninth hour (about 3 pm) was a traditional hour of prayer (compare Acts 3:1)."
    },
    {
      "pk": 1940013,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 4,
      "text": "He looked at him, filled with fear, and said, 'What is it, Lord?' The angel said, 'Your prayers and your gifts to the poor have gone up as a memorial before God.'",
      "links": "<a href='/AIV/27/10/12'>Daniel 10:12</a>; <a href='/AIV/66/8/4'>Revelation 8:4</a>",
      "comment": "God's recognition of Cornelius’ prayers and almsgiving shows their value before God (Tobit 12:12). There is an implicit affirmation of works done in faith."
    },
    {
      "pk": 1940014,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 5,
      "text": "Now send men to Joppa and bring a man named Simon, who is also called Peter.",
      "links": "<a href='/AIV/44/9/36-43'>Acts 9:36-43</a>",
      "comment": "Peter is again the central apostolic figure, demonstrating the primacy among the apostles."
    },
    {
      "pk": 1940015,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 6,
      "text": "He is staying with a tanner named Simon, whose house is by the sea.'",
      "links": "<a href='/AIV/44/9/43'>Acts 9:43</a>",
      "comment": "Staying with a tanner, considered ritually unclean, illustrates the breaking down of barriers."
    },
    {
      "pk": 1940016,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 7,
      "text": "When the angel who spoke to him had gone away, Cornelius called two of his household servants and a devout soldier from those who attended him.",
      "links": "",
      "comment": "Cornelius’ obedience is immediate, showing faith in the message."
    },
    {
      "pk": 1940017,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 8,
      "text": "Having explained everything to them, he sent them to Joppa.",
      "links": "",
      "comment": "Obedience to God’s command, even before full understanding, is presented as virtuous."
    },
    {
      "pk": 1940018,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 9,
      "text": "The next day, as they were traveling and approaching the city, Peter went up on the housetop to pray, about the sixth hour.",
      "links": "<a href='/AIV/44/10/3'>Acts 10:3</a>; <a href='/AIV/42/6/12'>Luke 6:12</a>",
      "comment": "The sixth hour (noon) was another hour of prayer, showing the importance of regular set prayer in apostolic practice."
    },
    {
      "pk": 1940019,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 10,
      "text": "He became hungry and wanted to eat, but while they were preparing food, he fell into a trance.",
      "links": "<a href='/AIV/44/22/17'>Acts 22:17</a>",
      "comment": "Peter’s hunger is linked with the vision, indicating a symbolic connection to food laws."
    },
    {
      "pk": 1940020,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 11,
      "text": "He saw heaven opened and a certain object coming down, like a large sheet lowered to the earth by its four corners.",
      "links": "<a href='/AIV/44/7/56'>Acts 7:56</a>; <a href='/AIV/66/4/1'>Revelation 4:1</a>",
      "comment": "Heaven opened points to divine intervention and revelation, echoing Old Testament visions."
    },
    {
      "pk": 1940021,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 12,
      "text": "In it were all kinds of four-footed animals and reptiles of the earth and birds of the sky.",
      "links": "<a href='/AIV/03/11/2-47'>Leviticus 11:2-47</a>",
      "comment": "These animals represent clean and unclean animals, according to the Mosaic law."
    },
    {
      "pk": 1940022,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 13,
      "text": "A voice came to him: 'Get up, Peter; kill and eat.'",
      "links": "<a href='/AIV/01/9/3'>Genesis 9:3</a>; <a href='/AIV/44/11/7'>Acts 11:7</a>",
      "comment": "The command challenges the distinction between clean and unclean, preparing Peter for the inclusion of Gentiles."
    },
    {
      "pk": 1940023,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 14,
      "text": "But Peter said, 'By no means, Lord; for I have never eaten anything that is common or unclean.'",
      "links": "<a href='/AIV/03/11/4'>Leviticus 11:4</a>; <a href='/AIV/26/4/14'>Ezekiel 4:14</a>",
      "comment": "Peter’s adherence to Jewish law highlights the radical nature of the vision."
    },
    {
      "pk": 1940024,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 15,
      "text": "The voice spoke to him again, a second time, 'What God has cleansed, you must not call common.'",
      "links": "<a href='/AIV/44/15/9'>Acts 15:9</a>; <a href='/AIV/45/14/14'>Romans 14:14</a>",
      "comment": "God’s declaration redefines purity. The change comes through direct divine authority."
    },
    {
      "pk": 1940025,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 16,
      "text": "This happened three times, and immediately the object was taken up into heaven.",
      "links": "<a href='/AIV/44/11/10'>Acts 11:10</a>; <a href='/AIV/43/21/15-17'>John 21:15-17</a>",
      "comment": "The repetition three times symbolizes completeness, often emphasizing certainty or importance."
    },
    {
      "pk": 1940026,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 17,
      "text": "Now while Peter was greatly perplexed about what the vision might mean, behold, the men who were sent by Cornelius had made inquiry for Simon’s house and stood at the gate.",
      "links": "",
      "comment": "Peter’s confusion shows the depth of change that is taking place in the early Church."
    },
    {
      "pk": 1940027,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 18,
      "text": "They called out and asked whether Simon, who was also called Peter, was staying there.",
      "links": "<a href='/AIV/44/10/5'>Acts 10:5</a>",
      "comment": "The repetition serves as confirmation of God’s providential guidance."
    },
    {
      "pk": 1940028,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 19,
      "text": "While Peter was thinking about the vision, the Spirit said to him, 'Behold, three men are looking for you.'",
      "links": "<a href='/AIV/44/8/29'>Acts 8:29</a>",
      "comment": "The Holy Spirit’s direct guidance underscores both Peter’s leadership and continual active revelation in the Church."
    },
    {
      "pk": 1940029,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 20,
      "text": "Get up and go downstairs. Go with them, doubting nothing, for I have sent them.'",
      "links": "<a href='/AIV/44/8/26'>Acts 8:26</a>",
      "comment": "Being sent by the Spirit indicates divine initiative, removing the need for doubt in following God's will."
    },
    {
      "pk": 1940030,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 21,
      "text": "Peter went down to the men and said, 'I am the one you are looking for. Why have you come?'",
      "links": "",
      "comment": "Peter’s openness and hospitality are significant, softening the social boundaries."
    },
    {
      "pk": 1940031,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 22,
      "text": "They said, 'Cornelius, a centurion, an upright and God-fearing man, well spoken of by the whole Jewish nation, was instructed by a holy angel to send for you to come to his house and to hear words from you.'",
      "links": "<a href='/AIV/44/10/1-8'>Acts 10:1-8</a>",
      "comment": "The testimony emphasizes Cornelius’ virtue and God’s direct intervention."
    },
    {
      "pk": 1940032,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 23,
      "text": "So he invited them in and gave them lodging. The next day he rose and went out with them, and some of the brothers from Joppa accompanied him.",
      "links": "<a href='/AIV/44/11/12'>Acts 11:12</a>",
      "comment": "Peter’s hospitality is an important sign of Christian unity and acceptance."
    },
    {
      "pk": 1940033,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 24,
      "text": "The following day they entered Caesarea. Cornelius was expecting them and had called together his relatives and close friends.",
      "links": "",
      "comment": "Cornelius’ evangelistic impulse points to the spread of the faith through households."
    },
    {
      "pk": 1940034,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 25,
      "text": "When Peter entered, Cornelius met him and fell at his feet and worshiped him.",
      "links": "<a href='/AIV/66/22/8-9'>Revelation 22:8-9</a>",
      "comment": "While veneration is shown, Peter’s response will clarify the proper attitude toward apostolic authority."
    },
    {
      "pk": 1940035,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 26,
      "text": "But Peter lifted him up, saying, 'Stand up; I myself am also a man.'",
      "links": "<a href='/AIV/44/14/15'>Acts 14:15</a>",
      "comment": "Peter’s humility is a model for all apostolic and episcopal ministry."
    },
    {
      "pk": 1940036,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 27,
      "text": "As he talked with him, he went in and found many people gathered.",
      "links": "",
      "comment": "The gathering of a household highlights collective faith and communal worship."
    },
    {
      "pk": 1940037,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 28,
      "text": "He said to them, 'You yourselves know how unlawful it is for a Jewish man to associate with or visit a foreigner, but God has shown me that I should not call any person common or unclean.'",
      "links": "<a href='/AIV/44/11/12'>Acts 11:12</a>; <a href='/AIV/03/20/26'>Leviticus 20:26</a>",
      "comment": "Peter recognizes that the Mosaic distinction is now overcome by God’s revelation; Gentiles are to be welcomed."
    },
    {
      "pk": 1940038,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 29,
      "text": "Therefore, when I was sent for, I came without objection. So I ask, why have you sent for me?'",
      "links": "",
      "comment": "Peter is obedient to God’s direction, modeling the submission called for in apostolic mission."
    },
    {
      "pk": 1940039,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 30,
      "text": "Cornelius said, 'Four days ago to this hour, I was praying in my house at the ninth hour, and behold, a man stood before me in shining clothing,",
      "links": "<a href='/AIV/44/10/3'>Acts 10:3</a>",
      "comment": "The angelic visitation in answer to Cornelius’ persistence in prayer reveals God’s generous response."
    },
    {
      "pk": 1940040,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 31,
      "text": "and said, 'Cornelius, your prayer has been heard and your gifts to the poor are remembered before God.'",
      "links": "<a href='/AIV/44/10/4'>Acts 10:4</a>",
      "comment": "Prayer and works of mercy are both pleasing before God, and are shown to be instruments by which God acts."
    },
    {
      "pk": 1940041,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 32,
      "text": "Send therefore to Joppa and ask for Simon, who is called Peter. He is lodging in the house of Simon, a tanner, by the sea.'",
      "links": "<a href='/AIV/44/10/5-6'>Acts 10:5-6</a>",
      "comment": "Repetition highlights how precise God’s guidance is."
    },
    {
      "pk": 1940042,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 33,
      "text": "So I sent for you at once, and you have done well to come. Now therefore we are all here in the presence of God to hear all that you have been commanded by the Lord.'",
      "links": "",
      "comment": "There is a notable readiness to receive apostolic teaching, which is a mark of genuine faith."
    },
    {
      "pk": 1940043,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 34,
      "text": "So Peter opened his mouth and said: 'Truly I understand that God does not show partiality,",
      "links": "<a href='/AIV/05/10/17'>Deuteronomy 10:17</a>; <a href='/AIV/45/2/11'>Romans 2:11</a>",
      "comment": "Peter’s declaration affirms the universality of salvation, foreshadowed in the prophets."
    },
    {
      "pk": 1940044,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 35,
      "text": "but in every nation anyone who fears Him and does what is right is acceptable to Him.",
      "links": "<a href='/AIV/19/15/1-2'>Psalm 15:1-2</a>; <a href='/AIV/40/8/11'>Matthew 8:11</a>",
      "comment": "Doing what is right is joined with faith—a classic example of faith and works in harmony leading to salvation."
    },
    {
      "pk": 1940045,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 36,
      "text": "As for the word that He sent to the children of Israel, preaching good news of peace through Jesus Christ—He is Lord of all—",
      "links": "<a href='/AIV/23/52/7'>Isaiah 52:7</a>; <a href='/AIV/49/2/17'>Ephesians 2:17</a>",
      "comment": "Jesus is declared 'Lord of all,' affirming divinity and the fulfillment of Isaiah's prophecy of peace."
    },
    {
      "pk": 1940046,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 37,
      "text": "you yourselves know what happened throughout all Judea, beginning from Galilee after the baptism that John proclaimed:",
      "links": "<a href='/AIV/40/3/1-6'>Matthew 3:1-6</a>",
      "comment": "John’s baptism marks the start of Jesus’ public ministry, tying Old and New Testament prophetic fulfillment together."
    },
    {
      "pk": 1940047,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 38,
      "text": "how God anointed Jesus of Nazareth with the Holy Spirit and with power, and He went about doing good and healing all who were oppressed by the devil, for God was with Him.",
      "links": "<a href='/AIV/23/61/1'>Isaiah 61:1</a>; <a href='/AIV/40/4/23'>Matthew 4:23</a>",
      "comment": "The anointing with the Holy Spirit highlights Jesus’ divinely appointed mission and manifests the ministry of healing and liberation, fulfilling Isaiah’s prophecy."
    },
    {
      "pk": 1940048,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 39,
      "text": "We are witnesses of all that He did both in the country of the Jews and in Jerusalem. They put Him to death by hanging Him on a tree.",
      "links": "<a href='/AIV/05/21/22-23'>Deuteronomy 21:22-23</a>; <a href='/AIV/44/5/30'>Acts 5:30</a>",
      "comment": "The reference to the 'tree' echoes the curse in the Mosaic Law (Deuteronomy)."
    },
    {
      "pk": 1940049,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 40,
      "text": "But God raised Him up on the third day and made Him manifest,",
      "links": "<a href='/AIV/19/16/10'>Psalm 16:10</a>; <a href='/AIV/40/28/1-10'>Matthew 28:1-10</a>",
      "comment": "Resurrection is the cornerstone of apostolic preaching, fulfilling Old Testament prophecy."
    },
    {
      "pk": 1940050,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 41,
      "text": "not to all the people, but to witnesses who had been chosen beforehand by God—to us who ate and drank with Him after He rose from the dead.",
      "links": "<a href='/AIV/42/24/43'>Luke 24:43</a>; <a href='/AIV/43/21/13'>John 21:13</a>",
      "comment": "The physicality of Jesus' post-Resurrection appearances emphasizes the reality of the Resurrection. The chosen witnesses have a unique authority."
    },
    {
      "pk": 1940051,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 42,
      "text": "He commanded us to preach to the people and to testify that He is the one appointed by God to be judge of the living and the dead.",
      "links": "<a href='/AIV/40/25/31-46'>Matthew 25:31-46</a>; <a href='/AIV/47/5/10'>2 Corinthians 5:10</a>",
      "comment": "Christ's role as universal judge underscores His sovereignty and divinity."
    },
    {
      "pk": 1940052,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 43,
      "text": "To Him all the prophets bear witness that everyone who believes in Him receives forgiveness of sins through His name.'",
      "links": "<a href='/AIV/23/53/11'>Isaiah 53:11</a>; <a href='/AIV/24/31/34'>Jeremiah 31:34</a>; <a href='/AIV/40/1/21'>Matthew 1:21</a>",
      "comment": "Prophets foretold the forgiveness of sins in the Messiah. Faith in Him is presented as the means, yet elsewhere (e.g., John 20:23) forgiveness is mediated by apostolic authority."
    },
    {
      "pk": 1940053,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 44,
      "text": "While Peter was still speaking these words, the Holy Spirit fell on all who heard the word.",
      "links": "<a href='/AIV/44/2/4'>Acts 2:4</a>; <a href='/AIV/44/11/15'>Acts 11:15</a>",
      "comment": "The descent of the Holy Spirit here parallels Pentecost, showing unity among all believers."
    },
    {
      "pk": 1940054,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 45,
      "text": "And the believers from among the circumcised who came with Peter were amazed, because the gift of the Holy Spirit had been poured out even on the Gentiles.",
      "links": "<a href='/AIV/44/2/17'>Acts 2:17</a>; <a href='/AIV/44/11/17'>Acts 11:17</a>",
      "comment": "This demonstration confirms that God gives the Spirit generously, regardless of ethnic background."
    },
    {
      "pk": 1940055,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 46,
      "text": "For they were hearing them speaking in tongues and magnifying God. Then Peter said,",
      "links": "<a href='/AIV/44/2/4'>Acts 2:4</a>; <a href='/AIV/44/19/6'>Acts 19:6</a>",
      "comment": "The gift of tongues is a sign of the presence of the Holy Spirit and the unity of believers."
    },
    {
      "pk": 1940056,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 47,
      "text": "‘Can anyone withhold water for baptizing these people, who have received the Holy Spirit just as we have?’",
      "links": "<a href='/AIV/44/8/36'>Acts 8:36</a>; <a href='/AIV/44/11/17'>Acts 11:17</a>",
      "comment": "Baptism is immediately administered as an essential entry into the Christian community—baptism's necessity is clearly implied."
    },
    {
      "pk": 1940057,
      "translation": "AIV",
      "book": 44,
      "chapter": 10,
      "verse": 48,
      "text": "And he commanded them to be baptized in the name of Jesus Christ. Then they asked him to remain for some days.",
      "links": "<a href='/AIV/40/28/19'>Matthew 28:19</a>; <a href='/AIV/44/2/38'>Acts 2:38</a>",
      "comment": "Apostolic authority to command and administer baptism indicates the Church’s sacramental life from the very beginning. The 'remaining' suggests a time of catechesis and deeper formation in the faith."
    }
  ],
  "translatedAt": "2025-12-23T03:19:26.381Z"
}