{
  "book": 51,
  "bookName": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 17,
  "verses": [
    {
      "pk": 51017001,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 1,
      "text": "Now when they had passed through Amphipolis and Apollonia, they came to Thessalonica, where there was a synagogue of the Jews.",
      "links": "<a href='/AIV/52/1/1'>1 Thess. 1:1</a>",
      "comment": "Paul’s custom was to seek out synagogues to begin his mission among fellow Jews. The mention of Thessalonica’s synagogue sets the stage for the next verses where Paul proclaims Christ in accordance with the Scriptures."
    },
    {
      "pk": 51017002,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 2,
      "text": "As was his custom, Paul went in, and on three Sabbath days he reasoned with them from the Scriptures,",
      "links": "<a href='/AIV/44/13/14'>Acts 13:14</a>; <a href='/AIV/44/9/20'>Acts 9:20</a>",
      "comment": "Paul's method included using Scripture as the foundation for his arguments. He teaches systematically, highlighting an early apostolic tradition of explaining faith over time."
    },
    {
      "pk": 51017003,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 3,
      "text": "explaining and proving that it was necessary for the Christ to suffer and to rise from the dead, and saying, 'This Jesus whom I proclaim to you is the Christ.'",
      "links": "<a href='/AIV/23/53/3-12'>Isa. 53:3-12</a>; <a href='/AIV/19/16/10'>Ps. 16:10</a>; <a href='/AIV/44/2/31'>Acts 2:31</a>",
      "comment": "Paul connects prophecy (Isaiah and Psalms) with Jesus' suffering and resurrection, showing fulfillment of Old Testament prophecy. He presents Jesus as the awaited Messiah (Christ)."
    },
    {
      "pk": 51017004,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 4,
      "text": "Some of them were persuaded and joined Paul and Silas, along with a large number of God-fearing Greeks and not a few prominent women.",
      "links": "<a href='/AIV/44/13/43'>Acts 13:43</a>",
      "comment": "Many Gentiles and influential women responded to the message, showing the early church's growing diversity. The faith spreads both to Jews and Gentile believers."
    },
    {
      "pk": 51017005,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 5,
      "text": "But the Jews, being jealous, took some wicked men from the marketplace, and forming a mob, set the city in an uproar. They attacked Jason’s house, seeking to bring them out to the people.",
      "links": "<a href='/AIV/44/13/45'>Acts 13:45</a>",
      "comment": "As in other cities, opposition arises due to jealousy, leading to violence. Early Christians often faced persecution due to misunderstanding and opposition."
    },
    {
      "pk": 51017006,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 6,
      "text": "When they did not find them, they dragged Jason and some other brothers before the city officials, shouting, 'These men who have turned the world upside down have come here also,",
      "links": "<a href='/AIV/44/16/20'>Acts 16:20</a>",
      "comment": "The charge against the believers implies the powerful and revolutionary nature of the gospel, which challenges existing social and spiritual orders."
    },
    {
      "pk": 51017007,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 7,
      "text": "and Jason has welcomed them. They are all acting against the decrees of Caesar, saying that there is another king—Jesus.'",
      "links": "<a href='/AIV/42/23/2'>Luke 23:2</a>; <a href='/AIV/40/2/2'>Matt. 2:2</a>",
      "comment": "Proclaiming Jesus as king was seen as political rebellion. The kingdom of God is spiritually superior to earthly authority, highlighting Christ’s unique and sovereign kingship."
    },
    {
      "pk": 51017008,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 8,
      "text": "The city officials and the crowd were disturbed when they heard these things.",
      "links": "",
      "comment": "The gospel message provokes strong reactions, reflecting how the announcement of Jesus’ kingship challenged both religious and civic authorities."
    },
    {
      "pk": 51017009,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 9,
      "text": "And when they had taken security from Jason and the rest, they let them go.",
      "links": "",
      "comment": "Bail or security was taken; this hints at the risk and cost involved for early Christians, even for those who supported the missionaries."
    },
    {
      "pk": 51017010,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 10,
      "text": "The brothers immediately sent Paul and Silas away by night to Berea. When they arrived, they went into the synagogue of the Jews.",
      "links": "<a href='/AIV/44/8/1'>Acts 8:1</a>",
      "comment": "Paul and Silas escape persecution and continue their mission. Their immediate return to a synagogue demonstrates perseverance and a desire to reach all people with the gospel."
    },
    {
      "pk": 51017011,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 11,
      "text": "Now these Jews were more noble than those in Thessalonica; they received the word with all eagerness, examining the Scriptures daily to see if these things were so.",
      "links": "<a href='/AIV/19/1/2'>Ps. 1:2</a>",
      "comment": "The Bereans are praised for their openness and diligence in studying the Scriptures, a model for faithful seekers. Their example highlights the importance of both openness and discernment in receiving apostolic teaching."
    },
    {
      "pk": 51017012,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 12,
      "text": "Many of them therefore believed, with not a few Greek women of high standing as well as men.",
      "links": "",
      "comment": "Both Jews and Greeks respond in faith, including prominent women, illustrating God’s call to all social classes and the growing universality of the new covenant community."
    },
    {
      "pk": 51017013,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 13,
      "text": "But when the Jews from Thessalonica learned that the word of God was proclaimed by Paul at Berea also, they came there too, agitating and stirring up the crowds.",
      "links": "",
      "comment": "Persistent opposition to the message of Christ followed the apostles from city to city, reflecting the suffering that often marks the journey of proclaiming truth."
    },
    {
      "pk": 51017014,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 14,
      "text": "Then the brothers immediately sent Paul away to the sea, but Silas and Timothy remained there.",
      "links": "<a href='/AIV/52/3/1-2'>1 Thess. 3:1-2</a>",
      "comment": "For safety, Paul leaves but others remain to strengthen the new believers, showing the communal nature of leadership in the church and the importance of continuity."
    },
    {
      "pk": 51017015,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 15,
      "text": "Those who escorted Paul brought him as far as Athens, and after receiving instructions for Silas and Timothy to come to him as soon as possible, they departed.",
      "links": "",
      "comment": "Paul’s companions are sent for, revealing the value of team ministry and the bonds of fellowship in early missionary work."
    },
    {
      "pk": 51017016,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 16,
      "text": "Now while Paul was waiting for them at Athens, his spirit was provoked within him as he saw that the city was full of idols.",
      "links": "<a href='/AIV/45/1/21-23'>Rom. 1:21-23</a>",
      "comment": "Paul’s distress at the idolatry of Athens demonstrates his zeal for the worship of the one true God. The city’s spiritual state compels him to evangelize, echoing the prophets’ concern over idols."
    },
    {
      "pk": 51017017,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 17,
      "text": "So he reasoned in the synagogue with the Jews and the devout persons, and in the marketplace every day with those who happened to be there.",
      "links": "",
      "comment": "Paul adapts his approach, discussing faith with both Jews and Gentiles in different settings, showing an incarnational mission strategy that meets people where they are."
    },
    {
      "pk": 51017018,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 18,
      "text": "Some of camera Epicurean and Stoic philosophers also began to debate with him. Some said, 'What does this babbler wish to say?' Others said, 'He seems to be a preacher of foreign divinities,' because he was preaching Jesus and the resurrection.",
      "links": "<a href='/AIV/44/4/2'>Acts 4:2</a>",
      "comment": "Paul’s preaching is misunderstood as introducing new gods, yet focuses on Jesus and the resurrection. High Christology: resurrection affirms Jesus’ divine authority and uniqueness."
    },
    {
      "pk": 51017019,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 19,
      "text": "And they took him and brought him to the Areopagus, saying, 'May we know what this new teaching is that you are presenting?'",
      "links": "<a href='/AIV/44/25/19'>Acts 25:19</a>",
      "comment": "Paul is invited to explain his teaching before the Areopagus, the high court of Athens. The faith willingly encounters reason and seeks dialogue with all."
    },
    {
      "pk": 51017020,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 20,
      "text": "For you bring some strange things to our ears. We want to know what these things mean.'",
      "links": "",
      "comment": "Curiosity about the gospel opens the door for Paul’s apologetic address. Christianity both challenges and fulfills the deepest philosophies of humankind."
    },
    {
      "pk": 51017021,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 21,
      "text": "Now all the Athenians and the foreigners who lived there would spend their time in nothing except telling or hearing something new.",
      "links": "",
      "comment": "Athens was known for its pursuit of new ideas; sets the context for Paul's approach to engage with their philosophical curiosity."
    },
    {
      "pk": 51017022,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 22,
      "text": "So Paul, standing in the midst of the Areopagus, said, 'Men of Athens, I see that in every way you are very religious.",
      "links": "",
      "comment": "Paul begins by affirming their religious devotion, building common ground. His rhetoric is respectful yet will move toward challenging idolatry."
    },
    {
      "pk": 51017023,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 23,
      "text": "For as I passed along and observed the objects of your worship, I also found an altar with this inscription, ‘To an unknown god.’ What therefore you worship as unknown, this I proclaim to you.",
      "links": "",
      "comment": "Paul uses the altar ‘to an unknown god’ as a bridge to introduce the true God, fulfilling the philosophical search for the divine. See Rom. 1:19-20."
    },
    {
      "pk": 51017024,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 24,
      "text": "The God who made the world and everything in it, being Lord of heaven and earth, does not live in temples made by human hands,",
      "links": "<a href='/AIV/19/146/6'>Ps. 146:6</a>; <a href='/AIV/23/66/1-2'>Isa. 66:1-2</a>",
      "comment": "God is both Creator and Sovereign. Paul affirms the transcendence of God, as the prophets taught, and prepares to contrast true worship with idolatry."
    },
    {
      "pk": 51017025,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 25,
      "text": "nor is he served by human hands, as though he needed anything, since he himself gives to all mankind life and breath and everything.",
      "links": "<a href='/AIV/18/34/14-15'>Job 34:14-15</a>; <a href='/AIV/19/50/10-12'>Ps. 50:10-12</a>",
      "comment": "God is self-sufficient and the source of all life. For application to worship, see John 4:24. True worship is more than ritual; it is a spiritual reality."
    },
    {
      "pk": 51017026,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 26,
      "text": "And he made from one man every nation of mankind to live on all the face of the earth, having determined allotted periods and the boundaries of their dwelling place,",
      "links": "<a href='/AIV/1/1/26-28'>Gen. 1:26-28</a>; <a href='/AIV/5/32/8'>Deut. 32:8</a>",
      "comment": "Paul teaches the unity of humanity and the divine providence over nations. This sets the stage for the universal invitation to salvation."
    },
    {
      "pk": 51017027,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 27,
      "text": "that they should seek God, in the hope that they might reach out for him and find him—though he is not far from each one of us.",
      "links": "<a href='/AIV/5/4/29'>Deut. 4:29</a>",
      "comment": "God's plan for all nations is that all might seek and find Him. The intimacy of God is reflected in Christ’s incarnation (John 1:14)."
    },
    {
      "pk": 51017028,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 28,
      "text": "For ‘In him we live and move and have our being’; as even some of your poets have said, ‘For we are indeed his offspring.’",
      "links": "",
      "comment": "Paul quotes Greek poets to affirm truths consistent with revelation: all life depends on God. In Christ, believers are made children of God. See John 1:12."
    },
    {
      "pk": 51017029,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 29,
      "text": "Being then God’s offspring, we ought not to think that the Divine Being is like gold or silver or stone, an image formed by human skill and imagination.",
      "links": "<a href='/AIV/2/20/4'>Ex. 20:4</a>",
      "comment": "Paul denounces idolatry, affirming the spiritual nature of God. True worship is not man-made, pointing to the need for revelation and spiritual mediation."
    },
    {
      "pk": 51017030,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 30,
      "text": "The times of ignorance God overlooked, but now he commands all people everywhere to repent,",
      "links": "<a href='/AIV/42/24/47'>Luke 24:47</a>",
      "comment": "The universal call to repentance is now revealed and urgent. The gospel expands beyond Israel to all, requiring a response from every person."
    },
    {
      "pk": 51017031,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 31,
      "text": "because he has fixed a day on which he will judge the world in righteousness by a man whom he has appointed; and of this he has given assurance to all by raising him from the dead.",
      "links": "<a href='/AIV/19/9/8'>Ps. 9:8</a>; <a href='/AIV/43/5/22-29'>John 5:22-29</a>; <a href='/AIV/44/2/32'>Acts 2:32</a>",
      "comment": "Christ’s resurrection is the guarantee that he is the appointed judge. Here Christ’s divinity and authority to judge all is strongly affirmed (see John 5:22–29)."
    },
    {
      "pk": 51017032,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 32,
      "text": "Now when they heard of the resurrection of the dead, some mocked, but others said, 'We will hear you again about this.'",
      "links": "<a href='/AIV/44/26/8'>Acts 26:8</a>",
      "comment": "The doctrine of resurrection – central to Christian hope – is divisive. Some scoff, others are intrigued. The resurrection authenticates everything Paul claims about Jesus."
    },
    {
      "pk": 51017033,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 33,
      "text": "So Paul went out from their midst.",
      "links": "",
      "comment": "Paul departs, leaving the message for the Spirit to work in the hearts of hearers. Not all conversions are immediate but the seed is sown."
    },
    {
      "pk": 51017034,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 17,
      "verse": 34,
      "text": "But some men joined him and believed, among whom also were Dionysius the Areopagite and a woman named Damaris, and others with them.",
      "links": "",
      "comment": "Even in a city famed for skepticism, the gospel’s power draws converts. Entry into the gathered community through faith is always personal and involves commitment. The role of prominent converts hints at the later importance of orderly succession and unity under apostolic teaching."
    }
  ],
  "translatedAt": "2025-12-24T11:28:19.231Z"
}