{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 19,
  "verses": [
    {
      "pk": 4401901,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 1,
      "text": "While Apollos was in Corinth, Paul passed through the interior regions and came to Ephesus. There he found some disciples,",
      "links": "<a href='/AIV/44/18/24'>Acts 18:24</a>; <a href='/AIV/44/18/19'>Acts 18:19</a>",
      "comment": "Paul returns to Ephesus, an important center for early Christianity, showing continuity in the missionary journeys."
    },
    {
      "pk": 4401902,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 2,
      "text": "and he asked them, \"Did you receive the Holy Spirit when you believed?\" They answered him, \"No, we have not even heard that there is a Holy Spirit.\"",
      "links": "<a href='/AIV/8/1/13'>Ruth 1:13</a>; <a href='/AIV/44/8/15-17'>Acts 8:15–17</a>",
      "comment": "The question shows the importance of the Holy Spirit in the life of the believer. The mention of not hearing of the Spirit marks a transition from an Old Covenant understanding to the new fullness found in Christ."
    },
    {
      "pk": 4401903,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 3,
      "text": "And he said, \"Into what then were you baptized?\" They replied, \"Into John's baptism.\"",
      "links": "<a href='/AIV/40/3/11'>Matt. 3:11</a>; <a href='/AIV/41/1/4'>Mark 1:4</a>",
      "comment": "John's baptism represented repentance but not the fullness granted through Jesus. Paul is highlighting the authority and transformation found in Christian baptism."
    },
    {
      "pk": 4401904,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 4,
      "text": "Paul said, \"John baptized with a baptism of repentance, telling the people to believe in the one who was coming after him, that is, in Jesus.\"",
      "links": "<a href='/AIV/43/1/29'>John 1:29</a>; <a href='/AIV/44/13/24'>Acts 13:24</a>",
      "comment": "John pointed toward Jesus as the fulfillment of God’s promise. Baptism in Jesus brings new birth and incorporation into His body."
    },
    {
      "pk": 4401905,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 5,
      "text": "Upon hearing this, they were baptized in the name of the Lord Jesus.",
      "links": "<a href='/AIV/44/2/38'>Acts 2:38</a>; <a href='/AIV/44/8/16'>Acts 8:16</a>",
      "comment": "Christian baptism is in the name and authority of Jesus, imparting the Holy Spirit and deeper unity with Him—key for the new creation."
    },
    {
      "pk": 4401906,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 6,
      "text": "And when Paul laid his hands on them, the Holy Spirit came upon them, and they began speaking in tongues and prophesying.",
      "links": "<a href='/AIV/44/8/17'>Acts 8:17</a>; <a href='/AIV/44/10/44-46'>Acts 10:44–46</a>",
      "comment": "The laying on of hands is shown as a means for imparting the Holy Spirit—a ritual act preserved in apostolic tradition, underscoring the physical mediation of spiritual gifts."
    },
    {
      "pk": 4401907,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 7,
      "text": "There were about twelve men in all.",
      "links": "<a href='/AIV/6/4/3'>Josh. 4:3</a>; <a href='/AIV/40/10/2'>Matt. 10:2</a>",
      "comment": "The number twelve symbolizes the continuity of God’s people—recalling the twelve tribes of Israel and the twelve apostles."
    },
    {
      "pk": 4401908,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 8,
      "text": "Paul entered the synagogue and spoke boldly for three months, reasoning and persuading them about the kingdom of God.",
      "links": "<a href='/AIV/44/1/3'>Acts 1:3</a>; <a href='/AIV/44/28/23'>Acts 28:23</a>",
      "comment": "Paul’s approach is consistent: first the synagogue, presenting Jesus as fulfillment of the Scriptures regarding the Kingdom."
    },
    {
      "pk": 4401909,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 9,
      "text": "But when some grew hardened and refused to believe, speaking evil of the Way before the assembly, Paul withdrew from them and took the disciples with him, reasoning daily in the hall of Tyrannus.",
      "links": "<a href='/AIV/19/1/1'>Ps. 1:1</a>; <a href='/AIV/44/9/2'>Acts 9:2</a>",
      "comment": "‘The Way’ refers to the earliest term for the Christian movement, emphasizing the communal and ordered life Christ established. Moving from synagogue to public hall shows flexibility in spreading the faith."
    },
    {
      "pk": 4401910,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 10,
      "text": "This continued for two years, so that all the residents of Asia heard the word of the Lord, both Jews and Greeks.",
      "links": "<a href='/AIV/44/13/49'>Acts 13:49</a>",
      "comment": "Paul’s lengthy teaching grounded believers and allowed the gospel to spread widely. Tradition and teaching are key to deepening understanding and unity."
    },
    {
      "pk": 4401911,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 11,
      "text": "God was doing extraordinary miracles by the hands of Paul,",
      "links": "<a href='/AIV/44/5/12'>Acts 5:12</a>; <a href='/AIV/40/10/1'>Matt. 10:1</a>",
      "comment": "Miracles affirm the authority of the apostles, revealing the continued activity of God through chosen instruments."
    },
    {
      "pk": 4401912,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 12,
      "text": "so that even handkerchiefs or aprons that had touched his body were carried away to the sick, and their diseases left them, and evil spirits went out of them.",
      "links": "<a href='/AIV/44/5/15'>Acts 5:15</a>; <a href='/AIV/42/8/44'>Luke 8:44</a>",
      "comment": "God’s power can work even through physical objects associated with the saints, hinting at the continuing use of tangible signs and relics which support faith."
    },
    {
      "pk": 4401913,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 13,
      "text": "Then some itinerant Jewish exorcists tried to invoke the name of the Lord Jesus over those with evil spirits, saying, \"I command you by the Jesus whom Paul proclaims.\"",
      "links": "<a href='/AIV/40/7/22'>Matt. 7:22</a>; <a href='/AIV/41/9/38'>Mark 9:38</a>",
      "comment": "Simply invoking Jesus’ name without personal relationship or proper authority is depicted as fruitless—authentic ministry requires legitimate calling and order."
    },
    {
      "pk": 4401914,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 14,
      "text": "Seven sons of a Jewish high priest named Sceva were doing this.",
      "links": "",
      "comment": "These ‘sons of Sceva’ supposedly carried high status, yet lacked authentic empowerment, highlighting the necessity of true authority."
    },
    {
      "pk": 4401915,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 15,
      "text": "But the evil spirit answered them, \"Jesus I know, and Paul I recognize, but who are you?\"",
      "links": "<a href='/AIV/40/8/29'>Matt. 8:29</a>; <a href='/AIV/59/2/19'>James 2:19</a>",
      "comment": "Spiritual authority is only effective when properly received; the evil spirit recognizes the true servants of God."
    },
    {
      "pk": 4401916,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 16,
      "text": "And the man in whom the evil spirit was leaped upon them, overpowered them all, and prevailed against them, so that they fled out of that house naked and wounded.",
      "links": "<a href='/AIV/42/8/27'>Luke 8:27</a>",
      "comment": "Attempting ministry apart from authentic commissioning leads not to victory, but defeat."
    },
    {
      "pk": 4401917,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 17,
      "text": "This became known to all the residents of Ephesus, both Jews and Greeks. And fear fell upon them all, and the name of the Lord Jesus was magnified.",
      "links": "<a href='/AIV/44/5/11'>Acts 5:11</a>",
      "comment": "God’s power generates holy fear and awe, underlining the seriousness of involvement in spiritual matters and the supremacy of the name of Jesus."
    },
    {
      "pk": 4401918,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 18,
      "text": "Many who believed came, confessing and openly declaring their practices.",
      "links": "<a href='/AIV/59/5/16'>James 5:16</a>",
      "comment": "Confession of sin and renunciation of evil is presented as a necessary response to authentic conversion."
    },
    {
      "pk": 4401919,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 19,
      "text": "A number of those who had practiced magic arts brought their books together and burned them before everyone. They counted up their value and found it came to fifty thousand pieces of silver.",
      "links": "<a href='/AIV/5/7/26'>Deut. 7:26</a>",
      "comment": "True repentance involves sacrifice—even costly items are surrendered in pursuit of holiness."
    },
    {
      "pk": 4401920,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 20,
      "text": "So the word of the Lord continued to increase and prevail mightily.",
      "links": "<a href='/AIV/44/6/7'>Acts 6:7</a>; <a href='/AIV/44/12/24'>Acts 12:24</a>",
      "comment": "Scripture uses language of growth and victory for God's word, echoing the spread of the faith through history."
    },
    {
      "pk": 4401921,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 21,
      "text": "After these things had happened, Paul resolved in the Spirit to pass through Macedonia and Achaia and go to Jerusalem, saying, \"After I have been there, I must also see Rome.\"",
      "links": "<a href='/AIV/44/20/22'>Acts 20:22</a>; <a href='/AIV/45/1/15'>Rom. 1:15</a>",
      "comment": "Paul's journeys are Spirit-led, and his intent to visit Rome points to the broader unity of the Church."
    },
    {
      "pk": 4401922,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 22,
      "text": "And having sent to Macedonia two of his helpers, Timothy and Erastus, he stayed for a while in Asia.",
      "links": "<a href='/AIV/44/16/1'>Acts 16:1</a>; <a href='/AIV/45/16/23'>Rom. 16:23</a>",
      "comment": "Paul works in cooperation with fellow laborers, displaying ordered mission and the necessity of mutual support."
    },
    {
      "pk": 4401923,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 23,
      "text": "About that time there arose no small disturbance concerning the Way.",
      "links": "<a href='/AIV/44/9/2'>Acts 9:2</a>",
      "comment": "‘The Way’ captures the idea of a structured, communal following of Jesus, not private spirituality."
    },
    {
      "pk": 4401924,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 24,
      "text": "For a man named Demetrius, a silversmith who made silver shrines of Artemis, brought no little business to the craftsmen.",
      "links": "<a href='/AIV/44/16/16'>Acts 16:16</a>",
      "comment": "Economic interests are threatened by the advance of the gospel, which calls for conversion and abandonment of idolatry."
    },
    {
      "pk": 4401925,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 25,
      "text": "He gathered the craftsmen and workers in related trades together and said, \"Men, you know that our prosperity depends on this business.\"",
      "links": "",
      "comment": "Demetrius reveals that religious practice and commerce are closely tied in Ephesus—a pattern confronting early Christian missions."
    },
    {
      "pk": 4401926,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 26,
      "text": "\"And you see and hear that not only in Ephesus but in almost all of Asia, this Paul has persuaded a great many people and turned them away, saying that gods made with hands are not gods.\"",
      "links": "<a href='/AIV/19/115/4'>Ps. 115:4</a>; <a href='/AIV/23/44/9-20'>Isa. 44:9–20</a>",
      "comment": "Paul’s teaching against idolatry is rooted in the authority of Old Testament revelation, showing the unity of faith and fidelity to the one true God."
    },
    {
      "pk": 4401927,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 27,
      "text": "\"There is danger not only that this trade of ours might fall into disrepute, but also that the temple of the great goddess Artemis may be regarded as worthless, and that she whom all Asia and the world worship will be deposed from her magnificence.\"",
      "links": "<a href='/AIV/23/2/18'>Isa. 2:18</a>",
      "comment": "Worship of Artemis is contrasted with the worship of the true God; true worship centers around what is revealed from heaven, not man-made forms."
    },
    {
      "pk": 4401928,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 28,
      "text": "When they heard this, they were full of anger and cried out, \"Great is Artemis of the Ephesians!\"",
      "links": "",
      "comment": "Idolatrous fervor grows when challenged by the truth—demonstrating the power and danger of popular religion not centered in Christ."
    },
    {
      "pk": 4401929,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 29,
      "text": "The city was filled with confusion, and they rushed together into the theater, dragging with them Gaius and Aristarchus, Macedonians who were Paul's traveling companions.",
      "links": "<a href='/AIV/44/20/4'>Acts 20:4</a>",
      "comment": "Paul’s companions share in his sufferings and mission, showing the importance of community in the life of discipleship."
    },
    {
      "pk": 4401930,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 30,
      "text": "When Paul wanted to go among the crowd, the disciples would not let him.",
      "links": "<a href='/AIV/44/21/12'>Acts 21:12</a>",
      "comment": "Paul’s mission is not reckless; leaders consult with others and sometimes must refrain for the sake of the greater good."
    },
    {
      "pk": 4401931,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 31,
      "text": "Also some of the officials of Asia, who were friends of his, sent to him and urged him not to venture into the theater.",
      "links": "",
      "comment": "Friendship and prudence play a role in God’s providential protection of His servants."
    },
    {
      "pk": 4401932,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 32,
      "text": "Now some were shouting one thing, some another, for the assembly was in confusion, and most of them did not know why they had come together.",
      "links": "<a href='/AIV/44/21/34'>Acts 21:34</a>",
      "comment": "Without the guidance of truth and right order, crowds are prone to confusion—a counterpoint to the Church's structure."
    },
    {
      "pk": 4401933,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 33,
      "text": "Some in the crowd prompted Alexander, whom the Jews had put forward. Alexander motioned with his hand, wanting to make a defense to the people.",
      "links": "",
      "comment": "Alexander likely tries to distance the Jewish community from the Christians; disputes often arise over the new community’s presence."
    },
    {
      "pk": 4401934,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 34,
      "text": "But when they recognized that he was a Jew, they all shouted with one voice for about two hours, \"Great is Artemis of the Ephesians!\"",
      "links": "",
      "comment": "Religious identity is a source of contention; popular devotion resists new truth stubbornly, sometimes irrationally."
    },
    {
      "pk": 4401935,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 35,
      "text": "And when the town clerk had quieted the crowd, he said, \"People of Ephesus, who among you does not know that the city of the Ephesians is the guardian of the temple of the great Artemis, and of the sacred stone that fell from the sky?\"",
      "links": "<a href='/AIV/5/4/19'>Deut. 4:19</a>",
      "comment": "The clerk appeals to civic pride and mythology; but Christian revelation will ultimately challenge all such local traditions."
    },
    {
      "pk": 4401936,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 36,
      "text": "Since these things cannot be denied, you ought to be quiet and do nothing rash.",
      "links": "",
      "comment": "Even civic authorities recognize the need for order—God brings peace out of human confusion."
    },
    {
      "pk": 4401937,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 37,
      "text": "For you have brought these men here, who are neither robbers of temples nor blasphemers of our goddess.",
      "links": "",
      "comment": "The defense affirms that Christian mission does not rely on violence or disrespect; the faith spreads by persuasion and witness."
    },
    {
      "pk": 4401938,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 38,
      "text": "If therefore Demetrius and the craftsmen with him have a complaint against anyone, the courts are open, and there are proconsuls. Let them bring charges against one another.",
      "links": "",
      "comment": "The orderly use of legitimate authority is affirmed."
    },
    {
      "pk": 4401939,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 39,
      "text": "But if you seek anything further, it shall be settled in the regular assembly.",
      "links": "",
      "comment": "Even pagans recognize structured authority, paralleling the Church’s insistence on proper order."
    },
    {
      "pk": 4401940,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 40,
      "text": "For we are in danger of being charged with rioting today, since there is no reason we can give for this commotion.\"",
      "links": "<a href='/AIV/44/17/5'>Acts 17:5</a>",
      "comment": "The unnamed official fears Roman repercussions—civil peace is important even from a pragmatic standpoint."
    },
    {
      "pk": 4401941,
      "translation": "AIV",
      "book": 44,
      "chapter": 19,
      "verse": 41,
      "text": "And when he had said these things, he dismissed the assembly.",
      "links": "",
      "comment": "Order is restored at the local official’s word, echoing how God brings order through wise leadership."
    }
  ],
  "translatedAt": "2025-12-23T03:25:11.890Z"
}