{
  "book": 51,
  "bookName": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 22,
  "verses": [
    {
      "pk": 51022001,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 1,
      "text": "Brothers and fathers, listen now to my defense which I am about to present to you.",
      "links": "<a href='/AIV/44/7/2'>Acts 7:2</a>; <a href='/AIV/44/21/40'>Acts 21:40</a>",
      "comment": "Paul addresses the crowd with a respectful greeting, echoing Stephen's approach before his defense (Acts 7:2). The use of 'fathers' shows honor for tradition and authority."
    },
    {
      "pk": 51022002,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 2,
      "text": "When they heard him speaking to them in the Hebrew language, they became even more quiet. Then he said:",
      "links": "<a href='/AIV/44/21/40'>Acts 21:40</a>",
      "comment": "Paul's use of Hebrew (or Aramaic) signals his deep connection with the Jewish people. This technique showed respect for the ancestral language, drawing similarity to Old Testament prophetic speeches (Jeremiah, Ezekiel)."
    },
    {
      "pk": 51022003,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 3,
      "text": "I am a Jew, born in Tarsus of Cilicia, but brought up in this city, trained at the feet of Gamaliel according to the strict manner of our ancestral Law, being zealous for God just as all of you are today.",
      "links": "<a href='/AIV/44/5/34'>Acts 5:34</a>; <a href='/AIV/45/11/1'>Romans 11:1</a>",
      "comment": "Paul references his birthplace, education, and zeal, grounding himself in Jewish identity and tradition. The mention of Gamaliel, a revered teacher, establishes apostolic and rabbinic continuity. Zeal for God links to Old Testament figures like Elijah (1 Kings 19:10)."
    },
    {
      "pk": 51022004,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 4,
      "text": "I persecuted this Way to the death, binding and delivering both men and women into prison.",
      "links": "<a href='/AIV/44/9/1-2'>Acts 9:1-2</a>; <a href='/AIV/44/8/3'>Acts 8:3</a>",
      "comment": "Paul admits his previous fierce opposition to followers of Jesus. 'The Way' was an early term for the Christian community. His confession demonstrates the power of conversion, paralleling Moses and David's experiences of repentance."
    },
    {
      "pk": 51022005,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 5,
      "text": "The high priest and all the council of elders can testify to this. From them I received letters to our brothers in Damascus, and I went there to bring those who were there in chains to Jerusalem to be punished.",
      "links": "<a href='/AIV/44/9/2'>Acts 9:2</a>; <a href='/AIV/44/24/1'>Acts 24:1</a>",
      "comment": "Paul refers to written authority from the highest Jewish leaders, showing he acted within religious tradition. His journey to Damascus marks the moment of transformation, reminiscent of Moses' encounter on Sinai."
    },
    {
      "pk": 51022006,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 6,
      "text": "As I was traveling and drawing near to Damascus, about noon, suddenly a great light from heaven flashed around me.",
      "links": "<a href='/AIV/44/9/3'>Acts 9:3</a>; <a href='/AIV/26/1/28'>Ezek. 1:28</a>",
      "comment": "The noonday brightness emphasizes the supernatural nature of the encounter. Light from heaven often symbolizes divine presence, recalling Moses' burning bush (Exodus 3:2) or Ezekiel's visions."
    },
    {
      "pk": 51022007,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 7,
      "text": "I fell to the ground and heard a voice saying to me, 'Saul, Saul, why are you persecuting me?'",
      "links": "<a href='/AIV/44/9/4'>Acts 9:4</a>; <a href='/AIV/40/25/40'>Matt 25:40</a>; <a href='/AIV/02/3/6'>Exod. 3:6</a>",
      "comment": "Paul is addressed personally and directly by Jesus, identifying Himself with His people ('why are you persecuting me?'). This reflects deep Christological identification between Christ and the Church (see Matt 25:40)."
    },
    {
      "pk": 51022008,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 8,
      "text": "I answered, 'Who are you, Lord?' He said to me, 'I am Jesus of Nazareth, whom you are persecuting.'",
      "links": "<a href='/AIV/44/9/5'>Acts 9:5</a>; <a href='/AIV/43/18/5'>John 18:5</a>",
      "comment": "Jesus declares His identity, linking His earthly life to the divine encounter, reinforcing his resurrection and ongoing presence. Old and New Testament both stress encountering the living God (see Exodus 3:14 – 'I AM')."
    },
    {
      "pk": 51022009,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 9,
      "text": "Those who were with me saw the light, but did not understand the voice of the one speaking to me.",
      "links": "<a href='/AIV/44/9/7'>Acts 9:7</a>",
      "comment": "Companions perceive supernatural manifestations but do not receive the full revelation, illustrating that personal encounter and call are necessary for understanding God's will."
    },
    {
      "pk": 51022010,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 10,
      "text": "I said, 'What shall I do, Lord?' The Lord said to me, 'Get up and go into Damascus. There you will be told everything that has been appointed for you to do.'",
      "links": "<a href='/AIV/44/9/6'>Acts 9:6</a>; <a href='/AIV/44/26/16'>Acts 26:16</a>",
      "comment": "Jesus gives Paul guidance through appointed intermediaries, emphasizing the necessity of obedience and mediation in revealing God's will (see Exod. 4:14, 27)."
    },
    {
      "pk": 51022011,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 11,
      "text": "Since I could not see because of the brightness of that light, I was led by the hand by those who were with me, and came into Damascus.",
      "links": "<a href='/AIV/44/9/8'>Acts 9:8</a>",
      "comment": "Paul’s physical blindness dramatizes his spiritual awakening. Being led by the hand invokes images of guidance, reminding us of God’s shepherding throughout Scripture (Psalm 23:2-3; Isaiah 42:16)."
    },
    {
      "pk": 51022012,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 12,
      "text": "A certain Ananias, a devout man according to the Law and well spoken of by all the Jews living there,",
      "links": "<a href='/AIV/44/9/10'>Acts 9:10</a>",
      "comment": "Ananias is recognized for his adherence to the Law, signaling the continuity between Israel's tradition and the Christian Way. His reputation reflects both communal holiness and ecclesial authority."
    },
    {
      "pk": 51022013,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 13,
      "text": "came to me and stood by me, and said, 'Brother Saul, receive your sight.' And at that very moment I looked up and saw him.",
      "links": "<a href='/AIV/44/9/17'>Acts 9:17-18</a>",
      "comment": "Healing is performed through Ananias, indicating that God often works through human agents. The laying on of hands and the calling 'Brother' exemplifies both personal and communal restoration in the faith."
    },
    {
      "pk": 51022014,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 14,
      "text": "He said, 'The God of our ancestors has appointed you to know his will, to see the Righteous One, and to hear a voice from his mouth.'",
      "links": "<a href='/AIV/23/53/11'>Isaiah 53:11</a>; <a href='/AIV/44/3/14'>Acts 3:14</a>",
      "comment": "'The Righteous One' is a technical Messianic title (see Isaiah 53:11). Paul’s vision and calling connects Old Testament prophecy with its New Testament fulfillment."
    },
    {
      "pk": 51022015,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 15,
      "text": "'For you will be a witness for him to all people of what you have seen and heard.'",
      "links": "<a href='/AIV/44/1/8'>Acts 1:8</a>; <a href='/AIV/44/26/16'>Acts 26:16</a>",
      "comment": "Paul’s mission is apostolic witness to all nations, reflecting Jesus’ commission to his disciples and the universal call that began in Abraham but reaches fulfillment here."
    },
    {
      "pk": 51022016,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 16,
      "text": "And now why do you wait? Get up, be baptized, and wash away your sins, calling on his name.",
      "links": "<a href='/AIV/40/3/6'>Matt 3:6</a>; <a href='/AIV/60/3/21'>1 Pet 3:21</a>",
      "comment": "Ananias connects baptism directly to the forgiveness of sins, showing its regenerative power. The sacramental efficacy of baptism is grounded in the invocation of the Lord’s name."
    },
    {
      "pk": 51022017,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 17,
      "text": "After I returned to Jerusalem and was praying in the temple, I fell into a trance",
      "links": "<a href='/AIV/44/9/26'>Acts 9:26</a>; <a href='/AIV/44/10/10'>Acts 10:10</a>",
      "comment": "Prayer in the temple reveals Paul’s ongoing respect for the Jewish liturgical tradition. Divine revelation often comes through prayer, and the temple setting shows a bridge between old and new covenants."
    },
    {
      "pk": 51022018,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 18,
      "text": "and saw him saying to me, 'Hurry and leave Jerusalem quickly, because they will not accept your testimony about me.'",
      "links": "<a href='/AIV/44/9/29'>Acts 9:29-30</a>; <a href='/AIV/19/22/1'>Psalm 22:1</a>",
      "comment": "Despite Paul's faithfulness, rejection follows—a pattern in prophetic history. Divine guidance can sometimes lead us away for a greater mission, echoing Old Testament prophets who were sent to the nations."
    },
    {
      "pk": 51022019,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 19,
      "text": "I replied, 'Lord, they themselves know that I used to imprison and beat those who believed in you in every synagogue.'",
      "links": "<a href='/AIV/44/8/3'>Acts 8:3</a>; <a href='/AIV/44/9/1'>Acts 9:1</a>",
      "comment": "Paul’s confession before God and community highlights repentance. His previous persecution is acknowledged openly, a model for honest conversion."
    },
    {
      "pk": 51022020,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 20,
      "text": "And when the blood of Stephen your witness was being shed, I myself was standing by and approving and guarding the clothes of those who killed him.'",
      "links": "<a href='/AIV/44/7/58'>Acts 7:58</a>; <a href='/AIV/44/8/1'>Acts 8:1</a>",
      "comment": "Paul’s direct involvement in Stephen’s death marks his redemption as even more profound. The term 'witness' (Greek: 'martyr') links Stephen’s death to the broader theme of redemptive suffering."
    },
    {
      "pk": 51022021,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 21,
      "text": "Then he said to me, 'Go, for I will send you far away to the Gentiles.'",
      "links": "<a href='/AIV/44/9/15'>Acts 9:15</a>; <a href='/AIV/23/49/6'>Isaiah 49:6</a>",
      "comment": "Paul’s commission to the Gentiles fulfills God’s promise to Abraham and prophecies of universal blessing (Isaiah 49:6), highlighting the unity and universality of the Church."
    },
    {
      "pk": 51022022,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 22,
      "text": "Up to this word they were listening to him, but then they raised their voices and said, 'Away with such a man from the earth! He should not be allowed to live.'",
      "links": "<a href='/AIV/44/21/36'>Acts 21:36</a>; <a href='/AIV/44/7/57'>Acts 7:57</a>",
      "comment": "The crowd’s extreme reaction mirrors past rejections of God’s prophets, underscoring the cost of discipleship and the prophetic fate of Jesus and his followers."
    },
    {
      "pk": 51022023,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 23,
      "text": "As they were shouting, throwing off their cloaks, and tossing dust into the air,",
      "links": "<a href='/AIV/44/7/57'>Acts 7:57</a>",
      "comment": "Their actions reflect intense rejection and are reminiscent of ritualized acts found in Old Testament scenes of judgment and mourning."
    },
    {
      "pk": 51022024,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 24,
      "text": "the commander ordered Paul to be brought into the barracks, directing that he be examined by scourging so that they might know why the people were crying out against him.",
      "links": "<a href='/AIV/44/16/22'>Acts 16:22</a>; <a href='/AIV/44/23/10'>Acts 23:10</a>",
      "comment": "Roman interrogation methods include scourging, an echo of Christ's suffering (John 19:1). Paul as Christ’s apostle endures similar persecution, deepening spiritual participation in Christ’s Passion."
    },
    {
      "pk": 51022025,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 25,
      "text": "But when they had stretched him out for the whip, Paul said to the centurion standing by, 'Is it lawful for you to scourge a Roman citizen who has not been condemned?'",
      "links": "<a href='/AIV/44/16/37'>Acts 16:37</a>",
      "comment": "Paul invokes his Roman citizenship, which ensures legal protections, modeling prudent use of secular authority in defense of justice and mission."
    },
    {
      "pk": 51022026,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 26,
      "text": "When the centurion heard this, he went and told the commander, 'What are you about to do? This man is a Roman.'",
      "links": "<a href='/AIV/44/16/38'>Acts 16:38</a>",
      "comment": "Paul’s status changes everything, demonstrating wisdom and the broader providence guiding the spread of the Gospel through historical circumstances."
    },
    {
      "pk": 51022027,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 27,
      "text": "So the commander came and said to him, 'Tell me, are you a Roman citizen?' He said, 'Yes.'",
      "links": "<a href='/AIV/44/25/11'>Acts 25:11</a>",
      "comment": "Direct testimony confirms legitimacy in the secular realm. Paul’s honest response models integrity in all spheres of life."
    },
    {
      "pk": 51022028,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 28,
      "text": "The commander answered, 'I bought this citizenship for a large sum.' Paul said, 'But I was born a citizen.'",
      "links": "<a href='/AIV/44/16/37'>Acts 16:37</a>",
      "comment": "Paul's birthright citizenship brings privileges, metaphorically paralleling spiritual birth into God’s kingdom (John 3:5). Grace, not purchase, is the foundation of Christian identity."
    },
    {
      "pk": 51022029,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 29,
      "text": "Immediately those who were about to examine him withdrew. The commander was also afraid after realizing that Paul was a Roman citizen and that he had bound him.",
      "links": "<a href='/AIV/44/16/38'>Acts 16:38</a>",
      "comment": "Fear follows illegal actions against a Roman citizen, highlighting justice and the sanctity of individual rights—morally and spiritually, the believer is protected by God."
    },
    {
      "pk": 51022030,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 22,
      "verse": 30,
      "text": "The next day, wanting to know exactly why he was being accused by the Jews, the commander released him and ordered the chief priests and all the council to assemble. He brought Paul down and set him before them.",
      "links": "<a href='/AIV/44/23/1'>Acts 23:1</a>; <a href='/AIV/41/14/55'>Mark 14:55</a>",
      "comment": "Paul faces the highest religious authority, foreshadowing Christ’s own trial before the Sanhedrin. The apostolic witness continues through proper order and governance, ensuring doctrinal fidelity and unity."
    }
  ],
  "translatedAt": "2025-12-24T11:31:33.810Z"
}