{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 18,
  "verses": [
    {
      "pk": 1901801,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 1,
      "text": "After this, Paul left Athens and went to Corinth.",
      "links": "<a href='/AIV/44/17/15'>Acts 17:15</a>",
      "comment": "Paul continues his missionary journey, moving from the intellectual center of Athens to the commercial hub of Corinth, showing the spread of the Gospel into major Gentile cities."
    },
    {
      "pk": 1901802,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 2,
      "text": "There he found a Jew named Aquila, a native of Pontus, who had recently come from Italy with his wife Priscilla, because Claudius had commanded all the Jews to leave Rome. Paul went to see them.",
      "links": "<a href='/AIV/45/16/3'>Romans 16:3</a>; <a href='/AIV/52/4/2'>1 Thess. 4:2</a>",
      "comment": "The expulsion of Jews from Rome is a well-attested historical event (see Suetonius). Notice the introduction of key co-workers in Paul's mission, highlighting the communal and familial aspect of early Christian ministry."
    },
    {
      "pk": 1901803,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 3,
      "text": "Because he was of the same trade, he stayed with them and worked; they were tentmakers by trade.",
      "links": "<a href='/AIV/20/22/29'>Prov. 22:29</a>",
      "comment": "Paul supporting himself by manual labor reflects humility and sets an example, balancing ministry and work. The use of 'tentmaker' shows Paul's willingness to share in the burdens of community life."
    },
    {
      "pk": 1901804,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 4,
      "text": "Every Sabbath he reasoned in the synagogue, trying to persuade Jews and Greeks.",
      "links": "<a href='/AIV/44/13/14'>Acts 13:14</a>; <a href='/AIV/44/17/2'>Acts 17:2</a>",
      "comment": "Paul's custom of preaching in the synagogue underscores the continuity between Judaism and Christianity. The engagement with Jews and Greeks points to the universality of the Gospel."
    },
    {
      "pk": 1901805,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 5,
      "text": "When Silas and Timothy arrived from Macedonia, Paul was pressed in the spirit, testifying to the Jews that Jesus is the Christ.",
      "links": "<a href='/AIV/44/17/14'>Acts 17:14–15</a>; <a href='/AIV/44/18/28'>Acts 18:28</a>",
      "comment": "The arrival of Paul’s companions strengthens his ministry. 'Jesus is the Christ' is the central message—the fulfillment of Old Testament prophecy (see Isaiah 53; Psalm 2)."
    },
    {
      "pk": 1901806,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 6,
      "text": "But when they opposed and reviled him, he shook out his garments and said to them, \"Your blood be on your own heads! I am innocent. From now on I will go to the Gentiles.\"",
      "links": "<a href='/AIV/44/13/46'>Acts 13:46</a>; <a href='/AIV/26/33/4'>Ezek. 33:4</a>",
      "comment": "Paul’s gesture is an Old Testament symbol for separation (see Neh. 5:13). Turning to the Gentiles fulfills the inclusivity prophesied about God’s salvation (Isa. 49:6)."
    },
    {
      "pk": 1901807,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 7,
      "text": "He left there and went to the house of a man named Titius Justus, a worshiper of God. His house was next door to the synagogue.",
      "links": "<a href='/AIV/44/10/2'>Acts 10:2</a>",
      "comment": "The Gospel moves into the Gentile household, symbolically bordering the synagogue—an image of the transition from old covenant worship to the new people of God."
    },
    {
      "pk": 1901808,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 8,
      "text": "Crispus, the ruler of the synagogue, believed in the Lord together with his entire household. Many of the Corinthians hearing Paul believed and were baptized.",
      "links": "<a href='/AIV/46/1/14'>1 Cor. 1:14</a>",
      "comment": "The conversion and baptism of Crispus, a synagogue leader, highlights the authority of apostolic preaching and the importance of household faith. Baptism is the visible means of joining the body of Christ (see John 3:5)."
    },
    {
      "pk": 1901809,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 9,
      "text": "The Lord said to Paul one night in a vision, \"Do not be afraid, but go on speaking and do not be silent,",
      "links": "<a href='/AIV/23/41/10'>Isa. 41:10</a>; <a href='/AIV/44/23/11'>Acts 23:11</a>",
      "comment": "Divine assurance strengthens Paul, reminiscent of Old Testament words to the prophets, indicating continuous divine involvement and approval of apostolic teaching."
    },
    {
      "pk": 1901810,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 10,
      "text": "\"for I am with you, and no one will attack you to harm you, for I have many people in this city.\"",
      "links": "<a href='/AIV/43/10/16'>John 10:16</a>",
      "comment": "God’s special protection of his messenger and his people. 'Many people in this city' hints at the invisible spread of God’s kingdom and sovereignty."
    },
    {
      "pk": 1901811,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 11,
      "text": "So Paul stayed a year and six months, teaching the word of God among them.",
      "links": "<a href='/AIV/44/19/10'>Acts 19:10</a>",
      "comment": "The lengthy teaching refers to solid catechesis and foundational catechism—spiritual nurturing through sustained instruction, not just one-time preaching."
    },
    {
      "pk": 1901812,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 12,
      "text": "But when Gallio was proconsul of Achaia, the Jews made a united attack on Paul and brought him before the judgment seat,",
      "links": "<a href='/AIV/44/13/50'>Acts 13:50</a>",
      "comment": "Gallio’s proconsulship is historically confirmed; opposition to Paul remains a recurring theme, evidencing the cost of discipleship but also the fulfillment of Christ’s warning (Matt. 10:22)."
    },
    {
      "pk": 1901813,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 13,
      "text": "saying, \"This man is persuading people to worship God contrary to the law.\"",
      "links": "<a href='/AIV/44/21/28'>Acts 21:28</a>",
      "comment": "The charge reflects tension between the old religious law and Christ’s new covenant, indicating the transition from Law to grace (Gal. 2:16)."
    },
    {
      "pk": 1901814,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 14,
      "text": "But when Paul was about to open his mouth, Gallio said to the Jews, \"If it were a matter of wrongdoing or serious crime, O Jews, I would have reason to accept your complaint.",
      "links": "",
      "comment": "The Roman governor distinguishes between civil and religious matters, highlighting the state’s relative neutrality towards internal disputes among believers."
    },
    {
      "pk": 1901815,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 15,
      "text": "\"But since it is a question about words and names and your own law, see to it yourselves. I refuse to judge these things.\"",
      "links": "<a href='/AIV/44/25/19'>Acts 25:19</a>",
      "comment": "Gallio’s dismissal illustrates early Roman tolerance toward Christian teaching, allowing the Church to grow amidst conflict."
    },
    {
      "pk": 1901816,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 16,
      "text": "And he drove them from the judgment seat.",
      "links": "",
      "comment": "Gallio’s refusal to intervene demonstrates the independence of the Church’s internal affairs from secular authorities."
    },
    {
      "pk": 1901817,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 17,
      "text": "And they all seized Sosthenes, the ruler of the synagogue, and beat him in front of the judgment seat. But Gallio paid no attention to any of this.",
      "links": "<a href='/AIV/46/1/1'>1 Cor. 1:1</a>",
      "comment": "Sosthenes’ beating shows ongoing persecution of believers, but also the indifference of secular leadership. Tradition holds Sosthenes later became a follower of Paul."
    },
    {
      "pk": 1901818,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 18,
      "text": "Paul, after remaining many days longer, took leave of the brothers and set sail for Syria, and with him Priscilla and Aquila. At Cenchreae he had his head shaved, for he had taken a vow.",
      "links": "<a href='/AIV/04/6/2'>Num. 6:2–5</a>",
      "comment": "Shaving the head as part of a vow may indicate a Nazirite-style pledge (Num. 6). Paul’s obedience to such practices affirms the continuity of old and new worship, while missionary companions highlight apostolic tradition and transmission."
    },
    {
      "pk": 1901819,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 19,
      "text": "They came to Ephesus, and he left them there, but he himself entered the synagogue and reasoned with the Jews.",
      "links": "<a href='/AIV/44/19/1'>Acts 19:1</a>",
      "comment": "Ephesus becomes a major center for later Christian teaching. Paul’s commitment to continuous preaching in the synagogue re-emphasizes the priority of the Word."
    },
    {
      "pk": 1901820,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 20,
      "text": "When they asked him to stay a longer time, he declined.",
      "links": "",
      "comment": "Paul is governed by a divine timetable, not his own desires, giving evidence of living under God’s guidance."
    },
    {
      "pk": 1901821,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 21,
      "text": "But as he was leaving, he said, \"I will return to you if God wills,\" and he set sail from Ephesus.",
      "links": "<a href='/AIV/59/4/15'>James 4:15</a>",
      "comment": "'If God wills' shows Paul’s submission to divine providence—a reminder of the Christian attitude of surrender to God’s plan."
    },
    {
      "pk": 1901822,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 22,
      "text": "When he landed at Caesarea, he went up and greeted the church, and then went down to Antioch.",
      "links": "<a href='/AIV/44/15/30'>Acts 15:30–35</a>",
      "comment": "Paul’s return to the original community demonstrates his loyalty to the mother church, upholding unity and apostolic succession."
    },
    {
      "pk": 1901823,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 23,
      "text": "After spending some time there, he departed and went from place to place through the region of Galatia and Phrygia, strengthening all the disciples.",
      "links": "<a href='/AIV/44/14/22'>Acts 14:22</a>",
      "comment": "Ongoing pastoral care and teaching show the importance of confirming believers in their faith—establishing them through sound doctrine and instruction."
    },
    {
      "pk": 1901824,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 24,
      "text": "Now a Jew named Apollos, a native of Alexandria, came to Ephesus. He was an eloquent man, competent in the Scriptures.",
      "links": "<a href='/AIV/46/3/6'>1 Cor. 3:6</a>",
      "comment": "Apollos’ deep knowledge of Scripture and eloquence are valued, reflecting the significance of scholarship in upbuilding the Church."
    },
    {
      "pk": 1901825,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 25,
      "text": "He had been instructed in the way of the Lord, and being fervent in spirit, he spoke and taught accurately the things concerning Jesus, though he knew only the baptism of John.",
      "links": "<a href='/AIV/40/3/11'>Matt. 3:11</a>",
      "comment": "Apollos’s learning is genuine, yet incomplete. Note the difference between John’s baptism (repentance) and Christian baptism (regeneration), highlighting the necessity of sacramental initiation."
    },
    {
      "pk": 1901826,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 26,
      "text": "He began to speak boldly in the synagogue. But when Priscilla and Aquila heard him, they took him aside and explained the way of God to him more accurately.",
      "links": "<a href='/AIV/45/16/3'>Romans 16:3</a>",
      "comment": "Lay faithful, both men and women, contribute to the spread and correction of doctrine. This private instruction showcases the living, apostolic teaching office passed on from the apostles to others."
    },
    {
      "pk": 1901827,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 27,
      "text": "When he desired to cross to Achaia, the brothers encouraged him and wrote to the disciples to welcome him. When he arrived, he helped greatly those who through grace had believed.",
      "links": "<a href='/AIV/46/3/6'>1 Cor. 3:6</a>",
      "comment": "Letters of recommendation reflect apostolic authority and authentic fellowship. Apollos' ministry is a grace that builds up the Church."
    },
    {
      "pk": 1901828,
      "translation": "AIV",
      "book": 44,
      "chapter": 18,
      "verse": 28,
      "text": "For he powerfully refuted the Jews in public, showing by the Scriptures that Jesus is the Christ.",
      "links": "<a href='/AIV/44/18/5'>Acts 18:5</a>; <a href='/AIV/42/24/27'>Luke 24:27</a>",
      "comment": "Scripture is used to prove Jesus' divine Messiahship—the climax of God’s redemptive plan. Notice the centrality of Scripture and public proclamation, essential for forming faith and doctrine."
    }
  ],
  "translatedAt": "2025-12-23T03:24:34.125Z"
}