{
  "book": 51,
  "bookName": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 23,
  "verses": [
    {
      "pk": 51023001,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 1,
      "text": "Paul looked directly at the council and said, \"Brothers, I have lived before God with a completely clear conscience up to this day.\"",
      "links": "<a href='/AIV/44/24/16'>Acts 24:16</a>; <a href='/AIV/55/1/3'>2 Tim. 1:3</a>",
      "comment": "Paul, standing before the Sanhedrin, appeals to his pure conscience, showing an inner integrity rooted in a relationship with God rather than mere external observance. Living with a clear conscience reflects the ideal of Christian life, seeking holiness not just in action but also intention (cf. 1 Thess. 2:10)."
    },
    {
      "pk": 51023002,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 2,
      "text": "At this the high priest Ananias ordered those standing beside him to strike Paul on the mouth.",
      "links": "<a href='/AIV/43/18/22'>John 18:22</a>; <a href='/AIV/20/19/28'>Prov. 19:28</a>",
      "comment": "The act of violence against Paul echoes the unlawful treatment Jesus received (cf. John 18:22). Such persecution reaffirms Paul's discipleship and fulfillment of Christ's warning that His followers would suffer for His name."
    },
    {
      "pk": 51023003,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 3,
      "text": "Then Paul said to him, \"God will strike you, you whitewashed wall! Are you sitting there to judge me according to the Law, and yet contrary to the Law you order me to be struck?\"",
      "links": "<a href='/AIV/40/23/27'>Matt. 23:27</a>; <a href='/AIV/3/19/15'>Lev. 19:15</a>",
      "comment": "Paul's rebuke exposes the hypocrisy of those who uphold God's Law yet break it through injustice. The term \"whitewashed wall\" calls to mind Jesus' own language toward the religious leaders (Matt. 23:27), connecting Paul's experience to the prophetic and Christ-like tradition of speaking truth to power."
    },
    {
      "pk": 51023004,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 4,
      "text": "Those who stood by said, \"Would you insult God's high priest?\"",
      "links": "<a href='/AIV/2/22/28'>Ex. 22:28</a>",
      "comment": "The rebuke to Paul underscores the reverence due to the God-appointed leaders, even when they themselves fail. This marks the enduring respect for legitimate spiritual authority (cf. 1 Pet. 2:17), an important aspect of Christian discipline and order."
    },
    {
      "pk": 51023005,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 5,
      "text": "Paul replied, \"Brothers, I did not know he was the high priest; for it is written, 'You must not speak evil about a ruler of your people.'\"",
      "links": "<a href='/AIV/2/22/28'>Ex. 22:28</a>; <a href='/AIV/45/13/1'>Rom. 13:1</a>",
      "comment": "Paul humbly appeals to Scripture, acknowledging his mistake. This demonstrates the principle of submission to spiritual authorities (see also Heb. 13:17) and respect for order in the community, even amid injustice."
    },
    {
      "pk": 51023006,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 6,
      "text": "When Paul saw that one part were Sadducees and the other Pharisees, he cried out in the council, \"Brothers, I am a Pharisee, a son of Pharisees! I am being judged because of my hope in the resurrection of the dead.\"",
      "links": "<a href='/AIV/44/24/15'>Acts 24:15</a>; <a href='/AIV/27/12/2'>Dan. 12:2</a>",
      "comment": "Paul skillfully appeals to a core Jewish doctrine—the resurrection—which sets Pharisees apart from Sadducees. This belief becomes central in Christianity, fulfilled in Christ's own resurrection (cf. 1 Cor. 15:20-22), giving hope to believers."
    },
    {
      "pk": 51023007,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 7,
      "text": "When he said this, a dispute broke out between the Pharisees and Sadducees, and the council was divided.",
      "links": "<a href='/AIV/40/22/23'>Matt. 22:23</a>",
      "comment": "Paul’s statement draws out the theological disputes within Judaism. The resurrection was a major dividing line, and Paul's message aligns with the long tradition of Israel’s hope in life after death."
    },
    {
      "pk": 51023008,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 8,
      "text": "For the Sadducees say that there is no resurrection, nor angel, nor spirit, but the Pharisees acknowledge them all.",
      "links": "<a href='/AIV/40/22/23'>Matt. 22:23</a>; <a href='/AIV/42/20/27'>Luke 20:27</a>",
      "comment": "The Sadducees’ denial contrasts with the broader supernatural world affirmed by the Pharisees. The Christian faith stands firmly on the reality of resurrection, angels, and spiritual beings, echoing the robust supernaturalism of Scripture."
    },
    {
      "pk": 51023009,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 9,
      "text": "A great uproar arose. Some scribes from the Pharisees' party stood up and contested, saying, \"We find nothing wrong with this man. What if a spirit or an angel has spoken to him?\"",
      "links": "<a href='/AIV/9/28/12'>Gen. 28:12</a>; <a href='/AIV/42/24/4'>Luke 24:4</a>",
      "comment": "This scene demonstrates how the legitimacy of spiritual experiences was debated. Such skepticism toward direct revelation stands in contrast to the openness to the miraculous and angelic, foundational to authentic apostolic tradition."
    },
    {
      "pk": 51023010,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 10,
      "text": "As the dispute became so violent, the commander was afraid Paul might be torn apart by them. He ordered the soldiers to go down, take Paul away from them by force, and bring him into the barracks.",
      "links": "<a href='/AIV/44/21/30-34'>Acts 21:30-34</a>",
      "comment": "Roman intervention presides over the disorder within the council, reminding us that Christ’s followers often find safety and justice through unexpected secular means, under God’s providence."
    },
    {
      "pk": 51023011,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 11,
      "text": "The following night, the Lord stood near Paul and said, \"Take courage. For as you have testified about Me in Jerusalem, so you must also testify in Rome.\"",
      "links": "<a href='/AIV/44/19/21'>Acts 19:21</a>; <a href='/AIV/1/23/11'>Luke 23:11</a>",
      "comment": "Christ Himself appears to strengthen and reassure Paul, affirming his mission. The Lord’s encouragement emphasizes the necessity of Paul’s witness, paralleling the apostolic mission to the whole world—especially to Rome, the heart of the empire, prefiguring the center of Christian unity and apostolic authority."
    },
    {
      "pk": 51023012,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 12,
      "text": "When it was day, the Jews formed a conspiracy and bound themselves with an oath, saying they would neither eat nor drink until they had killed Paul.",
      "links": "<a href='/AIV/19/31/13'>Ps. 31:13</a>",
      "comment": "This plot highlights the intense opposition faced by Christ’s messengers. The level of zeal demonstrates the resistance encountered by those who proclaim the new covenant."
    },
    {
      "pk": 51023013,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 13,
      "text": "There were more than forty who made this conspiracy.",
      "links": "<a href='/AIV/19/35/15-16'>Ps. 35:15-16</a>",
      "comment": "The deliberate and organized plan against Paul reflects the serious threat to his life, yet God’s providence prevails, as it often does for His chosen servants."
    },
    {
      "pk": 51023014,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 14,
      "text": "They went to the chief priests and elders and said, \"We have bound ourselves under a solemn oath not to eat anything until we have killed Paul.\"",
      "links": "<a href='/AIV/19/94/20-21'>Ps. 94:20-21</a>",
      "comment": "The involvement of the leaders in the conspiracy underscores the corruption possible even among religious leadership, echoing the opposition Jesus Himself faced from the authorities (cf. Matt. 26:3-4)."
    },
    {
      "pk": 51023015,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 15,
      "text": "\"Now then, you and the council notify the commander to bring him down to you, as if you intend to examine his case more thoroughly. But we are ready to kill him before he gets there.\"",
      "links": "<a href='/AIV/44/25/3'>Acts 25:3</a>",
      "comment": "Deception and violence are employed against Paul, contrasting sharply with Christ’s teachings of integrity and charity. These plans are consistently thwarted by God’s providential care for His apostles."
    },
    {
      "pk": 51023016,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 16,
      "text": "But when Paul’s sister’s son heard of their ambush, he went into the barracks and told Paul.",
      "links": "<a href='/AIV/44/23/22'>Acts 23:22</a>",
      "comment": "God’s providence works through natural means—here, the intervention of Paul’s nephew. This illustrates divine guidance through the family and the people around us, not just the miraculous."
    },
    {
      "pk": 51023017,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 17,
      "text": "Paul called one of the centurions and said, \"Take this young man to the commander, for he has something to tell him.\"",
      "links": "<a href='/AIV/44/22/26'>Acts 22:26</a>",
      "comment": "Paul’s prudent use of the Roman system shows shrewdness and cooperation with civil authority, reflecting Paul's exhortation in Romans 13:1 to be subject to governing authorities."
    },
    {
      "pk": 51023018,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 18,
      "text": "So the centurion took him and brought him to the commander and said, \"Paul, the prisoner, called me and asked me to bring this young man to you. He has something to say to you.\"",
      "links": "<a href='/AIV/44/22/25'>Acts 22:25</a>",
      "comment": "This passage emphasizes the openness of Paul’s imprisonment. He is a prisoner, yet retains influence and agency within set boundaries."
    },
    {
      "pk": 51023019,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 19,
      "text": "The commander took him by the hand, led him aside privately, and asked, \"What is it that you want to tell me?\"",
      "links": "",
      "comment": "The commander’s gentle manner shows that God can move even hearts outside the community of faith to work for His purposes."
    },
    {
      "pk": 51023020,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 20,
      "text": "He answered, \"The Jews have agreed to ask you to bring Paul down to the council tomorrow, pretending they want to investigate him more thoroughly. But do not be persuaded by them.\"",
      "links": "",
      "comment": "The exposure of the conspiracy demonstrates the importance of prudence and vigilance, and how God brings hidden things to light for the protection of His servants."
    },
    {
      "pk": 51023021,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 21,
      "text": "\"More than forty of them are waiting in ambush for him. They have bound themselves by an oath not to eat or drink until they have killed him, and they are now ready, waiting for your consent.\"",
      "links": "<a href='/AIV/44/23/13'>Acts 23:13</a>",
      "comment": "The enemies’ zeal is contrasted with the protective action granted to Paul, further confirming that no plan can succeed apart from God’s will."
    },
    {
      "pk": 51023022,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 22,
      "text": "So the commander let the young man go, charging him, \"Tell no one that you have informed me of these things.\"",
      "links": "",
      "comment": "Discretion and secrecy here serve the preservation of Paul’s life, emphasizing the need for prudent action within God’s providential care."
    },
    {
      "pk": 51023023,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 23,
      "text": "Then he called two of his centurions and said, \"Make ready two hundred soldiers, seventy horsemen, and two hundred spearmen to go to Caesarea at the third hour of the night.\"",
      "links": "<a href='/AIV/44/24/23'>Acts 24:23</a>",
      "comment": "The large military escort for Paul highlights how God sometimes uses secular powers to guard His chosen instruments, prefiguring the ongoing protection and establishment of the apostolic mission."
    },
    {
      "pk": 51023024,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 24,
      "text": "Also provide mounts for Paul to ride, and bring him safely to Felix the governor.\"",
      "links": "<a href='/AIV/44/24/1'>Acts 24:1</a>",
      "comment": "Divine providence ensures Paul is treated with unexpected dignity and care, foreshadowing the special role and mission of the apostles."
    },
    {
      "pk": 51023025,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 25,
      "text": "He wrote a letter with the following content:",
      "links": "<a href='/AIV/44/25/26'>Acts 25:26</a>",
      "comment": "This official Roman letter demonstrates the legal protections the early Christians sometimes received, showing a pattern of defensible testimony and appeal to proper authority."
    },
    {
      "pk": 51023026,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 26,
      "text": "\"Claudius Lysias, to His Excellency Felix the governor, greetings.\"",
      "links": "",
      "comment": "The official tone of the letter reflects both accuracy of historical detail and the importance of due process."
    },
    {
      "pk": 51023027,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 27,
      "text": "\"This man was seized by the Jews and was about to be killed by them. But I came with soldiers and rescued him, learning that he was a Roman citizen.\"",
      "links": "<a href='/AIV/44/22/25-29'>Acts 22:25-29</a>",
      "comment": "Paul’s Roman citizenship plays a crucial role in his mission and protection, emphasizing both his Jewish heritage and his universality, connecting Israel with the nations."
    },
    {
      "pk": 51023028,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 28,
      "text": "\"Wanting to know the reason they were accusing him, I brought him down to their council.\"",
      "links": "<a href='/AIV/44/22/30'>Acts 22:30</a>",
      "comment": "The commander’s concern for legal process shows respect for justice, which will remain a hallmark of the Church’s defense in the world."
    },
    {
      "pk": 51023029,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 29,
      "text": "\"I found he was accused over questions of their Law, but was charged with nothing deserving death or imprisonment.\"",
      "links": "<a href='/AIV/44/18/15'>Acts 18:15</a>",
      "comment": "Paul’s message, though provocative to certain audiences, is not inherently seditious but centered on religious truth—especially the resurrection—distinguishing the kingdom of God from worldly politics."
    },
    {
      "pk": 51023030,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 30,
      "text": "\"When I was informed that there was a plot against this man, I sent him to you at once, also ordering his accusers to bring their charges against him before you.\"",
      "links": "<a href='/AIV/44/25/1-5'>Acts 25:1-5</a>",
      "comment": "This summary prepares for Paul’s appearances before greater authorities, paralleling Jesus’ own trials before both religious and civil leaders."
    },
    {
      "pk": 51023031,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 31,
      "text": "So the soldiers, carrying out their orders, took Paul and brought him by night to Antipatris.",
      "links": "",
      "comment": "This night journey for safety echoes other occasions where God’s people were led away from harm, emphasizing trust in God’s timing."
    },
    {
      "pk": 51023032,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 32,
      "text": "The next day they let the horsemen go on with him while they returned to the barracks.",
      "links": "",
      "comment": "Security is gradually relaxed as Paul’s escort nears its destination, showing prudence and care."
    },
    {
      "pk": 51023033,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 33,
      "text": "When the horsemen came to Caesarea and delivered the letter to the governor, they also presented Paul to him.",
      "links": "<a href='/AIV/44/24/1'>Acts 24:1</a>",
      "comment": "Paul is presented before Roman authority, a pattern by which the Christian message is steadily brought before the rulers of this world."
    },
    {
      "pk": 51023034,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 34,
      "text": "When the governor had read it, he asked what province Paul was from. When he learned that he was from Cilicia,",
      "links": "<a href='/AIV/44/21/39'>Acts 21:39</a>",
      "comment": "Felix’s question about Paul’s province reflects Roman judicial procedure, as well as the historical and legal context of Christian witness."
    },
    {
      "pk": 51023035,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 23,
      "verse": 35,
      "text": "he said, \"I will hear your case when your accusers arrive.\" And he ordered that Paul be kept under guard in Herod’s Praetorium.",
      "links": "<a href='/AIV/44/24/22-23'>Acts 24:22-23</a>",
      "comment": "Paul is safeguarded yet remains under custody, awaiting formal charges. The mention of Herod’s Praetorium connects the ongoing mission of the apostles with the political authorities, echoing Christ’s trials and the wider reach of the Gospel."
    }
  ],
  "translatedAt": "2025-12-24T11:32:12.762Z"
}