{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 3,
  "verses": [
    {
      "pk": 340301,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 1,
      "text": "Now Peter and John were going up to the temple at the hour of prayer, the ninth hour.",
      "links": "<a href='/AIV/42/1/8-9'>Luke 1:8-9</a>; <a href='/AIV/19/55/17'>Ps. 55:17</a>",
      "comment": "The ninth hour refers to 3 p.m., a fixed time of prayer in Jewish tradition. This shows the early Christians’ continuity with Jewish worship practices—praying at set times (cf. Daniel 6:10). Gathering at the temple also highlights the unity and public witness of the early believers."
    },
    {
      "pk": 340302,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 2,
      "text": "And a man, who was lame from birth, was being carried. Every day they laid him at the gate of the temple called Beautiful, to ask for alms of those entering the temple.",
      "links": "<a href='/AIV/40/21/14'>Matt. 21:14</a>; <a href='/AIV/43/9/1-2'>John 9:1-2</a>",
      "comment": "Describing the man as lame from birth underlines the miraculous nature of what will happen. Beggars at the temple gates relied on almsgiving, a key act of mercy in Judaism (cf. Deut. 15:7-8)."
    },
    {
      "pk": 340303,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 3,
      "text": "When he saw Peter and John about to go into the temple, he asked to receive alms.",
      "links": "",
      "comment": "The lame man’s expectation is for material help. This verse introduces the contrast between temporary material aid and the deeper healing he is about to receive."
    },
    {
      "pk": 340304,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 4,
      "text": "Peter looked directly at him, as did John, and said, \"Look at us.\"",
      "links": "",
      "comment": "Peter’s command draws the man’s full attention, setting the stage for something more significant than mere charity."
    },
    {
      "pk": 340305,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 5,
      "text": "So he gave them his attention, expecting to receive something from them.",
      "links": "",
      "comment": "The man’s readiness underscores his faith—though lacking spiritual understanding, he is open to receive."
    },
    {
      "pk": 340306,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 6,
      "text": "But Peter said, \"Silver and gold I do not have, but what I do have I give to you: In the name of Jesus Christ of Nazareth, rise up and walk.\"",
      "links": "<a href='/AIV/42/5/24'>Luke 5:24</a>; <a href='/AIV/41/16/17'>Mark 16:17</a>",
      "comment": "Acting in Jesus’s name shows the apostolic authority and the power of Christ working through his followers. The phrase 'in the name of' here points to Jesus’s ongoing presence and authority in the Church even after his ascension (see John 14:12-14)."
    },
    {
      "pk": 340307,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 7,
      "text": "And he took him by the right hand and raised him up, and immediately his feet and ankles were made strong.",
      "links": "<a href='/AIV/40/9/6-7'>Matt. 9:6-7</a>",
      "comment": "Physical touch is often used by Jesus and the apostles to convey healing (cf. Mark 1:41). The immediate healing emphasizes the miraculous power of Christ."
    },
    {
      "pk": 340308,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 8,
      "text": "And leaping up, he stood and began to walk, and entered the temple with them, walking and leaping and praising God.",
      "links": "<a href='/AIV/23/35/6'>Isa. 35:6</a>; <a href='/AIV/19/96/8'>Ps. 96:8</a>",
      "comment": "This verse recalls Isaiah 35:6, where the lame leap like a deer as a sign of messianic healing. The man’s immediate entry into the temple now symbolizes full inclusion into the worshiping community, reflecting both physical and spiritual restoration."
    },
    {
      "pk": 340309,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 9,
      "text": "And all the people saw him walking and praising God,",
      "links": "<a href='/AIV/19/100/4'>Ps. 100:4</a>",
      "comment": "Public witness to the miracle produces awe among the people. Miracles in Acts are not private but are signs given for the building up of faith in the community."
    },
    {
      "pk": 340310,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 10,
      "text": "and they recognized him as the one who sat for alms at the Beautiful Gate of the temple. And they were filled with wonder and amazement at what had happened to him.",
      "links": "",
      "comment": "The people’s recognition authenticates the miracle. Their amazement opens the way for Peter to explain its true meaning."
    },
    {
      "pk": 340311,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 11,
      "text": "As he clung to Peter and John, all the people, utterly astonished, ran together to them in the portico called Solomon's.",
      "links": "<a href='/AIV/43/10/23'>John 10:23</a>",
      "comment": "Solomon’s portico, a large public space in the temple, was a common setting for teaching and for gatherings of early Christians (cf. Acts 5:12)."
    },
    {
      "pk": 340312,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 12,
      "text": "When Peter saw this, he addressed the people: \"Men of Israel, why do you marvel at this, or why do you stare at us, as though by our own power or godliness we had made him walk?\"",
      "links": "",
      "comment": "Peter immediately deflects credit from himself, attributing the miracle to God alone. This humility is a hallmark of authentic spiritual leadership."
    },
    {
      "pk": 340313,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 13,
      "text": "\"The God of Abraham, Isaac, and Jacob, the God of our fathers, has glorified his servant Jesus, whom you handed over and denied before Pilate, when he had decided to release him.\"",
      "links": "<a href='/AIV/02/3/6'>Ex. 3:6</a>; <a href='/AIV/42/23/4,16'>Luke 23:4,16</a>",
      "comment": "The identification of Jesus as God’s servant fulfills messianic prophecy (cf. Isaiah 52:13, 53:11). The language recalls Old Testament covenant history, signaling continuity with God’s promises."
    },
    {
      "pk": 340314,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 14,
      "text": "\"But you denied the Holy and Righteous One and asked for a murderer to be granted to you,\"",
      "links": "<a href='/AIV/23/53/11'>Isa. 53:11</a>; <a href='/AIV/42/23/18-19'>Luke 23:18-19</a>",
      "comment": "\"Holy and Righteous One\" are messianic titles, emphasizing Jesus’s sinlessness, echoing Isaiah’s Servant song (Isaiah 53)."
    },
    {
      "pk": 340315,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 15,
      "text": "\"and you killed the Author of life, whom God raised from the dead. To this we are witnesses.\"",
      "links": "<a href='/AIV/43/11/25'>John 11:25</a>; <a href='/AIV/44/2/32'>Acts 2:32</a>",
      "comment": "\"Author of life\" (or \"Prince of life\") highlights Christ’s divinity and his power over life and death (John 1:4; 11:25). The resurrection is central—the apostles are witnesses to this foundation of Christian faith."
    },
    {
      "pk": 340316,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 16,
      "text": "\"And his name, by faith in his name, has made this man strong whom you see and know; and the faith that is through Jesus has given him this perfect health in the presence of you all.\"",
      "links": "<a href='/AIV/40/9/22'>Matt. 9:22</a>",
      "comment": "Faith in Jesus’s name brings true healing—physical and spiritual. This incident demonstrates the importance of faith as the instrument through which Christ acts in his Church to heal and save."
    },
    {
      "pk": 340317,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 17,
      "text": "\"And now, brothers, I know that you acted in ignorance, as did also your rulers.\"",
      "links": "<a href='/AIV/42/23/34'>Luke 23:34</a>",
      "comment": "Peter recognizes human weakness, echoing Christ’s prayer of forgiveness on the cross (Luke 23:34). This emphasizes God’s mercy and the offer of repentance."
    },
    {
      "pk": 340318,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 18,
      "text": "\"But what God foretold by the mouth of all the prophets, that his Christ would suffer, he has fulfilled in this way.\"",
      "links": "<a href='/AIV/23/53/3-5'>Isa. 53:3-5</a>; <a href='/AIV/19/22/1-18'>Ps. 22:1-18</a>",
      "comment": "Peter claims that the messianic prophecies in the Old Testament are fulfilled in Jesus. This connects the events of Christ’s passion with God’s sovereign plan (see Isaiah 53, Psalm 22)."
    },
    {
      "pk": 340319,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 19,
      "text": "\"Repent, therefore, and turn back, that your sins may be blotted out,\"",
      "links": "<a href='/AIV/23/55/7'>Isa. 55:7</a>; <a href='/AIV/44/2/38'>Acts 2:38</a>",
      "comment": "Repentance is presented as necessary for forgiveness and renewal. The idea of sins being 'blotted out' recalls covenant language from the prophets (Isaiah 43:25; 55:7)."
    },
    {
      "pk": 340320,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 20,
      "text": "\"that times of refreshing may come from the presence of the Lord, and that he may send the Christ appointed for you, Jesus,\"",
      "links": "",
      "comment": "\"Times of refreshing\" suggests both spiritual renewal now and the future hope of Christ’s return. The connection between repentance and the coming of Christ highlights the corporate nature of faith and God's plan for all his people."
    },
    {
      "pk": 340321,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 21,
      "text": "\"whom heaven must receive until the time for restoring all things which God spoke by the mouth of his holy prophets long ago.\"",
      "links": "<a href='/AIV/23/65/17'>Isa. 65:17</a>; <a href='/AIV/44/1/11'>Acts 1:11</a>",
      "comment": "Christ's ascension and future return are both foretold; the restoration of all things refers to the promised new creation (Isaiah 65:17; Acts 1:11)."
    },
    {
      "pk": 340322,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 22,
      "text": "\"Moses said, 'The Lord God will raise up for you a prophet like me from your brothers. You shall listen to him in whatever he tells you.'\"",
      "links": "<a href='/AIV/05/18/15,18'>Deut. 18:15,18</a>; <a href='/AIV/40/17/5'>Matt. 17:5</a>",
      "comment": "Peter applies Moses’s promise to Jesus, indicating that Christ is the new and greater Moses. The call to 'listen to him' is echoed at the Transfiguration (Matt. 17:5)."
    },
    {
      "pk": 340323,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 23,
      "text": "\"And it shall be that every soul who does not listen to that prophet shall be destroyed from the people.\"",
      "links": "<a href='/AIV/05/18/19'>Deut. 18:19</a>",
      "comment": "Rejecting Jesus, the true prophet, brings serious judgment, fulfilling the warnings of Deuteronomy. Obedience to him is essential for participation among God’s people."
    },
    {
      "pk": 340324,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 24,
      "text": "\"And all the prophets who have spoken, from Samuel and those who came after him, also proclaimed these days.\"",
      "links": "<a href='/AIV/09/3/20'>1 Sam. 3:20</a>; <a href='/AIV/44/10/43'>Acts 10:43</a>",
      "comment": "The Old Testament prophetic witness is unified in pointing to Christ and the new era inaugurated by him. The Church’s witness is in full continuity with all prophetic revelation."
    },
    {
      "pk": 340325,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 25,
      "text": "\"You are the sons of the prophets, and of the covenant that God made with your fathers, saying to Abraham, 'And in your offspring shall all the families of the earth be blessed.'\"",
      "links": "<a href='/AIV/01/22/18'>Gen. 22:18</a>; <a href='/AIV/48/3/8'>Gal. 3:8</a>",
      "comment": "The Abrahamic blessing is realized in Christ, through his Church, extending to all nations (see Gal. 3:8). The idea of the faithful as heirs of the prophetic and covenantal promises is central to Christian self-understanding."
    },
    {
      "pk": 340326,
      "translation": "AIV",
      "book": 44,
      "chapter": 3,
      "verse": 26,
      "text": "\"God, having raised up his servant, sent him to you first, to bless you by turning every one of you from your wickedness.\"",
      "links": "<a href='/AIV/42/2/32'>Luke 2:32</a>; <a href='/AIV/45/1/16'>Rom. 1:16</a>",
      "comment": "God initiates salvation by sending Christ. The blessing comes through conversion—being turned from sin to new life in Christ. The ordering 'to you first' shows the continuity from Israel to the fullness of all peoples."
    }
  ],
  "translatedAt": "2025-12-23T03:14:07.541Z"
}