{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 6,
  "verses": [
    {
      "pk": 1206001,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 1,
      "text": "Now in those days, as the number of disciples was increasing, there arose a complaint from the Hellenists against the Hebrews, because their widows were being neglected in the daily distribution.",
      "links": "<a href='/AIV/44/2/47'>Acts 2:47</a>; <a href='/AIV/44/4/35'>Acts 4:35</a>",
      "comment": "The 'Hellenists' were Greek-speaking Jews, and the Hebrews were those who spoke Aramaic or Hebrew. The church is facing growing pains—showing both its rapid growth and challenges of caring for all in the fellowship."
    },
    {
      "pk": 1206002,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 2,
      "text": "So the twelve summoned the whole group of disciples and said, 'It is not right that we should neglect the word of God to serve tables.'",
      "links": "<a href='/AIV/44/1/15'>Acts 1:15</a>; <a href='/AIV/44/13/2'>Acts 13:2</a>",
      "comment": "The apostles emphasize the primacy of teaching the word, showing an apostolic priority on preaching but also recognizing the importance of material service. This foreshadows later development of church leadership and ministry roles."
    },
    {
      "pk": 1206003,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 3,
      "text": "Therefore, brothers, select from among you seven men of good reputation, full of the Spirit and of wisdom, whom we may appoint to this duty.",
      "links": "<a href='/AIV/16/13/13'>Neh. 13:13</a>; <a href='/AIV/44/1/8'>Acts 1:8</a>",
      "comment": "The apostles direct the community to select men who are spiritually mature, setting a standard for church leadership. This passage is seen as the institution of the ministry of service—later understood as a precursor to the diaconate (servant-leadership), marking apostolic authority to ordain new leaders."
    },
    {
      "pk": 1206004,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 4,
      "text": "But we will devote ourselves to prayer and to the ministry of the word.'",
      "links": "<a href='/AIV/44/2/42'>Acts 2:42</a>; <a href='/AIV/20/16/3'>Prov. 16:3</a>",
      "comment": "Apostolic focus remains fixed on prayer and teaching. This highlights a distinction between different kinds of church ministry and a model for later church structure."
    },
    {
      "pk": 1206005,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 5,
      "text": "This proposal pleased the whole gathering, and they chose Stephen, a man full of faith and the Holy Spirit, and Philip, and Prochorus, and Nicanor, and Timon, and Parmenas, and Nicolas, a proselyte from Antioch.",
      "links": "<a href='/AIV/44/21/8'>Acts 21:8</a>; <a href='/AIV/44/11/19-20'>Acts 11:19-20</a>",
      "comment": "Stephen is given special mention, foreshadowing his later role as the first Christian martyr. These seven are chiefly Greek in name, showing the church's openness and the inclusive nature of its leadership."
    },
    {
      "pk": 1206006,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 6,
      "text": "They set them before the apostles, and after praying, they laid their hands on them.",
      "links": "<a href='/AIV/13/9/17'>1 Sam. 9:17</a>; <a href='/AIV/44/8/17'>Acts 8:17</a>; <a href='/AIV/54/4/14'>1 Tim. 4:14</a>",
      "comment": "The laying on of hands is a sign of transferring authority and blessing (cf. Numbers 27:18-23, also 1 Tim. 4:14), setting a pattern for ordination and apostolic succession. This act is central for a visible, authoritative ministry appointed by previous leaders."
    },
    {
      "pk": 1206007,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 7,
      "text": "So the word of God kept spreading, and the number of disciples kept increasing greatly in Jerusalem, and a large number of the priests became obedient to the faith.",
      "links": "<a href='/AIV/44/2/41'>Acts 2:41</a>; <a href='/AIV/44/4/4'>Acts 4:4</a>",
      "comment": "The church's growth is depicted as the result of faithful ministry. Many priests joining the faith shows the message is winning even those trained in Old Testament service, fulfilling Christ's call to found a new people of God (see Luke 24:44-47)."
    },
    {
      "pk": 1206008,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 8,
      "text": "And Stephen, full of grace and power, was doing great wonders and signs among the people.",
      "links": "<a href='/AIV/44/2/43'>Acts 2:43</a>; <a href='/AIV/44/4/33'>Acts 4:33</a>",
      "comment": "Stephen, like the apostles, performs miracles. His being 'full of grace' echoes Old Testament figures empowered by God (see Ex. 31:3). This also hints at the importance of spiritual gifts being passed on through the community."
    },
    {
      "pk": 1206009,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 9,
      "text": "But some from the synagogue of the Freedmen, as it was called—both Cyrenians and Alexandrians, and others from Cilicia and Asia—stood up and argued with Stephen.",
      "links": "<a href='/AIV/44/24/12'>Acts 24:12</a>; <a href='/AIV/44/2/10'>Acts 2:10</a>",
      "comment": "The 'Freedmen' were likely former slaves or their descendants. Their opposition to Stephen shows how the gospel was creating controversy in diverse Jewish communities around Jerusalem."
    },
    {
      "pk": 1206010,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 10,
      "text": "But they could not withstand the wisdom and the Spirit by which he spoke.",
      "links": "<a href='/AIV/42/21/15'>Luke 21:15</a>; <a href='/AIV/42/12/12'>Luke 12:12</a>",
      "comment": "Stephen's wisdom and the Spirit recall Jesus' promise that the Spirit would provide words to his followers under trial (Luke 12:12), and anticipates the Christian witness empowered by the Spirit. It points to the efficacy of apostolically ordained ministers."
    },
    {
      "pk": 1206011,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 11,
      "text": "Then they secretly persuaded men to say, 'We have heard him speak blasphemous words against Moses and God.'",
      "links": "<a href='/AIV/40/26/59-61'>Matthew 26:59-61</a>",
      "comment": "The accusation mirrors the false testimony brought against Jesus, suggesting the pattern of Christ's suffering is repeated in his followers. This connects to the theme of the righteous suffering unjustly."
    },
    {
      "pk": 1206012,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 12,
      "text": "They stirred up the people, the elders, and the scribes, and suddenly approached him, seized him, and brought him before the council.",
      "links": "<a href='/AIV/42/22/54'>Luke 22:54</a>; <a href='/AIV/44/4/1-3'>Acts 4:1-3</a>",
      "comment": "The seizure of Stephen repeats the pattern of Jesus' arrest (Luke 22:54). The reference to the 'council' (Sanhedrin) maintains the Jewish context of the gospel's rejection and provides a legal setting for the fulfillment of prophecy and martyrdom."
    },
    {
      "pk": 1206013,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 13,
      "text": "And they set up false witnesses who said, 'This man never stops speaking against this holy place and the law.'",
      "links": "<a href='/AIV/41/14/57'>Mark 14:57</a>",
      "comment": "The use of false witnesses is a direct parallel to Jesus' trial. Opposition to Stephen is framed as an opposition to tradition and the temple, reinforcing the continuity between Christ and his body, the church."
    },
    {
      "pk": 1206014,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 14,
      "text": "For we have heard him say that this Jesus of Nazareth will destroy this place and change the customs that Moses delivered to us.'",
      "links": "<a href='/AIV/40/26/61'>Matthew 26:61</a>; <a href='/AIV/43/2/19'>John 2:19</a>",
      "comment": "This misunderstood charge echoes Jesus' prediction of the temple's destruction (John 2:19). The new covenant in Christ fulfills and transforms the old order, establishing a new form of worship 'in spirit and truth' (John 4:23-24), embodied in the community of believers."
    },
    {
      "pk": 1206015,
      "translation": "AIV",
      "book": 44,
      "chapter": 6,
      "verse": 15,
      "text": "And all who sat in the council looked intently at him and saw that his face was like the face of an angel.",
      "links": "<a href='/AIV/02/34/29'>Exodus 34:29</a>; <a href='/AIV/40/17/2'>Matthew 17:2</a>",
      "comment": "Stephen's radiant face recalls Moses after speaking with God (Ex. 34:29) and Christ’s transfiguration (Matt. 17:2), suggesting God’s favor and setting Stephen as a bridge between the Old and New Covenant—a man marked by the glory of God. This affirms the transforming power of grace given through apostolic ministry and enduring witness even in suffering."
    }
  ],
  "translatedAt": "2025-12-23T03:15:46.255Z"
}