{
  "book": 51,
  "bookName": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 14,
  "verses": [
    {
      "pk": 51014001,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 1,
      "text": "Now in Iconium they entered together into the Jewish synagogue and spoke in such a way that a great number of both Jews and Greeks believed.",
      "links": "<a href='/AIV/51/13/5'>Acts 13:5</a>; <a href='/AIV/45/1/16'>Rom. 1:16</a>",
      "comment": "The synagogue is the central place for preaching to both Jews and Gentiles. The powerful speech of the apostles brings conversion to people from both backgrounds, aligning with the mission of the Church to all nations (see Acts 13:46, Rom. 1:16)."
    },
    {
      "pk": 51014002,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 2,
      "text": "But the Jews who refused to believe stirred up the Gentiles and poisoned their minds against the brothers.",
      "links": "<a href='/AIV/51/13/45'>Acts 13:45</a>; <a href='/AIV/40/10/22'>Matt. 10:22</a>",
      "comment": "Opposition within the synagogue comes from those who resist faith, demonstrating the spiritual conflict that follows true evangelization. Such hostility foreshadows ongoing struggles for the growing Christian community."
    },
    {
      "pk": 51014003,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 3,
      "text": "So they stayed there for a long time, speaking boldly for the Lord, who bore witness to the word of his grace by granting signs and wonders to be done through their hands.",
      "links": "<a href='/AIV/41/16/20'>Mark 16:20</a>; <a href='/AIV/58/2/4'>Heb. 2:4</a>",
      "comment": "The Lord confirms His message through the ministry of the apostles by granting miracles. This reflects the continuity of authority through laying on of hands, anticipating the sacramental actions later formalized in church life."
    },
    {
      "pk": 51014004,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 4,
      "text": "But the people of the city were divided; some sided with the Jews, and some with the apostles.",
      "links": "<a href='/AIV/42/12/51'>Luke 12:51-53</a>; <a href='/AIV/51/17/4'>Acts 17:4</a>",
      "comment": "The division that results from the proclamation of the gospel reflects Christ's prophecy that He would bring not peace but a sword (Luke 12:51), separating those who believe from those who do not."
    },
    {
      "pk": 51014005,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 5,
      "text": "When an attempt was made by both Gentiles and Jews, with their rulers, to mistreat and stone them,",
      "links": "<a href='/AIV/51/14/19'>Acts 14:19</a>; <a href='/AIV/43/8/59'>John 8:59</a>",
      "comment": "Persecution is a recurring theme for the apostles, echoing Jesus' words that His followers would share in His sufferings. The alliance of Gentiles and Jews against the apostles emphasizes how truth often faces united resistance."
    },
    {
      "pk": 51014006,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 6,
      "text": "they became aware of it and fled to the cities of Lycaonia, Lystra, and Derbe, and to the surrounding region.",
      "links": "<a href='/AIV/51/13/51'>Acts 13:51</a>; <a href='/AIV/40/10/23'>Matt. 10:23</a>",
      "comment": "The apostles discern prudently when to escape from persecution, as Jesus instructed (cf. Matt. 10:23). This demonstrates both faith and practical wisdom in leadership."
    },
    {
      "pk": 51014007,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 7,
      "text": "There they continued to preach the gospel.",
      "links": "<a href='/AIV/51/8/4'>Acts 8:4</a>",
      "comment": "Despite facing opposition, the apostles press on with proclaiming the good news, showing the enduring mission of the Church to preach in every circumstance."
    },
    {
      "pk": 51014008,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 8,
      "text": "Now at Lystra there was a man sitting who had no strength in his feet, crippled from birth and had never walked.",
      "links": "<a href='/AIV/44/3/2'>Acts 3:2</a>; <a href='/AIV/43/5/5-9'>John 5:5-9</a>",
      "comment": "The narrative here parallels the healing in Acts 3, reminding readers of the continuity and supernatural authority given to the apostles."
    },
    {
      "pk": 51014009,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 9,
      "text": "He listened to Paul speaking. And Paul, looking directly at him and seeing that he had faith to be healed,",
      "links": "<a href='/AIV/40/9/2'>Matt. 9:2</a>",
      "comment": "Paul, filled with discernment, sees the man’s faith and acts with the authority granted to the apostles, reminding us how faith and miracles often go hand in hand."
    },
    {
      "pk": 51014010,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 10,
      "text": "said in a loud voice, \"Stand up on your feet!\" And he sprang up and began walking.",
      "links": "<a href='/AIV/44/3/6-8'>Acts 3:6-8</a>; <a href='/AIV/40/9/6'>Matt. 9:6-7</a>",
      "comment": "This miracle echoes those performed by Christ, showing that the apostles carry on His ministry—a sign of apostolic succession and the authority passed on from Jesus Himself."
    },
    {
      "pk": 51014011,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 11,
      "text": "And when the crowds saw what Paul had done, they lifted up their voices, saying in Lycaonian, \"The gods have come down to us in the likeness of men!\"",
      "links": "<a href='/AIV/44/28/6'>Acts 28:6</a>",
      "comment": "The crowd's misunderstanding reflects humanity’s tendency to interpret miracles through their own cultural or religious beliefs, but this also highlights the apostolic role in correcting such misunderstandings with the true gospel."
    },
    {
      "pk": 51014012,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 12,
      "text": "And they called Barnabas Zeus, and Paul, Hermes, because he was the chief speaker.",
      "links": "<a href='/AIV/45/1/23'>Rom. 1:23</a>",
      "comment": "The attribution of divine status to the apostles by the people of Lystra reveals the longing for the divine in the human heart, which the apostles redirect to the true God."
    },
    {
      "pk": 51014013,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 13,
      "text": "The priest of Zeus, whose temple was just outside the city, brought oxen and garlands to the gates, intending, together with the crowds, to offer sacrifice.",
      "links": "<a href='/AIV/45/1/25'>Rom. 1:25</a>",
      "comment": "This scene illustrates both pagan worship and the role of sacrifice. It deeply contrasts with the Christian understanding of true worship and sacrifice fulfilled in Christ."
    },
    {
      "pk": 51014014,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 14,
      "text": "But when the apostles Barnabas and Paul heard this, they tore their robes and rushed out into the crowd, crying out,",
      "links": "<a href='/AIV/40/26/65'>Matt. 26:65</a>; <a href='/AIV/44/10/26'>Acts 10:26</a>",
      "comment": "Tearing their clothes is a Jewish expression of horror at blasphemy. Paul and Barnabas immediately reject idolatrous worship, affirming their humility and the uniqueness of God alone being worthy of worship."
    },
    {
      "pk": 51014015,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 15,
      "text": "\"Men, why are you doing these things? We also are men, with the same nature as you, and we bring you good news, that you should turn from these worthless things to the living God, who made the heavens, the earth, the sea, and all that is in them.",
      "links": "<a href='/AIV/19/146/6'>Ps. 146:6</a>; <a href='/AIV/66/14/7'>Rev. 14:7</a>",
      "comment": "Paul appeals to the true Creator, calling the Gentiles to worship the one living God. Reference to creation underscores a fundamental doctrine: God as the sole source of all that exists."
    },
    {
      "pk": 51014016,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 16,
      "text": "In past generations, he allowed all the nations to walk in their own ways.",
      "links": "<a href='/AIV/45/1/21'>Rom. 1:21-24</a>",
      "comment": "God's patience is shown in allowing humanity a certain freedom before the full revelation of Christ. This prepares for the unity of all peoples in the one family of God."
    },
    {
      "pk": 51014017,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 17,
      "text": "Yet he did not leave himself without witness, for he did good by giving you rains from heaven and fruitful seasons, satisfying your hearts with food and gladness.\"",
      "links": "<a href='/AIV/19/65/9-13'>Ps. 65:9-13</a>; <a href='/AIV/45/2/4'>Rom. 2:4</a>",
      "comment": "Even before direct revelation, God revealed Himself to all through providence and blessings of nature, which is a form of general revelation leading toward the fullness of the gospel."
    },
    {
      "pk": 51014018,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 18,
      "text": "Even with these words, they barely restrained the people from offering sacrifice to them.",
      "links": "<a href='/AIV/44/10/25-26'>Acts 10:25-26</a>",
      "comment": "Despite clarifying their humanity, the apostles could hardly stop the crowd. The challenge of distinguishing true worship from superstition is a recurring theme in both Old and New Testaments."
    },
    {
      "pk": 51014019,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 19,
      "text": "But Jews from Antioch and Iconium came, and having persuaded the crowds, they stoned Paul and dragged him out of the city, thinking he was dead.",
      "links": "<a href='/AIV/47/11/25'>2 Cor. 11:25</a>; <a href='/AIV/51/7/58-60'>Acts 7:58-60</a>",
      "comment": "Paul undergoes severe persecution, echoing the martyrdom stories such as Stephen's. The endurance of the apostles resembles the perseverance of the saints through suffering."
    },
    {
      "pk": 51014020,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 20,
      "text": "But when the disciples gathered around him, he got up and went into the city. The next day, he went on with Barnabas to Derbe.",
      "links": "<a href='/AIV/42/4/29-30'>Luke 4:29-30</a>; <a href='/AIV/51/13/51'>Acts 13:51</a>",
      "comment": "Paul's recovery, perhaps miraculous, shows God’s sustaining power. The role of disciples gathering around is reminiscent of communal prayer and support in times of crisis."
    },
    {
      "pk": 51014021,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 21,
      "text": "After they had preached the gospel to that city and made many disciples, they returned to Lystra, Iconium, and Antioch,",
      "links": "<a href='/AIV/51/13/14'>Acts 13:14</a>; <a href='/AIV/40/28/19'>Matt. 28:19</a>",
      "comment": "The apostles are committed to building up new believers, echoing the commission to make disciples of all nations (cf. Matt. 28:19)."
    },
    {
      "pk": 51014022,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 22,
      "text": "strengthening the souls of the disciples, encouraging them to continue in the faith, and saying that through many tribulations we must enter the kingdom of God.",
      "links": "<a href='/AIV/40/7/14'>Matt. 7:14</a>; <a href='/AIV/60/4/12-13'>1 Pet. 4:12-13</a>",
      "comment": "Perseverance through suffering is necessary for entering God's kingdom, affirming that the Christian journey is not free from hardship, but grace strengthens believers within the Church."
    },
    {
      "pk": 51014023,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 23,
      "text": "When they had appointed elders for them in every church, with prayer and fasting, they entrusted them to the Lord in whom they had believed.",
      "links": "<a href='/AIV/54/4/14'>1 Tim. 4:14</a>; <a href='/AIV/56/1/5'>Titus 1:5</a>",
      "comment": "The apostles establish local leadership through prayer and fasting, modeling the process of ordination. This founding structure ensures apostolic succession and continuity of teaching."
    },
    {
      "pk": 51014024,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 24,
      "text": "Then they passed through Pisidia and came to Pamphylia.",
      "links": "<a href='/AIV/51/13/13'>Acts 13:13</a>",
      "comment": "This verse records their practical route, emphasizing the expansive missionary work across diverse regions—a model for all Christian evangelistic efforts."
    },
    {
      "pk": 51014025,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 25,
      "text": "When they had spoken the word in Perga, they went down to Attalia.",
      "links": "<a href='/AIV/51/13/13'>Acts 13:13</a>",
      "comment": "Again, the apostles continue to spread the gospel by teaching wherever they go, underlying the universal call to mission."
    },
    {
      "pk": 51014026,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 26,
      "text": "From there they sailed to Antioch, where they had been commended to the grace of God for the work they had now completed.",
      "links": "<a href='/AIV/51/13/1-3'>Acts 13:1-3</a>",
      "comment": "Antioch serves as the launching point and home for missionary work, emphasizing accountability and the unity of believers sent out with prayer and blessing."
    },
    {
      "pk": 51014027,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 27,
      "text": "When they arrived and gathered the church together, they reported all that God had done with them, and how he had opened a door of faith to the Gentiles.",
      "links": "<a href='/AIV/51/11/18'>Acts 11:18</a>; <a href='/AIV/46/16/9'>1 Cor. 16:9</a>",
      "comment": "Reporting to the Church reflects a model of leadership and accountability where even apostles give testimony of God's work, and the mission to the Gentiles is seen as the work of the Spirit."
    },
    {
      "pk": 51014028,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 14,
      "verse": 28,
      "text": "And they remained no little time with the disciples.",
      "links": "<a href='/AIV/51/11/26'>Acts 11:26</a>",
      "comment": "The apostles spend extended time building up the community of believers. This demonstrates the importance of not only evangelism but continued formation and fellowship amongst the faithful."
    }
  ],
  "translatedAt": "2025-12-24T11:26:09.038Z"
}