{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 11,
  "verses": [
    {
      "pk": 1101101,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 1,
      "text": "Now the apostles and the brothers who were throughout Judea heard that the Gentiles also had received the word of God.",
      "links": "<a href='/AIV/44/10/44-48'>Acts 10:44-48</a>; <a href='/AIV/44/8/14'>Acts 8:14</a>",
      "comment": "This verse shows the rapid spread of the Gospel beyond Jews to Gentiles, fulfilling God's promise to Abraham to bless all nations (Genesis 12:3)."
    },
    {
      "pk": 1101102,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 2,
      "text": "So when Peter went up to Jerusalem, those who were of the circumcision criticized him,",
      "links": "<a href='/AIV/44/10/45'>Acts 10:45</a>; <a href='/AIV/11/19/10-11'>1 Kings 19:10-11</a>",
      "comment": "Peter faces opposition from Jewish believers who struggle with accepting Gentiles. This echoes patterns of resistance to expanding God's covenant in the Old Testament."
    },
    {
      "pk": 1101103,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 3,
      "text": "saying, 'You went to uncircumcised men and ate with them.'",
      "links": "<a href='/AIV/44/10/28'>Acts 10:28</a>; <a href='/AIV/03/11/47'>Leviticus 11:47</a>",
      "comment": "This accusation reflects Jewish dietary laws and separation from Gentiles. But their challenge will be addressed in the coming verses with Peter's vision."
    },
    {
      "pk": 1101104,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 4,
      "text": "But Peter began and explained it to them in order:",
      "links": "<a href='/AIV/44/10/9-16'>Acts 10:9-16</a>",
      "comment": "Peter takes care to recount God's work step by step, highlighting the importance of testimony in handing on the faith."
    },
    {
      "pk": 1101105,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 5,
      "text": "'I was in the city of Joppa praying, and in a trance I saw a vision: something like a large sheet, being let down from heaven by its four corners, and it came down to me.'",
      "links": "<a href='/AIV/44/10/9-11'>Acts 10:9-11</a>; <a href='/AIV/26/1/1'>Ezekiel 1:1</a>",
      "comment": "The vision emphasizes divine initiative and universality—four corners symbolizing all directions, indicating the Gospel is for all humanity."
    },
    {
      "pk": 1101106,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 6,
      "text": "'Looking at it closely, I observed animals and beasts of prey and reptiles and birds of the air.'",
      "links": "<a href='/AIV/03/11/2-47'>Leviticus 11:2-47</a>",
      "comment": "These animals include both clean and unclean, symbolic of all peoples. The vision abolishes the old dietary distinctions and points to a new unity."
    },
    {
      "pk": 1101107,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 7,
      "text": "'And I heard a voice saying to me, \"Rise, Peter; kill and eat.\"'",
      "links": "<a href='/AIV/44/10/13'>Acts 10:13</a>",
      "comment": "God's command challenges Peter’s tradition and opens the way for a new understanding of purity and inclusion in Christ."
    },
    {
      "pk": 1101108,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 8,
      "text": "'But I said, \"By no means, Lord; for nothing unclean or impure has ever entered my mouth.\"'",
      "links": "<a href='/AIV/26/4/14'>Ezekiel 4:14</a>; <a href='/AIV/44/10/14'>Acts 10:14</a>",
      "comment": "Peter’s hesitation shows his faithfulness to Jewish law but also his willingness to obey when divinely corrected."
    },
    {
      "pk": 1101109,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 9,
      "text": "'But the voice answered a second time from heaven, \"What God has made clean, do not call impure.\"'",
      "links": "<a href='/AIV/44/10/15'>Acts 10:15</a>; <a href='/AIV/23/1/18'>Isaiah 1:18</a>",
      "comment": "Here is an essential shift: God alone purifies, looking forward to the saving work of Christ who removes all barriers (Ephesians 2:14-16)."
    },
    {
      "pk": 1101110,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 10,
      "text": "'This happened three times, and all was drawn up again into heaven.'",
      "links": "<a href='/AIV/44/10/16'>Acts 10:16</a>; <a href='/AIV/01/41/32'>Genesis 41:32</a>",
      "comment": "Repeating the vision three times stresses divine certainty, echoing the pattern of threefold repetition in scriptural revelation."
    },
    {
      "pk": 1101111,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 11,
      "text": "'And behold, at that very moment three men arrived at the house where we were, sent to me from Caesarea.'",
      "links": "<a href='/AIV/44/10/17-18'>Acts 10:17-18</a>",
      "comment": "Notice the immediate connection between vision and action, underscoring God’s providence and guidance in the spread of the Gospel."
    },
    {
      "pk": 1101112,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 12,
      "text": "'And the Spirit told me to go with them, making no distinction. These six brothers also accompanied me, and we entered the man's house.'",
      "links": "<a href='/AIV/44/10/20'>Acts 10:20</a>; <a href='/AIV/44/15/9'>Acts 15:9</a>",
      "comment": "Peter acts according to the Holy Spirit’s direct command, signaling divine authority guiding the mission of the early Church—key for later church teaching authority."
    },
    {
      "pk": 1101113,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 13,
      "text": "'And he told us how he had seen an angel standing in his house and saying, \"Send to Joppa and bring Simon, who is called Peter;\"'",
      "links": "<a href='/AIV/44/10/3-6'>Acts 10:3-6</a>; <a href='/AIV/27/1/14'>Hebrews 1:14</a>",
      "comment": "Angelic guidance links both Gentiles and apostles, stressing God’s united purpose for salvation and Peter’s special leadership role."
    },
    {
      "pk": 1101114,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 14,
      "text": "'\"he will declare to you a message by which you will be saved, you and all your household.\"'",
      "links": "<a href='/AIV/44/10/22'>Acts 10:22</a>; <a href='/AIV/16/8/2'>Nehemiah 8:2</a>",
      "comment": "Peter, as chief messenger, is the means of salvation for Cornelius and his house—setting a pattern of salvation through apostolic ministry and household faith."
    },
    {
      "pk": 1101115,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 15,
      "text": "'As I began to speak, the Holy Spirit fell on them just as on us at the beginning.'",
      "links": "<a href='/AIV/44/2/1-4'>Acts 2:1-4</a>; <a href='/AIV/44/10/44'>Acts 10:44</a>",
      "comment": "The Gentiles receive the same Spirit as the apostles at Pentecost; a striking sign that there is one Church, gathered by the same Spirit."
    },
    {
      "pk": 1101116,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 16,
      "text": "'And I remembered the word of the Lord, how he said, \"John baptized with water, but you will be baptized with the Holy Spirit.\"'",
      "links": "<a href='/AIV/44/1/5'>Acts 1:5</a>; <a href='/AIV/40/3/11'>Matthew 3:11</a>",
      "comment": "Peter ties the event to Jesus’ promise—a new, supernatural baptism, prefigured in John and now present in the Spirit."
    },
    {
      "pk": 1101117,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 17,
      "text": "'If then God gave the same gift to them as he gave to us when we believed in the Lord Jesus Christ, who was I to stand in God's way?'",
      "links": "<a href='/AIV/44/15/8-9'>Acts 15:8-9</a>",
      "comment": "Peter recognizes God’s direct action and authority. He models humility and submission to God's will."
    },
    {
      "pk": 1101118,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 18,
      "text": "When they heard these things they fell silent. And they glorified God, saying, 'Then to the Gentiles also God has granted repentance that leads to life.'",
      "links": "<a href='/AIV/44/13/48'>Acts 13:48</a>; <a href='/AIV/45/2/4'>Romans 2:4</a>",
      "comment": "The gathered believers accept that Gentiles too are called into God’s covenant family—the universal call of the Gospel. Grace is offered to all through repentance and faith."
    },
    {
      "pk": 1101119,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 19,
      "text": "Now those who had been scattered because of the persecution that arose over Stephen traveled as far as Phoenicia and Cyprus and Antioch, speaking the word to no one except Jews.",
      "links": "<a href='/AIV/44/8/1-4'>Acts 8:1-4</a>; <a href='/AIV/44/7/59'>Acts 7:59</a>",
      "comment": "Persecution leads to the spread of the Gospel. The initial focus is still mostly to Jews, showing the early community's gradual transition."
    },
    {
      "pk": 1101120,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 20,
      "text": "But there were some of them, men of Cyprus and Cyrene, who on coming to Antioch spoke to the Hellenists also, preaching the Lord Jesus.",
      "links": "<a href='/AIV/44/6/1'>Acts 6:1</a>; <a href='/AIV/44/13/1'>Acts 13:1</a>",
      "comment": "These Hellenist believers were among the first to preach to Greek-speaking Gentiles, emphasizing missionary outreach and breaking cultural barriers."
    },
    {
      "pk": 1101121,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 21,
      "text": "And the hand of the Lord was with them, and a great number who believed turned to the Lord.",
      "links": "<a href='/AIV/44/2/41'>Acts 2:41</a>; <a href='/AIV/44/5/14'>Acts 5:14</a>",
      "comment": "The phrase 'hand of the Lord' recalls Old Testament language of divine action. Faith results from God’s grace working through human instruments."
    },
    {
      "pk": 1101122,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 22,
      "text": "News of this came to the ears of the church in Jerusalem, and they sent Barnabas to Antioch.",
      "links": "<a href='/AIV/44/4/36'>Acts 4:36</a>; <a href='/AIV/44/8/14'>Acts 8:14</a>",
      "comment": "The central community in Jerusalem maintains oversight, displaying the importance of unity and connection—an early glimpse of Church structure and mission."
    },
    {
      "pk": 1101123,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 23,
      "text": "When he came and saw the grace of God, he was glad, and he encouraged them all to remain faithful to the Lord with steadfast purpose.",
      "links": "<a href='/AIV/44/13/43'>Acts 13:43</a>",
      "comment": "Barnabas models the ministry of encouragement and perseverance in the faith, vital for growing Christian communities."
    },
    {
      "pk": 1101124,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 24,
      "text": "For he was a good man, full of the Holy Spirit and of faith. And a great many people were added to the Lord.",
      "links": "<a href='/AIV/44/6/5'>Acts 6:5</a>; <a href='/AIV/44/4/36-37'>Acts 4:36-37</a>",
      "comment": "Barnabas is filled with the Holy Spirit, a sign of leadership and sanctity—qualities later revered in holy men and women throughout Church history."
    },
    {
      "pk": 1101125,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 25,
      "text": "So Barnabas went to Tarsus to look for Saul,",
      "links": "<a href='/AIV/44/9/27-30'>Acts 9:27-30</a>",
      "comment": "Barnabas takes the initiative to seek Saul (Paul), highlighting the value of personal invitation and mentorship in ministry."
    },
    {
      "pk": 1101126,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 26,
      "text": "And when he had found him, he brought him to Antioch. For a whole year they met with the church and taught a great many people. And in Antioch the disciples were first called Christians.",
      "links": "<a href='/AIV/60/4/16'>1 Peter 4:16</a>; <a href='/AIV/44/13/1'>Acts 13:1</a>",
      "comment": "Antioch becomes an important center of the early Church. The name ‘Christian’ signals a distinct identity united by faith, teaching, and communal life."
    },
    {
      "pk": 1101127,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 27,
      "text": "Now in these days prophets came down from Jerusalem to Antioch.",
      "links": "<a href='/AIV/44/13/1'>Acts 13:1</a>; <a href='/AIV/49/4/11'>Ephesians 4:11</a>",
      "comment": "Prophets are recognized, showing the diversity of ministries in the Church and the importance of authoritative preaching."
    },
    {
      "pk": 1101128,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 28,
      "text": "And one of them named Agabus stood up and foretold by the Spirit that there would be a great famine over all the world. (This took place during the days of Claudius.)",
      "links": "<a href='/AIV/44/21/10-11'>Acts 21:10-11</a>; <a href='/AIV/42/21/11'>Luke 21:11</a>",
      "comment": "Agabus’s prophecy is confirmed in history. The Spirit continues to guide the Church and provide for the needs of the faithful."
    },
    {
      "pk": 1101129,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 29,
      "text": "So the disciples determined, each according to his ability, to send relief to the brothers living in Judea.",
      "links": "<a href='/AIV/46/16/1-3'>1 Corinthians 16:1-3</a>; <a href='/AIV/48/2/10'>Galatians 2:10</a>",
      "comment": "The Church responds to material need with generosity and unity. The principle of sharing resources reflects authentic Christian charity."
    },
    {
      "pk": 1101130,
      "translation": "AIV",
      "book": 44,
      "chapter": 11,
      "verse": 30,
      "text": "And they did so, sending it to the elders by the hand of Barnabas and Saul.",
      "links": "<a href='/AIV/44/14/23'>Acts 14:23</a>; <a href='/AIV/54/5/17'>1 Timothy 5:17</a>",
      "comment": "The relief is entrusted to Barnabas and Saul, delivered to the elders—suggesting an early structure of church leadership through which spiritual and material needs are met."
    }
  ],
  "translatedAt": "2025-12-23T03:19:59.758Z"
}