{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 22,
  "verses": [
    {
      "pk": 1950021,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 1,
      "text": "“Brothers and fathers, listen now to my defense which I am presenting to you.”",
      "links": "<a href='/AIV/7/11/7'>Judg. 11:7</a>; <a href='/AIV/44/7/2'>Acts 7:2</a>",
      "comment": "Paul addresses the crowd respectfully, appealing to his fellow Jews' sense of kinship and authority, similar to Stephen’s defense (Acts 7:2)."
    },
    {
      "pk": 1950022,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 2,
      "text": "When they heard him speaking to them in the Hebrew language, they became even more silent. And he said:",
      "links": "<a href='/AIV/21/8/1'>Eccl. 8:1</a>; <a href='/AIV/44/21/40'>Acts 21:40</a>",
      "comment": "Paul's use of Hebrew connects him with the Jewish audience, giving added weight and credibility to his words (see also Acts 21:40)."
    },
    {
      "pk": 1950023,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 3,
      "text": "“I am a Jew, born in Tarsus of Cilicia, but brought up in this city, educated at the feet of Gamaliel according to the strictness of our ancestral law, being zealous for God just as all of you are today.",
      "links": "<a href='/AIV/5/33/3'>Deut. 33:3</a>; <a href='/AIV/44/5/34'>Acts 5:34</a>",
      "comment": "Paul emphasizes both his heritage and strict education under Gamaliel (see Acts 5:34), highlighting his deep understanding of the Law and the continuity between the old and new covenants."
    },
    {
      "pk": 1950024,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 4,
      "text": "I persecuted this Way to the death, arresting and delivering both men and women into prison,",
      "links": "<a href='/AIV/44/8/3'>Acts 8:3</a>; <a href='/AIV/44/9/1-2'>Acts 9:1–2</a>",
      "comment": "\"The Way\" refers to the early Christian movement. Paul acknowledges his previous zeal in opposing those who followed Christ, thus emphasizing the radical change brought by his encounter with Jesus."
    },
    {
      "pk": 1950025,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 5,
      "text": "as the high priest and all the council of elders can testify about me. From them I even received letters to the brothers, and I went to Damascus to bring back those who were there as prisoners to Jerusalem, so that they might be punished.",
      "links": "<a href='/AIV/44/9/2'>Acts 9:2</a>",
      "comment": "Paul appeals to the authority of the religious leadership and refers to his legal authority, further authenticating his Jewish credentials."
    },
    {
      "pk": 1950026,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 6,
      "text": "But as I was traveling and approaching Damascus, about noon, suddenly a great light from heaven shone around me.",
      "links": "<a href='/AIV/26/1/28'>Ezek. 1:28</a>; <a href='/AIV/44/9/3'>Acts 9:3</a>",
      "comment": "The supernatural character of the vision is emphasized by the bright light, drawing parallels to Old Testament theophanies (e.g., Ezek. 1:28)."
    },
    {
      "pk": 1950027,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 7,
      "text": "And I fell to the ground and heard a voice say to me, ‘Saul, Saul, why are you persecuting me?’",
      "links": "<a href='/AIV/44/9/4'>Acts 9:4</a>; <a href='/AIV/40/25/40'>Matt. 25:40</a>",
      "comment": "The personal identification of Jesus with his followers (“me”) echoes the close mystical unity between Christ and the Church (cf. Matt. 25:40)."
    },
    {
      "pk": 1950028,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 8,
      "text": "I answered, ‘Who are you, Lord?’ He said to me, ‘I am Jesus of Nazareth, whom you are persecuting.’",
      "links": "<a href='/AIV/44/9/5'>Acts 9:5</a>",
      "comment": "Jesus reveals Himself as the risen Lord, demonstrating that the Christian faith is anchored in a real, living encounter with the resurrected Christ."
    },
    {
      "pk": 1950029,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 9,
      "text": "Those who were with me saw the light but did not understand the voice of the one who was speaking to me.",
      "links": "<a href='/AIV/44/9/7'>Acts 9:7</a>",
      "comment": "Though others witnessed the phenomenon, only Paul fully comprehended the message, supporting a personal call to apostleship."
    },
    {
      "pk": 1950030,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 10,
      "text": "And I said, ‘What shall I do, Lord?’ The Lord said to me, ‘Get up and go into Damascus. There you will be told everything that has been appointed for you to do.’",
      "links": "<a href='/AIV/44/9/6'>Acts 9:6</a>",
      "comment": "Paul’s submission underscores the importance of obedience in the faith, highlighting that God’s will unfolds through human mediators."
    },
    {
      "pk": 1950031,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 11,
      "text": "Since I could not see because of the brightness of that light, I was led by the hand by those who were with me and came into Damascus.",
      "links": "<a href='/AIV/44/9/8'>Acts 9:8</a>",
      "comment": "Physical blindness reflects spiritual transformation. The motif of light and blindness recalls similar Old Testament themes (see Isa. 42:6–7)."
    },
    {
      "pk": 1950032,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 12,
      "text": "A certain Ananias, a devout man according to the Law, well spoken of by all the Jews who lived there,",
      "links": "<a href='/AIV/44/9/10'>Acts 9:10</a>",
      "comment": "Ananias’ reputation as devout and law-abiding bridges the gap of trust between Paul and his audience."
    },
    {
      "pk": 1950033,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 13,
      "text": "came to me and, standing by me, said, ‘Brother Saul, receive your sight.’ At that very hour I looked up at him.",
      "links": "<a href='/AIV/44/9/17'>Acts 9:17</a>",
      "comment": "Miraculous healing through the ministry of Ananias shows God's power working through chosen instruments, reflecting the importance of apostolic mediation."
    },
    {
      "pk": 1950034,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 14,
      "text": "He said, ‘The God of our fathers has chosen you to know his will, to see the Righteous One, and to hear a voice from his mouth;",
      "links": "<a href='/AIV/42/24/27'>Luke 24:27</a>; <a href='/AIV/23/53/11'>Isa. 53:11</a>; <a href='/AIV/44/3/14'>Acts 3:14</a>",
      "comment": "‘The Righteous One’ is a messianic title (cf. Isa. 53:11), underlining Jesus’ fulfillment of prophetic expectation. Paul’s call is rooted in divine election."
    },
    {
      "pk": 1950035,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 15,
      "text": "for you will be a witness for him to all people of what you have seen and heard.",
      "links": "<a href='/AIV/44/1/8'>Acts 1:8</a>",
      "comment": "Paul’s commission is universal, reflecting the early Church’s mission to all nations, fulfilling the prophecy of a global faith (see Acts 1:8)."
    },
    {
      "pk": 1950036,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 16,
      "text": "And now, why wait? Get up and be baptized, and wash away your sins, calling on his name.",
      "links": "<a href='/AIV/2/38/18'>Exod. 38:18</a>; <a href='/AIV/44/2/38'>Acts 2:38</a>; <a href='/AIV/60/3/21'>1 Pet. 3:21</a>",
      "comment": "Baptism is commanded for the removal of sins, underscoring the means by which God dispenses grace. This points to the sacramental nature of Christian initiation."
    },
    {
      "pk": 1950037,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 17,
      "text": "When I returned to Jerusalem and was praying in the temple, I fell into a trance",
      "links": "<a href='/AIV/44/9/26'>Acts 9:26</a>; <a href='/AIV/44/10/10'>Acts 10:10</a>",
      "comment": "Paul’s return to the temple and a mystical experience highlight continuity with Jewish worship and the value of liturgical prayer."
    },
    {
      "pk": 1950038,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 18,
      "text": "and I saw him saying to me, ‘Hurry and leave Jerusalem quickly, because they will not accept your testimony about me.’",
      "links": "<a href='/AIV/42/13/34'>Luke 13:34</a>; <a href='/AIV/44/9/29'>Acts 9:29–30</a>",
      "comment": "Jesus’ appearance in the temple vision stresses Paul's apostolic authority and the spiritual value of visionary experiences in discerning God’s will. Similar to Old Testament prophets."
    },
    {
      "pk": 1950039,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 19,
      "text": "And I said, ‘Lord, they themselves know that in every synagogue I imprisoned and beat those who believed in you.",
      "links": "<a href='/AIV/44/8/3'>Acts 8:3</a>",
      "comment": "Paul recalls his notorious past, further highlighting the transformative power of God’s grace."
    },
    {
      "pk": 1950040,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 20,
      "text": "And when the blood of your witness Stephen was being shed, I myself was standing by, giving my approval and guarding the garments of those who killed him.’",
      "links": "<a href='/AIV/44/7/58'>Acts 7:58</a>; <a href='/AIV/44/8/1'>Acts 8:1</a>",
      "comment": "Paul’s complicity in Stephen’s martyrdom marks his past hostility towards Christ. ‘Witness’ (martyr) comes to signify a special, exalted type of Christian witness."
    },
    {
      "pk": 1950041,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 21,
      "text": "Then he said to me, ‘Go, for I will send you far away to the Gentiles.’”",
      "links": "<a href='/AIV/23/49/6'>Isa. 49:6</a>; <a href='/AIV/44/13/47'>Acts 13:47</a>",
      "comment": "Paul’s mission extends God’s salvation to all humanity, in fulfillment of Old Testament prophecy (Isa. 49:6)."
    },
    {
      "pk": 1950042,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 22,
      "text": "They listened to him until this statement. Then they raised their voices and said, “Get rid of such a man from the earth! He should not be allowed to live!”",
      "links": "<a href='/AIV/44/7/54-57'>Acts 7:54–57</a>",
      "comment": "The violent reaction reveals deep-seated resistance to the inclusion of Gentiles. This foreshadows the difficult birth of the universal church."
    },
    {
      "pk": 1950043,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 23,
      "text": "As they were shouting and throwing off their cloaks and flinging dust into the air,",
      "links": "<a href='/AIV/44/14/19'>Acts 14:19</a>",
      "comment": "The crowd’s actions symbolize utter rejection and judgment, echoing the heated opposition faced by the prophets."
    },
    {
      "pk": 1950044,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 24,
      "text": "the commander ordered him to be brought into the barracks. He told them to examine him by flogging, so that he might find out why they were shouting at him like this.",
      "links": "<a href='/AIV/44/21/34'>Acts 21:34</a>",
      "comment": "Roman procedures reflect both the harshness and the due process of the legal system which Paul, as a Roman citizen, could invoke."
    },
    {
      "pk": 1950045,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 25,
      "text": "But when they stretched him out for the lash, Paul said to the centurion standing there, “Is it lawful for you to flog a man who is a Roman citizen, and uncondemned?”",
      "links": "<a href='/AIV/16/13/19'>Neh. 13:19</a>; <a href='/AIV/44/16/37'>Acts 16:37</a>",
      "comment": "Roman citizenship afforded significant rights and protections. Paul’s legal knowledge protected him from unjust treatment."
    },
    {
      "pk": 1950046,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 26,
      "text": "When the centurion heard this, he went to the commander and said, “What are you going to do? This man is a Roman citizen.”",
      "links": "<a href='/AIV/44/16/38'>Acts 16:38</a>",
      "comment": "Awareness of Paul’s citizenship changes the Roman officer’s approach, showing the importance of legitimate authority and order."
    },
    {
      "pk": 1950047,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 27,
      "text": "So the commander came and asked him, “Tell me, are you a Roman citizen?” He said, “Yes.”",
      "links": "",
      "comment": "Paul’s affirming of his legal status is crucial for his forthcoming appeals and trials."
    },
    {
      "pk": 1950048,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 28,
      "text": "The commander replied, “I purchased this citizenship for a great sum.” But Paul said, “But I was born a citizen.”",
      "links": "",
      "comment": "Paul’s inherited citizenship set him apart and afforded him special protection under Roman law."
    },
    {
      "pk": 1950049,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 29,
      "text": "Therefore, those who were about to interrogate him withdrew immediately. The commander was afraid, realizing he had bound a Roman citizen without due process.",
      "links": "<a href='/AIV/44/16/38'>Acts 16:38</a>",
      "comment": "Roman authorities take Paul’s citizenship seriously, showing a value for justice and the proper use of authority."
    },
    {
      "pk": 1950050,
      "translation": "AIV",
      "book": 44,
      "chapter": 22,
      "verse": 30,
      "text": "The next day, wanting to find out the real reason Paul was accused by the Jews, he released him and ordered the chief priests and all the council to assemble. Then he brought Paul down and set him before them.",
      "links": "<a href='/AIV/44/23/1'>Acts 23:1</a>; <a href='/AIV/44/5/21'>Acts 5:21</a>",
      "comment": "Paul’s appearance before the council mirrors the trials of Jesus and the apostles, affirming continuity in leadership and authority in the early church."
    }
  ],
  "translatedAt": "2025-12-23T03:27:02.434Z"
}