{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 23,
  "verses": [
    {
      "pk": 2392301,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 1,
      "text": "Paul looked intently at the council and said, \"Brothers, I have lived before God with a clear conscience up to this day.\"",
      "links": "<a href='/AIV/44/24/16'>Acts 24:16</a>",
      "comment": "Paul addresses the Sanhedrin, declaring his innocence and uprightness in the sight of God. The concept of conscience before God is central to Christian ethics and connects to Paul's later teachings."
    },
    {
      "pk": 2392302,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 2,
      "text": "The high priest Ananias commanded those standing near him to strike him on the mouth.",
      "links": "<a href='/AIV/44/23/4'>Acts 23:4</a>",
      "comment": "This act mirrors the unjust punishment Christ received (John 18:22), emphasizing suffering for truth."
    },
    {
      "pk": 2392303,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 3,
      "text": "Then Paul said to him, \"God will strike you, you whitewashed wall! You sit to judge me according to the law, yet against the law you order me to be struck.\"",
      "links": "<a href='/AIV/40/23/27'>Matt. 23:27</a>; <a href='/AIV/26/13/10'>Ezek. 13:10-11</a>",
      "comment": "Paul calls out hypocrisy, reflecting Jesus' own rebukes of religious leaders and the call for true inward holiness."
    },
    {
      "pk": 2392304,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 4,
      "text": "Those who stood by said, \"Do you dare to insult God’s high priest?\"",
      "links": "<a href='/AIV/2/22/28'>Ex. 22:28</a>",
      "comment": "Respect for religious authority is emphasized; Paul's response in the next verse draws on Old Testament law."
    },
    {
      "pk": 2392305,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 5,
      "text": "Paul replied, \"Brothers, I did not know he was the high priest. For it is written, ‘You shall not speak evil of a ruler of your people.’\"",
      "links": "<a href='/AIV/2/22/28'>Ex. 22:28</a>",
      "comment": "Paul humbly submits to the law, demonstrating obedience and reverence for established spiritual authority."
    },
    {
      "pk": 2392306,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 6,
      "text": "Now when Paul perceived that one part were Sadducees and the other Pharisees, he called out in the council, \"Brothers, I am a Pharisee, a son of Pharisees. I am being judged for the hope of the resurrection of the dead!\"",
      "links": "<a href='/AIV/44/24/15'>Acts 24:15</a>; <a href='/AIV/40/22/23'>Matt. 22:23</a>",
      "comment": "Paul uses doctrinal divisions about resurrection; the hope of resurrection underlies Christian faith, especially concerning Christ's own victory over death."
    },
    {
      "pk": 2392307,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 7,
      "text": "And when he said this, a dissension arose between the Pharisees and Sadducees, and the assembly was divided.",
      "links": "<a href='/AIV/44/24/21'>Acts 24:21</a>",
      "comment": "The resurrection is a central Christian doctrine; division here foreshadows ongoing disputes about the truth of the Gospel."
    },
    {
      "pk": 2392308,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 8,
      "text": "For the Sadducees say that there is no resurrection, nor angel, nor spirit, but the Pharisees acknowledge them all.",
      "links": "<a href='/AIV/40/22/23'>Matt. 22:23</a>",
      "comment": "The rejection by Sadducees of unseen realities highlights the spiritual blindness that Christ came to heal."
    },
    {
      "pk": 2392309,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 9,
      "text": "A great uproar arose, and some of the scribes of the Pharisees' party stood up and argued forcefully: \"We find nothing wrong in this man. What if a spirit or an angel has spoken to him?\"",
      "links": "<a href='/AIV/44/5/39'>Acts 5:39</a>",
      "comment": "Some Pharisees are open to supernatural possibility. The presence of heavenly messengers connects to when God reveals his will through visions."
    },
    {
      "pk": 2392310,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 10,
      "text": "When the dissension became violent, the commander, afraid that Paul would be torn apart, ordered the soldiers to go down, take him by force and bring him into the barracks.",
      "links": "<a href='/AIV/44/21/31-32'>Acts 21:31-32</a>",
      "comment": "Paul is rescued from violence, echoing God's protection of His servants on their mission."
    },
    {
      "pk": 2392311,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 11,
      "text": "The following night the Lord stood by him and said, \"Take courage! For as you have testified about me in Jerusalem, so you must also bear witness in Rome.\"",
      "links": "<a href='/AIV/44/18/9-10'>Acts 18:9-10</a>; <a href='/AIV/27/23/11'>Matt. 28:19</a>",
      "comment": "Jesus directly encourages Paul. Acts shows ongoing guidance and support from the risen Lord—highlighting supernatural presence and the role of divinely-commissioned witnesses in continuing the apostolic mission to all nations."
    },
    {
      "pk": 2392312,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 12,
      "text": "When day came, some of the Jews formed a conspiracy and bound themselves under a curse, saying that they would neither eat nor drink until they had killed Paul.",
      "links": "<a href='/AIV/44/25/3'>Acts 25:3</a>",
      "comment": "The oath-bound plot against Paul recalls how evil may scheme against those bearing God’s message, just as enemies plotted against Christ."
    },
    {
      "pk": 2392313,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 13,
      "text": "There were more than forty who joined in this conspiracy.",
      "links": "",
      "comment": "A considerable group plots together, showing the extent of opposition to God’s plans."
    },
    {
      "pk": 2392314,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 14,
      "text": "They went to the chief priests and elders and said, \"We have strictly bound ourselves by an oath not to taste anything until we have killed Paul.\"",
      "links": "<a href='/AIV/41/14/1'>Mark 14:1</a>",
      "comment": "Collusion with religious leaders repeats the pattern of religious authorities joining in plots, as happened in Jesus' passion."
    },
    {
      "pk": 2392315,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 15,
      "text": "Now therefore, you and the council should request the commander to bring him down to you, as though you intend to examine his case more thoroughly. But we are ready to kill him before he comes near.\"",
      "links": "<a href='/AIV/40/26/4'>Matt. 26:4</a>",
      "comment": "Plans to ambush Paul again echo the secret plots against Christ. God’s providence preserves his appointed messengers."
    },
    {
      "pk": 2392316,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 16,
      "text": "But the son of Paul’s sister heard about the ambush, so he went into the barracks and told Paul.",
      "links": "",
      "comment": "Family intervention and providence: God often uses unexpected channels to protect His people."
    },
    {
      "pk": 2392317,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 17,
      "text": "Paul called one of the centurions and said, \"Take this young man to the commander, for he has something to report to him.\"",
      "links": "",
      "comment": "Paul acts wisely and resourcefully. Christian prudence and courage are necessary virtues for the mission."
    },
    {
      "pk": 2392318,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 18,
      "text": "So he took him, brought him to the commander, and said, \"Paul, the prisoner, called me and asked me to bring this young man to you. He has something to say to you.\"",
      "links": "",
      "comment": "The narrative detail shows God’s care through human agency, linking divine providence with personal action."
    },
    {
      "pk": 2392319,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 19,
      "text": "The commander took him by the hand, withdrew him privately, and asked, \"What is it you have to tell me?\"",
      "links": "",
      "comment": "Confidentially receiving the warning illustrates wise leadership and concern for justice."
    },
    {
      "pk": 2392320,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 20,
      "text": "And he said, \"The Jews have agreed to ask you to bring Paul down to the council tomorrow, as though they intend to inquire more thoroughly about him.\"",
      "links": "",
      "comment": "The plot is revealed; truth overcomes deception by the delivery of timely warning."
    },
    {
      "pk": 2392321,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 21,
      "text": "But do not let them persuade you, for more than forty men are lying in wait for him, who have bound themselves by an oath not to eat or drink until they have killed him. Even now, they are ready, waiting for your consent.\"",
      "links": "",
      "comment": "Divine intervention through human means: God’s hand is present, preserving those chosen for His purpose."
    },
    {
      "pk": 2392322,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 22,
      "text": "So the commander dismissed the young man and charged him, \"Tell no one that you have informed me of these things.\"",
      "links": "",
      "comment": "Secrecy and caution serve to protect God's messengers and help divine plans unfold."
    },
    {
      "pk": 2392323,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 23,
      "text": "Then he called two of his centurions and said, \"Get two hundred soldiers, seventy horsemen, and two hundred spearmen ready by the third hour of the night to go to Caesarea.\"",
      "links": "<a href='/AIV/44/21/31-32'>Acts 21:31-32</a>",
      "comment": "A large military escort for Paul signifies the importance of his mission and God's protection over his servant."
    },
    {
      "pk": 2392324,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 24,
      "text": "Also provide mounts for Paul to ride, and bring him safely to Felix the governor.\"",
      "links": "<a href='/AIV/44/24/1'>Acts 24:1</a>",
      "comment": "Paul is treated with honor and protected; divine Providence uses even secular authorities to accomplish God's will."
    },
    {
      "pk": 2392325,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 25,
      "text": "And he wrote a letter to this effect:",
      "links": "",
      "comment": "Official testimony from Roman authority adds legitimacy to Paul’s ministry and his appeal for justice."
    },
    {
      "pk": 2392326,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 26,
      "text": "\"Claudius Lysias, to His Excellency the governor Felix, greetings.\"",
      "links": "",
      "comment": "Standard Greco-Roman greeting opens official correspondence, demonstrating administrative order in safeguarding Paul."
    },
    {
      "pk": 2392327,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 27,
      "text": "\"This man was seized by the Jews and was about to be killed by them. When I learned he was a Roman citizen, I went with soldiers and rescued him.\"",
      "links": "<a href='/AIV/44/22/25-29'>Acts 22:25-29</a>",
      "comment": "Roman citizenship protects Paul, showing the value of lawful protections in God’s providential plan."
    },
    {
      "pk": 2392328,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 28,
      "text": "\"Wanting to know why they were accusing him, I brought him down to their council.\"",
      "links": "<a href='/AIV/44/22/30'>Acts 22:30</a>",
      "comment": "Roman authorities pursue judicial process, reflecting justice and God’s use of governing powers to further His purposes."
    },
    {
      "pk": 2392329,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 29,
      "text": "\"I found he was accused concerning questions of their law, but had nothing charged against him deserving death or imprisonment.\"",
      "links": "<a href='/AIV/44/18/15'>Acts 18:15</a>; <a href='/AIV/42/23/4'>Luke 23:4</a>",
      "comment": "Paul is declared innocent of criminal offense, paralleling Pilate’s verdict on Jesus; highlights innocence of God’s messengers in the face of unjust accusations."
    },
    {
      "pk": 2392330,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 30,
      "text": "\"When I was told that there was a plot against the man, I sent him to you at once, ordering his accusers also to speak against him before you.\"",
      "links": "<a href='/AIV/44/23/12-22'>Acts 23:12-22</a>",
      "comment": "Roman protection ensures Paul can fulfill his commission to witness in Rome, part of the universal mission."
    },
    {
      "pk": 2392331,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 31,
      "text": "So the soldiers, according to their instructions, took Paul and brought him by night to Antipatris.",
      "links": "",
      "comment": "God’s plan unfolds through cooperation between secular power and spiritual purpose."
    },
    {
      "pk": 2392332,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 32,
      "text": "The next day they let the horsemen go on with him, and returned to the barracks.",
      "links": "",
      "comment": "Security maintained, Paul proceeds toward his appointed destiny to testify before rulers."
    },
    {
      "pk": 2392333,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 33,
      "text": "When they came to Caesarea and delivered the letter to the governor, they presented Paul to him.",
      "links": "<a href='/AIV/44/24/1'>Acts 24:1</a>",
      "comment": "Arrival in Caesarea situates Paul for his next stage as Christ’s witness, as promised in verse 11."
    },
    {
      "pk": 2392334,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 34,
      "text": "When the governor had read the letter, he asked from what province Paul was. When he learned that he was from Cilicia,",
      "links": "",
      "comment": "The governor checks the proper jurisdiction, respecting legal order and Roman procedure."
    },
    {
      "pk": 2392335,
      "translation": "AIV",
      "book": 44,
      "chapter": 23,
      "verse": 35,
      "text": "\"I will hear your case when your accusers arrive,\" he said. He ordered Paul to be kept under guard in Herod’s praetorium.",
      "links": "<a href='/AIV/44/24/1'>Acts 24:1</a>",
      "comment": "Paul awaits formal hearing, analogous to the periods of awaiting trial Jesus and other servants of God endured; God’s providence prepares the way for Paul’s future witness. The formal process and holding Paul in Herod’s praetorium hint toward the increasing establishment and order around the apostolic witness, which would lay foundations for the visible, hierarchical church structure and its authoritative teachings."
    }
  ],
  "translatedAt": "2025-12-23T03:27:28.642Z"
}