{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 28,
  "verses": [
    {
      "pk": 28001,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 1,
      "text": "After we were brought safely through, we learned that the island was called Malta.",
      "links": "<a href='/AIV/44/27/26'>Acts 27:26</a>",
      "comment": "Paul and his companions survive the shipwreck and discover they have landed on Malta, fulfilling the promise of deliverance in Acts 27:26."
    },
    {
      "pk": 28002,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 2,
      "text": "The local people showed us unusual kindness. They kindled a fire and welcomed us all, because it had begun to rain and was cold.",
      "links": "",
      "comment": "The hospitality of the Maltese parallels OT calls to care for strangers (cf. <a href='/AIV/3/19/34'>Lev. 19:34</a>)."
    },
    {
      "pk": 28003,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 3,
      "text": "When Paul had gathered a bundle of sticks and put them on the fire, a viper, driven out by the heat, fastened itself on his hand.",
      "links": "<a href='/AIV/41/16/18'>Mark 16:18</a>",
      "comment": "This event echoes Jesus’ promise that His followers will handle snakes without harm (Mark 16:18), showing the authority given to the apostles."
    },
    {
      "pk": 28004,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 4,
      "text": "When the natives saw the creature hanging from his hand, they said to one another, 'Certainly this man is a murderer; though he has escaped from the sea, Justice has not allowed him to live.'",
      "links": "",
      "comment": "Their belief in divine justice, though pagan, reflects a recognition of moral order."
    },
    {
      "pk": 28005,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 5,
      "text": "But Paul shook off the creature into the fire and suffered no harm.",
      "links": "<a href='/AIV/42/10/19'>Luke 10:19</a>; <a href='/AIV/41/16/18'>Mark 16:18</a>",
      "comment": "Paul is protected, showing a sign of apostolic power that affirms the promises in Luke 10:19 and Mark 16:18."
    },
    {
      "pk": 28006,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 6,
      "text": "They kept watching for him to swell up or suddenly fall down dead, but after waiting a long time and seeing nothing unusual happen to him, they changed their minds and said that he was a god.",
      "links": "<a href='/AIV/44/14/11'>Acts 14:11</a>",
      "comment": "Similar to Acts 14:11, the pagans mistake a miracle as evidence of divinity, showing human tendency to mistaken worship."
    },
    {
      "pk": 28007,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 7,
      "text": "Now in the area nearby was an estate belonging to the chief man of the island, named Publius, who welcomed us and entertained us kindly for three days.",
      "links": "",
      "comment": "This hospitality anticipates the role of local leaders in supporting apostolic missions."
    },
    {
      "pk": 28008,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 8,
      "text": "Publius’s father lay sick with fever and dysentery. Paul went in to see him, and after praying, laid his hands on him and healed him.",
      "links": "<a href='/AIV/40/10/8'>Matt. 10:8</a>; <a href='/AIV/42/4/40'>Luke 4:40</a>",
      "comment": "Paul’s healing by prayer and the laying on of hands reflects the apostles’ authority and the continuation of Jesus’ healing ministry (Matt. 10:8; Luke 4:40). The use of physical gestures shows the sacramental nature of healing."
    },
    {
      "pk": 28009,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 9,
      "text": "When this happened, others on the island who were sick also came and were healed.",
      "links": "<a href='/AIV/42/9/6'>Luke 9:6</a>",
      "comment": "The spread of healing reinforces apostolic authority and the power of prayer for the sick (Luke 9:6)."
    },
    {
      "pk": 28010,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 10,
      "text": "They honored us greatly, and when we were about to sail, they provided us with everything we needed.",
      "links": "",
      "comment": "Reciprocal charity shown here mirrors the instructions to care for apostles and teachers (cf. <a href='/AIV/40/10/10'>Matt. 10:10</a>)."
    },
    {
      "pk": 28011,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 11,
      "text": "After three months, we set sail in a ship that had wintered at the island, a ship of Alexandria, with the figurehead of the Twin Gods.",
      "links": "<a href='/AIV/44/27/6'>Acts 27:6</a>",
      "comment": "The Twin Gods refer to Castor and Pollux, pagan deities. Early Christians navigate in a world with pagan symbols, but their mission is to bring the Gospel."
    },
    {
      "pk": 28012,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 12,
      "text": "Putting in at Syracuse, we stayed there for three days.",
      "links": "",
      "comment": "The journey continues through significant Mediterranean cities, showing the spread of the Gospel geographically."
    },
    {
      "pk": 28013,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 13,
      "text": "From there we sailed and arrived at Rhegium. After one day, a south wind sprang up, and on the second day we reached Puteoli.",
      "links": "",
      "comment": "Details of travel underscore historical accuracy and eyewitness testimony."
    },
    {
      "pk": 28014,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 14,
      "text": "There we found brothers and were invited to stay with them for seven days. And so we came to Rome.",
      "links": "<a href='/AIV/45/1/7'>Rom. 1:7</a>",
      "comment": "‘Brothers’ indicates the presence of a Christian community at Puteoli, anticipating the later correspondence to the church in Rome (Rom. 1:7). The seven-day stay may suggest an early structure of worship and fellowship."
    },
    {
      "pk": 28015,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 15,
      "text": "When the brothers there heard about us, they came as far as the Forum of Appius and Three Taverns to meet us. When Paul saw them, he thanked God and was encouraged.",
      "links": "<a href='/AIV/45/1/8-12'>Rom. 1:8-12</a>",
      "comment": "Mutual encouragement among believers is a mark of apostolic mission and unity (Rom. 1:8-12)."
    },
    {
      "pk": 28016,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 16,
      "text": "When we entered Rome, Paul was allowed to stay by himself with the soldier who guarded him.",
      "links": "",
      "comment": "Paul’s mild custody allowed continued ministry, showing the providence of God even in adversity."
    },
    {
      "pk": 28017,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 17,
      "text": "After three days, Paul called together the local Jewish leaders. When they had assembled, he said to them, 'Brothers, though I have done nothing against our people or the customs of our fathers, I was delivered as a prisoner from Jerusalem into the hands of the Romans.'",
      "links": "<a href='/AIV/44/21/28-33'>Acts 21:28-33</a>",
      "comment": "Paul’s defense stresses continuity with the Jewish faith and customs, fulfilling his role as witness to Israel (Acts 21:28-33)."
    },
    {
      "pk": 28018,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 18,
      "text": "'After examining me, they wanted to release me, because there was no basis for a death sentence.'",
      "links": "<a href='/AIV/44/23/29'>Acts 23:29</a>",
      "comment": "Roman officials find Paul innocent, echoing Pilate’s verdict regarding Jesus (<a href='/AIV/42/23/4'>Luke 23:4</a>)."
    },
    {
      "pk": 28019,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 19,
      "text": "'But when the Jews objected, I was compelled to appeal to Caesar—even though I had no charge to bring against my own people.'",
      "links": "<a href='/AIV/44/25/11'>Acts 25:11</a>",
      "comment": "Paul’s appeal to Caesar enables the Gospel to reach the highest authorities, fulfilling Jesus' commission to witness before kings (<a href='/AIV/40/10/18'>Matt. 10:18</a>)."
    },
    {
      "pk": 28020,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 20,
      "text": "'For this reason, therefore, I have invited you to see me and speak with me, since it is because of the hope of Israel that I am bound with this chain.'",
      "links": "<a href='/AIV/44/23/6'>Acts 23:6</a>",
      "comment": "The 'hope of Israel' refers to messianic expectation and resurrection, connecting Old Testament prophecies with their fulfillment in Christ."
    },
    {
      "pk": 28021,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 21,
      "text": "And they said to him, 'We have received no letters from Judea about you, and none of the brothers who came here has reported or spoken anything bad about you.'",
      "links": "",
      "comment": "Absence of accusation shows Paul's innocence and the lack of opposition from the wider diaspora."
    },
    {
      "pk": 28022,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 22,
      "text": "'But we desire to hear your views, for this sect is known to us as being spoken against everywhere.'",
      "links": "<a href='/AIV/44/24/14'>Acts 24:14</a>",
      "comment": "'Sect' denotes early Christianity as distinct yet still part of Israel’s hope; opposition is already widespread, setting up Church identity."
    },
    {
      "pk": 28023,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 23,
      "text": "And when they had set a day to meet with him, many came to him at his lodging. From morning till evening, he explained the matter to them, giving testimony to the kingdom of God and trying to convince them about Jesus both from the Law of Moses and the Prophets.",
      "links": "<a href='/AIV/42/24/27'>Luke 24:27</a>; <a href='/AIV/44/17/2-3'>Acts 17:2-3</a>",
      "comment": "Paul’s use of Scripture to show Jesus as Messiah mirrors Jesus’ own teaching in Luke 24:27. This affirms both continuity and fulfillment of OT prophecy."
    },
    {
      "pk": 28024,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 24,
      "text": "Some were convinced by what he said, while others did not believe.",
      "links": "",
      "comment": "Division over the Gospel fulfills Jesus’ warning about the cost of discipleship (<a href='/AIV/40/10/34'>Matt. 10:34</a>)."
    },
    {
      "pk": 28025,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 25,
      "text": "When they disagreed among themselves, they began to leave, after Paul had spoken one final word: 'The Holy Spirit rightly spoke to your fathers through Isaiah the prophet,'",
      "links": "<a href='/AIV/23/6/9-10'>Isaiah 6:9-10</a>",
      "comment": "Paul’s quote points to divine authority behind his words and the fulfillment of ancient prophecy."
    },
    {
      "pk": 28026,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 26,
      "text": "'Go to this people and say, \"You will indeed hear but never understand, and you will indeed see but never perceive.\"'",
      "links": "<a href='/AIV/23/6/9'>Isaiah 6:9</a>",
      "comment": "Isaiah’s prophecy is fulfilled in the reception of the Messiah: many hear but do not believe."
    },
    {
      "pk": 28027,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 27,
      "text": "'For this people's heart has grown callous, and with their ears they hardly hear, and their eyes they have closed, lest they should see with their eyes and hear with their ears and understand with their heart and turn, and I would heal them.'",
      "links": "<a href='/AIV/23/6/10'>Isaiah 6:10</a>",
      "comment": "Spiritual blindness is a persistent theme in both Old and New Testaments, showing the need for interior conversion—a key aspect of perseverance in faith."
    },
    {
      "pk": 28028,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 28,
      "text": "'Therefore let it be known to you that this salvation of God has been sent to the Gentiles; they will listen.'",
      "links": "<a href='/AIV/44/13/46'>Acts 13:46</a>; <a href='/AIV/23/49/6'>Isaiah 49:6</a>",
      "comment": "Salvation offered to the nations fulfills the prophecy in Isaiah 49:6. The universal mission is foreshadowed here, indicating the expanding, visible structure of the Church among all peoples."
    },
    {
      "pk": 28029,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 29,
      "text": "When he had said these words, the Jews departed, having a great dispute among themselves.",
      "links": "",
      "comment": "Persistent division marks the early reception of the Gospel."
    },
    {
      "pk": 28030,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 30,
      "text": "He stayed two whole years in his own rented house and welcomed all who came to him.",
      "links": "",
      "comment": "Paul’s open hospitality and ongoing teaching parallels themes of an ordered ministry, rooted in apostolic authority and tradition."
    },
    {
      "pk": 28031,
      "translation": "AIV",
      "book": 44,
      "chapter": 28,
      "verse": 31,
      "text": "He proclaimed the kingdom of God and taught about the Lord Jesus Christ with all boldness and without hindrance.",
      "links": "<a href='/AIV/44/1/3'>Acts 1:3</a>",
      "comment": "The book ends with Paul continuing to teach the full Gospel and kingdom of Jesus, showing the unstoppable growth of the church and the continuing apostolic ministry in Rome—a sign of unity and universality rooted in the apostles."
    }
  ],
  "translatedAt": "2025-12-23T03:29:58.611Z"
}