{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 7,
  "verses": [
    {
      "pk": 1970001,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 1,
      "text": "The high priest said, \"Are these things so?\"",
      "links": "<a href='/AIV/44/6/13-14'>Acts 6:13–14</a>",
      "comment": "The high priest begins the trial by questioning Stephen regarding the charges brought against him."
    },
    {
      "pk": 1970002,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 2,
      "text": "Stephen replied, \"Brothers and fathers, listen: The God of glory appeared to our father Abraham when he was in Mesopotamia, before he lived in Haran,",
      "links": "<a href='/AIV/01/12/1'>Gen. 12:1</a>; <a href='/AIV/01/11/31'>Gen. 11:31</a>",
      "comment": "Stephen respectfully addresses the Jewish leaders, beginning his defense with Abraham, the common ancestor."
    },
    {
      "pk": 1970003,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 3,
      "text": "and said to him, 'Leave your land and your relatives and go into the land that I will show you.'",
      "links": "<a href='/AIV/01/12/1'>Gen. 12:1</a>; <a href='/AIV/01/15/7'>Gen. 15:7</a>",
      "comment": "This is a direct reference to God's call to Abraham, which begins the story of God's covenantal faithfulness."
    },
    {
      "pk": 1970004,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 4,
      "text": "Then he left the land of the Chaldeans and settled in Haran. After his father died, God moved him from there to this land where you now live.",
      "links": "<a href='/AIV/01/11/31-32'>Gen. 11:31–32</a>",
      "comment": "Stephen highlights Abraham's faith and obedience, themes central to Hebrews 11."
    },
    {
      "pk": 1970005,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 5,
      "text": "He did not give him any inheritance in it, not even a foot of ground, but promised to give it to him as a possession and to his offspring after him, even though he had no child.",
      "links": "<a href='/AIV/01/12/7'>Gen. 12:7</a>; <a href='/AIV/01/17/8'>Gen. 17:8</a>",
      "comment": "God's promise to Abraham foreshadows his faithfulness to fulfill future promises, ultimately through the Messiah."
    },
    {
      "pk": 1970006,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 6,
      "text": "God spoke in this way: that his offspring would be strangers in a land belonging to others, who would enslave and mistreat them for four hundred years.",
      "links": "<a href='/AIV/01/15/13'>Gen. 15:13</a>; <a href='/AIV/02/12/40'>Exod. 12:40</a>",
      "comment": "Stephen recalls the prophecy about Israel's time in Egypt, emphasizing that suffering can be part of God's redemptive plan."
    },
    {
      "pk": 1970007,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 7,
      "text": "'But I will judge the nation they serve,' God said, 'and after that they will come out and serve Me in this place.'",
      "links": "<a href='/AIV/01/15/14'>Gen. 15:14</a>; <a href='/AIV/02/3/12'>Exod. 3:12</a>",
      "comment": "Deliverance and worship are consistently linked in redemptive history."
    },
    {
      "pk": 1970008,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 8,
      "text": "And He gave him the covenant of circumcision. So Abraham became the father of Isaac and circumcised him on the eighth day; and Isaac became the father of Jacob, and Jacob of the twelve patriarchs.",
      "links": "<a href='/AIV/01/17/9-14'>Gen. 17:9–14</a>; <a href='/AIV/01/21/4'>Gen. 21:4</a>",
      "comment": "The sign of circumcision prefigures the importance of outward signs as part of God's covenant dealings."
    },
    {
      "pk": 1970009,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 9,
      "text": "Because the patriarchs were jealous of Joseph, they sold him into Egypt, but God was with him",
      "links": "<a href='/AIV/01/37/11'>Gen. 37:11</a>, <a href='/AIV/01/39/2'>Gen. 39:2</a>",
      "comment": "Joseph's story foreshadows the pattern of God's chosen being rejected by their own but raised up for salvation."
    },
    {
      "pk": 1970010,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 10,
      "text": "and rescued him out of all his troubles, and gave him favor and wisdom before Pharaoh, king of Egypt, who made him ruler over Egypt and all his household.",
      "links": "<a href='/AIV/01/41/39-41'>Gen. 41:39–41</a>",
      "comment": "The divine elevation of Joseph echoes God’s power to turn suffering and rejection into exaltation."
    },
    {
      "pk": 1970011,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 11,
      "text": "Now a famine came over all Egypt and Canaan, bringing great trouble. Our fathers could find no food.",
      "links": "<a href='/AIV/01/41/54-56'>Gen. 41:54–56</a>",
      "comment": "The famine highlights human dependency on God’s providence."
    },
    {
      "pk": 1970012,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 12,
      "text": "But when Jacob heard that there was grain in Egypt, he sent our fathers there the first time.",
      "links": "<a href='/AIV/01/42/1-2'>Gen. 42:1–2</a>",
      "comment": "Jacob's initiative leads to the reunion and reconciliation with Joseph."
    },
    {
      "pk": 1970013,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 13,
      "text": "On their second visit, Joseph made himself known to his brothers, and Joseph’s family became known to Pharaoh.",
      "links": "<a href='/AIV/01/45/1-4'>Gen. 45:1–4</a>",
      "comment": "The theme of recognition upon the 'second visit' carries spiritual significance, paralleling how Christ was not recognized at first by His people."
    },
    {
      "pk": 1970014,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 14,
      "text": "And Joseph sent and summoned Jacob his father and all his relatives, seventy-five people in all.",
      "links": "<a href='/AIV/01/46/27'>Gen. 46:27</a>; <a href='/AIV/02/1/5'>Exod. 1:5</a>",
      "comment": "The number differs slightly from the Masoretic text (seventy), reflecting the Septuagint, which Luke is likely using."
    },
    {
      "pk": 1970015,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 15,
      "text": "So Jacob went down to Egypt, and he died, and our fathers as well.",
      "links": "<a href='/AIV/01/49/33'>Gen. 49:33</a>; <a href='/AIV/02/1/6'>Exod. 1:6</a>",
      "comment": "The patriarchs die outside the Promised Land, yet their legacy continues as part of God's plan."
    },
    {
      "pk": 1970016,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 16,
      "text": "They were carried back to Shechem and laid in the tomb that Abraham had bought for a sum of silver from the sons of Hamor in Shechem.",
      "links": "<a href='/AIV/01/23/16'>Gen. 23:16</a>; <a href='/AIV/06/24/32'>Josh. 24:32</a>",
      "comment": "The burial at Shechem ties the patriarchal promises to the land and people of God, carrying spiritual significance about the inheritance and resting place."
    },
    {
      "pk": 1970017,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 17,
      "text": "But as the time drew near for the promise that God had sworn to Abraham to be fulfilled, the people increased and multiplied in Egypt",
      "links": "<a href='/AIV/02/1/7'>Exod. 1:7</a>",
      "comment": "Multiplication of the people in Egypt recalls God's promises of numerous descendants."
    },
    {
      "pk": 1970018,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 18,
      "text": "until another king arose in Egypt who did not know Joseph.",
      "links": "<a href='/AIV/02/1/8'>Exod. 1:8</a>",
      "comment": "A new Pharaoh’s ignorance leads to Israel’s oppression, setting the stage for deliverance."
    },
    {
      "pk": 1970019,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 19,
      "text": "He dealt shrewdly with our people and mistreated our fathers, forcing them to abandon their infants, so they would not survive.",
      "links": "<a href='/AIV/02/1/10-16'>Exod. 1:10–16</a>",
      "comment": "The oppression under Pharaoh is a recurring theme, ultimately pointing toward the need for divine intervention."
    },
    {
      "pk": 1970020,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 20,
      "text": "At this time Moses was born, and he was beautiful in God’s sight. He was cared for three months in his father’s house.",
      "links": "<a href='/AIV/02/2/2'>Exod. 2:2</a>; <a href='/AIV/58/11/23'>Heb. 11:23</a>",
      "comment": "Moses' birth and providential preservation signifies being chosen for a saving purpose."
    },
    {
      "pk": 1970021,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 21,
      "text": "When he was abandoned, Pharaoh’s daughter took him and brought him up as her own son.",
      "links": "<a href='/AIV/02/2/5-10'>Exod. 2:5–10</a>",
      "comment": "God uses the daughter of Israel’s enemy to preserve Israel’s deliverer."
    },
    {
      "pk": 1970022,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 22,
      "text": "And Moses was instructed in all the wisdom of the Egyptians, and he was powerful in words and deeds.",
      "links": "<a href='/AIV/02/2/10'>Exod. 2:10</a>",
      "comment": "God equips Moses through both Hebrew heritage and Egyptian education. The notion of wisdom and deeds prefigures Jesus as a prophet mighty in deed and word (Luke 24:19)."
    },
    {
      "pk": 1970023,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 23,
      "text": "When he was forty years old, it came into his heart to visit his brothers, the children of Israel.",
      "links": "<a href='/AIV/02/2/11'>Exod. 2:11</a>",
      "comment": "Moses’ identification with his people required a decisive action."
    },
    {
      "pk": 1970024,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 24,
      "text": "And seeing one of them being wronged, he defended him and avenged him who was oppressed by striking down the Egyptian.",
      "links": "<a href='/AIV/02/2/11-12'>Exod. 2:11–12</a>",
      "comment": "Moses’ zeal for justice anticipates the Deliverer who comes to set the oppressed free (Luke 4:18)."
    },
    {
      "pk": 1970025,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 25,
      "text": "He supposed that his brothers would understand that God was granting them deliverance by his hand, but they did not understand.",
      "links": "<a href='/AIV/02/2/13-14'>Exod. 2:13–14</a>",
      "comment": "Foreshadows how Jesus, too, was misunderstood and rejected by those he came to save."
    },
    {
      "pk": 1970026,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 26,
      "text": "The next day he appeared to them as they were fighting and tried to reconcile them, saying, ‘Men, you are brothers. Why do you harm each other?’",
      "links": "<a href='/AIV/02/2/13'>Exod. 2:13</a>",
      "comment": "Moses acts as peacemaker, a role fulfilled perfectly by Christ."
    },
    {
      "pk": 1970027,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 27,
      "text": "But he who was wronging his neighbor thrust him aside, saying, 'Who made you a ruler and a judge over us?'",
      "links": "<a href='/AIV/02/2/14'>Exod. 2:14</a>; <a href='/AIV/02/2/14'>Luke 19:14</a>",
      "comment": "The rejection of Moses echoes Israel’s repeated refusal of God's chosen mediators."
    },
    {
      "pk": 1970028,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 28,
      "text": "'Do you want to kill me as you killed the Egyptian yesterday?'",
      "links": "<a href='/AIV/02/2/14'>Exod. 2:14</a>",
      "comment": "Highlights the exposure of Moses’ actions and his isolation."
    },
    {
      "pk": 1970029,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 29,
      "text": "At this word Moses fled and became a sojourner in the land of Midian, where he became the father of two sons.",
      "links": "<a href='/AIV/02/2/15-22'>Exod. 2:15–22</a>",
      "comment": "Moses' exile is a preparation for future leadership, reflecting the pattern of growth through trial."
    },
    {
      "pk": 1970030,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 30,
      "text": "Now when forty years had passed, an angel appeared to him in the wilderness of Mount Sinai, in a flame of fire in a bush.",
      "links": "<a href='/AIV/02/3/2'>Exod. 3:2</a>",
      "comment": "The encounter with the divine presence at the burning bush is a profound moment of God’s self-revelation, foreshadowing the ultimate revelation in Christ."
    },
    {
      "pk": 1970031,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 31,
      "text": "When Moses saw it, he was amazed at the sight. As he drew near to look, the voice of the Lord came:",
      "links": "<a href='/AIV/02/3/3-4'>Exod. 3:3–4</a>",
      "comment": "The appearance of the Lord signals a pivotal new direction for Moses and for God's people."
    },
    {
      "pk": 1970032,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 32,
      "text": "‘I am the God of your fathers, the God of Abraham and of Isaac and of Jacob.’ Moses trembled and did not dare to look.",
      "links": "<a href='/AIV/02/3/6'>Exod. 3:6</a>",
      "comment": "The God of covenant reveals Himself, affirming continuity between the patriarchs and Moses’ mission."
    },
    {
      "pk": 1970033,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 33,
      "text": "Then the Lord said to him, ‘Take off the sandals from your feet, for the place where you are standing is holy ground.’",
      "links": "<a href='/AIV/02/3/5'>Exod. 3:5</a>; <a href='/AIV/06/5/15'>Josh. 5:15</a>",
      "comment": "The theme of sacred space is important, marking God's presence as that which sanctifies."
    },
    {
      "pk": 1970034,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 34,
      "text": "I have surely seen the oppression of my people who are in Egypt, and I have heard their groaning, and I have come down to deliver them. And now come, I will send you to Egypt.’",
      "links": "<a href='/AIV/02/3/7-10'>Exod. 3:7–10</a>",
      "comment": "God’s compassion and commission prefigure the sending of Christ, the divine deliverer."
    },
    {
      "pk": 1970035,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 35,
      "text": "This Moses, whom they rejected, saying, ‘Who made you a ruler and a judge?’—this man God sent as both ruler and redeemer by the hand of the angel who appeared to him in the bush.",
      "links": "<a href='/AIV/02/2/14'>Exod. 2:14</a>; <a href='/AIV/02/3/2'>Exod. 3:2</a>",
      "comment": "God raises up rejected mediators for salvation, foreshadowing Jesus, rejected yet sent as Redeemer."
    },
    {
      "pk": 1970036,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 36,
      "text": "He led them out, performing wonders and signs in Egypt, at the Red Sea, and in the wilderness for forty years.",
      "links": "<a href='/AIV/02/7/3'>Exod. 7:3</a>; <a href='/AIV/02/14/21-22'>Exod. 14:21–22</a>",
      "comment": "Moses as miracle worker anticipates greater miracles by the Messiah. Signs authenticate true divine sending."
    },
    {
      "pk": 1970037,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 37,
      "text": "This is the Moses who said to the sons of Israel, ‘God will raise up for you a prophet like me from your brothers.’",
      "links": "<a href='/AIV/05/18/15'>Deut. 18:15</a>; <a href='/AIV/03/1/21-22'>Acts 3:22</a>",
      "comment": "The prophecy of 'a prophet like me' is closely associated with Jesus (Acts 3:22), affirming His unique role as lawgiver and mediator."
    },
    {
      "pk": 1970038,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 38,
      "text": "This is the one who was in the congregation in the wilderness with the angel who spoke to him on Mount Sinai, and with our fathers. He received living words to give to us.",
      "links": "<a href='/AIV/02/19/3'>Exod. 19:3</a>; <a href='/AIV/05/5/5'>Deut. 5:5</a>",
      "comment": "The assembly (Greek 'ekklesia') in the wilderness is the foreshadowing of God's gathered people by revelation and word."
    },
    {
      "pk": 1970039,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 39,
      "text": "Our fathers refused to obey him but rejected him. In their hearts, they turned back to Egypt,",
      "links": "<a href='/AIV/02/32/1'>Exod. 32:1</a>; <a href='/AIV/04/14/3-4'>Num. 14:3–4</a>",
      "comment": "Rejection of the mediator and yearning for Egypt prefigure spiritual apostasy."
    },
    {
      "pk": 1970040,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 40,
      "text": "saying to Aaron, 'Make for us gods who will go before us; as for this Moses who led us out of Egypt, we do not know what has become of him.'",
      "links": "<a href='/AIV/02/32/1'>Exod. 32:1</a>",
      "comment": "The demand for visible gods shows the danger of losing trust in the unseen true leader."
    },
    {
      "pk": 1970041,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 41,
      "text": "And they made a calf in those days and brought a sacrifice to the idol and rejoiced in the works of their hands.",
      "links": "<a href='/AIV/02/32/4-6'>Exod. 32:4–6</a>",
      "comment": "Idolatry is rebellion against God’s sovereignty. Spiritual dangers of worshiping creation rather than the Creator."
    },
    {
      "pk": 1970042,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 42,
      "text": "But God turned away and gave them over to serve the host of heaven, as it is written in the Book of the Prophets: 'Did you offer Me slain beasts and sacrifices for forty years in the wilderness, O house of Israel?'",
      "links": "<a href='/AIV/30/5/25-27'>Amos 5:25–27</a>",
      "comment": "God’s giving over to false worship carries the theme of judgment (Romans 1:24–26)."
    },
    {
      "pk": 1970043,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 43,
      "text": "You took up the tent of Moloch and the star of your god Rephan, the images that you made to worship; and I will send you away beyond Babylon.'",
      "links": "<a href='/AIV/30/5/26-27'>Amos 5:26–27</a>",
      "comment": "Continued idolatry leads to exile—an important theme fulfilled in Israel’s history."
    },
    {
      "pk": 1970044,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 44,
      "text": "Our fathers had the tent of testimony in the wilderness, just as He who spoke to Moses directed him to make it, according to the pattern he had seen.",
      "links": "<a href='/AIV/02/25/9'>Exod. 25:9</a>; <a href='/AIV/02/26/30'>Exod. 26:30</a>",
      "comment": "The divine pattern for worship prefigures heavenly realities (see Heb. 8:5), supporting visible forms in worship."
    },
    {
      "pk": 1970045,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 45,
      "text": "Our fathers in turn received it, and with Joshua brought it in when they took possession of the nations that God drove out before our fathers. So it was until the days of David,",
      "links": "<a href='/AIV/06/3/14'>Josh. 3:14</a>; <a href='/AIV/10/7/2'>2 Sam. 7:2</a>",
      "comment": "The continuity of sacred space and objects demonstrates historical faithfulness."
    },
    {
      "pk": 1970046,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 46,
      "text": "who found favor in God's sight and asked to find a dwelling for the God of Jacob.",
      "links": "<a href='/AIV/10/7/2'>2 Sam. 7:2</a>; <a href='/AIV/19/132/1-5'>Ps. 132:1–5</a>",
      "comment": "David’s desire for a house for God reveals a longing for God’s presence among his people."
    },
    {
      "pk": 1970047,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 47,
      "text": "But it was Solomon who built him a house.",
      "links": "<a href='/AIV/11/6/1'>1 Kings 6:1</a>; <a href='/AIV/14/2/1'>2 Chron. 2:1</a>",
      "comment": "Solomon’s temple was the fulfillment of David’s wish, establishing the centrality of gathered worship."
    },
    {
      "pk": 1970048,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 48,
      "text": "Yet the Most High does not dwell in houses made by human hands, as the prophet says:",
      "links": "<a href='/AIV/23/66/1-2'>Isa. 66:1–2</a>",
      "comment": "The transcendent nature of God means no material building can contain Him, fulfilling higher spiritual realities in Christ and his body (see John 2:19–21)."
    },
    {
      "pk": 1970049,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 49,
      "text": "'Heaven is My throne, and the earth is My footstool. What kind of house will you build for Me?' says the Lord, 'Or what is the place of My rest?'",
      "links": "<a href='/AIV/23/66/1'>Isa. 66:1</a>",
      "comment": "Direct quotation from Isaiah, emphasizing God's sovereignty."
    },
    {
      "pk": 1970050,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 50,
      "text": "'Did not my hand make all these things?'",
      "links": "<a href='/AIV/23/66/2'>Isa. 66:2</a>",
      "comment": "Affirms God's role as creator and sustainer."
    },
    {
      "pk": 1970051,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 51,
      "text": "You stiff-necked people, uncircumcised in heart and ears! You always resist the Holy Spirit. As your fathers did, so do you.",
      "links": "<a href='/AIV/24/6/10'>Jer. 6:10</a>; <a href='/AIV/26/44/9'>Ezek. 44:9</a>",
      "comment": "Stephen exposes the leaders’ spiritual blindness; 'uncircumcised in heart' refers to a lack of true conversion, a theme the prophets often stress."
    },
    {
      "pk": 1970052,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 52,
      "text": "Which of the prophets did your fathers not persecute? And they killed those who announced beforehand the coming of the Righteous One, whom you have now betrayed and murdered,",
      "links": "<a href='/AIV/24/2/30'>Jer. 2:30</a>; <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "The suffering of the just culminates in the death of the Messiah (compare Acts 3:14)."
    },
    {
      "pk": 1970053,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 53,
      "text": "you who received the law as delivered by angels and did not keep it.",
      "links": "<a href='/AIV/05/33/2'>Deut. 33:2</a>; <a href='/AIV/48/3/19'>Gal. 3:19</a>",
      "comment": "Reception of the Law is a great privilege; failing to keep it shows the need for a greater fulfillment in Christ."
    },
    {
      "pk": 1970054,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 54,
      "text": "Now when they heard these things they were enraged, and they gnashed their teeth at him.",
      "links": "",
      "comment": "Stephen's rebuke stirs up intense opposition."
    },
    {
      "pk": 1970055,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 55,
      "text": "But he, full of the Holy Spirit, gazed into heaven and saw the glory of God, and Jesus standing at the right hand of God.",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/41/16/19'>Mark 16:19</a>",
      "comment": "Jesus stands at God’s right hand, a sign of advocacy and divine approval. This is a strong claim to Jesus’ divinity and ongoing mediation."
    },
    {
      "pk": 1970056,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 56,
      "text": "And he said, 'Behold, I see the heavens opened, and the Son of Man standing at the right hand of God.'",
      "links": "<a href='/AIV/27/7/13-14'>Dan. 7:13–14</a>; <a href='/AIV/42/22/69'>Luke 22:69</a>",
      "comment": "Stephen sees Jesus glorified in fulfillment of Daniel 7:13–14—one like a Son of Man, receiving kingship and worship."
    },
    {
      "pk": 1970057,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 57,
      "text": "But they cried out with a loud voice and covered their ears and rushed together at him.",
      "links": "",
      "comment": "Their violent reaction reflects rejection of divine revelation."
    },
    {
      "pk": 1970058,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 58,
      "text": "Then they cast him out of the city and stoned him. And the witnesses laid down their garments at the feet of a young man named Saul.",
      "links": "<a href='/AIV/44/8/1'>Acts 8:1</a>",
      "comment": "Saul (later Paul) is introduced here, foreshadowing his future significant role."
    },
    {
      "pk": 1970059,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 59,
      "text": "As they were stoning Stephen, he called out, 'Lord Jesus, receive my spirit.'",
      "links": "<a href='/AIV/42/23/46'>Luke 23:46</a>; <a href='/AIV/19/31/5'>Ps. 31:5</a>",
      "comment": "Stephen entrusts his spirit to Christ, paralleling Jesus’ words on the cross—a profound testimony to Jesus’ divinity and role as Lord."
    },
    {
      "pk": 1970060,
      "translation": "AIV",
      "book": 44,
      "chapter": 7,
      "verse": 60,
      "text": "Then he fell on his knees and cried out with a loud voice, 'Lord, do not hold this sin against them.' And when he had said this, he fell asleep.",
      "links": "<a href='/AIV/42/23/34'>Luke 23:34</a>; <a href='/AIV/60/3/14'>1 Pet. 3:14</a>",
      "comment": "Stephen’s dying prayer for his persecutors reflects Christ’s own mercy. The phrase 'fell asleep' is used for the peaceful death of saints, anticipating the hope of resurrection."
    }
  ],
  "translatedAt": "2025-12-23T03:17:00.583Z"
}