{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 24,
  "verses": [
    {
      "pk": 2402401,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 1,
      "text": "After five days, the high priest Ananias came down with some elders and a lawyer named Tertullus, and they brought formal charges against Paul before the governor.",
      "links": "<a href='/AIV/44/23/2'>Acts 23:2</a>",
      "comment": "The text highlights the legal procedures of the time with priests and elders formally accusing Paul, reminiscent of Jesus' own trials (<a href='/AIV/42/22/66-71'>Luke 22:66–71</a>)."
    },
    {
      "pk": 2402402,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 2,
      "text": "When Paul was called in, Tertullus began to accuse him, saying: 'Since we have been enjoying much peace through you, and since your reforms for this nation are worthy of praise, most excellent Felix,",
      "links": "<a href='/AIV/44/23/24'>Acts 23:24</a>",
      "comment": "Tertullus opens with flattery, a typical rhetorical strategy in ancient courts. Felix's governance is falsely praised, setting up the accuser's case."
    },
    {
      "pk": 2402403,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 3,
      "text": "in every way and everywhere, we acknowledge this with all gratitude.",
      "links": "",
      "comment": "Continued flattery by Tertullus serves to sway the judge. Compare <a href='/AIV/44/24/10'>v.10</a> for how Paul addresses Felix with more truthfulness."
    },
    {
      "pk": 2402404,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 4,
      "text": "But so that I may not detain you longer, I beg you, by your kindness, to hear us briefly.",
      "links": "",
      "comment": "Tertullus promises brevity, again adhering to court custom and highlighting respect for authority, echoing protocols seen in Esther's plea (<a href='/AIV/17/7/3'>Esther 7:3</a>)."
    },
    {
      "pk": 2402405,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 5,
      "text": "For we have found this man to be a plague, stirring up riots among all the Jews throughout the world and a ringleader of the sect of the Nazarenes.",
      "links": "<a href='/AIV/24/5/17-18'>Acts 5:17–18</a>",
      "comment": "Paul is accused of being a public menace and leading what is viewed as a sect. 'Nazarenes' is used to describe early Christians, connecting Jesus’ title (<a href='/AIV/40/2/23'>Matt. 2:23</a>)."
    },
    {
      "pk": 2402406,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 6,
      "text": "He even tried to desecrate the temple, so we arrested him.",
      "links": "<a href='/AIV/44/21/28-29'>Acts 21:28–29</a>",
      "comment": "The central charge is defiling the temple, a crime highly punishable under Jewish law (<a href='/AIV/04/18/7'>Num. 18:7</a>)."
    },
    {
      "pk": 2402407,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 7,
      "text": "[But Lysias the commander came and with great violence took him out of our hands,]",
      "links": "<a href='/AIV/44/23/23-24'>Acts 23:23-24</a>",
      "comment": "Verse 7 is omitted in some manuscripts. Its inclusion clarifies the legal dispute and underlines Roman intervention."
    },
    {
      "pk": 2402408,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 8,
      "text": "'commanding his accusers to come to you. By examining him yourself, you will be able to learn about all these things of which we accuse him.'",
      "links": "",
      "comment": "Tertullus points Felix to direct inquiry, expecting the existing Roman system to substantiate their claims."
    },
    {
      "pk": 2402409,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 9,
      "text": "The Jews also joined in the accusation, asserting that these things were so.",
      "links": "",
      "comment": "The collective affirmation by the Jewish leaders underscores the official opposition to Paul’s ministry, aligning with broader patterns of prophetic rejection (<a href='/AIV/24/7/52'>Acts 7:52</a>)."
    },
    {
      "pk": 2402410,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 10,
      "text": "And when the governor motioned for him to speak, Paul replied: 'Knowing that for many years you have been a judge over this nation, I make my defense confidently.",
      "links": "",
      "comment": "Paul acknowledges Felix’s jurisdiction without excessive flattery. He appeals to justice, contrasting the accusers’ manipulative tone."
    },
    {
      "pk": 2402411,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 11,
      "text": "'You can quickly verify that it is not more than twelve days since I went up to worship in Jerusalem;",
      "links": "<a href='/AIV/44/21/18'>Acts 21:18</a>",
      "comment": "Paul appeals to verifiable facts, indicating the brevity of his time in Jerusalem, minimizing the likelihood of causing such disruption."
    },
    {
      "pk": 2402412,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 12,
      "text": "and they did not find me arguing with anyone or stirring up a crowd, either in the temple or in the synagogues or in the city.",
      "links": "<a href='/AIV/44/25/8'>Acts 25:8</a>",
      "comment": "Paul denies the charges of inciting riot, attesting to his peaceful conduct—a disciple’s obedience to just authority (<a href='/AIV/45/13/1'>Rom. 13:1</a>)."
    },
    {
      "pk": 2402413,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 13,
      "text": "Nor can they prove to you what they now accuse me of.",
      "links": "",
      "comment": "Paul points out the lack of evidence, upholding a fair legal process, a theme stressing the importance of truth and justice throughout Scripture."
    },
    {
      "pk": 2402414,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 14,
      "text": "But this I confess to you, that according to the Way, which they call a sect, so I worship the God of our fathers, believing everything that is written in the Law and in the Prophets.",
      "links": "<a href='/AIV/44/9/2'>Acts 9:2</a>; <a href='/AIV/26/3/1-2'>Ezek. 3:1–2</a>",
      "comment": "'The Way' refers to the early Christian faith. Paul shows that Christianity fulfills Old Testament prophecies (<a href='/AIV/23/53/1-12'>Isa. 53</a>), stressing continuity with Israel’s Scriptures."
    },
    {
      "pk": 2402415,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 15,
      "text": "I have hope in God, which these men also embrace, that there will be a resurrection of both the just and the unjust.",
      "links": "<a href='/AIV/27/12/2'>Dan. 12:2</a>; <a href='/AIV/43/5/28-29'>John 5:28–29</a>",
      "comment": "Paul affirms bodily resurrection, a doctrine tied to Christ’s resurrection and Judgment Day, central to Christian and Jewish hope."
    },
    {
      "pk": 2402416,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 16,
      "text": "And so I strive always to keep my conscience clear before God and man.",
      "links": "<a href='/AIV/44/23/1'>Acts 23:1</a>",
      "comment": "Paul’s defense is his clear conscience, serving as a model for Christian moral integrity and an ongoing awareness of God and community."
    },
    {
      "pk": 2402417,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 17,
      "text": "After several years I came to bring gifts to my nation and to present offerings.",
      "links": "<a href='/AIV/45/15/25-26'>Rom. 15:25–26</a>",
      "comment": "Paul’s gifts to Jerusalem show the early Church’s practice of charitable works and unity, a sign of the one visible worldwide Church."
    },
    {
      "pk": 2402418,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 18,
      "text": "While I was doing this, they found me purified in the temple, without any crowd or disturbance.",
      "links": "<a href='/AIV/44/21/26'>Acts 21:26</a>",
      "comment": "Paul stresses he was ritually pure, observing the Law. The incident is not one of rebellion but peace, mirroring Christ’s own fulfillment of the Law."
    },
    {
      "pk": 2402419,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 19,
      "text": "But there are some Jews from Asia who ought to be here before you to make any accusation, if they have anything against me.",
      "links": "<a href='/AIV/05/19/15'>Deut. 19:15</a>",
      "comment": "Paul points to the absence of direct witnesses, reflecting the Old Testament standard of requiring witnesses for serious accusations."
    },
    {
      "pk": 2402420,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 20,
      "text": "Or else let these men themselves state what crime they found in me when I stood before the council,",
      "links": "<a href='/AIV/44/23/6'>Acts 23:6</a>",
      "comment": "Again Paul highlights the lack of evidence and the uprightness of his actions before the Sanhedrin."
    },
    {
      "pk": 2402421,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 21,
      "text": "unless it is with regard to this one statement I cried out as I stood among them: 'It is concerning the resurrection of the dead that I am being judged by you today.'",
      "links": "<a href='/AIV/44/23/6'>Acts 23:6</a>",
      "comment": "The resurrection, central to Paul’s message, divides the council and is the heart of Christian proclamation."
    },
    {
      "pk": 2402422,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 22,
      "text": "But Felix, having a more accurate knowledge of the Way, postponed the proceedings, saying, 'When Lysias the commander comes down, I will decide your case.'",
      "links": "<a href='/AIV/44/23/26'>Acts 23:26</a>",
      "comment": "Felix is familiar with early Christianity. His postponement signals the interplay of politics, law, and the emerging Church."
    },
    {
      "pk": 2402423,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 23,
      "text": "Then he ordered the centurion to keep Paul under guard but to give him some freedom and to let his friends attend to his needs.",
      "links": "<a href='/AIV/44/27/3'>Acts 27:3</a>",
      "comment": "Paul is given partial liberty, highlighting the Romans’ comparative fairness and the importance of community care for leaders."
    },
    {
      "pk": 2402424,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 24,
      "text": "After some days Felix came with his wife Drusilla, who was Jewish. He sent for Paul and listened to him speak about faith in Christ Jesus.",
      "links": "<a href='/AIV/45/1/16-17'>Rom. 1:16-17</a>",
      "comment": "Paul preaches Jesus as Messiah to both Jews and Gentiles. That faith is in a person—Jesus—implies his uniqueness and divinity. See <a href='/AIV/43/14/6'>John 14:6</a>."
    },
    {
      "pk": 2402425,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 25,
      "text": "As Paul spoke about righteousness, self-control, and the coming judgment, Felix became afraid and said, 'Go away for now; when I have an opportunity I will summon you.'",
      "links": "<a href='/AIV/43/16/8'>John 16:8</a>",
      "comment": "Paul’s teaching unsettles Felix. These themes—righteousness, self-control, final judgment—remain central to Christian moral doctrine."
    },
    {
      "pk": 2402426,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 26,
      "text": "At the same time he was hoping that Paul would offer him money. So he sent for him often and talked with him.",
      "links": "",
      "comment": "Felix's greed shows conflict between worldly motives and the truth. Paul's perseverance is a witness to integrity amid persecution."
    },
    {
      "pk": 2402427,
      "translation": "AIV",
      "book": 44,
      "chapter": 24,
      "verse": 27,
      "text": "When two years had passed, Felix was succeeded by Porcius Festus, and because he wanted to do the Jews a favor, Felix left Paul in prison.",
      "links": "<a href='/AIV/44/25/1'>Acts 25:1</a>",
      "comment": "Paul remains imprisoned despite no charges. The delay is a recurring theme in God’s providence—His Church endures suffering but remains steadfast, trusting God’s timing."
    }
  ],
  "translatedAt": "2025-12-23T03:27:55.400Z"
}