{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 20,
  "verses": [
    {
      "pk": 1932038,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 1,
      "text": "After the uproar had ceased, Paul called for the disciples, embraced them, and departed to go to Macedonia.",
      "links": "<a href='/AIV/44/19/23'>Acts 19:23</a>; <a href='/AIV/46/16/5'>1 Cor. 16:5</a>",
      "comment": "Paul's journey continues after the conflict in Ephesus, showing the pattern of apostolic mission and pastoral care. The authority of Paul gathered disciples, reflecting his leadership role."
    },
    {
      "pk": 1932039,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 2,
      "text": "When he had gone through those regions and encouraged them with many words, he came to Greece.",
      "links": "<a href='/AIV/45/15/19'>Rom. 15:19</a>; <a href='/AIV/47/7/5-6'>2 Cor. 7:5–6</a>",
      "comment": "Paul's ministry included teaching and encouragement, emphasizing the importance of oral tradition passed on within the Church."
    },
    {
      "pk": 1932040,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 3,
      "text": "He spent three months there. When a plot was made against him by the Jews as he was about to set sail for Syria, he decided to return through Macedonia.",
      "links": "<a href='/AIV/44/9/23'>Acts 9:23</a>; <a href='/AIV/44/23/12'>Acts 23:12</a>",
      "comment": "Paul faces opposition, reflecting the continuity with Christ’s own suffering and persecution by religious authorities."
    },
    {
      "pk": 1932041,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 4,
      "text": "He was accompanied by Sopater of Berea, the son of Pyrrhus; and by Aristarchus and Secundus of the Thessalonians, Gaius of Derbe, Timothy, as well as Tychicus and Trophimus of Asia.",
      "links": "<a href='/AIV/44/19/29'>Acts 19:29</a>; <a href='/AIV/49/6/21'>Eph. 6:21</a>",
      "comment": "The diversity and unity among the companions highlight the universal nature of the Church, transcending regional differences."
    },
    {
      "pk": 1932042,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 5,
      "text": "These men went on ahead and were waiting for us at Troas.",
      "links": "<a href='/AIV/44/16/8'>Acts 16:8</a>; <a href='/AIV/44/20/6'>Acts 20:6</a>",
      "comment": "Mentions 'us', indicating Luke is present. The gathering at Troas signifies periodic assemblies for worship, important for Church life."
    },
    {
      "pk": 1932043,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 6,
      "text": "After the Days of Unleavened Bread, we sailed from Philippi, and in five days came to them at Troas, where we stayed seven days.",
      "links": "<a href='/AIV/02/12/17-20'>Ex. 12:17–20</a>",
      "comment": "Reference to Jewish feast shows continuity of worship practices before the establishment of distinctly Christian rituals."
    },
    {
      "pk": 1932044,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 7,
      "text": "On the first day of the week, when we were gathered together to break bread, Paul spoke to them, intending to leave the next day, and prolonged his message until midnight.",
      "links": "<a href='/AIV/44/2/42'>Acts 2:42</a>; <a href='/AIV/40/28/1'>Matt. 28:1</a>",
      "comment": "The 'breaking of bread' on the first day shows the earliest Christian worship centered on the Lord's Day, hinting at the primacy of Sunday and the continuing celebration of the Eucharist."
    },
    {
      "pk": 1932045,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 8,
      "text": "There were many lamps in the upper room where we were gathered.",
      "links": "<a href='/AIV/44/1/13'>Acts 1:13</a>",
      "comment": "The setting is reminiscent of the Last Supper and early Christian house churches meeting in upper rooms."
    },
    {
      "pk": 1932046,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 9,
      "text": "A young man named Eutychus, sitting in the window, sank into a deep sleep as Paul talked still longer. He fell down from the third story and was picked up dead.",
      "links": "<a href='/AIV/11/17/21-22'>1 Kings 17:21–22</a>; <a href='/AIV/42/7/14-15'>Luke 7:14–15</a>",
      "comment": "Miracles of raising the dead by apostles recall Elijah and Christ, showing apostolic authority with signs and wonders."
    },
    {
      "pk": 1932047,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 10,
      "text": "But Paul went down, bent over him, and embracing him said, 'Do not be alarmed, for his life is in him.'",
      "links": "<a href='/AIV/09/28/23'>1 Sam. 28:23</a>; <a href='/AIV/44/9/40'>Acts 9:40</a>",
      "comment": "Paul’s action mirrors Old Testament prophets and Jesus Himself, showing the continuation of miraculous life-giving power within the Church."
    },
    {
      "pk": 1932048,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 11,
      "text": "When he had come upstairs again, and broken bread and eaten, he spoke to them a long while, even until daybreak, and then departed.",
      "links": "<a href='/AIV/44/2/46'>Acts 2:46</a>; <a href='/AIV/46/11/24'>1 Cor. 11:24</a>",
      "comment": "The repeated mention of breaking bread points again to the centrality of Eucharistic fellowship in the Church’s gatherings."
    },
    {
      "pk": 1932049,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 12,
      "text": "And they took the boy away alive, and were greatly comforted.",
      "links": "<a href='/AIV/44/9/41'>Acts 9:41</a>",
      "comment": "The Church’s faith is strengthened by miracles, fulfilling Christ’s promise that signs would accompany those who believe (<a href='/AIV/41/16/17'>Mark 16:17</a>)."
    },
    {
      "pk": 1932050,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 13,
      "text": "But we, going ahead to the ship, set sail for Assos, intending to take Paul on board there, for so he had arranged, intending himself to go by land.",
      "links": "<a href='/AIV/44/20/5'>Acts 20:5</a>",
      "comment": "Paul’s careful planning for travel demonstrates orderly leadership and foresight, drawing a parallel with the logistical organization of early Church mission."
    },
    {
      "pk": 1932051,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 14,
      "text": "When he met us at Assos, we took him on board and went to Mitylene.",
      "links": "<a href='/AIV/44/20/13'>Acts 20:13</a>",
      "comment": "Travel details underline the historical reliability of Luke’s account, as well as the mission’s collaborative nature."
    },
    {
      "pk": 1932052,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 15,
      "text": "Sailing from there, we arrived the next day opposite Chios; the following day we touched at Samos, and stayed at Trogyllium; the next day we came to Miletus.",
      "links": "<a href='/AIV/44/20/17'>Acts 20:17</a>",
      "comment": "These travel notes reflect the spread of the Church along established trade routes, facilitating the spread of the gospel."
    },
    {
      "pk": 1932053,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 16,
      "text": "Paul had decided to sail past Ephesus so that he would not have to spend time in Asia, for he was hurrying to be at Jerusalem, if possible, on the day of Pentecost.",
      "links": "<a href='/AIV/44/2/1'>Acts 2:1</a>; <a href='/AIV/03/23/16'>Lev. 23:16</a>",
      "comment": "Paul aims to celebrate Pentecost in Jerusalem, highlighting continued participation in feast days even as the Church moves towards distinct Christian traditions."
    },
    {
      "pk": 1932054,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 17,
      "text": "From Miletus he sent to Ephesus and called for the elders of the church.",
      "links": "<a href='/AIV/44/14/23'>Acts 14:23</a>; <a href='/AIV/56/1/5'>Titus 1:5</a>",
      "comment": "Paul addresses the spiritual leaders, reflecting the apostolic model of appointing and instructing overseers in the Church."
    },
    {
      "pk": 1932055,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 18,
      "text": "When they arrived, he said to them, 'You yourselves know how I lived among you all the time from the first day I set foot in Asia,",
      "links": "<a href='/AIV/44/18/19'>Acts 18:19</a>; <a href='/AIV/47/1/12'>2 Cor. 1:12</a>",
      "comment": "Paul’s exhortation to elders mirrors Jesus’ instruction to leaders to shepherd the flock by example."
    },
    {
      "pk": 1932056,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 19,
      "text": "serving the Lord with all humility and tears and trials that came upon me through the schemes of the Jews;",
      "links": "<a href='/AIV/44/9/16'>Acts 9:16</a>; <a href='/AIV/47/11/23-28'>2 Cor. 11:23–28</a>",
      "comment": "Paul’s suffering for the faith reflects the apostolic tradition that leaders are often called to deep humility and endurance."
    },
    {
      "pk": 1932057,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 20,
      "text": "how I did not shrink from declaring to you anything that was profitable, teaching you publicly and from house to house.",
      "links": "<a href='/AIV/44/5/42'>Acts 5:42</a>",
      "comment": "Teaching both in public and private calls to mind the holistic catechesis present in the apostolic Church, balancing preaching and personal instruction."
    },
    {
      "pk": 1932058,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 21,
      "text": "testifying both to Jews and to Greeks repentance toward God and faith in our Lord Jesus.",
      "links": "<a href='/AIV/44/19/10'>Acts 19:10</a>; <a href='/AIV/44/13/38-39'>Acts 13:38–39</a>",
      "comment": "Highlights the universality of salvation message, for all nations, prefigured in the Abrahamic promise (<a href='/AIV/01/12/3'>Gen. 12:3</a>)."
    },
    {
      "pk": 1932059,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 22,
      "text": "Now, behold, I am bound by the Spirit, going to Jerusalem, not knowing what will happen to me there,",
      "links": "<a href='/AIV/44/19/21'>Acts 19:21</a>; <a href='/AIV/44/21/11'>Acts 21:11</a>",
      "comment": "Paul’s obedience to the Spirit’s leading recalls Jesus’ own journey to Jerusalem (cf. Luke 9:51), trusting God’s providence."
    },
    {
      "pk": 1932060,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 23,
      "text": "except that the Holy Spirit warns me in every city that chains and trials await me.",
      "links": "<a href='/AIV/44/21/11'>Acts 21:11</a>; <a href='/AIV/42/21/12'>Luke 21:12</a>",
      "comment": "The Spirit’s guidance is part of Christian vocation; suffering for the gospel unites Paul with Christ’s own sacrifice."
    },
    {
      "pk": 1932061,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 24,
      "text": "But I do not consider my life of any value to myself, so long as I can finish my course and the ministry I received from the Lord Jesus, to testify to the gospel of God’s grace.",
      "links": "<a href='/AIV/50/3/7-8'>Phil. 3:7–8</a>; <a href='/AIV/45/1/5'>Rom. 1:5</a>",
      "comment": "Paul models complete self-giving, recalling Christ’s own words about losing one’s life for the gospel (<a href='/AIV/40/16/25'>Matt. 16:25</a>)."
    },
    {
      "pk": 1932062,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 25,
      "text": "And now, I know that none of you among whom I have gone about proclaiming the kingdom will see my face again.",
      "links": "<a href='/AIV/44/21/13'>Acts 21:13</a>",
      "comment": "Paul’s impending departure is poignant, paralleling Jesus’ farewell discourses in John’s Gospel (<a href='/AIV/43/13/33'>John 13:33</a>)."
    },
    {
      "pk": 1932063,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 26,
      "text": "Therefore I testify to you this day that I am innocent of the blood of all;",
      "links": "<a href='/AIV/26/33/6'>Ezek. 33:6</a>; <a href='/AIV/44/18/6'>Acts 18:6</a>",
      "comment": "This echoes the prophetic watchman imagery of Ezekiel. Paul fulfilled his duty to teach all, underscoring responsibility of apostolic ministry."
    },
    {
      "pk": 1932064,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 27,
      "text": "for I did not shrink from declaring to you the whole counsel of God.",
      "links": "<a href='/AIV/44/20/20'>Acts 20:20</a>",
      "comment": "Paul delivered the fullness of God’s revealed truth, foreshadowing the preservation and transmission of doctrinal teaching in the Church."
    },
    {
      "pk": 1932065,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 28,
      "text": "Pay attention to yourselves and to all the flock, over which the Holy Spirit has appointed you overseers, to shepherd the church of God, which He purchased with His own blood.",
      "links": "<a href='/AIV/60/5/2'>1 Pet. 5:2</a>; <a href='/AIV/44/14/23'>Acts 14:23</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "Apostolic succession is seen as elders appointed by the Spirit. The church is described as Christ’s own, purchased by His blood, showing the divinity of Christ (see John 10:11), and the continuing shepherding ministry."
    },
    {
      "pk": 1932066,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 29,
      "text": "I know that after my departure, fierce wolves will come in among you, not sparing the flock;",
      "links": "<a href='/AIV/40/7/15'>Matt. 7:15</a>; <a href='/AIV/43/10/12'>John 10:12</a>",
      "comment": "The warning against false teachers affirms the need for safeguarding apostolic doctrine, and the continuing leadership of faithful overseers."
    },
    {
      "pk": 1932067,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 30,
      "text": "and from among your own selves men will rise up, speaking twisted things, to draw away the disciples after them.",
      "links": "<a href='/AIV/54/4/1'>1 Tim. 4:1</a>; <a href='/AIV/61/2/1'>2 Pet. 2:1</a>",
      "comment": "Internal threats to unity stress the importance of sound doctrine; echoes the pastoral epistles that warn of heresy within the church."
    },
    {
      "pk": 1932068,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 31,
      "text": "Therefore keep watch, remembering that for three years I did not cease, night and day, to admonish everyone with tears.",
      "links": "<a href='/AIV/47/11/28'>2 Cor. 11:28</a>",
      "comment": "Marks Paul's deep emotional investment and tireless teaching; spiritual leaders are called to vigilant, loving care for the flock."
    },
    {
      "pk": 1932069,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 32,
      "text": "And now I entrust you to God and to the word of His grace, which is able to build you up and give you an inheritance among all those who are sanctified.",
      "links": "<a href='/AIV/46/1/2'>1 Cor. 1:2</a>; <a href='/AIV/51/1/12'>Col. 1:12</a>",
      "comment": "Paul entrusts the Church to God and to the apostolic teaching, emphasizing sanctification as a communal reality, not merely an individual one."
    },
    {
      "pk": 1932070,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 33,
      "text": "I have not coveted anyone’s silver or gold or clothing.",
      "links": "<a href='/AIV/02/20/17'>Ex. 20:17</a>; <a href='/AIV/54/6/8'>1 Tim. 6:8</a>",
      "comment": "Paul’s integrity mirrors Jesus’ poverty and detachment from wealth, underscoring the spiritual focus of ministry."
    },
    {
      "pk": 1932071,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 34,
      "text": "You yourselves know that these hands ministered to my necessities and to those who were with me.",
      "links": "<a href='/AIV/18/1/21'>Job 1:21</a>; <a href='/AIV/52/2/9'>1 Thess. 2:9</a>",
      "comment": "Highlights apostolic example of labor and generosity, showing ministers are called to humility and self-sufficiency while caring for others."
    },
    {
      "pk": 1932072,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 35,
      "text": "I have shown you in every way that by working hard like this we must help the weak, and remember the words of the Lord Jesus, that He Himself said, 'It is more blessed to give than to receive.'",
      "links": "<a href='/AIV/40/25/35-40'>Matt. 25:35–40</a>; <a href='/AIV/42/6/38'>Luke 6:38</a>",
      "comment": "This saying is only found here, not in the Gospels, suggesting oral tradition in addition to written texts, a key understanding of apostolic teaching and authority."
    },
    {
      "pk": 1932073,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 36,
      "text": "And when he had said these things, he knelt down and prayed with them all.",
      "links": "<a href='/AIV/44/21/5'>Acts 21:5</a>; <a href='/AIV/42/22/41'>Luke 22:41</a>",
      "comment": "Kneeling and communal prayer reflects the practice of worship and intercession, a hallmark of Christian liturgy and unity."
    },
    {
      "pk": 1932074,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 37,
      "text": "And they all wept bitterly, and embraced Paul and kissed him,",
      "links": "<a href='/AIV/44/21/13'>Acts 21:13</a>; <a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "The bond of love and Christian fellowship is highlighted, calling to mind sacramental unity and the visible sign of peace among believers."
    },
    {
      "pk": 1932075,
      "translation": "AIV",
      "book": 44,
      "chapter": 20,
      "verse": 38,
      "text": "being sorrowful most of all because he had said they would not see his face again. And they accompanied him to the ship.",
      "links": "<a href='/AIV/44/21/5'>Acts 21:5</a>",
      "comment": "The shared sorrow testifies to the profound communion among Christians in the body of Christ, rooted in apostolic leadership and sacrificial love."
    }
  ],
  "translatedAt": "2025-12-23T03:25:45.600Z"
}