{
  "book": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 8,
  "verses": [
    {
      "pk": 2088001,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 1,
      "text": "And Saul approved of his execution. On that day, a great persecution broke out against the church in Jerusalem, and all except the apostles were scattered throughout the regions of Judea and Samaria.",
      "links": "<a href='/AIV/44/7/58-60'>Acts 7:58–60</a>; <a href='/AIV/11/12/17'>1 Ki. 12:17</a>",
      "comment": "Saul's approval marks his early opposition before his later conversion. The scattering of believers begins the spread of the faith beyond Jerusalem, fulfilling Jesus’ words in Acts 1:8 about being witnesses in Judea and Samaria."
    },
    {
      "pk": 2088002,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 2,
      "text": "Devout men buried Stephen and made great lamentation over him.",
      "links": "<a href='/AIV/44/7/59'>Acts 7:59</a>",
      "comment": "The devout burial shows honor and reverence for Stephen, the first martyr. This reflects the early pattern of honoring those who die for the faith, similar to how the faithful are remembered throughout church history."
    },
    {
      "pk": 2088003,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 3,
      "text": "But Saul was ravaging the church, entering house after house. He dragged off men and women and committed them to prison.",
      "links": "<a href='/AIV/44/9/1-2'>Acts 9:1–2</a>",
      "comment": "Persecution is a theme in the early church; Saul’s actions foreshadow his dramatic change and later role as a defender of the faith. The text emphasizes men and women, showing that all believers were targets."
    },
    {
      "pk": 2088004,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 4,
      "text": "Those who were scattered went about preaching the word.",
      "links": "<a href='/AIV/44/11/19'>Acts 11:19</a>",
      "comment": "Persecution leads to growth, not suppression. The spread of believers fulfills Christ’s command to spread the message to all nations."
    },
    {
      "pk": 2088005,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 5,
      "text": "Philip went down to the city of Samaria and proclaimed to them the Messiah.",
      "links": "<a href='/AIV/44/6/5'>Acts 6:5</a>; <a href='/AIV/43/4/39-42'>John 4:39–42</a>",
      "comment": "Philip, one of the seven, brings the gospel to Samaria, echoing the breaking down of ethnic barriers established by Jesus’ encounter with the Samaritan woman."
    },
    {
      "pk": 2088006,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 6,
      "text": "And the crowds with one accord paid attention to what Philip was saying as they heard him and saw the signs he did.",
      "links": "<a href='/AIV/44/8/13'>Acts 8:13</a>; <a href='/AIV/40/4/23-24'>Matt. 4:23–24</a>",
      "comment": "Signs accompany the proclamation, as with Jesus and the apostles, pointing to divine authority behind Philip’s preaching."
    },
    {
      "pk": 2088007,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 7,
      "text": "For unclean spirits came out of many who were possessed, crying out with a loud voice, and many who were paralyzed or lame were healed.",
      "links": "<a href='/AIV/40/10/1'>Matt. 10:1</a>; <a href='/AIV/42/13/11-13'>Luke 13:11–13</a>",
      "comment": "Miraculous healings echo Christ’s ministry, demonstrating the ongoing presence of the Spirit within the apostles and those they commission."
    },
    {
      "pk": 2088008,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 8,
      "text": "So there was much joy in that city.",
      "links": "<a href='/AIV/44/11/23'>Acts 11:23</a>",
      "comment": "Joy characterizes the reception of the gospel; spiritual transformation brings deep gladness as a sign of God's presence."
    },
    {
      "pk": 2088009,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 9,
      "text": "But there was a man named Simon, who had practiced magic in the city and amazed the people of Samaria, saying that he was someone great.",
      "links": "<a href='/AIV/44/13/6-10'>Acts 13:6–10</a>",
      "comment": "Simon represents spiritual confusion and counterfeit signs. His claim of greatness is contrasted with the true power of God manifest in Philip."
    },
    {
      "pk": 2088010,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 10,
      "text": "All paid attention to him, from the least to the greatest, saying, 'This man is the power of God that is called Great.'",
      "links": "<a href='/AIV/44/14/11'>Acts 14:11</a>; <a href='/AIV/41/5/15'>Mark 5:15</a>",
      "comment": "The people’s awe of Simon reflects the human tendency to seek miraculous manifestations, sometimes apart from true faith; this sets up the contrast with apostolic authority."
    },
    {
      "pk": 2088011,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 11,
      "text": "They paid attention to him because for a long time he had amazed them with his magic.",
      "links": "<a href='/AIV/2/7/11-12'>Ex. 7:11–12</a>",
      "comment": "Similar to Pharaoh’s magicians opposing Moses, false signs often imitate genuine miracles, but lack the power and truth of God’s Spirit."
    },
    {
      "pk": 2088012,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 12,
      "text": "But when they believed Philip, as he proclaimed good news about the kingdom of God and the name of Jesus Christ, they were baptized, both men and women.",
      "links": "<a href='/AIV/44/2/38'>Acts 2:38</a>; <a href='/AIV/40/28/19'>Matt. 28:19</a>",
      "comment": "Faith is made visible by the act of baptism, the initiatory sacrament of entrance into the church, administered by one already authorized by the apostles; this highlights the concrete means by which believers join the community."
    },
    {
      "pk": 2088013,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 13,
      "text": "Even Simon himself believed, and after being baptized, he continued with Philip. And seeing signs and great miracles performed, he was amazed.",
      "links": "<a href='/AIV/44/8/18'>Acts 8:18</a>",
      "comment": "Simon’s baptism shows that outward joining alone is not enough without true conversion. The effectiveness of sacraments depends on the right disposition of the heart."
    },
    {
      "pk": 2088014,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 14,
      "text": "Now when the apostles at Jerusalem heard that Samaria had received the word of God, they sent Peter and John to them.",
      "links": "<a href='/AIV/44/8/1'>Acts 8:1</a>; <a href='/AIV/44/15/22'>Acts 15:22</a>",
      "comment": "Apostolic authority is exercised through oversight; Peter and John come to verify and establish the unity and authenticity of the faith in Samaria. This hints at the necessity of bishops and apostolic succession."
    },
    {
      "pk": 2088015,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 15,
      "text": "They came down and prayed for them so that they might receive the Holy Spirit.",
      "links": "<a href='/AIV/44/19/6'>Acts 19:6</a>",
      "comment": "Here, although they had been baptized, the gift of the Holy Spirit comes through the prayer and laying on of hands by the apostles—indicating the importance of apostolic mediation in conferring spiritual gifts."
    },
    {
      "pk": 2088016,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 16,
      "text": "For he had not yet come upon any of them, but they had only been baptized in the name of the Lord Jesus.",
      "links": "<a href='/AIV/44/10/44'>Acts 10:44</a>",
      "comment": "Baptism initiates believers, but the fuller gift of the Spirit comes in a distinct way here, through apostolic laying on of hands. This separates the two acts and establishes church order."
    },
    {
      "pk": 2088017,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 17,
      "text": "Then they laid their hands on them, and they received the Holy Spirit.",
      "links": "<a href='/AIV/44/6/6'>Acts 6:6</a>; <a href='/AIV/40/19/13'>Matt. 19:13</a>",
      "comment": "This is one of the clearest scriptural foundations for confirmation as a separate rite, with special grace conferred through apostolic authority."
    },
    {
      "pk": 2088018,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 18,
      "text": "Now when Simon saw that the Spirit was given through the laying on of the apostles' hands, he offered them money,",
      "links": "<a href='/AIV/44/8/19'>Acts 8:19</a>; <a href='/AIV/44/8/13'>Acts 8:13</a>",
      "comment": "Simon’s attempt to buy spiritual power exposes his misunderstanding of grace and the order of the church, highlighting the need for pure motives and right authority in sacramental acts."
    },
    {
      "pk": 2088019,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 19,
      "text": "saying, 'Give me this power also, so that anyone on whom I lay my hands may receive the Holy Spirit.'",
      "links": "<a href='/AIV/44/3/6'>Acts 3:6</a>",
      "comment": "Here, Simon’s misunderstanding seeks miracles without the humility or calling of the apostles, contrasting authentic apostolic ministry with self-seeking imitation."
    },
    {
      "pk": 2088020,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 20,
      "text": "But Peter said to him, 'May your money perish with you, because you thought you could obtain the gift of God with money.'",
      "links": "<a href='/AIV/40/10/8'>Matt. 10:8</a>; <a href='/AIV/44/5/1-11'>Acts 5:1-11</a>",
      "comment": "Peter’s stern rebuke reflects the gravity of trying to manipulate sacred acts; God’s gifts are never for sale. This points to the integrity required for spiritual leadership."
    },
    {
      "pk": 2088021,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 21,
      "text": "You have no part or share in this matter, for your heart is not right before God.",
      "links": "<a href='/AIV/19/78/37'>Ps. 78:37</a>",
      "comment": "True participation in spiritual gifts requires proper interior disposition. This continues the theme that sacraments are effective in those rightly disposed."
    },
    {
      "pk": 2088022,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 22,
      "text": "Repent, therefore, of this wickedness of yours, and pray to the Lord that, if possible, the intent of your heart may be forgiven you.",
      "links": "<a href='/AIV/62/1/9'>1 John 1:9</a>; <a href='/AIV/44/2/38'>Acts 2:38</a>",
      "comment": "Repentance and seeking forgiveness are essential. Peter calls for confession and prayer—emphasizing the role of personal contrition in restoration."
    },
    {
      "pk": 2088023,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 23,
      "text": "For I see that you are poisoned by bitterness and bound by iniquity.",
      "links": "<a href='/AIV/58/12/15'>Heb. 12:15</a>",
      "comment": "Bitterness corrupts spiritual life, and iniquity binds and separates from God; interior transformation is necessary for full participation."
    },
    {
      "pk": 2088024,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 24,
      "text": "And Simon answered, 'Pray for me to the Lord, that nothing of what you have said may come upon me.'",
      "links": "<a href='/AIV/44/8/22'>Acts 8:22</a>",
      "comment": "Simon requests intercessory prayer, recognizing Peter’s spiritual authority. This is an early example of believers asking recognized leaders for prayer and help in forgiveness."
    },
    {
      "pk": 2088025,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 25,
      "text": "Now when they had testified and spoken the word of the Lord, they returned to Jerusalem, preaching the gospel to many villages of the Samaritans.",
      "links": "<a href='/AIV/44/1/8'>Acts 1:8</a>",
      "comment": "The spread of the gospel to Samaritans fulfills prophecy and Christ’s commissioning of the apostles; the faith grows outward through apostolic action."
    },
    {
      "pk": 2088026,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 26,
      "text": "Now an angel of the Lord spoke to Philip, saying, 'Rise and go toward the south to the road that goes down from Jerusalem to Gaza.' This is a wilderness road.",
      "links": "<a href='/AIV/11/19/5'>1 Ki. 19:5</a>; <a href='/AIV/44/8/29'>Acts 8:29</a>",
      "comment": "Philip’s divine guidance parallels angelic visits in Old Testament narratives, showing God’s direct involvement in mission."
    },
    {
      "pk": 2088027,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 27,
      "text": "And he rose and went. And there was an Ethiopian, a eunuch, a court official of Candace, queen of the Ethiopians, who was over all her treasure. He had come to Jerusalem to worship",
      "links": "<a href='/AIV/19/68/31'>Ps. 68:31</a>; <a href='/AIV/23/56/3-5'>Isa. 56:3–5</a>",
      "comment": "The Ethiopian’s journey signifies Gentiles’ desire for the God of Israel. Isa. 56:3–5 hints that eunuchs, once excluded, will be welcomed—fulfilled in this narrative."
    },
    {
      "pk": 2088028,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 28,
      "text": "and was returning, seated in his chariot, and was reading the prophet Isaiah.",
      "links": "<a href='/AIV/23/53'>Isaiah 53</a>",
      "comment": "The Ethiopian’s devotion is evident in his study of Isaiah. Narrative sets up a direct link between Old Testament prophecy and New Testament fulfillment."
    },
    {
      "pk": 2088029,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 29,
      "text": "And the Spirit said to Philip, 'Go over and join this chariot.'",
      "links": "<a href='/AIV/44/10/19'>Acts 10:19</a>",
      "comment": "Spirit-led guidance reaffirms that God directs his messengers; immediate response symbolizing the willingness to follow divine command."
    },
    {
      "pk": 2088030,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 30,
      "text": "So Philip ran up to him and heard him reading Isaiah the prophet, and said, 'Do you understand what you are reading?'",
      "links": "<a href='/AIV/44/8/28'>Acts 8:28</a>",
      "comment": "Philip’s question introduces the idea of needing interpretation—a model for the church’s teaching authority in understanding Scripture rightly."
    },
    {
      "pk": 2088031,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 31,
      "text": "And he said, 'How can I, unless someone guides me?' And he invited Philip to come up and sit with him.",
      "links": "<a href='/AIV/16/8/8'>Neh. 8:8</a>",
      "comment": "Scripture alone is insufficient without guidance—hints at the necessity of reliable interpretation and teaching authority within the church."
    },
    {
      "pk": 2088032,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 32,
      "text": "Now the passage of the Scripture that he was reading was this: 'He was led like a sheep to the slaughter, and as a lamb before its shearer is silent, so he opens not his mouth.'",
      "links": "<a href='/AIV/23/53/7'>Isa. 53:7</a>",
      "comment": "Isaiah 53:7, a prophetic text about the suffering Messiah, is quoted directly—a crucial passage identifying Jesus as the servant who suffers innocently for sins."
    },
    {
      "pk": 2088033,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 33,
      "text": "In his humiliation justice was denied him. Who can describe his generation? For his life was taken from the earth.",
      "links": "<a href='/AIV/23/53/8'>Isa. 53:8</a>",
      "comment": "Isaiah’s prophecy foretells Christ’s unjust death and its saving significance, showing direct fulfillment in the life and death of Jesus."
    },
    {
      "pk": 2088034,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 34,
      "text": "And the eunuch said to Philip, 'About whom, I ask, does the prophet say this, about himself or about someone else?'",
      "links": "<a href='/AIV/23/53'>Isaiah 53</a>",
      "comment": "The eunuch’s question expresses the heart of Christological interpretation—Old Testament prophecy pointing to the person of Jesus."
    },
    {
      "pk": 2088035,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 35,
      "text": "Then Philip opened his mouth, and beginning with this Scripture, he proclaimed to him the good news about Jesus.",
      "links": "<a href='/AIV/44/3/18'>Acts 3:18</a>; <a href='/AIV/42/24/27'>Luke 24:27</a>",
      "comment": "Philip models the interpretive approach: starting from the Old Testament, he reveals its fulfillment in Jesus, as Jesus himself did after the resurrection (Luke 24:27)."
    },
    {
      "pk": 2088036,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 36,
      "text": "And as they went along the road, they came to some water, and the eunuch said, 'See, here is water! What prevents me from being baptized?'",
      "links": "<a href='/AIV/44/8/12'>Acts 8:12</a>; <a href='/AIV/40/3/6'>Matt. 3:6</a>",
      "comment": "Notice the immediate desire for baptism upon understanding the gospel—it’s a necessary step to entering the church community."
    },
    {
      "pk": 2088037,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 37,
      "text": "[And Philip said, 'If you believe with all your heart, you may.' And he replied, 'I believe that Jesus Christ is the Son of God.']",
      "links": "<a href='/AIV/40/16/16'>Matt. 16:16</a>; <a href='/AIV/43/1/49'>John 1:49</a>",
      "comment": "This verse is found in some ancient manuscripts but missing in others; it articulates the full confession of faith required for baptism—affirming Jesus as Son of God."
    },
    {
      "pk": 2088038,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 38,
      "text": "And he commanded the chariot to stop, and both Philip and the eunuch went down into the water, and he baptized him.",
      "links": "<a href='/AIV/40/3/16'>Matt. 3:16</a>",
      "comment": "Both go into the water, indicating immersion, but the primary emphasis is on the efficacy of baptism administered by a commissioned leader."
    },
    {
      "pk": 2088039,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 39,
      "text": "And when they came up out of the water, the Spirit of the Lord took Philip away, and the eunuch did not see him any longer but went on his way rejoicing.",
      "links": "<a href='/AIV/12/2/16'>2 Ki. 2:16</a>; <a href='/AIV/44/8/8'>Acts 8:8</a>",
      "comment": "The sudden removal of Philip is reminiscent of prophetic miracles; the eunuch rejoices—confirming the spiritual transformation effected through the sacraments."
    },
    {
      "pk": 2088040,
      "translation": "AIV",
      "book": 44,
      "chapter": 8,
      "verse": 40,
      "text": "But Philip found himself at Azotus, and as he passed through, he preached the gospel to all the towns until he came to Caesarea.",
      "links": "<a href='/AIV/44/21/8'>Acts 21:8</a>",
      "comment": "Philip continues as an itinerant evangelist, showing the missionary character of early church leaders and the ongoing spread of the faith."
    }
  ],
  "translatedAt": "2025-12-23T03:17:35.164Z"
}