{
  "book": 51,
  "bookName": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 27,
  "verses": [
    {
      "pk": 51027001,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 1,
      "text": "When it was decided that we should sail for Italy, they handed Paul and some other prisoners over to a centurion named Julius, of the Augustan Cohort.",
      "links": "<a href='/AIV/44/23/11'>Acts 23:11</a>; <a href='/AIV/44/25/12'>Acts 25:12</a>",
      "comment": "Verse 1 marks the start of Paul's journey to Rome, a fulfillment of God's promise (see Acts 23:11)."
    },
    {
      "pk": 51027002,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 2,
      "text": "Embarking on a ship from Adramyttium, which was about to sail to the ports along the coast of Asia, we put to sea, accompanied by Aristarchus, a Macedonian from Thessalonica.",
      "links": "<a href='/AIV/44/19/29'>Acts 19:29</a>; <a href='/AIV/44/20/4'>Acts 20:4</a>",
      "comment": "Paul was not alone on his mission; the companionship of faithful believers like Aristarchus points to the necessity of fellowship even amidst trials."
    },
    {
      "pk": 51027003,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 3,
      "text": "The next day we landed at Sidon; and Julius, treating Paul kindly, allowed him to go to his friends to be cared for.",
      "links": "<a href='/AIV/44/24/23'>Acts 24:23</a>",
      "comment": "Paul's favor with the centurion reveals God's providence working even through Roman authorities. The care by the community hints at the early development of active charity among believers."
    },
    {
      "pk": 51027004,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 4,
      "text": "Putting out to sea from there, we sailed under the shelter of Cyprus, because the winds were against us.",
      "links": "<a href='/AIV/44/11/19'>Acts 11:19</a>",
      "comment": "The mention of the winds being adverse foreshadows the coming storm and Paul's spiritual leadership in the crisis."
    },
    {
      "pk": 51027005,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 5,
      "text": "When we had sailed across the sea off Cilicia and Pamphylia, we came to Myra in Lycia.",
      "links": "<a href='/AIV/16/27/7'>Gen. 27:7</a> (Cilicia reference); <a href='/AIV/44/6/9'>Acts 6:9</a>",
      "comment": "Paul’s journeys pass through many Gentile territories, showing the Gospel’s spread to all nations, fulfilling the Old Testament's universal scope."
    },
    {
      "pk": 51027006,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 6,
      "text": "There the centurion found an Alexandrian ship sailing for Italy and put us on board.",
      "links": "<a href='/AIV/44/28/11'>Acts 28:11</a>",
      "comment": "Alexandria was a hub of culture and commerce, indicating the global connections of the nascent Church."
    },
    {
      "pk": 51027007,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 7,
      "text": "We sailed slowly for many days and arrived with difficulty off Cnidus, and as the wind did not allow us to go farther, we sailed under the shelter of Crete off Salmone.",
      "links": "<a href='/AIV/44/2/11'>Acts 2:11</a> (Crete reference)",
      "comment": "Repeated mention of hardship on the journey signals that this is both a literal voyage and a spiritual image of perseverance through adversity."
    },
    {
      "pk": 51027008,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 8,
      "text": "Sailing along it with difficulty, we came to a place called Fair Havens, near the city of Lasea.",
      "links": "",
      "comment": "Fair Havens becomes a symbolic place of temporary refuge. Spiritual interpretations see in the safeharbor a prefiguring of the Church as a place of refuge."
    },
    {
      "pk": 51027009,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 9,
      "text": "Since much time had passed, and sailing had already become dangerous, because even the Fast was already over, Paul advised them,",
      "links": "<a href='/AIV/03/16/29-31'>Lev. 16:29-31</a> (The Fast = Day of Atonement)",
      "comment": "Reference to 'the Fast' points to the Day of Atonement, echoing the Jewish roots retained by the first generation of Christians."
    },
    {
      "pk": 51027010,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 10,
      "text": "saying, “Men, I perceive that the voyage will be with injury and much loss, not only of the cargo and the ship, but also of our lives.”",
      "links": "",
      "comment": "Paul’s prophetic insight foreshadows the Christian role as spiritual guide in times of crisis—pointing to apostolic leadership."
    },
    {
      "pk": 51027011,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 11,
      "text": "But the centurion paid more attention to the pilot and to the owner of the ship than to what Paul said.",
      "links": "",
      "comment": "The centurion's trust in secular authority over apostolic advice can symbolize the peril of ignoring spiritual guidance from Christ’s appointed leaders."
    },
    {
      "pk": 51027012,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 12,
      "text": "Because the harbor was not suitable to winter in, the majority decided to put out to sea from there, if somehow they could reach Phoenix, a harbor of Crete, facing both southwest and northwest, and spend the winter there.",
      "links": "",
      "comment": "Majority rule in spiritual matters sometimes leads to peril, while obedience to apostolic instruction leads to safety—a recurring theme in Church tradition."
    },
    {
      "pk": 51027013,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 13,
      "text": "When a gentle south wind began to blow, thinking they had achieved their purpose, they weighed anchor and sailed along Crete, close to shore.",
      "links": "",
      "comment": "Outward circumstances may deceptively appear favorable, yet spiritual discernment is needed (see Prov. 14:12)."
    },
    {
      "pk": 51027014,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 14,
      "text": "But before long, a fierce wind, called the northeaster, rushed down from the island.",
      "links": "",
      "comment": "Storms often symbolize trials and testing in the disciple’s life—see Jesus calming the storm as a sign of His authority (Mk 4:37-41)."
    },
    {
      "pk": 51027015,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 15,
      "text": "When the ship was caught and could not face the wind, we gave way to it and were driven along.",
      "links": "",
      "comment": "Being driven along in the storm parallels surrender to the providence of God amid trials."
    },
    {
      "pk": 51027016,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 16,
      "text": "Running under the shelter of a small island called Cauda, we were barely able to take control of the ship's boat.",
      "links": "",
      "comment": "This illustrates the struggle for security and the limits of human effort in contrast with divine assistance."
    },
    {
      "pk": 51027017,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 17,
      "text": "After hoisting it up, they used supports to undergird the ship. Fearing that they would run aground on the Syrtis, they lowered the gear, and so were driven along.",
      "links": "",
      "comment": "Paul describes measures for physical survival, yet spiritual security ultimately depends on trust in the Lord."
    },
    {
      "pk": 51027018,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 18,
      "text": "Because we were being violently storm-tossed, the next day they began to jettison the cargo.",
      "links": "",
      "comment": "Sacrifice of worldly wealth for survival suggests spiritual detachment—echoed in Jesus’ call to leave everything and follow Him (Lk 5:11)."
    },
    {
      "pk": 51027019,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 19,
      "text": "On the third day, they threw the ship’s tackle overboard with their own hands.",
      "links": "",
      "comment": "Third day references in Scripture often prefigure deliverance (see Hos 6:2; Mt 16:21)."
    },
    {
      "pk": 51027020,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 20,
      "text": "When neither sun nor stars appeared for many days, and no small storm lay on us, all hope of our being saved was finally abandoned.",
      "links": "<a href='/AIV/10/22/12'>2 Sam 22:12</a> (darkness); <a href='/AIV/19/107/27'>Ps 107:27</a>",
      "comment": "Paul’s companions, surrounded by darkness, symbolize moments of utter despair—light returns only through divine intervention."
    },
    {
      "pk": 51027021,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 21,
      "text": "After they had gone without food for a long time, Paul stood up among them and said, 'Men, you should have listened to me and not sailed from Crete and incurred this injury and loss.'",
      "links": "",
      "comment": "Paul reproves the company for ignoring his prior counsel; this highlights the weight of apostolic authority through whom God’s will was communicated."
    },
    {
      "pk": 51027022,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 22,
      "text": "And now I urge you to take heart, for there will be no loss of life among you, but only of the ship.",
      "links": "",
      "comment": "Hope revives through revelation, not by human means—faith is sustained by God’s word."
    },
    {
      "pk": 51027023,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 23,
      "text": "For this very night there stood before me an angel of the God to whom I belong and whom I worship,",
      "links": "<a href='/AIV/44/23/11'>Acts 23:11</a>; <a href='/AIV/01/28/12'>Gen 28:12</a> (angelic appearances)",
      "comment": "Paul’s encounter with a heavenly messenger parallels Old Testament angelic revelations, further establishing the continuity of God’s saving plan through His Church."
    },
    {
      "pk": 51027024,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 24,
      "text": "'saying, \"Do not be afraid, Paul; you must stand before Caesar. And behold, God has granted you all those who sail with you.\"'",
      "links": "<a href='/AIV/44/23/11'>Acts 23:11</a>; <a href='/AIV/01/15/1'>Gen 15:1</a>",
      "comment": "God’s sovereignty over history is evident; Paul’s preservation is for a higher mission: witness before rulers—foreshadowing the spread of the Gospel through apostolic succession."
    },
    {
      "pk": 51027025,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 25,
      "text": "So take heart, men, for I have faith in God that it will be exactly as I have been told.",
      "links": "<a href='/AIV/01/22/8'>Gen 22:8</a>; <a href='/AIV/45/4/3'>Rom 4:3</a>",
      "comment": "Paul’s unwavering trust is reminiscent of Abraham’s faith. True faith trusts God’s word above circumstances."
    },
    {
      "pk": 51027026,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 26,
      "text": "But we must run aground on some island.”",
      "links": "",
      "comment": "Divine providence points to salvation taking unexpected forms. God’s plan sometimes requires a loss for a greater gain."
    },
    {
      "pk": 51027027,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 27,
      "text": "When the fourteenth night had come, as we were being driven across the Adriatic Sea about midnight, the sailors suspected that they were nearing land.",
      "links": "",
      "comment": "Fourteen is twice seven, the number of completion—God’s timing is perfect fulfillment."
    },
    {
      "pk": 51027028,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 28,
      "text": "They took a sounding and found twenty fathoms; a little farther on, they took another sounding and found fifteen fathoms.",
      "links": "",
      "comment": "Progressive descent—drawing closer to land—can be seen as a gradual approach to the fulfillment of God’s promise."
    },
    {
      "pk": 51027029,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 29,
      "text": "Fearing that we might run aground on the rocks, they let down four anchors from the stern and prayed for day to come.",
      "links": "",
      "comment": "Prayer in the darkness before dawn reflects the need for persevering faith in times of peril—compare Ps 130:5-6."
    },
    {
      "pk": 51027030,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 30,
      "text": "As the sailors were seeking to escape from the ship, and had lowered the ship’s boat into the sea, under pretense of laying out anchors from the bow,",
      "links": "",
      "comment": "Attempted abandonment by the crew shows the peril of division in the community; unity under rightful leadership is required for survival."
    },
    {
      "pk": 51027031,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 31,
      "text": "Paul said to the centurion and the soldiers, 'Unless these men stay with the ship, you cannot be saved.'",
      "links": "",
      "comment": "The condition of salvation is continued unity. One ancient interpretation sees the ship as an image of the one, true Church, outside of which there is no salvation—see 1 Peter 3:20-21 (Noah’s Ark imagery)."
    },
    {
      "pk": 51027032,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 32,
      "text": "Then the soldiers cut away the ropes of the boat and let it go.",
      "links": "",
      "comment": "Their act symbolizes radical trust in God’s designated plan, letting go of alternate paths to salvation."
    },
    {
      "pk": 51027033,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 33,
      "text": "Just before daybreak, Paul urged them all to take some food, saying, 'Today is the fourteenth day you have continued in suspense and without food, having taken nothing.'",
      "links": "",
      "comment": "Paul’s concern for their physical well-being reinforces the importance of both spiritual and bodily care—prefiguring later sacramental theology."
    },
    {
      "pk": 51027034,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 34,
      "text": "'Therefore I urge you to take some food. For it will aid your survival, since not a hair will perish from the head of any of you.'",
      "links": "<a href='/AIV/42/21/18'>Luke 21:18</a>",
      "comment": "Paul's guarantee is an echo of Jesus’ promise (Lk 21:18), emphasizing God's sovereign protection of His people."
    },
    {
      "pk": 51027035,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 35,
      "text": "When he had said these things, he took bread, and giving thanks to God in front of them all, he broke it and began to eat.",
      "links": "<a href='/AIV/42/22/19'>Luke 22:19</a>; <a href='/AIV/44/2/42'>Acts 2:42</a>",
      "comment": "Paul’s action closely parallels the Emmaus meal and the Eucharistic breaking of bread—highlighting the central place of thanksgiving and the sacred meal in worship."
    },
    {
      "pk": 51027036,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 36,
      "text": "Then they were all encouraged and took food themselves.",
      "links": "",
      "comment": "All are fed through one man’s intercession and faith—a foreshadowing of sacramental unity."
    },
    {
      "pk": 51027037,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 37,
      "text": "There were in all two hundred seventy-six persons on the ship.",
      "links": "",
      "comment": "The precise number—276—emphasizes the historical reality and the vastness of God’s saving concern."
    },
    {
      "pk": 51027038,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 38,
      "text": "When they had eaten enough, they lightened the ship, throwing out the wheat into the sea.",
      "links": "",
      "comment": "Letting go of sustenance to enable survival parallels Christ’s call to radical trust and generosity."
    },
    {
      "pk": 51027039,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 39,
      "text": "When day came, they did not recognize the land, but noticed a bay with a beach, and they decided to run the ship ashore there if possible.",
      "links": "",
      "comment": "The new land is like the unknown future that requires trust in God’s providence."
    },
    {
      "pk": 51027040,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 40,
      "text": "So they cast off the anchors and left them in the sea, while at the same time they loosened the ropes of the rudders. Then, hoisting the foresail to the wind, they made for the beach.",
      "links": "",
      "comment": "Leaving behind the anchors—their last means of earthly security—they go forward in faith alone."
    },
    {
      "pk": 51027041,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 41,
      "text": "But striking a sandbar, they ran the ship aground; the bow stuck and remained immovable, but the stern was broken up by the force of the waves.",
      "links": "",
      "comment": "Destruction of the ship, yet survival of the people, echoes spiritual images: the Church endures even if earthly vessels are destroyed—see 2 Cor 4:8-9."
    },
    {
      "pk": 51027042,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 42,
      "text": "The soldiers’ plan was to kill the prisoners, lest any should swim away and escape.",
      "links": "",
      "comment": "Harsh worldly solutions contrast with God’s plan for universal salvation."
    },
    {
      "pk": 51027043,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 43,
      "text": "But the centurion, wishing to save Paul, kept them from carrying out their plan. He ordered those who could swim to jump overboard first and get to land,",
      "links": "",
      "comment": "God uses even pagan leaders for the protection of His servants."
    },
    {
      "pk": 51027044,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 27,
      "verse": 44,
      "text": "and the rest on planks or on pieces of the ship. And so it was that all were brought safely to land.",
      "links": "<a href='/AIV/01/7/23'>Gen 7:23</a> (Noah’s Ark, all saved); <a href='/AIV/60/3/20'>1 Pet 3:20</a>",
      "comment": "As in the deliverance of Noah’s family, all who remained with the apostolic band are saved—a strong image of the necessity of remaining within the one true community founded by Christ."
    }
  ],
  "translatedAt": "2025-12-24T11:35:00.732Z"
}