{
  "book": 63,
  "bookName": "Titus",
  "bookAbbreviation": "Titus",
  "chapter": 3,
  "verses": [
    {
      "pk": 63003001,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 1,
      "text": "Remind them to be subject to rulers and authorities, to obey, to be ready for every good work.",
      "links": "<a href='/AIV/45/13/1'>Rom. 13:1</a>; <a href='/AIV/60/2/13'>1 Pet. 2:13</a>",
      "comment": "Paul instructs believers to submit to civil authorities and be prepared to do good. This reflects the importance of living peacefully in society, an echo of God’s established order (Rom. 13:1). The language emphasizes obedience and cooperation with governance, which is a recurring biblical theme."
    },
    {
      "pk": 63003002,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 2,
      "text": "To speak evil of no one, to avoid quarreling, to be gentle, showing perfect courtesy toward all people.",
      "links": "<a href='/AIV/54/6/11'>1 Tim. 6:11</a>; <a href='/AIV/60/3/8-9'>1 Pet. 3:8-9</a>",
      "comment": "Believers are called to humility, gentleness, and peacemaking—traits which are also fruits of the Spirit (Gal. 5:22-23). This passage invites us into a life marked by sincere love, a reflection of Christ Himself, who was gentle and humble in heart (Matt. 11:29)."
    },
    {
      "pk": 63003003,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 3,
      "text": "For we ourselves were once foolish, disobedient, led astray, slaves to various passions and pleasures, living in malice and envy, hated by others and hating one another.",
      "links": "<a href='/AIV/49/2/1-3'>Eph. 2:1-3</a>; <a href='/AIV/56/3/3'>Titus 1:16</a>",
      "comment": "Paul reminds us of our past without grace—to highlight our transformation. The universal condition of sinfulness is underscored (Rom. 3:23), setting up the context for divine intervention through Christ."
    },
    {
      "pk": 63003004,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 4,
      "text": "But when the kindness and love of God our Savior appeared,",
      "links": "<a href='/AIV/43/1/17'>John 1:17</a>; <a href='/AIV/56/2/11'>Titus 2:11</a>",
      "comment": "This verse points to the incarnation—the appearance of God’s mercy in Christ, our Savior. This language echoes the revelation of God’s grace in Jesus (John 1:17), reflecting His divine initiative in saving mankind."
    },
    {
      "pk": 63003005,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 5,
      "text": "He saved us, not because of works done by us in righteousness, but according to His own mercy, by the washing of rebirth and renewal by the Holy Spirit.",
      "links": "<a href='/AIV/49/2/8-9'>Eph. 2:8-9</a>; <a href='/AIV/43/3/5'>John 3:5</a>",
      "comment": "Salvation is grounded in divine mercy, not human merit. The 'washing of rebirth' clearly references the sacramental reality of regeneration (cf. John 3:5), traditionally understood as baptism. Renewal by the Holy Spirit relates to the ongoing transformation of believers (Eph. 2:8-9)."
    },
    {
      "pk": 63003006,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 6,
      "text": "Whom He poured out on us abundantly, through Jesus Christ our Savior.",
      "links": "<a href='/AIV/44/2/33'>Acts 2:33</a>; <a href='/AIV/19/133/2'>Ps. 133:2</a>",
      "comment": "The pouring out of the Holy Spirit is a fulfillment of OT promises (Joel 2:28, Acts 2:33). The phrase underscores the richness and generosity of God’s grace, mediated through Christ, and typologically linked to priestly anointing (Ps. 133:2)."
    },
    {
      "pk": 63003007,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 7,
      "text": "So that, having been justified by His grace, we might become heirs according to the hope of eternal life.",
      "links": "<a href='/AIV/45/8/16-17'>Rom. 8:16-17</a>; <a href='/AIV/48/4/7'>Gal. 4:7</a>",
      "comment": "Justification comes through grace, making believers ‘heirs’ of eternal life (Rom. 8:17). The inheritance language points to our adoption into God’s family—a union maintained and promised through sacramental grace."
    },
    {
      "pk": 63003008,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 8,
      "text": "The saying is trustworthy, and I want you to insist on these things, so that those who have believed in God may be careful to devote themselves to good works. These things are excellent and beneficial for all people.",
      "links": "<a href='/AIV/56/2/14'>Titus 2:14</a>; <a href='/AIV/59/2/17-18'>James 2:17-18</a>",
      "comment": "Faith must issue forth in works (James 2:17). Paul calls for persistence in teaching, showing that grace leads to a transformed life that produces fruit. The necessity of good works is highlighted—not for earning salvation, but as its natural result (Titus 2:14)."
    },
    {
      "pk": 63003009,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 9,
      "text": "But avoid foolish controversies, genealogies, dissensions, and quarrels about the law, for they are unprofitable and worthless.",
      "links": "<a href='/AIV/54/1/4'>1 Tim. 1:4</a>; <a href='/AIV/56/1/14'>Titus 1:14</a>",
      "comment": "Paul warns against fruitless debates—especially legalistic or speculative disputes—which distract from the gospel. The passage encourages discernment and unity, placing priority on essentials of the faith recognized by apostolic tradition."
    },
    {
      "pk": 63003010,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 10,
      "text": "As for a person who stirs up division, after warning him once and then twice, have nothing more to do with him,",
      "links": "<a href='/AIV/40/18/15-17'>Matt. 18:15-17</a>; <a href='/AIV/54/6/5'>1 Tim. 6:5</a>",
      "comment": "Paul lays out a process for handling divisiveness: warning, then separation if unrepentant. This reflects the principle of maintaining purity and peace in the church, paralleling Jesus’ own teaching on correcting a brother (Matt. 18:17)."
    },
    {
      "pk": 63003011,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 11,
      "text": "Knowing that such a person is warped and sinful; he is self-condemned.",
      "links": "<a href='/AIV/54/1/19-20'>1 Tim. 1:19-20</a>; <a href='/AIV/55/3/8'>2 Tim. 3:8</a>",
      "comment": "Divisive behavior is self-condemning because it rejects the unity Christ prayed for (John 17:21). The call is to maintain doctrinal and relational harmony handed down from the apostles."
    },
    {
      "pk": 63003012,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 12,
      "text": "When I send Artemas or Tychicus to you, do your best to come to me at Nicopolis, for I have decided to spend the winter there.",
      "links": "<a href='/AIV/44/20/4'>Acts 20:4</a>; <a href='/AIV/55/4/12'>2 Tim. 4:12</a>",
      "comment": "Paul’s travel plans demonstrate the close-knit leadership of the early church, with delegated authority and personal fellowship. The historical names also provide continuity in the apostolic tradition."
    },
    {
      "pk": 63003013,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 13,
      "text": "Do your best to help Zenas the lawyer and Apollos on their way, so that they lack nothing.",
      "links": "<a href='/AIV/46/16/12'>1 Cor. 16:12</a>",
      "comment": "Supporting fellow workers concretely underscores the charitable obligations within the unified church—a theme developed throughout apostolic writings."
    },
    {
      "pk": 63003014,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 14,
      "text": "And let our people learn to devote themselves to good works for urgent needs, so that they may not be unfruitful.",
      "links": "<a href='/AIV/56/2/7'>Titus 2:7</a>; <a href='/AIV/40/5/16'>Matt. 5:16</a>",
      "comment": "Practical charity is an essential mark of authentic faith. Fruitfulness in good works continues to be a central theme, emphasizing the transformed lives expected of all believers (Matt. 5:16)."
    },
    {
      "pk": 63003015,
      "translation": "AIV",
      "book": 63,
      "bookName": "Titus",
      "bookAbbreviation": "Titus",
      "chapter": 3,
      "verse": 15,
      "text": "All who are with me send you greetings. Greet those who love us in the faith. Grace be with you all.",
      "links": "<a href='/AIV/46/16/20'>1 Cor. 16:20</a>; <a href='/AIV/52/5/28'>1 Thess. 5:28</a>",
      "comment": "Paul’s final words highlight the warmth and unity found among Christ’s followers. ‘Grace be with you all’ is a prayer for ongoing participation in God’s life—a theme echoing through all ages of the Church."
    }
  ],
  "translatedAt": "2025-12-24T12:15:58.068Z"
}