{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 14,
  "verses": [
    {
      "pk": 2141401,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 1,
      "text": "In the days of Amraphel king of Shinar, Arioch king of Ellasar, Chedorlaomer king of Elam, and Tidal king of Goiim,",
      "links": "<a href='/AIV/1/10/10'>Gen. 10:10</a>; <a href='/AIV/1/10/22'>Gen. 10:22</a>",
      "comment": "These names point to real historical figures in the ancient Near East. 'Shinar' often refers to Babylon. The listing of nations shows the widespread threat from foreign kings."
    },
    {
      "pk": 2141402,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 2,
      "text": "they made war against Bera king of Sodom, Birsha king of Gomorrah, Shinab king of Admah, Shemeber king of Zeboiim, and the king of Bela (that is, Zoar).",
      "links": "<a href='/AIV/1/19/22'>Gen. 19:22</a>",
      "comment": "This war involves the notorious cities of Sodom and Gomorrah, showing the extent of their political entanglements."
    },
    {
      "pk": 2141403,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 3,
      "text": "All these came together in the Valley of Siddim (that is, the Salt Sea).",
      "links": "<a href='/AIV/1/19/24-25'>Gen. 19:24–25</a>",
      "comment": "Siddim is later associated with the 'Salt Sea,' the precursor to the modern Dead Sea. It foreshadows the destruction connected to these cities."
    },
    {
      "pk": 2141404,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 4,
      "text": "Twelve years they had served Chedorlaomer, but in the thirteenth year they rebelled.",
      "links": "",
      "comment": "Thirteen years of subjugation suggests a comprehensive political dominance, with rebellion often leading to new invasions."
    },
    {
      "pk": 2141405,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 5,
      "text": "In the fourteenth year, Chedorlaomer and the kings who were with him came and struck the Rephaim in Ashteroth-karnaim, the Zuzim in Ham, the Emim in Shaveh-kiriathaim,",
      "links": "<a href='/AIV/1/15/20'>Gen. 15:20</a>; <a href='/AIV/5/2/10-12'>Deut. 2:10–12</a>",
      "comment": "The Rephaim and related peoples were considered giants or fierce warriors, casting Chedorlaomer’s campaign as especially ruthless."
    },
    {
      "pk": 2141406,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 6,
      "text": "and the Horites in their hill country of Seir as far as El-paran, which is by the wilderness.",
      "links": "<a href='/AIV/5/2/12'>Deut. 2:12</a>",
      "comment": "The Horites and their defeat mark the sweeping destruction through various native tribes. Deserts and wildernesses often have spiritual significance in scripture."
    },
    {
      "pk": 2141407,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 7,
      "text": "Then they turned back and came to En-mishpat (that is, Kadesh) and defeated all the country of the Amalekites, and also the Amorites, who were living in Hazazon-tamar.",
      "links": "<a href='/AIV/4/20/1'>Num. 20:1</a>; <a href='/AIV/19/92/12'>Ps. 92:12</a>",
      "comment": "The Amalekites and Amorites later play major roles as Israel's enemies. Kadesh becomes important in Israel's wanderings."
    },
    {
      "pk": 2141408,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 8,
      "text": "Then the king of Sodom, the king of Gomorrah, the king of Admah, the king of Zeboiim, and the king of Bela (that is, Zoar) came out, and they prepared for battle in the Valley of Siddim",
      "links": "",
      "comment": "The alliance of the five Canaanite kings demonstrates seeking unity against a greater foreign threat, reflecting patterns seen later in biblical history."
    },
    {
      "pk": 2141409,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 9,
      "text": "against Chedorlaomer king of Elam, Tidal king of Goiim, Amraphel king of Shinar, and Arioch king of Ellasar—four kings against five.",
      "links": "",
      "comment": "The odds are significant: four against five. The focus is on political and military power, but the coming story shows a higher, unseen hand at work."
    },
    {
      "pk": 2141410,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 10,
      "text": "Now the Valley of Siddim was full of bitumen pits, and the kings of Sodom and Gomorrah fled and fell there, but those who survived fled to the hill country.",
      "links": "",
      "comment": "Bitumen (tar) pits make the battlefield treacherous. The defeat of the local kings foreshadows future judgment on these cities."
    },
    {
      "pk": 2141411,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 11,
      "text": "So the enemy took all the goods of Sodom and Gomorrah and all their provisions, and went away.",
      "links": "",
      "comment": "Conquest in these times meant total loss—plunder was total, leaving the cities bereft and exposed."
    },
    {
      "pk": 2141412,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 12,
      "text": "They also took Lot, the son of Abram's brother, who dwelled in Sodom, along with his possessions, and departed.",
      "links": "<a href='/AIV/1/13/12'>Gen. 13:12</a>",
      "comment": "Lot, living among the people of Sodom, is caught up in their fate. This underscores the dangers of associating closely with the unrighteous."
    },
    {
      "pk": 2141413,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 13,
      "text": "Then one who had escaped came and told Abram the Hebrew, who was living by the oaks of Mamre the Amorite, brother of Eshcol and of Aner; these were allies of Abram.",
      "links": "<a href='/AIV/1/13/18'>Gen. 13:18</a>",
      "comment": "This is the first time 'Hebrew' appears as a title for Abram, indicating his distinction from the Canaanite peoples. His alliances here foreshadow later covenant brotherhood."
    },
    {
      "pk": 2141414,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 14,
      "text": "And when Abram heard that his relative had been taken captive, he armed his trained men, born in his own house, three hundred and eighteen, and pursued them as far as Dan.",
      "links": "<a href='/AIV/1/12/5'>Gen. 12:5</a>",
      "comment": "Abram’s ability to muster such a force underlines both his wealth and his leadership—acting to rescue Lot anticipates the role of the righteous intercessor."
    },
    {
      "pk": 2141415,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 15,
      "text": "He divided his forces by night, he and his servants, and defeated them and chased them as far as Hobah, north of Damascus.",
      "links": "<a href='/AIV/7/7/16'>Judg. 7:16</a>",
      "comment": "Abram’s victory through a surprise attack anticipates future miraculous deliverances in Israel’s history (see Gideon in Judges 7)."
    },
    {
      "pk": 2141416,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 16,
      "text": "He brought back all the goods, and also brought back Lot his relative, and his possessions, as well as the women and the people.",
      "links": "",
      "comment": "Abram acts as redeemer for Lot—a type of the messianic redeemer who saves his people from captivity, prefiguring deliverance themes found in the New Testament."
    },
    {
      "pk": 2141417,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 17,
      "text": "After he returned from defeating Chedorlaomer and the kings who were with him, the king of Sodom went out to meet him at the Valley of Shaveh (that is, the King's Valley).",
      "links": "<a href='/AIV/10/18/18'>2 Sam. 18:18</a>",
      "comment": "The King's Valley becomes a place of meeting and blessing, later associated with Jerusalem—a city of great biblical significance."
    },
    {
      "pk": 2141418,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 18,
      "text": "And Melchizedek king of Salem brought out bread and wine. He was priest of God Most High.",
      "links": "<a href='/AIV/19/110/4'>Ps. 110:4</a>; <a href='/AIV/58/7/1-3'>Heb. 7:1–3</a>",
      "comment": "Melchizedek’s offering of bread and wine is a profound image anticipating later sacred rituals (see Ps. 110:4, Heb. 7). He is both king and priest—a rare figure, foreshadowing Christ’s eternal priesthood."
    },
    {
      "pk": 2141419,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 19,
      "text": "He blessed him and said: 'Blessed be Abram by God Most High, Possessor of heaven and earth;",
      "links": "<a href='/AIV/1/24/3'>Gen. 24:3</a>",
      "comment": "The blessing of Abram by a priest of God Most High affirms Abram’s vocation and calling. The title 'Possessor of heaven and earth' emphasizes God’s absolute sovereignty."
    },
    {
      "pk": 2141420,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 20,
      "text": "and blessed be God Most High, who has delivered your enemies into your hand.' And Abram gave him a tenth of everything.",
      "links": "<a href='/AIV/58/7/4-10'>Heb. 7:4–10</a>",
      "comment": "Abram gives a tithe (a tenth) to Melchizedek, the priest-king. This establishes the principle of honoring God through giving firstfruits and points to the authority of priesthood beyond the line of Levi (see Hebrews 7), anticipating later hierarchical worship."
    },
    {
      "pk": 2141421,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 21,
      "text": "And the king of Sodom said to Abram, 'Give me the persons, but take the goods for yourself.'",
      "links": "",
      "comment": "The king of Sodom seeks only people, highlighting his misplaced priorities—material goods over the sanctity and value of life, contrasting with Abram’s righteous priorities."
    },
    {
      "pk": 2141422,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 22,
      "text": "But Abram said to the king of Sodom, 'I have lifted my hand to the LORD, God Most High, Possessor of heaven and earth,",
      "links": "<a href='/AIV/1/21/23'>Gen. 21:23</a>",
      "comment": "Lifting the hand is a sign of oath-taking; Abram distances his mission from the ways of the kings of Sodom."
    },
    {
      "pk": 2141423,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 23,
      "text": "that I will not take a thread or a sandal strap or anything that is yours, lest you should say, 'I have made Abram rich.'",
      "links": "",
      "comment": "Abram refuses even the smallest gain from Sodom, choosing to rely only on God’s provision. This models virtue and the call for detachment from worldly reward, anticipating later calls to evangelical poverty."
    },
    {
      "pk": 2141424,
      "translation": "AIV",
      "book": 1,
      "chapter": 14,
      "verse": 24,
      "text": "I will take nothing but what the young men have eaten, and the share of the men who went with me. Let Aner, Eshcol, and Mamre take their share.'",
      "links": "",
      "comment": "Abram insists on absolute righteousness, but acknowledges justice for his allies in their fair share—insight into stewardship, integrity, and cooperation among the faithful."
    }
  ],
  "translatedAt": "2025-12-23T08:40:45.287Z"
}