{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 39,
  "verses": [
    {
      "pk": 5393901,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 1,
      "text": "Joseph was taken down to Egypt. Potiphar, an officer of Pharaoh, captain of the guard, an Egyptian, bought him from the Ishmaelites who had brought him down there.",
      "links": "<a href='/AIV/1/37/36'>Gen. 37:36</a>; <a href='/AIV/1/40/4'>Gen. 40:4</a>",
      "comment": "Joseph's arrival in Egypt fulfills earlier prophecy and sets the scene for God's providence in adversity. Potiphar's role as an officer links to Joseph's later position in Pharaoh's court."
    },
    {
      "pk": 5393902,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 2,
      "text": "The LORD was with Joseph, so he became successful, and he lived in the house of his Egyptian master.",
      "links": "<a href='/AIV/1/21/22'>Gen. 21:22</a>; <a href='/AIV/9/16/7'>1 Sam. 16:7</a>",
      "comment": "God’s presence brings success and blessing even in foreign lands. This foreshadows Christ’s presence with all who suffer."
    },
    {
      "pk": 5393903,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 3,
      "text": "His master saw that the LORD was with him, and that the LORD made all that he did succeed in his hands.",
      "links": "<a href='/AIV/1/26/28'>Gen. 26:28</a>; <a href='/AIV/27/6/3'>Dan. 6:3</a>",
      "comment": "Visible evidence of God's blessing draws attention to Joseph’s faith. Mirroring how Christians ought to live visibly holy lives."
    },
    {
      "pk": 5393904,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 4,
      "text": "Joseph found favor in his sight and attended him, and he made him overseer of his house and put him in charge of all he had.",
      "links": "<a href='/AIV/1/24/2'>Gen. 24:2</a>; <a href='/AIV/1/41/40'>Gen. 41:40</a>",
      "comment": "Prefigures the stewardship found throughout Scripture, highlighting humble service leading to authority—an important spiritual principle."
    },
    {
      "pk": 5393905,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 5,
      "text": "From the time he made him overseer in his house and over all he had, the LORD blessed the Egyptian’s house for Joseph’s sake. The blessing of the LORD was on all he had, in house and field.",
      "links": "<a href='/AIV/1/30/27'>Gen. 30:27</a>; <a href='/AIV/1/12/3'>Gen. 12:3</a>",
      "comment": "Blessing extends to others through the righteous. This recalls God’s promise to bless the nations through His chosen people."
    },
    {
      "pk": 5393906,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 6,
      "text": "So he left all that he had in Joseph’s care; with him there, he did not worry about anything except the food he ate. Now Joseph was handsome and well-built.",
      "links": "<a href='/AIV/1/29/17'>Gen. 29:17</a>; <a href='/AIV/9/16/12'>1 Sam. 16:12</a>",
      "comment": "Joseph's appearance foreshadows the tests he will endure, and his trusted stewardship prefigures Christ's oversight over the Church."
    },
    {
      "pk": 5393907,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 7,
      "text": "After these things, his master’s wife looked at Joseph with desire, and she said, \"Lie with me.\"",
      "links": "<a href='/AIV/20/5/3'>Prov. 5:3</a>; <a href='/AIV/40/5/28'>Matt. 5:28</a>",
      "comment": "The temptation Joseph faces echoes the concept of fidelity and resisting sin. His choice models purity and virtue, which is integral for Christian sanctification."
    },
    {
      "pk": 5393908,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 8,
      "text": "But he refused and said to his master’s wife, \"Look, my master does not concern himself with anything in the house, and he has entrusted everything he has to me.\"",
      "links": "<a href='/AIV/1/39/6'>Gen. 39:6</a>; <a href='/AIV/1/41/40'>Gen. 41:40</a>",
      "comment": "Joseph’s integrity and respect for his master are stressed. The principle of faithfulness amidst temptation is strengthened here."
    },
    {
      "pk": 5393909,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 9,
      "text": "\"No one in this house is greater than I am; he has withheld nothing from me except you, because you are his wife. How then could I do this great evil and sin against God?\"",
      "links": "<a href='/AIV/1/20/6'>Gen. 20:6</a>; <a href='/AIV/19/51/4'>Ps. 51:4</a>",
      "comment": "Joseph recognizes sin’s offense against God above even human relationships. This lays a foundation for understanding confession and penance."
    },
    {
      "pk": 5393910,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 10,
      "text": "She spoke to Joseph day after day, but he did not listen to her to lie with her or to be with her.",
      "links": "<a href='/AIV/20/7/13'>Prov. 7:13</a>",
      "comment": "Persistent temptation underscores the need for virtue and daily commitment to holiness—echoing similar themes in the letters of Paul."
    },
    {
      "pk": 5393911,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 11,
      "text": "One day, when he went into the house to do his work, and none of the men of the house was inside,",
      "links": "<a href='/AIV/1/39/7'>Gen. 39:7</a>",
      "comment": "The setting underscores vulnerability to temptation and sets the stage for a true test of faith."
    },
    {
      "pk": 5393912,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 12,
      "text": "She caught him by his garment, saying, \"Lie with me.\" But he left his garment in her hand and fled and went outside.",
      "links": "<a href='/AIV/20/6/5'>Prov. 6:5</a>; <a href='/AIV/54/6/11'>1 Tim. 6:11</a>",
      "comment": "Joseph flees temptation, symbolizing the necessity to actively avoid sin—a lesson echoed in the New Testament for spiritual victory."
    },
    {
      "pk": 5393913,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 13,
      "text": "When she saw that he had left his garment in her hand and had fled outside,",
      "links": "<a href='/AIV/1/37/23'>Gen. 37:23</a>",
      "comment": "Joseph’s garment here mirrors the earlier act of his brothers stripping him—a recurring motif representing innocence wrongly accused."
    },
    {
      "pk": 5393914,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 14,
      "text": "She called to the men of her house and said to them, \"See, he has brought us a Hebrew to mock us! He came in to me to lie with me, but I cried out with a loud voice.\"",
      "links": "<a href='/AIV/1/39/17'>Gen. 39:17</a>; <a href='/AIV/1/42/21'>Gen. 42:21</a>",
      "comment": "False accusation and persecution of the righteous are echoed throughout Scripture, preparing the way for Christ’s unjust suffering."
    },
    {
      "pk": 5393915,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 15,
      "text": "\"And when he heard that I lifted my voice and cried out, he left his garment with me and fled and went outside.\"",
      "links": "<a href='/AIV/1/39/12'>Gen. 39:12</a>",
      "comment": "The motif of the garment and flight recurs; precursors to sacrifice and purity themes seen later in scripture."
    },
    {
      "pk": 5393916,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 16,
      "text": "She kept his garment with her until his master came home.",
      "links": "<a href='/AIV/1/39/13'>Gen. 39:13</a>",
      "comment": "Evidence used to accuse the innocent—a symbol for Christ's silent endurance under accusation."
    },
    {
      "pk": 5393917,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 17,
      "text": "She told him the same story, saying, \"The Hebrew servant whom you brought to us came in to me to mock me.\"",
      "links": "<a href='/AIV/1/39/14'>Gen. 39:14</a>",
      "comment": "Repeating the accusation adds weight to Joseph’s suffering, which highlights the role of suffering in spiritual purification."
    },
    {
      "pk": 5393918,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 18,
      "text": "\"But as soon as I raised my voice and cried out, he left his garment with me and fled outside.\"",
      "links": "<a href='/AIV/1/39/12'>Gen. 39:12</a>",
      "comment": "Repetition emphasizes innocence. Suffering for righteousness is consistently rewarded by God even when misunderstood by men."
    },
    {
      "pk": 5393919,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 19,
      "text": "As soon as his master heard the words that his wife spoke to him, saying, \"This is what your servant did to me,\" his anger was kindled.",
      "links": "<a href='/AIV/1/40/2'>Gen. 40:2</a>",
      "comment": "Joseph suffers injustice, an archetype of Christ’s passion. God’s providence remains active, even through apparent misfortune."
    },
    {
      "pk": 5393920,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 20,
      "text": "Joseph’s master took him and put him into the prison, the place where the king’s prisoners were confined. He remained there.",
      "links": "<a href='/AIV/1/40/3'>Gen. 40:3</a>; <a href='/AIV/1/41/14'>Gen. 41:14</a>",
      "comment": "Joseph’s imprisonment prefigures the sufferings endured by later righteous leaders. Trust in God during adversity is a key theme."
    },
    {
      "pk": 5393921,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 21,
      "text": "But the LORD was with Joseph and showed him steadfast love. He gave him favor in the sight of the keeper of the prison.",
      "links": "<a href='/AIV/1/39/2'>Gen. 39:2</a>; <a href='/AIV/19/105/19-22'>Ps. 105:19–22</a>",
      "comment": "Divine favor persists despite unjust suffering. God’s steadfast love parallels the doctrine of grace operating through trials."
    },
    {
      "pk": 5393922,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 22,
      "text": "The keeper of the prison put Joseph in charge of all the prisoners in the prison, and whatever was done there, he was the one responsible.",
      "links": "<a href='/AIV/1/39/4'>Gen. 39:4</a>; <a href='/AIV/1/40/4'>Gen. 40:4</a>",
      "comment": "Authority given to Joseph despite persecution, resonating with the theme of maintaining virtue and service, anticipating Christ’s kingship over the faithful."
    },
    {
      "pk": 5393923,
      "translation": "AIV",
      "book": 1,
      "chapter": 39,
      "verse": 23,
      "text": "The keeper of the prison did not pay attention to anything under Joseph’s care, because the LORD was with him. Whatever he did, the LORD made it prosper.",
      "links": "<a href='/AIV/1/39/3'>Gen. 39:3</a>; <a href='/AIV/19/1/3'>Ps. 1:3</a>",
      "comment": "God’s faithfulness endures through suffering, suggesting the importance of trust and perseverance. Joseph as a type of Christ, innocent yet victorious over adversity, foreshadows redemption. Spiritual readings see this as assurance of God's guidance during trials for those faithful to Him."
    }
  ],
  "translatedAt": "2025-12-23T08:55:00.829Z"
}