{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 3,
  "verses": [
    {
      "pk": 1933080,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 1,
      "text": "Now the serpent was more cunning than any beast of the field that the LORD God had made. He said to the woman, \"Did God actually say, 'You must not eat from any tree in the garden'?\"",
      "links": "<a href='/AIV/66/12/9'>Rev. 12:9</a>; <a href='/AIV/47/11/3'>2 Cor. 11:3</a>",
      "comment": "The serpent is later revealed to symbolize Satan (see Rev. 12:9). The question introduces doubt about God's word."
    },
    {
      "pk": 1933081,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 2,
      "text": "And the woman said to the serpent, \"We may eat fruit from the trees in the garden,",
      "links": "<a href='/AIV/1/2/16'>Gen. 2:16</a>",
      "comment": "Eve correctly recalls God's permission, distinguishing the specific command."
    },
    {
      "pk": 1933082,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 3,
      "text": "but about the fruit of the tree that is in the middle of the garden, God has said, 'You must not eat of it, nor shall you touch it, or you will die.'\"",
      "links": "<a href='/AIV/1/2/17'>Gen. 2:17</a>",
      "comment": "Eve adds 'nor shall you touch it,' perhaps a sign of growing uncertainty about the command."
    },
    {
      "pk": 1933083,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 4,
      "text": "But the serpent said to the woman, \"You will surely not die,",
      "links": "<a href='/AIV/43/8/44'>John 8:44</a>",
      "comment": "Here Satan directly contradicts God’s warning, introducing the first lie (John 8:44—Satan as the father of lies)."
    },
    {
      "pk": 1933084,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 5,
      "text": "For God knows that when you eat of it your eyes will be opened, and you will be like God, knowing good and evil.\"",
      "links": "<a href='/AIV/1/2/9'>Gen. 2:9</a>; <a href='/AIV/26/28/2'>Ezek. 28:2</a>",
      "comment": "The temptation was to seek God-like status through disobedience. Compare to desires for self-exaltation (Ezekiel 28:2)."
    },
    {
      "pk": 1933085,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 6,
      "text": "So when the woman saw that the tree was good for food, and that it was a delight to the eyes, and that the tree was desirable to make one wise, she took of its fruit and ate. She also gave some to her husband, who was with her, and he ate.",
      "links": "<a href='/AIV/59/1/14-15'>James 1:14–15</a>; <a href='/AIV/45/5/12'>Rom. 5:12</a>",
      "comment": "This verse describes the three aspects of temptation (cf. 1 John 2:16). Adam willfully participates (Rom. 5:12—sin entered through one man)."
    },
    {
      "pk": 1933086,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 7,
      "text": "Then the eyes of both of them were opened, and they knew that they were naked. So they sewed fig leaves together and made themselves coverings.",
      "links": "<a href='/AIV/1/2/25'>Gen. 2:25</a>; <a href='/AIV/23/59/6'>Isa. 59:6</a>",
      "comment": "Their innocence is lost, leading to shame and inadequate self-covering, symbolizing human attempts to deal with sin."
    },
    {
      "pk": 1933087,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 8,
      "text": "And they heard the sound of the LORD God walking in the garden in the cool of the day, and the man and his wife hid themselves from the presence of the LORD God among the trees of the garden.",
      "links": "<a href='/AIV/19/139/7'>Ps. 139:7</a>",
      "comment": "God’s presence is immediate, indicating a personal relationship. Sin causes separation and shame."
    },
    {
      "pk": 1933088,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 9,
      "text": "But the LORD God called to the man and said to him, \"Where are you?\"",
      "links": "<a href='/AIV/1/4/9'>Gen. 4:9</a>",
      "comment": "God initiates, seeking out the sinner. The question is for Adam’s self-examination, not for information."
    },
    {
      "pk": 1933089,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 10,
      "text": "He said, \"I heard the sound of you in the garden, and I was afraid because I was naked, so I hid.\"",
      "links": "<a href='/AIV/1/2/25'>Gen. 2:25</a>",
      "comment": "Fear replaces innocence. Nakedness now brings shame due to guilt."
    },
    {
      "pk": 1933090,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 11,
      "text": "And He said, \"Who told you that you were naked? Have you eaten from the tree of which I commanded you not to eat?\"",
      "links": "<a href='/AIV/1/2/17'>Gen. 2:17</a>",
      "comment": "God’s questions invite confession, revealing the connection between disobedience and new awareness."
    },
    {
      "pk": 1933091,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 12,
      "text": "The man said, \"The woman whom You gave to be with me, she gave me some of the fruit from the tree, and I ate.\"",
      "links": "<a href='/AIV/1/2/18'>Gen. 2:18</a>",
      "comment": "Adam shifts blame to the woman and implicitly to God Himself. The harmony is broken."
    },
    {
      "pk": 1933092,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 13,
      "text": "Then the LORD God said to the woman, \"What is this that you have done?\" The woman said, \"The serpent deceived me, and I ate.\"",
      "links": "<a href='/AIV/54/2/14'>1 Tim. 2:14</a>",
      "comment": "Eve confesses her deception (cf. 1 Tim. 2:14). God engages each responsible party."
    },
    {
      "pk": 1933093,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 14,
      "text": "So the LORD God said to the serpent, \"Because you have done this, you are cursed above all livestock and all the wild animals. On your belly you shall go, and dust you shall eat all the days of your life.",
      "links": "<a href='/AIV/23/65/25'>Isa. 65:25</a>",
      "comment": "The serpent receives immediate judgment, symbolizing ultimate defeat."
    },
    {
      "pk": 1933094,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 15,
      "text": "And I will put enmity between you and the woman, and between your offspring and her offspring. He will crush your head, and you will strike his heel.\"",
      "links": "<a href='/AIV/45/16/20'>Rom. 16:20</a>; <a href='/AIV/48/4/4'>Gal. 4:4</a>; <a href='/AIV/43/12/31-33'>John 12:31–33</a>",
      "comment": "Known as the 'Protoevangelium,' this is the first announcement of a Redeemer. The singular 'he' refers prophetically to Christ, who conquers evil (Rom. 16:20; Gal. 4:4). This also hints at a woman’s unique role in salvation history, later mirrored in the New Testament (Luke 1:38)."
    },
    {
      "pk": 1933095,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 16,
      "text": "To the woman He said, \"I will greatly multiply your pain in childbirth; in pain you will bring forth children. Yet your desire will be for your husband, and he will rule over you.\"",
      "links": "<a href='/AIV/54/2/15'>1 Tim. 2:15</a>",
      "comment": "Human suffering and disorder enter relationships. Childbearing, tied to salvation hope (1 Tim. 2:15), remains dignified despite pain."
    },
    {
      "pk": 1933096,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 17,
      "text": "And to Adam He said, \"Because you have listened to the voice of your wife and have eaten from the tree of which I commanded you, 'You shall not eat from it,' cursed is the ground because of you; in pain you shall eat from it all the days of your life.",
      "links": "<a href='/AIV/45/8/20-22'>Rom. 8:20–22</a>",
      "comment": "Creation suffers alongside humanity due to sin (Rom. 8:20–22)."
    },
    {
      "pk": 1933097,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 18,
      "text": "It will produce thorns and thistles for you, and you will eat the plants of the field.",
      "links": "<a href='/AIV/23/55/13'>Isa. 55:13</a>",
      "comment": "Contrast between blessings of creation and the fallen world; thorns later become a symbol in Christ’s Passion (Matt. 27:29)."
    },
    {
      "pk": 1933098,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 19,
      "text": "By the sweat of your face you will eat bread, until you return to the ground, for out of it you were taken; you are dust, and to dust you will return.\"",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/19/90/3'>Psalm 90:3</a>",
      "comment": "'To dust you will return' indicates mortality. This verse is echoed in funeral liturgies and emphasizes humanity’s dependence on God for resurrection hope."
    },
    {
      "pk": 1933099,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 20,
      "text": "The man called his wife's name Eve, because she was the mother of all the living.",
      "links": "<a href='/AIV/1/4/1'>Gen. 4:1</a>",
      "comment": "Naming symbolizes Adam’s faith in God’s promise of life even after the Fall. Eve’s role is dignified as a new beginning for humanity."
    },
    {
      "pk": 1933100,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 21,
      "text": "And the LORD God made for Adam and for his wife garments of skins and clothed them.",
      "links": "<a href='/AIV/3/7/11'>Lev. 7:11</a>; <a href='/AIV/58/9/22'>Heb. 9:22</a>",
      "comment": "God Himself provides suitable clothing, hinting at the necessity of sacrifice for covering sin. Early type of atonement (Heb. 9:22)."
    },
    {
      "pk": 1933101,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 22,
      "text": "Then the LORD God said, \"Behold, the man has become like one of us in knowing good and evil. Now, lest he reach out his hand and take also from the tree of life, and eat, and live forever...\"",
      "links": "<a href='/AIV/1/1/26'>Gen. 1:26</a>; <a href='/AIV/66/2/7'>Rev. 2:7</a>",
      "comment": "Plural 'us' hints at the divine mystery. The tree of life is closed until opened again in Christ’s future victory (Rev. 2:7)."
    },
    {
      "pk": 1933102,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 23,
      "text": "Therefore the LORD God sent him out from the garden of Eden to work the ground from which he was taken.",
      "links": "<a href='/AIV/23/59/2'>Isa. 59:2</a>",
      "comment": "Separation from Eden is both judgment and mercy—to prevent immortal life in sin and to prepare the way for redemption."
    },
    {
      "pk": 1933103,
      "translation": "AIV",
      "book": 1,
      "chapter": 3,
      "verse": 24,
      "text": "He drove out the man, and at the east of the garden of Eden He placed the cherubim and a flaming sword that turned every way to guard the way to the tree of life.",
      "links": "<a href='/AIV/2/25/18-22'>Ex. 25:18-22</a>; <a href='/AIV/66/22/14'>Rev. 22:14</a>",
      "comment": "Guarded not out of cruelty but out of love, pointing forward to restored access to the tree of life through salvation history (Rev. 22:14). Cherubim connection foreshadows sacred spaces and priestly mediation."
    }
  ],
  "translatedAt": "2025-12-23T08:35:16.546Z"
}