{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 13,
  "verses": [
    {
      "pk": 101301,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 1,
      "text": "So Abram went up from Egypt to the Negev, he and his wife, and all that he had, and Lot with him.",
      "links": "<a href='/AIV/1/12/10'>Gen. 12:10</a>; <a href='/AIV/1/20/1'>Gen. 20:1</a>",
      "comment": "Abram’s return from Egypt marks a turning point showing his detachment from previous burdens. The Negev, a southern region, anticipates movement toward God's promise."
    },
    {
      "pk": 101302,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 2,
      "text": "Now Abram was very wealthy in livestock, silver, and gold.",
      "links": "<a href='/AIV/1/24/35'>Gen. 24:35</a>; <a href='/AIV/19/105/37'>Ps. 105:37</a>",
      "comment": "Material blessings often accompany obedience to God’s call, foreshadowing how God's chosen line is set apart and provided for."
    },
    {
      "pk": 101303,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 3,
      "text": "He journeyed on from the Negev as far as Bethel, to the place where his tent had been at the beginning, between Bethel and Ai.",
      "links": "<a href='/AIV/1/12/8'>Gen. 12:8</a>; <a href='/AIV/1/28/19'>Gen. 28:19</a>",
      "comment": "Abram’s return to Bethel symbolically recalls a return to first devotion, a theme reappearing in calls to spiritual renewal."
    },
    {
      "pk": 101304,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 4,
      "text": "To the place where he had built the altar at first, and there Abram called upon the name of the LORD.",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/19/116/17'>Ps. 116:17</a>",
      "comment": "Returning to worship at the altar signals the central role of sacrifice and prayer in maintaining communion with God; altars foreshadow Christ’s once-for-all sacrifice."
    },
    {
      "pk": 101305,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 5,
      "text": "And Lot, who went with Abram, also had flocks, herds, and tents.",
      "links": "<a href='/AIV/1/12/5'>Gen. 12:5</a>",
      "comment": "Lot’s abundance reflects the blessings that overflow onto those who journey with God’s chosen, similar to spiritual inheritance through faithful community."
    },
    {
      "pk": 101306,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 6,
      "text": "But the land could not support them while they stayed together, for their possessions were so great that they could not dwell together.",
      "links": "<a href='/AIV/1/36/7'>Gen. 36:7</a>",
      "comment": "The scarcity points to the need for separation and discernment in pursuing God’s specific promises, echoing later divisions among peoples for divine purposes."
    },
    {
      "pk": 101307,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 7,
      "text": "And there was strife between the herdsmen of Abram’s livestock and the herdsmen of Lot’s livestock. At that time, the Canaanites and Perizzites were living in the land.",
      "links": "<a href='/AIV/1/12/6'>Gen. 12:6</a>; <a href='/AIV/1/34/30'>Gen. 34:30</a>",
      "comment": "The mention of strife highlights human conflict arising from abundance, and the people dwelling in the land reveal it was not yet possessed by God’s promised line."
    },
    {
      "pk": 101308,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 8,
      "text": "So Abram said to Lot, 'Let there be no strife between you and me, or between your herdsmen and mine, for we are relatives.'",
      "links": "<a href='/AIV/19/133/1'>Ps. 133:1</a>; <a href='/AIV/40/5/9'>Matt. 5:9</a>",
      "comment": "Abram’s initiative for peace reflects the calling to harmony among God’s people, anticipating teachings on reconciliation and unity found in later scripture."
    },
    {
      "pk": 101309,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 9,
      "text": "'Is not the whole land before you? Please separate from me. If you take the left, then I will go to the right; or if you take the right, then I will go to the left.'",
      "links": "<a href='/AIV/1/20/15'>Gen. 20:15</a>",
      "comment": "Abram’s trusting generosity reveals faith in God’s provision, willingly surrendering his own interests—an early model for humility that reflects self-emptying (cf. Phil. 2:5–8)."
    },
    {
      "pk": 101310,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 10,
      "text": "Lot lifted his eyes and saw all the valley of the Jordan, that it was well-watered everywhere—like the garden of the LORD, like the land of Egypt—as you go toward Zoar. (This was before the LORD destroyed Sodom and Gomorrah.)",
      "links": "<a href='/AIV/1/19/24'>Gen. 19:24</a>; <a href='/AIV/1/2/10'>Gen. 2:10</a>",
      "comment": "Lot’s choice, based on appearance, reflects humanity’s tendency toward superficial judgment, echoing Eden’s allure and Egypt’s abundance but ending in separation from the place of promise."
    },
    {
      "pk": 101311,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 11,
      "text": "So Lot chose for himself all the valley of the Jordan, and Lot journeyed east. Thus they separated from each other.",
      "links": "<a href='/AIV/1/19/17'>Gen. 19:17</a>",
      "comment": "Eastward movement is often associated with exile or moving away from the presence of God (cf. Gen. 3:24), hinting at Lot’s future difficulties."
    },
    {
      "pk": 101312,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 12,
      "text": "Abram settled in the land of Canaan, while Lot settled among the cities of the valley and pitched his tents near Sodom.",
      "links": "<a href='/AIV/1/19/1'>Gen. 19:1</a>",
      "comment": "Abram’s location aligns with God’s promises, while Lot’s choice places him near corruption—a lesson about the spiritual consequences of where we dwell."
    },
    {
      "pk": 101313,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 13,
      "text": "Now the men of Sodom were wicked, sinning greatly against the LORD.",
      "links": "<a href='/AIV/1/18/20'>Gen. 18:20</a>; <a href='/AIV/1/19/13'>Gen. 19:13</a>",
      "comment": "Sodom's wickedness is contrasted with the righteousness God seeks, foreshadowing coming judgment and identifying the need for intercession."
    },
    {
      "pk": 101314,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 14,
      "text": "The LORD said to Abram, after Lot had separated from him, 'Lift up your eyes and look from the place where you are—northward and southward and eastward and westward.'",
      "links": "<a href='/AIV/1/28/14'>Gen. 28:14</a>; <a href='/AIV/1/15/5'>Gen. 15:5</a>",
      "comment": "Abram receives personal reassurance from God, with language recalling the breadth of spiritual inheritance later promised to believers (cf. Rom. 4:13)."
    },
    {
      "pk": 101315,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 15,
      "text": "'For all the land that you see I will give to you and to your offspring forever.'",
      "links": "<a href='/AIV/1/17/8'>Gen. 17:8</a>; <a href='/AIV/1/28/13'>Gen. 28:13</a>",
      "comment": "God’s promise is not only material but spiritual and eternal, prefiguring the everlasting Kingdom made present among God’s people."
    },
    {
      "pk": 101316,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 16,
      "text": "'And I will make your offspring as the dust of the earth, so that if anyone could count the dust of the earth, your offspring also could be counted.'",
      "links": "<a href='/AIV/1/22/17'>Gen. 22:17</a>; <a href='/AIV/1/28/14'>Gen. 28:14</a>",
      "comment": "The multiplication of Abram’s descendants anticipates both physical and spiritual multitudes who become united in faith through a shared covenant."
    },
    {
      "pk": 101317,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 17,
      "text": "'Arise, walk through the land in its length and breadth, for I will give it to you.'",
      "links": "<a href='/AIV/1/17/8'>Gen. 17:8</a>; <a href='/AIV/6/1/3'>Josh. 1:3</a>",
      "comment": "God’s command to ‘walk’ demonstrates participation in the promise—a dynamic, active inheritance paralleling the call to walk in faith and obedience."
    },
    {
      "pk": 101318,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 18,
      "text": "So Abram moved his tent and came to live by the oaks of Mamre, which are at Hebron, and he built an altar there to the LORD.",
      "links": "<a href='/AIV/1/18/1'>Gen. 18:1</a>; <a href='/AIV/19/26/2'>Ps. 26:2</a>",
      "comment": "Abram's settling and altar building emphasize sacred space and continuity of worship, pointing ahead to the establishment of holy places and the importance of ongoing sacrifice—spiritually fulfilled through the perfect offering of Christ."
    }
  ],
  "translatedAt": "2025-12-23T08:40:18.744Z"
}