{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 34,
  "verses": [
    {
      "pk": 1934031,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 1,
      "text": "Now Dinah, the daughter whom Leah bore to Jacob, went out to visit the women of the land.",
      "links": "<a href='/AIV/1/30/21'>Gen. 30:21</a>",
      "comment": "Dinah, Jacob’s only recorded daughter, enters the narrative here. Her actions set the stage for the events that follow."
    },
    {
      "pk": 1934032,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 2,
      "text": "Shechem, son of Hamor the Hivite, the ruler of that region, saw her. He took her, lay with her, and violated her.",
      "links": "<a href='/AIV/1/35/22'>Gen. 35:22</a>; <a href='/AIV/1/49/5-7'>Gen. 49:5–7</a>",
      "comment": "Shechem’s act is described plainly. The violation of Dinah will lead to conflict between Jacob’s family and the inhabitants of the land."
    },
    {
      "pk": 1934033,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 3,
      "text": "His heart became attached to Dinah, daughter of Jacob, and he loved the young woman and spoke tenderly to her.",
      "links": "<a href='/AIV/1/24/67'>Gen. 24:67</a>",
      "comment": "Despite Shechem’s initial crime, his affection for Dinah seems genuine, which complicates the narrative’s moral landscape."
    },
    {
      "pk": 1934034,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 4,
      "text": "Shechem said to his father Hamor, 'Get me this girl as my wife.'",
      "links": "<a href='/AIV/1/21/21'>Gen. 21:21</a>",
      "comment": "Shechem seeks to legitimize his relationship through marriage, following ancient Near Eastern custom."
    },
    {
      "pk": 1934035,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 5,
      "text": "Now Jacob heard that Shechem had defiled his daughter Dinah. But his sons were in the fields with his livestock, so Jacob remained silent until they returned.",
      "links": "<a href='/AIV/1/31/4'>Gen. 31:4</a>",
      "comment": "Jacob exercises restraint, waiting for his sons to return before responding—a sign of wisdom and communal decision-making."
    },
    {
      "pk": 1934036,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 6,
      "text": "Hamor, Shechem’s father, went out to speak with Jacob.",
      "links": "<a href='/AIV/1/23/6'>Gen. 23:6</a>",
      "comment": "Inter-family negotiations begin, establishing the importance of parental authority in ancient societies."
    },
    {
      "pk": 1934037,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 7,
      "text": "The sons of Jacob returned from the field when they heard. The men were grieved and very angry, because he had done a disgraceful thing in Israel by lying with Jacob’s daughter, something that should not be done.",
      "links": "<a href='/AIV/3/18/17'>Lev. 18:17</a>; <a href='/AIV/2/22/16'>Exod. 22:16</a>",
      "comment": "The concept of 'Israel' as a people is introduced. The moral offense is emphasized, which points toward later laws about sexual purity."
    },
    {
      "pk": 1934038,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 8,
      "text": "Hamor spoke with them, saying, 'My son Shechem longs for your daughter. Please give her to him as a wife.'",
      "links": "<a href='/AIV/1/24/60'>Gen. 24:60</a>",
      "comment": "Marital alliances between families are highlighted as tools of social cohesion and diplomacy."
    },
    {
      "pk": 1934039,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 9,
      "text": "'Make marriages with us. Give us your daughters, and take our daughters for yourselves.'",
      "links": "<a href='/AIV/1/28/1'>Gen. 28:1</a>",
      "comment": "Intermarriage with surrounding peoples was a common temptation, later warned against due to the risk of syncretism and loss of identity."
    },
    {
      "pk": 1934040,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 10,
      "text": "'You shall dwell with us, and the land shall be open to you. Live and trade in it, and acquire property here.'",
      "links": "<a href='/AIV/1/23/9'>Gen. 23:9</a>; <a href='/AIV/1/47/6'>Gen. 47:6</a>",
      "comment": "An invitation to settle and prosper resonates with God’s call for His people to be distinct, yet present within the world."
    },
    {
      "pk": 1934041,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 11,
      "text": "Shechem said to Dinah’s father and brothers, 'Let me find favor in your eyes, and whatever you ask of me, I will give.'",
      "links": "<a href='/AIV/1/29/18'>Gen. 29:18</a>",
      "comment": "Shechem’s offer of extravagant gifts echoes earlier marriage negotiations among the patriarchs."
    },
    {
      "pk": 1934042,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 12,
      "text": "'Set the bride price and gift as high as you wish; I will pay whatever you demand. Only give me the young woman as my wife.'",
      "links": "<a href='/AIV/2/22/17'>Exod. 22:17</a>",
      "comment": "Shechem’s willingness to pay whatever is required demonstrates the seriousness of his intention."
    },
    {
      "pk": 1934043,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 13,
      "text": "Jacob’s sons answered Shechem and his father Hamor deceitfully, because Shechem had defiled their sister Dinah.",
      "links": "<a href='/AIV/1/27/35'>Gen. 27:35</a>",
      "comment": "This act of deception is reminiscent of earlier instances of deceit in Jacob’s family, underlining the repeated motif of the struggle between righteousness and sin."
    },
    {
      "pk": 1934044,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 14,
      "text": "They said to them, 'We cannot do this thing—to give our sister to a man who is uncircumcised, for that would be a disgrace to us.'",
      "links": "<a href='/AIV/1/17/14'>Gen. 17:14</a>; <a href='/AIV/2/12/48'>Exod. 12:48</a>",
      "comment": "Circumcision is defined as a sign of belonging to God’s covenant people, a recurring symbol pointing forward to spiritual realities in the New Testament."
    },
    {
      "pk": 1934045,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 15,
      "text": "'Only on this condition will we agree: if you will become as we are by every male among you being circumcised.'",
      "links": "<a href='/AIV/1/17/10'>Gen. 17:10</a>",
      "comment": "Physical circumcision as inclusion into God’s chosen people foreshadows spiritual inclusion, realized later in Christ (see <a href='/AIV/51/2/11'>Col. 2:11</a>)."
    },
    {
      "pk": 1934046,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 16,
      "text": "'Then we will give our daughters to you, and we will take your daughters for ourselves, and we will dwell with you and become one people.'",
      "links": "<a href='/AIV/1/28/1'>Gen. 28:1</a>; <a href='/AIV/8/13/16'>Ruth 1:16</a>",
      "comment": "The proposal for unity is founded upon acceptance of the covenant sign."
    },
    {
      "pk": 1934047,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 17,
      "text": "'But if you will not listen to us and be circumcised, then we will take our daughter and go.'",
      "links": "",
      "comment": "The ultimatum places high importance on covenant membership above all else."
    },
    {
      "pk": 1934048,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 18,
      "text": "Their words pleased Hamor and Hamor’s son Shechem.",
      "links": "",
      "comment": "The willingness to submit to the conditions shows the sincerity and commitment of Shechem’s household."
    },
    {
      "pk": 1934049,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 19,
      "text": "The young man did not delay to do this, because he delighted in Jacob’s daughter. Now he was the most honored of all his father’s house.",
      "links": "",
      "comment": "Shechem’s lack of hesitation strengthens the narrative of his genuine affection and the honor system among his people."
    },
    {
      "pk": 1934050,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 20,
      "text": "Hamor and his son Shechem went to the gate of their city and spoke to the men of the city, saying,",
      "links": "<a href='/AIV/1/23/10'>Gen. 23:10</a>",
      "comment": "City gate discussions were where official business and legal matters took place in ancient Near Eastern towns."
    },
    {
      "pk": 1934051,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 21,
      "text": "'These men are at peace with us. Let them dwell in the land and trade in it, for the land is large enough for them. We will take their daughters as wives and give them our daughters.'",
      "links": "",
      "comment": "This reiteration to the city elders underscores the proposed union and mutual benefit."
    },
    {
      "pk": 1934052,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 22,
      "text": "'But only on one condition will the men agree to live with us and become a single people: every male among us must be circumcised, just as they are.'",
      "links": "<a href='/AIV/1/17/10'>Gen. 17:10</a>",
      "comment": "The unique requirement sets this alliance apart and places the Abrahamic covenant at its center."
    },
    {
      "pk": 1934053,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 23,
      "text": "'Will not their livestock, their property, and all their animals become ours? Let’s agree with them, and they will live among us.'",
      "links": "",
      "comment": "The political and economic motivations behind the offer are exposed, revealing a flaw in the intent."
    },
    {
      "pk": 1934054,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 24,
      "text": "All the men who went out of the city gate listened to Hamor and his son Shechem, and every male was circumcised, each one who went out of the city gate.",
      "links": "",
      "comment": "The collective acceptance of circumcision demonstrates unity, albeit under deceptive circumstances."
    },
    {
      "pk": 1934055,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 25,
      "text": "On the third day, while they were in pain, two of Jacob’s sons, Simeon and Levi, Dinah’s brothers, took their swords and attacked the unsuspecting city, killing every male.",
      "links": "<a href='/AIV/1/49/5-7'>Gen. 49:5–7</a>",
      "comment": "The violence and revenge taken by Simeon and Levi carries long-term consequences—Jacob later curses their anger in his blessing (see Gen. 49). The action contrasts with the Biblical call to right justice and mercy."
    },
    {
      "pk": 1934056,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 26,
      "text": "They killed Hamor and his son Shechem with the sword and took Dinah out of Shechem’s house, and left.",
      "links": "",
      "comment": "Dinah is returned, but through tremendous violence, marking this as a tragic episode in patriarchal history."
    },
    {
      "pk": 1934057,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 27,
      "text": "Jacob’s other sons came upon the dead and plundered the city, because their sister had been defiled.",
      "links": "",
      "comment": "The plundering shifts the narrative from an act of personal vengeance to material gain, drawing parallels to later stories where greed leads to sin."
    },
    {
      "pk": 1934058,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 28,
      "text": "They took their flocks and herds and donkeys, everything in the city and in the field.",
      "links": "",
      "comment": "Complete seizure of property amplifies the consequences of unresolved justice and human sinfulness."
    },
    {
      "pk": 1934059,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 29,
      "text": "They carried off all their wealth, their children and their wives, all that was in the houses.",
      "links": "",
      "comment": "The total desolation of the city underscores the destructive effects of both personal sin and institutional vengeance."
    },
    {
      "pk": 1934060,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 30,
      "text": "Then Jacob said to Simeon and Levi, 'You have brought trouble on me by making me an object of scorn to the inhabitants of the land—the Canaanites and Perizzites. My numbers are few, and if they join forces against me and attack, I and my household will be destroyed.'",
      "links": "<a href='/AIV/1/49/5'>Gen. 49:5</a>",
      "comment": "Jacob’s response recognizes the consequences of the sons’ actions for the future of the family’s mission—that of being God’s distinct people."
    },
    {
      "pk": 1934061,
      "translation": "AIV",
      "book": 1,
      "chapter": 34,
      "verse": 31,
      "text": "But they replied, 'Should he treat our sister like a prostitute?'",
      "links": "",
      "comment": "The sons’ reply highlights their sense of justice, yet the excessive response points to the need for true reconciliation and proper justice—concepts developed through the story of redemption culminating in Christ."
    }
  ],
  "translatedAt": "2025-12-23T08:52:29.733Z"
}