{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 6,
  "verses": [
    {
      "pk": 1960001,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 1,
      "text": "When men began to multiply on the face of the earth, and daughters were born to them,",
      "links": "<a href='/AIV/1/1/28'>Gen. 1:28</a>",
      "comment": "This verse recalls God's command to 'be fruitful and multiply' in Gen. 1:28, highlighting the fulfillment of human propagation."
    },
    {
      "pk": 1960002,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 2,
      "text": "the sons of God saw that the daughters of men were beautiful, and they took wives for themselves, whomever they chose.",
      "links": "<a href='/AIV/18/1/6'>Job 1:6</a>; <a href='/AIV/19/82/6'>Ps. 82:6</a>",
      "comment": "The term 'sons of God' has been interpreted as either angelic beings or the godly line of Seth, while 'daughters of men' refers to the descendants of Cain or to humans in general. The illicit unions foreshadow coming judgment."
    },
    {
      "pk": 1960003,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 3,
      "text": "And the LORD said, 'My Spirit shall not strive with man forever, for he is flesh; his days shall be one hundred and twenty years.'",
      "links": "<a href='/AIV/19/78/39'>Ps. 78:39</a>",
      "comment": "This limitation could refer to a reduction in human lifespan or the countdown to the flood. The presence of the Spirit here connects to His role in sustaining and sanctifying creation."
    },
    {
      "pk": 1960004,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 4,
      "text": "The Nephilim were on the earth in those days—and also afterward—when the sons of God went in to the daughters of men, and they bore children to them. These were the mighty men who were of old, men of renown.",
      "links": "<a href='/AIV/4/13/33'>Num. 13:33</a>",
      "comment": "The Nephilim are shrouded in mystery; some see them as giants or legendary heroes. The text emphasizes ancient wickedness and preludes the coming judgment."
    },
    {
      "pk": 1960005,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 5,
      "text": "The LORD saw that the wickedness of man was great on the earth, and every intention of the thoughts of his heart was only evil continually.",
      "links": "<a href='/AIV/19/14/1-3'>Ps. 14:1–3</a>; <a href='/AIV/40/15/19'>Matt. 15:19</a>",
      "comment": "This verse exposes the depth of human depravity and the universal need for divine grace, a theme that will be resolved through salvation history."
    },
    {
      "pk": 1960006,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 6,
      "text": "And the LORD regretted that He had made man on the earth, and He was grieved in His heart.",
      "links": "<a href='/AIV/9/15/11'>1 Sam. 15:11</a>",
      "comment": "God's 'regret' is not a change of mind as with humans but expresses His sorrow over sin. This anthropopathism points to God's relational nature."
    },
    {
      "pk": 1960007,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 7,
      "text": "So the LORD said, 'I will wipe out man whom I have created from the face of the earth—man and animals and creeping things and birds of the heavens—for I am sorry that I have made them.'",
      "links": "<a href='/AIV/1/1/25'>Gen. 1:25</a>; <a href='/AIV/1/7/23'>Gen. 7:23</a>",
      "comment": "The upcoming judgment echoes the creation narrative, showing the seriousness of sin and God's justice."
    },
    {
      "pk": 1960008,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 8,
      "text": "But Noah found favor in the eyes of the LORD.",
      "links": "<a href='/AIV/1/19/19'>Gen. 19:19</a>; <a href='/AIV/58/11/7'>Heb. 11:7</a>",
      "comment": "Noah’s 'favor' prefigures the concept of grace, anticipating later themes of God's redemptive plan."
    },
    {
      "pk": 1960009,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 9,
      "text": "These are the generations of Noah: Noah was a righteous man, blameless among his generation. Noah walked with God.",
      "links": "<a href='/AIV/1/5/22'>Gen. 5:22</a>; <a href='/AIV/14/6/16'>2 Chron. 6:16</a>",
      "comment": "Noah’s righteousness sets him apart for salvation, showing that faith and obedience draw people into special relationship and mission."
    },
    {
      "pk": 1960010,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 10,
      "text": "And Noah fathered three sons: Shem, Ham, and Japheth.",
      "links": "<a href='/AIV/1/5/32'>Gen. 5:32</a>",
      "comment": "Noah’s sons are introduced as pivotal for the future of all humanity following the flood."
    },
    {
      "pk": 1960011,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 11,
      "text": "Now the earth was corrupt before God, and the earth was filled with violence.",
      "links": "<a href='/AIV/19/53/1'>Ps. 53:1</a>",
      "comment": "The intensification of human corruption signals the necessity of divine intervention for justice and restoration."
    },
    {
      "pk": 1960012,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 12,
      "text": "And God saw the earth, and behold, it was corrupt; for all flesh had corrupted their way upon the earth.",
      "links": "<a href='/AIV/1/1/31'>Gen. 1:31</a>",
      "comment": "The term 'all flesh' encompasses humanity and animals, stressing comprehensive moral disorder compared to the initial pronouncement of creation’s goodness."
    },
    {
      "pk": 1960013,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 13,
      "text": "Then God said to Noah, 'The end of all flesh has come before Me, for the earth is filled with violence through them; and behold, I will destroy them with the earth.'",
      "links": "<a href='/AIV/1/18/17'>Gen. 18:17</a>; <a href='/AIV/61/2/5'>2 Pet. 2:5</a>",
      "comment": "God's verdict and communication with Noah emphasize both divine justice and mercy—preserving the righteous and warning of coming judgment."
    },
    {
      "pk": 1960014,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 14,
      "text": "'Make for yourself an ark of gopher wood. Make rooms in the ark, and cover it inside and out with pitch.'",
      "links": "<a href='/AIV/1/7/1'>Gen. 7:1</a>",
      "comment": "The ark’s careful construction alludes to later sacred architecture. Covering with pitch foreshadows sacramental imagery of cleansing and protection."
    },
    {
      "pk": 1960015,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 15,
      "text": "And this is how you shall make it: the length of the ark shall be three hundred cubits, its width fifty cubits, and its height thirty cubits.",
      "links": "<a href='/AIV/2/25/10'>Exod. 25:10</a>",
      "comment": "Precise measurements recall the exactness required of the tabernacle and later temples, symbolizing order and obedience to divine instruction."
    },
    {
      "pk": 1960016,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 16,
      "text": "'You shall make a roof for the ark, and finish it to a cubit above. Set the door of the ark in its side. You shall make it with lower, second, and third decks.'",
      "links": "<a href='/AIV/1/8/6'>Gen. 8:6</a>",
      "comment": "The single door hints at the one path to safety, prefiguring later images of a singular way to salvation (<a href='/AIV/43/10/9'>John 10:9</a>)."
    },
    {
      "pk": 1960017,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 17,
      "text": "'For behold, I will bring a flood of waters upon the earth to destroy all flesh under heaven in which there is the breath of life; everything that is on the earth shall die.'",
      "links": "<a href='/AIV/1/7/4'>Gen. 7:4</a>",
      "comment": "The flood’s comprehensive nature displays divine power and sovereignty, but also sets the stage for a new beginning."
    },
    {
      "pk": 1960018,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 18,
      "text": "'But I will establish My covenant with you, and you shall come into the ark—you, your sons, your wife, and your sons’ wives with you.'",
      "links": "<a href='/AIV/1/9/9-17'>Gen. 9:9–17</a>",
      "comment": "This is the first mention of covenant in Scripture, forming a foundation for the unfolding of salvation history and prefiguring later sacraments as visible signs of divine favor."
    },
    {
      "pk": 1960019,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 19,
      "text": "'And of every living thing of all flesh, you shall bring two of every sort into the ark, to keep them alive with you; they shall be male and female.'",
      "links": "<a href='/AIV/1/7/15'>Gen. 7:15</a>",
      "comment": "The preservation of animals reveals God’s care for all creation and His directive for stewardship and order."
    },
    {
      "pk": 1960020,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 20,
      "text": "Of the birds according to their kinds, of the animals according to their kinds, of every creeping thing of the ground according to its kind, two of every sort shall come to you, to keep them alive.",
      "links": "<a href='/AIV/1/1/21'>Gen. 1:21</a>",
      "comment": "The repetition of 'according to their kinds' echoes creation, underscoring order and divine providence."
    },
    {
      "pk": 1960021,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 21,
      "text": "'Take with you every kind of food that is eaten and gather it, to keep as food for you and for them.'",
      "links": "<a href='/AIV/1/41/35'>Gen. 41:35</a>",
      "comment": "Provision for food reveals the practical side of God’s commands—safeguarding life amid judgment."
    },
    {
      "pk": 1960022,
      "translation": "AIV",
      "book": 1,
      "chapter": 6,
      "verse": 22,
      "text": "Noah did all this; he did everything that God commanded him.",
      "links": "<a href='/AIV/1/7/5'>Gen. 7:5</a>; <a href='/AIV/58/11/7'>Heb. 11:7</a>",
      "comment": "Noah’s obedience is portrayed as complete, grounding the pattern of salvation by faith expressed through active trust in divine instruction. His faithfulness sets a precedent for future generations called to hear God’s word and respond with action."
    }
  ],
  "translatedAt": "2025-12-23T08:37:07.944Z"
}