{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 10,
  "verses": [
    {
      "pk": 1001000,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 1,
      "text": "These are the generations of the sons of Noah: Shem, Ham, and Japheth. Sons were born to them after the flood.",
      "links": "<a href='/AIV/1/9/18'>Gen. 9:18–19</a>; <a href='/AIV/13/1/4'>1 Chron. 1:4</a>",
      "comment": "Genesis 10 introduces the Table of Nations, laying out the descendants of Noah's sons as the beginnings of the peoples of the earth. This genealogy demonstrates the unity of human origins, an idea later reinforced in Acts 17:26."
    },
    {
      "pk": 1001001,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 2,
      "text": "The sons of Japheth: Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras.",
      "links": "<a href='/AIV/26/38/2'>Ezek. 38:2</a>; <a href='/AIV/13/1/5'>1 Chron. 1:5</a>",
      "comment": "Japheth’s line is often understood as the ancestors of many Gentile nations. There are later prophetic passages referencing some of these names in Ezekiel 38–39."
    },
    {
      "pk": 1001002,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 3,
      "text": "The sons of Gomer: Ashkenaz, Riphath, and Togarmah.",
      "links": "<a href='/AIV/26/27/14'>Ezek. 27:14</a>",
      "comment": "These names tie to later tribal nations in the north/Asia Minor, showing the spread of peoples over vast areas."
    },
    {
      "pk": 1001003,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 4,
      "text": "The sons of Javan: Elishah, Tarshish, Kittim, and Dodanim.",
      "links": "<a href='/AIV/24/10/9'>Jer. 10:9</a>; <a href='/AIV/13/1/7'>1 Chron. 1:7</a>",
      "comment": "Javan is associated with the Greeks; Tarshish and Kittim are often identified with Mediterranean regions, seen in other Old Testament prophecies."
    },
    {
      "pk": 1001004,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 5,
      "text": "From these the coastland peoples spread out in their lands, each according to his language, by their clans, in their nations.",
      "links": "<a href='/AIV/1/11/9'>Gen. 11:9</a>",
      "comment": "This anticipates the confusion of languages at Babel (ch. 11). The mention of 'languages' hints at an ordered diversity."
    },
    {
      "pk": 1001005,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 6,
      "text": "The sons of Ham: Cush, Egypt, Put, and Canaan.",
      "links": "<a href='/AIV/1/9/22'>Gen. 9:22</a>; <a href='/AIV/13/1/8'>1 Chron. 1:8</a>",
      "comment": "Ham’s descendants settle parts of Africa and the Middle East, including the land later judged and promised to Abraham’s line."
    },
    {
      "pk": 1001006,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 7,
      "text": "The sons of Cush: Seba, Havilah, Sabtah, Raamah, and Sabteca. The sons of Raamah: Sheba and Dedan.",
      "links": "<a href='/AIV/13/1/9'>1 Chron. 1:9</a>",
      "comment": "Sheba and Dedan appear in later scripture as wealthy trade centers, suggesting the blessings and advancements of some lines from Ham."
    },
    {
      "pk": 1001007,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 8,
      "text": "Cush fathered Nimrod; he was the first on earth to be a mighty man.",
      "links": "<a href='/AIV/1/10/9'>Gen. 10:9</a>",
      "comment": "Nimrod’s reputation as a 'mighty man' hints at the rise of kingship and might, which will play into biblical themes of authority and leadership."
    },
    {
      "pk": 1001008,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 9,
      "text": "He was a mighty hunter before the LORD. Therefore it is said, 'Like Nimrod, a mighty hunter before the LORD.'",
      "links": "<a href='/AIV/1/6/4'>Gen. 6:4</a>",
      "comment": "This phrase expresses both his prowess and legendary status. The text stresses how human strength is always seen in relation to God's presence."
    },
    {
      "pk": 1001009,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 10,
      "text": "The beginning of his kingdom was Babel, Erech, Accad, and Calneh, in the land of Shinar.",
      "links": "<a href='/AIV/1/11/1'>Gen. 11:1–9</a>",
      "comment": "Nimrod becomes associated with Babel, later a symbol of human pride and confusion. (See spiritual backdrop for Babylon as opposition to God's order.)"
    },
    {
      "pk": 1001010,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 11,
      "text": "From that land he went into Assyria and built Nineveh, Rehoboth-Ir, Calah,",
      "links": "<a href='/AIV/32/1/2'>Jonah 1:2</a>",
      "comment": "Nineveh, later a subject of divine judgment and mercy (see Jonah), starts here, tying the realities of power and repentance in biblical history."
    },
    {
      "pk": 1001011,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 12,
      "text": "and Resen between Nineveh and Calah; that is the great city.",
      "links": "<a href='/AIV/32/4/11'>Jonah 4:11</a>",
      "comment": "The mention of mighty cities points to early urban development. Cities often play a key role both literally and spiritually as places of challenge or judgment."
    },
    {
      "pk": 1001012,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 13,
      "text": "Egypt fathered Ludim, Anamim, Lehabim, Naphtuhim,",
      "links": "<a href='/AIV/13/1/11'>1 Chron. 1:11</a>",
      "comment": "These are tribal founders in North Africa/Levant, showing the spread of humanity to different places."
    },
    {
      "pk": 1001013,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 14,
      "text": "Pathrusim, Casluhim (from whom the Philistines came), and Caphtorim.",
      "links": "<a href='/AIV/24/47/4'>Jer. 47:4</a>; <a href='/AIV/05/2/23'>Deut. 2:23</a>",
      "comment": "The Philistines, persistent enemies in Israel’s history, come from Ham’s line, reflecting spiritual struggle in salvation history."
    },
    {
      "pk": 1001014,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 15,
      "text": "Canaan fathered Sidon his firstborn, and Heth,",
      "links": "<a href='/AIV/1/15/19'>Gen. 15:19–21</a>",
      "comment": "Sidon and Heth found Canaanite nations, foreshadowing later events concerning Israel’s inheritance and spiritual battles."
    },
    {
      "pk": 1001015,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 16,
      "text": "and the Jebusites, Amorites, Girgashites,",
      "links": "<a href='/AIV/1/15/21'>Gen. 15:21</a>",
      "comment": "These names continue listing the adversarial peoples of Canaan, showing how salvation unfolds amidst opposition."
    },
    {
      "pk": 1001016,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 17,
      "text": "and the Hivites, Arkites, Sinites,",
      "links": "<a href='/AIV/13/1/15'>1 Chron. 1:15</a>",
      "comment": "Israel’s eventual victories and struggles are spiritually rooted in these narrative details, often interpreted as types of spiritual warfare."
    },
    {
      "pk": 1001017,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 18,
      "text": "and the Arvadites, Zemarites, and Hamathites. Afterward the clans of the Canaanites were dispersed.",
      "links": "<a href='/AIV/1/13/17'>Gen. 13:17</a>",
      "comment": "The dispersal shows the providence of God setting borders and nations – this theme recalls Acts 17:26, God’s sovereignty over all peoples."
    },
    {
      "pk": 1001018,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 19,
      "text": "And the territory of the Canaanites extended from Sidon, toward Gerar, as far as Gaza, and in direction of Sodom, Gomorrah, Admah, and Zeboiim, as far as Lasha.",
      "links": "<a href='/AIV/1/19/24'>Gen. 19:24–25</a>",
      "comment": "The Canaanite boundaries chart future sites of judgment and redemption, showing how geography and history intertwine in God’s sovereign plan."
    },
    {
      "pk": 1001019,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 20,
      "text": "These are the sons of Ham, according to their clans, languages, lands, and nations.",
      "links": "<a href='/AIV/1/10/5'>Gen. 10:5</a>",
      "comment": "Each line of descent is emphasized by physical and linguistic separation, showing the reality and dignity of diversity within providence."
    },
    {
      "pk": 1001020,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 21,
      "text": "Children were born also to Shem, the elder brother of Japheth, the father of all the children of Eber.",
      "links": "<a href='/AIV/13/1/17'>1 Chron. 1:17</a>; <a href='/AIV/1/11/16'>Gen. 11:16</a>",
      "comment": "Eber, an ancestor of the Hebrews, becomes a key figure in redemptive history, setting the stage for the line through which the Messiah would come."
    },
    {
      "pk": 1001021,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 22,
      "text": "The sons of Shem: Elam, Asshur, Arpachshad, Lud, and Aram.",
      "links": "<a href='/AIV/13/1/17'>1 Chron. 1:17</a>; <a href='/AIV/1/11/10'>Gen. 11:10</a>",
      "comment": "Shem’s descendants form the line leading eventually to Abraham, David, and Jesus (see Luke 3:36), connecting these genealogies to salvation history."
    },
    {
      "pk": 1001022,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 23,
      "text": "The sons of Aram: Uz, Hul, Gether, and Mash.",
      "links": "<a href='/AIV/18/1/1'>Job 1:1</a>; <a href='/AIV/13/1/17'>1 Chron. 1:17</a>",
      "comment": "Uz is later identified with Job’s homeland, emphasizing the reach of God’s providence beyond Israel."
    },
    {
      "pk": 1001023,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 24,
      "text": "Arpachshad fathered Shelah; Shelah fathered Eber.",
      "links": "<a href='/AIV/1/11/14'>Gen. 11:14–16</a>",
      "comment": "The line moves toward the Hebrews, underscoring God’s stewardship of the promise through specific generations."
    },
    {
      "pk": 1001024,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 25,
      "text": "To Eber were born two sons: the name of one was Peleg, because in his days the earth was divided, and his brother’s name was Joktan.",
      "links": "<a href='/AIV/1/11/16'>Gen. 11:16'>",
      "comment": "Peleg’s name means 'division,' likely alluding to the dispersion at Babel (see Gen. 11:7–9), while the line of Joktan multiplies in Arabia."
    },
    {
      "pk": 1001025,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 26,
      "text": "Joktan fathered Almodad, Sheleph, Hazarmaveth, Jerah,",
      "links": "<a href='/AIV/13/1/20'>1 Chron. 1:20</a>",
      "comment": "This section builds the line of peoples populating southern Arabia, indicating the expansion from Shem’s line."
    },
    {
      "pk": 1001026,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 27,
      "text": "Hadoram, Uzal, Diklah,",
      "links": "<a href='/AIV/13/1/21'>1 Chron. 1:21</a>",
      "comment": "Another set of names, some of which are echoed in ancient Arabian settlements and cities."
    },
    {
      "pk": 1001027,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 28,
      "text": "Obal, Abimael, Sheba,",
      "links": "<a href='/AIV/13/1/22'>1 Chron. 1:22</a>",
      "comment": "Sheba is notable as a place of later wealth and wisdom (Matthew 12:42), connecting these genealogies to Christ’s wider mission."
    },
    {
      "pk": 1001028,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 29,
      "text": "Ophir, Havilah, and Jobab. All these were the sons of Joktan.",
      "links": "<a href='/AIV/13/1/23'>1 Chron. 1:23</a>",
      "comment": "Ophir, famed for gold (1 Kings 10:11), links earthly riches to the spiritual search for wisdom and fulfillment."
    },
    {
      "pk": 1001029,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 30,
      "text": "Their territory extended from Mesha in the direction of Sephar, the hill country of the east.",
      "links": "<a href='/AIV/1/25/6'>Gen. 25:6</a>",
      "comment": "Geographical references highlight the dispersion of peoples, underscoring the vastness and unity of God’s created family."
    },
    {
      "pk": 1001030,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 31,
      "text": "These are the sons of Shem, by their clans, languages, lands, and nations.",
      "links": "<a href='/AIV/1/10/5'>Gen. 10:5</a>",
      "comment": "Similar wording to previous clan summaries — emphasizing order, providence, and the dignity of family within God’s design."
    },
    {
      "pk": 1001031,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 32,
      "text": "These are the clans of the sons of Noah, according to their genealogies, in their nations. From these the nations spread out on the earth after the flood.",
      "links": "<a href='/AIV/1/9/19'>Gen. 9:19</a>; <a href='/AIV/44/17/26'>Acts 17:26</a>",
      "comment": "Genesis 10 closes by summarizing all humanity’s dispersion from Noah. The spiritual implication includes the unity of all mankind under one Creator with an ordered plan for redemption through the chosen line, prefiguring the gathering of all nations in Christ (Revelation 7:9)."
    }
  ],
  "translatedAt": "2025-12-23T08:39:06.828Z"
}