{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 50,
  "verses": [
    {
      "pk": 1005001,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 1,
      "text": "Then Joseph fell upon his father’s face, wept over him, and kissed him.",
      "links": "<a href='/AIV/1/46/4'>Gen. 46:4</a>; <a href='/AIV/1/49/33'>Gen. 49:33</a>",
      "comment": "Joseph’s actions demonstrate deep filial love and respect, reflecting the biblical emphasis on honoring one's father. Compare to the reverence Jesus shows to his Father in John 17:1."
    },
    {
      "pk": 1005002,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 2,
      "text": "Joseph commanded his servants, the physicians, to embalm his father. So the physicians embalmed Israel.",
      "links": "<a href='/AIV/1/47/29-30'>Gen. 47:29-30</a>; <a href='/AIV/1/50/26'>Gen. 50:26</a>",
      "comment": "The process of embalming is significant, emphasizing care for the body after death—a theme that echoes the later reverence for the body in burial customs. See how the body of Jesus is treated in John 19:40."
    },
    {
      "pk": 1005003,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 3,
      "text": "They spent forty days embalmimg him, for such are the days required for embalming. The Egyptians mourned for him seventy days.",
      "links": "<a href='/AIV/4/20/29'>Num. 20:29</a>",
      "comment": "Mourning periods were substantial, showing respect for the dead and communal grieving. Forty is a key biblical number indicating completeness or preparation (see Exodus 24:18, Matt. 4:2)."
    },
    {
      "pk": 1005004,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 4,
      "text": "When the days of mourning for him were past, Joseph spoke to Pharaoh’s household, saying, \"If I have found favor in your eyes, please speak to Pharaoh for me, saying:",
      "links": "<a href='/AIV/1/47/29-30'>Gen. 47:29-30</a>",
      "comment": "Joseph’s humility and protocol demonstrate respect for authority—a virtue held high throughout scripture (Rom. 13:1)."
    },
    {
      "pk": 1005005,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 5,
      "text": "\"My father made me swear, saying, ‘I am about to die; in my tomb that I hewed out for myself in the land of Canaan, there you shall bury me.’ Now, please let me go up and bury my father, and I will return.\"",
      "links": "<a href='/AIV/1/47/30'>Gen. 47:30</a>; <a href='/AIV/1/23/20'>Gen. 23:20</a>",
      "comment": "Jacob’s insistence on burial in Canaan points to faith in God’s promise regarding the land. Swearing an oath here underlines the importance of fulfillment—compare to Matt. 5:33-37."
    },
    {
      "pk": 1005006,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 6,
      "text": "Pharaoh answered, \"Go up and bury your father, as he made you swear.\"",
      "links": "<a href='/AIV/1/47/30'>Gen. 47:30</a>",
      "comment": "Pharaoh’s respect allows Joseph to fulfill his filial obligation. This harmony between foreign authorities and Israel is a theme seen later when Gentiles honor key figures (see Luke 7:9-10, Acts 10:1-2)."
    },
    {
      "pk": 1005007,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 7,
      "text": "So Joseph went up to bury his father. All the servants of Pharaoh, the elders of his household, and all the elders of the land of Egypt went with him.",
      "links": "<a href='/AIV/1/50/6'>Gen. 50:6</a>",
      "comment": "The presence of Egyptian dignitaries signals the esteem for Jacob and Joseph and indicates unity—even across nations. Compare the respect shown to Moses in Exodus 12:31-32."
    },
    {
      "pk": 1005008,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 8,
      "text": "All the household of Joseph, his brothers, and his father’s household went up. Only their children, their flocks, and their herds were left in the land of Goshen.",
      "links": "<a href='/AIV/1/45/10'>Gen. 45:10</a>",
      "comment": "The text emphasizes the unity of the family, with all adults present, reminiscent of pilgrimages and gatherings for worship seen later (Exodus 23:17)."
    },
    {
      "pk": 1005009,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 9,
      "text": "There went up with him both chariots and horsemen; it was a very great company.",
      "links": "<a href='/AIV/2/14/7'>Exod. 14:7</a>",
      "comment": "A procession of grandeur; the respect paid by Egypt is notable, pointing toward the dignity accorded to the patriarchs—a link to reverence for saints and holy persons in the faith (Hebrews 11:21)."
    },
    {
      "pk": 1005010,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 10,
      "text": "When they came to the threshing floor of Atad, which is beyond the Jordan, they mourned there with a great and very deep lamentation. Joseph made mourning for his father seven days.",
      "links": "<a href='/AIV/1/50/3'>Gen. 50:3</a>",
      "comment": "Seven days of mourning is symbolic of spiritual perfection and completion. Ritual mourning often precedes restoration—see Ezek. 3:15."
    },
    {
      "pk": 1005011,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 11,
      "text": "When the inhabitants of the land, the Canaanites, saw the mourning at the threshing floor of Atad, they said, \"This is a grievous mourning by the Egyptians.\" Therefore, the place was called Abel-mizraim, which is beyond the Jordan.",
      "links": "<a href='/AIV/1/50/10'>Gen. 50:10</a>",
      "comment": "The naming of locations after events creates a perpetual memorial. Abel-mizraim means 'meadow of Egypt's mourning', echoing how sacred spaces are set apart through significant acts (Gen. 28:19; Joshua 4:9)."
    },
    {
      "pk": 1005012,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 12,
      "text": "So Jacob’s sons did for him just as he had commanded them.",
      "links": "<a href='/AIV/1/49/29-32'>Gen. 49:29-32</a>",
      "comment": "Obedience to their father's command shows reverence for tradition and authority, a foundation for the later practice of honoring parental and spiritual leaders (Ephesians 6:1-3)."
    },
    {
      "pk": 1005013,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 13,
      "text": "His sons carried him to the land of Canaan, and buried him in the cave of the field at Machpelah, the field Abraham bought with Ephron the Hittite, to be his burial place, before Mamre.",
      "links": "<a href='/AIV/1/23/17-20'>Gen. 23:17-20</a>; <a href='/AIV/1/25/9'>Gen. 25:9</a>",
      "comment": "The burial cave unites three generations in one place—sign of family continuity. This prefigures the concept of sacred burial (John 19:41)."
    },
    {
      "pk": 1005014,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 14,
      "text": "After burying his father, Joseph returned to Egypt, he and his brothers and all who went up with him to bury his father.",
      "links": "<a href='/AIV/1/50/7'>Gen. 50:7</a>; <a href='/AIV/1/46/5-7'>Gen. 46:5-7</a>",
      "comment": "The return to Egypt fulfills Joseph’s responsibility. Their allegiance is still to Egypt until future redemption—a subtle foreshadowing of waiting for final deliverance (Hebrews 11:22)."
    },
    {
      "pk": 1005015,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 15,
      "text": "When Joseph’s brothers saw that their father was dead, they said, \"What if Joseph bears a grudge against us and repays us for all the evil we did to him?\"",
      "links": "<a href='/AIV/1/37/18-28'>Gen. 37:18-28</a>",
      "comment": "Sin harbors fear—Joseph’s brothers recall their grave wrongdoing, echoing themes of guilt and forgiveness central to the gospel (Matt. 6:12; Luke 15:21)."
    },
    {
      "pk": 1005016,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 16,
      "text": "So they sent word to Joseph, saying, \"Your father gave this command before he died:",
      "links": "<a href='/AIV/1/49/33'>Gen. 49:33</a>",
      "comment": "The appeal to authority and mediation is significant, hinting at priestly intercession as later seen in the faith (see Hebrews 7:25)."
    },
    {
      "pk": 1005017,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 17,
      "text": "\"Say to Joseph, ‘Please forgive the offense of your brothers and their sin, because they did evil to you.’ Now, please forgive the offense of your father's servants.\" Joseph wept when they spoke to him.",
      "links": "<a href='/AIV/1/45/5'>Gen. 45:5</a>; <a href='/AIV/1/37/28'>Gen. 37:28</a>",
      "comment": "Forgiveness and mercy are central. Joseph’s tears evoke the heart of Christ who forgives even those who wrong him (Luke 23:34; John 11:35)."
    },
    {
      "pk": 1005018,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 18,
      "text": "His brothers also came and fell down before him and said, \"Behold, we are your servants.\"",
      "links": "<a href='/AIV/1/37/7-9'>Gen. 37:7-9</a>",
      "comment": "The prophecy of Joseph’s dreams is fulfilled; brothers bow before him, foreshadowing how homage is rightly given to those who carry out God’s will (Phil. 2:10)."
    },
    {
      "pk": 1005019,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 19,
      "text": "But Joseph said to them, \"Do not be afraid, for am I in the place of God?\"",
      "links": "<a href='/AIV/1/45/7'>Gen. 45:7</a>; <a href='/AIV/1/30/2'>Gen. 30:2</a>",
      "comment": "Joseph humbly refuses to usurp God's place as judge—a reminder that ultimate judgment belongs only to God (Romans 12:19)."
    },
    {
      "pk": 1005020,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 20,
      "text": "You meant evil against me, but God meant it for good, to bring it about that many people should be kept alive, as they are today.",
      "links": "<a href='/AIV/1/45/5-8'>Gen. 45:5-8</a>; <a href='/AIV/45/8/28'>Rom. 8:28</a>",
      "comment": "Here, Joseph articulates providence and redemptive suffering—what men intend for harm, God works for good, foreshadowing the cross (Acts 2:23-24)."
    },
    {
      "pk": 1005021,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 21,
      "text": "So do not fear; I will provide for you and your little ones.\" Thus he comforted them and spoke kindly to them.",
      "links": "<a href='/AIV/1/45/11'>Gen. 45:11</a>",
      "comment": "Joseph’s assurance prefigures Christ’s promise of care and spiritual protection for his disciples and those who seek him (John 10:11)."
    },
    {
      "pk": 1005022,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 22,
      "text": "Joseph remained in Egypt, he and his father’s household. Joseph lived one hundred and ten years.",
      "links": "<a href='/AIV/1/47/28'>Gen. 47:28</a>",
      "comment": "Joseph’s long life speaks to God’s blessing, reminiscent of promises for those who trust in God (Psalm 91:16)."
    },
    {
      "pk": 1005023,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 23,
      "text": "Joseph saw Ephraim’s children to the third generation. Also, the children of Machir, the son of Manasseh, were born on Joseph’s knees.",
      "links": "<a href='/AIV/1/48/1'>Gen. 48:1</a>; <a href='/AIV/1/30/3'>Gen. 30:3</a>",
      "comment": "The mention of children on Joseph’s knees is a sign of adoption and blessing—a motif that reappears in the laying on of hands and familial spiritual transmission (Mark 10:16)."
    },
    {
      "pk": 1005024,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 24,
      "text": "And Joseph said to his brothers, \"I am about to die, but God will surely visit you and bring you up out of this land to the land that he swore to Abraham, to Isaac, and to Jacob.\"",
      "links": "<a href='/AIV/1/15/14'>Gen. 15:14</a>; <a href='/AIV/2/3/16-17'>Exod. 3:16-17</a>",
      "comment": "Joseph’s prophecy of ‘God visiting’ the people points ahead to Exodus and to the ultimate divine visitation in Christ (Luke 1:68, 1 Peter 2:12)."
    },
    {
      "pk": 1005025,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 25,
      "text": "So Joseph made the sons of Israel swear, saying, \"God will surely visit you, and you shall carry my bones from here.\"",
      "links": "<a href='/AIV/2/13/19'>Exod. 13:19</a>; <a href='/AIV/6/24/32'>Josh. 24:32</a>",
      "comment": "The swearing of an oath and concern for physical remains foreshadows the reverence for relics and continuity of faith through physical acts (Hebrews 11:22), drawing spiritual significance from tangible objects."
    },
    {
      "pk": 1005026,
      "translation": "AIV",
      "book": 1,
      "chapter": 50,
      "verse": 26,
      "text": "So Joseph died, being one hundred and ten years old. They embalmed him, and he was placed in a coffin in Egypt.",
      "links": "<a href='/AIV/2/13/19'>Exod. 13:19</a>",
      "comment": "Joseph’s embalmed body remains in Egypt, awaiting future fulfillment—symbolic of patient hope in resurrection. Compare to the Christian hope in bodily resurrection and the importance of respectful burial (1 Cor. 15:42-44)."
    }
  ],
  "translatedAt": "2025-12-23T09:01:39.211Z"
}