{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 4,
  "verses": [
    {
      "pk": 1040001,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 1,
      "text": "Now Adam knew his wife Eve, and she became pregnant and gave birth to Cain. She said, \"I have gotten a man with the help of the LORD.\"",
      "links": "<a href='/AIV/1/3/16'>Gen. 3:16</a>; <a href='/AIV/1/4/25'>Gen. 4:25</a>",
      "comment": "The phrase \"knew his wife\" is a Hebrew idiom for marital relations. Eve's statement acknowledges the LORD's involvement in the gift of new life. Some manuscripts read \"with the help of the LORD\" as implying God's cooperation in procreation."
    },
    {
      "pk": 1040002,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 2,
      "text": "Again, she gave birth to his brother Abel. Now Abel was a keeper of sheep, but Cain was a worker of the ground.",
      "links": "<a href='/AIV/1/4/25'>Gen. 4:25</a>; <a href='/AIV/1/46/32'>Gen. 46:32</a>",
      "comment": "The occupations of Abel and Cain prefigure later biblical themes: shepherds often have special favor, as seen in figures like David (1 Sam. 16:11) and ultimately in Christ (John 10:11)."
    },
    {
      "pk": 1040003,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 3,
      "text": "In the course of time, Cain brought an offering to the LORD from the fruit of the ground.",
      "links": "<a href='/AIV/3/2/12'>Lev. 2:12</a>; <a href='/AIV/58/11/4'>Heb. 11:4</a>",
      "comment": "The first mention of sacrifice in Scripture. The practice of offering the fruits of one’s labor to God is foundational for later worship. See Heb. 11:4 for a New Testament reflection."
    },
    {
      "pk": 1040004,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 4,
      "text": "And Abel also brought an offering, from the firstborn of his flock and from their fat portions. And the LORD looked with favor on Abel and his offering,",
      "links": "<a href='/AIV/3/3/16'>Lev. 3:16</a>; <a href='/AIV/20/21/27'>Prov. 21:27</a>; <a href='/AIV/58/11/4'>Heb. 11:4</a>",
      "comment": "Abel brings the best, the 'firstborn and their fat portions,' which prefigures the biblical idea of giving God our first and best (see Ex. 13:2; Lev. 3:16). Abel’s faith is highlighted in Heb. 11:4."
    },
    {
      "pk": 1040005,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 5,
      "text": "but on Cain and his offering he did not look with favor. So Cain became very angry, and his face fell.",
      "links": "<a href='/AIV/1/4/7'>Gen. 4:7</a>; <a href='/AIV/58/11/4'>Heb. 11:4</a>",
      "comment": "Divine acceptance is connected not just to the offering, but the heart behind it. This theme runs throughout Scripture (cf. 1 Sam. 16:7; Matt. 5:23–24)."
    },
    {
      "pk": 1040006,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 6,
      "text": "The LORD said to Cain, \"Why are you angry, and why has your face fallen?\"",
      "links": "<a href='/AIV/1/4/5'>Gen. 4:5</a>",
      "comment": "God’s inquiry reflects His desire for repentance and restoration. God pursues the sinner—foreshadowing Christ’s seeking the lost (Luke 19:10)."
    },
    {
      "pk": 1040007,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 7,
      "text": "\"If you do well, will you not be accepted? And if you do not do well, sin is crouching at the door. Its desire is for you, but you must rule over it.\"",
      "links": "<a href='/AIV/1/3/16'>Gen. 3:16</a>; <a href='/AIV/45/6/12'>Rom. 6:12</a>",
      "comment": "The struggle with sin begins here. Sin is personified as something lying in wait, a recurring theme (Rom. 6:12). God's call to 'rule over it' anticipates the New Testament call to self-mastery and virtue."
    },
    {
      "pk": 1040008,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 8,
      "text": "Cain said to Abel his brother, \"Let us go out to the field.\" And while they were in the field, Cain rose up against his brother Abel and killed him.",
      "links": "<a href='/AIV/62/3/12'>1 John 3:12</a>; <a href='/AIV/40/23/35'>Matt. 23:35</a>",
      "comment": "The first murder, showing the rapid spread of sin (Rom. 5:12). Abel is later called righteous (Heb. 11:4) and a type of the innocent sufferer—a theme fulfilled in Christ (Heb. 12:24)."
    },
    {
      "pk": 1040009,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 9,
      "text": "Then the LORD said to Cain, \"Where is Abel your brother?\" He said, \"I do not know; am I my brother's keeper?\"",
      "links": "<a href='/AIV/1/3/9'>Gen. 3:9</a>; <a href='/AIV/40/22/39'>Matt. 22:39</a>",
      "comment": "Like Adam, Cain tries to deflect responsibility. This highlights the call to care for others—a principle foundational to Christian ethics (Luke 10:29-37)."
    },
    {
      "pk": 1040010,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 10,
      "text": "And the LORD said, \"What have you done? The voice of your brother’s blood is crying to me from the ground.\"",
      "links": "<a href='/AIV/58/12/24'>Heb. 12:24</a>; <a href='/AIV/19/9/12'>Ps. 9:12</a>",
      "comment": "The motif of blood crying out is picked up in Hebrews 12:24, where Christ's blood \"speaks a better word\" than Abel’s—showing both judgment and mercy."
    },
    {
      "pk": 1040011,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 11,
      "text": "And now you are cursed from the ground, which has opened its mouth to receive your brother’s blood from your hand.",
      "links": "<a href='/AIV/1/3/17'>Gen. 3:17</a>; <a href='/AIV/40/23/35'>Matt. 23:35</a>",
      "comment": "For the first time, the ground itself is said to participate in the curse, deepening the consequences of sin in creation (Rom. 8:20–22)."
    },
    {
      "pk": 1040012,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 12,
      "text": "When you work the ground, it will no longer yield its strength to you. You shall be a fugitive and a wanderer on the earth.\"",
      "links": "<a href='/AIV/19/107/17'>Ps. 107:17</a>",
      "comment": "Cain’s punishment is both physical and relational: alienation from the land and from community, paralleling deeper spiritual isolation."
    },
    {
      "pk": 1040013,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 13,
      "text": "Cain said to the LORD, \"My punishment is greater than I can bear.",
      "links": "<a href='/AIV/19/38/4'>Ps. 38:4</a>",
      "comment": "Cain’s lament is ambiguous; it reflects remorse for consequences, but not repentance for sin—a distinction later highlighted by Paul (2 Cor. 7:10)."
    },
    {
      "pk": 1040014,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 14,
      "text": "Look, you have driven me away today from the face of the ground, and from your face I shall be hidden. I will be a fugitive and a wanderer on the earth, and whoever finds me will kill me.\"",
      "links": "<a href='/AIV/19/51/11'>Ps. 51:11</a>",
      "comment": "Cain fears separation from God’s presence. The concern for being killed hints at an early sense of justice and retribution in human society."
    },
    {
      "pk": 1040015,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 15,
      "text": "But the LORD said to him, \"Not so! If anyone kills Cain, vengeance will be taken on him seven times.\" And the LORD put a mark on Cain, so that anyone who found him would not kill him.",
      "links": "<a href='/AIV/3/26/28'>Lev. 26:28</a>; <a href='/AIV/19/94/1'>Ps. 94:1</a>",
      "comment": "God mitigates the punishment with mercy, protecting even the sinner. The 'mark' is unspecified, but serves as both a sign of protection and of warning—a pattern seen in the sacraments which provide grace and signify covenant."
    },
    {
      "pk": 1040016,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 16,
      "text": "Then Cain went away from the presence of the LORD and settled in the land of Nod, east of Eden.",
      "links": "<a href='/AIV/1/3/24'>Gen. 3:24</a>",
      "comment": "Leaving God's presence is the ultimate consequence of sin, foreshadowing themes of exile and the hope of return and restoration in the future."
    },
    {
      "pk": 1040017,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 17,
      "text": "Cain knew his wife, and she conceived and bore Enoch. Cain was building a city, and he named the city after his son, Enoch.",
      "links": "<a href='/AIV/1/5/18'>Gen. 5:18</a>",
      "comment": "Even after sin and exile, humans continue to create and build, reflecting the image of God and the persistence of human society beyond the fall."
    },
    {
      "pk": 1040018,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 18,
      "text": "To Enoch was born Irad. And Irad fathered Mehujael, Mehujael fathered Methushael, and Methushael fathered Lamech.",
      "links": "<a href='/AIV/1/5/25'>Gen. 5:25</a>",
      "comment": "A genealogy is presented, marking the development of human history, and the continuity of life despite sin."
    },
    {
      "pk": 1040019,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 19,
      "text": "Lamech took two wives. The name of one was Adah, and the name of the other was Zillah.",
      "links": "<a href='/AIV/1/2/24'>Gen. 2:24</a>",
      "comment": "Here is the first reference to polygamy, diverging from the monogamous ideal seen in Genesis 2:24. This development underscores the spread of sin’s effects in society."
    },
    {
      "pk": 1040020,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 20,
      "text": "Adah gave birth to Jabal; he was the father of those who dwell in tents and have livestock.",
      "links": "<a href='/AIV/1/13/2'>Gen. 13:2</a>",
      "comment": "Jabal is seen as the ancestor of nomads, herders, and livestock owners. The development of civilization continues."
    },
    {
      "pk": 1040021,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 21,
      "text": "His brother’s name was Jubal; he was the father of all who play the lyre and pipe.",
      "links": "<a href='/AIV/19/150/3-4'>Ps. 150:3-4</a>",
      "comment": "Jubal initiates music and culture in human society, a gift which comes to play a vital role in liturgical and spiritual life (Ps. 150:3-4)."
    },
    {
      "pk": 1040022,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 22,
      "text": "Zillah also gave birth to Tubal-cain, who forged all kinds of tools out of bronze and iron. The sister of Tubal-cain was Naamah.",
      "links": "<a href='/AIV/1/4/20'>Gen. 4:20</a>",
      "comment": "The technological advance with bronze and iron shows human creativity—even after the fall, humans remain God’s image-bearers. Naamah’s mention highlights the importance of women in genealogies, foreshadowing later significant women in salvation history."
    },
    {
      "pk": 1040023,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 23,
      "text": "Lamech said to his wives, \"Adah and Zillah, hear my voice; you wives of Lamech, listen to my words: I have killed a man for wounding me, a young man for striking me.",
      "links": "<a href='/AIV/1/3/17'>Gen. 3:17</a>",
      "comment": "Lamech’s poem expresses a boastful escalation of violence, going beyond even Cain. The poetic form may echo later biblical songs and declarations (cf. Ex. 15:1-18)."
    },
    {
      "pk": 1040024,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 24,
      "text": "If Cain’s vengeance is sevenfold, then Lamech’s is seventy-sevenfold.\"",
      "links": "<a href='/AIV/40/18/22'>Matt. 18:22</a>",
      "comment": "Jesus later reverses this boast with his teaching on forgiveness, urging not 'seven times,' but 'seventy-seven times' (Matt. 18:22). Violence begets violence, but forgiveness is the true path to healing."
    },
    {
      "pk": 1040025,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 25,
      "text": "Adam knew his wife again, and she gave birth to a son and called his name Seth, for she said, \"God has appointed me another offspring instead of Abel, because Cain killed him.\"",
      "links": "<a href='/AIV/1/5/3'>Gen. 5:3</a>; <a href='/AIV/42/3/38'>Luke 3:38</a>",
      "comment": "Seth’s birth represents the preservation of the righteous line, ultimately leading to Christ (Luke 3:38)—highlighting God's faithfulness even after tragedy."
    },
    {
      "pk": 1040026,
      "translation": "AIV",
      "book": 1,
      "chapter": 4,
      "verse": 26,
      "text": "To Seth also a son was born, and he called his name Enosh. At that time people began to call upon the name of the LORD.",
      "links": "<a href='/AIV/32/2/32'>Joel 2:32</a>; <a href='/AIV/45/10/13'>Rom. 10:13</a>",
      "comment": "A crucial turning point: public worship and invocation of the LORD begins, preparing God’s people to seek Him together. This points ahead to the importance of communal prayer and the gathered people in the story of redemption."
    }
  ],
  "translatedAt": "2025-12-23T08:35:52.775Z"
}