{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 48,
  "verses": [
    {
      "pk": 2048001,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 1,
      "text": "After these things, Joseph was told, “Your father is ill.” So he took with him his two sons, Manasseh and Ephraim.",
      "links": "<a href='/AIV/1/46/20'>Gen. 46:20</a>; <a href='/AIV/1/41/50-52'>Gen. 41:50-52</a>",
      "comment": "Joseph’s sons are named, setting up the adoption and blessing that Jacob will give. Their names, Manasseh and Ephraim, identifying them as born in Egypt, are significant for later tribal history."
    },
    {
      "pk": 2048002,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 2,
      "text": "Jacob was told, “Your son Joseph has come to you.” Israel gathered his strength and sat up on the bed.",
      "links": "<a href='/AIV/1/47/31'>Gen. 47:31</a>",
      "comment": "‘Israel’ as Jacob’s spiritual name is used, hinting at the providential significance of this moment. Sitting up shows his resolve to perform a solemn blessing."
    },
    {
      "pk": 2048003,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 3,
      "text": "Jacob said to Joseph, “God Almighty appeared to me at Luz in the land of Canaan and blessed me,”",
      "links": "<a href='/AIV/1/28/13'>Gen. 28:13</a>; <a href='/AIV/1/35/6-9'>Gen. 35:6-9</a>",
      "comment": "Jacob recalls God’s self-revelation and covenant at Bethel, emphasizing the role of divine blessing and election—key themes for understanding spiritual leadership later in salvation history."
    },
    {
      "pk": 2048004,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 4,
      "text": "and said to me, ‘Behold, I will make you fruitful and multiply you, and I will make of you a group of peoples, and I will give this land to your descendants after you for an everlasting possession.’",
      "links": "<a href='/AIV/1/17/6-8'>Gen. 17:6-8</a>; <a href='/AIV/1/28/13'>Gen. 28:13</a>",
      "comment": "Jacob cites the promise of land and nationhood—reminding us of the perpetual nature of the divine covenant, which points forward to fulfillment and inheritance in later biblical history."
    },
    {
      "pk": 2048005,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 5,
      "text": "And now your two sons, who were born to you in Egypt before I came to you in Egypt, are mine; Ephraim and Manasseh shall be mine, as Reuben and Simeon are.",
      "links": "<a href='/AIV/1/41/51-52'>Gen. 41:51-52</a>; <a href='/AIV/1/35/22'>Gen. 35:22</a>",
      "comment": "Jacob adopts Joseph’s sons as his own, granting them equal status with his first two sons—reflecting the transfer and multiplication of blessing, a foreshadowing of spiritual adoption and inheritance themes found in the New Testament (<a href='/AIV/45/8/17'>Rom. 8:17</a>)."
    },
    {
      "pk": 2048006,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 6,
      "text": "And the children you father after them shall be yours. They will be called by the name of their brothers in their inheritance.",
      "links": "<a href='/AIV/1/46/20'>Gen. 46:20</a>",
      "comment": "Any further sons of Joseph will not receive an independent tribal standing, but will be part of Ephraim or Manasseh. The focus is on the unique dignity given to these two, subtly underscoring how blessings can be mediated through established authority."
    },
    {
      "pk": 2048007,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 7,
      "text": "As for me, when I came from Paddan, Rachel died by me in the land of Canaan, on the way, when there was still some distance to go to Ephrath; and I buried her there on the way to Ephrath, that is, Bethlehem.",
      "links": "<a href='/AIV/1/35/19'>Gen. 35:19</a>; <a href='/AIV/1/35/16-20'>Gen. 35:16-20</a>",
      "comment": "Jacob’s reference to Rachel and Bethlehem anticipates later connections—Bethlehem becomes the birthplace of King David (and Jesus, <a href='/AIV/42/2/4-7'>Luke 2:4-7</a>), underlining God’s sovereign preparation in salvation history."
    },
    {
      "pk": 2048008,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 8,
      "text": "When Israel saw Joseph’s sons, he said, “Who are these?”",
      "links": "<a href='/AIV/1/27/18'>Gen. 27:18</a>",
      "comment": "The question recalls earlier blessings, where the identity of the recipient was crucial. Here, the formal recognition is significant in the transfer of authority and blessing."
    },
    {
      "pk": 2048009,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 9,
      "text": "Joseph said to his father, “They are my sons, whom God has given me here.” And he said, “Bring them to me, so I may bless them.”",
      "links": "<a href='/AIV/1/33/5'>Gen. 33:5</a>; <a href='/AIV/1/27/4'>Gen. 27:4</a>",
      "comment": "The act of blessing highlights the role of the patriarch as spiritual head and mediator—a model for later understanding of spiritual authority and transmission of grace."
    },
    {
      "pk": 2048010,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 10,
      "text": "Now the eyes of Israel were dim because of his age, so he could not see well. So Joseph brought them near, and he kissed them and embraced them.",
      "links": "<a href='/AIV/1/27/1'>Gen. 27:1</a>",
      "comment": "The description is reminiscent of Isaac blessing Jacob. The affectionate kiss and embrace echo themes of love and covenantal intimacy, and the physical transmission of blessing."
    },
    {
      "pk": 2048011,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 11,
      "text": "Israel said to Joseph, “I never expected to see your face; and here God has let me see your children also.”",
      "links": "<a href='/AIV/1/45/26-28'>Gen. 45:26-28</a>",
      "comment": "Jacob recognizes God’s providence and abundant goodness—not only restoring Joseph, but giving him descendants—reminding us always to see God’s hand in restoration and promise."
    },
    {
      "pk": 2048012,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 12,
      "text": "Then Joseph brought them out from Israel’s knees and bowed down with his face to the ground.",
      "links": "<a href='/AIV/1/27/30'>Gen. 27:30</a>",
      "comment": "Joseph’s act of reverence toward his father underscores the importance of honoring divinely appointed authority. It also embodies humility before the one chosen to bestow blessing."
    },
    {
      "pk": 2048013,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 13,
      "text": "And Joseph took them both, Ephraim in his right hand toward Israel’s left, and Manasseh in his left hand toward Israel’s right, and brought them close to him.",
      "links": "<a href='/AIV/1/48/17'>Gen. 48:17</a>",
      "comment": "The careful positioning by Joseph is an attempt to ensure the traditional greater blessing for the firstborn. The moment sets up God’s sovereign reversal of human expectation."
    },
    {
      "pk": 2048014,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 14,
      "text": "But Israel stretched out his right hand and laid it on Ephraim’s head, who was the younger, and his left hand on Manasseh’s head, crossing his hands. For Manasseh was the firstborn.",
      "links": "<a href='/AIV/1/25/23'>Gen. 25:23</a>; <a href='/AIV/1/48/17-19'>Gen. 48:17-19</a>",
      "comment": "God’s election is reaffirmed: the younger is given precedence, recurring in the Biblical motif of reversal. The hand-crossing echoes the principle that spiritual inheritance is not always by natural descent."
    },
    {
      "pk": 2048015,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 15,
      "text": "And he blessed Joseph and said, “The God before whom my fathers Abraham and Isaac walked, the God who has been my shepherd all my life to this day,”",
      "links": "<a href='/AIV/1/17/1'>Gen. 17:1</a>; <a href='/AIV/19/23/1'>Ps. 23:1</a>",
      "comment": "Jacob’s invocation presents God as shepherd, a title loaded with prophetic and messianic meaning (<a href='/AIV/43/10/11'>John 10:11</a>). Personal relationship with God is at the heart of the blessing."
    },
    {
      "pk": 2048016,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 16,
      "text": "the angel who has redeemed me from all evil, bless these boys; and let my name be carried on by them, and the name of my fathers Abraham and Isaac. Let them grow into a multitude in the midst of the earth.",
      "links": "<a href='/AIV/1/31/11-13'>Gen. 31:11-13</a>; <a href='/AIV/1/32/24-30'>Gen. 32:24-30</a>",
      "comment": "Jacob invokes the mysterious ‘angel’—often understood as a visible manifestation of God’s saving presence (a type of the Word becoming flesh, <a href='/AIV/43/1/14'>John 1:14</a>). The multiplication echoes the blessing given Abraham, reinforcing spiritual continuity."
    },
    {
      "pk": 2048017,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 17,
      "text": "When Joseph saw that his father laid his right hand on the head of Ephraim, it displeased him, and he took his father’s hand to move it from Ephraim’s head to Manasseh’s head.",
      "links": "<a href='/AIV/1/48/13'>Gen. 48:13</a>",
      "comment": "Joseph’s protest resembles other biblical moments when human expectation conflicts with God’s choice (see David’s brothers, <a href='/AIV/9/16/7'>1 Sam. 16:7</a>). It shows the tension between tradition and divine sovereignty."
    },
    {
      "pk": 2048018,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 18,
      "text": "And Joseph said to his father, “Not this way, my father; since this one is the firstborn, put your right hand on his head.”",
      "links": "<a href='/AIV/1/48/13'>Gen. 48:13</a>",
      "comment": "The firstborn’s rights are again emphasized, but the spiritual inheritance is dispensed differently, as guided by God’s plan and Jacob’s prophetic insight."
    },
    {
      "pk": 2048019,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 19,
      "text": "But his father refused and said, “I know, my son, I know. He also shall become a people, and he too shall be great. Nevertheless, his younger brother shall be greater than he, and his descendants shall become a group of nations.”",
      "links": "<a href='/AIV/1/25/23'>Gen. 25:23</a>; <a href='/AIV/1/48/14'>Gen. 48:14</a>",
      "comment": "Jacob’s prophetic voice is key—God’s plan supersedes birth order, establishing Ephraim as more prominent. Ephraim’s future significance points to promise extended and multiplied in unexpected ways."
    },
    {
      "pk": 2048020,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 20,
      "text": "So he blessed them that day, saying, “By you Israel will pronounce blessings, saying, ‘May God make you like Ephraim and Manasseh!’” In this way, he put Ephraim before Manasseh.",
      "links": "<a href='/AIV/1/49/22'>Gen. 49:22</a>",
      "comment": "Ephraim and Manasseh become standards of blessing in Israelite tradition. The reversal and blessing also symbolize how grace can be imparted by an authoritative head for the good of many."
    },
    {
      "pk": 2048021,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 21,
      "text": "Then Israel said to Joseph, “Behold, I am about to die, but God will be with you and bring you back to the land of your fathers.”",
      "links": "<a href='/AIV/1/46/4'>Gen. 46:4</a>; <a href='/AIV/2/3/16-17'>Exod. 3:16-17</a>",
      "comment": "Jacob’s closing words are a reminder of the enduring promise—the return to the promised land anticipates later exodus and deliverance. God’s abiding presence is underscored as the true source of hope."
    },
    {
      "pk": 2048022,
      "translation": "AIV",
      "book": 1,
      "chapter": 48,
      "verse": 22,
      "text": "And I give you one portion more than your brothers, which I took from the hand of the Amorites with my sword and my bow.”",
      "links": "<a href='/AIV/1/33/19'>Gen. 33:19</a>; <a href='/AIV/6/24/32'>Josh. 24:32</a>",
      "comment": "The ‘portion’ (Heb. Shechem) has symbolic importance in later inheritance for Joseph’s descendants, connecting physical and spiritual aspects of the promised land. The mention of conquest hints at the necessity both of human effort and divine blessing in securing the promise."
    }
  ],
  "translatedAt": "2025-12-23T09:00:31.218Z"
}