{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 38,
  "verses": [
    {
      "pk": 1038001,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 1,
      "text": "At that time, Judah went down from his brothers and turned aside to a man of Adullam named Hirah.",
      "links": "<a href='/AIV/06/15/35'>Josh. 15:35</a>",
      "comment": "The text shifts from Joseph to Judah, showing God's providence works even amidst human error. The mention of Adullam will have significance later in David’s life (<a href='/AIV/09/22/1'>1 Sam. 22:1</a>)."
    },
    {
      "pk": 1038002,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 2,
      "text": "Judah saw there the daughter of a certain Canaanite whose name was Shua. He took her and went in to her,",
      "links": "",
      "comment": "Judah marries outside the chosen family, hinting at the mixed ancestry later seen in Jesus’ genealogy (<a href='/AIV/40/1/3'>Matt. 1:3</a>)."
    },
    {
      "pk": 1038003,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 3,
      "text": "and she conceived and bore a son, and he called his name Er.",
      "links": "<a href='/AIV/13/2/3'>1 Chron. 2:3</a>",
      "comment": "Naming is an act of authority and covenant identity, a recurring biblical theme."
    },
    {
      "pk": 1038004,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 4,
      "text": "She conceived again and bore a son, and she called his name Onan.",
      "links": "",
      "comment": "The text alternates between Judah naming one son and his wife naming the other, which subtly shows the role of both parents in identity."
    },
    {
      "pk": 1038005,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 5,
      "text": "Yet again she bore a son, and she called his name Shelah. Judah was in Chezib when she gave birth to him.",
      "links": "<a href='/AIV/06/15/44'>Josh. 15:44</a>",
      "comment": "The place-name Chezib can mean 'deceit', which foreshadows later events in the chapter."
    },
    {
      "pk": 1038006,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 6,
      "text": "And Judah took a wife for Er, his firstborn, and her name was Tamar.",
      "links": "",
      "comment": "Arranged marriages were common and established lines of inheritance, a theme fulfilled in the coming of Christ, who comes from unexpected unions (<a href='/AIV/40/1/3'>Matt. 1:3</a>)."
    },
    {
      "pk": 1038007,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 7,
      "text": "But Er, Judah’s firstborn, was wicked in the LORD’s sight, so the LORD put him to death.",
      "links": "<a href='/AIV/04/26/19'>Num. 26:19</a>",
      "comment": "Direct divine judgment shows the seriousness of sin in the chosen lineage, recalling Ananias and Sapphira (<a href='/AIV/44/5/1-10'>Acts 5:1–10</a>)."
    },
    {
      "pk": 1038008,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 8,
      "text": "Then Judah said to Onan, \"Go in to your brother’s wife, and perform the duty of a brother-in-law to her, and raise up offspring for your brother.\"",
      "links": "<a href='/AIV/05/25/5-10'>Deut. 25:5–10</a>",
      "comment": "This practice, later called levirate marriage, protected inheritance and the widow. This tradition foreshadows spiritual continuation and new life given through another."
    },
    {
      "pk": 1038009,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 9,
      "text": "But Onan knew that the offspring would not be his. So whenever he went in to his brother’s wife, he would spill his seed on the ground, so that he would not give offspring to his brother.",
      "links": "",
      "comment": "Onan’s refusal to fulfill his duty is more than a private act—it is rejecting responsibility, inheritance, and future blessing. Sin often has communal consequences."
    },
    {
      "pk": 1038010,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 10,
      "text": "What he did was evil in the LORD’s sight, so he put him to death also.",
      "links": "",
      "comment": "God’s immediate judgment underlines the moral seriousness of neglecting one’s duty, especially regarding life and family."
    },
    {
      "pk": 1038011,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 11,
      "text": "Then Judah said to Tamar his daughter-in-law, \"Stay a widow in your father’s house until Shelah my son grows up.\" For he feared that Shelah would also die, like his brothers. So Tamar went and stayed in her father’s house.",
      "links": "",
      "comment": "Judah’s lack of faith and willingness to withhold Shelah creates injustice for Tamar. Biblical justice encompasses the vulnerable and the marginalized."
    },
    {
      "pk": 1038012,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 12,
      "text": "After many days the daughter of Shua, Judah's wife, died. When Judah was comforted, he went up to his sheep shearers at Timnah, he and his friend Hirah the Adullamite.",
      "links": "<a href='/AIV/07/14/1'>Judg. 14:1</a>",
      "comment": "Sheep shearing was a festive occasion, often associated with celebration and moral testing, as later seen with Samson."
    },
    {
      "pk": 1038013,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 13,
      "text": "It was told to Tamar, \"Your father-in-law is going up to Timnah to shear his sheep.\"",
      "links": "",
      "comment": "Tamar actively takes initiative; biblical women often play a significant role in salvation history (see <a href='/AIV/06/2/1'>Josh. 2:1</a> Rahab, <a href='/AIV/08/4/13-17'>Ruth 4:13–17</a>)."
    },
    {
      "pk": 1038014,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 14,
      "text": "She took off her widow's clothes, covered herself with a veil, wrapped herself up, and sat at the entrance to Enaim, which is on the way to Timnah. For she saw that Shelah had grown up, and she had not been given to him as a wife.",
      "links": "",
      "comment": "Tamar’s actions, while unorthodox, are driven by the demand for justice and God’s promises. Putting on the veil indicates her intent was not merely personal, but related to inheritance customs."
    },
    {
      "pk": 1038015,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 15,
      "text": "When Judah saw her, he thought she was a prostitute, for she had covered her face.",
      "links": "",
      "comment": "Misrecognition and irony recur in Genesis, as in the stories of Isaac and Jacob (<a href='/AIV/01/27/1-23'>Gen. 27:1–23</a>)."
    },
    {
      "pk": 1038016,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 16,
      "text": "He turned to her at the roadside and said, \"Come, let me come in to you,\" for he did not know that she was his daughter-in-law. She said, \"What will you give me, that you may come in to me?\"",
      "links": "",
      "comment": "Tamar's question emphasizes covenant and exchange—a principle developed throughout Scripture."
    },
    {
      "pk": 1038017,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 17,
      "text": "He answered, \"I will send you a young goat from the flock.\" She said, \"If you give me a pledge, until you send it—\"",
      "links": "",
      "comment": "Pledges (guarantees) foreshadow sacramental realities: visible signs of promised realities."
    },
    {
      "pk": 1038018,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 18,
      "text": "He said, \"What pledge shall I give you?\" She replied, \"Your signet, your cord, and your staff that is in your hand.\" So he gave them to her and went in to her, and she conceived by him.",
      "links": "",
      "comment": "These objects are symbols of identity and authority. The giving of them signifies the passing on of inheritance and name—important in both Old and New Covenant thinking."
    },
    {
      "pk": 1038019,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 19,
      "text": "Then she arose and went away, and taking off her veil she put on the garments of her widowhood.",
      "links": "",
      "comment": "Tamar returns to her social station outwardly, but has inwardly participated in securing the family line."
    },
    {
      "pk": 1038020,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 20,
      "text": "When Judah sent the young goat by his friend the Adullamite to take back the pledge from the woman, he did not find her.",
      "links": "",
      "comment": "Judah tries to fulfill his deal, but Tamar’s actions remain hidden—as God’s providential working often is."
    },
    {
      "pk": 1038021,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 21,
      "text": "And he asked the men of that place, \"Where is the cult prostitute who was at Enaim by the roadside?\" They said, \"There has been no cult prostitute here.\"",
      "links": "",
      "comment": "The 'cult prostitute' (Hebrew 'qedeshah') is associated with pagan ritual, but the text is careful to note the absence—underscoring this episode’s uniqueness."
    },
    {
      "pk": 1038022,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 22,
      "text": "So he returned to Judah and said, \"I have not found her. Also, the men of the place said, ‘There has been no cult prostitute here.’\"",
      "links": "",
      "comment": "The search for Tamar ends in confusion—fitting for stories where appearances deceive."
    },
    {
      "pk": 1038023,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 23,
      "text": "Judah replied, \"Let her keep the things as her own, or we will become a laughingstock. See, I sent this young goat, and you did not find her.\"",
      "links": "",
      "comment": "Public shame is a recurring theme in the Bible, and here Judah wishes to avoid it. Compare with concern for honor and shame in <a href='/AIV/08/3/14'>Ruth 3:14</a>."
    },
    {
      "pk": 1038024,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 24,
      "text": "About three months later, Judah was told, \"Tamar your daughter-in-law has been immoral; she is moreover pregnant by immorality.\" And Judah said, \"Bring her out, and let her be burned.\"",
      "links": "<a href='/AIV/03/21/9'>Lev. 21:9</a>",
      "comment": "Old Testament law prescribes severe penalties for certain transgressions, though the New Testament shows fulfillment in mercy, not condemnation (<a href='/AIV/43/8/3-11'>John 8:3–11</a>)."
    },
    {
      "pk": 1038025,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 25,
      "text": "As she was being brought out, she sent word to her father-in-law, \"By the man to whom these belong, I am pregnant.\" And she said, \"Please identify whose these are, the signet and the cord and the staff.\"",
      "links": "",
      "comment": "Tamar exposes Judah’s hypocrisy through his own items—reminding us how often judgment boomerangs back on the judge (<a href='/AIV/40/7/2'>Matt. 7:2</a>)."
    },
    {
      "pk": 1038026,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 26,
      "text": "Then Judah recognized them and said, \"She is more righteous than I, since I did not give her to my son Shelah.\" And he did not know her again.",
      "links": "<a href='/AIV/40/1/3'>Matt. 1:3</a>",
      "comment": "Judah’s repentance is genuine—he admits guilt and does not continue the relationship. This turning point is a spiritual conversion, foreshadowing the change in his later life and leadership of Israel."
    },
    {
      "pk": 1038027,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 27,
      "text": "When the time of her labor came, there were twins in her womb.",
      "links": "<a href='/AIV/01/25/24'>Gen. 25:24</a>",
      "comment": "The motif of twins echoes God’s sovereign election—first seen with Jacob and Esau."
    },
    {
      "pk": 1038028,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 28,
      "text": "And when she was in labor, one put out a hand, and the midwife took and tied a scarlet thread on his hand, saying, \"This one came out first.\"",
      "links": "<a href='/AIV/06/2/18'>Josh. 2:18</a>",
      "comment": "The scarlet thread as a sign recalls later deliverance by means of a scarlet cord, such as Rahab’s rescue, symbolizing redemption and promise."
    },
    {
      "pk": 1038029,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 29,
      "text": "But as he drew back his hand, his brother came out, and she said, \"How have you broken through? This breach be upon you!\" So his name was called Perez.",
      "links": "",
      "comment": "Perez means 'breaking out'. The younger surpasses the older, pointing to God's reversal of human expectations—a theme found from Isaac and Jacob to King David and ultimately to Christ."
    },
    {
      "pk": 1038030,
      "translation": "AIV",
      "book": 1,
      "chapter": 38,
      "verse": 30,
      "text": "Afterward his brother came out with the scarlet thread on his hand, and his name was called Zerah.",
      "links": "<a href='/AIV/40/1/3'>Matt. 1:3</a>",
      "comment": "Though Zerah had the outward sign of 'firstborn', Perez becomes ancestor to King David and Jesus. This underscores that God chooses the unlikely for His purposes."
    }
  ],
  "translatedAt": "2025-12-23T08:54:41.017Z"
}