{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 49,
  "verses": [
    {
      "pk": 1949049,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 1,
      "text": "Then Jacob called his sons and said, \"Gather together, that I may tell you what shall happen to you in the days to come.",
      "links": "<a href='/AIV/1/48/1'>Gen. 48:1</a>; <a href='/AIV/24/23/20'>Jer. 23:20</a>",
      "comment": "\"In the days to come\" points toward prophetic speech, looking beyond the immediate future, hinting at the way God's providence unfolds through generations."
    },
    {
      "pk": 1949050,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 2,
      "text": "\"Assemble and listen, O sons of Jacob, listen to Israel your father.\"",
      "links": "<a href='/AIV/1/35/10'>Gen. 35:10</a>",
      "comment": "Jacob refers to himself by both his names, indicating a solemn moment calling for unity around their patriarch."
    },
    {
      "pk": 1949051,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 3,
      "text": "\"Reuben, you are my firstborn, my might and the firstfruits of my strength, excelling in dignity and excelling in power.",
      "links": "<a href='/AIV/1/29/32'>Gen. 29:32</a>; <a href='/AIV/5/21/17'>Deut. 21:17</a>",
      "comment": "The firstborn in ancient Israel was entitled to special blessing and authority, reflecting deep tradition regarding inheritance."
    },
    {
      "pk": 1949052,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 4,
      "text": "Unstable as water, you shall not excel, because you went up to your father’s bed; then you defiled it—he went up to my couch.",
      "links": "<a href='/AIV/1/35/22'>Gen. 35:22</a>",
      "comment": "Reuben's sin leads to his loss of preeminence. This highlights the seriousness of sin and the way it can forfeit grace and blessings, a theme echoed throughout salvation history."
    },
    {
      "pk": 1949053,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 5,
      "text": "\"Simeon and Levi are brothers; weapons of violence are their swords.",
      "links": "<a href='/AIV/1/34/25'>Gen. 34:25</a>",
      "comment": "Their unity is associated with violence, a reference to the incident at Shechem. The chosen people are called to holiness rather than violence."
    },
    {
      "pk": 1949054,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 6,
      "text": "Let my soul not enter their council; let not my glory be joined with their company. For in their anger they killed men, and in their willfulness they hamstrung oxen.",
      "links": "<a href='/AIV/1/34/26-29'>Gen. 34:26-29</a>",
      "comment": "Jacob distances himself from Simeon and Levi's violence, showing that election and blessing are not based merely on natural descent, but fidelity to God's ways."
    },
    {
      "pk": 1949055,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 7,
      "text": "Cursed be their anger, for it is fierce, and their wrath, for it is cruel! I will divide them in Jacob and scatter them in Israel.",
      "links": "<a href='/AIV/4/18/7'>Num. 18:7</a>; <a href='/AIV/6/19/1'>Josh. 19:1</a>",
      "comment": "Simeon and Levi’s tribes would later be dispersed in Israel; yet Levi’s dispersion became a source of blessing as they served in the priestly role (see <a href='/AIV/4/3/12-13'>Num. 3:12-13</a>). This shows how God's justice can become a channel for grace and mediation."
    },
    {
      "pk": 1949056,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 8,
      "text": "\"Judah, your brothers shall praise you; your hand shall be on the neck of your enemies; your father’s sons shall bow down before you.",
      "links": "<a href='/AIV/1/29/35'>Gen. 29:35</a>; <a href='/AIV/13/5/2'>1 Chr. 5:2</a>",
      "comment": "Judah receives the blessing of leadership, foreshadowing King David and, ultimately, the Messiah (<a href='/AIV/42/3/33'>Luke 3:33</a>). The bowing of his brothers hints at Christ as the King to whom all tribes gather."
    },
    {
      "pk": 1949057,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 9,
      "text": "Judah is a lion’s cub; from the prey, my son, you have gone up. He stooped down; he crouched as a lion and as a lioness—who shall rouse him?",
      "links": "<a href='/AIV/4/24/9'>Num. 24:9</a>; <a href='/AIV/66/5/5'>Rev. 5:5</a>",
      "comment": "The lion becomes the enduring symbol of Judah. Jesus is called the ‘Lion of Judah’ in Revelation, linking this blessing to Christ’s kingly identity."
    },
    {
      "pk": 1949058,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 10,
      "text": "The scepter shall not depart from Judah, nor the ruler’s staff from between his feet, until he to whom it belongs comes; and to him shall be the obedience of the peoples.",
      "links": "<a href='/AIV/10/7/16'>2 Sam. 7:16</a>; <a href='/AIV/42/1/33'>Luke 1:33</a>; <a href='/AIV/66/11/15'>Rev. 11:15</a>",
      "comment": "This is a key messianic prophecy—the promise of perpetual kingship in Judah’s line, finding ultimate fulfillment in Christ whose kingdom will have no end. The language also suggests anticipation of universal obedience under one royal figure, a major theme in salvation history."
    },
    {
      "pk": 1949059,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 11,
      "text": "He ties his foal to the vine and his donkey’s colt to the choice vine; he washes his garments in wine and his robe in the blood of grapes.",
      "links": "<a href='/AIV/38/9/9'>Zech. 9:9</a>; <a href='/AIV/43/12/14-15'>John 12:14-15</a>",
      "comment": "Abundance of wine is a sign of prosperity, but also recalls the imagery of the Messiah’s coming: see Zechariah 9:9 (the King comes riding on a colt), John's Gospel, and the Eucharistic imagery of 'blood of grapes'."
    },
    {
      "pk": 1949060,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 12,
      "text": "His eyes are darker than wine, and his teeth whiter than milk.",
      "links": "<a href='/AIV/22/5/12'>Song 5:12</a>",
      "comment": "The vigor and beauty of Judah’s ruler evokes poetic descriptions later used of the ideal bridegroom, also prefiguring Christ as the pure and life-giving spouse."
    },
    {
      "pk": 1949061,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 13,
      "text": "\"Zebulun shall dwell at the seashore; he shall become a haven for ships, and his border shall be at Sidon.",
      "links": "<a href='/AIV/6/19/10'>Josh. 19:10-11</a>",
      "comment": "The tribe of Zebulun would play a role in facilitating trade and contact with the nations, foreshadowing Israel’s wider mission."
    },
    {
      "pk": 1949062,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 14,
      "text": "\"Issachar is a strong donkey, lying down between the sheepfolds.",
      "links": "<a href='/AIV/7/5/15'>Judg. 5:15</a>",
      "comment": "The donkey signifies labor and patience. Issachar’s tribe would prefer security and bear burdens, yet be content with their place."
    },
    {
      "pk": 1949063,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 15,
      "text": "He saw that a resting place was good, and that the land was pleasant, so he bowed his shoulder to bear, and became a servant at forced labor.",
      "links": "<a href='/AIV/1/3/17-19'>Gen. 3:17-19</a>",
      "comment": "The importance of work and bearing burdens with patience is a virtue. Spiritual life often involves humble service."
    },
    {
      "pk": 1949064,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 16,
      "text": "\"Dan shall judge his people as one of the tribes of Israel.",
      "links": "<a href='/AIV/7/13/2'>Judg. 13:2</a>",
      "comment": "Dan’s name means 'judge'; his tribe produced judges like Samson. There is an allusion to the need for justice among the people."
    },
    {
      "pk": 1949065,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 17,
      "text": "Dan shall be a serpent in the way, a viper by the path, that bites the horse’s heels so that its rider falls backward.",
      "links": "<a href='/AIV/1/3/15'>Gen. 3:15</a>",
      "comment": "This image echoes the serpent from Genesis 3:15, recalling both the consequences of sin and the mysterious struggle between good and evil, ultimately overcome by the Messiah."
    },
    {
      "pk": 1949066,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 18,
      "text": "\"I wait for your salvation, LORD.",
      "links": "<a href='/AIV/19/38/22'>Ps. 38:22</a>; <a href='/AIV/42/2/25'>Luke 2:25</a>",
      "comment": "This is the first occurrence in Scripture of the word “salvation” as a prayerful hope. The ultimate fulfillment of this hope is found in Christ—whose name means “the LORD saves”."
    },
    {
      "pk": 1949067,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 19,
      "text": "\"Gad, raiders shall attack him, but he shall raid at their heels.",
      "links": "<a href='/AIV/5/33/20'>Deut. 33:20</a>",
      "comment": "Gad’s history would be marked by conflict and resilience—reflecting the endurance that characterizes the faithful."
    },
    {
      "pk": 1949068,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 20,
      "text": "\"Asher’s food shall be rich, and he shall provide royal delicacies.",
      "links": "<a href='/AIV/5/33/24'>Deut. 33:24</a>",
      "comment": "Asher’s land would be fruitful and abundant, providing for others, a foreshadowing of the Church’s mission to nourish spiritually and physically."
    },
    {
      "pk": 1949069,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 21,
      "text": "\"Naphtali is a deer let loose; he gives beautiful words.",
      "links": "<a href='/AIV/7/5/6'>Judg. 5:6; 5:18</a>",
      "comment": "Naphtali’s tribe would be associated with freedom and eloquence—often God’s grace works through freely-offered service and words."
    },
    {
      "pk": 1949070,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 22,
      "text": "\"Joseph is a fruitful bough, a fruitful bough by a spring; his branches run over the wall.",
      "links": "<a href='/AIV/1/41/52'>Gen. 41:52</a>; <a href='/AIV/19/1/3'>Ps. 1:3</a>",
      "comment": "Joseph’s fruitfulness is both temporal and spiritual, prefiguring the way grace overflows beyond boundaries."
    },
    {
      "pk": 1949071,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 23,
      "text": "The archers bitterly attacked him, shot at him, and harassed him severely,",
      "links": "<a href='/AIV/1/37/23-28'>Gen. 37:23-28</a>",
      "comment": "Refers to Joseph’s suffering and trials, mirroring the suffering servant motif that is ultimately fulfilled in Christ."
    },
    {
      "pk": 1949072,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 24,
      "text": "yet his bow remained steady, and his arms were made agile by the hands of the Mighty One of Jacob—from there is the Shepherd, the Stone of Israel—",
      "links": "<a href='/AIV/19/23/1'>Ps. 23:1</a>; <a href='/AIV/19/118/22'>Ps. 118:22</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "The 'Shepherd' and 'Stone' titles both are applied prophetically to Christ. The Shepherd cares for his people, and the Stone becomes the foundation: images that will echo through the New Testament, including teachings about leadership and authority."
    },
    {
      "pk": 1949073,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 25,
      "text": "by the God of your father who will help you, by the Almighty who will bless you with blessings of heaven above, blessings of the deep that lies beneath, blessings of the breasts and of the womb.",
      "links": "<a href='/AIV/1/27/28'>Gen. 27:28</a>",
      "comment": "The fullness of blessing is described in imagery of abundance, fruitfulness, and life—echoing an understanding of God’s Providence."
    },
    {
      "pk": 1949074,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 26,
      "text": "The blessings of your father have surpassed the blessings of my ancestors up to the utmost bounds of the everlasting hills. May they rest on the head of Joseph, on the brow of the one distinguished among his brothers.",
      "links": "<a href='/AIV/5/33/13-16'>Deut. 33:13-16</a>",
      "comment": "Joseph’s position brings a superabundant blessing, emphasizing God’s ability to bring good from suffering. Joseph here is a type or foreshadow of Christ."
    },
    {
      "pk": 1949075,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 27,
      "text": "\"Benjamin is a ravenous wolf; in the morning he devours the prey, and at evening he divides the spoil.\"",
      "links": "<a href='/AIV/7/20/21-25'>Judg. 20:21-25</a>",
      "comment": "Benjamin would be known for strength, but also for a bold spirit in battle. From this tribe later comes Saul and Paul—both figures of zealous mission."
    },
    {
      "pk": 1949076,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 28,
      "text": "All these are the twelve tribes of Israel, this is what their father said to them as he blessed them, blessing each one with an appropriate blessing.",
      "links": "<a href='/AIV/1/35/23-26'>Gen. 35:23-26</a>",
      "comment": "This summary underscores the continuity of God’s covenant plan through the patriarchs and tribal leaders."
    },
    {
      "pk": 1949077,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 29,
      "text": "Then he commanded them and said, \"I am to be gathered to my people. Bury me with my fathers in the cave that is in the field of Ephron the Hittite,",
      "links": "<a href='/AIV/1/47/30'>Gen. 47:30</a>; <a href='/AIV/1/23/16-20'>Gen. 23:16-20</a>",
      "comment": "Burial with his ancestors affirms belief in bodily continuity and in the promised land. This also shows respect for tradition and a hope that looks beyond death."
    },
    {
      "pk": 1949078,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 30,
      "text": "in the cave that is in the field at Machpelah, east of Mamre, in the land of Canaan, which Abraham bought with the field from Ephron the Hittite as a burial site.",
      "links": "<a href='/AIV/1/23/17-20'>Gen. 23:17-20</a>",
      "comment": "Physical gravesite and heritage are significant—pointing forward to the sanctification of places, which will later become central in worship."
    },
    {
      "pk": 1949079,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 31,
      "text": "There they buried Abraham and Sarah his wife, Isaac and Rebekah his wife, and there I buried Leah—",
      "links": "<a href='/AIV/1/23/19'>Gen. 23:19</a>; <a href='/AIV/1/25/9'>Gen. 25:9</a>",
      "comment": "The matriarchs’ and patriarchs’ burial together shows the dignity of marriage and family as foundational to God’s people."
    },
    {
      "pk": 1949080,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 32,
      "text": "the field and the cave that were purchased from the Hittites.\"",
      "links": "<a href='/AIV/1/23/17'>Gen. 23:17</a>",
      "comment": "The act of purchasing land in the promised land is symbolic of faith in God's covenant."
    },
    {
      "pk": 1949081,
      "translation": "AIV",
      "book": 1,
      "chapter": 49,
      "verse": 33,
      "text": "When Jacob finished commanding his sons, he drew his feet up into the bed, breathed his last, and was gathered to his people.",
      "links": "<a href='/AIV/1/25/8'>Gen. 25:8</a>",
      "comment": "‘Gathered to his people’ signifies reunion with the faithful departed and points toward the hope of resurrection and eternal life."
    }
  ],
  "translatedAt": "2025-12-23T09:01:09.766Z"
}