{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 35,
  "verses": [
    {
      "pk": 1035001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 1,
      "text": "Then God said to Jacob, “Get up, go to Bethel and settle there. Build an altar there to God, who appeared to you when you fled from your brother Esau.”",
      "links": "<a href='/AIV/1/28/10-22'>Gen. 28:10-22</a>;<a href='/AIV/6/24/32'>Josh. 24:32</a>",
      "comment": "God calls Jacob back to Bethel, where Jacob had first encountered Him. The command to build an altar highlights the importance of consecrated space and sacrifice in worship. This foreshadows the necessity of a physical place of worship and the central role of sacrifice throughout salvation history."
    },
    {
      "pk": 1035002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 2,
      "text": "So Jacob said to his household and to all who were with him, “Remove the foreign gods among you, purify yourselves, and change your clothes.”",
      "links": "<a href='/AIV/6/24/23'>Josh. 24:23</a>;<a href='/AIV/2/19/10'>Exod. 19:10</a>",
      "comment": "The call to purity and removal of idols reflects the necessity of interior and exterior holiness before approaching God. Changing garments can be seen as a sign of renewal, later echoed in New Testament baptism imagery."
    },
    {
      "pk": 1035003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 3,
      "text": "“Then let us arise and go up to Bethel. There I will build an altar to God, who answered me in the day of my distress and has been with me wherever I have gone.”",
      "links": "<a href='/AIV/1/28/19-22'>Gen. 28:19-22</a>;<a href='/AIV/1/31/3'>Gen. 31:3</a>",
      "comment": "Jacob attributes his protection and deliverance to God, showing that the Lord is both personal and faithfully present. The act of altar-building recognizes God’s ongoing guidance—worship is a response to God’s faithfulness."
    },
    {
      "pk": 1035004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 4,
      "text": "So they gave Jacob all the foreign gods they had, and the rings that were in their ears. Jacob hid them under the oak near Shechem.",
      "links": "<a href='/AIV/1/34/2'>Gen. 34:2</a>;<a href='/AIV/6/24/26'>Josh. 24:26</a>",
      "comment": "Idolatry must be renounced before true worship. The burial of idols hints at a complete break from past practices, a kind of symbolic death. The practice of rejecting idolatry becomes foundational for the people of God."
    },
    {
      "pk": 1035005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 5,
      "text": "As they journeyed, a terror from God fell upon the cities around them, so that nobody pursued the sons of Jacob.",
      "links": "<a href='/AIV/2/23/27'>Exod. 23:27</a>;<a href='/AIV/6/2/9'>Josh. 2:9</a>",
      "comment": "God protects His people, often acting supernaturally to fulfill His purposes. The fear placed in others’ hearts preserves the chosen line. This foreshadows God's similar protection in Israel’s later national history."
    },
    {
      "pk": 1035006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 6,
      "text": "Jacob and all the people with him came to Luz (that is, Bethel) in the land of Canaan.",
      "links": "<a href='/AIV/1/28/19'>Gen. 28:19</a>",
      "comment": "Bethel receives special attention in the patriarchal narratives as a place of encounter with God. This sanctuary is a forerunner of later sacred sites in Israel’s worship."
    },
    {
      "pk": 1035007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 7,
      "text": "There he built an altar and called the place El-Bethel, because God had revealed Himself to him there when he fled from his brother.",
      "links": "<a href='/AIV/1/28/13'>Gen. 28:13</a>",
      "comment": "Naming the altar El-Bethel—'God of Bethel'—emphasizes God’s revelation at this location. The connection between place and theophany echoes in later liturgical traditions, underscoring the sanctity of certain spaces."
    },
    {
      "pk": 1035008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 8,
      "text": "Now Deborah, Rebekah’s nurse, died and was buried below Bethel under the oak; so its name was called Allon-bacuth.",
      "links": "<a href='/AIV/1/24/59'>Gen. 24:59</a>",
      "comment": "Deborah’s death and the naming of the site as 'Oak of Weeping' signifies the honoring of those who served faithfully. The detail corroborates the deep sense of family continuity in the biblical story."
    },
    {
      "pk": 1035009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 9,
      "text": "God appeared to Jacob again when he came from Paddan-aram, and He blessed him.",
      "links": "<a href='/AIV/1/28/13'>Gen. 28:13</a>;<a href='/AIV/1/32/29'>Gen. 32:29</a>",
      "comment": "The divine blessing is reiterated, showing continuity in God's plan. The conferral of blessing again signals God’s faithfulness despite human frailty."
    },
    {
      "pk": 1035010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 10,
      "text": "God said to him, “Your name is Jacob; but your name shall no longer be called Jacob, but Israel shall be your name.” So He called his name Israel.",
      "links": "<a href='/AIV/1/32/28'>Gen. 32:28</a>;<a href='/AIV/1/17/5'>Gen. 17:5</a>",
      "comment": "Name changes in Scripture often signify a new mission or identity. The divine naming of Israel parallels the bestowal of new identity upon Abraham, prefiguring new creation in Christ."
    },
    {
      "pk": 1035011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 11,
      "text": "God also said to him, “I am God Almighty. Be fruitful and multiply. A nation and a community of nations will come from you, and kings will come from your body.”",
      "links": "<a href='/AIV/1/17/6'>Gen. 17:6</a>;<a href='/AIV/1/28/3'>Gen. 28:3</a>",
      "comment": "God’s command echoes the original command to Adam (Gen. 1:28) and the blessing given to Abraham. The reference to kings prophesies the line of David and, ultimately, the coming King—the Messiah."
    },
    {
      "pk": 1035012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 12,
      "text": "The land which I gave to Abraham and Isaac, I will give to you, and I will give the land to your descendants after you.”",
      "links": "<a href='/AIV/1/13/15'>Gen. 13:15</a>;<a href='/AIV/1/26/3'>Gen. 26:3</a>",
      "comment": "God’s promise of land continues through the patriarchal line. The stress on succession and inheritance highlights the continuity of God’s covenant, pointing forward to fulfillment in salvation history."
    },
    {
      "pk": 1035013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 13,
      "text": "Then God went up from the place where He had spoken with him.",
      "links": "<a href='/AIV/1/17/22'>Gen. 17:22</a>;<a href='/AIV/7/13/20-21'>Judg. 13:20-21</a>",
      "comment": "God’s 'going up' signals a theophany—God’s manifest appearance. These encounters foreshadow the visible, sacramental presence of God in later salvation history."
    },
    {
      "pk": 1035014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 14,
      "text": "Jacob set up a pillar in the place where He had spoken with him, a pillar of stone, and poured out a drink offering on it and poured oil on it.",
      "links": "<a href='/AIV/1/28/18'>Gen. 28:18</a>;<a href='/AIV/3/23/13'>Lev. 23:13</a>",
      "comment": "The establishment of a stone pillar and the pouring of offering demonstrates the material reality of worship and sacred action. This anticipates sacramental signs—outward actions that signify inward grace."
    },
    {
      "pk": 1035015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 15,
      "text": "Jacob called the name of the place where God had spoken with him, Bethel.",
      "links": "<a href='/AIV/1/28/19'>Gen. 28:19</a>",
      "comment": "Again the location is emphasized as a site of God’s presence. Certain places are marked as holy, full of memory, and occupied by God in a unique way."
    },
    {
      "pk": 1035016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 16,
      "text": "They journeyed from Bethel, and while there was still some distance to Ephrath, Rachel began to give birth and her labor was hard.",
      "links": "<a href='/AIV/1/48/7'>Gen. 48:7</a>",
      "comment": "Rachel's difficult labor occurs on the journey, symbolizing both the blessing and the suffering that accompany the fulfillment of God’s promises."
    },
    {
      "pk": 1035017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 17,
      "text": "When her labor was at its hardest, the midwife said to her, “Do not fear, for you have another son.”",
      "links": "<a href='/AIV/1/30/24'>Gen. 30:24</a>",
      "comment": "The assurance from the midwife highlights hope in the midst of suffering. The motif of childbirth in pain will later have theological implications in both Testaments (see John 16:21; Rev. 12:2)."
    },
    {
      "pk": 1035018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 18,
      "text": "As her soul was departing (for she was dying), she called his name Ben-oni, but his father called him Benjamin.",
      "links": "<a href='/AIV/1/35/24'>Gen. 35:24</a>;<a href='/AIV/1/42/4'>Gen. 42:4</a>",
      "comment": "Rachel’s naming, 'Son of my sorrow,' contrasts with Jacob’s, 'Son of the right hand,' showing how sorrow can be transformed into hope. The role of naming by the father prefigures paternal authority and blessing."
    },
    {
      "pk": 1035019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 19,
      "text": "So Rachel died and was buried on the way to Ephrath (that is, Bethlehem).",
      "links": "<a href='/AIV/1/48/7'>Gen. 48:7</a>;<a href='/AIV/40/2/18'>Matt. 2:18</a>",
      "comment": "Rachel’s death near Bethlehem has deep typological significance, as Bethlehem will be the birthplace of David and the Messiah (see Mic. 5:2; Matt. 2:6)."
    },
    {
      "pk": 1035020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 20,
      "text": "Jacob set up a pillar on her grave; it is the pillar of Rachel’s grave to this day.",
      "links": "<a href='/AIV/1/48/7'>Gen. 48:7</a>;<a href='/AIV/9/10/2'>1 Sam. 10:2</a>",
      "comment": "Memorials serve as visible reminders of those who have gone before and the story of God’s people. The practice of veneration of graves becomes significant in the shared memory of the faithful."
    },
    {
      "pk": 1035021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 21,
      "text": "Israel journeyed on and pitched his tent beyond the tower of Eder.",
      "links": "<a href='/AIV/1/49/8'>Gen. 49:8</a>;<a href='/AIV/33/4/8'>Mic. 4:8</a>",
      "comment": "The mention of the tower of Eder is a geographical marker, but later tradition connects it with messianic expectation (see Mic. 4:8)."
    },
    {
      "pk": 1035022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 22,
      "text": "While Israel lived in that land, Reuben went and lay with Bilhah, his father’s concubine, and Israel heard of it. Now Jacob had twelve sons.",
      "links": "<a href='/AIV/3/18/8'>Lev. 18:8</a>;<a href='/AIV/1/49/4'>Gen. 49:4</a>",
      "comment": "Reuben’s action is condemned in the law (Lev. 18:8) and later leads to loss of his primacy (Gen. 49:4). Sin within the covenant family has real consequences, but the covenant itself endures."
    },
    {
      "pk": 1035023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 23,
      "text": "The sons of Leah: Reuben, Jacob’s firstborn, Simeon, Levi, Judah, Issachar, and Zebulun.",
      "links": "<a href='/AIV/1/29/32-35'>Gen. 29:32–35</a>",
      "comment": "The listing of sons begins with Leah, Jacob’s first wife, and highlights the tribal foundation for God’s people."
    },
    {
      "pk": 1035024,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 24,
      "text": "The sons of Rachel: Joseph and Benjamin.",
      "links": "<a href='/AIV/1/30/22-24'>Gen. 30:22–24</a>;<a href='/AIV/1/35/18'>Gen. 35:18</a>",
      "comment": "Rachel’s two sons have key roles in biblical history, with Joseph sustaining the family in Egypt and Benjamin giving rise to the first king of Israel, Saul."
    },
    {
      "pk": 1035025,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 25,
      "text": "The sons of Bilhah, Rachel’s slave: Dan and Naphtali.",
      "links": "<a href='/AIV/1/30/4-8'>Gen. 30:4–8</a>",
      "comment": "Jacob’s sons by Rachel’s servant are fully included in the tribes of Israel, illustrating God’s plan works even through complex family arrangements."
    },
    {
      "pk": 1035026,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 26,
      "text": "The sons of Zilpah, Leah’s slave: Gad and Asher. These are the sons of Jacob, who were born to him in Paddan-aram.",
      "links": "<a href='/AIV/1/30/9-13'>Gen. 30:9–13</a>",
      "comment": "Zilpah's sons complete the list of twelve, a powerful sign of the fullness of God’s chosen people."
    },
    {
      "pk": 1035027,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 27,
      "text": "Jacob came to his father Isaac at Mamre, at Kiriath-arba (that is, Hebron), where Abraham and Isaac had lived as foreigners.",
      "links": "<a href='/AIV/1/13/18'>Gen. 13:18</a>;<a href='/AIV/1/23/2'>Gen. 23:2</a>",
      "comment": "Jacob’s return to Isaac marks a restoration of the generations. Hebron is a location associated with patriarchal resting places, underlining the continuity of faith."
    },
    {
      "pk": 1035028,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 28,
      "text": "And the days of Isaac were one hundred and eighty years.",
      "links": "<a href='/AIV/1/25/7'>Gen. 25:7</a>",
      "comment": "Isaac’s long life is similar to Abraham’s, underlining the blessing of God on the patriarchs as a sign of covenant favor."
    },
    {
      "pk": 1035029,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 35,
      "verse": 29,
      "text": "Isaac breathed his last and died and was gathered to his people, old and full of days, and his sons Esau and Jacob buried him.",
      "links": "<a href='/AIV/1/25/8-9'>Gen. 25:8–9</a>;<a href='/AIV/1/49/33'>Gen. 49:33</a>",
      "comment": "Being 'gathered to his people' indicates belief in continued existence after death. Jacob and Esau together burying Isaac points to family reconciliation and the final honoring of the patriarch, a pattern later continued in salvation history."
    }
  ],
  "translatedAt": "2025-12-24T00:30:44.677Z"
}