{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 28,
  "verses": [
    {
      "pk": 1028001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 1,
      "text": "Then Isaac called Jacob, blessed him, and commanded him, saying, 'You must not take a wife from the daughters of Canaan.'",
      "links": "<a href='/AIV/1/24/3'>Gen. 24:3</a>; <a href='/AIV/6/23/12-13'>Josh. 23:12-13</a>",
      "comment": "Isaac's command sustains the pattern of marrying within the chosen family line, preserving holiness and the promises given to Abraham. This points towards the importance of covenant faithfulness in the people set apart by God."
    },
    {
      "pk": 1028002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 2,
      "text": "'Get up, go to Paddan-Aram, to the house of Bethuel your mother’s father, and marry one of the daughters of Laban, your mother’s brother.'",
      "links": "<a href='/AIV/1/24/4'>Gen. 24:4</a>",
      "comment": "Isaac directs Jacob to continue the family’s pattern, highlighting the importance of heritage and obedience within God’s plans."
    },
    {
      "pk": 1028003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 3,
      "text": "'May God Almighty bless you, make you fruitful and multiply you, so that you will become a company of peoples.'",
      "links": "<a href='/AIV/1/17/1-2'>Gen. 17:1-2</a>; <a href='/AIV/1/35/11'>Gen. 35:11</a>",
      "comment": "The blessing of fertility and multiplication connects with earlier promises to Abraham, setting up Israel as a chosen nation—a holy assembly foreshadowing the gathering of God’s people."
    },
    {
      "pk": 1028004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 4,
      "text": "'And may he give you the blessing of Abraham, to you and to your descendants with you, so that you may possess the land where you now live as a foreigner, the land God gave to Abraham.'",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/1/13/15'>Gen. 13:15</a>",
      "comment": "This verse highlights the passing down of God’s covenant, showing God’s faithfulness over generations and the inheritance of the promised land, foreshadowing spiritual inheritance in Christ."
    },
    {
      "pk": 1028005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 5,
      "text": "So Isaac sent Jacob away, and he went to Paddan-Aram, to Laban, son of Bethuel the Aramean, the brother of Rebekah, mother of Jacob and Esau.",
      "links": "<a href='/AIV/1/25/20'>Gen. 25:20</a>; <a href='/AIV/1/24/29'>Gen. 24:29</a>",
      "comment": "The genealogical detail emphasizes Jacob’s place as heir to the promises."
    },
    {
      "pk": 1028006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 6,
      "text": "Now Esau saw that Isaac had blessed Jacob and sent him away to Paddan-Aram to take a wife from there, and that when he blessed him he commanded, ‘You must not take a wife from the daughters of Canaan,’",
      "links": "<a href='/AIV/1/27/46'>Gen. 27:46</a>; <a href='/AIV/1/26/34-35'>Gen. 26:34-35</a>",
      "comment": "Esau’s observation shows his growing awareness of his parents’ desires and God’s pattern of choosing."
    },
    {
      "pk": 1028007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 7,
      "text": "and that Jacob had obeyed his father and mother and had gone to Paddan-Aram.",
      "links": "<a href='/AIV/1/28/2'>Gen. 28:2</a>",
      "comment": "Jacob’s obedience illustrates faith and submission, two qualities necessary for receiving God’s blessing (see <a href='/AIV/58/11/8'>Heb. 11:8</a>)."
    },
    {
      "pk": 1028008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 8,
      "text": "So Esau saw that the daughters of Canaan did not please Isaac his father.",
      "links": "<a href='/AIV/1/26/35'>Gen. 26:35</a>",
      "comment": "This verse underlines the patriarchal concerns for religious purity within the family."
    },
    {
      "pk": 1028009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 9,
      "text": "So Esau went to Ishmael and married, besides his other wives, Mahalath the daughter of Ishmael, Abraham’s son, the sister of Nebaioth.",
      "links": "<a href='/AIV/1/25/13'>Gen. 25:13</a>; <a href='/AIV/1/36/3'>Gen. 36:3</a>",
      "comment": "Esau tries to remedy his earlier choices by connecting with Abraham’s line, but this cannot alter God’s sovereign choice. This illustrates that heritage alone does not bring blessing, but fidelity to God’s plan."
    },
    {
      "pk": 1028010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 10,
      "text": "Jacob left Beersheba and went toward Haran.",
      "links": "<a href='/AIV/1/27/43'>Gen. 27:43</a>",
      "comment": "Jacob’s journey marks the beginning of his transformation and deepening relationship with God, an example of faith’s pilgrimage."
    },
    {
      "pk": 1028011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 11,
      "text": "He reached a certain place and stayed there for the night, because the sun had set. Taking one of the stones of that place, he put it under his head and lay down in that place to sleep.",
      "links": "<a href='/AIV/1/28/18'>Gen. 28:18</a>",
      "comment": "The ordinary stone will be made extraordinary through God’s encounter, pointing to how physical realities can mediate God’s presence."
    },
    {
      "pk": 1028012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 12,
      "text": "And he dreamed, and behold, a stairway was set up on the earth, and the top of it reached to heaven. And there the angels of God were ascending and descending on it.",
      "links": "<a href='/AIV/43/1/51'>John 1:51</a>; <a href='/AIV/1/32/1-2'>Gen. 32:1-2</a>",
      "comment": "Jacob’s dream reveals the connection between heaven and earth. Jesus references this in John 1:51, showing that He is the true connection—the ladder—between God and man. This has a spiritual sense as it foreshadows access to divine grace through Christ and the mediation of the heavenly host."
    },
    {
      "pk": 1028013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 13,
      "text": "And behold, the LORD stood above it and said, 'I am the LORD, the God of Abraham your father and the God of Isaac. The land on which you are lying, I will give to you and your descendants.'",
      "links": "<a href='/AIV/2/3/6'>Ex. 3:6</a>; <a href='/AIV/1/13/15'>Gen. 13:15</a>",
      "comment": "God affirms His covenant promises, declaring Himself to each generation personally. This shows God’s initiative in revelation, not just man seeking God."
    },
    {
      "pk": 1028014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 14,
      "text": "'Your descendants will be like the dust of the earth, and you will spread out to the west and to the east, to the north and to the south. All the families of the earth will be blessed in you and in your descendants.'",
      "links": "<a href='/AIV/1/13/16'>Gen. 13:16</a>; <a href='/AIV/1/12/3'>Gen. 12:3</a>; <a href='/AIV/48/3/8'>Gal. 3:8</a>",
      "comment": "Echoes the Abrahamic covenant and contains the prophetic promise of the Messiah, through whom all nations are blessed (see Gal. 3:8). Both the literal nation and spiritual fulfillment are in view."
    },
    {
      "pk": 1028015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 15,
      "text": "'Behold, I am with you and will keep you wherever you go, and will bring you back to this land. I will not leave you until I have done what I have promised you.'",
      "links": "<a href='/AIV/1/26/24'>Gen. 26:24</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "God’s assurance of presence prefigures Jesus’ promise in Matthew 28:20. The guarantee is not just physical but spiritual, showing God’s continued guidance and protection."
    },
    {
      "pk": 1028016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 16,
      "text": "Then Jacob woke from his sleep and said, 'Surely the LORD is in this place, and I did not know it.'",
      "links": "<a href='/AIV/2/3/5'>Ex. 3:5</a>",
      "comment": "Jacob recognizes God’s sanctifying presence in ordinary places. An early hint that God’s holiness is not confined to man-made temples."
    },
    {
      "pk": 1028017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 17,
      "text": "He was afraid and said, 'How awesome is this place! This is none other than the house of God, and this is the gate of heaven.'",
      "links": "<a href='/AIV/1/28/22'>Gen. 28:22</a>; <a href='/AIV/19/84/1'>Ps. 84:1</a>",
      "comment": "Jacob’s reverence reveals the importance of recognizing and venerating holy places. It also foreshadows the later development of physical locations as places of meeting God in sacred worship."
    },
    {
      "pk": 1028018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 18,
      "text": "Early in the morning Jacob took the stone he had put under his head, set it up as a pillar, and poured oil on top of it.",
      "links": "<a href='/AIV/1/31/45'>Gen. 31:45</a>; <a href='/AIV/1/35/14'>Gen. 35:14</a>",
      "comment": "The act of setting up the stone and anointing it prefigures the use of material objects in worship. This early practice shows a sacramental understanding—physical things can point to heavenly realities."
    },
    {
      "pk": 1028019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 19,
      "text": "He called the name of that place Bethel, though previously the city was called Luz.",
      "links": "<a href='/AIV/1/12/8'>Gen. 12:8</a>; <a href='/AIV/1/35/7'>Gen. 35:7</a>",
      "comment": "Jacob gives the site a new name reflecting its sacred character. Renaming to acknowledge sanctified spaces appears throughout Scripture."
    },
    {
      "pk": 1028020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 20,
      "text": "Then Jacob made a vow, saying, 'If God will be with me and will keep me on this journey that I go, and will give me bread to eat and clothing to wear,",
      "links": "<a href='/AIV/1/31/13'>Gen. 31:13</a>",
      "comment": "Jacob’s vow expresses trust and establishes a reciprocal relationship with God, laying groundwork for spirituality that involves both divine initiative and human response."
    },
    {
      "pk": 1028021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 21,
      "text": "'so that I come again to my father’s house in peace, then the LORD shall be my God,'",
      "links": "<a href='/AIV/1/33/18-20'>Gen. 33:18-20</a>",
      "comment": "Jacob’s commitment shows faith in the God of his fathers. The fulfillment of vows and offering worship in response to God is a pattern seen throughout Scripture."
    },
    {
      "pk": 1028022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 28,
      "verse": 22,
      "text": "'and this stone, which I have set up as a pillar, will be God’s house. And of all that you give me I will surely give a tenth to you.'",
      "links": "<a href='/AIV/1/14/20'>Gen. 14:20</a>; <a href='/AIV/3/27/30'>Lev. 27:30</a>; <a href='/AIV/58/7/8'>Heb. 7:8</a>",
      "comment": "Jacob’s vow to tithe affirms the principle of giving to God from one’s possessions. The stone as a sign of God’s house anticipates the later establishment of formal places of worship and the call to generosity and stewardship as part of worship."
    }
  ],
  "translatedAt": "2025-12-24T00:25:58.269Z"
}