{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 30,
  "verses": [
    {
      "pk": 19330430,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 1,
      "text": "When Rachel saw that she bore Jacob no children, she was jealous of her sister. She said to Jacob, “Give me children, or I will die!”",
      "links": "<a href='/AIV/1/29/31'>Gen. 29:31</a>; <a href='/AIV/1/16/2'>Gen. 16:2</a>",
      "comment": "Rachel's emotional cry shows the cultural weight placed on bearing children in ancient times. The desire for children often symbolizes God’s blessing; compare to Sarah in Genesis 16."
    },
    {
      "pk": 19330431,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 2,
      "text": "Jacob was angry with Rachel, and he said, “Am I in the place of God, who has withheld from you the fruit of the womb?”",
      "links": "<a href='/AIV/1/16/2'>Gen. 16:2</a>; <a href='/AIV/1/48/9'>Gen. 48:9</a>",
      "comment": "Jacob acknowledges that God alone controls fertility, echoing themes from earlier in Genesis (see 16:2). This points to God as the author of life."
    },
    {
      "pk": 19330432,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 3,
      "text": "Then she said, “Here is my servant Bilhah. Go in to her, that she may bear children on my behalf, so even I may have children by her.”",
      "links": "<a href='/AIV/1/16/2'>Gen. 16:2</a>; <a href='/AIV/1/35/25'>Gen. 35:25</a>",
      "comment": "Rachel imitates Sarah’s precedent, offering her maidservant. This act would have been considered a form of surrogacy in the ancient Near East."
    },
    {
      "pk": 19330433,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 4,
      "text": "So she gave her servant Bilhah to Jacob as a wife, and Jacob went in to her.",
      "links": "<a href='/AIV/1/29/29'>Gen. 29:29</a>",
      "comment": "The term 'wife' here shows that Billhah’s children would be Rachel’s legal offspring (see also Gen. 16:3), noting how the patriarchal line develops."
    },
    {
      "pk": 19330434,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 5,
      "text": "And Bilhah conceived and bore Jacob a son.",
      "links": "<a href='/AIV/1/35/25'>Gen. 35:25</a>",
      "comment": "Bilhah’s child counts as Rachel’s by legal custom, expanding Jacob’s family. God is seen as continuing His promise through different means."
    },
    {
      "pk": 19330435,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 6,
      "text": "Then Rachel said, “God has judged me, and has also heard my voice and given me a son.” Therefore she called his name Dan.",
      "links": "<a href='/AIV/1/49/16'>Gen. 49:16</a>",
      "comment": "Dan means 'judged.' Rachel acknowledges God's justice and attentiveness, revealing her faith that God intervenes for her (compare Hannah in 1 Sam. 1)."
    },
    {
      "pk": 19330436,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 7,
      "text": "Rachel’s servant Bilhah conceived again and bore Jacob a second son.",
      "links": "<a href='/AIV/1/35/25'>Gen. 35:25</a>",
      "comment": "God allows further increase to Jacob’s household through Bilhah. The notion of God working through secondary means is a recurring theme."
    },
    {
      "pk": 19330437,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 8,
      "text": "Then Rachel said, “With mighty wrestlings I have wrestled with my sister and have prevailed.” So she called his name Naphtali.",
      "links": "<a href='/AIV/1/49/21'>Gen. 49:21</a>",
      "comment": "Naphtali means ‘my wrestling.’ Rachel sees her struggle with Leah as a contest, but the real victory is in God’s providence."
    },
    {
      "pk": 19330438,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 9,
      "text": "When Leah saw that she had stopped bearing children, she took her servant Zilpah and gave her to Jacob as a wife.",
      "links": "<a href='/AIV/1/29/24'>Gen. 29:24</a>",
      "comment": "Similar to Rachel, Leah follows the custom of surrogate motherhood, showing cultural expectations and family rivalry."
    },
    {
      "pk": 19330439,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 10,
      "text": "Leah’s servant Zilpah bore Jacob a son.",
      "links": "<a href='/AIV/1/35/26'>Gen. 35:26</a>",
      "comment": "Zilpah’s sons increase Leah’s claim in the family rivalry. God continues to expand Israel through unexpected means."
    },
    {
      "pk": 19330440,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 11,
      "text": "Then Leah said, “Good fortune has come!” So she called his name Gad.",
      "links": "<a href='/AIV/1/49/19'>Gen. 49:19</a>",
      "comment": "Gad means 'good fortune.' Leah recognizes the event as a blessing, a theme seen throughout Genesis."
    },
    {
      "pk": 19330441,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 12,
      "text": "Leah’s servant Zilpah bore Jacob a second son.",
      "links": "<a href='/AIV/1/35/26'>Gen. 35:26</a>",
      "comment": "Expansion of Jacob’s lineage continues, furthering the twelve tribes of Israel—God’s plan works through human frailty."
    },
    {
      "pk": 19330442,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 13,
      "text": "Then Leah said, “Happy am I! For women have called me happy.” So she called his name Asher.",
      "links": "<a href='/AIV/1/49/20'>Gen. 49:20</a>",
      "comment": "Asher means 'happy.' Leah credits her happiness to God’s gift, subtly showing gratitude."
    },
    {
      "pk": 19330443,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 14,
      "text": "In the days of wheat harvest, Reuben went and found mandrakes in the field and brought them to his mother Leah. Then Rachel said to Leah, “Please give me some of your son’s mandrakes.”",
      "links": "<a href='/AIV/1/25/30'>Gen. 25:30</a>",
      "comment": "Mandrakes were believed to promote fertility, revealing the sisters’ hope for God’s blessing and the value of children."
    },
    {
      "pk": 19330444,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 15,
      "text": "But she said to her, “Is it a small matter that you have taken my husband? Would you also take my son’s mandrakes?” Then Rachel said, “He may lie with you tonight in exchange for your son’s mandrakes.”",
      "links": "<a href='/AIV/1/29/32'>Gen. 29:32</a>",
      "comment": "Leah voices the ongoing rivalry, expressing deep hurt. The barter shows human attempts to gain God’s favor through means other than faith."
    },
    {
      "pk": 19330445,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 16,
      "text": "So when Jacob came in from the field in the evening, Leah went out to meet him and said, “You must come in to me, for I have hired you with my son’s mandrakes.” So he lay with her that night.",
      "links": "<a href='/AIV/1/29/21'>Gen. 29:21</a>",
      "comment": "The dynamics of their family continue to reveal both humanity’s brokenness and God’s ability to work through it."
    },
    {
      "pk": 19330446,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 17,
      "text": "God listened to Leah, and she conceived and bore Jacob a fifth son.",
      "links": "<a href='/AIV/1/29/31'>Gen. 29:31</a>",
      "comment": "God listens to Leah’s prayers, showing divine responsiveness. This is a reminder that persistent prayer yields fruit (cf. Luke 18:1-8)."
    },
    {
      "pk": 19330447,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 18,
      "text": "Leah said, “God has given me my wages because I gave my servant to my husband.” So she called his name Issachar.",
      "links": "<a href='/AIV/1/49/14'>Gen. 49:14</a>",
      "comment": "Issachar means ‘wages.’ There is a sense that Leah sees God’s justice at work, rewarding her self-giving."
    },
    {
      "pk": 19330448,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 19,
      "text": "Leah conceived again, and bore Jacob a sixth son.",
      "links": "<a href='/AIV/1/35/23'>Gen. 35:23</a>",
      "comment": "The sixth son marks Leah’s continued fertility and favor—evidence of God’s grace through ordinary means."
    },
    {
      "pk": 19330449,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 20,
      "text": "Leah said, “God has endowed me with a good gift. Now my husband will honor me, because I have borne him six sons.” So she called his name Zebulun.",
      "links": "<a href='/AIV/1/49/13'>Gen. 49:13</a>",
      "comment": "Zebulun relates to 'honor' or 'dwelling.' Leah’s hope is for restored affection, but true blessing comes from God’s providential plan."
    },
    {
      "pk": 19330450,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 21,
      "text": "Afterward she bore a daughter and called her name Dinah.",
      "links": "<a href='/AIV/1/34/1'>Gen. 34:1</a>",
      "comment": "Dinah’s birth is mentioned because of events in Gen. 34. The inclusion of a daughter among sons is unusual and important."
    },
    {
      "pk": 19330451,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 22,
      "text": "Then God remembered Rachel, and God listened to her and opened her womb.",
      "links": "<a href='/AIV/1/21/1'>Gen. 21:1</a>; <a href='/AIV/1/8/1'>Gen. 8:1</a>",
      "comment": "God’s remembrance shows divine compassion (cf. 1 Sam. 1:19-20). Rachel’s hope is realized according to God’s perfect timing."
    },
    {
      "pk": 19330452,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 23,
      "text": "She conceived and bore a son, and said, “God has taken away my disgrace.”",
      "links": "<a href='/AIV/1/19/23'>Gen. 19:23</a>",
      "comment": "Barrenness was considered a reproach, but God’s intervention removes shame. See parallels in Luke 1:25 with Elizabeth."
    },
    {
      "pk": 19330453,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 24,
      "text": "She called his name Joseph, saying, “May the LORD add to me another son!”",
      "links": "<a href='/AIV/1/41/45'>Gen. 41:45</a>",
      "comment": "Joseph means 'may He add.' Rachel’s faith persists, desiring more from God. Joseph’s birth begins a pivotal story for Israel’s future."
    },
    {
      "pk": 19330454,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 25,
      "text": "After Rachel had given birth to Joseph, Jacob said to Laban, “Send me away, that I may go to my own place and to my own country.”",
      "links": "<a href='/AIV/1/31/3'>Gen. 31:3</a>",
      "comment": "Jacob’s desire to return home echoes God’s promise in Gen. 28:15. The motif of journeying toward the promised land anticipates later promises to Israel."
    },
    {
      "pk": 19330455,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 26,
      "text": "Give me my wives and my children for whom I have served you, and let me go, for you know the service I have given you.”",
      "links": "<a href='/AIV/1/29/20-28'>Gen. 29:20-28</a>",
      "comment": "Jacob reminds Laban of the contractual arrangement; he claims his family by right and seeks a new beginning."
    },
    {
      "pk": 19330456,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 27,
      "text": "But Laban said to him, “If I have found favor in your eyes, I have learned by divination that the LORD has blessed me because of you.”",
      "links": "<a href='/AIV/1/39/5'>Gen. 39:5</a>",
      "comment": "Even those outside the covenant recognize that God’s blessing rests on Jacob. God’s plan draws all nations into blessing—a theme fulfilled in Christ (Gal. 3:8)."
    },
    {
      "pk": 19330457,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 28,
      "text": "He said, “Name your wages, and I will give it.”",
      "links": "<a href='/AIV/1/31/7'>Gen. 31:7</a>",
      "comment": "Laban’s willingness to negotiate demonstrates Jacob’s value—a sign of God’s tangible favor."
    },
    {
      "pk": 19330458,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 29,
      "text": "Jacob said to him, “You know how I have served you, and how your livestock has fared with me.",
      "links": "<a href='/AIV/1/31/38-40'>Gen. 31:38-40</a>",
      "comment": "Jacob appeals to his hard work and Laban’s prosperity—a call for justice and rightful reward."
    },
    {
      "pk": 19330459,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 30,
      "text": "For you had little before I came, and it has increased abundantly. The LORD has blessed you wherever I turned. But now when shall I provide for my own household also?”",
      "links": "<a href='/AIV/1/12/2-3'>Gen. 12:2-3</a>",
      "comment": "The Abrahamic blessing works through Jacob, fulfilling God’s promise to bless those who bless the chosen line."
    },
    {
      "pk": 19330460,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 31,
      "text": "He said, “What shall I give you?” Jacob said, “You shall not give me anything. If you will do this for me, I will again pasture and keep your flock:",
      "links": "<a href='/AIV/1/30/28'>Gen. 30:28</a>",
      "comment": "Jacob is shrewd and fair, seeking to establish his household through his own labor, not gifts."
    },
    {
      "pk": 19330461,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 32,
      "text": "Let me pass through all your flock today, removing every speckled and spotted sheep and every black lamb, and the spotted and speckled among the goats, and they shall be my wages.",
      "links": "<a href='/AIV/1/31/8-9'>Gen. 31:8-9</a>",
      "comment": "Jacob’s proposal favors Laban, as speckled or black sheep and goats would have been rare. This element sets up the following display of God’s providence."
    },
    {
      "pk": 19330462,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 33,
      "text": "So my honesty will answer for me in the future, when you come to look into my wages with you. Everyone that is not speckled and spotted among the goats, or black among the lambs, if found with me, shall be counted stolen.”",
      "links": "<a href='/AIV/1/31/37'>Gen. 31:37</a>",
      "comment": "Jacob sets a standard for transparency; his honesty contrasts with Laban’s deception."
    },
    {
      "pk": 19330463,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 34,
      "text": "Laban said, “Good! Let it be as you have said.”",
      "links": "<a href='/AIV/1/31/7'>Gen. 31:7</a>",
      "comment": "Laban, recognizing the risk is slim, accepts. The human story is interwoven with God’s invisible guidance."
    },
    {
      "pk": 19330464,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 35,
      "text": "But that day Laban removed the male goats that were striped and spotted, and all the female goats that were speckled and spotted, every one that had white on it, and every lamb that was black, and put them in the care of his sons.",
      "links": "<a href='/AIV/1/31/9'>Gen. 31:9</a>",
      "comment": "Laban attempts to cheat Jacob, yet God’s plan cannot be subverted by human schemes."
    },
    {
      "pk": 19330465,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 36,
      "text": "And he set a distance of three days’ journey between himself and Jacob, and Jacob pastured the rest of Laban’s flock.",
      "links": "<a href='/AIV/1/31/24'>Gen. 31:24</a>",
      "comment": "The separation increases the perceived improbability of Jacob prospering. Again, God's sovereignty shines through apparent disadvantage."
    },
    {
      "pk": 19330466,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 37,
      "text": "Then Jacob took fresh sticks of poplar, almond, and plane trees, and peeled white streaks in them, exposing the white of the sticks.",
      "links": "<a href='/AIV/1/30/41-42'>Gen. 30:41-42</a>",
      "comment": "Jacob uses folk practices. Yet, it is God who determines the outcome, not mere superstition."
    },
    {
      "pk": 19330467,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 38,
      "text": "He set the sticks that he had peeled in front of the flocks in the troughs, that is, the watering places, where the flocks came to drink. And since they bred when they came to drink,",
      "links": "<a href='/AIV/1/30/39'>Gen. 30:39</a>",
      "comment": "The ancient belief was that visual impressions affected offspring. The text lays the groundwork for God to act, regardless of human methods."
    },
    {
      "pk": 19330468,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 39,
      "text": "the flocks bred in front of the sticks, and so the flocks brought forth striped, speckled, and spotted young.",
      "links": "<a href='/AIV/1/31/9-12'>Gen. 31:9-12</a>",
      "comment": "God prospers Jacob supernaturally. Human schemes cannot limit God’s faithfulness to His promises."
    },
    {
      "pk": 19330469,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 40,
      "text": "And Jacob separated the lambs and set the faces of the flocks toward the striped and all the black in the flock of Laban. He put his own droves apart and did not put them with Laban’s flock.",
      "links": "<a href='/AIV/1/31/8-9'>Gen. 31:8-9</a>",
      "comment": "Jacob uses careful breeding techniques, but the increase reflects God’s providence more than human wisdom."
    },
    {
      "pk": 19330470,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 41,
      "text": "Whenever the stronger of the flocks were breeding, Jacob would lay the sticks in the troughs before the eyes of the flock, that they might breed among the sticks,",
      "links": "<a href='/AIV/1/30/37'>Gen. 30:37</a>",
      "comment": "Jacob attempts to favor stronger animals. Again, human action assumes secondary importance; God’s will is at work behind the scenes."
    },
    {
      "pk": 19330471,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 42,
      "text": "but for the feebler of the flock he would not set them. Therefore the feebler were Laban’s and the stronger Jacob’s.",
      "links": "<a href='/AIV/1/31/8-9'>Gen. 31:8-9</a>",
      "comment": "This reversal fits the biblical theme of God lifting up the humble and giving victory to the seemingly disadvantaged—in Luke 1:52, “He has lifted up the lowly.”"
    },
    {
      "pk": 19330472,
      "translation": "AIV",
      "book": 1,
      "chapter": 30,
      "verse": 43,
      "text": "Thus the man became exceedingly prosperous, and had large flocks, female and male servants, camels, and donkeys.",
      "links": "<a href='/AIV/1/24/35'>Gen. 24:35</a>",
      "comment": "Jacob’s prosperity fulfills God’s covenant. The just are rewarded and the message of blessing for the faithful is confirmed. This continues the line leading to Israel and, ultimately, Christ, the true fulfillment of the blessing."
    }
  ],
  "translatedAt": "2025-12-23T08:50:06.431Z"
}