{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 15,
  "verses": [
    {
      "pk": 1015001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 1,
      "text": "After these events, the word of the LORD came to Abram in a vision, saying, \"Do not be afraid, Abram. I am your shield; your reward will be very great.\"",
      "links": "<a href='/AIV/19/3/3'>Ps. 3:3</a>; <a href='/AIV/42/1/13'>Luke 1:13</a>",
      "comment": "God appears to Abram and reassures him of His protection and of a significant reward. The motif of 'not being afraid' recurs throughout scripture, especially when God announces a covenant or mission (see <a href='/AIV/42/1/13'>Luke 1:13</a>). The theme of God as a shield is found in the Psalms (<a href='/AIV/19/3/3'>Ps. 3:3</a>). Here, God's initiative in grace prefigures the New Covenant, hinting at God's desire for close relationship—an anticipatory type of future divine covenants."
    },
    {
      "pk": 1015002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 2,
      "text": "But Abram said, \"Lord GOD, what can You give me, since I remain childless and the heir of my house is Eliezer of Damascus?\"",
      "links": "<a href='/AIV/1/12/2'>Gen. 12:2</a>; <a href='/AIV/1/25/21'>Gen. 25:21</a>",
      "comment": "Abram respectfully questions God about the fulfillment of His promise, since he has no child. This moment of dialogue displays the intimacy allowed between God and man. It also foreshadows the struggle of faith and emphasizes the need for trust even when promises seem delayed (cf. <a href='/AIV/1/25/21'>Gen. 25:21</a>)."
    },
    {
      "pk": 1015003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 3,
      "text": "Abram said, \"Look, You have given me no offspring, so a servant born in my house will be my heir.\"",
      "links": "<a href='/AIV/1/24/2'>Gen. 24:2</a>",
      "comment": "The ancient custom required a childless couple to adopt an heir, typically a trusted servant. Abram's words show honest lament and a desire for God’s promises to be fulfilled in their fullness, not through mere human arrangements."
    },
    {
      "pk": 1015004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 4,
      "text": "Then the word of the LORD came to him, saying, \"This one will not be your heir, but your own son, who will come from your own body, will be your heir.\"",
      "links": "<a href='/AIV/1/17/16'>Gen. 17:16</a>; <a href='/AIV/58/11/11-12'>Heb. 11:11-12</a>",
      "comment": "God insists that the covenant promises will be fulfilled through Abram's actual offspring. This prophecy has both immediate and long-term significance, as it also hints at God's sovereign choice and the deeper spiritual lineage later invoked by Paul (<a href='/AIV/58/11/11-12'>Heb. 11:11-12</a>)."
    },
    {
      "pk": 1015005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 5,
      "text": "He brought him outside and said, \"Look up at the sky and count the stars, if you are able to count them.\" Then He said to him, \"So shall your offspring be.\"",
      "links": "<a href='/AIV/1/22/17'>Gen. 22:17</a>; <a href='/AIV/45/4/18'>Rom. 4:18</a>",
      "comment": "God uses the starry sky as a sign of an innumerable posterity, emphasizing the miraculous nature of the promise. This prefigures spiritual descendants—those who will share faith like Abraham’s (cf. <a href='/AIV/45/4/18'>Rom. 4:18</a>), a theme developed in the New Testament. There is both a literal and spiritual fulfillment present."
    },
    {
      "pk": 1015006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 6,
      "text": "He believed the LORD, and He counted it to him as righteousness.",
      "links": "<a href='/AIV/45/4/3'>Rom. 4:3</a>; <a href='/AIV/48/3/6'>Gal. 3:6</a>; <a href='/AIV/58/11/8'>Heb. 11:8</a>",
      "comment": "This critical verse shows that faith (trusting God's promise) is the basis for righteousness before God (<a href='/AIV/45/4/3'>Rom. 4:3</a>; <a href='/AIV/48/3/6'>Gal. 3:6</a>). However, throughout Scripture, this faith is always connected to obedience, action, and covenant relationship. The notion of faith and works being united is important here."
    },
    {
      "pk": 1015007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 7,
      "text": "He also said to him, \"I am the LORD who brought you out from Ur of the Chaldeans to give you this land to possess.\"",
      "links": "<a href='/AIV/1/11/31'>Gen. 11:31</a>; <a href='/AIV/2/3/8'>Exod. 3:8</a>",
      "comment": "The reminder of deliverance from Ur roots Abram’s call in redemptive history, setting the stage for later acts of God’s saving work, such as the exodus. God’s initiative and faithfulness to His promises are highlighted here."
    },
    {
      "pk": 1015008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 8,
      "text": "But he said, \"Lord GOD, how will I know that I will possess it?\"",
      "links": "<a href='/AIV/7/6/17'>Judg. 6:17</a>; <a href='/AIV/42/1/34'>Luke 1:34</a>",
      "comment": "Abram asks for confirmation, not out of disbelief but a desire for assurance. God often responds to honest inquiry with a sign or covenant, as here and elsewhere (see <a href='/AIV/42/1/34'>Luke 1:34</a>)."
    },
    {
      "pk": 1015009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 9,
      "text": "He said to him, \"Bring Me a three-year-old heifer, a three-year-old female goat, a three-year-old ram, a turtledove, and a young pigeon.\"",
      "links": "<a href='/AIV/3/14/22'>Lev. 14:22</a>",
      "comment": "God instructs Abram to prepare for a covenant ceremony using animals significant in later sacrificial law. These elements anticipate the sacrifices that will later be formalized for worship and atonement, showing a continuity in God’s requirements."
    },
    {
      "pk": 1015010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 10,
      "text": "So he brought all these to Him, cut them in two, and laid each half opposite the other; but he did not cut the birds.",
      "links": "<a href='/AIV/24/34/18-19'>Jer. 34:18-19</a>",
      "comment": "Dividing the animals was part of a covenant ritual, symbolizing the severe consequences for breaking covenant. The omission of dividing the birds is not explained, but is consistent with later sacrificial laws."
    },
    {
      "pk": 1015011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 11,
      "text": "The birds of prey came down on the carcasses, but Abram drove them away.",
      "links": "<a href='/AIV/1/40/16-17'>Gen. 40:16-17</a>",
      "comment": "The presence of the birds of prey can symbolize opposition to God's plan or the threat of corruption. Abram’s action shows vigilance and participation needed in the covenant process."
    },
    {
      "pk": 1015012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 12,
      "text": "As the sun was going down, a deep sleep fell upon Abram; and, behold, a terror and great darkness fell upon him.",
      "links": "<a href='/AIV/1/2/21'>Gen. 2:21</a>; <a href='/AIV/41/14/33-34'>Mark 14:33-34</a>",
      "comment": "Abram enters a supernatural sleep (cf. <a href='/AIV/1/2/21'>Gen. 2:21</a>). The imagery of darkness and fear points to the gravity and solemn nature of the covenant, but also prefigures the suffering of Abram’s descendants."
    },
    {
      "pk": 1015013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 13,
      "text": "Then He said to Abram, \"Know certainly that your descendants will be strangers in a land that is not theirs, and will serve them, and they will be afflicted for four hundred years.\"",
      "links": "<a href='/AIV/2/1/11'>Exod. 1:11</a>; <a href='/AIV/44/7/6'>Acts 7:6</a>",
      "comment": "Here God prophesies Israel’s slavery in Egypt. This connects directly to the broader narrative of redemption, a pattern echoed in later deliverances, and ultimately, in the salvation accomplished by Christ (cf. <a href='/AIV/44/7/6'>Acts 7:6</a>)."
    },
    {
      "pk": 1015014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 14,
      "text": "But I will judge the nation that they serve, and afterward they will come out with great possessions.",
      "links": "<a href='/AIV/2/12/36'>Exod. 12:36</a>",
      "comment": "A promise of both divine justice against the oppressors and restoration for God’s people, fulfilled in the exodus (<a href='/AIV/2/12/36'>Exod. 12:36</a>). The pattern of suffering followed by vindication will later be seen in Christ’s Paschal mystery."
    },
    {
      "pk": 1015015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 15,
      "text": "As for you, you will go to your fathers in peace; you will be buried at a good old age.",
      "links": "<a href='/AIV/1/25/8'>Gen. 25:8</a>",
      "comment": "God reassures Abram of a peaceful life and natural death—a blessing connected with righteousness. The reference to 'your fathers' indicates a belief in continued existence and communion after death."
    },
    {
      "pk": 1015016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 16,
      "text": "In the fourth generation, your descendants will return here, for the iniquity of the Amorites is not yet complete.\"",
      "links": "<a href='/AIV/3/18/25'>Lev. 18:25</a>",
      "comment": "This verse reveals God’s patient justice—punishments are not arbitrary but contingent on moral completion. God’s timing incorporates both justice and mercy, and displays His providence over history (see <a href='/AIV/3/18/25'>Lev. 18:25</a>)."
    },
    {
      "pk": 1015017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 17,
      "text": "When the sun had gone down and it was dark, a smoking firepot and a flaming torch passed between these pieces.",
      "links": "<a href='/AIV/2/13/21'>Exod. 13:21</a>; <a href='/AIV/11/18/38'>1 Kings 18:38</a>",
      "comment": "These symbolize God’s presence, passing alone through the animals. God binds Himself to the covenant unilaterally, a foreshadowing of His faithfulness even when His people fail. The imagery of fire and smoke prefigures later theophanies (cf. <a href='/AIV/2/13/21'>Exod. 13:21</a>)."
    },
    {
      "pk": 1015018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 18,
      "text": "On that day, the LORD made a covenant with Abram, saying, \"To your descendants I have given this land, from the river of Egypt to the great river, the river Euphrates:",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/5/11/24'>Deut. 11:24</a>",
      "comment": "The formal covenant is established and specifies the land grant. Covenants in scripture are binding and solemn—a key foundation for the future people of God, prefiguring later sacraments and new covenants."
    },
    {
      "pk": 1015019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 19,
      "text": "the land of the Kenites, the Kenizzites, the Kadmonites,",
      "links": "<a href='/AIV/2/3/8'>Exod. 3:8</a>",
      "comment": "A list of peoples inhabiting the promised land at the time. This points to the universality of the coming blessing, eventually fulfilled in God's plan to bring all nations to Himself."
    },
    {
      "pk": 1015020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 20,
      "text": "the Hittites, the Perizzites, the Rephaim,",
      "links": "<a href='/AIV/5/7/1'>Deut. 7:1</a>; <a href='/AIV/6/12/4'>Josh. 12:4</a>",
      "comment": "The continuation of the territorial list connects God’s temporal blessings with future spiritual inheritance. The detailed names highlight the totality and completeness of God’s gift."
    },
    {
      "pk": 1015021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 15,
      "verse": 21,
      "text": "the Amorites, the Canaanites, the Girgashites, and the Jebusites.\"",
      "links": "<a href='/AIV/1/10/16'>Gen. 10:16-18</a>; <a href='/AIV/6/24/11'>Josh. 24:11</a>",
      "comment": "The full list concludes the covenant promise. In a spiritual sense, this foreshadows the incorporation of all peoples into God’s ultimate covenant family. The unity and continuity of God’s promises develops throughout Scripture and finds fulfillment in Christ (cf. <a href='/AIV/6/24/11'>Josh. 24:11</a>)."
    }
  ],
  "translatedAt": "2025-12-24T00:17:43.231Z"
}