{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 16,
  "verses": [
    {
      "pk": 121601,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 1,
      "text": "Now Sarai, Abram’s wife, had borne him no children. But she had an Egyptian servant whose name was Hagar.",
      "links": "<a href='/AIV/1/12/16'>Gen. 12:16</a>; <a href='/AIV/1/21/9'>Gen. 21:9</a>",
      "comment": "The mention of Hagar introduces the servant’s role in God's unfolding plan. Sarai’s barrenness recalls other key women in salvation history who miraculously bear children (cf. Gen. 21:2, 25:21, Luke 1:7–13)."
    },
    {
      "pk": 121602,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 2,
      "text": "So Sarai said to Abram, 'See now, the Lord has prevented me from bearing children. Go in to my servant; perhaps I may obtain children by her.' And Abram listened to Sarai.",
      "links": "<a href='/AIV/1/30/3'>Gen. 30:3</a>; <a href='/AIV/1/15/2-4'>Gen. 15:2-4</a>",
      "comment": "Sarai’s solution reflects an ancient practice (cf. Gen. 30:3), but also shows impatience with God's promise. This passage foreshadows the theme of waiting for supernatural intervention rather than relying on human wisdom."
    },
    {
      "pk": 121603,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 3,
      "text": "After Abram had lived ten years in the land of Canaan, Sarai, Abram’s wife, took Hagar the Egyptian, her servant, and gave her to Abram her husband as a wife.",
      "links": "<a href='/AIV/1/12/5'>Gen. 12:5</a>; <a href='/AIV/1/25/1'>Gen. 25:1</a>",
      "comment": "The explicit mention of 'as a wife' points to Hagar’s elevation in status for the purpose of bearing children, underlining both the human longing and the complexity of God's covenant plan."
    },
    {
      "pk": 121604,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 4,
      "text": "And he went in to Hagar, and she conceived. And when she saw that she had conceived, her mistress was despised in her eyes.",
      "links": "<a href='/AIV/1/29/31-32'>Gen. 29:31-32</a>; <a href='/AIV/9/1/6'>1 Sam. 1:6</a>",
      "comment": "Hagar’s conception brings tension between her and Sarai, paralleling later rivalries (cf. the stories of Leah and Rachel, and Hannah and Peninnah)."
    },
    {
      "pk": 121605,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 5,
      "text": "And Sarai said to Abram, 'May the wrong done to me be upon you! I gave my servant into your arms, and when she saw that she had conceived, I have become despised in her eyes. May the Lord judge between you and me.'",
      "links": "<a href='/AIV/1/31/53'>Gen. 31:53</a>",
      "comment": "Sarai appeals to the Lord as ultimate judge, hinting at the seriousness of human conflict and the need for divine resolution—an early type of seeking reconciliation in God's presence."
    },
    {
      "pk": 121606,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 6,
      "text": "But Abram said to Sarai, 'Look, your servant is in your hand; do to her as you think best.' Then Sarai dealt harshly with her, and she fled from her presence.",
      "links": "<a href='/AIV/1/21/10'>Gen. 21:10</a>",
      "comment": "Abram delegates the decision to Sarai, resulting in suffering for Hagar. This is a warning against abdicating spiritual responsibility, a theme echoed throughout Scripture."
    },
    {
      "pk": 121607,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 7,
      "text": "The angel of the Lord found her by a spring of water in the wilderness, on the way to Shur.",
      "links": "<a href='/AIV/2/3/2'>Exod. 3:2</a>; <a href='/AIV/7/6/12'>Judg. 6:12</a>",
      "comment": "The appearance of the Angel of the Lord often signals a direct manifestation of God, foreshadowing later theophanies and even the Incarnation (Exod. 3:2; John 1:14)."
    },
    {
      "pk": 121608,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 8,
      "text": "And he said, 'Hagar, servant of Sarai, where have you come from, and where are you going?' She said, 'I am fleeing from my mistress Sarai.'",
      "links": "<a href='/AIV/1/3/9'>Gen. 3:9</a>",
      "comment": "God's questioning recalls God's search for Adam and Eve (Gen. 3:9), highlighting His personal care and pursuit of the lost."
    },
    {
      "pk": 121609,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 9,
      "text": "Then the angel of the Lord said to her, 'Return to your mistress and submit yourself under her hand.'",
      "links": "<a href='/AIV/1/21/12'>Gen. 21:12</a>",
      "comment": "Hagar is told to embrace humility and obedience—virtues that unlock blessings. This anticipates the call for submission to God's will even when difficult (Luke 1:38; Phil. 2:8)."
    },
    {
      "pk": 121610,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 10,
      "text": "And the angel of the Lord also said, 'I will surely multiply your descendants so that they shall be too many to count.'",
      "links": "<a href='/AIV/1/17/20'>Gen. 17:20</a>; <a href='/AIV/1/21/13'>Gen. 21:13</a>",
      "comment": "This echoes the promise to Abram (Gen. 13:16), demonstrating God's mercy extends beyond chosen individuals, foreshadowing the expansion of blessing to all nations."
    },
    {
      "pk": 121611,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 11,
      "text": "And the angel of the Lord said to her, 'Behold, you are with child and shall bear a son; you shall call his name Ishmael, because the Lord has heard your affliction.'",
      "links": "<a href='/AIV/1/17/19'>Gen. 17:19</a>; <a href='/AIV/1/21/17'>Gen. 21:17'>Gen. 29:32</a>",
      "comment": "The naming by divine instruction is significant (cf. Gen. 17:19, Luke 1:13), revealing God's intimate involvement in human destiny."
    },
    {
      "pk": 121612,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 12,
      "text": "He will be a wild donkey of a man, his hand against everyone and everyone’s hand against him, and he will dwell in the presence of all his brothers.'",
      "links": "<a href='/AIV/1/25/18'>Gen. 25:18</a>",
      "comment": "Ishmael’s role as the ancestor of many nations is linked to prophecy and the ongoing story of salvation history. His conflict foreshadows the struggles yet the fulfillment of God’s word."
    },
    {
      "pk": 121613,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 13,
      "text": "So she called the name of the Lord who spoke to her, 'You are the God who sees me,' for she said, 'Here truly I have seen him who looks after me.'",
      "links": "<a href='/AIV/1/32/30'>Gen. 32:30</a>; <a href='/AIV/20/15/3'>Prov. 15:3</a>",
      "comment": "Hagar’s recognition that God sees and cares introduces the theme of divine omniscience and compassion—a key foundation for trust in God's providence."
    },
    {
      "pk": 121614,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 14,
      "text": "Therefore the well was called Beer-lahai-roi; it is between Kadesh and Bered.",
      "links": "<a href='/AIV/1/24/62'>Gen. 24:62</a>",
      "comment": "The naming of places for divine encounters emphasizes the physical reality of God’s intervention in history, showing faith is both spiritual and historical."
    },
    {
      "pk": 121615,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 15,
      "text": "And Hagar bore Abram a son, and Abram called the name of his son, whom Hagar bore, Ishmael.",
      "links": "<a href='/AIV/1/21/17'>Gen. 21:17</a>",
      "comment": "The fulfillment of the angel’s message illustrates God's faithfulness and the power of his word to bring about life even through unexpected means."
    },
    {
      "pk": 121616,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 16,
      "text": "Abram was eighty-six years old when Hagar bore Ishmael to him.",
      "links": "<a href='/AIV/1/12/4'>Gen. 12:4</a>; <a href='/AIV/1/21/5'>Gen. 21:5</a>",
      "comment": "The specific age marks the timeline for the development of salvation history, underlining the patience and faith needed to trust God’s long-term plan. This passage invites reflection on submission to divine timing, foreshadowing ultimate fulfillment in the arrival of the true promised Son."
    }
  ],
  "translatedAt": "2025-12-23T08:41:26.467Z"
}