{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 26,
  "verses": [
    {
      "pk": 2002601,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 1,
      "text": "Now there was a famine in the land, besides the earlier famine in Abraham’s time. And Isaac went to Abimelech, king of the Philistines, in Gerar.",
      "links": "<a href='/AIV/1/12/10'>Gen. 12:10</a>; <a href='/AIV/1/20/1-2'>Gen. 20:1-2</a>",
      "comment": "The mention of famine echoes the experience of Abraham in Genesis 12:10. Isaac retraces his father’s footsteps, a motif highlighting the continuity of the chosen family’s journey."
    },
    {
      "pk": 2002602,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 2,
      "text": "The LORD appeared to him and said, 'Do not go down to Egypt; stay in the land I will tell you about.'",
      "links": "<a href='/AIV/1/12/10'>Gen. 12:10</a>; <a href='/AIV/1/46/3'>Gen. 46:3</a>",
      "comment": "God directly communicates with Isaac, indicating continued guidance and a special calling. The theme of obedience to God’s specific directives is important."
    },
    {
      "pk": 2002603,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 3,
      "text": "Live in this land as a foreigner, and I will be with you and will bless you; for to you and to your descendants I will give all these lands, and I will confirm the promise I swore to your father Abraham.",
      "links": "<a href='/AIV/1/13/15'>Gen. 13:15</a>; <a href='/AIV/1/22/16-18'>Gen. 22:16-18</a>",
      "comment": "This is a reaffirmation of the Abrahamic covenant: land, blessing, and descendants (see Genesis 15:18-21). The covenant is passed through Isaac, showing God’s faithfulness."
    },
    {
      "pk": 2002604,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 4,
      "text": "And I will multiply your offspring as the stars of heaven, and I will give your descendants all these lands. And in your offspring all the nations of the earth will be blessed,",
      "links": "<a href='/AIV/1/22/17-18'>Gen. 22:17-18</a>; <a href='/AIV/1/12/3'>Gen. 12:3</a>; <a href='/AIV/19/72/17'>Ps. 72:17</a>; <a href='/AIV/48/3/14'>Gal. 3:14</a>",
      "comment": "This verse points forward to the universal blessing through the line of Abraham fulfilled in Christ (Galatians 3:16). The promise extends to all nations—a key Old Testament precursor to the gospel’s worldwide mission."
    },
    {
      "pk": 2002605,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 5,
      "text": "because Abraham obeyed my voice and kept my charge, my commands, my statutes, and my laws.",
      "links": "<a href='/AIV/1/18/19'>Gen. 18:19</a>; <a href='/AIV/5/11/1'>Deut. 11:1</a>",
      "comment": "Here, the obedience of Abraham is described in terms of law and command—language anticipating later Torah. Obedience leads to blessing, modeling the faith/works dynamic."
    },
    {
      "pk": 2002606,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 6,
      "text": "So Isaac settled in Gerar.",
      "links": "<a href='/AIV/1/26/1'>v. 1</a>",
      "comment": "Isaac obeys God and remains in Gerar, showing trust in God’s guidance over self-reliance."
    },
    {
      "pk": 2002607,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 7,
      "text": "When the men of the place asked him about his wife, he said, 'She is my sister,' for he was afraid to say, 'She is my wife,' thinking, 'The men of the place might kill me because of Rebekah,' for she was beautiful.",
      "links": "<a href='/AIV/1/12/13'>Gen. 12:13</a>; <a href='/AIV/1/20/2'>Gen. 20:2</a>",
      "comment": "Repeats Abraham’s deception with Sarah, showing human weakness and the recurrence of ancestral patterns."
    },
    {
      "pk": 2002608,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 8,
      "text": "When he had been there a long time, Abimelech king of the Philistines looked out of a window and saw Isaac laughing with Rebekah his wife.",
      "links": "<a href='/AIV/1/21/9'>Gen. 21:9</a>",
      "comment": "“Laughing” (or caressing) implies intimacy, making clear the true relationship between Isaac and Rebekah."
    },
    {
      "pk": 2002609,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 9,
      "text": "So Abimelech called Isaac and said, 'Behold, she is your wife! How then could you say, "
    },
    {
      "pk": 2002610,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 10,
      "text": "Abimelech said, 'What is this you have done to us? One of the people might easily have lain with your wife, and you would have brought guilt upon us.'",
      "links": "<a href='/AIV/1/20/9-10'>Gen. 20:9-10</a>",
      "comment": "This emphasizes the seriousness of adultery, recognized even by pagans as a punishable offense, and the importance of marital fidelity."
    },
    {
      "pk": 2002611,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 11,
      "text": "So Abimelech gave orders to all the people: 'Whoever touches this man or his wife shall surely be put to death.'",
      "links": "<a href='/AIV/1/20/7'>Gen. 20:7</a>",
      "comment": "Abimelech honors the sanctity of marriage by his decree, which shows a reverence for God’s law, even among outsiders."
    },
    {
      "pk": 2002612,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 12,
      "text": "Isaac sowed seed in that land and in that year reaped a hundredfold. The LORD blessed him,",
      "links": "<a href='/AIV/1/24/1'>Gen. 24:1</a>; <a href='/AIV/3/26/4'>Lev. 26:4</a>",
      "comment": "Isaac’s prosperity is a sign of divine favor and blessing upon obedience, prefiguring later teachings on God’s reward for faithfulness."
    },
    {
      "pk": 2002613,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 13,
      "text": "and the man became rich and continued to grow richer until he became very wealthy.",
      "links": "<a href='/AIV/1/24/35'>Gen. 24:35</a>",
      "comment": "The visible increase of Isaac’s wealth sets him apart, foreshadowing the future prosperity of God’s people."
    },
    {
      "pk": 2002614,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 14,
      "text": "He had possessions of flocks and herds and a great household, so that the Philistines envied him.",
      "links": "<a href='/AIV/1/30/43'>Gen. 30:43</a>; <a href='/AIV/19/73/3'>Ps. 73:3</a>",
      "comment": "Material blessing often brings jealousy from others, a recurring theme in biblical history."
    },
    {
      "pk": 2002615,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 15,
      "text": "So all the wells that his father’s servants had dug in the days of Abraham, the Philistines stopped up by filling them with earth.",
      "links": "<a href='/AIV/1/21/25-32'>Gen. 21:25-32</a>",
      "comment": "The conflict over wells underscores the ongoing struggle over God’s blessing and the inheritance of the land."
    },
    {
      "pk": 2002616,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 16,
      "text": "Then Abimelech said to Isaac, 'Move away from us, for you have become much mightier than we are.'",
      "links": "<a href='/AIV/2/1/9'>Exod. 1:9</a>",
      "comment": "Isaac’s growing strength causes fear, like later Israel in Egypt. God’s chosen often find themselves misunderstood and persecuted."
    },
    {
      "pk": 2002617,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 17,
      "text": "So Isaac departed from there and camped in the Valley of Gerar, and settled there.",
      "links": "<a href='/AIV/1/26/6'>v. 6</a>",
      "comment": "Isaac’s peaceful departure mirrors Christ’s instruction to avoid conflict where possible (<a href='/AIV/40/10/23'>Matt. 10:23</a>)."
    },
    {
      "pk": 2002618,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 18,
      "text": "And Isaac dug again the wells of water that had been dug in the days of Abraham his father, which the Philistines had stopped after Abraham’s death. He gave them the same names his father had given them.",
      "links": "<a href='/AIV/1/21/31'>Gen. 21:31</a>",
      "comment": "The recovery and naming of the wells emphasize maintaining the heritage of faith."
    },
    {
      "pk": 2002619,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 19,
      "text": "But when Isaac’s servants dug in the valley and found a well of fresh water there,",
      "links": "",
      "comment": "Fresh water symbolizes God’s continual provision; a spiritual foreshadowing of living water offered by Christ (see <a href='/AIV/43/4/14'>John 4:14</a>)."
    },
    {
      "pk": 2002620,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 20,
      "text": "the herdsmen of Gerar quarreled with Isaac’s herdsmen, saying, 'The water is ours.' So he named the well Esek, because they disputed with him.",
      "links": "",
      "comment": "'Esek' means 'contention.' Quarreling for water shows the struggle for God’s blessing and inheritance."
    },
    {
      "pk": 2002621,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 21,
      "text": "Then they dug another well, and they quarreled over that as well. So he named it Sitnah.",
      "links": "",
      "comment": "'Sitnah' means 'enmity' or 'accusation.' The word is related to Satan, the accuser."
    },
    {
      "pk": 2002622,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 22,
      "text": "He moved from there and dug another well, and they did not quarrel over it. So he called it Rehoboth, saying, 'For now the LORD has made space for us, and we will be fruitful in the land.'",
      "links": "",
      "comment": "'Rehoboth' means 'broad places.' God provides a place of peace and fruitfulness after conflict."
    },
    {
      "pk": 2002623,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 23,
      "text": "From there he went up to Beersheba.",
      "links": "<a href='/AIV/1/21/31'>Gen. 21:31</a>",
      "comment": "Beersheba is a place of covenant, reminding the reader of God's promises."
    },
    {
      "pk": 2002624,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 24,
      "text": "And the LORD appeared to him the same night and said, 'I am the God of Abraham your father. Do not fear, for I am with you, and will bless you and multiply your descendants for my servant Abraham’s sake.'",
      "links": "<a href='/AIV/1/15/1'>Gen. 15:1</a>; <a href='/AIV/1/28/13-15'>Gen. 28:13-15</a>",
      "comment": "God’s reassurance echoes earlier divine visions and promises, testifying to God’s faithfulness and constancy."
    },
    {
      "pk": 2002625,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 25,
      "text": "So he built an altar there and called upon the name of the LORD and pitched his tent there. And there Isaac’s servants dug a well.",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>",
      "comment": "Building an altar is a hallmark of worship and dedication, a pattern among the patriarchs. The centrality of worship foreshadows later liturgical worship."
    },
    {
      "pk": 2002626,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 26,
      "text": "Then Abimelech went to him from Gerar with Ahuzzath his adviser and Phicol the commander of his army.",
      "links": "<a href='/AIV/1/21/22'>Gen. 21:22</a>",
      "comment": "Abimelech’s delegation mirrors Abraham’s earlier encounter, indicating a desire for peaceful relations."
    },
    {
      "pk": 2002627,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 27,
      "text": "Isaac said to them, 'Why have you come to me, since you hate me and have sent me away from you?'",
      "links": "",
      "comment": "Isaac notes their prior hostility, calling attention to the human tendency toward division and reconciliation."
    },
    {
      "pk": 2002628,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 28,
      "text": "They said, 'We clearly see that the LORD has been with you; so we say, “Let there be an oath between us, between you and us, and let us make a covenant with you,”'",
      "links": "<a href='/AIV/1/21/22-23'>Gen. 21:22-23</a>",
      "comment": "Even outsiders recognize the special blessing and presence of God upon his chosen ones. The theme of peace and covenant foreshadows later scriptural covenants."
    },
    {
      "pk": 2002629,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 29,
      "text": "'that you will do us no harm, just as we have not harmed you and have only done you good and sent you away in peace. You are now blessed by the LORD.'",
      "links": "<a href='/AIV/1/24/31'>Gen. 24:31</a>",
      "comment": "Their witness to Isaac’s blessing reveals God’s favor can be evident to all. Living at peace with all is a recurring biblical ideal (<a href='/AIV/45/12/18'>Romans 12:18</a>)."
    },
    {
      "pk": 2002630,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 30,
      "text": "So he made them a feast, and they ate and drank.",
      "links": "<a href='/AIV/1/18/6-8'>Gen. 18:6-8</a>",
      "comment": "A shared meal seals the treaty, echoing ancient covenant and sacramental meals in the biblical tradition."
    },
    {
      "pk": 2002631,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 31,
      "text": "They rose early in the morning and swore an oath to each other. Isaac sent them on their way, and they departed from him in peace.",
      "links": "<a href='/AIV/1/31/44-53'>Gen. 31:44-53</a>",
      "comment": "Oaths and covenants emphasize the binding and solemn nature of agreements in God’s eyes."
    },
    {
      "pk": 2002632,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 32,
      "text": "That same day Isaac’s servants came and told him about the well they had dug and said to him, 'We have found water.'",
      "links": "",
      "comment": "The discovery of water after a covenant demonstrates God’s continued, tangible blessings after acts of faith and worship."
    },
    {
      "pk": 2002633,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 33,
      "text": "He called it Shibah; therefore the name of the city is Beersheba to this day.",
      "links": "<a href='/AIV/1/21/31'>Gen. 21:31</a>",
      "comment": "'Shibah' is related to the Hebrew for 'oath' or 'seven,' highlighting the significance of covenant."
    },
    {
      "pk": 2002634,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 34,
      "text": "When Esau was forty years old, he took as wives Judith the daughter of Beeri the Hittite, and Basemath the daughter of Elon the Hittite.",
      "links": "<a href='/AIV/1/36/2'>Gen. 36:2</a>",
      "comment": "Esau marries outside the faith, a decision that foreshadows conflict and sorrow, underscoring the importance of spiritual unity in marriage."
    },
    {
      "pk": 2002635,
      "translation": "AIV",
      "book": 1,
      "chapter": 26,
      "verse": 35,
      "text": "They made life bitter for Isaac and Rebekah.",
      "links": "<a href='/AIV/1/27/46'>Gen. 27:46</a>",
      "comment": "Disobedience regarding marriage brings family sorrow; it underlines the wisdom of following God’s ordering of family life and unity in faith, a principle valued throughout Scripture."
    }
  ],
  "translatedAt": "2025-12-23T08:47:25.791Z"
}