{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 23,
  "verses": [
    {
      "pk": 1002301,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 1,
      "text": "Sarah lived one hundred twenty-seven years; these were the years of Sarah’s life.",
      "links": "<a href='/AIV/1/17/17'>Gen. 17:17</a>",
      "comment": "Sarah is the only woman in Scripture whose age at death is specifically recorded, highlighting her significance in salvation history."
    },
    {
      "pk": 1002302,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 2,
      "text": "Sarah died at Kiriath-arba (that is, Hebron) in the land of Canaan, and Abraham went in to mourn for Sarah and to weep over her.",
      "links": "<a href='/AIV/1/13/18'>Gen. 13:18</a>; <a href='/AIV/1/35/19'>Gen. 35:19</a>",
      "comment": "Kiriath-arba is later known as Hebron, an important city in Israel’s history. Abraham shows deep humanity in mourning, underscoring family bonds."
    },
    {
      "pk": 1002303,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 3,
      "text": "Abraham rose up from before his dead, and spoke to the Hittites, saying,",
      "links": "<a href='/AIV/1/10/15'>Gen. 10:15</a>; <a href='/AIV/6/9/1'>Josh. 9:1</a>",
      "comment": "Abraham interacts peaceably with the Hittites, emphasizing his temporary status and distinction from surrounding nations."
    },
    {
      "pk": 1002304,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 4,
      "text": "“I am a sojourner and a foreigner among you. Sell me a burial place among you, so I may bury my dead.”",
      "links": "<a href='/AIV/1/17/8'>Gen. 17:8</a>; <a href='/AIV/58/11/13'>Heb. 11:13</a>",
      "comment": "Abraham’s words echo the idea that God’s people are pilgrims in the world (Heb. 11:13). This foreshadows faithful obedience and longing for a promised land."
    },
    {
      "pk": 1002305,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 5,
      "text": "The Hittites answered Abraham:",
      "links": "<a href='/AIV/1/15/20'>Gen. 15:20</a>",
      "comment": "The respectful response from the Hittites shows Abraham’s high reputation, reflecting God’s favor upon him."
    },
    {
      "pk": 1002306,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 6,
      "text": "“Hear us, my lord; you are a mighty prince among us. Bury your dead in the choicest of our tombs. None of us will withhold his tomb from you lest you bury your dead.”",
      "links": "<a href='/AIV/1/21/22-23'>Gen. 21:22–23</a>",
      "comment": "The Hittites call Abraham ‘a mighty prince,’ reflecting his blessed status among the nations—echoing God’s promise to exalt Abraham."
    },
    {
      "pk": 1002307,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 7,
      "text": "Abraham rose and bowed to the people of the land, the Hittites.",
      "links": "<a href='/AIV/1/18/2'>Gen. 18:2</a>",
      "comment": "Abraham’s humility before others reflects the virtue of reverence and respect—a model for spiritual leadership."
    },
    {
      "pk": 1002308,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 8,
      "text": "He spoke to them saying, “If you agree that I should bury my dead, listen to me and ask Ephron the son of Zohar",
      "links": "<a href='/AIV/1/25/9'>Gen. 25:9</a>",
      "comment": "Abraham requests Ephron’s field, showing proper channels and peaceful dealings—an early witness to the value of just transactions."
    },
    {
      "pk": 1002309,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 9,
      "text": "to give me the cave of Machpelah, which is in the end of his field. Let him sell it to me for the full price, as a burial place among you.”",
      "links": "<a href='/AIV/1/49/30-31'>Gen. 49:30–31</a>; <a href='/AIV/1/50/13'>Gen. 50:13</a>",
      "comment": "The cave of Machpelah later becomes the burial place for Abraham and his descendants, prefiguring the sacredness of honoring the bodies of the faithful—a principle that reverberates in later spiritual tradition."
    },
    {
      "pk": 1002310,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 10,
      "text": "Ephron was sitting among the Hittites. Ephron the Hittite answered Abraham in the hearing of all the Hittites who had come to the gate of his city:",
      "links": "<a href='/AIV/1/34/20'>Gen. 34:20</a>",
      "comment": "Ephron’s presence at the city gate demonstrates the communal and legal nature of ancient negotiations, underscoring transparency."
    },
    {
      "pk": 1002311,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 11,
      "text": "“No, my lord. Listen to me: I give you the field and the cave that is in it. I give it to you in the presence of my people. Bury your dead.”",
      "links": "<a href='/AIV/1/14/22-23'>Gen. 14:22–23</a>",
      "comment": "Ephron’s generosity may be formal rather than literal, expecting reciprocal honor, but the giving is done publicly, pointing towards the necessity of proper witness."
    },
    {
      "pk": 1002312,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 12,
      "text": "Abraham bowed before the people of the land.",
      "links": "<a href='/AIV/1/18/2'>Gen. 18:2</a>",
      "comment": "Abraham again displays humility before the people, reflecting the biblical theme of serving others in love."
    },
    {
      "pk": 1002313,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 13,
      "text": "He said to Ephron, in the hearing of the people of the land, “If you will, please listen to me. I will give you the price of the field. Accept it from me, so that I may bury my dead there.”",
      "links": "<a href='/AIV/1/14/23'>Gen. 14:23</a>",
      "comment": "Abraham insists on purchasing the land, rejecting the appearance of entitlement, which demonstrates upright stewardship and sets the pattern for legal ownership among the faithful."
    },
    {
      "pk": 1002314,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 14,
      "text": "Ephron answered Abraham,",
      "links": "<a href='/AIV/1/23/16'>Gen. 23:16</a>",
      "comment": "The dialogue between Ephron and Abraham continues the tension between gift and proper payment, highlighting the value placed on solemn agreements."
    },
    {
      "pk": 1002315,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 15,
      "text": "“My lord, listen to me: The land is worth four hundred shekels of silver. What is that between you and me? Bury your dead.”",
      "links": "<a href='/AIV/1/37/28'>Gen. 37:28</a>",
      "comment": "Ephron sets a price, but downplays its importance—this echoes the principle of charity within financial dealings, and the significance of just compensation."
    },
    {
      "pk": 1002316,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 16,
      "text": "Abraham agreed to Ephron’s terms, and weighed out for Ephron the silver he had named in the hearing of the Hittites: four hundred shekels of silver, according to the weights current among the merchants.",
      "links": "<a href='/AIV/1/43/21'>Gen. 43:21</a>; <a href='/AIV/11/10/21'>1 Kgs. 10:21</a>",
      "comment": "The precise fulfillment of the transaction exemplifies the ethical conduct expected of God’s people regarding property and promises."
    },
    {
      "pk": 1002317,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 17,
      "text": "So the field of Ephron in Machpelah, east of Mamre, the field and the cave that was in it, and all the trees within the field, throughout its borders, were deeded",
      "links": "<a href='/AIV/1/25/9'>Gen. 25:9</a>; <a href='/AIV/1/49/29-32'>Gen. 49:29–32</a>",
      "comment": "The inclusion of the field, cave, and trees reflects the biblical pattern of sanctified land set apart for the righteous, hinting at sacred heritage."
    },
    {
      "pk": 1002318,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 18,
      "text": "to Abraham as a possession in the presence of the Hittites, before all who went in at the gate of his city.",
      "links": "<a href='/AIV/1/23/10'>Gen. 23:10</a>; <a href='/AIV/1/24/60'>Gen. 24:60</a>",
      "comment": "Legal witnesses establish Abraham’s ownership; public witness accords with spiritual truth, as faith is meant to be lived openly."
    },
    {
      "pk": 1002319,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 19,
      "text": "After this, Abraham buried Sarah his wife in the cave of Machpelah in the field east of Mamre (which is Hebron), in the land of Canaan.",
      "links": "<a href='/AIV/1/35/27'>Gen. 35:27</a>",
      "comment": "The burial takes place in Canaan, signifying Abraham’s faith in the promise that his descendants will inherit this very land—connecting to Hebrews 11:9–10."
    },
    {
      "pk": 1002320,
      "translation": "AIV",
      "book": 1,
      "chapter": 23,
      "verse": 20,
      "text": "So the field and the cave that is in it were deeded to Abraham as a burial place from the Hittites.",
      "links": "<a href='/AIV/1/25/9-10'>Gen. 25:9–10</a>; <a href='/AIV/1/50/13'>Gen. 50:13</a>",
      "comment": "Abraham’s first owned land is a tomb, not farmland—foreshadowing how places of sacrifice and burial become integral to Israel’s story and devotion. This points toward both the importance of honoring the faithful departed and the promised resurrection, which finds rich fulfillment in the risen Christ (John 20:1–18)."
    }
  ],
  "translatedAt": "2025-12-23T08:45:01.445Z"
}