{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 9,
  "verses": [
    {
      "pk": 1009001,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 1,
      "text": "Then God blessed Noah and his sons, and said to them, \"Be fruitful and multiply, and fill the earth.\"",
      "links": "<a href='/AIV/1/1/28'>Gen. 1:28</a>; <a href='/AIV/1/8/17'>Gen. 8:17</a>",
      "comment": "God repeats the blessing given at creation, highlighting the continuity of God's plan for humanity after the flood."
    },
    {
      "pk": 1009002,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 2,
      "text": "And the fear and dread of you shall fall on every beast of the earth, and on every bird of the heaven, on everything that moves upon the ground, and on all the fish of the sea. Into your hand they are given.",
      "links": "<a href='/AIV/1/1/26'>Gen. 1:26</a>; <a href='/AIV/19/8/6'>Ps. 8:6-8</a>",
      "comment": "The granting of dominion shows a restoration of humanity's stewardship, though now marked by fear due to sin’s entrance."
    },
    {
      "pk": 1009003,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 3,
      "text": "Every moving thing that lives shall be food for you. As I gave you the green plants, I now give you everything.",
      "links": "<a href='/AIV/1/1/29'>Gen. 1:29–30</a>; <a href='/AIV/3/11/7'>Lev. 11:7–8</a>",
      "comment": "This marks a new provision after the flood; before this, only plants were given. Later laws, however, set dietary restrictions."
    },
    {
      "pk": 1009004,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 4,
      "text": "But you must not eat flesh with its life, that is, its blood.",
      "links": "<a href='/AIV/3/17/10'>Lev. 17:10–14</a>; <a href='/AIV/5/12/23'>Deut. 12:23</a>; <a href='/AIV/44/15/20'>Acts 15:20</a>",
      "comment": "Blood is sacred as the sign of life. Later, this theme runs through the Law and the New Testament, ultimately fulfilled in the shedding of Christ’s blood."
    },
    {
      "pk": 1009005,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 5,
      "text": "And for your own lifeblood I will surely require a reckoning; from every beast I will require it, and from every person. From every person, I will require the life of his fellow man.",
      "links": "<a href='/AIV/2/21/28'>Ex. 21:28–29</a>; <a href='/AIV/4/35/33'>Num. 35:33–34</a>",
      "comment": "Human life is sacred because it bears God’s image. There's also a hint here at the seriousness of justice and the principle of restitution."
    },
    {
      "pk": 1009006,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 6,
      "text": "Whoever sheds the blood of man, by man shall his blood be shed, for God made man in his own image.",
      "links": "<a href='/AIV/1/1/27'>Gen. 1:27</a>; <a href='/AIV/4/35/16-21'>Num. 35:16–21</a>",
      "comment": "This affirms the value and dignity of human life. The image of God provides the foundation for justice and for later Christian teachings on the sanctity of life."
    },
    {
      "pk": 1009007,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 7,
      "text": "And you, be fruitful and multiply, swarm on the earth and increase upon it.\"",
      "links": "<a href='/AIV/1/1/28'>Gen. 1:28</a>; <a href='/AIV/1/8/17'>Gen. 8:17</a>",
      "comment": "The command is repeated to show its importance. Life is a blessing meant to be shared abundantly."
    },
    {
      "pk": 1009008,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 8,
      "text": "Then God said to Noah and to his sons with him,",
      "links": "",
      "comment": "God now speaks to the entire family, expanding the covenant."
    },
    {
      "pk": 1009009,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 9,
      "text": "\"As for me, behold, I establish my covenant with you and your descendants after you,",
      "links": "<a href='/AIV/1/6/18'>Gen. 6:18</a>; <a href='/AIV/1/17/7'>Gen. 17:7</a>",
      "comment": "A new covenant is established, showing God’s faithfulness through the generations."
    },
    {
      "pk": 1009010,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 10,
      "text": "and with every living creature that is with you: the birds, the livestock, and every beast of the earth with you, as many as came out of the ark, every beast of the earth.",
      "links": "<a href='/AIV/1/8/1'>Gen. 8:1</a>",
      "comment": "This covenant includes not just humans but all living creatures—expanding God’s mercy to all creation."
    },
    {
      "pk": 1009011,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 11,
      "text": "I establish my covenant with you: never again shall all flesh be cut off by the waters of a flood, and never again shall there be a flood to destroy the earth.\"",
      "links": "<a href='/AIV/1/8/21'>Gen. 8:21-22</a>",
      "comment": "God’s promise initiates a new era of trust and stability, prefiguring the eternal covenant in Christ."
    },
    {
      "pk": 1009012,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 12,
      "text": "And God said, \"This is the sign of the covenant that I make between me and you and every living creature that is with you, for all future generations:",
      "links": "<a href='/AIV/1/17/11'>Gen. 17:11</a>; <a href='/AIV/1/9/16'>Gen. 9:16</a>",
      "comment": "As later covenants have outward signs (circumcision, Passover, baptism), so here the rainbow is the sign."
    },
    {
      "pk": 1009013,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 13,
      "text": "I have set my bow in the cloud, and it shall be a sign of the covenant between me and the earth.",
      "links": "<a href='/AIV/1/9/16'>Gen. 9:16</a>",
      "comment": "The rainbow serves as a visible seal. This parallels later sacramental signs used as visible reminders of God’s promises."
    },
    {
      "pk": 1009014,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 14,
      "text": "When I bring clouds over the earth and the bow is seen in the clouds,",
      "links": "<a href='/AIV/1/9/16'>Gen. 9:16</a>",
      "comment": "God’s action is primary; he places the sign and remembers the covenant."
    },
    {
      "pk": 1009015,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 15,
      "text": "I will remember my covenant that is between me and you and every living creature of all flesh. And the waters shall never again become a flood to destroy all flesh.",
      "links": "<a href='/AIV/1/8/21'>Gen. 8:21</a>",
      "comment": "God’s faithfulness undergirds the promise. His ‘remembering’ means acting to fulfill his word."
    },
    {
      "pk": 1009016,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 16,
      "text": "When the bow is in the clouds, I will see it and remember the everlasting covenant between God and every living creature of all flesh that is on the earth.\"",
      "links": "",
      "comment": "The covenant is not temporary but everlasting, hinting at greater, unbreakable covenants to come."
    },
    {
      "pk": 1009017,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 17,
      "text": "God said to Noah, \"This is the sign of the covenant that I have established between me and all flesh that is on the earth.\"",
      "links": "<a href='/AIV/1/9/12'>Gen. 9:12</a>",
      "comment": "The reiteration stresses the seriousness of God’s commitment to His promises, an important foundation for later faith."
    },
    {
      "pk": 1009018,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 18,
      "text": "Now the sons of Noah who went out of the ark were Shem, Ham, and Japheth. Ham was the father of Canaan.",
      "links": "<a href='/AIV/1/5/32'>Gen. 5:32</a>",
      "comment": "Canaan’s mention anticipates later events and connects Noah to the unfolding history of salvation."
    },
    {
      "pk": 1009019,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 19,
      "text": "These three were the sons of Noah, and from these the whole earth was populated.",
      "links": "<a href='/AIV/1/10/32'>Gen. 10:32</a>",
      "comment": "Humanity’s unity is emphasized, pointing ahead to God’s ultimate plan to reunite all peoples."
    },
    {
      "pk": 1009020,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 20,
      "text": "Noah began to be a man of the soil, and he planted a vineyard.",
      "links": "<a href='/AIV/1/5/29'>Gen. 5:29</a>",
      "comment": "Noah’s return to agriculture recalls Adam, but also introduces themes of blessing and temptation in the use of creation."
    },
    {
      "pk": 1009021,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 21,
      "text": "He drank of the wine and became drunk and lay uncovered in his tent.",
      "links": "<a href='/AIV/20/23/29-35'>Prov. 23:29–35</a>",
      "comment": "Even righteous Noah stumbles, demonstrating that sin persists even among the chosen."
    },
    {
      "pk": 1009022,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 22,
      "text": "And Ham, the father of Canaan, saw the nakedness of his father and told his two brothers outside.",
      "links": "<a href='/AIV/3/18/6-7'>Lev. 18:6–7</a>",
      "comment": "Ham’s disrespect highlights the importance of honor, purity, and familial responsibility—values echoed throughout Scripture."
    },
    {
      "pk": 1009023,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 23,
      "text": "Then Shem and Japheth took a garment, laid it on their shoulders, and walked backward and covered the nakedness of their father; their faces were turned away, and they did not see their father's nakedness.",
      "links": "<a href='/AIV/3/20/9-11'>Lev. 20:9–11</a>",
      "comment": "Shem and Japheth’s modesty and reverence are praised. Covering nakedness anticipates spiritual themes of sin and atonement."
    },
    {
      "pk": 1009024,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 24,
      "text": "When Noah awoke from his wine and knew what his youngest son had done to him,",
      "links": "",
      "comment": "Noah’s awareness sets up the following pronouncement of blessing and curse."
    },
    {
      "pk": 1009025,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 25,
      "text": "he said, \"Cursed be Canaan; a servant of servants shall he be to his brothers.\"",
      "links": "<a href='/AIV/1/10/6'>Gen. 10:6</a>",
      "comment": "The curse falls on Canaan, Ham’s descendant, foreshadowing later developments in salvation history."
    },
    {
      "pk": 1009026,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 26,
      "text": "He also said, \"Blessed be the LORD, the God of Shem; and let Canaan be his servant.",
      "links": "<a href='/AIV/1/10/21'>Gen. 10:21</a>",
      "comment": "Shem receives a special blessing—his line leads to Abraham and ultimately to Christ."
    },
    {
      "pk": 1009027,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 27,
      "text": "May God enlarge Japheth, and let him dwell in the tents of Shem; and let Canaan be his servant.\"",
      "links": "<a href='/AIV/1/10/2'>Gen. 10:2</a>; <a href='/AIV/49/3/6'>Eph. 3:6</a>",
      "comment": "Japheth, associated with Gentile nations, is welcomed into Shem’s blessing—foreshadowing the inclusion of all nations in the promise."
    },
    {
      "pk": 1009028,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 28,
      "text": "After the flood Noah lived 350 years.",
      "links": "<a href='/AIV/1/5/32'>Gen. 5:32</a>; <a href='/AIV/1/9/29'>Gen. 9:29</a>",
      "comment": "Noah’s long life reflects God’s continuing blessing."
    },
    {
      "pk": 1009029,
      "translation": "AIV",
      "book": 1,
      "chapter": 9,
      "verse": 29,
      "text": "All the days of Noah were 950 years, and he died.",
      "links": "<a href='/AIV/1/5/5'>Gen. 5:5</a>",
      "comment": "Noah’s death closes an important chapter in salvation history. Despite his righteousness, like Adam, he dies—pointing forward to the need for a Redeemer who will conquer death."
    }
  ],
  "translatedAt": "2025-12-23T08:38:37.578Z"
}