{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 25,
  "verses": [
    {
      "pk": 1025001,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 1,
      "text": "Abraham took another wife; her name was Keturah.",
      "links": "<a href='/AIV/13/1/32'>1 Chron. 1:32</a>;",
      "comment": "Abraham's marriage to Keturah after Sarah's death is mentioned, tying into the larger narrative of the patriarchs and highlighting the expansion of Abraham's lineage."
    },
    {
      "pk": 1025002,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 2,
      "text": "She bore him Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah.",
      "links": "<a href='/AIV/13/1/32'>1 Chron. 1:32</a>;",
      "comment": "These sons of Abraham by Keturah became progenitors of various peoples, demonstrating God's faithfulness to Abraham's promise of many nations (Gen 17:4)."
    },
    {
      "pk": 1025003,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 3,
      "text": "Jokshan fathered Sheba and Dedan. The sons of Dedan were Asshurim, Letushim, and Leummim.",
      "links": "<a href='/AIV/13/1/32'>1 Chron. 1:32</a>;",
      "comment": "These descendants link to tribes and regions mentioned elsewhere in Scripture (see Isaiah 60:6)."
    },
    {
      "pk": 1025004,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 4,
      "text": "The sons of Midian were Ephah, Epher, Hanoch, Abida, and Eldaah. All these were the children of Keturah.",
      "links": "<a href='/AIV/13/1/33'>1 Chron. 1:33</a>;",
      "comment": "Midian and his descendants become important later, including in Moses' story (Exodus 2:15)."
    },
    {
      "pk": 1025005,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 5,
      "text": "Abraham gave all that he had to Isaac.",
      "links": "<a href='/AIV/1/21/12'>Gen. 21:12</a>;",
      "comment": "Isaac alone inherits the full covenant promise, prefiguring God's election and the passing on of spiritual blessings through a particular line (see Romans 9:7–8)."
    },
    {
      "pk": 1025006,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 6,
      "text": "But to the sons of his concubines, Abraham gave gifts, and while he was still living, he sent them away eastward, to the east country, away from Isaac his son.",
      "links": "<a href='/AIV/1/21/14'>Gen. 21:14</a>;",
      "comment": "This resembles God’s selective purposes, and also echoes the sending away of Hagar and Ishmael previously. Isaac’s unique role is reinforced."
    },
    {
      "pk": 1025007,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 7,
      "text": "These are the days of Abraham's life that he lived: one hundred seventy-five years.",
      "links": "<a href='/AIV/1/12/4'>Gen. 12:4</a>;",
      "comment": "The summarized lifespan emphasizes the patriarch’s significance and God’s blessing, paralleling earlier statements about long life for the righteous."
    },
    {
      "pk": 1025008,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 8,
      "text": "Then Abraham breathed his last and died at a good old age, an old man, full of years, and was gathered to his people.",
      "links": "<a href='/AIV/1/15/15'>Gen. 15:15</a>;",
      "comment": "'Gathered to his people' hints at a continued existence after death and communion among the righteous, which is echoed throughout Scripture (see Luke 16:22)."
    },
    {
      "pk": 1025009,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 9,
      "text": "Isaac and Ishmael his sons buried him in the cave of Machpelah, in the field of Ephron son of Zohar the Hittite, east of Mamre,",
      "links": "<a href='/AIV/1/23/17-19'>Gen. 23:17–19</a>;",
      "comment": "Both sons unite to bury Abraham. The cave signifies the promised land – the first piece actually possessed (cf. Gen 23)."
    },
    {
      "pk": 1025010,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 10,
      "text": "the field that Abraham bought from the Hittites. There Abraham was buried, with Sarah his wife.",
      "links": "<a href='/AIV/1/23/19'>Gen. 23:19</a>;",
      "comment": "Mentioning Sarah reaffirms the importance of the covenant through Abraham’s marital line."
    },
    {
      "pk": 1025011,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 11,
      "text": "After the death of Abraham, God blessed Isaac his son. Isaac settled at Beer-lahai-roi.",
      "links": "<a href='/AIV/1/24/62'>Gen. 24:62</a>;",
      "comment": "The focus shifts fully to Isaac as the new carrier of the promise; God's blessing continues the covenantal thread."
    },
    {
      "pk": 1025012,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 12,
      "text": "Now these are the generations of Ishmael, Abraham's son, whom Hagar the Egyptian, Sarah's servant, bore to Abraham.",
      "links": "<a href='/AIV/1/16/15'>Gen. 16:15</a>;",
      "comment": "Ishmael’s genealogy fulfills God’s promise to make him a great nation (Gen 17:20), though he is not the chosen line."
    },
    {
      "pk": 1025013,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 13,
      "text": "These are the names of the sons of Ishmael, listed by their generations: Nebaioth the firstborn of Ishmael, and Kedar, Adbeel, Mibsam,",
      "links": "<a href='/AIV/23/21/16-17'>Isaiah 21:16–17</a>;",
      "comment": "The Ishmaelite clans are listed, some recurring in prophetic texts and later history."
    },
    {
      "pk": 1025014,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 14,
      "text": "Mishma, Dumah, Massa,",
      "links": "<a href='/AIV/1/10/28-30'>Gen. 10:28–30</a>;",
      "comment": "These names are connected to Arabian tribes, showing fulfillment of God's earlier assurances."
    },
    {
      "pk": 1025015,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 15,
      "text": "Hadad, Tema, Jetur, Naphish, and Kedemah.",
      "links": "<a href='/AIV/13/5/19'>1 Chron. 5:19</a>;",
      "comment": "Many of these are later encountered in biblical and Near Eastern history."
    },
    {
      "pk": 1025016,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 16,
      "text": "These are the sons of Ishmael and these are their names, by their villages and encampments; twelve princes according to their tribes.",
      "links": "<a href='/AIV/1/17/20'>Gen. 17:20</a>;",
      "comment": "The twelve princes parallel Israel’s twelve tribes, highlighting God’s faithfulness to both Isaac and Ishmael."
    },
    {
      "pk": 1025017,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 17,
      "text": "These are the years of the life of Ishmael: one hundred thirty-seven years. He breathed his last and died, and was gathered to his people.",
      "links": "<a href='/AIV/1/25/8'>Gen. 25:8</a>;",
      "comment": "Use of 'gathered to his people' again hints at ongoing existence after death."
    },
    {
      "pk": 1025018,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 18,
      "text": "They settled from Havilah to Shur, which is opposite Egypt in the direction of Assyria. He settled over against all his kinsmen.",
      "links": "<a href='/AIV/1/16/12'>Gen. 16:12</a>;",
      "comment": "'He settled over against all his kinsmen' fulfills prophecy about Ishmael’s independent character."
    },
    {
      "pk": 1025019,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 19,
      "text": "These are the generations of Isaac, Abraham's son. Abraham fathered Isaac,",
      "links": "<a href='/AIV/1/21/2-3'>Gen. 21:2–3</a>;",
      "comment": "The focus on Isaac centers the chosen line, foreshadowing greater spiritual truths fulfilled in Christ (see Galatians 4:28)."
    },
    {
      "pk": 1025020,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 20,
      "text": "and Isaac was forty years old when he took Rebekah, the daughter of Bethuel the Aramean of Paddan-aram, the sister of Laban the Aramean, to be his wife.",
      "links": "<a href='/AIV/1/24/67'>Gen. 24:67</a>;",
      "comment": "Emphasis on specific genealogy shows careful providence in the chosen line—a recurring biblical theme."
    },
    {
      "pk": 1025021,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 21,
      "text": "And Isaac prayed to the LORD for his wife, because she was barren, and the LORD granted his prayer; and Rebekah his wife conceived.",
      "links": "<a href='/AIV/1/18/10'>Gen. 18:10</a>; <a href='/AIV/1/11/30'>Gen. 11:30</a>;",
      "comment": "Isaac’s prayer demonstrates faith and the power of intercession. The overcoming of barrenness through prayer prefigures the role of prayer in fulfilling God's plan (see Luke 1:13)."
    },
    {
      "pk": 1025022,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 22,
      "text": "The children struggled together within her, and she said, 'If it is so, why is this happening to me?' So she went to inquire of the LORD.",
      "links": "<a href='/AIV/1/27/41-42'>Gen. 27:41–42</a>;",
      "comment": "Rebekah’s seeking the LORD's counsel shows the importance of turning first to God for understanding and wisdom."
    },
    {
      "pk": 1025023,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 23,
      "text": "And the LORD said to her, 'Two nations are in your womb, and two peoples from within you will be divided. One people shall be stronger than the other, and the older shall serve the younger.'",
      "links": "<a href='/AIV/45/9/12'>Romans 9:12</a>;",
      "comment": "God's sovereign election is emphasized; Paul later cites this regarding the mysterious ways of divine grace and predestination."
    },
    {
      "pk": 1025024,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 24,
      "text": "When her days to give birth were completed, behold, there were twins in her womb.",
      "links": "<a href='/AIV/1/38/27'>Gen. 38:27</a>;",
      "comment": "The unusual birth of twins heralds a new stage in the covenant family’s story."
    },
    {
      "pk": 1025025,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 25,
      "text": "The first came out red, all his body like a hairy cloak, so they called his name Esau.",
      "links": "<a href='/AIV/1/27/11'>Gen. 27:11</a>;",
      "comment": "Naming conventions based on appearance are common, and Esau’s description has symbolic significance for later conflicts."
    },
    {
      "pk": 1025026,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 26,
      "text": "Afterward his brother came out, with his hand holding Esau's heel; so his name was called Jacob. Isaac was sixty years old when she bore them.",
      "links": "<a href='/AIV/1/27/36'>Gen. 27:36</a>;",
      "comment": "Jacob’s name foreshadows his character and destiny. The birth order reversal points to God’s surprising purposes."
    },
    {
      "pk": 1025027,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 27,
      "text": "When the boys grew up, Esau was a skillful hunter, a man of the field, while Jacob was a quiet man, dwelling in tents.",
      "links": "<a href='/AIV/1/27/3'>Gen. 27:3</a>;",
      "comment": "The contrast between the brothers’ temperaments is important for their later stories and the unfolding of God’s chosen line."
    },
    {
      "pk": 1025028,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 28,
      "text": "Isaac loved Esau because he ate of his game, but Rebekah loved Jacob.",
      "links": "<a href='/AIV/1/27/6-13'>Gen. 27:6–13</a>;",
      "comment": "Parental favoritism leads to trouble, yet God’s purposes are not thwarted—offering a lesson on Providence overruling human failings."
    },
    {
      "pk": 1025029,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 29,
      "text": "Once when Jacob was cooking stew, Esau came in from the field, and he was exhausted.",
      "links": "",
      "comment": "Esau’s physical exhaustion prefaces a moment of impulsiveness, setting the stage for the fateful exchange."
    },
    {
      "pk": 1025030,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 30,
      "text": "And Esau said to Jacob, 'Let me eat some of that red stew, for I am exhausted!' (Therefore his name was called Edom.)",
      "links": "<a href='/AIV/1/36/1'>Gen. 36:1</a>;",
      "comment": "‘Edom’ comes from the word for ‘red’—connecting Esau’s character and choices to his legacy as father of the Edomites."
    },
    {
      "pk": 1025031,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 31,
      "text": "Jacob said, 'Sell me your birthright now.'",
      "links": "<a href='/AIV/1/27/36'>Gen. 27:36</a>;",
      "comment": "The birthright carried not just material inheritance but spiritual significance—pointing to the importance of God’s blessings passed through generations."
    },
    {
      "pk": 1025032,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 32,
      "text": "Esau said, 'Look, I am about to die; of what use is a birthright to me?'",
      "links": "<a href='/AIV/58/12/16'>Heb. 12:16</a>;",
      "comment": "Later Scripture condemns Esau's despising of the birthright (Heb 12:16), contrasting spiritual values with worldly impulses."
    },
    {
      "pk": 1025033,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 33,
      "text": "Jacob said, 'Swear to me now.' So he swore to him and sold his birthright to Jacob.",
      "links": "",
      "comment": "Oaths and covenants have binding force; the seriousness of Esau's decision is underscored."
    },
    {
      "pk": 1025034,
      "translation": "AIV",
      "book": 1,
      "chapter": 25,
      "verse": 34,
      "text": "Then Jacob gave Esau bread and lentil stew, and he ate and drank and rose and went his way. So Esau despised his birthright.",
      "links": "<a href='/AIV/58/12/16-17'>Heb. 12:16–17</a>;",
      "comment": "Esau’s disregard for spiritual blessing is condemned in later revelation as a warning to those who would trade spiritual inheritance for fleeting pleasures. This also prefigures the greater value of spiritual realities passed down through divinely appointed means, hinting at the enduring significance of blessings mediated through sacred tradition (see also Genesis 27:28–29)."
    }
  ],
  "translatedAt": "2025-12-23T08:46:42.929Z"
}