{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 25,
  "verses": [
    {
      "pk": 1025001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 1,
      "text": "Abraham took another wife, and her name was Keturah.",
      "links": "<a href='/AIV/1/1/32'>Gen. 1:32</a>; <a href='/AIV/13/1/32'>1 Chron. 1:32</a>",
      "comment": "Keturah is mentioned as Abraham's wife following Sarah's death. Some traditions debate whether she was a concubine or a legitimate wife, but the text here uses the same Hebrew word as for Sarah. This demonstrates Abraham's continued fruitfulness and obedience to God's call to be the father of many nations (<a href='/AIV/1/17/4-5'>Gen. 17:4-5</a>)."
    },
    {
      "pk": 1025002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 2,
      "text": "She bore him Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah.",
      "links": "<a href='/AIV/13/1/32'>1 Chron. 1:32</a>",
      "comment": "These sons became ancestors of various Arab tribes, fulfilling God's promise that Abraham would be the father of many nations. The emphasis on genealogies highlights the importance of continuity and spiritual heritage."
    },
    {
      "pk": 1025003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 3,
      "text": "Jokshan became the father of Sheba and Dedan. The descendants of Dedan were the Asshurim, the Letushim, and the Leummim.",
      "links": "<a href='/AIV/1/10/7'>Gen. 10:7</a>; <a href='/AIV/13/1/32'>1 Chron. 1:32</a>",
      "comment": "Sheba and Dedan feature later in prophecy and in the history of surrounding nations (<a href='/AIV/23/60/6'>Is. 60:6</a>). This hints at the lasting influence of Abraham's descendants beyond Israel."
    },
    {
      "pk": 1025004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 4,
      "text": "The sons of Midian were Ephah, Epher, Hanoch, Abida, and Eldaah. All these were Keturah's descendants.",
      "links": "<a href='/AIV/7/6/1'>Judg. 6:1</a>; <a href='/AIV/1/37/28'>Gen. 37:28</a>",
      "comment": "The Midianites play significant roles throughout Israel's history, including Moses' sojourn in Midian and later conflicts. This demonstrates the ongoing legacy of Abraham's family."
    },
    {
      "pk": 1025005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 5,
      "text": "Abraham gave all that he had to Isaac.",
      "links": "<a href='/AIV/1/17/19'>Gen. 17:19</a>; <a href='/AIV/1/24/36'>Gen. 24:36</a>",
      "comment": "Isaac receives the inheritance, indicating the chosen line through which God's covenant will continue. This underscores the significance of lineage, calling to mind the passing down of spiritual as well as material blessings—a theme sustained in the apostolic succession of God's people."
    },
    {
      "pk": 1025006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 6,
      "text": "But to the sons of Abraham’s concubines, Abraham gave gifts, and while he was still living, he sent them away from his son Isaac, eastward, to the land of the East.",
      "links": "<a href='/AIV/1/21/14'>Gen. 21:14</a>",
      "comment": "Abraham distinguishes between Isaac (the child of promise) and his other sons (children of the flesh; cf. <a href='/AIV/45/9/7-8'>Rom. 9:7-8</a>). The giving of gifts alludes to a sense of inclusion, yet the inheritance remains with the promised heir—a foreshadowing of God's economy of salvation."
    },
    {
      "pk": 1025007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 7,
      "text": "These are the days of the years of Abraham’s life: one hundred seventy-five years.",
      "links": "<a href='/AIV/1/12/4'>Gen. 12:4</a>",
      "comment": "Abraham's longevity is presented as a sign of divine blessing in accordance with covenantal promises (<a href='/AIV/1/15/15'>Gen. 15:15</a>)."
    },
    {
      "pk": 1025008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 8,
      "text": "Abraham breathed his last and died in a good old age, old and full of years, and was gathered to his people.",
      "links": "<a href='/AIV/1/15/15'>Gen. 15:15</a>; <a href='/AIV/1/35/29'>Gen. 35:29</a>",
      "comment": "The phrase 'gathered to his people' implies an existence beyond death, suggesting the communal hope of the patriarchs in the afterlife and an early hint at the communion of saints."
    },
    {
      "pk": 1025009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 9,
      "text": "Isaac and Ishmael, his sons, buried him in the cave of Machpelah, in the field of Ephron the son of Zohar the Hittite, east of Mamre,",
      "links": "<a href='/AIV/1/23/19'>Gen. 23:19</a>; <a href='/AIV/1/35/29'>Gen. 35:29</a>",
      "comment": "Isaac (the son of promise) and Ishmael (son by Hagar) reunite to bury Abraham, showing familial duty and the recognition of Abraham's unique role. The cave of Machpelah remains a key sacred heritage site."
    },
    {
      "pk": 1025010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 10,
      "text": "the field which Abraham purchased from the sons of Heth. Abraham was buried there with Sarah his wife.",
      "links": "<a href='/AIV/1/23/19-20'>Gen. 23:19-20</a>",
      "comment": "The burial with Sarah shows the importance of family unity and, by extension, the enduring value of the domestic church. The ownership of the grave highlights the element of land promised to Abraham's descendants."
    },
    {
      "pk": 1025011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 11,
      "text": "And after Abraham’s death, God blessed his son Isaac; and Isaac settled at Beer-lahai-roi.",
      "links": "<a href='/AIV/1/16/14'>Gen. 16:14</a>; <a href='/AIV/1/24/62'>Gen. 24:62</a>",
      "comment": "The blessing continues through Isaac, reaffirming the single line of promise. Isaac’s location at Beer-lahai-roi connects to Hagar's encounter with God, showing both providence and continuity."
    },
    {
      "pk": 1025012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 12,
      "text": "Now these are the generations of Ishmael, Abraham’s son, whom Hagar the Egyptian, Sarah’s servant, bore to Abraham.",
      "links": "<a href='/AIV/1/16/3'>Gen. 16:3</a>; <a href='/AIV/1/17/20'>Gen. 17:20</a>",
      "comment": "This genealogy shows the faithfulness of God even to those outside the main line of promise, prefiguring God's universal blessing to all nations (<a href='/AIV/1/12/3'>Gen. 12:3</a>)."
    },
    {
      "pk": 1025013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 13,
      "text": "These are the names of the sons of Ishmael, listed by their generations: the firstborn of Ishmael, Nebaioth, and then Kedar, Adbeel, Mibsam,",
      "links": "<a href='/AIV/1/17/20'>Gen. 17:20</a>; <a href='/AIV/23/60/7'>Is. 60:7</a>",
      "comment": "Nebaioth and Kedar are frequently referenced in later Scripture. Ishmael’s descendants become significant in the broader biblical story."
    },
    {
      "pk": 1025014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 14,
      "text": "Mishma, Dumah, Massa,",
      "links": "<a href='/AIV/13/1/30'>1 Chron. 1:30</a>",
      "comment": "These sons are associated with various tribes of the Arabian Peninsula, reminding readers of the fulfillment of God’s promises."
    },
    {
      "pk": 1025015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 15,
      "text": "Hadad, Tema, Jetur, Naphish, and Kedemah.",
      "links": "<a href='/AIV/13/1/30'>1 Chron. 1:30-31</a>",
      "comment": "The detailed genealogy gives dignity to all of Abraham's descendants. God’s providence extends beyond the immediate chosen line."
    },
    {
      "pk": 1025016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 16,
      "text": "These are the sons of Ishmael, and these are their names by their villages and by their encampments: twelve princes according to their tribes.",
      "links": "<a href='/AIV/1/17/20'>Gen. 17:20</a>; <a href='/AIV/13/1/31'>1 Chron. 1:31</a>",
      "comment": "Twelve princes echoes the later twelve tribes of Israel, suggesting a certain symmetry in God’s governance and a foreshadowing of the completeness found in divine order."
    },
    {
      "pk": 1025017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 17,
      "text": "These are the years of the life of Ishmael: one hundred thirty-seven years. He breathed his last and died, and was gathered to his people.",
      "links": "<a href='/AIV/1/35/29'>Gen. 35:29</a>",
      "comment": "The phrase ‘gathered to his people’ for Ishmael as for Abraham reflects the dignity of every human life and the hope of life beyond death, a spiritual truth the faithful continue to profess."
    },
    {
      "pk": 1025018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 18,
      "text": "They lived from Havilah to Shur, which is opposite Egypt in the direction of Assyria. He settled in defiance of all his relatives.",
      "links": "<a href='/AIV/1/16/12'>Gen. 16:12</a>",
      "comment": "Ishmael’s descendants dwell in the vast region prophesied in <a href='/AIV/1/16/12'>Gen. 16:12</a>, showing both fulfillment of prophecy and the reality of familial strife after Abraham."
    },
    {
      "pk": 1025019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 19,
      "text": "These are the generations of Isaac, Abraham’s son: Abraham was the father of Isaac.",
      "links": "<a href='/AIV/1/11/27'>Gen. 11:27</a>",
      "comment": "This transition signals the movement of God's covenant focus from Abraham to Isaac, restating the importance of spiritual and genealogical descent."
    },
    {
      "pk": 1025020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 20,
      "text": "Isaac was forty years old when he married Rebekah, the daughter of Bethuel the Aramean from Paddan-aram, the sister of Laban the Aramean.",
      "links": "<a href='/AIV/1/24/67'>Gen. 24:67</a>",
      "comment": "The Aramean link shows how God uses unexpected means, including foreign connections, to fulfill His purposes. This highlights the universality of God’s call, not limited by ethnicity."
    },
    {
      "pk": 1025021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 21,
      "text": "Isaac prayed to the LORD for his wife because she was barren, and the LORD granted his prayer, and Rebekah his wife conceived.",
      "links": "<a href='/AIV/1/11/30'>Gen. 11:30</a>; <a href='/AIV/1/18/14'>Gen. 18:14</a>; <a href='/AIV/1/30/22'>Gen. 30:22</a>",
      "comment": "God’s action in opening the womb illustrates the principle that life is ultimately a gift from God. Isaac's intercessory prayer prefigures the power of intercession, reminding us of the role of intercessors in God’s plan."
    },
    {
      "pk": 1025022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 22,
      "text": "But the children struggled together within her, and she said, 'If it is so, why am I like this?' So she went to inquire of the LORD.",
      "links": "<a href='/AIV/9/1/27'>1 Sam. 1:27</a>",
      "comment": "The pre-natal struggle foreshadows the future conflict between their descendants. Rebekah’s seeking the Lord demonstrates reliance on God’s prophetic word."
    },
    {
      "pk": 1025023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 23,
      "text": "And the LORD said to her, 'Two nations are in your womb, and two peoples will be separated from within you; one people will be stronger than the other, and the older will serve the younger.'",
      "links": "<a href='/AIV/45/9/10-13'>Rom. 9:10-13</a>; <a href='/AIV/1/27/29'>Gen. 27:29</a>",
      "comment": "God’s sovereign choice is emphasized here. Paul later uses this passage to support the doctrine of election. The subversion of norms (the younger over the older) prefigures the value of grace over works."
    },
    {
      "pk": 1025024,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 24,
      "text": "When her days to give birth were completed, behold, there were twins in her womb.",
      "links": "<a href='/AIV/1/38/27'>Gen. 38:27</a>",
      "comment": "The appearance of twins is rare for biblical genealogies, marking this birth as especially significant for salvation history."
    },
    {
      "pk": 1025025,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 25,
      "text": "The first came out red, all his body like a hairy cloak; so they called his name Esau.",
      "links": "<a href='/AIV/1/27/11'>Gen. 27:11</a>",
      "comment": "Esau’s appearance is seen as a portent of his character and of the nation that will come from him (Edom)."
    },
    {
      "pk": 1025026,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 26,
      "text": "Afterward his brother came out, with his hand holding Esau’s heel; so his name was called Jacob. Isaac was sixty years old when she bore them.",
      "links": "<a href='/AIV/1/27/36'>Gen. 27:36</a>",
      "comment": "Jacob’s name, meaning 'he grasps the heel' or 'supplanter,' foreshadows future events. The delay in Isaac’s fatherhood upholds God’s power, not human effort."
    },
    {
      "pk": 1025027,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 27,
      "text": "When the boys grew up, Esau became a skilled hunter, a man of the field, while Jacob was a quiet man, dwelling in tents.",
      "links": "<a href='/AIV/1/4/2'>Gen. 4:2</a>",
      "comment": "Contrasts are drawn between the brothers’ characters. The preference for the 'quiet' tent-dweller echoes the call to contemplation and prayer."
    },
    {
      "pk": 1025028,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 28,
      "text": "Isaac loved Esau because he ate of his game, but Rebekah loved Jacob.",
      "links": "<a href='/AIV/1/27/4'>Gen. 27:4</a>",
      "comment": "Parental favoritism introduces the theme of division in families, which God can redeem for His purposes."
    },
    {
      "pk": 1025029,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 29,
      "text": "Once when Jacob was cooking stew, Esau came in from the field, and he was exhausted.",
      "links": "<a href='/AIV/58/12/16'>Heb. 12:16</a>",
      "comment": "The scene is set for the exchange of the birthright, which the New Testament later uses to illustrate the danger of despising the gifts and promises of God."
    },
    {
      "pk": 1025030,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 30,
      "text": "And Esau said to Jacob, 'Let me eat some of that red stew, for I am exhausted!' (Therefore his name was called Edom.)",
      "links": "<a href='/AIV/1/36/1'>Gen. 36:1</a>",
      "comment": "'Edom' (meaning 'red') becomes the name for Esau’s descendants, the Edomites."
    },
    {
      "pk": 1025031,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 31,
      "text": "Jacob said, 'Sell me your birthright now.'",
      "links": "<a href='/AIV/1/27/36'>Gen. 27:36</a>",
      "comment": "The birthright included spiritual leadership as well as inheritance. Jacob’s desire for it suggests a longing for the spiritual blessings associated with his heritage."
    },
    {
      "pk": 1025032,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 32,
      "text": "Esau said, 'I am about to die; of what use is a birthright to me?'",
      "links": "<a href='/AIV/58/12/16'>Heb. 12:16</a>",
      "comment": "Esau’s disregard for his spiritual inheritance is a warning against neglecting what is holy. The New Testament warns believers not to trade spiritual blessings for immediate, worldly satisfaction."
    },
    {
      "pk": 1025033,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 33,
      "text": "Jacob said, 'Swear to me now.' So he swore to him and sold his birthright to Jacob.",
      "links": "<a href='/AIV/1/27/36'>Gen. 27:36</a>",
      "comment": "The oath formalizes the transfer of the birthright, underlining the seriousness of oaths and vows—later a key part of the life of the people of God."
    },
    {
      "pk": 1025034,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 25,
      "verse": 34,
      "text": "Then Jacob gave Esau bread and lentil stew. He ate and drank and rose and went his way. In this way Esau despised his birthright.",
      "links": "<a href='/AIV/58/12/16'>Heb. 12:16</a>",
      "comment": "The passage closes with Esau’s rejection of his calling, serving as a warning for believers to cherish their spiritual inheritance. The reverence for inheritance and birthright here reflects a reality still present in the structure and worship of God's people, who hold fast to what they have received from those who walked with God before them (<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/54/6/20'>1 Tim. 6:20</a>)."
    }
  ],
  "translatedAt": "2025-12-24T00:23:55.316Z"
}