{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 47,
  "verses": [
    {
      "pk": 1947047,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 1,
      "text": "Then Joseph went and told Pharaoh, \"My father and my brothers, with their flocks and herds and all that they own, have come from the land of Canaan; they are now in the land of Goshen.\"",
      "links": "<a href='/AIV/1/46/28'>Gen. 46:28</a>",
      "comment": "Joseph, acting as a mediator, presents his family to Pharaoh. This mirrors the priestly role of interceding for others (see Heb. 7:25)."
    },
    {
      "pk": 1947048,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 2,
      "text": "He took five of his brothers along and presented them to Pharaoh.",
      "links": "",
      "comment": "The number five symbolizes grace and favor. Joseph chooses a representative group as advocates, foreshadowing the importance of chosen leaders."
    },
    {
      "pk": 1947049,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 3,
      "text": "Pharaoh said to his brothers, \"What is your occupation?\" They answered Pharaoh, \"Your servants are shepherds, both we and our fathers.\"",
      "links": "<a href='/AIV/1/46/33-34'>Gen. 46:33–34</a>",
      "comment": "The humble work of shepherds has deep biblical significance (see Ps. 23:1; John 10:11), prefiguring Christ, the Good Shepherd."
    },
    {
      "pk": 1947050,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 4,
      "text": "They also said to Pharaoh, \"We have come to sojourn in the land, for there is no pasture for your servants’ flocks because the famine is severe in the land of Canaan. Now, please let your servants live in the land of Goshen.\"",
      "links": "<a href='/AIV/1/12/10'>Gen. 12:10</a>; <a href='/AIV/1/41/54'>Gen. 41:54</a>",
      "comment": "Their sojourn reflects the pilgrim nature of God's people (Heb. 11:13). Requesting Goshen reveals both humility and wisdom."
    },
    {
      "pk": 1947051,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 5,
      "text": "Then Pharaoh said to Joseph, \"Your father and your brothers have come to you.\"",
      "links": "",
      "comment": "Pharaoh’s recognition of Joseph’s family emphasizes the honor and authority delegated to Joseph—a type of Christ's role in granting access to the Father."
    },
    {
      "pk": 1947052,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 6,
      "text": "\"The land of Egypt is before you; settle your father and your brothers in the best of the land. Let them dwell in the land of Goshen. If you know any men of ability among them, put them in charge of my livestock.\"",
      "links": "<a href='/AIV/1/45/18'>Gen. 45:18</a>",
      "comment": "Pharaoh's generosity provides for Israel, symbolizing how God provides for His chosen people through His appointed mediator."
    },
    {
      "pk": 1947053,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 7,
      "text": "Then Joseph brought in Jacob his father and set him before Pharaoh, and Jacob blessed Pharaoh.",
      "links": "<a href='/AIV/1/47/10'>Gen. 47:10</a>; <a href='/AIV/58/7/7'>Heb. 7:7</a>",
      "comment": "Jacob's blessing of Pharaoh indicates the greater spiritual authority of God's covenant people (cf. Heb. 7:7, 'the lesser is blessed by the greater')."
    },
    {
      "pk": 1947054,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 8,
      "text": "Pharaoh said to Jacob, \"How many are the years of your life?\"",
      "links": "",
      "comment": "This inquiry highlights Jacob’s wisdom and experience, valued in ancient societies. Longevity is seen as a sign of blessing."
    },
    {
      "pk": 1947055,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 9,
      "text": "Jacob said to Pharaoh, \"The years of my sojourning are one hundred thirty. Few and difficult have been the days of my life, and they have not reached the length of the days of my fathers in the days of their sojourning.\"",
      "links": "<a href='/AIV/1/25/7'>Gen. 25:7</a>; <a href='/AIV/1/47/28'>Gen. 47:28</a>",
      "comment": "Jacob reflects on his life as a pilgrimage, full of hardship, reminding us that the life of faith often involves suffering before glory (cf. 2 Cor. 4:17)."
    },
    {
      "pk": 1947056,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 10,
      "text": "And Jacob blessed Pharaoh and went out from Pharaoh’s presence.",
      "links": "<a href='/AIV/1/47/7'>Gen. 47:7</a>",
      "comment": "The bestowing of blessing once again reinforces the dignity and mission of God's chosen, set apart to be a blessing to the nations (Gen. 12:2-3)."
    },
    {
      "pk": 1947057,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 11,
      "text": "So Joseph settled his father and his brothers and gave them a possession in the land of Egypt, in the best part of the land, in the land of Rameses, as Pharaoh had commanded.",
      "links": "<a href='/AIV/1/47/6'>Gen. 47:6</a>; <a href='/AIV/2/1/11'>Ex. 1:11</a>",
      "comment": "Possession in foreign land anticipates Israel’s later journey. Land grant echoes major themes of inheritance found throughout Scripture."
    },
    {
      "pk": 1947058,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 12,
      "text": "Joseph provided his father, his brothers, and all his father’s household with food, according to the number of their dependents.",
      "links": "<a href='/AIV/1/45/11'>Gen. 45:11</a>",
      "comment": "Joseph’s provision is a model of stewardship and sacrificial care, looking forward to Christ’s feeding of His people (John 6:35)."
    },
    {
      "pk": 1947059,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 13,
      "text": "Now there was no bread in all the land, for the famine was very severe, so that the land of Egypt and the land of Canaan languished from the famine.",
      "links": "<a href='/AIV/1/41/57'>Gen. 41:57</a>",
      "comment": "The severity of the famine highlights humankind’s dependence on God’s providence. Christ’s provision of the Bread of Life (John 6:48) fulfills this need spiritually."
    },
    {
      "pk": 1947060,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 14,
      "text": "Joseph gathered all the money that was found in the land of Egypt and in the land of Canaan, in exchange for the grain which they bought, and he brought the money into Pharaoh’s house.",
      "links": "<a href='/AIV/1/41/56-57'>Gen. 41:56–57</a>",
      "comment": "Administration of resources illustrates wise stewardship, an image of apostolic oversight in the early Church (Acts 4:34–35)."
    },
    {
      "pk": 1947061,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 15,
      "text": "When all the money in Egypt and Canaan was spent, all the Egyptians came to Joseph and said, \"Give us food! Why should we die in your presence? Our money is gone.\"",
      "links": "",
      "comment": "The complete dependence on Joseph prefigures ultimate reliance on God’s mediator. See parallels with John 6:68 (‘Lord, to whom shall we go?’)."
    },
    {
      "pk": 1947062,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 16,
      "text": "Joseph said, \"Give your livestock, and I will give you food in exchange for your livestock, if your money is gone.\"",
      "links": "",
      "comment": "Joseph’s just rule protects the people while upholding Pharaoh’s authority, a type of Church stewardship under divine authority."
    },
    {
      "pk": 1947063,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 17,
      "text": "So they brought their livestock to Joseph, and Joseph gave them food in exchange for the horses, the flocks of sheep, the herds of cattle, and the donkeys. He supplied them with food in exchange for their livestock that year.",
      "links": "",
      "comment": "The exchange system shows the costliness of survival in famine. The willingness to give all for life foreshadows the total surrender called for in discipleship (Luke 14:33)."
    },
    {
      "pk": 1947064,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 18,
      "text": "When that year ended, they came to him the next year and said, \"We cannot hide from my lord that our money is spent; the herds of livestock are my lord’s. There is nothing left in the sight of my lord except our bodies and our land.\"",
      "links": "",
      "comment": "Their destitution reveals the emptiness of earthly riches, reminding us only God completely satisfies (Phil. 4:11-12)."
    },
    {
      "pk": 1947065,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 19,
      "text": "\"Why should we die before your eyes, both we and our land? Buy us and our land for food, and we and our land will serve Pharaoh. Give us seed, that we may live and not die, and that the land may not become desolate.\"",
      "links": "",
      "comment": "Willing submission for survival echoes the call to willingly submit to God's providence for true life (Rom. 12:1)."
    },
    {
      "pk": 1947066,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 20,
      "text": "So Joseph bought all the land of Egypt for Pharaoh, for every Egyptian sold his field, because the famine was severe upon them. The land became Pharaoh’s.",
      "links": "",
      "comment": "Centralization of the land under Pharaoh underscores the principle of true authority originating in God, with God's stewards administering it (cf. Matt. 28:18)."
    },
    {
      "pk": 1947067,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 21,
      "text": "As for the people, he moved them to cities from one end of Egypt to the other.",
      "links": "",
      "comment": "This resettlement for practical reasons points toward God’s sovereignty over all human affairs."
    },
    {
      "pk": 1947068,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 22,
      "text": "Only the land of the priests he did not buy, for the priests had an allotment from Pharaoh and ate from the portion which Pharaoh gave them; therefore they did not sell their land.",
      "links": "",
      "comment": "Priestly privilege and provision reflect the sacredness given to those serving at God’s altar. This anticipates the Church setting apart ministers who depend upon their flocks (Matt. 10:10; 1 Cor. 9:13-14)."
    },
    {
      "pk": 1947069,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 23,
      "text": "Then Joseph said to the people, \"Today I have bought you and your land for Pharaoh. Here is seed for you, so that you may sow the land.\"",
      "links": "",
      "comment": "Joseph gives not only provision but hope for the future. The giving of seed has echoes of resurrection themes (John 12:24)."
    },
    {
      "pk": 1947070,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 24,
      "text": "\"At the time of harvest you shall give one-fifth to Pharaoh, and four-fifths shall be your own, as seed for the field and for food for yourselves, your households, and your little ones.\"",
      "links": "",
      "comment": "A fair and ordered system is instituted, highlighting the importance of just stewardship—connecting to biblical teachings on tithes and offerings (Lev. 27:30)."
    },
    {
      "pk": 1947071,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 25,
      "text": "They said, \"You have saved our lives. May we find favor in my lord’s sight, and we will be Pharaoh’s servants.\"",
      "links": "",
      "comment": "Deliverance brings grateful service—salvation leads to devoted obedience (Rom. 6:18-19)."
    },
    {
      "pk": 1947072,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 26,
      "text": "So Joseph made it a statute over the land of Egypt to this day, that Pharaoh should have the fifth; only the land of the priests did not become Pharaoh’s.",
      "links": "",
      "comment": "An established ordinance endures for generations—foreshadowing how apostolic tradition and sacred order safeguards God’s people."
    },
    {
      "pk": 1947073,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 27,
      "text": "Thus Israel settled in the land of Egypt, in the region of Goshen. They acquired property there and were fruitful and multiplied greatly.",
      "links": "<a href='/AIV/1/1/28'>Gen. 1:28</a>; <a href='/AIV/2/1/7'>Ex. 1:7</a>",
      "comment": "God’s blessing is evident in fruitfulness, fulfilling the original command to be fruitful and multiply. See also Ex. 1:7."
    },
    {
      "pk": 1947074,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 28,
      "text": "Jacob lived in the land of Egypt seventeen years. So the days of Jacob, the years of his life, were one hundred forty-seven years.",
      "links": "<a href='/AIV/1/47/9'>Gen. 47:9</a>",
      "comment": "The completeness of Jacob’s years suggests fulfillment of God’s providence through the patriarchs."
    },
    {
      "pk": 1947075,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 29,
      "text": "When the time drew near that Israel must die, he called his son Joseph and said to him, \"If I have found favor in your eyes, put your hand under my thigh and deal with me in kindness and faithfulness. Do not bury me in Egypt,\"",
      "links": "<a href='/AIV/1/24/2'>Gen. 24:2</a>",
      "comment": "This solemn oath recalls patriarchal customs for making binding promises and expresses hope in God’s promises regarding the land."
    },
    {
      "pk": 1947076,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 30,
      "text": "\"but let me lie with my fathers. Carry me out of Egypt and bury me in their burial place.\" He said, \"I will do as you have said.\"",
      "links": "<a href='/AIV/1/49/29-30'>Gen. 49:29-30</a>",
      "comment": "Jacob’s faith points toward the hope of resurrection and the importance of sacred tradition regarding burial (cf. Heb. 11:22)."
    },
    {
      "pk": 1947077,
      "translation": "AIV",
      "book": 1,
      "chapter": 47,
      "verse": 31,
      "text": "\"Swear to me,\" he said. And he swore to him. Then Israel bowed himself at the head of his bed.",
      "links": "<a href='/AIV/1/48/2'>Gen. 48:2</a>; <a href='/AIV/58/11/21'>Heb. 11:21</a>",
      "comment": "Israel’s act of worship (bowing on his bed) is commended in Heb. 11:21 as an act of faith in God’s promises—see Heb. 11:21. This verse underlines the beauty of faithfulness to God’s covenant, even to life’s end."
    }
  ],
  "translatedAt": "2025-12-23T09:00:04.592Z"
}