{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 21,
  "verses": [
    {
      "pk": 2102101,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 1,
      "text": "The Lord visited Sarah as he had said, and the Lord did for Sarah as he had promised.",
      "links": "<a href='/AIV/1/18/10'>Gen. 18:10</a>; <a href='/AIV/1/17/19'>Gen. 17:19</a>",
      "comment": "God’s faithfulness is shown here, fulfilling the earlier promise of a son to Sarah in her old age. See also the connection to the theme of miraculous births pointing forward to future events in salvation history."
    },
    {
      "pk": 2102102,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 2,
      "text": "Sarah conceived and bore Abraham a son in his old age at the time God had set, just as he had spoken.",
      "links": "<a href='/AIV/1/17/21'>Gen. 17:21</a>; <a href='/AIV/1/18/10-14'>Gen. 18:10–14</a>",
      "comment": "The specific timing reinforces that God’s plan unfolds according to His will. Compare to <a href='/AIV/42/1/57'>Luke 1:57</a>, where Elizabeth also conceives in old age."
    },
    {
      "pk": 2102103,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 3,
      "text": "Abraham called the name of his son who was born to him, whom Sarah bore him, Isaac.",
      "links": "<a href='/AIV/1/17/19'>Gen. 17:19</a>; <a href='/AIV/1/21/6'>Gen. 21:6</a>",
      "comment": "Isaac means 'he laughs,' reflecting both Abraham and Sarah’s laughter at God’s surprise. See <a href='/AIV/1/17/17'>Gen. 17:17</a>, <a href='/AIV/1/18/12'>18:12</a>."
    },
    {
      "pk": 2102104,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 4,
      "text": "Abraham circumcised his son Isaac when he was eight days old, just as God had commanded him.",
      "links": "<a href='/AIV/1/17/12'>Gen. 17:12</a>; <a href='/AIV/3/12/3'>Lev. 12:3</a>",
      "comment": "The act of circumcision marks Isaac’s entry into the covenant, showing obedience to God’s command—prefiguring later signs of covenantal belonging."
    },
    {
      "pk": 2102105,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 5,
      "text": "Abraham was one hundred years old when his son Isaac was born to him.",
      "links": "<a href='/AIV/1/17/17'>Gen. 17:17</a>; <a href='/AIV/1/17/24'>Gen. 17:24</a>",
      "comment": "This detail underscores the miraculous nature of Isaac’s birth, reinforcing God's power to fulfill His promises against all human expectation."
    },
    {
      "pk": 2102106,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 6,
      "text": "Sarah said, 'God has brought me laughter, and everyone who hears will laugh over me.'",
      "links": "<a href='/AIV/1/18/12-15'>Gen. 18:12–15</a>; <a href='/AIV/42/1/58'>Luke 1:58</a>",
      "comment": "Sarah’s joy is a testimony to God's faithfulness—paralleling the later joy announced at other miraculous births in Scripture."
    },
    {
      "pk": 2102107,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 7,
      "text": "She also said, 'Who would have said to Abraham that Sarah would nurse children? Yet I have borne him a son in his old age.'",
      "links": "<a href='/AIV/1/18/11'>Gen. 18:11</a>; <a href='/AIV/42/1/36'>Luke 1:36</a>",
      "comment": "Sarah’s wonder affirms that with God nothing is impossible—an idea echoed in later scripture (<a href='/AIV/42/1/37'>Luke 1:37</a>)."
    },
    {
      "pk": 2102108,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 8,
      "text": "The child grew and was weaned, and Abraham made a great feast on the day that Isaac was weaned.",
      "links": "<a href='/AIV/1/30/23'>Gen. 30:23</a>; <a href='/AIV/1/40/20'>Gen. 40:20</a>",
      "comment": "The weaning is a celebration of life and future, showing thanksgiving for God’s gift. Such feasts foreshadow themes of celebration in God’s family."
    },
    {
      "pk": 2102109,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 9,
      "text": "But Sarah saw the son of Hagar the Egyptian, whom she had borne to Abraham, mocking.",
      "links": "<a href='/AIV/1/16/15'>Gen. 16:15</a>; <a href='/AIV/48/4/29'>Galatians 4:29</a>",
      "comment": "Ishmael’s behavior here later becomes a spiritual symbol, as Paul draws a comparison between bondage and promise (<a href='/AIV/48/4/29'>Gal. 4:29</a>)."
    },
    {
      "pk": 2102110,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 10,
      "text": "So she said to Abraham, 'Drive out this slave woman with her son, for the son of this slave woman shall not share the inheritance with my son Isaac.'",
      "links": "<a href='/AIV/1/25/5'>Gen. 25:5</a>; <a href='/AIV/48/4/30'>Galatians 4:30</a>",
      "comment": "Sarah’s insistence on Isaac's priority prefigures the distinction between what is born according to the flesh and what is born by promise, as elaborated by Paul."
    },
    {
      "pk": 2102111,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 11,
      "text": "The matter was very distressing to Abraham because of his son.",
      "links": "<a href='/AIV/1/17/18'>Gen. 17:18</a>",
      "comment": "Abraham’s sorrow shows his real human feelings and the personal cost of following God’s plan."
    },
    {
      "pk": 2102112,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 12,
      "text": "But God said to Abraham, 'Do not be distressed because of the boy and because of your slave woman. Listen to whatever Sarah tells you, because it is through Isaac that your offspring shall be called.'",
      "links": "<a href='/AIV/1/17/19'>Gen. 17:19</a>; <a href='/AIV/58/11/18'>Hebrews 11:18</a>; <a href='/AIV/45/9/7'>Romans 9:7</a>",
      "comment": "This verse highlights God’s sovereign election. The chosen line comes through Isaac, which points to God's mysterious way of choosing even in salvation history."
    },
    {
      "pk": 2102113,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 13,
      "text": "But I will also make the son of the slave woman into a nation, because he is your offspring.",
      "links": "<a href='/AIV/1/16/10'>Gen. 16:10</a>; <a href='/AIV/1/21/18'>Gen. 21:18</a>",
      "comment": "Despite the chosen status of Isaac, God remains merciful to Ishmael, showing that His mercy extends outward, hinting towards a future blessing for the nations."
    },
    {
      "pk": 2102114,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 14,
      "text": "So Abraham rose early in the morning, took bread and a container of water, and gave them to Hagar, putting them on her shoulder, along with the boy, and sent her away. She departed and wandered in the wilderness of Beersheba.",
      "links": "<a href='/AIV/1/16/14'>Gen. 16:14</a>",
      "comment": "Abraham’s obedience showcases his trust in God. Beersheba becomes a significant location for future covenants."
    },
    {
      "pk": 2102115,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 15,
      "text": "When the water in the skin was gone, she placed the child under one of the bushes.",
      "links": "<a href='/AIV/1/21/19'>Gen. 21:19</a>",
      "comment": "The desperation of Hagar underscores her vulnerability, inviting the reader to consider God’s care for those in distress."
    },
    {
      "pk": 2102116,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 16,
      "text": "Then she went and sat down opposite him, a good distance away, about a bowshot, for she said, 'Let me not look upon the death of the child.' And as she sat opposite, she lifted up her voice and wept.",
      "links": "<a href='/AIV/1/27/38'>Gen. 27:38</a>",
      "comment": "Hagar’s anguish and prayer echo other moments in Scripture where desperate cries are met by divine response."
    },
    {
      "pk": 2102117,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 17,
      "text": "God heard the voice of the boy, and the angel of God called to Hagar from heaven and said to her, 'What is troubling you, Hagar? Do not be afraid; God has heard the voice of the boy where he is.'",
      "links": "<a href='/AIV/1/16/7'>Gen. 16:7</a>; <a href='/AIV/1/16/11'>Gen. 16:11</a>",
      "comment": "A divine messenger intervenes, as earlier in Hagar’s life. God’s providence for the marginalized is a recurring theme."
    },
    {
      "pk": 2102118,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 18,
      "text": "Get up, lift up the boy and hold him with your hand, for I will make him a great nation.",
      "links": "<a href='/AIV/1/16/10'>Gen. 16:10</a>",
      "comment": "The Lord reiterates His promise, showing that human despair does not thwart God’s plans. Physical and spiritual rescue are unified in God’s action."
    },
    {
      "pk": 2102119,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 19,
      "text": "Then God opened her eyes, and she saw a well of water. She went and filled the container with water, and gave the boy a drink.",
      "links": "<a href='/AIV/1/16/14'>Gen. 16:14</a>; <a href='/AIV/2/15/25'>Exodus 15:25</a>",
      "comment": "The opening of Hagar’s eyes to water prefigures God’s gracious provision; later biblical themes show water as a symbol of God’s life-giving grace."
    },
    {
      "pk": 2102120,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 20,
      "text": "God was with the boy, and he grew. He lived in the wilderness and became an archer.",
      "links": "<a href='/AIV/1/16/12'>Gen. 16:12</a>; <a href='/AIV/1/25/27'>Gen. 25:27</a>",
      "comment": "Despite being excluded from the covenant family, Ishmael thrives under God's providential care."
    },
    {
      "pk": 2102121,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 21,
      "text": "He lived in the wilderness of Paran, and his mother took a wife for him from the land of Egypt.",
      "links": "<a href='/AIV/1/24/4'>Gen. 24:4</a>; <a href='/AIV/1/25/12'>Gen. 25:12'>Gen. 25:12</a>",
      "comment": "Hagar’s choice of an Egyptian wife for Ishmael indicates the enduring link to Egypt and contrasts with the spiritual significance placed on Isaac’s lineage."
    },
    {
      "pk": 2102122,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 22,
      "text": "At that time Abimelech and Phicol, the commander of his army, spoke to Abraham, saying, 'God is with you in all that you do.'",
      "links": "<a href='/AIV/1/20/2'>Gen. 20:2</a>; <a href='/AIV/1/26/26-28'>Gen. 26:26–28</a>",
      "comment": "The acknowledgment by foreign leaders of God's presence with Abraham foreshadows recognition of God’s blessed people in the future."
    },
    {
      "pk": 2102123,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 23,
      "text": "Now therefore, swear to me here by God that you will not deal falsely with me, or with my descendants or my posterity, but as I have dealt kindly with you, so you will deal with me and with the land where you have lived as a foreigner.",
      "links": "<a href='/AIV/1/20/14'>Gen. 20:14</a>",
      "comment": "The request for an oath elevates the importance of faithfulness and peace between peoples, which is a recurring biblical theme."
    },
    {
      "pk": 2102124,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 24,
      "text": "And Abraham said, 'I will swear.'",
      "links": "",
      "comment": "Abraham’s readiness to swear affirms the value of oaths and trust in God’s name."
    },
    {
      "pk": 2102125,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 25,
      "text": "But Abraham reproved Abimelech because of a well of water that Abimelech's servants had seized.",
      "links": "<a href='/AIV/1/26/15'>Gen. 26:15</a>",
      "comment": "Disputes over wells were matters of survival and stewardship – later biblical leaders will also defend and restore what is rightfully theirs."
    },
    {
      "pk": 2102126,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 26,
      "text": "Abimelech said, 'I do not know who has done this thing. You did not tell me, and I have not heard about it until today.'",
      "links": "",
      "comment": "Abimelech presents himself as innocent, establishing the grounds for reconciliation."
    },
    {
      "pk": 2102127,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 27,
      "text": "So Abraham took sheep and oxen and gave them to Abimelech, and the two men made a covenant.",
      "links": "<a href='/AIV/1/15/9-10'>Gen. 15:9–10</a>; <a href='/AIV/1/26/31'>Gen. 26:31</a>",
      "comment": "Covenants sealed with gifts anticipate later sacramental covenants that define God's relationship with His people."
    },
    {
      "pk": 2102128,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 28,
      "text": "Abraham set seven ewe lambs of the flock by themselves.",
      "links": "",
      "comment": "The setting apart of seven lambs underlines the solemnity and completeness of the agreement."
    },
    {
      "pk": 2102129,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 29,
      "text": "Abimelech said to Abraham, 'What is the meaning of these seven ewe lambs that you have set apart?'",
      "links": "",
      "comment": "The question seeks clarification, emphasizing the importance of ritual actions in sealing agreements."
    },
    {
      "pk": 2102130,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 30,
      "text": "He replied, 'You are to accept these seven ewe lambs from my hand as a witness that I dug this well.'",
      "links": "",
      "comment": "The lambs become a testimony and memorial—physical signs of an oath, similar to outward signs accompanying deeper meanings in Scripture."
    },
    {
      "pk": 2102131,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 31,
      "text": "Therefore that place was called Beersheba, because there both of them swore an oath.",
      "links": "<a href='/AIV/1/26/33'>Gen. 26:33</a>",
      "comment": "'Beersheba' means 'well of the oath' or 'well of seven,' referencing both the oath and the seven lambs, recalling how place names in Scripture often have spiritual significance."
    },
    {
      "pk": 2102132,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 32,
      "text": "So they made a covenant at Beersheba. Then Abimelech and Phicol, the commander of his army, returned to the land of the Philistines.",
      "links": "<a href='/AIV/1/26/26-31'>Gen. 26:26–31</a>",
      "comment": "The peace is restored through a covenant, a pattern that continues throughout the Old Testament and finds fulfillment in God’s definitive covenant with all humanity."
    },
    {
      "pk": 2102133,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 33,
      "text": "Abraham planted a tamarisk tree in Beersheba and called there on the name of the Lord, the Everlasting God.",
      "links": "<a href='/AIV/1/4/26'>Gen. 4:26</a>; <a href='/AIV/1/26/25'>Gen. 26:25</a>; <a href='/AIV/23/40/28'>Isaiah 40:28</a>",
      "comment": "Planting the tree is an act of worship and commemoration. Calling on 'the Everlasting God' emphasizes God’s unchanging nature—a theme that finds its ultimate expression in the final revelation of God."
    },
    {
      "pk": 2102134,
      "translation": "AIV",
      "book": 1,
      "chapter": 21,
      "verse": 34,
      "text": "And Abraham lived as a sojourner in the land of the Philistines for many days.",
      "links": "<a href='/AIV/1/26/1'>Gen. 26:1</a>",
      "comment": "The theme of sojourning reminds the reader that the faithful are often 'strangers and pilgrims,' ultimately seeking a better homeland—see <a href='/AIV/58/11/13'>Hebrews 11:13–16</a>."
    }
  ],
  "translatedAt": "2025-12-23T08:44:11.733Z"
}