{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 33,
  "verses": [
    {
      "pk": 1333001,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 1,
      "text": "Jacob looked up and saw Esau coming, and four hundred men with him. So he divided the children among Leah, Rachel, and the two female servants.",
      "links": "<a href='/AIV/1/32/6'>Gen. 32:6</a>; <a href='/AIV/1/31/17'>Gen. 31:17</a>",
      "comment": "Jacob prepares his family for meeting Esau, showing wisdom and caution after their long separation—an example of prudence in the face of possible conflict."
    },
    {
      "pk": 1333002,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 2,
      "text": "He put the female servants and their children in front, then Leah and her children, and Rachel and Joseph last.",
      "links": "<a href='/AIV/1/29/30'>Gen. 29:30</a>",
      "comment": "Jacob places Rachel and Joseph, his favored wife and son, last, indicating the special love he has for them. This foreshadows future events, especially Joseph’s role (Gen. 37:3)."
    },
    {
      "pk": 1333003,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 3,
      "text": "He himself went ahead of them, bowing down to the ground seven times as he approached his brother.",
      "links": "<a href='/AIV/1/18/2'>Gen. 18:2</a>; <a href='/AIV/1/32/20'>Gen. 32:20</a>",
      "comment": "Jacob bows seven times, displaying humility and seeking reconciliation. The number seven often implies completeness, and this act shows sincere repentance—connecting to Christ’s call for reconciliation (Matt. 5:24)."
    },
    {
      "pk": 1333004,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 4,
      "text": "But Esau ran to meet him, embraced him, threw his arms around his neck, and kissed him. And they both wept.",
      "links": "<a href='/AIV/1/45/14-15'>Gen. 45:14–15</a>; <a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "Esau’s unexpected embrace echoes later biblical scenes of reconciliation and mercy, especially the prodigal son’s return in Luke 15. This foreshadows God’s forgiveness and the joy of unity among brothers."
    },
    {
      "pk": 1333005,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 5,
      "text": "When Esau looked up and saw the women and children, he said, 'Who are these with you?' Jacob replied, 'The children whom God has graciously given your servant.'",
      "links": "<a href='/AIV/1/30/2'>Gen. 30:2</a>; <a href='/AIV/1/48/9'>Gen. 48:9</a>",
      "comment": "Jacob’s acknowledgment of God’s graciousness highlights God’s providence and blessing, affirming that family and children are gifts from God (Ps. 127:3)."
    },
    {
      "pk": 1333006,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 6,
      "text": "Then the female servants came near, they and their children, and bowed down.",
      "links": "<a href='/AIV/1/18/2'>Gen. 18:2</a>; <a href='/AIV/1/42/6'>Gen. 42:6</a>",
      "comment": "Each member of Jacob’s family demonstrates submission and respect, a sign of honor and humility—a virtue commended throughout Scripture."
    },
    {
      "pk": 1333007,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 7,
      "text": "Leah also came with her children, and they bowed down. After them, Joseph and Rachel came near, and they bowed down.",
      "links": "<a href='/AIV/1/37/7'>Gen. 37:7</a>",
      "comment": "This orderly procession culminates in Rachel and Joseph, foreshadowing Joseph’s later prominence and the prophetic dreams where his family bows to him (Gen. 37:9–10)."
    },
    {
      "pk": 1333008,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 8,
      "text": "Esau said, 'What do you mean by all these herds that I met?' Jacob answered, 'They are to find favor in the sight of my lord.'",
      "links": "<a href='/AIV/1/32/13-18'>Gen. 32:13–18</a>",
      "comment": "Jacob’s gifts reflect ancient customs of appeasement and honor, emphasizing humility and repentance. Offering gifts to mend a broken relationship points to spiritual acts of penance and reconciliation."
    },
    {
      "pk": 1333009,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 9,
      "text": "Esau said, 'I have enough, my brother; keep what you have for yourself.'",
      "links": "<a href='/AIV/1/27/39'>Gen. 27:39</a>",
      "comment": "Esau’s contentment and generosity counter Jacob’s fear, showing how forgiveness can restore familial bonds. True reconciliation often requires both humility and generosity."
    },
    {
      "pk": 1333010,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 10,
      "text": "But Jacob said, 'No, please, if I have found favor in your sight, accept my gift from my hand; for to see your face is like seeing the face of God, now that you have received me favorably.'",
      "links": "<a href='/AIV/1/32/30'>Gen. 32:30</a>; <a href='/AIV/6/22/31'>Judg. 13:22</a>",
      "comment": "Jacob equates reconciliation with a divine encounter. This points to the sacramental nature of forgiveness and the transformative presence of God in acts of mercy."
    },
    {
      "pk": 1333011,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 11,
      "text": "Please accept the blessing that has been brought to you, because God has dealt graciously with me, and because I have enough.' And he urged him, and Esau took it.",
      "links": "<a href='/AIV/1/27/36'>Gen. 27:36</a>; <a href='/AIV/1/43/23'>Gen. 43:23</a>",
      "comment": "Jacob insists that Esau take the gift, describing it as a 'blessing,' recalling the earlier episode of the stolen blessing (Gen. 27:35). This act can be seen as restitution—an outward demonstration of inner repentance (Luke 19:8)."
    },
    {
      "pk": 1333012,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 12,
      "text": "Then Esau said, 'Let us journey on our way, and I will go ahead of you.'",
      "links": "<a href='/AIV/1/45/9'>Gen. 45:9</a>",
      "comment": "Esau’s offer reflects restored kinship and leadership. Journeying together as one people evokes the unity and fraternal bond meant by God in His chosen families."
    },
    {
      "pk": 1333013,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 13,
      "text": "But Jacob said, 'My lord knows that the children are frail, and the flocks and herds which are nursing are a care to me. If they are driven hard for one day, all the flocks will die.'",
      "links": "<a href='/AIV/1/31/38'>Gen. 31:38</a>",
      "comment": "Jacob’s consideration for his family and flocks highlights his pastoral leadership, echoing the imagery of the shepherd caring for his flock—a theme fulfilled by Christ as the Good Shepherd (John 10:11)."
    },
    {
      "pk": 1333014,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 14,
      "text": "Please let my lord go on ahead of his servant, and I will lead on slowly, at the pace of the livestock that are before me and the children, until I come to my lord in Seir.'",
      "links": "<a href='/AIV/1/32/3'>Gen. 32:3</a>; <a href='/AIV/1/36/8'>Gen. 36:8</a>",
      "comment": "Jacob’s gentle leadership and patience reflect prudent stewardship. The anticipation of coming together again in Seir symbolizes hope for lasting peace."
    },
    {
      "pk": 1333015,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 15,
      "text": "So Esau said, 'Let me leave with you some of the people who are with me.' But Jacob said, 'Why this? Let me find favor in the sight of my lord.'",
      "links": "<a href='/AIV/1/47/25'>Gen. 47:25</a>",
      "comment": "Jacob’s diplomatic response avoids creating a sense of obligation or dependence. He wishes to retain autonomy—holding to wisdom and discernment in relationships."
    },
    {
      "pk": 1333016,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 16,
      "text": "So Esau returned that day on his way to Seir.",
      "links": "<a href='/AIV/1/32/3'>Gen. 32:3</a>; <a href='/AIV/1/36/8'>Gen. 36:8</a>",
      "comment": "Esau’s return to Seir marks a peaceful separation. Both brothers go their way in peace, foreshadowing the separation of nations but also reconciliation possible in God’s plan."
    },
    {
      "pk": 1333017,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 17,
      "text": "But Jacob journeyed to Succoth, and built himself a house, and made booths for his livestock. That is why the place is called Succoth.",
      "links": "<a href='/AIV/1/12/8'>Gen. 12:8</a>; <a href='/AIV/3/23/42-43'>Lev. 23:42–43</a>",
      "comment": "Jacob’s temporary shelters prefigure the later Feast of Booths, which commemorates God’s provision for His people (Lev. 23:42–43)."
    },
    {
      "pk": 1333018,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 18,
      "text": "Jacob came in peace to the city of Shechem, which is in the land of Canaan, when he came from Paddan-aram, and he pitched his tent before the city.",
      "links": "<a href='/AIV/1/12/6'>Gen. 12:6</a>; <a href='/AIV/6/24/32'>Josh. 24:32</a>",
      "comment": "Arriving at Shechem, Jacob fulfills God’s promise of safe return (Gen. 28:15). This emphasizes God’s faithfulness and Jacob’s entry into the Promised Land."
    },
    {
      "pk": 1333019,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 19,
      "text": "He bought the piece of land where he had pitched his tent from the sons of Hamor, Shechem’s father, for a hundred pieces of money.",
      "links": "<a href='/AIV/1/23/16'>Gen. 23:16</a>; <a href='/AIV/6/24/32'>Josh. 24:32</a>",
      "comment": "Jacob’s purchase of land establishes a legal claim in the Promised Land, similar to Abraham buying land for Sarah’s burial. This foreshadows the inheritance and sanctification of God’s people in a promised place."
    },
    {
      "pk": 1333020,
      "translation": "AIV",
      "book": 1,
      "chapter": 33,
      "verse": 20,
      "text": "There he set up an altar and called it El-Elohe-Israel.",
      "links": "<a href='/AIV/1/12/7-8'>Gen. 12:7–8</a>; <a href='/AIV/1/28/18-19'>Gen. 28:18–19</a>",
      "comment": "By setting up an altar, Jacob dedicates the land to God. The name he gives—meaning 'God, the God of Israel'—marks his faith and the transformation of his identity. Altars signify the importance of worship, sacrifice, and a sacred tradition passed down through generations."
    }
  ],
  "translatedAt": "2025-12-23T08:52:05.070Z"
}