{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 12,
  "verses": [
    {
      "pk": 2001201,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 1,
      "text": "Now the LORD said to Abram, “Go from your land, your relatives, and your father’s house to the land that I will show you.",
      "links": "<a href='/AIV/44/7/3'>Acts 7:3</a>; <a href='/AIV/58/11/8'>Heb. 11:8</a>",
      "comment": "God's direct call initiates a journey of faith. Note the radical obedience required, which prefigures later calls to leave all and follow Christ (Luke 18:22)."
    },
    {
      "pk": 2001202,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 2,
      "text": "And I will make you into a great nation, and I will bless you, and make your name great, so that you will be a blessing.",
      "links": "<a href='/AIV/01/17/6'>Gen. 17:6</a>; <a href='/AIV/01/22/17-18'>Gen. 22:17-18</a>",
      "comment": "God’s promise to bless Abram will have lasting consequences for the entire world (Galatians 3:8). The phrase “make your name great” echoes the reversal of Babel (Genesis 11:4)."
    },
    {
      "pk": 2001203,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 3,
      "text": "I will bless those who bless you, and whoever curses you I will curse. And in you, all the families of the earth will be blessed.",
      "links": "<a href='/AIV/01/18/18'>Gen. 18:18</a>; <a href='/AIV/48/3/14'>Gal. 3:14</a>",
      "comment": "This prophecy is understood by Christians as ultimately fulfilled in Jesus Christ, the true descendant of Abraham (Acts 3:25–26). It foreshadows the universality of God’s family."
    },
    {
      "pk": 2001204,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 4,
      "text": "So Abram went, as the LORD had spoken to him, and Lot went with him. Abram was seventy-five years old when he departed from Haran.",
      "links": "<a href='/AIV/01/11/31'>Gen. 11:31</a>; <a href='/AIV/01/16/3'>Gen. 16:3</a>",
      "comment": "Abram’s faithful response at an advanced age points to God’s power over human limitations. The path of obedience is rarely convenient."
    },
    {
      "pk": 2001205,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 5,
      "text": "And Abram took Sarai his wife, and Lot his brother’s son, and all their possessions that they had gathered, and the people they had acquired in Haran; and they set out to go to the land of Canaan. When they came to the land of Canaan,",
      "links": "<a href='/AIV/01/13/5'>Gen. 13:5</a>",
      "comment": "Abram leads his entire household in migration, showing how faith is not just individual but communal—emphasizing the familial dimension of faith."
    },
    {
      "pk": 2001206,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 6,
      "text": "Abram passed through the land as far as the site of Shechem, to the oak of Moreh. At that time, the Canaanites were in the land.",
      "links": "<a href='/AIV/01/35/4'>Gen. 35:4</a>; <a href='/AIV/05/11/30'>Deut. 11:30</a>",
      "comment": "Shechem becomes an important site in Israel’s history (Joshua 24:1). The mention of Canaanites emphasizes that God’s promise occurs in a context of opposition."
    },
    {
      "pk": 2001207,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 7,
      "text": "Then the LORD appeared to Abram and said, “To your offspring I will give this land.” So he built an altar there to the LORD who had appeared to him.",
      "links": "<a href='/AIV/01/13/15'>Gen. 13:15</a>; <a href='/AIV/01/17/8'>Gen. 17:8</a>",
      "comment": "God’s physical appearing highlights the reality of divine revelation. The building of an altar marks the sanctification of space and the importance of worship after divine encounter—prefiguring the chosen places of worship in the future."
    },
    {
      "pk": 2001208,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 8,
      "text": "From there, he moved on to the hill country east of Bethel and pitched his tent, with Bethel on the west and Ai on the east. There he built an altar to the LORD and called on the name of the LORD.",
      "links": "<a href='/AIV/01/13/3-4'>Gen. 13:3-4</a>",
      "comment": "Abram’s pattern of altar-building and calling on God shows the establishment of true worship, setting up for the later significance of Bethel. It begins a lineage of sacred tradition."
    },
    {
      "pk": 2001209,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 9,
      "text": "Then Abram journeyed on, continuing toward the Negev.",
      "links": "<a href='/AIV/01/13/1'>Gen. 13:1</a>",
      "comment": "Abram’s pilgrimage echoes the journey motif throughout Scripture. The movement toward the south symbolizes both faith and dependence on God’s guidance."
    },
    {
      "pk": 2001210,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 10,
      "text": "Now there was a famine in the land, so Abram went down to Egypt to dwell there temporarily, for the famine was severe in the land.",
      "links": "<a href='/AIV/01/26/1'>Gen. 26:1</a>; <a href='/AIV/02/1/1'>Exod. 1:1</a>",
      "comment": "Egypt as a place of refuge foreshadows the pattern for the nation of Israel, and later, the Holy Family’s flight into Egypt (Matthew 2:13-15)."
    },
    {
      "pk": 2001211,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 11,
      "text": "When he was about to enter Egypt, he said to Sarai his wife, “Look, I know that you are a beautiful woman to look upon.",
      "links": "<a href='/AIV/01/20/2'>Gen. 20:2</a>",
      "comment": "Abram’s statement sets up the coming trial and test of trust in God’s protection. The mention of Sarah’s beauty later becomes significant in the lineage of Israel."
    },
    {
      "pk": 2001212,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 12,
      "text": "When the Egyptians see you, they will say, ‘This is his wife.’ Then they will kill me, but they will let you live.",
      "links": "",
      "comment": "Abram’s fear shows human frailty, even in the life of a patriarch. Despite divine promises, human weakness is evident—a recurring theme, even among those chosen by God."
    },
    {
      "pk": 2001213,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 13,
      "text": "Please say you are my sister, so that it may go well with me because of you, and that my life may be spared for your sake.”",
      "links": "<a href='/AIV/01/20/13'>Gen. 20:13</a>",
      "comment": "The episode reveals ethical complexity among the chosen. God’s faithfulness surpasses the moral failings of his servants—contrasted in Christ’s perfect obedience."
    },
    {
      "pk": 2001214,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 14,
      "text": "So when Abram came into Egypt, the Egyptians saw that the woman was very beautiful.",
      "links": "",
      "comment": "Sarai’s beauty and the resulting events highlight divine providence at work, even through human imperfection."
    },
    {
      "pk": 2001215,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 15,
      "text": "When Pharaoh’s officials saw her, they praised her to Pharaoh, and the woman was taken into Pharaoh’s house.",
      "links": "",
      "comment": "Pharaoh’s court symbolizes earthly power, while Sarai’s favor foreshadows the elevation of God’s people through trials."
    },
    {
      "pk": 2001216,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 16,
      "text": "And he treated Abram well for her sake. Abram received sheep, cattle, male donkeys, male and female servants, female donkeys, and camels.",
      "links": "<a href='/AIV/01/20/14'>Gen. 20:14</a>",
      "comment": "The transfer of wealth to Abram hints at God’s providence working through even troubling circumstances, a theme found again in Israel’s later sojourn in Egypt."
    },
    {
      "pk": 2001217,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 17,
      "text": "But the LORD afflicted Pharaoh and his household with great plagues because of Sarai, Abram’s wife.",
      "links": "<a href='/AIV/02/7/14'>Exod. 7:14</a>; <a href='/AIV/01/20/18'>Gen. 20:18</a>",
      "comment": "Early occurrence of plagues on Egypt previews later deliverance narratives (Exodus 7–12), showing a divine defense of the promised offspring."
    },
    {
      "pk": 2001218,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 18,
      "text": "Then Pharaoh called Abram and said, “What is this you have done to me? Why did you not tell me she was your wife?",
      "links": "",
      "comment": "Pharaoh’s rebuke shows the moral witness of outsiders. God’s chosen people sometimes falter, but God’s purposes prevail."
    },
    {
      "pk": 2001219,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 19,
      "text": "Why did you say, ‘She is my sister,’ so that I took her to be my wife? Now then, here is your wife; take her and go.”",
      "links": "",
      "comment": "Abram’s deception is exposed, but God restores through mercy. Restoration even after sin is a recurring biblical theme (Luke 15:22)."
    },
    {
      "pk": 2001220,
      "translation": "AIV",
      "book": 1,
      "chapter": 12,
      "verse": 20,
      "text": "So Pharaoh gave orders about him to his men, and they sent him away, and his wife, and all that he had.",
      "links": "<a href='/AIV/02/12/33-36'>Exod. 12:33-36</a>",
      "comment": "Abram leaves Egypt with increased blessing, paralleling the later Exodus. God’s people are protected and provided for, even through foreign powers. This builds understanding for the way God works through human history, shepherding his people through trials and deliverance."
    }
  ],
  "translatedAt": "2025-12-23T08:40:01.466Z"
}