{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 34,
  "verses": [
    {
      "pk": 1034001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 1,
      "text": "Now Dinah, the daughter Leah had borne to Jacob, went out to see the women of the land.",
      "links": "<a href='/AIV/1/30/21'>Gen. 30:21</a>",
      "comment": "Dinah was the daughter of Jacob and Leah, indicating her special status in the family. Her initiative to see the women shows social interaction across tribal lines."
    },
    {
      "pk": 1034002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 2,
      "text": "When Shechem, the son of Hamor the Hivite, the ruler of that land, saw her, he took her and lay with her and humiliated her.",
      "links": "<a href='/AIV/1/49/5-7'>Gen. 49:5-7</a>",
      "comment": "Shechem’s actions brought great dishonor and foreshadow conflict. The term 'humiliated' highlights the gravity of Dinah's violation."
    },
    {
      "pk": 1034003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 3,
      "text": "But his soul was strongly drawn to Dinah the daughter of Jacob, and he loved the young woman and spoke tenderly to her.",
      "links": "<a href='/AIV/2/2/13-14'>Ex. 2:13-14</a>",
      "comment": "Shechem's affection does not undo his wrongdoing, but it does set up a complex interplay between sin, contrition, and reconciliation, themes found throughout Scripture."
    },
    {
      "pk": 1034004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 4,
      "text": "So Shechem spoke to his father Hamor, saying, 'Get me this girl as my wife.'",
      "links": "<a href='/AIV/1/24/4'>Gen. 24:4</a>",
      "comment": "Ancient marriages required parental negotiation, reminding us of the importance of family order. Compare this with Abraham’s selection of a wife for Isaac."
    },
    {
      "pk": 1034005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 5,
      "text": "Now Jacob heard that his daughter Dinah had been defiled. But his sons were with his livestock in the field; so Jacob kept silent until they came in.",
      "links": "<a href='/AIV/1/37/12-14'>Gen. 37:12-14</a>",
      "comment": "Jacob’s silence hints at restraint and wisdom, showing he awaited his sons’ counsel. Such patience recalls later sage leadership in Israel."
    },
    {
      "pk": 1034006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 6,
      "text": "Then Hamor, the father of Shechem, went out to Jacob to speak with him.",
      "links": "<a href='/AIV/1/23/3-6'>Gen. 23:3-6</a>",
      "comment": "Initiating negotiations for marriage, Hamor seeks reconciliation, a repeated motif in Genesis where fractured relationships are addressed through familial talks."
    },
    {
      "pk": 1034007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 7,
      "text": "The sons of Jacob came in from the field as soon as they heard it, and the men were grieved and very angry, because he had done an outrageous thing in Israel by lying with Jacob’s daughter—for such a thing must not be done.",
      "links": "<a href='/AIV/3/18/29'>Lev. 18:29</a>; <a href='/AIV/2/22/16'>Ex. 22:16</a>",
      "comment": "The sons' reaction underscores sexual purity and honor in God’s people, a theme further developed in Levitical law."
    },
    {
      "pk": 1034008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 8,
      "text": "But Hamor spoke with them, saying, 'The soul of my son Shechem longs for your daughter. Please give her to him as his wife.'",
      "links": "<a href='/AIV/1/24/4'>Gen. 24:4</a>",
      "comment": "Hamor’s request seeks to join the two families, but overlooks the gravity of Shechem’s offense—pointing to the tension between cultural custom and divine commands."
    },
    {
      "pk": 1034009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 9,
      "text": "'Intermarry with us; give us your daughters and take our daughters for yourselves.'",
      "links": "<a href='/AIV/1/24/3'>Gen. 24:3</a>; <a href='/AIV/5/7/3'>Deut. 7:3</a>",
      "comment": "This proposal of intermarriage is forbidden in later Jewish law, emphasizing God’s desire for the people to remain set apart."
    },
    {
      "pk": 1034010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 10,
      "text": "'You shall dwell with us, and the land shall be open to you. Live in it, trade in it, and acquire property in it.'",
      "links": "<a href='/AIV/1/23/9'>Gen. 23:9</a>",
      "comment": "While appealing materially, the offer would mean the chosen people would blend with local nations, risking religious compromise."
    },
    {
      "pk": 1034011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 11,
      "text": "Shechem also said to Dinah’s father and her brothers, 'Let me find favor in your eyes, and whatever you say to me I will give.'",
      "links": "<a href='/AIV/1/24/53'>Gen. 24:53</a>",
      "comment": "Shechem’s offer, while lavish, shows human efforts to make up for sin, yet full reconciliation requires more than material gifts."
    },
    {
      "pk": 1034012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 12,
      "text": "'Set as great a bride price and gift as you will, and I will give whatever you say to me. Only give me the girl to be my wife.'",
      "links": "<a href='/AIV/2/22/17'>Ex. 22:17</a>",
      "comment": "A high bride price cannot buy justice or restore true peace—a reminder of the limits of human reparations when grave wrong is done."
    },
    {
      "pk": 1034013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 13,
      "text": "The sons of Jacob answered Shechem and his father Hamor deceitfully, because he had defiled their sister Dinah.",
      "links": "<a href='/AIV/1/27/35-36'>Gen. 27:35-36</a>",
      "comment": "Deception here echoes previous family patterns (see Jacob and Esau), highlighting sins that carry from generation to generation."
    },
    {
      "pk": 1034014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 14,
      "text": "They said to them, 'We cannot do this thing, to give our sister to one who is uncircumcised, for that would be a disgrace to us.'",
      "links": "<a href='/AIV/1/17/10-14'>Gen. 17:10-14</a>",
      "comment": "Circumcision marks belonging to God’s covenant. This requirement distinguishes the people of God, prefiguring the later necessity of spiritual marks of belonging."
    },
    {
      "pk": 1034015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 15,
      "text": "'Only on this condition will we agree with you—that you become like us by every male among you being circumcised.'",
      "links": "<a href='/AIV/1/17/10-13'>Gen. 17:10-13</a>",
      "comment": "Circumcision symbolizes both external and internal transformation (cf. Deuteronomy 10:16), hinting at deeper matters of the heart."
    },
    {
      "pk": 1034016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 16,
      "text": "'Then we will give our daughters to you, and we will take your daughters to ourselves, and we will live with you and become one people.'",
      "links": "<a href='/AIV/5/7/3'>Deut. 7:3</a>",
      "comment": "The unity offered here comes at the cost of religious and cultural distinctiveness, prefiguring the challenge of maintaining faithfulness amid assimilation."
    },
    {
      "pk": 1034017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 17,
      "text": "'But if you will not listen to us, and be circumcised, then we will take our daughter and go.'",
      "links": "<a href='/AIV/1/21/14'>Gen. 21:14</a>",
      "comment": "Emphasizes the seriousness of their demand. Separation is preferable to spiritual compromise."
    },
    {
      "pk": 1034018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 18,
      "text": "Their words pleased Hamor and Hamor’s son Shechem.",
      "links": "",
      "comment": "The agreement pleases the Canaanites, showing their willingness to go to great lengths for union, though not out of faith but for personal desire."
    },
    {
      "pk": 1034019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 19,
      "text": "And the young man did not delay to do the thing, because he delighted in Jacob’s daughter. Now he was the most honored of all his father’s household.",
      "links": "",
      "comment": "Shechem’s immediate compliance shows dedication, but the context is still marred by the initial sin. Human attempts at restitution cannot fully heal such wounds."
    },
    {
      "pk": 1034020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 20,
      "text": "So Hamor and his son Shechem came to the gate of their city and spoke to the men of their city, saying,",
      "links": "<a href='/AIV/1/23/10'>Gen. 23:10</a>",
      "comment": "City gates were where important decisions and transactions occurred—a foreshadowing of the later structures of leadership among the people of God."
    },
    {
      "pk": 1034021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 21,
      "text": "'These men are at peace with us. Let them live in the land and trade in it, for behold, the land is large enough for them. Let us take their daughters as wives, and let us give them our daughters.'",
      "links": "",
      "comment": "The language of 'peace' masks an underlying assimilation that would undermine the chosen people’s distinct mission."
    },
    {
      "pk": 1034022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 22,
      "text": "'Only on this condition will the men agree to live with us, to become one people: every male among us must be circumcised as they are circumcised.'",
      "links": "",
      "comment": "Circumcision is treated here as mere external compliance, rather than true conversion—pointing to the importance of inner transformation seen in later revelation."
    },
    {
      "pk": 1034023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 23,
      "text": "'Will not their livestock, their property and all their animals be ours? Only let us agree with them, and they will dwell with us.'",
      "links": "",
      "comment": "Motivation here is greed rather than righteousness, a reminder that seeking union with the people of God must be for the sake of truth, not material gain."
    },
    {
      "pk": 1034024,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 24,
      "text": "All who went out of the gate of his city listened to Hamor and his son Shechem, and every male was circumcised, all who went out of the gate of his city.",
      "links": "",
      "comment": "The compliance of the city signifies the influence of leadership—but, as the next verses show, leadership not aligned with God’s will can lead people astray."
    },
    {
      "pk": 1034025,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 25,
      "text": "On the third day, when they were sore, two of Jacob’s sons, Simeon and Levi, Dinah’s brothers, took their swords, came upon the city unawares, and killed all the males.",
      "links": "<a href='/AIV/1/49/5-7'>Gen. 49:5-7</a>",
      "comment": "The violence of Simeon and Levi foreshadows their later reputations. Their actions warn against taking justice entirely into one’s own hands."
    },
    {
      "pk": 1034026,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 26,
      "text": "They killed Hamor and his son Shechem with the sword, took Dinah out of Shechem’s house, and left.",
      "links": "<a href='/AIV/1/49/5-7'>Gen. 49:5-7</a>",
      "comment": "Dinah’s rescue was achieved through great violence. The rescuers’ judgment is later referenced when blessings and curses are pronounced on Jacob’s sons."
    },
    {
      "pk": 1034027,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 27,
      "text": "The sons of Jacob came upon the dead and plundered the city, because their sister had been defiled.",
      "links": "<a href='/AIV/1/49/5-7'>Gen. 49:5-7</a>",
      "comment": "Their plundering, although perhaps understandable emotionally, further damages their moral standing, highlighting the destructive consequences of unchecked anger."
    },
    {
      "pk": 1034028,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 28,
      "text": "They took their flocks, their herds, their donkeys, and whatever was in the city and in the field.",
      "links": "",
      "comment": "The note of total conquest points to the severity of the punishment—yet it shows a blurring between justice and vengeance not endorsed by later divine law."
    },
    {
      "pk": 1034029,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 29,
      "text": "They took all their wealth, all their little ones and their wives, even all that was in the houses, and captured them as plunder.",
      "links": "",
      "comment": "Capturing women and children echoes the dark consequences of cycles of violence begun by sin. Divine justice in Scripture brings healing, not endless retaliation."
    },
    {
      "pk": 1034030,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 30,
      "text": "Then Jacob said to Simeon and Levi, 'You have brought trouble on me by making me a stench to the inhabitants of the land, the Canaanites and the Perizzites. My numbers are few, and if they gather together against me and attack me, I and my household will be destroyed.'",
      "links": "<a href='/AIV/1/13/7-8'>Gen. 13:7-8</a>",
      "comment": "Jacob’s rebuke expresses fear not only for safety, but for the reputation and mission entrusted to his family."
    },
    {
      "pk": 1034031,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 34,
      "verse": 31,
      "text": "But they said, 'Should he treat our sister like a prostitute?'",
      "links": "",
      "comment": "The closing question highlights the moral dilemma: the longing for justice, unchecked, can lead to further sin. True justice, as later revealed in Christ, brings not vengeance but the restoration of dignity and unity."
    }
  ],
  "translatedAt": "2025-12-24T00:30:07.243Z"
}