{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 30,
  "verses": [
    {
      "pk": 1030001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 1,
      "text": "When Rachel saw that she wasn't bearing children for Jacob, she became jealous of her sister and said to Jacob, \"Give me children, or I will die!\"",
      "links": "<a href='/AIV/09/01/05-11'>1 Samuel 1:5-11</a>; <a href='/AIV/01/16/1'>Gen. 16:1</a>",
      "comment": "Rachel's desperation echoes other women in Scripture who struggled with barrenness and pleaded with God, such as Hannah. The motif points toward God's sovereignty over life and birth."
    },
    {
      "pk": 1030002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 2,
      "text": "Jacob became angry with Rachel and said, \"Am I in God's place, who has withheld children from you?\"",
      "links": "<a href='/AIV/01/25/21'>Gen. 25:21</a>",
      "comment": "Jacob acknowledges that only God can grant life, which reflects the biblical view of God's authority over fertility. Compare with Isaac's prayer for Rebekah (Genesis 25:21)."
    },
    {
      "pk": 1030003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 3,
      "text": "Then she said, \"Here is my servant Bilhah. Go in to her, that she may bear me children on my behalf, so that I too may have a family through her.\"",
      "links": "<a href='/AIV/01/16/2'>Gen. 16:2</a>",
      "comment": "Rachel imitates Sarah's earlier act (Genesis 16:2) by giving her servant to Jacob. This reflects ancient customs about surrogate motherhood, but also symbolically points to mediation, later echoed spiritually in biblical redemption."
    },
    {
      "pk": 1030004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 4,
      "text": "So she gave him Bilhah her servant as a wife, and Jacob went in to her.",
      "links": "<a href='/AIV/01/16/4'>Gen. 16:4</a>",
      "comment": "Bilhah becomes a wife for the purpose of childbearing. The importance of lineage and promise in Israel starts to take shape here."
    },
    {
      "pk": 1030005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 5,
      "text": "And Bilhah became pregnant and bore Jacob a son.",
      "links": "<a href='/AIV/01/29/31'>Gen. 29:31</a>",
      "comment": "God allows Bilhah to conceive, indicating His continued sovereignty in opening the womb according to His plan."
    },
    {
      "pk": 1030006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 6,
      "text": "Rachel said, \"God has judged in my favor and has heard my voice, giving me a son.\" So she named him Dan.",
      "links": "<a href='/AIV/01/16/11'>Gen. 16:11</a>; <a href='/AIV/07/18/30'>Judges 18:30</a>",
      "comment": "The name Dan means \"judged.\" Rachel credits God with seeing her struggle and responding. The theme of divine intervention in family inheritance recurs."
    },
    {
      "pk": 1030007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 7,
      "text": "Rachel's servant Bilhah became pregnant again and bore Jacob a second son.",
      "links": "<a href='/AIV/01/35/25'>Gen. 35:25</a>",
      "comment": "The growth of the tribes through the servants underlines God's providence in building Israel not just through direct lineage but by including others, foreshadowing the inclusivity of the people of God."
    },
    {
      "pk": 1030008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 8,
      "text": "Rachel said, \"With great wrestlings I have wrestled with my sister, and I have prevailed.\" So she named him Naphtali.",
      "links": "<a href='/AIV/01/49/21'>Gen. 49:21</a>",
      "comment": "The competitive spirit between sisters highlights human rivalry but also God's mercy in blessing both. Naphtali means 'my wrestling,' symbolic of spiritual struggle reflected in later scripture (see Genesis 49:21)."
    },
    {
      "pk": 1030009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 9,
      "text": "When Leah saw that she had stopped bearing children, she took her servant Zilpah and gave her to Jacob as a wife.",
      "links": "<a href='/AIV/01/16/3'>Gen. 16:3</a>",
      "comment": "Leah seeks to extend her legacy, reminiscent of Rachel's earlier move. The servants' roles stress the importance attached to perpetuating the family and covenant."
    },
    {
      "pk": 1030010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 10,
      "text": "Leah's servant Zilpah bore Jacob a son.",
      "links": "<a href='/AIV/01/35/26'>Gen. 35:26</a>",
      "comment": "Zilpah, like Bilhah, is involved in the fulfillment of God's promise, highlighting how God works even through less expected means."
    },
    {
      "pk": 1030011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 11,
      "text": "Leah said, \"How fortunate!\" So she named him Gad.",
      "links": "<a href='/AIV/01/49/19'>Gen. 49:19</a>",
      "comment": "Gad's name means 'fortune' or 'luck.' Names in Genesis often indicate the perceived blessing or circumstance at birth, drawing attention to God's benevolence."
    },
    {
      "pk": 1030012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 12,
      "text": "Leah's servant Zilpah bore Jacob a second son.",
      "links": "<a href='/AIV/01/35/26'>Gen. 35:26</a>",
      "comment": "The continual bearing of sons grows the future nation, demonstrating the working out of God's promises beyond the initial covenant bearers."
    },
    {
      "pk": 1030013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 13,
      "text": "Leah said, \"How happy I am! For women will call me blessed.\" So she named him Asher.",
      "links": "<a href='/AIV/01/49/20'>Gen. 49:20</a>; <a href='/AIV/42/01/48'>Luke 1:48</a>",
      "comment": "Asher means 'happy.' Leah's declaration connects with the theme of blessedness, echoed in later Scripture when Mary is called blessed among women (Luke 1:48)."
    },
    {
      "pk": 1030014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 14,
      "text": "During the days of wheat harvest, Reuben went out and found mandrakes in the field, bringing them to his mother Leah. Rachel said to Leah, \"Please give me some of your son's mandrakes.\"",
      "links": "<a href='/AIV/22/07/13'>Song of Songs 7:13</a>",
      "comment": "Mandrakes were believed to promote fertility. The story demonstrates the persistent hope and human strategies in seeking God's blessing."
    },
    {
      "pk": 1030015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 15,
      "text": "But Leah replied, \"Is it not enough that you have taken my husband? Would you also take my son's mandrakes?\" Rachel said, \"Then let Jacob sleep with you tonight in exchange for your son's mandrakes.\"",
      "links": "<a href='/AIV/01/29/32'>Gen. 29:32</a>",
      "comment": "The sisters' bargaining continues, emphasizing the ongoing contest for favor and blessing, which human effort cannot fully control."
    },
    {
      "pk": 1030016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 16,
      "text": "When Jacob returned from the field that evening, Leah went out to meet him and said, \"You must sleep with me tonight; I've paid for you with my son's mandrakes.\" So he slept with her that night.",
      "links": "<a href='/AIV/01/30/14'>Gen. 30:14</a>",
      "comment": "The mandrake exchange highlights the belief that God's blessing could be influenced, but the passage demonstrates that true fruitfulness comes from divine will."
    },
    {
      "pk": 1030017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 17,
      "text": "And God listened to Leah, and she conceived and bore Jacob a fifth son.",
      "links": "<a href='/AIV/01/29/32'>Gen. 29:32</a>",
      "comment": "God's response to Leah's plea shows that prayer and humility before God are more effective than human schemes. God's personal attention to Leah points to His care for the marginalized."
    },
    {
      "pk": 1030018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 18,
      "text": "Leah said, \"God has given me my reward because I gave my servant to my husband.\" So she named him Issachar.",
      "links": "<a href='/AIV/01/49/14'>Gen. 49:14</a>",
      "comment": "Issachar means 'reward.' Leah interprets her fruitfulness as divine remuneration, another evidence of God's faithfulness to those who participate in His covenant family."
    },
    {
      "pk": 1030019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 19,
      "text": "Leah conceived again and bore Jacob a sixth son.",
      "links": "<a href='/AIV/01/35/23'>Gen. 35:23</a>",
      "comment": "Leah's prophetic role in bearing sons for Jacob points to the way God raises up leaders for His people through ordinary means."
    },
    {
      "pk": 1030020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 20,
      "text": "Leah said, \"God has gifted me with a good gift. Now my husband will honor me, because I have borne him six sons.\" So she named him Zebulun.",
      "links": "<a href='/AIV/01/49/13'>Gen. 49:13</a>",
      "comment": "Zebulun means 'honor' or 'dwelling.' Leah desired recognition and respect, reminding us of humanity's longing for dignity, ultimately fulfilled in Christ (Philippians 2:9)."
    },
    {
      "pk": 1030021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 21,
      "text": "Afterward, she bore a daughter and named her Dinah.",
      "links": "<a href='/AIV/01/34/1'>Gen. 34:1</a>",
      "comment": "Dinah is the only daughter specifically mentioned among Jacob's children, who will have a significant role in later chapters."
    },
    {
      "pk": 1030022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 22,
      "text": "Then God remembered Rachel. He listened to her and opened her womb.",
      "links": "<a href='/AIV/01/21/1'>Gen. 21:1</a>; <a href='/AIV/42/01/24-25'>Luke 1:24-25</a>",
      "comment": "God's remembering and answering Rachel parallels how He blessed Sarah and later Elizabeth, foreshadowing the miraculous births leading toward Christ."
    },
    {
      "pk": 1030023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 23,
      "text": "She became pregnant and bore a son, saying, \"God has taken away my shame.\"",
      "links": "<a href='/AIV/23/54/4'>Isaiah 54:4</a>",
      "comment": "Rachel's relief from disgrace points to God's power to redeem dishonor, as is more fully revealed in Christ's redemptive work (Isaiah 54:4)."
    },
    {
      "pk": 1030024,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 24,
      "text": "She named him Joseph, saying, \"May the LORD add to me another son.\"",
      "links": "<a href='/AIV/01/35/16-18'>Gen. 35:16-18</a>",
      "comment": "Joseph means 'he adds.' Rachel's prayer reflects faith in God’s future blessings, anticipating Joseph's future salvific role for his family, which points to a greater salvation through a later Deliverer."
    },
    {
      "pk": 1030025,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 25,
      "text": "After Rachel had given birth to Joseph, Jacob said to Laban, \"Send me away, so that I may go home to my own country.\"",
      "links": "<a href='/AIV/01/31/3'>Gen. 31:3</a>",
      "comment": "Jacob's desire to return to Canaan marks the unfolding of God's promise and the importance of the promised land in redemption history."
    },
    {
      "pk": 1030026,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 26,
      "text": "\"Give me my wives and my children for whom I have served you, and let me go. For you know the service that I have done for you.\"",
      "links": "<a href='/AIV/01/29/27'>Gen. 29:27</a>",
      "comment": "Jacob appeals for justice, laying claim to what is rightfully his. The concern for family and inheritance is central to biblical faith."
    },
    {
      "pk": 1030027,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 27,
      "text": "But Laban said to him, \"If I have found favor in your eyes, please stay; for I have learned by divination that the LORD has blessed me because of you.\"",
      "links": "<a href='/AIV/01/12/3'>Gen. 12:3</a>; <a href='/AIV/01/26/24'>Gen. 26:24</a>",
      "comment": "Laban acknowledges God’s blessing on him through Jacob, fulfilling the promise that all nations would be blessed through Abraham’s family (Genesis 12:3)."
    },
    {
      "pk": 1030028,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 28,
      "text": "He said, \"Name your wages, and I will pay.\"",
      "links": "<a href='/AIV/01/29/15'>Gen. 29:15</a>",
      "comment": "Laban’s negotiation recalls their earlier arrangements and the principle of fairness and reward for faithful service."
    },
    {
      "pk": 1030029,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 29,
      "text": "Jacob replied, \"You know how I have served you, and how your livestock have prospered with me.\"",
      "links": "<a href='/AIV/01/31/38-41'>Gen. 31:38-41</a>",
      "comment": "Jacob’s stewardship brings abundance to Laban, a principle of blessing through honest labor reflected throughout Scripture (see Proverbs 10:4)."
    },
    {
      "pk": 1030030,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 30,
      "text": "\"For before I came, you had little, and it has increased greatly, and the LORD has blessed you wherever I turned. But when shall I provide for my own household also?\"",
      "links": "<a href='/AIV/01/12/2'>Gen. 12:2</a>",
      "comment": "Jacob now seeks to care for his own family, showing the importance of self-sacrifice and responsibility, compelling themes in both covenant and later Church teaching."
    },
    {
      "pk": 1030031,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 31,
      "text": "So Laban asked, \"What shall I give you?\" Jacob answered, \"You shall not give me anything. If you will do this for me, I will again feed and keep your flock.\"",
      "links": "<a href='/AIV/01/29/15'>Gen. 29:15</a>",
      "comment": "Jacob seeks a just arrangement without handouts, upholding the dignity of work and merit."
    },
    {
      "pk": 1030032,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 32,
      "text": "\"Let me go through all your flock today, removing from it every speckled and spotted sheep, every dark-colored lamb, and the spotted and speckled goats. They shall be my wages.\"",
      "links": "<a href='/AIV/01/31/8'>Gen. 31:8</a>",
      "comment": "The unique arrangement is meant to be honest and transparent, showing wisdom in administration. God's providence over this process is later revealed."
    },
    {
      "pk": 1030033,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 33,
      "text": "\"So my honesty will answer for me later, when you check what is my wages. Any goat that is not speckled or spotted among the goats, or dark-colored among the lambs, will be counted stolen if it is with me.\"",
      "links": "<a href='/AIV/01/31/37'>Gen. 31:37</a>",
      "comment": "Jacob's integrity sets a standard for future dealings and invites trust, a principle held as a virtue in the family of faith."
    },
    {
      "pk": 1030034,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 34,
      "text": "Laban replied, \"Agreed! Let it be as you have said.\"",
      "links": "<a href='/AIV/01/31/44'>Gen. 31:44</a>",
      "comment": "The agreement highlights the seriousness and binding nature of covenants, important throughout Scripture and Christian practice."
    },
    {
      "pk": 1030035,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 35,
      "text": "But that same day, Laban removed the male goats that were streaked and spotted, and all the female goats that were speckled and spotted, every one with white on it, and all the dark-colored lambs, and gave them into the care of his sons.",
      "links": "<a href='/AIV/01/31/1'>Gen. 31:1</a>",
      "comment": "Laban attempts to cheat Jacob, illustrating human deception but ultimately providing a stage for God's demonstration of favor and justice."
    },
    {
      "pk": 1030036,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 36,
      "text": "He put a three-day journey between himself and Jacob, and Jacob continued to tend the rest of Laban's flocks.",
      "links": "<a href='/AIV/01/31/22'>Gen. 31:22</a>",
      "comment": "Laban's distancing is an attempt to prevent Jacob from prospering, yet the coming verses show God is not hindered by human manipulation."
    },
    {
      "pk": 1030037,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 37,
      "text": "Jacob took fresh branches from poplar, almond, and plane trees, peeled white strips in them, exposing the inner white of the branches.",
      "links": "<a href='/AIV/01/31/9-12'>Gen. 31:9-12</a>",
      "comment": "Jacob's method is a blend of popular beliefs and diligence, but the following passage reveals God's intervention is the true source of success."
    },
    {
      "pk": 1030038,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 38,
      "text": "He set the peeled branches in front of the flocks at the troughs, where the flocks came to drink. When the flocks joined together by the branches, they bore streaked, speckled, and spotted young.",
      "links": "<a href='/AIV/01/31/12'>Gen. 31:12</a>",
      "comment": "Jacob's actions work, but are ultimately attributed to God's will, foreshadowing God's choice of the weak and unexpected to fulfill His purposes (see 1 Corinthians 1:27)."
    },
    {
      "pk": 1030039,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 39,
      "text": "So the flocks mated before the branches, and bore streaked, speckled, and spotted offspring.",
      "links": "<a href='/AIV/01/31/12'>Gen. 31:12</a>",
      "comment": "God's blessing is manifested in the outcome, surpassing mere human technique, indicating there's a spiritual principle at work: grace elevates nature."
    },
    {
      "pk": 1030040,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 40,
      "text": "Jacob separated the lambs and made the flocks face toward the streaked and dark-colored animals among Laban's flocks. Then he set aside his own herds, not mixing them with Laban's.",
      "links": "<a href='/AIV/01/31/8'>Gen. 31:8</a>",
      "comment": "Jacob's wisdom in animal husbandry leads to prosperity, but it is God who brings true increase, a lesson about trusting Providence while working diligently."
    },
    {
      "pk": 1030041,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 41,
      "text": "Whenever the stronger animals were mating, Jacob laid the branches in the troughs in front of the animals, so they would mate by the branches.",
      "links": "<a href='/AIV/01/31/12'>Gen. 31:12</a>",
      "comment": "Jacob's strategic timing enhances the flocks’ health and wealth, a demonstration that human efforts, when guided by God, bear great fruit."
    },
    {
      "pk": 1030042,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 42,
      "text": "But when the weaker animals were mating, he did not lay the branches there; so the weaker animals went to Laban, and the stronger ones went to Jacob.",
      "links": "<a href='/AIV/01/31/42'>Gen. 31:42</a>",
      "comment": "Jacob ensures that the best of the flocks are his, demonstrating wisdom. Ultimately, God’s justice prevails over human dishonesty, foreshadowing the vindication of the righteous."
    },
    {
      "pk": 1030043,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 30,
      "verse": 43,
      "text": "Thus the man grew exceedingly prosperous and had large flocks, servants, male and female, and camels and donkeys.",
      "links": "<a href='/AIV/01/12/2'>Gen. 12:2</a>; <a href='/AIV/01/13/2'>Gen. 13:2</a>",
      "comment": "God’s promise to bless Jacob is confirmed, as he becomes exceedingly wealthy, just as Abraham was blessed before him. The abundance Jacob experiences points toward the future fullness of blessings for God’s people in unity and inheritance."
    }
  ],
  "translatedAt": "2025-12-24T00:27:28.796Z"
}