{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 31,
  "verses": [
    {
      "pk": 1031001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 1,
      "text": "Jacob heard the words of Laban’s sons, saying, “Jacob has taken away all that was our father’s; and from what belonged to our father, he has gotten all this wealth.”",
      "links": "<a href='/AIV/1/30/43'>Gen 30:43</a>; <a href='/AIV/1/31/16'>Gen 31:16</a>",
      "comment": "Laban's sons accuse Jacob of gaining wealth at Laban's expense, setting the stage for tension and Jacob's departure."
    },
    {
      "pk": 1031002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 2,
      "text": "And Jacob saw that Laban’s face was not toward him as it was before.",
      "links": "<a href='/AIV/1/30/27'>Gen 30:27</a>; <a href='/AIV/1/31/5'>Gen 31:5</a>",
      "comment": "Laban’s attitude has changed, confirming the need for Jacob's planned departure. When God calls someone, often circumstances confirm His leading."
    },
    {
      "pk": 1031003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 3,
      "text": "Then Yahweh said to Jacob, “Return to the land of your fathers and to your family, and I will be with you.”",
      "links": "<a href='/AIV/1/28/15'>Gen 28:15</a>; <a href='/AIV/1/12/1'>Gen 12:1</a>; <a href='/AIV/1/32/9'>Gen 32:9</a>",
      "comment": "God’s promise of His presence echoes His earlier covenant. God’s faithfulness calls for trust even when facing uncertainty. See also how God guides and goes with His chosen people."
    },
    {
      "pk": 1031004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 4,
      "text": "So Jacob sent and called Rachel and Leah to the field to his flock,",
      "links": "<a href='/AIV/1/29/9'>Gen 29:9</a>",
      "comment": "Jacob meets privately with his wives, indicating the seriousness and secrecy needed for his decision."
    },
    {
      "pk": 1031005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 5,
      "text": "and said to them, 'I see that your father’s attitude is not toward me as before, but the God of my father has been with me.'",
      "links": "<a href='/AIV/1/31/2'>Gen 31:2</a>; <a href='/AIV/1/28/20'>Gen 28:20</a>",
      "comment": "Jacob attributes his protection and prosperity to God’s presence, rather than his own efforts, a reminder that ultimate security comes from God."
    },
    {
      "pk": 1031006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 6,
      "text": "You know that with all my strength I have served your father.",
      "links": "<a href='/AIV/1/29/20'>Gen 29:20</a>; <a href='/AIV/1/30/26'>Gen 30:26</a>",
      "comment": "Jacob appeals to his wives' loyalty and recounts his years of service—a theme of faithful labor seen throughout Scripture."
    },
    {
      "pk": 1031007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 7,
      "text": "But your father has deceived me and changed my wages ten times, but God did not allow him to hurt me.",
      "links": "<a href='/AIV/1/29/25'>Gen 29:25</a>; <a href='/AIV/1/31/41'>Gen 31:41</a>",
      "comment": "Despite being wronged repeatedly, Jacob recognizes God’s sovereign protection, reminding us of God’s just oversight in our hardships."
    },
    {
      "pk": 1031008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 8,
      "text": "If he said, ‘The spotted shall be your wages,’ then all the flock bore spotted; and if he said, ‘The striped shall be your wages,’ then all the flock bore striped.",
      "links": "<a href='/AIV/1/30/32'>Gen 30:32–39</a>",
      "comment": "Jacob points to God’s providential arrangement of the flocks, reinforcing the concept of God’s hand in material blessings."
    },
    {
      "pk": 1031009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 9,
      "text": "So God has taken away the livestock of your father and given them to me.",
      "links": "<a href='/AIV/1/31/16'>Gen 31:16</a>",
      "comment": "Jacob attributes his prosperity not to his own cunning but to divine justice and grace—foreshadowing the biblical doctrine that blessings are received as a gift."
    },
    {
      "pk": 1031010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 10,
      "text": "In the mating season of the flock, I saw in a dream that the male goats which leaped upon the flock were striped, spotted, and mottled.",
      "links": "<a href='/AIV/1/28/12'>Gen 28:12</a>; <a href='/AIV/1/20/3'>Gen 20:3</a>",
      "comment": "Jacob’s dream illustrates God’s supernatural intervention in his affairs. Divine revelation through dreams is a recurring biblical motif."
    },
    {
      "pk": 1031011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 11,
      "text": "The angel of God said to me in the dream, ‘Jacob,’ and I said, ‘Here I am.’",
      "links": "<a href='/AIV/1/16/7'>Gen 16:7</a>; <a href='/AIV/1/22/11'>Gen 22:11</a>",
      "comment": "The angelic address echoes earlier theophanies and calls to obedience (compare with Abraham’s calling)."
    },
    {
      "pk": 1031012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 12,
      "text": "He said, ‘Lift up your eyes and see, all the male goats that leap on the flock are striped, spotted, and mottled; for I have seen all that Laban is doing to you.’",
      "links": "<a href='/AIV/1/31/8-9'>Gen 31:8-9</a>; <a href='/AIV/2/3/7'>Ex 3:7</a>",
      "comment": "God is attentive to injustice and intervenes righteously, reminiscent of His later deliverance of Israel from Egypt."
    },
    {
      "pk": 1031013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 13,
      "text": "I am the God of Bethel, where you anointed a pillar, where you made a vow to Me. Now arise, leave this land, and return to your native land.’",
      "links": "<a href='/AIV/1/28/18-22'>Gen 28:18-22</a>",
      "comment": "God identifies Himself by Jacob’s earlier spiritual encounter. The reference to the anointed pillar subtly anticipates later biblical emphasis on physical signs and memorials as means of God’s continued presence."
    },
    {
      "pk": 1031014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 14,
      "text": "Rachel and Leah answered, ‘Is there still any portion or inheritance for us in our father’s house?’",
      "links": "<a href='/AIV/1/31/1'>Gen 31:1</a>",
      "comment": "Rachel and Leah express their sense of displacement and loss of inheritance, motivating their support for Jacob’s decision."
    },
    {
      "pk": 1031015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 15,
      "text": "Are we not considered strangers by him? For he has sold us, and completely used up what was paid for us.",
      "links": "<a href='/AIV/1/29/27-28'>Gen 29:27-28</a>",
      "comment": "Laban has failed his daughters both relationally and materially, clarifying their alienation and lack of paternal support."
    },
    {
      "pk": 1031016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 16,
      "text": "For all the riches which God has taken from our father belong to us and to our children; now then, do whatever God has said to you.",
      "links": "<a href='/AIV/1/31/9'>Gen 31:9</a>",
      "comment": "Rachel and Leah recognize God’s justice and provision for them, supporting obedience to God’s instruction above natural family ties."
    },
    {
      "pk": 1031017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 17,
      "text": "Then Jacob arose, put his children and his wives on the camels,",
      "links": "<a href='/AIV/1/12/4'>Gen 12:4</a>",
      "comment": "Jacob takes decisive action to follow God’s call, just as Abraham stepped out in faith."
    },
    {
      "pk": 1031018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 18,
      "text": "and he drove all his livestock, all his property which he had gained, the livestock in his possession which he had acquired in Paddan-aram, to go to Isaac his father in the land of Canaan.",
      "links": "<a href='/AIV/1/25/20'>Gen 25:20</a>",
      "comment": "Jacob’s intention is to return to his promised homeland and reunite with his father, marking a transition in the covenant story."
    },
    {
      "pk": 1031019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 19,
      "text": "Now while Laban was away shearing his sheep, Rachel stole the household gods that belonged to her father.",
      "links": "<a href='/AIV/1/35/2'>Gen 35:2</a>; <a href='/AIV/6/24/2'>Josh 24:2</a>",
      "comment": "The theft of the household idols (teraphim) demonstrates ongoing attachment to old traditions. Note the later biblical stress on exclusive worship and purification from idols."
    },
    {
      "pk": 1031020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 20,
      "text": "Jacob deceived Laban the Aramean by not telling him that he was fleeing.",
      "links": "<a href='/AIV/1/31/27'>Gen 31:27</a>",
      "comment": "Jacob resorts to subterfuge, reflecting an ongoing struggle with honesty, yet God continues to direct the outcome according to His purposes."
    },
    {
      "pk": 1031021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 21,
      "text": "So he fled with all that he had. He arose, crossed the river, and set his face toward the mountain of Gilead.",
      "links": "<a href='/AIV/1/32/22'>Gen 32:22</a>",
      "comment": "Jacob’s crossing of boundaries echoes previous patterns of exodus and return in the lives of the patriarchs."
    },
    {
      "pk": 1031022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 22,
      "text": "Laban was told on the third day that Jacob had fled.",
      "links": "<a href='/AIV/1/31/19-20'>Gen 31:19-20</a>",
      "comment": "The narrative builds drama, as Laban learns of the escape after some delay."
    },
    {
      "pk": 1031023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 23,
      "text": "He took his relatives with him and pursued after him for seven days’ journey, and overtook him in the mountain of Gilead.",
      "links": "<a href='/AIV/1/31/25'>Gen 31:25</a>; <a href='/AIV/1/14/14'>Gen 14:14-15</a>",
      "comment": "Laban’s intense pursuit underscores the seriousness of the conflict; the number seven again appears, often signifying completeness."
    },
    {
      "pk": 1031024,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 24,
      "text": "But God came to Laban the Aramean in a dream by night, and said to him, 'Be careful that you do not say anything to Jacob, either good or bad.'",
      "links": "<a href='/AIV/1/20/3'>Gen 20:3</a>; <a href='/AIV/1/28/12'>Gen 28:12</a>",
      "comment": "God warns Laban, showing His direct protection over the covenant family, anticipating later instances of God intervening for His people."
    },
    {
      "pk": 1031025,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 25,
      "text": "Laban caught up with Jacob. Now Jacob had pitched his tent in the hill country; and Laban with his relatives camped in the hill country of Gilead.",
      "links": "<a href='/AIV/1/31/23'>Gen 31:23</a>",
      "comment": "The confrontation scene is set, highlighting the anxiety and suspense."
    },
    {
      "pk": 1031026,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 26,
      "text": "Laban said to Jacob, “What have you done, that you have deceived me and carried away my daughters as captives of the sword?",
      "links": "<a href='/AIV/1/31/20'>Gen 31:20</a>",
      "comment": "Laban accuses Jacob of abduction, using terms of violence to express his outrage, though there was no actual force."
    },
    {
      "pk": 1031027,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 27,
      "text": "Why did you flee secretly and deceive me, and didn’t tell me, so that I might have sent you away with joy and with songs, with tambourine and with harp?",
      "links": "<a href='/AIV/2/15/20'>Ex 15:20</a>",
      "comment": "The mention of music marks cultural expressions of departure; Laban’s words ring hollow, given his antagonism."
    },
    {
      "pk": 1031028,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 28,
      "text": "And you did not allow me to kiss my sons and my daughters. Now you have done foolishly.",
      "links": "<a href='/AIV/1/29/11'>Gen 29:11</a>",
      "comment": "Laban protests the loss of family connection, deflecting from the real reasons for strife."
    },
    {
      "pk": 1031029,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 29,
      "text": "It is in my power to do you harm, but the God of your father spoke to me last night, saying, ‘Be careful not to say anything to Jacob, either good or bad.’",
      "links": "<a href='/AIV/1/31/24'>Gen 31:24</a>",
      "comment": "God’s warning restrains Laban and asserts the reality of divine intervention for the sake of the chosen line."
    },
    {
      "pk": 1031030,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 30,
      "text": "Now surely you left because you longed greatly for your father’s house, but why have you stolen my gods?",
      "links": "<a href='/AIV/1/31/19'>Gen 31:19</a>",
      "comment": "Laban’s chief concern is not just family but his household idols, exposing divided religious loyalties that the rest of the story will continually address."
    },
    {
      "pk": 1031031,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 31,
      "text": "Jacob answered Laban, 'Because I was afraid, for I thought that you would take your daughters from me by force.'",
      "links": "<a href='/AIV/1/31/26'>Gen 31:26</a>",
      "comment": "Jacob’s fear reveals persistent lack of complete trust, and the sense of vulnerability of the people of God amid hostility."
    },
    {
      "pk": 1031032,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 32,
      "text": "Anyone with whom you find your gods shall not live. In the presence of our relatives, see for yourself what I have of yours, and take it.” Now Jacob did not know that Rachel had stolen them.",
      "links": "<a href='/AIV/1/44/9'>Gen 44:9</a>",
      "comment": "Jacob’s pronouncement foreshadows tragic consequences. Usurping God's place with idols brings serious repercussions."
    },
    {
      "pk": 1031033,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 33,
      "text": "So Laban went into Jacob’s tent, into Leah’s tent, and into the tent of the two maidservants, but did not find them. Then he went out of Leah’s tent and entered Rachel’s tent.",
      "links": "<a href='/AIV/1/31/19'>Gen 31:19</a>",
      "comment": "The search for the household gods dramatizes the tension; Rachel’s deception echoes earlier stories of familial cunning."
    },
    {
      "pk": 1031034,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 34,
      "text": "Now Rachel had taken the household gods, put them in the camel’s saddle, and sat on them. Laban searched all the tent but did not find them.",
      "links": "<a href='/AIV/1/31/19'>Gen 31:19</a>",
      "comment": "Rachel resorts to trickery. The physical act of sitting on the idols hints at their powerlessness—an implicit polemic against idolatry."
    },
    {
      "pk": 1031035,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 35,
      "text": "She said to her father, 'Let not my lord be angry that I cannot rise before you, for the manner of women is upon me.' So he searched, but did not find the household gods.",
      "links": "<a href='/AIV/3/15/19'>Lev 15:19</a>",
      "comment": "Rachel invokes ritual impurity to excuse herself, revealing both cunning and the cultural practices surrounding ritual and purity."
    },
    {
      "pk": 1031036,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 36,
      "text": "Jacob became angry and argued with Laban. Jacob answered Laban, 'What is my trespass? What is my sin that you have hotly pursued me?'",
      "links": "<a href='/AIV/1/31/23'>Gen 31:23</a>",
      "comment": "Jacob’s indignation underscores the righteousness of his cause; innocence in suffering is a recurring biblical theme."
    },
    {
      "pk": 1031037,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 37,
      "text": "Now that you have searched all my goods, what have you found belonging to your household? Set it here before my relatives and yours, so that they may decide between us two.",
      "links": "<a href='/AIV/1/31/33'>Gen 31:33</a>",
      "comment": "Public arbitration parallels later biblical standards of justice and communal witness."
    },
    {
      "pk": 1031038,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 38,
      "text": "These twenty years I have been with you; your ewes and your female goats have not miscarried, and I have not eaten the rams of your flocks.",
      "links": "<a href='/AIV/1/31/41'>Gen 31:41</a>",
      "comment": "Jacob affirms his integrity and care for the flock—a pattern later intended for shepherds and leaders."
    },
    {
      "pk": 1031039,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 39,
      "text": "What was torn by beasts I did not bring to you; I bore its loss myself. You required it from my hand, whether stolen by day or stolen by night.",
      "links": "<a href='/AIV/2/22/13'>Ex 22:13</a>",
      "comment": "Jacob describes the discipline of just stewardship and bearing responsibility, principles foundational to later biblical law."
    },
    {
      "pk": 1031040,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 40,
      "text": "By day the heat consumed me, and the frost by night, and sleep fled from my eyes.",
      "links": "<a href='/AIV/1/30/29'>Gen 30:29</a>",
      "comment": "The cost of faithful service is highlighted—reminiscent of the trials Jesus and the apostles would endure for their flock."
    },
    {
      "pk": 1031041,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 41,
      "text": "These twenty years I have been in your house. I served you fourteen years for your two daughters and six years for your flock, and you have changed my wages ten times.",
      "links": "<a href='/AIV/1/29/20-30/41'>Gen 29:20-30:41</a>",
      "comment": "Jacob’s perseverance and submission despite unfair treatment subtly model endurance and obedience—a virtue highlighted in Christ’s passion and apostolic labor."
    },
    {
      "pk": 1031042,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 42,
      "text": "If the God of my father, the God of Abraham, and the Fear of Isaac, had not been with me, surely you would have sent me away empty. God has seen my affliction and the labor of my hands, and rebuked you last night.",
      "links": "<a href='/AIV/1/28/13'>Gen 28:13</a>; <a href='/AIV/2/3/7'>Ex 3:7</a>",
      "comment": "God’s presence and justice prevail. God’s faithfulness to the covenant is central, and the title 'Fear of Isaac' emphasizes God’s holiness."
    },
    {
      "pk": 1031043,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 43,
      "text": "Laban answered and said to Jacob, 'The daughters are my daughters, the children are my children, and the flocks are my flocks. Everything you see is mine; but what can I do this day to these my daughters, or to their children whom they have borne?'",
      "links": "<a href='/AIV/1/29/21-30'>Gen 29:21-30</a>",
      "comment": "Laban's possessiveness highlights mankind's struggle to surrender to God’s sovereignty over people and possessions."
    },
    {
      "pk": 1031044,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 44,
      "text": "Now therefore come, let us make a covenant, you and I; and let it be a witness between me and you.”",
      "links": "<a href='/AIV/1/21/27'>Gen 21:27</a>",
      "comment": "Covenants serve as binding, visible signs of commitment—foundational to the unfolding of salvation history."
    },
    {
      "pk": 1031045,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 45,
      "text": "So Jacob took a stone and set it up as a pillar.",
      "links": "<a href='/AIV/1/28/18'>Gen 28:18</a>",
      "comment": "Pillars and stones mark places of encounter and covenant, prefiguring ongoing physical signs in worship and remembrances."
    },
    {
      "pk": 1031046,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 46,
      "text": "Jacob said to his relatives, 'Gather stones.' They took stones and made a heap, and they ate there by the heap.",
      "links": "<a href='/AIV/1/26/31'>Gen 26:31</a>",
      "comment": "The communal meal at the cairn is a sign of peace, a motif echoing throughout Old and New Testaments. Table fellowship is a recurring biblical theme."
    },
    {
      "pk": 1031047,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 47,
      "text": "Laban called it Jegar-sahadutha, but Jacob called it Galeed.",
      "links": "<a href='/AIV/1/31/48'>Gen 31:48</a>",
      "comment": "The different names reflect diverse languages and cultures, yet the act is unified. There is richness in maintaining unity with diversity in the worship of God."
    },
    {
      "pk": 1031048,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 48,
      "text": "Laban said, 'This heap is witness between you and me today.' Therefore it was named Galeed,",
      "links": "<a href='/AIV/1/31/44'>Gen 31:44</a>",
      "comment": "The heap of stones serves as a memorial and witness—a role later played by the altar and other physical signs in biblical worship."
    },
    {
      "pk": 1031049,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 49,
      "text": "and Mizpah, for he said, 'May Yahweh watch between you and me, when we are absent one from another.",
      "links": "<a href='/AIV/1/31/53'>Gen 31:53</a>",
      "comment": "God Himself is invoked as the ultimate guarantor of the oath, stressing the need for divine witness in covenants."
    },
    {
      "pk": 1031050,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 50,
      "text": "If you afflict my daughters, or if you take wives besides my daughters, though no man is with us, God is witness between you and me.'",
      "links": "<a href='/AIV/1/16/5'>Gen 16:5</a>",
      "comment": "Even unobservable actions are subject to God's judgment, highlighting the seriousness of vows—also echoed in Jesus’ teaching on oaths."
    },
    {
      "pk": 1031051,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 51,
      "text": "Laban said to Jacob, 'See this heap and see the pillar, which I have set between you and me.",
      "links": "<a href='/AIV/1/31/45-46'>Gen 31:45-46</a>",
      "comment": "Visible memorials foster accountability and continuity in the faith community."
    },
    {
      "pk": 1031052,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 52,
      "text": "This heap is a witness, and the pillar is a witness, that I will not pass beyond this heap to you, and you will not pass beyond this heap and this pillar to me, for harm.",
      "links": "<a href='/AIV/1/21/23'>Gen 21:23</a>",
      "comment": "The heap and pillar act as boundary markers; boundaries help preserve peace in covenant relationships."
    },
    {
      "pk": 1031053,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 53,
      "text": "May the God of Abraham and the God of Nahor, the God of their father, judge between us.” Then Jacob swore by the Fear of his father Isaac.",
      "links": "<a href='/AIV/1/31/42'>Gen 31:42</a>",
      "comment": "While Laban invokes multiple ancestral gods, Jacob holds fast to the one true God—foreshadowing the later call to exclusive divine worship."
    },
    {
      "pk": 1031054,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 54,
      "text": "Jacob offered a sacrifice on the mountain, and called his relatives to eat bread. They ate bread and spent the night on the mountain.",
      "links": "<a href='/AIV/1/26/31'>Gen 26:31</a>; <a href='/AIV/2/24/5-11'>Ex 24:5-11</a>",
      "comment": "Sacrifice and a communal meal mark covenant sealing—prefiguring the importance of sacrificial worship and sacred communal feasting in later revelation."
    },
    {
      "pk": 1031055,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 31,
      "verse": 55,
      "text": "Early in the morning Laban rose up and kissed his sons and his daughters and blessed them. Then Laban departed and returned to his place.",
      "links": "<a href='/AIV/1/29/11'>Gen 29:11</a>",
      "comment": "Laban departs in peace after blessing his family. Blessing is significant, as it confers spiritual favor and closure—themes fulfilled in the giving of benediction and peace throughout Scripture."
    }
  ],
  "translatedAt": "2025-12-24T00:28:36.693Z"
}