{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 17,
  "verses": [
    {
      "pk": 1932717,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 1,
      "text": "When Abram was ninety-nine years old, the LORD appeared to him and said, 'I am God Almighty; walk before me and be blameless.'",
      "links": "<a href='/AIV/1/12/1'>Gen. 12:1</a>; <a href='/AIV/2/6/3'>Ex. 6:3</a>",
      "comment": "'God Almighty' (El Shaddai) is a key title showing God's all-sufficiency—see note in Ex. 6:3. 'Be blameless' signals a call to holiness and complete devotion."
    },
    {
      "pk": 1932718,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 2,
      "text": "'I will make my covenant between me and you, and will multiply you greatly.'",
      "links": "<a href='/AIV/1/15/18'>Gen. 15:18</a>; <a href='/AIV/1/12/2-3'>Gen. 12:2–3</a>",
      "comment": "God's promise of a 'covenant' is repeated and intensified, deepening God’s solemn relationship with Abram."
    },
    {
      "pk": 1932719,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 3,
      "text": "Then Abram fell on his face, and God spoke to him, saying,",
      "links": "<a href='/AIV/3/9/24'>Lev. 9:24</a>; <a href='/AIV/1/17/17'>Gen. 17:17</a>",
      "comment": "Falling on one's face is a posture of worship and humility before God."
    },
    {
      "pk": 1932720,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 4,
      "text": "'Behold, my covenant is with you, and you shall be the father of a multitude of nations.'",
      "links": "<a href='/AIV/1/12/3'>Gen. 12:3</a>; <a href='/AIV/1/15/5'>Gen. 15:5</a>",
      "comment": "This expands the earlier promise—Abram’s influence is now multi-national, a key development in salvation history."
    },
    {
      "pk": 1932721,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 5,
      "text": "'No longer shall your name be called Abram, but your name shall be Abraham; for I have made you the father of a multitude of nations.'",
      "links": "<a href='/AIV/1/17/4'>Gen. 17:4</a>; <a href='/AIV/1/35/10-11'>Gen. 35:10–11</a>",
      "comment": "God gives Abram a new name, marking a deeper identity in God’s plan. Names in Scripture often signify mission and divine purpose."
    },
    {
      "pk": 1932722,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 6,
      "text": "'I will make you exceedingly fruitful, and I will make nations of you, and kings shall come from you.'",
      "links": "<a href='/AIV/1/35/11'>Gen. 35:11</a>; <a href='/AIV/1/49/10'>Gen. 49:10</a>",
      "comment": "'Kings shall come from you' hints at the royal line, ultimately preparing for the messianic king (see Matt. 1:1)."
    },
    {
      "pk": 1932723,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 7,
      "text": "'And I will establish my covenant between me and you and your descendants after you, throughout their generations, as an everlasting covenant, to be God to you and to your offspring after you.'",
      "links": "<a href='/AIV/1/9/9'>Gen. 9:9</a>; <a href='/AIV/1/26/24'>Gen. 26:24</a>; <a href='/AIV/44/2/39'>Acts 2:39</a>",
      "comment": "The 'everlasting covenant' shapes the rest of biblical salvation history, fulfilled in Christ who brings a new and everlasting covenant (Luke 22:20)."
    },
    {
      "pk": 1932724,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 8,
      "text": "'And I will give to you and to your descendants after you the land where you are a stranger—all the land of Canaan—as an everlasting possession. And I will be their God.'",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/1/13/15'>Gen. 13:15</a>",
      "comment": "Possession of the land points forward to God's faithfulness; its everlasting nature signals a deeper, spiritual inheritance (Heb. 11:10, 16)."
    },
    {
      "pk": 1932725,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 9,
      "text": "God said to Abraham, 'As for you, you shall keep my covenant, you and your descendants after you throughout their generations.'",
      "links": "<a href='/AIV/1/18/19'>Gen. 18:19</a>; <a href='/AIV/1/17/19'>Gen. 17:19</a>",
      "comment": "God’s covenant requires an active response—obedience and faithfulness on Abraham’s part."
    },
    {
      "pk": 1932726,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 10,
      "text": "'This is my covenant, which you shall keep, between me and you and your descendants after you: Every male among you shall be circumcised.'",
      "links": "<a href='/AIV/1/17/14'>Gen. 17:14</a>; <a href='/AIV/3/12/3'>Lev. 12:3</a>",
      "comment": "Circumcision is the sign of covenant membership, later interpreted spiritually as the 'circumcision of the heart' (Rom. 2:29; Col. 2:11)."
    },
    {
      "pk": 1932727,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 11,
      "text": "'You shall be circumcised in the flesh of your foreskins, and that shall be the sign of the covenant between me and you.'",
      "links": "<a href='/AIV/1/17/13'>Gen. 17:13</a>; <a href='/AIV/5/10/16'>Deut. 10:16</a>",
      "comment": "A visible, physical sign is given to a people set apart, foreshadowing future sacramental signs."
    },
    {
      "pk": 1932728,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 12,
      "text": "'He who is eight days old among you shall be circumcised, every male throughout your generations, including anyone born in your house or bought with your money from any foreigner, who is not of your descendants.'",
      "links": "<a href='/AIV/3/12/3'>Lev. 12:3</a>; <a href='/AIV/1/21/4'>Gen. 21:4</a>",
      "comment": "Inclusivity of all in the household, even non-physical descendants, reveals God’s broader plan for the nations (see Acts 10:34–35)."
    },
    {
      "pk": 1932729,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 13,
      "text": "'Both he who is born in your house and he who is bought with your money must surely be circumcised. Thus my covenant shall be in your flesh as an everlasting covenant.'",
      "links": "<a href='/AIV/2/12/48'>Ex. 12:48</a>",
      "comment": "The covenantal sign is not merely spiritual but physical, uniting all in one people under God's promise."
    },
    {
      "pk": 1932730,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 14,
      "text": "'Any uncircumcised male who is not circumcised in the flesh of his foreskin shall be cut off from his people; he has broken my covenant.'",
      "links": "<a href='/AIV/7/5/2-3'>Josh. 5:2–3</a>; <a href='/AIV/3/23/27'>Lev. 23:27'</a>",
      "comment": "'Cut off' shows the seriousness of rejecting God’s covenant sign—a parallel to baptism in terms of New Covenant entrance (Col. 2:11–12)."
    },
    {
      "pk": 1932731,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 15,
      "text": "God said to Abraham, 'As for Sarai your wife, you shall not call her name Sarai, but Sarah shall be her name.'",
      "links": "<a href='/AIV/1/17/5'>Gen. 17:5</a>; <a href='/AIV/1/18/10'>Gen. 18:10</a>",
      "comment": "The renaming of Sarai to Sarah elevates her status and role in God’s plan, as the mother of nations and kings—showing the dignity of women in salvation history."
    },
    {
      "pk": 1932732,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 16,
      "text": "'I will bless her, and moreover, I will give you a son by her. I will bless her, and she shall become nations; kings of peoples shall come from her.'",
      "links": "<a href='/AIV/1/18/10'>Gen. 18:10</a>; <a href='/AIV/1/21/2'>Gen. 21:2</a>",
      "comment": "Sarah receives God’s direct promise, affirming her as an instrument of God’s promised blessing—a type of the Church as spiritual mother."
    },
    {
      "pk": 1932733,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 17,
      "text": "Then Abraham fell on his face and laughed, and said to himself, 'Shall a child be born to a man who is a hundred years old? Shall Sarah, who is ninety years old, bear a child?'",
      "links": "<a href='/AIV/1/18/12'>Gen. 18:12</a>; <a href='/AIV/45/4/19'>Rom. 4:19</a>",
      "comment": "Abraham’s laughter expresses both wonder and doubt; Paul later points to this moment as an example of faith (Romans 4:19)."
    },
    {
      "pk": 1932734,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 18,
      "text": "And Abraham said to God, 'Oh that Ishmael might live before you!'",
      "links": "<a href='/AIV/1/16/15'>Gen. 16:15</a>; <a href='/AIV/1/21/13'>Gen. 21:13</a>",
      "comment": "Abraham’s paternal care for Ishmael is noted, but God’s covenant line will proceed through Sarah’s son Isaac."
    },
    {
      "pk": 1932735,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 19,
      "text": "God said, 'No, but Sarah your wife shall bear you a son, and you shall call his name Isaac. I will establish my covenant with him as an everlasting covenant for his descendants after him.'",
      "links": "<a href='/AIV/1/18/10'>Gen. 18:10</a>; <a href='/AIV/1/21/12'>Gen. 21:12</a>",
      "comment": "The promised line is through Isaac. The promise is God’s initiative—human scheming cannot change God’s plan (see Gal. 4:28)."
    },
    {
      "pk": 1932736,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 20,
      "text": "'As for Ishmael, I have heard you. Behold, I have blessed him and will make him fruitful and multiply him greatly. He shall father twelve princes, and I will make him into a great nation.'",
      "links": "<a href='/AIV/1/16/10'>Gen. 16:10</a>; <a href='/AIV/1/25/16'>Gen. 25:16</a>",
      "comment": "God’s blessing extends to Ishmael, but privileges differ between promise and general blessing."
    },
    {
      "pk": 1932737,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 21,
      "text": "'But I will establish my covenant with Isaac, whom Sarah shall bear to you at this set time next year.'",
      "links": "<a href='/AIV/1/21/2'>Gen. 21:2</a>",
      "comment": "God sovereignly determines the line of covenant, which is fulfilled against human expectation."
    },
    {
      "pk": 1932738,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 22,
      "text": "When he had finished talking with him, God went up from Abraham.",
      "links": "<a href='/AIV/1/18/33'>Gen. 18:33</a>",
      "comment": "God’s departure signifies the gravity and completion of the revelation."
    },
    {
      "pk": 1932739,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 23,
      "text": "Then Abraham took Ishmael his son and all those born in his house or bought with his money, every male among the men of Abraham’s house, and he circumcised the flesh of their foreskins that very day, as God had said to him.",
      "links": "<a href='/AIV/1/17/10'>Gen. 17:10</a>; <a href='/AIV/1/21/4'>Gen. 21:4</a>",
      "comment": "Abraham’s immediate obedience is exemplary. The principle of acting upon divine command, even before full understanding, echoes throughout Scripture."
    },
    {
      "pk": 1932740,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 24,
      "text": "Abraham was ninety-nine years old when he was circumcised in the flesh of his foreskin.",
      "links": "<a href='/AIV/1/17/1'>Gen. 17:1</a>",
      "comment": "Abraham’s advanced age demonstrates the miraculous and sovereign character of God’s works through him."
    },
    {
      "pk": 1932741,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 25,
      "text": "And Ishmael his son was thirteen years old when he was circumcised in the flesh of his foreskin.",
      "links": "<a href='/AIV/1/16/16'>Gen. 16:16</a>",
      "comment": "Ishmael’s circumcision shows obedience within Abraham’s wider household, though the covenant line remains with Isaac."
    },
    {
      "pk": 1932742,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 26,
      "text": "On that same day Abraham and his son Ishmael were circumcised.",
      "links": "<a href='/AIV/1/17/23'>Gen. 17:23</a>",
      "comment": "Exact same-day obedience underscores Abraham’s faith and the unity of his house in the covenant sign."
    },
    {
      "pk": 1932743,
      "translation": "AIV",
      "book": 1,
      "chapter": 17,
      "verse": 27,
      "text": "And all the men of his house, those born in the house and those bought with money from a foreigner, were circumcised with him.",
      "links": "<a href='/AIV/1/17/12'>Gen. 17:12</a>",
      "comment": "The entire household’s participation anticipates the inclusive nature of God’s community, later fulfilled in the Church which embraces all nations (Gal. 3:28–29)."
    }
  ],
  "translatedAt": "2025-12-23T08:42:02.548Z"
}