{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 11,
  "verses": [
    {
      "pk": 11001,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 1,
      "text": "Now the whole earth had one language and the same words.",
      "links": "<a href='/AIV/01/10/32'>Gen. 10:32</a>; <a href='/AIV/01/11/6'>Gen. 11:6</a>",
      "comment": "The unity of language reflects humanity’s original harmony and oneness, foundational before the division introduced at Babel."
    },
    {
      "pk": 11002,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 2,
      "text": "And as people migrated from the east, they found a plain in the land of Shinar and settled there.",
      "links": "<a href='/AIV/01/10/10'>Gen. 10:10</a>; <a href='/AIV/27/1/2'>Dan. 1:2</a>",
      "comment": "The mention of Shinar connects this passage with earlier references to Babylon, foreshadowing later Biblical events centered in this region."
    },
    {
      "pk": 11003,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 3,
      "text": "And they said to one another, 'Come, let us make bricks and bake them thoroughly.' They used brick for stone, and tar for mortar.",
      "links": "<a href='/AIV/02/1/14'>Exod. 1:14</a>",
      "comment": "Brick-making technology here demonstrates a creative, collaborative human effort, underpinning themes of technological progress and communal action."
    },
    {
      "pk": 11004,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 4,
      "text": "Then they said, 'Come, let us build ourselves a city and a tower with its top in the heavens. Let us make a name for ourselves, lest we be scattered over the face of the whole earth.'",
      "links": "<a href='/AIV/19/49/11'>Ps. 49:11</a>; <a href='/AIV/23/14/13'>Isa. 14:13</a>",
      "comment": "Their ambition resembles prideful self-exaltation, echoing themes of humanity’s desire for autonomy apart from God. Spiritual significance: Prefigures man's attempt to reach heaven by works, a motif later fulfilled in Christ's gift of true unity."
    },
    {
      "pk": 11005,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 5,
      "text": "But the LORD came down to see the city and the tower that the children of man were building.",
      "links": "<a href='/AIV/01/18/21'>Gen. 18:21</a>",
      "comment": "God’s descent emphasizes His personal involvement with humanity, foreshadowing future divine interventions (spiritually fulfilled in the Incarnation, see <a href='/AIV/43/1/14'>John 1:14</a>)."
    },
    {
      "pk": 11006,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 6,
      "text": "And the LORD said, 'Behold, they are one people and they all have one language, and this is only the beginning of what they will do. Now nothing they propose to do will be impossible for them.'",
      "links": "<a href='/AIV/01/11/1'>Gen. 11:1</a>",
      "comment": "God recognizes human unity and its power, highlighting the importance of harmony. In spiritual interpretation, this points toward a future restoration of unity among mankind (see <a href='/AIV/44/2/1-11'>Acts 2:1–11</a>, Pentecost)."
    },
    {
      "pk": 11007,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 7,
      "text": "'Come, let us go down and confuse their language so they will not understand one another’s speech.'",
      "links": "<a href='/AIV/01/01/26'>Gen. 1:26</a>; <a href='/AIV/19/2/4'>Ps. 2:4</a>",
      "comment": "The plural 'let us' hints at the mystery of divine plurality, understood as a veiled reference to the triune nature of God, echoing earlier verses. Spiritual note: Points to God’s desire for true unity, not just external uniformity."
    },
    {
      "pk": 11008,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 8,
      "text": "So the LORD scattered them from there over the face of all the earth, and they stopped building the city.",
      "links": "<a href='/AIV/01/10/18'>Gen. 10:18</a>",
      "comment": "Human pride leads to dispersion, fulfilling God’s earlier mandate to fill the earth (<a href='/AIV/01/09/1'>Gen. 9:1</a>)."
    },
    {
      "pk": 11009,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 9,
      "text": "Therefore its name was called Babel, because there the LORD confused the language of all the earth. From there the LORD scattered them over the face of all the earth.",
      "links": "<a href='/AIV/01/10/10'>Gen. 10:10</a>; <a href='/AIV/23/13/19'>Isa. 13:19</a>",
      "comment": "'Babel' sounds like the word for 'confusion.' The scattering anticipates the gathering of all nations in unity through God’s later redemptive acts (<a href='/AIV/44/2/6-11'>Acts 2:6-11</a>)."
    },
    {
      "pk": 11010,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 10,
      "text": "These are the generations of Shem. Shem was 100 years old and became the father of Arpachshad two years after the flood.",
      "links": "<a href='/AIV/01/05/32'>Gen. 5:32</a>; <a href='/AIV/01/10/22'>Gen. 10:22</a>",
      "comment": "The genealogies mark a transition from the primeval history to the ancestral line leading to Abraham; Shem’s descendants are pivotal for salvation history."
    },
    {
      "pk": 11011,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 11,
      "text": "After he became the father of Arpachshad, Shem lived 500 years and had other sons and daughters.",
      "links": "<a href='/AIV/01/05/4'>Gen. 5:4</a>",
      "comment": "The long lifespans reflect the early antediluvian period, and contain the pattern of 'X lived Y years,' typical of Genesis genealogies."
    },
    {
      "pk": 11012,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 12,
      "text": "When Arpachshad had lived 35 years, he became the father of Shelah.",
      "links": "<a href='/AIV/01/10/24'>Gen. 10:24</a>; <a href='/AIV/42/3/36'>Luke 3:36</a>",
      "comment": "Arpachshad’s line is echoed in the genealogy of Jesus, showing continuity between Old Testament promise and its New Testament fulfillment."
    },
    {
      "pk": 11013,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 13,
      "text": "After he became the father of Shelah, Arpachshad lived 403 years and had other sons and daughters.",
      "links": "<a href='/AIV/01/11/11'>Gen. 11:11</a>",
      "comment": "Standard genealogical formula continues, reinforcing lineage and fulfillment of divine promises."
    },
    {
      "pk": 11014,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 14,
      "text": "When Shelah had lived 30 years, he became the father of Eber.",
      "links": "<a href='/AIV/01/10/24'>Gen. 10:24</a>; <a href='/AIV/42/3/35'>Luke 3:35</a>",
      "comment": "Eber’s name is significant; the term 'Hebrew' likely originates from him, linking to future Israelite identity."
    },
    {
      "pk": 11015,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 15,
      "text": "After he became the father of Eber, Shelah lived 403 years and had other sons and daughters.",
      "links": "<a href='/AIV/01/11/13'>Gen. 11:13</a>",
      "comment": "The repeating formula highlights dynastic continuity."
    },
    {
      "pk": 11016,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 16,
      "text": "When Eber had lived 34 years, he became the father of Peleg.",
      "links": "<a href='/AIV/01/10/25'>Gen. 10:25</a>",
      "comment": "Peleg’s name means 'division,' referencing the division of peoples noted earlier at Babel."
    },
    {
      "pk": 11017,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 17,
      "text": "After he became the father of Peleg, Eber lived 430 years and had other sons and daughters.",
      "links": "<a href='/AIV/01/11/15'>Gen. 11:15</a>",
      "comment": "Continues the genealogical line with emphasis on promise and expansion."
    },
    {
      "pk": 11018,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 18,
      "text": "When Peleg had lived 30 years, he became the father of Reu.",
      "links": "<a href='/AIV/01/11/16'>Gen. 11:16</a>; <a href='/AIV/42/3/35'>Luke 3:35</a>",
      "comment": "The line continues toward Abraham. The genealogies here historically and spiritually connect Old Testament promise and New Testament fulfillment."
    },
    {
      "pk": 11019,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 19,
      "text": "After he became the father of Reu, Peleg lived 209 years and had other sons and daughters.",
      "links": "<a href='/AIV/01/11/17'>Gen. 11:17</a>",
      "comment": "Duration of lifespans begins to shorten, indicating shifting eras after the flood."
    },
    {
      "pk": 11020,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 20,
      "text": "When Reu had lived 32 years, he became the father of Serug.",
      "links": "<a href='/AIV/01/11/18'>Gen. 11:18</a>",
      "comment": "Each descendant draws us closer to Abraham, leading up to the emergence of God's chosen people."
    },
    {
      "pk": 11021,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 21,
      "text": "After he became the father of Serug, Reu lived 207 years and had other sons and daughters.",
      "links": "<a href='/AIV/01/11/19'>Gen. 11:19</a>",
      "comment": "Repetition underscores ongoing multiplication and blessing."
    },
    {
      "pk": 11022,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 22,
      "text": "When Serug had lived 30 years, he became the father of Nahor.",
      "links": "<a href='/AIV/01/11/20'>Gen. 11:20</a>; <a href='/AIV/42/3/34'>Luke 3:34</a>",
      "comment": "Nahor is a key ancestor of Abraham, connecting the present narrative to Israel’s founding."
    },
    {
      "pk": 11023,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 23,
      "text": "After he became the father of Nahor, Serug lived 200 years and had other sons and daughters.",
      "links": "<a href='/AIV/01/11/21'>Gen. 11:21</a>",
      "comment": "Basic genealogical structure persisted."
    },
    {
      "pk": 11024,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 24,
      "text": "When Nahor had lived 29 years, he became the father of Terah.",
      "links": "<a href='/AIV/01/11/22'>Gen. 11:22</a>; <a href='/AIV/42/3/34'>Luke 3:34</a>",
      "comment": "Terah is Abraham’s father, signaling imminent fulfillment of God’s promises to the patriarchs."
    },
    {
      "pk": 11025,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 25,
      "text": "After he became the father of Terah, Nahor lived 119 years and had other sons and daughters.",
      "links": "<a href='/AIV/01/11/23'>Gen. 11:23</a>",
      "comment": "Shorter lifespans reflect the changing post-flood world."
    },
    {
      "pk": 11026,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 26,
      "text": "When Terah had lived 70 years, he became the father of Abram, Nahor, and Haran.",
      "links": "<a href='/AIV/01/12/1-5'>Gen. 12:1–5</a>; <a href='/AIV/42/3/34'>Luke 3:34</a>",
      "comment": "Abram (later Abraham) marks the pivotal figure in God’s redemptive plan; spiritual note: Abraham is often seen as spiritual father to all nations (<a href='/AIV/48/3/7'>Gal. 3:7</a>)."
    },
    {
      "pk": 11027,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 27,
      "text": "Now these are the generations of Terah. Terah became the father of Abram, Nahor, and Haran. And Haran became the father of Lot.",
      "links": "<a href='/AIV/01/14/12'>Gen. 14:12</a>; <a href='/AIV/61/2/7'>2 Pet. 2:7</a>",
      "comment": "Transition to the next era—God’s personal relationship with the family of Terah, laying groundwork for salvation history."
    },
    {
      "pk": 11028,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 28,
      "text": "Haran died before his father Terah in his native land, in Ur of the Chaldeans.",
      "links": "<a href='/AIV/01/15/7'>Gen. 15:7</a>; <a href='/AIV/44/7/4'>Acts 7:4</a>",
      "comment": "Ur of the Chaldeans is significant as the cradle of faith from which Abraham is called; geographical reference sets up future deliverance."
    },
    {
      "pk": 11029,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 29,
      "text": "Abram and Nahor took wives. The name of Abram’s wife was Sarai, and the name of Nahor’s wife was Milcah, daughter of Haran, the father of Milcah and Iscah.",
      "links": "<a href='/AIV/01/17/15'>Gen. 17:15</a>",
      "comment": "Sarai, later renamed Sarah, becomes crucial in the story of promise, prophecy, and fulfillment (<a href='/AIV/01/17/16'>Gen. 17:16</a>)."
    },
    {
      "pk": 11030,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 30,
      "text": "Now Sarai was barren; she had no child.",
      "links": "<a href='/AIV/01/18/11'>Gen. 18:11</a>; <a href='/AIV/42/1/7'>Luke 1:7</a>",
      "comment": "Her barrenness heightens the miraculous nature of God’s later intervention; spiritual parallel: God often works through human weakness for His greater glory."
    },
    {
      "pk": 11031,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 31,
      "text": "Terah took Abram his son, Lot the son of Haran, and Sarai his daughter-in-law, and they went forth together from Ur of the Chaldeans to go to the land of Canaan. But when they came to Haran, they settled there.",
      "links": "<a href='/AIV/01/12/5'>Gen. 12:5</a>; <a href='/AIV/44/7/4'>Acts 7:4</a>",
      "comment": "The move towards Canaan steps into God’s promise. Spiritual meaning: foreshadows pilgrimage and journey toward true inheritance."
    },
    {
      "pk": 11032,
      "translation": "AIV",
      "book": 1,
      "chapter": 11,
      "verse": 32,
      "text": "And Terah lived 205 years, and Terah died in Haran.",
      "links": "<a href='/AIV/01/12/4'>Gen. 12:4</a>",
      "comment": "Terah’s death marks the end of one era and the beginning of Abraham’s journey, a step closer to the fulfillment of divine covenant."
    }
  ],
  "translatedAt": "2025-12-23T08:39:32.068Z"
}