{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 45,
  "verses": [
    {
      "pk": 1945020,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 1,
      "text": "Then Joseph could not restrain himself before everyone who stood by him. He cried out, “Have everyone go out from me!” So no one stood with him while Joseph made himself known to his brothers.",
      "links": "<a href='/AIV/1/44/1'>Gen. 44:1</a>; <a href='/AIV/1/45/3'>Gen. 45:3</a>",
      "comment": "Joseph's command is dramatic, emphasizing the intimacy and exclusivity of the revelation to his family. This foreshadows moments of revelation in the New Testament, such as Jesus’ private teachings to His disciples (see <a href='/AIV/40/13/10-11'>Matt. 13:10-11</a>)."
    },
    {
      "pk": 1945021,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 2,
      "text": "And he wept aloud, and the Egyptians and Pharaoh’s household heard it.",
      "links": "<a href='/AIV/1/43/30'>Gen. 43:30</a>; <a href='/AIV/58/5/7'>Heb. 5:7</a>",
      "comment": "Joseph’s loud weeping signifies deep compassion, paralleling the depth of Christ’s compassion in the Gospels (<a href='/AIV/43/11/35'>John 11:35</a>). His vulnerability in leadership subtly points to the importance of mercy as a virtue."
    },
    {
      "pk": 1945022,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 3,
      "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But his brothers could not answer him, for they were terrified at his presence.",
      "links": "<a href='/AIV/1/37/28'>Gen. 37:28</a>; <a href='/AIV/1/42/21'>Gen. 42:21-24</a>",
      "comment": "Joseph's revelation causes fear, reminiscent of encounters with the divine in both Old and New Testaments (compare <a href='/AIV/42/24/36-38'>Luke 24:36-38</a>). Spiritual truths often bring awe and fear before they bring understanding."
    },
    {
      "pk": 1945023,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 4,
      "text": "Then Joseph said to his brothers, “Come near to me, please.” So they came near. And he said, “I am your brother Joseph, whom you sold into Egypt.”",
      "links": "<a href='/AIV/1/37/27-28'>Gen. 37:27-28</a>",
      "comment": "Joseph’s invitation to draw near mirrors themes of reconciliation and forgiveness, foundational Christian doctrines (<a href='/AIV/49/2/13'>Eph. 2:13</a>)."
    },
    {
      "pk": 1945024,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 5,
      "text": "And now do not be distressed or angry with yourselves because you sold me here, for God sent me before you to preserve life.",
      "links": "<a href='/AIV/1/50/20'>Gen. 50:20</a>; <a href='/AIV/45/8/28'>Rom. 8:28</a>",
      "comment": "Joseph’s interpretation of his suffering foreshadows doctrines of providence—God brings good out of evil intentions. This prepares the ground for understanding redemptive suffering."
    },
    {
      "pk": 1945025,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 6,
      "text": "For these two years the famine has been in the land, and there are yet five years in which there will be neither plowing nor harvesting.",
      "links": "<a href='/AIV/1/41/30'>Gen. 41:30</a>",
      "comment": "Famine as judgment and trial is a recurring motif in Scripture, calling the faithful to trust in God’s provision through His chosen mediators."
    },
    {
      "pk": 1945026,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 7,
      "text": "And God sent me before you to preserve for you a remnant on earth, and to keep you alive by a great deliverance.",
      "links": "<a href='/AIV/1/50/20'>Gen. 50:20</a>; <a href='/AIV/23/10/20-22'>Isa. 10:20-22</a>",
      "comment": "The preservation of a remnant is a key theme connecting Joseph’s story to promises about Israel and, later, the Church (see <a href='/AIV/45/11/5'>Romans 11:5</a>)."
    },
    {
      "pk": 1945027,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 8,
      "text": "So then, it was not you who sent me here, but God. And He has made me a father to Pharaoh, and lord over all his house, and ruler over all the land of Egypt.",
      "links": "<a href='/AIV/1/41/40-41'>Gen. 41:40-41</a>",
      "comment": "Joseph’s role as ‘father to Pharaoh’ introduces a theme of spiritual fatherhood, a concept that echoes throughout scriptural history and Church tradition."
    },
    {
      "pk": 1945028,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 9,
      "text": "Hurry and go up to my father and say to him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me; do not delay.’",
      "links": "<a href='/AIV/1/41/41'>Gen. 41:41</a>",
      "comment": "Joseph's request to ‘come down’ echoes an invitation to draw near to God's agent for provision and salvation—a recurring pattern (see <a href='/AIV/40/11/28'>Matt. 11:28</a>)."
    },
    {
      "pk": 1945029,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 10,
      "text": "You shall live in the land of Goshen, and you shall be near me, you and your children and grandchildren, your flocks, and your herds, and all that you have.",
      "links": "<a href='/AIV/1/47/6'>Gen. 47:6</a>",
      "comment": "Goshen is set apart as a place of blessing and separation—a type of promised land prepared for the faithful."
    },
    {
      "pk": 1945030,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 11,
      "text": "There I will provide for you, for there are five more years of famine yet to come, so that you and your household and all that you have do not come to poverty.",
      "links": "<a href='/AIV/1/41/30'>Gen. 41:30</a>",
      "comment": "Provision mediated by Joseph highlights the importance of God working through chosen leaders to sustain His people."
    },
    {
      "pk": 1945031,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 12,
      "text": "Behold, your eyes see, and the eyes of my brother Benjamin see, that it is my mouth that speaks to you.",
      "links": "<a href='/AIV/1/43/29'>Gen. 43:29</a>",
      "comment": "Joseph’s appeal to direct perception underscores authenticity and authority in his words, anticipating prophetic and apostolic authority."
    },
    {
      "pk": 1945032,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 13,
      "text": "You must tell my father of all my honor in Egypt, and all that you have seen. Hurry and bring my father down here.",
      "links": "<a href='/AIV/1/41/41'>Gen. 41:41</a>",
      "comment": "Joseph’s honor and glory in a foreign land anticipates Christ’s glorification in His resurrection and ascension (<a href='/AIV/50/2/9'>Phil. 2:9</a>)."
    },
    {
      "pk": 1945033,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 14,
      "text": "Then he fell upon his brother Benjamin’s neck and wept, and Benjamin wept upon his neck.",
      "links": "<a href='/AIV/1/33/4'>Gen. 33:4</a>",
      "comment": "The embrace and tears point to deep familial love, analogous to Christ’s compassion for His brethren."
    },
    {
      "pk": 1945034,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 15,
      "text": "Joseph kissed all his brothers and wept upon them. After that his brothers talked with him.",
      "links": "<a href='/AIV/1/33/4'>Gen. 33:4</a>; <a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "Reconciliation is complete as Joseph initiates loving contact. This underscores forgiveness and restored fellowship."
    },
    {
      "pk": 1945035,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 16,
      "text": "When the report was heard in Pharaoh’s house, ‘Joseph’s brothers have come,’ it pleased Pharaoh and his servants.",
      "links": "<a href='/AIV/1/41/38-40'>Gen. 41:38-40</a>",
      "comment": "Pharaoh’s favor reflects the honor God gives to the faithful, and how blessings upon God’s people can affect even civil authorities."
    },
    {
      "pk": 1945036,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 17,
      "text": "Pharaoh said to Joseph, ‘Say to your brothers, “Do this: load your animals and go, return to the land of Canaan,”’",
      "links": "<a href='/AIV/1/12/10'>Gen. 12:10</a>",
      "comment": "Joseph’s mediation with Pharaoh shows the influence of true leaders before rulers, echoing later biblical figures who intercede on behalf of their people."
    },
    {
      "pk": 1945037,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 18,
      "text": "‘Take your father and your families and come to me, and I will give you the best of the land of Egypt, and you will eat the fat of the land.’",
      "links": "<a href='/AIV/1/47/6'>Gen. 47:6</a>",
      "comment": "The ‘best of the land’ is both a literal reward and a spiritual symbol of God's lavish provision, affirming the theme of promised blessing for those who respond in faith."
    },
    {
      "pk": 1945038,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 19,
      "text": "‘And you are commanded to do this: take carts from Egypt for your children and your wives, and bring your father, and come.’",
      "links": "<a href='/AIV/1/46/5'>Gen. 46:5</a>",
      "comment": "Pharaoh’s command facilitates the family’s journey: God often provides both commands and means for His people’s pilgrimage."
    },
    {
      "pk": 1945039,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 20,
      "text": "‘Do not concern yourselves with your possessions, for the best of all the land of Egypt is yours.’",
      "links": "<a href='/AIV/1/47/6'>Gen. 47:6</a>; <a href='/AIV/40/6/31-33'>Matt. 6:31-33</a>",
      "comment": "A call to trust in divine provision above earthly goods, echoing Christ’s teachings against anxiety about material needs."
    },
    {
      "pk": 1945040,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 21,
      "text": "The sons of Israel did so. Joseph gave them carts, as Pharaoh had commanded, and he gave them provisions for the journey.",
      "links": "<a href='/AIV/1/46/5'>Gen. 46:5</a>",
      "comment": "Joseph’s role as provider parallels later images of spiritual leaders providing for the journey of God’s people."
    },
    {
      "pk": 1945041,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 22,
      "text": "To each of them he gave a change of garments, but to Benjamin he gave three hundred pieces of silver and five changes of garments.",
      "links": "<a href='/AIV/1/43/34'>Gen. 43:34</a>",
      "comment": "Garments in Scripture often symbolize new identity and purity, pointing to spiritual renewal. Benjamin receives extra favor, recalling themes of election and grace."
    },
    {
      "pk": 1945042,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 23,
      "text": "To his father he sent as follows: ten donkeys loaded with the best things of Egypt, and ten female donkeys loaded with grain, bread, and provisions for his father on the journey.",
      "links": "<a href='/AIV/1/27/28'>Gen. 27:28</a>",
      "comment": "Joseph’s abundant gifts to Jacob recall patriarchal blessings and God’s faithfulness to His covenant promises."
    },
    {
      "pk": 1945043,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 24,
      "text": "Then he sent his brothers away, and as they departed, he said to them, ‘Do not quarrel on the way.’",
      "links": "<a href='/AIV/46/1/10'>1 Cor. 1:10</a>",
      "comment": "Joseph’s exhortation for peace points to Christ’s charge to His disciples to love one another—a key mark of Christian unity."
    },
    {
      "pk": 1945044,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 25,
      "text": "So they went up from Egypt and came to the land of Canaan, to their father Jacob.",
      "links": "<a href='/AIV/1/42/1'>Gen. 42:1'; <a href='/AIV/1/46/6'>Gen. 46:6</a>",
      "comment": "The return journey begins the fulfilment of Joseph’s promise, pointing to the motif of restoration after exile."
    },
    {
      "pk": 1945045,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 26,
      "text": "And they told him, ‘Joseph is still alive, and he is ruler over all the land of Egypt.’ But Jacob’s heart grew numb, for he did not believe them.",
      "links": "<a href='/AIV/1/37/35'>Gen. 37:35</a>; <a href='/AIV/42/24/11'>Luke 24:11</a>",
      "comment": "Jacob’s initial disbelief mirrors the disciples’ response to the resurrection. Faith in the seemingly impossible is required for salvation."
    },
    {
      "pk": 1945046,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 27,
      "text": "But when they told him all the words of Joseph, which he had said to them, and when he saw the carts that Joseph had sent to carry him, the spirit of their father Jacob revived.",
      "links": "<a href='/AIV/1/37/35'>Gen. 37:35</a>; <a href='/AIV/42/24/32'>Luke 24:32</a>",
      "comment": "Jacob’s spirit ‘reviving’ prefigures the joy and renewal of faith that follows recognition of the truth, paralleling spiritual renewal brought by the Gospel."
    },
    {
      "pk": 1945047,
      "translation": "AIV",
      "book": 1,
      "chapter": 45,
      "verse": 28,
      "text": "And Israel said, ‘It is enough; my son Joseph is alive. I will go and see him before I die.’",
      "links": "<a href='/AIV/1/46/4'>Gen. 46:4</a>",
      "comment": "Jacob’s response captures the fulfillment of hope and the desire for physical reunion, which anticipates hope in bodily resurrection and the final gathering of God’s people."
    }
  ],
  "translatedAt": "2025-12-23T08:58:49.418Z"
}