{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 19,
  "verses": [
    {
      "pk": 1019001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 1,
      "text": "The two angels came to Sodom in the evening, and Lot was sitting at the gate of Sodom. When Lot saw them, he rose to meet them and bowed himself with his face to the ground.",
      "links": "<a href='/AIV/1/18/1'>Gen. 18:1</a>; <a href='/AIV/1/18/22'>Gen. 18:22</a>",
      "comment": "Meeting at the city gate was a sign of Lot’s involvement in the city's affairs. Hospitality to strangers is emphasized, foreshadowing scriptural commands for charity (see Heb. 13:2). Angels appearing in human form also points forward to divine interventions throughout salvation history."
    },
    {
      "pk": 1019002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 2,
      "text": "He said, 'My lords, please turn aside to your servant’s house, and spend the night and wash your feet. Then you may rise early and go on your way.' They said, 'No; we will spend the night in the square.'",
      "links": "<a href='/AIV/1/24/32'>Gen. 24:32</a>; <a href='/AIV/7/19/15'>Judg. 19:15'</a>",
      "comment": "Lot humbly offers hospitality, a virtue of high value among the patriarchs (see also Gen. 18:3-5). The angels' initial refusal echoes tests of hospitality in Scripture and the importance of freely given charity."
    },
    {
      "pk": 1019003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 3,
      "text": "But he insisted strongly; so they turned aside to him and entered his house. He made them a feast and baked unleavened bread, and they ate.",
      "links": "<a href='/AIV/2/12/8'>Exod. 12:8</a>; <a href='/AIV/1/18/6'>Gen. 18:6</a>",
      "comment": "Lot’s insistent hospitality echoes Abraham’s and foreshadows the Passover by offering unleavened bread, indicating urgency and anticipation (Exod. 12:8)."
    },
    {
      "pk": 1019004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 4,
      "text": "But before they lay down, the men of the city, the men of Sodom, surrounded the house, both young and old, all the people to the last man.",
      "links": "<a href='/AIV/7/19/22'>Judg. 19:22</a>; <a href='/AIV/19/12/1'>Ps. 12:1</a>",
      "comment": "This mass gathering shows the widespread corruption of Sodom—sin involving entire communities, not just individuals, is a recurring theme in Scripture."
    },
    {
      "pk": 1019005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 5,
      "text": "They called out to Lot, 'Where are the men who came to you tonight? Bring them out to us, so that we may know them.'",
      "links": "<a href='/AIV/7/19/22'>Judg. 19:22</a>",
      "comment": "The phrase 'know them' here is a euphemism for sexual relations (see Judg. 19:22). The extreme wickedness of Sodom is made clear, and the narrative forms a background for later moral teachings."
    },
    {
      "pk": 1019006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 6,
      "text": "Lot went out to the men at the entrance and shut the door after him.",
      "links": "<a href='/AIV/1/7/16'>Gen. 7:16</a>",
      "comment": "Lot acts to protect his guests, placing himself between them and the mob. His actions mirror the responsibility of righteous leaders to safeguard those under their care."
    },
    {
      "pk": 1019007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 7,
      "text": "He said, 'Please, my brothers, do not act so wickedly.'",
      "links": "<a href='/AIV/1/39/9'>Gen. 39:9</a>",
      "comment": "Lot appeals to a basic moral law inscribed on every heart. The language is strong, emphasizing the gravity of the intended sin."
    },
    {
      "pk": 1019008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 8,
      "text": "Look, I have two daughters who have not known a man. Let me bring them out to you, and you may do to them as you please. Only do nothing to these men, since they have come under the shadow of my roof.'",
      "links": "<a href='/AIV/7/19/24'>Judg. 19:24</a>",
      "comment": "Lot’s offer, though shocking, reflects the severe code of hospitality in ancient times. The text does not condone Lot’s proposal, but relates the story’s moral complexity, emphasizing how grave the sin of Sodom was."
    },
    {
      "pk": 1019009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 9,
      "text": "But they said, 'Stand back!' And they said, 'This fellow came to sojourn, and he has become the judge! Now we will deal worse with you than with them.' Then they pressed hard against the man Lot, and drew near to break the door down.",
      "links": "<a href='/AIV/2/2/14'>Exod. 2:14</a>",
      "comment": "Lot’s moral authority is rejected by the Sodomites, a recurring pattern for the righteous in a corrupt society. The escalation shows the destructive force of communal sin."
    },
    {
      "pk": 1019010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 10,
      "text": "But the men reached out their hands and brought Lot into the house with them and shut the door.",
      "links": "<a href='/AIV/1/7/16'>Gen. 7:16</a>",
      "comment": "The angels intervene, defending Lot. Divine deliverance is a recurring theme, showing God protects those who seek righteousness."
    },
    {
      "pk": 1019011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 11,
      "text": "And they struck the men who were at the entrance of the house, both small and great, with blindness, so that they wearied themselves groping for the door.",
      "links": "<a href='/AIV/2/4/11'>Exod. 4:11</a>; <a href='/AIV/12/6/18'>2 Kings 6:18</a>",
      "comment": "Divine judgment is immediate, and the miraculous blinding anticipates later acts of God’s power to protect His people. Spiritual blindness is also symbolized here (see John 9:39–41)."
    },
    {
      "pk": 1019012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 12,
      "text": "Then the men said to Lot, 'Have you anyone else here? Sons-in-law, sons, daughters, or anyone you have in the city—bring them out of the place.'",
      "links": "<a href='/AIV/1/6/18'>Gen. 6:18</a>; <a href='/AIV/2/12/37'>Exod. 12:37</a>",
      "comment": "Before destruction, God provides for the salvation of the righteous and their households—a prefiguring of salvation offered in Christ to those united to His household."
    },
    {
      "pk": 1019013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 13,
      "text": "For we are about to destroy this place, because the cry against its people has grown great before the LORD, and the LORD has sent us to destroy it.'",
      "links": "<a href='/AIV/1/18/20'>Gen. 18:20</a>; <a href='/AIV/1/4/10'>Gen. 4:10</a>",
      "comment": "Righteous judgment follows persistent sin. The 'cry' recalls the biblical motif that the oppressed and innocent call out to God (Gen. 4:10; 18:20). Angels act with God’s delegated authority."
    },
    {
      "pk": 1019014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 14,
      "text": "So Lot went out and spoke to his sons-in-law, who were to marry his daughters, and said, 'Up! Get out of this place, for the LORD is about to destroy the city.' But he seemed to his sons-in-law to be joking.",
      "links": "<a href='/AIV/1/41/32'>Gen. 41:32</a>; <a href='/AIV/1/6/17'>Gen. 6:17</a>",
      "comment": "Lot’s warning is met with ridicule—a reminder that the message of salvation is not always believed when first proclaimed. This foreshadows the way many treat prophetic warnings."
    },
    {
      "pk": 1019015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 15,
      "text": "When morning dawned, the angels urged Lot, saying, 'Up! Take your wife and your two daughters who are here, lest you be swept away in the punishment of the city.'",
      "links": "<a href='/AIV/1/7/1'>Gen. 7:1</a>",
      "comment": "Destruction will not fall until the righteous are rescued, echoing themes of divine mercy before judgment."
    },
    {
      "pk": 1019016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 16,
      "text": "But he lingered. So the men seized him and his wife and his two daughters by the hand, the LORD being merciful to him, and they brought him out and set him outside the city.",
      "links": "<a href='/AIV/1/6/8'>Gen. 6:8</a>; <a href='/AIV/2/33/19'>Exod. 33:19</a>",
      "comment": "God’s mercy even covers Lot’s hesitation—a demonstration of grace acting on behalf of the weak. This foreshadows the necessity of perseverance in the faith and God’s initiative."
    },
    {
      "pk": 1019017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 17,
      "text": "And as they brought them out, one said, 'Escape for your life. Do not look back or stop anywhere in the valley. Escape to the hills, lest you be swept away.'",
      "links": "<a href='/AIV/1/19/26'>Gen. 19:26</a>; <a href='/AIV/42/17/31-32'>Luke 17:31–32</a>",
      "comment": "Not looking back symbolizes detachment from sin and worldliness, a command echoed by Christ (Luke 17:32). The hills offer safety, prefiguring God as refuge (Ps. 121:1)."
    },
    {
      "pk": 1019018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 18,
      "text": "And Lot said to them, 'Oh, no, my lords.'",
      "links": "",
      "comment": "Lot’s hesitation reveals his weakness. Compare with Abraham’s confident faith. The contrast is a subtle call to a more complete trust in divine guidance."
    },
    {
      "pk": 1019019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 19,
      "text": "Behold, your servant has found favor in your sight, and you have shown me great kindness in saving my life. But I cannot escape to the hills, lest the disaster overtake me and I die.",
      "links": "<a href='/AIV/1/6/8'>Gen. 6:8</a>",
      "comment": "Lot’s sense of inadequacy highlights human frailty. The narrative subtly teaches reliance on God’s grace, which completes our natural weaknesses."
    },
    {
      "pk": 1019020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 20,
      "text": "Look, there is a city near enough to flee to, and it is a little one. Let me escape there— is it not a little one?— and my life will be saved!'",
      "links": "",
      "comment": "Lot requests a lesser deliverance, and it is granted out of mercy, implying God’s adaptability to our needs when we seek His help."
    },
    {
      "pk": 1019021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 21,
      "text": "He said to him, 'Behold, I grant you this favor also, that I will not overthrow the city of which you have spoken.'",
      "links": "<a href='/AIV/1/18/26'>Gen. 18:26</a>",
      "comment": "A direct response to prayer shows God’s responsiveness to intercession, a principle developed throughout both Old and New Testaments."
    },
    {
      "pk": 1019022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 22,
      "text": "Hurry, escape there, for I can do nothing till you arrive there.' Therefore the name of the city was called Zoar.",
      "links": "<a href='/AIV/1/14/2'>Gen. 14:2</a>",
      "comment": "Human cooperation with God is required for salvation to be effected. The city Zoar means ‘little,’ underscoring humility before God."
    },
    {
      "pk": 1019023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 23,
      "text": "The sun had risen on the earth when Lot came to Zoar.",
      "links": "",
      "comment": "The rising sun marks a new beginning—echoing God's creative and redemptive acts at the dawn of a new day."
    },
    {
      "pk": 1019024,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 24,
      "text": "Then the LORD rained on Sodom and Gomorrah sulfur and fire from the LORD out of heaven.",
      "links": "<a href='/AIV/1/13/10'>Gen. 13:10</a>; <a href='/AIV/5/29/23'>Deut. 29:23</a>; <a href='/AIV/42/17/29'>Luke 17:29</a>; <a href='/AIV/2/9/23'>Exod. 9:23'</a>",
      "comment": "Judgment falls from heaven, signifying God’s direct intervention against persistent sin. This event is referenced throughout biblical history as a warning and a symbol of final judgment."
    },
    {
      "pk": 1019025,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 25,
      "text": "He overthrew those cities, and all the valley, and all the inhabitants of the cities, and what grew on the ground.",
      "links": "<a href='/AIV/5/29/23'>Deut. 29:23</a>",
      "comment": "Total destruction is a biblical sign of the seriousness of sin. The entire landscape is changed, marking a new beginning for those spared."
    },
    {
      "pk": 1019026,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 26,
      "text": "But Lot’s wife, behind him, looked back, and she became a pillar of salt.",
      "links": "<a href='/AIV/42/17/32'>Luke 17:32</a>",
      "comment": "Looking back was an act of disobedience and attachment to sin; Jesus refers to this as a warning to all disciples (Luke 17:32). The transformation into salt is a powerful symbol of the consequences of hesitating in faith."
    },
    {
      "pk": 1019027,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 27,
      "text": "And Abraham went early in the morning to the place where he had stood before the LORD.",
      "links": "<a href='/AIV/1/18/22'>Gen. 18:22</a>",
      "comment": "Abraham’s diligence in prayer and intercession exemplifies the role of a righteous intercessor. The scene links back to his prayer in chapter 18, emphasizing the power and importance of intercessory prayer."
    },
    {
      "pk": 1019028,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 28,
      "text": "And he looked down toward Sodom and Gomorrah and toward all the land of the valley, and he saw, and behold, the smoke of the land went up like the smoke of a furnace.",
      "links": "<a href='/AIV/1/15/17'>Gen. 15:17</a>; <a href='/AIV/66/18/9'>Rev. 18:9</a>",
      "comment": "The image of smoke rising is used throughout the Bible to symbolize judgment (Rev. 18:9). Abraham’s witness to justice being done signifies God’s faithfulness to His promises."
    },
    {
      "pk": 1019029,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 29,
      "text": "So it was that, when God destroyed the cities of the valley, God remembered Abraham and sent Lot out of the midst of the overthrow, when he overthrew the cities in which Lot had lived.",
      "links": "<a href='/AIV/1/8/1'>Gen. 8:1</a>; <a href='/AIV/1/18/23'>Gen. 18:23</a>",
      "comment": "Lot’s rescue is attributed to God’s remembrance of Abraham, highlighting the power of the prayer of the righteous and the importance of spiritual intercession on behalf of others."
    },
    {
      "pk": 1019030,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 30,
      "text": "Now Lot went up out of Zoar and lived in the hills with his two daughters, for he was afraid to live in Zoar. So he lived in a cave with his two daughters.",
      "links": "<a href='/AIV/1/19/17'>Gen. 19:17</a>",
      "comment": "Lot’s final retreat to the hills completes the command of the angels (v. 17). The narrative underlines the repeated hesitancies and the need to ultimately rely on God’s plan, not self-made solutions."
    },
    {
      "pk": 1019031,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 31,
      "text": "And the firstborn said to the younger, 'Our father is old, and there is not a man on earth to come in to us after the manner of all the earth.'",
      "links": "<a href='/AIV/1/9/1'>Gen. 9:1</a>",
      "comment": "The daughters’ perception echoes the concern for lineage preservation seen throughout Genesis. Their reaction is based on desperation, revealing both the trauma and the cultural context."
    },
    {
      "pk": 1019032,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 32,
      "text": "Come, let us make our father drink wine, and we will lie with him, that we may preserve offspring from our father.'",
      "links": "<a href='/AIV/1/9/21'>Gen. 9:21</a>",
      "comment": "Wine is again instrumental in an act of shame (see Noah in Gen. 9:21). The account underscores that even the righteous are subject to familial disorder, highlighting humanity’s need for redemption."
    },
    {
      "pk": 1019033,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 33,
      "text": "So they made their father drink wine that night. And the firstborn went in and lay with her father. He was not aware when she lay down or when she arose.",
      "links": "",
      "comment": "Lot’s intoxication, like Noah’s, illustrates the potential for moral disaster through loss of self-control. The Bible does not endorse these acts but presents them honestly to show the need for grace and healing."
    },
    {
      "pk": 1019034,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 34,
      "text": "The next day, the firstborn said to the younger, 'Behold, I lay last night with my father. Let us make him drink wine tonight also. Then you go in and lie with him, that we may preserve offspring from our father.'",
      "links": "",
      "comment": "The narrative’s frankness shows both the desperation of the daughters and the devotion to family continuity, a crucial theme throughout Genesis."
    },
    {
      "pk": 1019035,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 35,
      "text": "So they made their father drink wine that night also, and the younger arose and lay with him. He did not know when she lay down or when she arose.",
      "links": "",
      "comment": "This sad repetition emphasizes the cyclical effect of sin. Yet, from even these circumstances, God’s providence will still bring about future nations (see Matt. 1:5, Ruth’s ancestry)."
    },
    {
      "pk": 1019036,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 36,
      "text": "Thus both the daughters of Lot became pregnant by their father.",
      "links": "",
      "comment": "The outcome, although involving grave sin, shows God’s permissive will at work, from which the Moabite and Ammonite peoples descend (see Deut. 2:9,19). This genealogy plays a role in the whole plan of salvation."
    },
    {
      "pk": 1019037,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 37,
      "text": "The firstborn bore a son and called his name Moab; he is the father of the Moabites to this day.",
      "links": "<a href='/AIV/4/22/3'>Num. 22:3</a>; <a href='/AIV/8/1/4'>Ruth 1:4</a>",
      "comment": "Moab’s name is preserved, and his descendants play a role in the history of Israel—most notably through Ruth (Ruth 1:4), from whom King David descends. God’s plan works even through flawed humanity."
    },
    {
      "pk": 1019038,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 19,
      "verse": 38,
      "text": "The younger also bore a son and called his name Ben-ammi; he is the father of the Ammonites to this day.",
      "links": "<a href='/AIV/5/2/19'>Deut. 2:19</a>",
      "comment": "The origin of the Ammonites is recorded, nations that later interact with Israel. Through all history, God’s providence makes use of even difficult beginnings for greater purposes."
    }
  ],
  "translatedAt": "2025-12-24T00:20:16.770Z"
}