{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 40,
  "verses": [
    {
      "pk": 1400001,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 1,
      "text": "After these things, the cupbearer of the king of Egypt and his baker offended their lord, the king of Egypt.",
      "links": "<a href='/AIV/1/39/1'>Gen. 39:1</a>",
      "comment": "This verse shifts the narrative to the events in prison, showing God’s providence as it unfolds in Joseph’s story."
    },
    {
      "pk": 1400002,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 2,
      "text": "Pharaoh became angry with his two officials, the chief cupbearer and the chief baker.",
      "links": "<a href='/AIV/1/40/21'>Gen. 40:21</a>",
      "comment": "Egyptian officials held important ceremonial positions; this anger sets the stage for Joseph's involvement."
    },
    {
      "pk": 1400003,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 3,
      "text": "He put them in custody in the house of the captain of the guard, in the prison, the same place where Joseph was confined.",
      "links": "<a href='/AIV/1/39/20'>Gen. 39:20</a>",
      "comment": "Notice how God brings the officials to the very place Joseph awaits, directing events for His purposes. Compare with Joseph’s faithfulness even in hardship."
    },
    {
      "pk": 1400004,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 4,
      "text": "The captain of the guard assigned Joseph to them, and he attended them. They remained in custody for some time.",
      "links": "<a href='/AIV/1/39/22'>Gen. 39:22</a>",
      "comment": "Joseph’s role prefigures Christ’s humble service to others (see <a href='/AIV/41/10/45'>Mark 10:45</a>)."
    },
    {
      "pk": 1400005,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 5,
      "text": "Both of them, the cupbearer and the baker of the king of Egypt who were confined in the prison, had a dream on the same night, and each dream had its own meaning.",
      "links": "<a href='/AIV/1/41/1'>Gen. 41:1</a>; <a href='/AIV/1/37/5'>Gen. 37:5</a>",
      "comment": "Dreams are a recurring means by which God reveals His will (see <a href='/AIV/40/1/20'>Matt. 1:20</a>)."
    },
    {
      "pk": 1400006,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 6,
      "text": "When Joseph came to them in the morning, he saw that they were troubled.",
      "links": "<a href='/AIV/1/40/7'>Gen. 40:7</a>",
      "comment": "Joseph’s compassion foreshadows the concern of Christ for the suffering."
    },
    {
      "pk": 1400007,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 7,
      "text": "So he asked Pharaoh’s officials, who were in custody with him in his master’s house, “Why do you look so downcast today?”",
      "links": "",
      "comment": "Joseph’s attentiveness distinguishes him among the prisoners and suggests a leadership spirit."
    },
    {
      "pk": 1400008,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 8,
      "text": "They answered him, “We have each had a dream, and there is no one to interpret them.” Joseph said to them, “Do not interpretations belong to God? Please, tell them to me.”",
      "links": "<a href='/AIV/1/41/16'>Gen. 41:16</a>; <a href='/AIV/27/2/28'>Dan. 2:28</a>",
      "comment": "Joseph acknowledges God alone gives spiritual understanding, a view later affirmed in prophetic and apostolic ministries (<a href='/AIV/46/12/7-10'>1 Cor. 12:7-10</a>)."
    },
    {
      "pk": 1400009,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 9,
      "text": "So the chief cupbearer told his dream to Joseph and said to him, “In my dream, there was a vine before me,",
      "links": "",
      "comment": "The imagery of the vine will be echoed in Christ's metaphor in John 15:1—‘I am the true vine’."
    },
    {
      "pk": 1400010,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 10,
      "text": "and on the vine there were three branches. As it budded, its blossoms shot forth and its clusters ripened into grapes.",
      "links": "",
      "comment": "The fruitfulness of the vine can recall God’s blessing throughout Genesis."
    },
    {
      "pk": 1400011,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 11,
      "text": "Pharaoh’s cup was in my hand, and I took the grapes and pressed them into Pharaoh’s cup and gave the cup into Pharaoh’s hand.”",
      "links": "",
      "comment": "Giving the cup anticipates themes of service and restoration (see <a href='/AIV/40/26/27'>Matt. 26:27</a>)."
    },
    {
      "pk": 1400012,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 12,
      "text": "Then Joseph said to him, “This is its interpretation: The three branches are three days.",
      "links": "<a href='/AIV/1/41/12-13'>Gen. 41:12-13</a>",
      "comment": "Note the precision of Joseph’s interpretations, signifying divine revelation."
    },
    {
      "pk": 1400013,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 13,
      "text": "Within three days Pharaoh will lift up your head and restore you to your position. You will put Pharaoh’s cup into his hand just as you used to, when you were his cupbearer.",
      "links": "<a href='/AIV/1/40/21'>Gen. 40:21</a>",
      "comment": "This restoration prefigures the theme of return and redemption, central in both Old and New Testaments."
    },
    {
      "pk": 1400014,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 14,
      "text": "But remember me when it is well with you, and please show kindness to me; mention me to Pharaoh and get me out of this house.",
      "links": "<a href='/AIV/1/41/9-14'>Gen. 41:9-14</a>",
      "comment": "Joseph’s request stresses human intercession, hinting at the spiritual value of remembering the suffering in prayer and deed."
    },
    {
      "pk": 1400015,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 15,
      "text": "For I was indeed stolen out of the land of the Hebrews, and here also I have done nothing for which they should put me into the pit.”",
      "links": "<a href='/AIV/1/37/28'>Gen. 37:28</a>; <a href='/AIV/1/39/20'>Gen. 39:20</a>",
      "comment": "Joseph’s innocence echoes the motif of the righteous sufferer, fulfilled ultimately in Christ (see <a href='/AIV/44/8/33'>Acts 8:33</a>)."
    },
    {
      "pk": 1400016,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 16,
      "text": "When the chief baker saw that the interpretation was favorable, he said to Joseph, “I also had a dream: There were three baskets of white bread on my head,",
      "links": "",
      "comment": "The baker’s expectation reveals trust in Joseph’s God-given wisdom."
    },
    {
      "pk": 1400017,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 17,
      "text": "and in the top basket there were all kinds of baked food for Pharaoh, but the birds were eating them out of the basket on my head.”",
      "links": "",
      "comment": "In Scripture, birds can symbolize judgment or even evil (see <a href='/AIV/24/15/3'>Jer. 15:3</a>)."
    },
    {
      "pk": 1400018,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 18,
      "text": "And Joseph answered, “This is its interpretation: The three baskets are three days.",
      "links": "<a href='/AIV/1/40/12'>Gen. 40:12</a>",
      "comment": "Parallel to the prior dream, God grants clarity through Joseph’s interpretation."
    },
    {
      "pk": 1400019,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 19,
      "text": "Within three days Pharaoh will lift off your head from you and hang you on a tree. And the birds will eat the flesh from you.”",
      "links": "<a href='/AIV/1/40/22'>Gen. 40:22</a>",
      "comment": "Severe judgment follows unfaithfulness, reminding us of sin’s consequences and the necessity for repentance."
    },
    {
      "pk": 1400020,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 20,
      "text": "On the third day, which was Pharaoh’s birthday, he made a feast for all his servants and lifted up the head of the chief cupbearer and the head of the chief baker among his servants.",
      "links": "<a href='/AIV/1/40/2-4'>Gen. 40:2-4</a>",
      "comment": "Feasts often signify important turning points in salvation history (<a href='/AIV/42/22/19'>Luke 22:19</a>)."
    },
    {
      "pk": 1400021,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 21,
      "text": "He restored the chief cupbearer to his position, and he placed the cup into Pharaoh’s hand.",
      "links": "<a href='/AIV/1/40/13'>Gen. 40:13</a>",
      "comment": "Restoration points to hope and forgiveness, themes central to God’s dealings with humanity."
    },
    {
      "pk": 1400022,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 22,
      "text": "But he hanged the chief baker, as Joseph had interpreted to them.",
      "links": "<a href='/AIV/1/40/19'>Gen. 40:19</a>",
      "comment": "Justice is carried out as foretold, revealing the reliability of God’s word through His chosen servant."
    },
    {
      "pk": 1400023,
      "translation": "AIV",
      "book": 1,
      "chapter": 40,
      "verse": 23,
      "text": "Yet the chief cupbearer did not remember Joseph, but forgot him.",
      "links": "<a href='/AIV/1/41/9'>Gen. 41:9</a>",
      "comment": "Joseph’s abandonment foreshadows Christ’s experience of being forgotten and betrayed (see <a href='/AIV/40/26/56'>Matt. 26:56</a>). God’s providence continues, despite human forgetfulness."
    }
  ],
  "translatedAt": "2025-12-23T08:55:26.873Z"
}