{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 8,
  "verses": [
    {
      "pk": 1008001,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 1,
      "text": "But God remembered Noah, and all the wild animals and all the livestock that were with him in the ark. And God made a wind blow over the earth, and the waters receded.",
      "links": "<a href='/AIV/1/6/19'>Gen. 6:19</a>; <a href='/AIV/2/14/21'>Ex. 14:21</a>",
      "comment": "The phrase 'God remembered Noah' emphasizes God's faithfulness to His covenant. The mention of wind echoes the Spirit's movement in creation (Gen. 1:2), signifying both judgment and renewal."
    },
    {
      "pk": 1008002,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 2,
      "text": "The fountains of the deep and the windows of the heavens were closed, the rain from the heavens was restrained,",
      "links": "<a href='/AIV/1/7/11'>Gen. 7:11</a>; <a href='/AIV/19/104/9'>Ps. 104:9</a>",
      "comment": "This verse mirrors the onset of the flood in Gen. 7:11, now reversed, showing God’s sovereignty over nature. The structure emphasizes God's orderly control."
    },
    {
      "pk": 1008003,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 3,
      "text": "and the waters gradually receded from the earth. At the end of one hundred and fifty days the waters had abated,",
      "links": "<a href='/AIV/1/7/24'>Gen. 7:24</a>",
      "comment": "The precision of the timeline underscores the orderly process of God's restoration, reflecting themes of new creation after judgment."
    },
    {
      "pk": 1008004,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 4,
      "text": "and in the seventh month, on the seventeenth day of the month, the ark came to rest on the mountains of Ararat.",
      "links": "<a href='/AIV/1/7/11'>Gen. 7:11</a>; <a href='/AIV/11/17/6'>1 Kings 17:6</a>",
      "comment": "Specific dating highlights the historical memory of deliverance. The resting of the ark hints at God's provision—a spiritual prefiguration of finding rest after tribulation."
    },
    {
      "pk": 1008005,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 5,
      "text": "And the waters continued to decrease until the tenth month; in the tenth month, on the first day of the month, the tops of the mountains were seen.",
      "links": "<a href='/AIV/1/7/19'>Gen. 7:19</a>",
      "comment": "Visible land is a sign of hope—the beginning of renewal, reminiscent of God’s bringing order out of chaos (Gen. 1)."
    },
    {
      "pk": 1008006,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 6,
      "text": "At the end of forty days, Noah opened the window of the ark that he had made",
      "links": "<a href='/AIV/1/7/4'>Gen. 7:4</a>",
      "comment": "‘Forty days’ symbolizes a period of testing and preparation, seen also later in Israel’s journey and in Jesus’ time in the wilderness (<a href='/AIV/40/4/2'>Matt. 4:2</a>)."
    },
    {
      "pk": 1008007,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 7,
      "text": "and sent forth a raven. It went back and forth until the waters were dried up from the earth.",
      "links": "<a href='/AIV/1/8/8'>Gen. 8:8</a>",
      "comment": "The raven’s return signifies ongoing unrest—contrasted with the later sending of the dove, a recurring spiritual symbol of peace and the Holy Spirit."
    },
    {
      "pk": 1008008,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 8,
      "text": "Then he sent out a dove from him, to see if the waters had subsided from the surface of the ground.",
      "links": "<a href='/AIV/1/8/10'>Gen. 8:10</a>; <a href='/AIV/40/3/16'>Matt. 3:16</a>",
      "comment": "The dove, often depicted as a symbol of the Spirit, will also descend at Jesus’ baptism. Spiritual renewal is both individual and cosmic in scripture."
    },
    {
      "pk": 1008009,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 9,
      "text": "But the dove found no place to rest her foot, and she returned to him in the ark, for the waters were still over all the surface of the earth. So he put out his hand and took her and brought her into the ark with him.",
      "links": "<a href='/AIV/1/1/2'>Gen. 1:2</a>; <a href='/AIV/1/8/21'>Gen. 8:21</a>",
      "comment": "A new creation motif: the Spirit (dove) hovers over the waters, recalling Gen. 1:2. Noah’s care prefigures a shepherding role—one who gathers, protects, and preserves."
    },
    {
      "pk": 1008010,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 10,
      "text": "He waited another seven days, and again he sent out the dove from the ark.",
      "links": "<a href='/AIV/1/8/12'>Gen. 8:12</a>; <a href='/AIV/2/20/10'>Ex. 20:10</a>",
      "comment": "A seven-day period signals God’s rhythm of patience and renewal, paralleling the week of creation. The cycle is deliberate and ordered."
    },
    {
      "pk": 1008011,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 11,
      "text": "And the dove came to him at evening, and behold, in her mouth was a freshly plucked olive leaf. So Noah knew that the waters had subsided from the earth.",
      "links": "<a href='/AIV/19/52/8'>Ps. 52:8</a>; <a href='/AIV/45/5/1-11'>Rom. 5:1-11</a>",
      "comment": "The olive leaf is a sign of peace and new beginnings. In spiritual interpretation, the olive leaf foreshadows baptism—a sacramental sign of washing and renewal (see Rom. 6:4)."
    },
    {
      "pk": 1008012,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 12,
      "text": "Then he waited another seven days and sent out the dove again, and she did not return to him anymore.",
      "links": "<a href='/AIV/1/8/10'>Gen. 8:10</a>",
      "comment": "The dove’s final departure signals the new earth’s readiness, pointing towards spiritual maturity and fulfillment after a time of preparation and waiting."
    },
    {
      "pk": 1008013,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 13,
      "text": "In the six hundred and first year, in the first month, on the first day of the month, the waters had dried up from the earth. And Noah removed the covering of the ark and looked, and behold, the surface of the ground was dry.",
      "links": "<a href='/AIV/1/7/11'>Gen. 7:11</a>; <a href='/AIV/2/12/2'>Ex. 12:2</a>",
      "comment": "A new beginning, with precise dating suggesting a foundational event—the start for restored humanity, similar to Israel’s new calendar in Exodus."
    },
    {
      "pk": 1008014,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 14,
      "text": "In the second month, on the twenty-seventh day of the month, the earth was completely dry.",
      "links": "<a href='/AIV/1/7/11'>Gen. 7:11</a>",
      "comment": "The process is thorough and careful—an example of God’s timing and providence, seen throughout salvation history."
    },
    {
      "pk": 1008015,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 15,
      "text": "Then God spoke to Noah, saying,",
      "links": "<a href='/AIV/1/6/13'>Gen. 6:13</a>",
      "comment": "Divine communication re-establishes relationship. God initiates, Noah listens—a model for how God’s people await His direction before acting."
    },
    {
      "pk": 1008016,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 16,
      "text": "\"Go out of the ark, you and your wife, and your sons and your sons’ wives with you.",
      "links": "<a href='/AIV/1/7/1'>Gen. 7:1</a>",
      "comment": "Redemption is communal—Noah’s whole family shares in deliverance, prefiguring salvation given through a household of faith."
    },
    {
      "pk": 1008017,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 17,
      "text": "Bring out with you every living thing that is with you of all flesh—birds, animals, and every creeping thing that creeps on the earth—so that they may multiply on the earth, and be fruitful and increase on the earth.\"",
      "links": "<a href='/AIV/1/1/22'>Gen. 1:22</a>; <a href='/AIV/1/9/1'>Gen. 9:1</a>",
      "comment": "The command to ‘be fruitful and multiply’ echoes the blessing of creation in Gen. 1, suggesting God’s ongoing purpose for the world’s flourishing."
    },
    {
      "pk": 1008018,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 18,
      "text": "So Noah went out, and his sons and his wife and his sons’ wives with him.",
      "links": "<a href='/AIV/1/7/7'>Gen. 7:7</a>",
      "comment": "Noah obeys without hesitation—a model of trust. The salvation provided extends to the family, alluding to the spiritual reality that faith is lived in community."
    },
    {
      "pk": 1008019,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 19,
      "text": "Every beast, every creeping thing, and every bird, everything that moves on the earth, went out by families from the ark.",
      "links": "<a href='/AIV/1/6/20'>Gen. 6:20</a>",
      "comment": "Restored order out of chaos: all creatures leave by their ‘families’, showing God’s intention to bless and organize creation as in the original order."
    },
    {
      "pk": 1008020,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 20,
      "text": "Then Noah built an altar to the Lord and took some of every clean animal and some of every clean bird, and offered burnt offerings on the altar.",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/2/20/24'>Ex. 20:24</a>",
      "comment": "Noah’s first act is worship. Building an altar prefigures the sacramental aspect of approaching God through offering and thanksgiving, a pattern seen throughout salvation history."
    },
    {
      "pk": 1008021,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 21,
      "text": "And when the Lord smelled the pleasing aroma, the Lord said in His heart, “I will never again curse the ground because of man, for the intention of man’s heart is evil from his youth. Nor will I ever again destroy every living thing as I have done.",
      "links": "<a href='/AIV/1/3/17'>Gen. 3:17</a>; <a href='/AIV/19/51/5'>Ps. 51:5</a>",
      "comment": "God’s acceptance of the sacrifice marks a turning point. The recognition of man’s fallen state, yet God’s promise of mercy, hints at grace that anticipates complete sacrificial fulfillment in Christ (<a href='/AIV/58/10/10'>Heb. 10:10</a>)."
    },
    {
      "pk": 1008022,
      "translation": "AIV",
      "book": 1,
      "chapter": 8,
      "verse": 22,
      "text": "\"While the earth remains, seedtime and harvest, cold and heat, summer and winter, day and night, shall not cease.\"",
      "links": "<a href='/AIV/19/104/19-23'>Ps. 104:19–23</a>",
      "comment": "God’s faithfulness is affirmed—He upholds creation’s order, ensuring the continuation of life. This promise undergirds the reliability of the natural and spiritual order, a foundation for hope."
    }
  ],
  "translatedAt": "2025-12-23T08:38:04.268Z"
}