{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 31,
  "verses": [
    {
      "pk": 1933101,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 1,
      "text": "Now Jacob heard the words of Laban’s sons, saying, “Jacob has taken all that was our father’s, and from what was our father’s he has gained all this wealth.”",
      "links": "<a href='/AIV/1/30/43'>Gen. 30:43</a>",
      "comment": "This verse sets the context for Jacob's departure, as envy and accusation arise. This echoes similar circumstances seen throughout salvation history, where God’s chosen servant is misunderstood or envied, foreshadowing later biblical events."
    },
    {
      "pk": 1933102,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 2,
      "text": "And Jacob saw that the face of Laban was not favorable toward him as before.",
      "links": "<a href='/AIV/1/4/5'>Gen. 4:5</a>",
      "comment": "The Hebrew implies a visible sense of animosity. Unfavorable relationships often precede God’s call to movement or mission."
    },
    {
      "pk": 1933103,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 3,
      "text": "Then the LORD said to Jacob, “Return to the land of your fathers, and to your relatives, and I will be with you.”",
      "links": "<a href='/AIV/1/28/15'>Gen. 28:15</a>; <a href='/AIV/1/12/1'>Gen. 12:1</a>",
      "comment": "God’s assurance of his presence recalls His covenant promises to Abraham and Isaac. Obedience to God often requires going forth in trust."
    },
    {
      "pk": 1933104,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 4,
      "text": "So Jacob sent and called Rachel and Leah to the field to his flock.",
      "links": "",
      "comment": "By calling both wives, Jacob prepares to disclose his plans in private, emphasizing unity and consultation in key decisions, which mirrors the importance of unity in the faith community."
    },
    {
      "pk": 1933105,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 5,
      "text": "He said to them, “I see that your father’s countenance is not favorable toward me as before, but the God of my father has been with me.”",
      "links": "<a href='/AIV/1/26/24'>Gen. 26:24</a>",
      "comment": "Jacob credits God for his provision and faithfulness, rather than his own schemes."
    },
    {
      "pk": 1933106,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 6,
      "text": "You know that I have served your father with all my strength.",
      "links": "<a href='/AIV/1/29/20'>Gen. 29:20</a>",
      "comment": "Jacob appeals to their knowledge of his faithful service, setting up the justice of his actions."
    },
    {
      "pk": 1933107,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 7,
      "text": "Yet your father has deceived me and changed my wages ten times, but God did not allow him to harm me.",
      "links": "<a href='/AIV/1/30/28'>Gen. 30:28</a>; <a href='/AIV/1/31/41'>Gen. 31:41</a>",
      "comment": "Jacob emphasizes God’s protection in the midst of human injustice—an early picture of Divine Providence."
    },
    {
      "pk": 1933108,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 8,
      "text": "If he said, ‘The speckled shall be your wages,’ then all the flock bore speckled; and if he said, ‘The striped shall be your wages,’ then all the flock bore striped.",
      "links": "<a href='/AIV/1/30/32'>Gen. 30:32</a>",
      "comment": "God’s control over fertility and outcomes underscores his sovereignty over material blessings."
    },
    {
      "pk": 1933109,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 9,
      "text": "Thus God has taken away the livestock of your father and given them to me.",
      "links": "",
      "comment": "Jacob attributes his gain to God, not to manipulation, highlighting the biblical theme of the humble being raised up."
    },
    {
      "pk": 1933110,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 10,
      "text": "And during the mating season of the flock, I saw in a dream that the male goats that leaped upon the flock were striped, speckled, and spotted.",
      "links": "<a href='/AIV/1/28/12'>Gen. 28:12</a>",
      "comment": "Dreams are a frequent mode of divine communication in Scripture. The vision shows God’s direct intervention."
    },
    {
      "pk": 1933111,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 11,
      "text": "Then the angel of God said to me in the dream, ‘Jacob,’ and I said, ‘Here I am.’",
      "links": "<a href='/AIV/1/22/11'>Gen. 22:11</a>",
      "comment": "‘Here I am’ (Hebrew: Hineni) signifies readiness to respond to God’s call, echoing great moments of revelation in the Bible."
    },
    {
      "pk": 1933112,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 12,
      "text": "He said, ‘Lift up your eyes and see, all the male goats leaping upon the flock are striped, speckled, and spotted, for I have seen all that Laban has done to you.’",
      "links": "<a href='/AIV/2/3/7'>Exod. 3:7</a>",
      "comment": "God is attentive to injustice against his people. Here, the angelic messenger affirms God’s intimate knowledge and justice."
    },
    {
      "pk": 1933113,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 13,
      "text": "‘I am the God of Bethel, where you anointed a pillar and made a vow to me. Now arise, leave this land and return to your native land.’",
      "links": "<a href='/AIV/1/28/18'>Gen. 28:18</a>; <a href='/AIV/1/28/20'>Gen. 28:20</a>",
      "comment": "God reminds Jacob of their sacred encounter, where Jacob’s vow and act of anointing prefigure the later use of anointed materials and sacred places—pointing forward to later forms of worship rendered to God."
    },
    {
      "pk": 1933114,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 14,
      "text": "Then Rachel and Leah answered him, saying, 'Is there any portion or inheritance left to us in our father’s house?'",
      "links": "<a href='/AIV/1/25/5'>Gen. 25:5</a>",
      "comment": "The sisters’ lack of inheritance contrasts with God’s promise to bless Jacob. This hints at spiritual inheritance, a theme developed throughout Scripture."
    },
    {
      "pk": 1933115,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 15,
      "text": "Are we not regarded by him as foreigners? For he has sold us, and has quite devoured our money.",
      "links": "",
      "comment": "Laban’s mercenary treatment of his daughters sets the stage for God’s blessing to rest elsewhere."
    },
    {
      "pk": 1933116,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 16,
      "text": "For all the wealth that God has taken from our father belongs to us and our children. Now then, do whatever God has said to you.",
      "links": "<a href='/AIV/1/31/9'>Gen. 31:9</a>",
      "comment": "Rachel and Leah’s affirmation of Jacob’s divine mandate models the correct disposition towards God’s revelation."
    },
    {
      "pk": 1933117,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 17,
      "text": "So Jacob rose and set his sons and his wives on the camels.",
      "links": "",
      "comment": "The mention of camels indicates significant wealth and preparation for a long journey."
    },
    {
      "pk": 1933118,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 18,
      "text": "He drove all his livestock, all his property that he had acquired, the livestock he possessed which he had gained in Paddan-aram, to go to Isaac his father in the land of Canaan.",
      "links": "<a href='/AIV/1/25/20'>Gen. 25:20</a>",
      "comment": "Moving towards the promised land aligns with the greater biblical movement toward the fulfillment of God’s promises."
    },
    {
      "pk": 1933119,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 19,
      "text": "Now while Laban was away shearing his sheep, Rachel stole her father’s household gods.",
      "links": "<a href='/AIV/1/35/2'>Gen. 35:2</a>",
      "comment": "Household gods (teraphim) were symbols of inheritance or family protection. The rejection of idols is a recurring biblical command."
    },
    {
      "pk": 1933120,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 20,
      "text": "Jacob deceived Laban the Aramean, by not telling him he was fleeing.",
      "links": "<a href='/AIV/1/27/36'>Gen. 27:36</a>",
      "comment": "Jacob’s use of deception is descriptive, not prescriptive; God brings about his purposes often in spite of human failings."
    },
    {
      "pk": 1933121,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 21,
      "text": "So he fled with all that he had. He arose, crossed the river, and set his face toward the hill country of Gilead.",
      "links": "<a href='/AIV/1/31/23'>Gen. 31:23</a>",
      "comment": "Gilead later becomes significant in Israel’s history, being a place of transition and covenant."
    },
    {
      "pk": 1933122,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 22,
      "text": "On the third day, Laban was told that Jacob had fled.",
      "links": "",
      "comment": "The delay shows Jacob’s head start; ‘third day’ often signifies a moment of revelation or change in Scripture."
    },
    {
      "pk": 1933123,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 23,
      "text": "He took his relatives with him and pursued him for seven days, and overtook him in the hill country of Gilead.",
      "links": "<a href='/AIV/1/31/21'>Gen. 31:21</a>",
      "comment": "The number seven symbolizes completion. The pursuit suggests the gravity of the situation—family lines and possessions are at stake."
    },
    {
      "pk": 1933124,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 24,
      "text": "But God came to Laban the Aramean in a dream by night and said to him, 'Be careful not to say anything to Jacob, either good or bad.'",
      "links": "<a href='/AIV/1/20/3'>Gen. 20:3</a>",
      "comment": "God’s intervention protects his servant. Dream revelation brings to mind divine warnings given to kings and rulers elsewhere in Scripture."
    },
    {
      "pk": 1933125,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 25,
      "text": "So Laban overtook Jacob, who had pitched his tent in the hill country, and Laban with his relatives camped in the hill country of Gilead.",
      "links": "<a href='/AIV/1/31/23'>Gen. 31:23</a>",
      "comment": "The meeting is prepared for negotiation and potential conflict."
    },
    {
      "pk": 1933126,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 26,
      "text": "And Laban said to Jacob, 'What have you done, that you have tricked me and carried away my daughters like captives of the sword?'",
      "links": "<a href='/AIV/1/3/13'>Gen. 3:13</a>",
      "comment": "Laban’s accusation of trickery recalls earlier episodes in Genesis, setting a recurrent motif of deception and accusation."
    },
    {
      "pk": 1933127,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 27,
      "text": "'Why did you flee secretly and trick me, and did not tell me, so that I might have sent you away with joy and with songs, with tambourine and lyre?'",
      "links": "<a href='/AIV/2/15/20'>Exod. 15:20</a>",
      "comment": "Music and celebration were common in Eastern farewell customs, but Laban’s tone remains accusatory."
    },
    {
      "pk": 1933128,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 28,
      "text": "'And why did you not allow me to kiss my sons and my daughters farewell? Now you have done foolishly.'",
      "links": "",
      "comment": "The emphasis on family parting marks the deep value of kinship in Genesis."
    },
    {
      "pk": 1933129,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 29,
      "text": "'It is within my power to do you harm, but the God of your father spoke to me last night, saying, \"Be careful not to speak to Jacob either good or bad.\"'",
      "links": "<a href='/AIV/1/31/24'>Gen. 31:24</a>",
      "comment": "Laban acknowledges the power of Jacob’s God, showing that God’s will restrains even hostile opponents."
    },
    {
      "pk": 1933130,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 30,
      "text": "'And now you have surely gone, because you greatly longed for your father’s house. But why did you steal my gods?'",
      "links": "<a href='/AIV/1/31/19'>Gen. 31:19</a>",
      "comment": "The mention of stolen idols highlights the ongoing struggle in Scripture against idolatry."
    },
    {
      "pk": 1933131,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 31,
      "text": "Jacob answered Laban, 'Because I was afraid, for I thought you would take your daughters from me by force.'",
      "links": "",
      "comment": "Jacob’s fear reveals his vulnerability, even as God protects him."
    },
    {
      "pk": 1933132,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 32,
      "text": "'Anyone with whom you find your gods shall not live. In the presence of our relatives, point out what is yours among my possessions and take it.' Now Jacob did not know that Rachel had stolen them.",
      "links": "<a href='/AIV/1/44/9'>Gen. 44:9</a>",
      "comment": "Jacob, unaware, pronounces a curse, which will have consequences in later chapters—foreshadowing a theme of unintended curses."
    },
    {
      "pk": 1933133,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 33,
      "text": "So Laban went into Jacob's tent, into Leah’s tent, and into the tent of the two maidservants, but he did not find them. Then he went out of Leah’s tent and entered Rachel’s tent.",
      "links": "<a href='/AIV/1/24/67'>Gen. 24:67</a>",
      "comment": "The sequence underscores the hiddenness of sin and the limits of human searching versus divine knowledge."
    },
    {
      "pk": 1933134,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 34,
      "text": "Now Rachel had taken the household gods and put them in the camel’s saddle and sat on them. Laban searched through all the tent but did not find them.",
      "links": "",
      "comment": "The detail reinforces the futility of idol worship—idols are powerless and subject to human manipulation."
    },
    {
      "pk": 1933135,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 35,
      "text": "She said to her father, 'Let not my lord be angry that I cannot rise before you, for the way of women is upon me.' So he searched but did not find the household gods.",
      "links": "",
      "comment": "Rachel’s excuse utilizes cultural expectation; the text here is descriptive, not advisory, regarding means of deception."
    },
    {
      "pk": 1933136,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 36,
      "text": "Then Jacob became angry and argued with Laban. Jacob answered and said to Laban, 'What is my offense? What is my sin, that you have so hotly pursued me?'",
      "links": "",
      "comment": "Jacob’s protest is part of the pattern of vindication for God’s chosen, seen throughout the Scriptures."
    },
    {
      "pk": 1933137,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 37,
      "text": "'Although you have felt through all my goods, what have you found of all your household goods? Set it here before my relatives and yours, that they may decide between us both.'",
      "links": "",
      "comment": "Legal confrontation and public examination echo themes of witness and justice central to biblical jurisprudence."
    },
    {
      "pk": 1933138,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 38,
      "text": "'These twenty years I have been with you; your ewes and she-goats have not miscarried, and I have not eaten the rams of your flock.'",
      "links": "<a href='/AIV/1/29/20'>Gen. 29:20</a>",
      "comment": "Jacob’s long fidelity and careful stewardship are set out in contrast to Laban’s actions."
    },
    {
      "pk": 1933139,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 39,
      "text": "'I did not bring to you the animals torn by beasts; I bore the loss of it myself. You required it from my hand, whether stolen by day or by night.'",
      "links": "<a href='/AIV/2/22/12'>Exod. 22:12</a>",
      "comment": "Jacob’s practice exemplifies honesty and self-sacrifice, traits of servanthood modeled by later biblical figures."
    },
    {
      "pk": 1933140,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 40,
      "text": "'Thus I was: by day the heat consumed me, and the cold by night, and my sleep fled from my eyes.'",
      "links": "",
      "comment": "Jacob’s hardships foreshadow the suffering of God’s people and, in typology, the future Suffering Servant."
    },
    {
      "pk": 1933141,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 41,
      "text": "'These twenty years I have been in your house. I served you fourteen years for your two daughters, and six years for your flock, and you changed my wages ten times.'",
      "links": "<a href='/AIV/1/29/27'>Gen. 29:27</a>; <a href='/AIV/1/31/7'>Gen. 31:7</a>",
      "comment": "Jacob’s perseverance echoes that of later leaders who undergo trials before greater blessing."
    },
    {
      "pk": 1933142,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 42,
      "text": "'If the God of my father, the God of Abraham, and the Fear of Isaac, had not been with me, surely now you would have sent me away empty. God has seen my affliction and the labor of my hands, and rebuked you last night.'",
      "links": "<a href='/AIV/1/16/13'>Gen. 16:13</a>; <a href='/AIV/2/3/7'>Exod. 3:7</a>",
      "comment": "Jacob’s appeal to God echoes the God who sees and delivers the oppressed, a thread carried through the Exodus narrative."
    },
    {
      "pk": 1933143,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 43,
      "text": "Then Laban answered and said to Jacob, 'These daughters are my daughters, these children are my children, these flocks are my flocks, and all that you see is mine. But what can I do this day to these my daughters or to their children whom they have borne?'",
      "links": "",
      "comment": "Laban’s possessiveness is checked by God’s intervention; material possession is relativized by divine sovereignty."
    },
    {
      "pk": 1933144,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 44,
      "text": "'Now come, let us make a covenant, you and I. Let it be a witness between me and you.'",
      "links": "<a href='/AIV/1/21/27'>Gen. 21:27</a>",
      "comment": "Formal agreements and oaths in Genesis anticipate later sacramental covenants that bind and safeguard relationships."
    },
    {
      "pk": 1933145,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 45,
      "text": "So Jacob took a stone and set it up as a pillar.",
      "links": "<a href='/AIV/1/28/18'>Gen. 28:18</a>",
      "comment": "The stone pillar is a perpetual witness, prefiguring sacred memorials in worship practices."
    },
    {
      "pk": 1933146,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 46,
      "text": "Jacob said to his relatives, 'Gather stones.' So they took stones and made a heap, and they ate there by the heap.",
      "links": "",
      "comment": "Communal meals and monuments in the Old Testament point forward to future sacred meals and assemblies."
    },
    {
      "pk": 1933147,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 47,
      "text": "Laban called it Jegar-sahadutha, but Jacob called it Galeed.",
      "links": "",
      "comment": "The different names reflect Aramean and Hebrew backgrounds, showing diversity within the shared covenant."
    },
    {
      "pk": 1933148,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 48,
      "text": "Laban said, 'This heap is a witness between you and me today.' Therefore it was named Galeed,",
      "links": "",
      "comment": "'Galeed' means 'heap of witness,' marking the binding force of the covenant."
    },
    {
      "pk": 1933149,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 49,
      "text": "and Mizpah, for he said, 'The LORD watch between you and me, when we are out of one another’s sight.'",
      "links": "",
      "comment": "‘Mizpah’ means ‘watchtower.’ The Lord alone is invoked as the ultimate witness, pointing to his omnipresence."
    },
    {
      "pk": 1933150,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 50,
      "text": "'If you oppress my daughters, or if you take wives besides my daughters, though no man is with us, see, God is witness between you and me.'",
      "links": "<a href='/AIV/1/16/5'>Gen. 16:5</a>",
      "comment": "Oaths to protect the vulnerable anticipate ongoing themes of faithfulness and fidelity in relationships."
    },
    {
      "pk": 1933151,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 51,
      "text": "Laban also said to Jacob, 'See this heap and this pillar, which I have set between you and me.'",
      "links": "",
      "comment": "Physical memorials serve as reminders of binding covenants throughout Scripture."
    },
    {
      "pk": 1933152,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 52,
      "text": "'This heap is a witness, and the pillar is a witness, that I will not pass beyond this heap to you, and you will not pass beyond this heap and this pillar to do harm.'",
      "links": "",
      "comment": "Covenant boundaries ensure peace and mutual respect, reflecting the sacredness of oaths."
    },
    {
      "pk": 1933153,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 53,
      "text": "'The God of Abraham and the God of Nahor, the God of their father, judge between us.' So Jacob swore by the Fear of his father Isaac.",
      "links": "<a href='/AIV/1/31/42'>Gen. 31:42</a>",
      "comment": "Jacob’s oath invokes the God of his fathers, affirming continuity of faith and family tradition."
    },
    {
      "pk": 1933154,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 54,
      "text": "And Jacob offered a sacrifice on the mountain, and called his relatives to eat bread. They ate bread and stayed all night on the mountain.",
      "links": "<a href='/AIV/1/26/25'>Gen. 26:25</a>",
      "comment": "Sacrifice and meal together echo the pattern of divine covenant and fellowship that will find its fullness in Christian worship."
    },
    {
      "pk": 1933155,
      "translation": "AIV",
      "book": 1,
      "chapter": 31,
      "verse": 55,
      "text": "Early in the morning Laban arose, kissed his sons and his daughters and blessed them; then Laban departed and returned home.",
      "links": "",
      "comment": "The blessing and peaceful departure conclude the narrative with reconciliation, a foreshadowing of peace established through oath and promise—key Old Testament themes fulfilled in the New."
    }
  ],
  "translatedAt": "2025-12-23T08:50:59.999Z"
}