{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 29,
  "verses": [
    {
      "pk": 29102901,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 1,
      "text": "Then Jacob continued on his journey and came to the land of the people of the east.",
      "links": "<a href='/AIV/1/25/20'>Gen. 25:20</a>; <a href='/AIV/1/28/2'>Gen. 28:2</a>",
      "comment": "Jacob's journey eastward fulfills his father's command in seeking a wife among his own people (Gen. 28:2). The theme of God's providence in leading His chosen servants is echoed here."
    },
    {
      "pk": 29102902,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 2,
      "text": "He looked and saw a well in the field, and behold, three flocks of sheep were lying beside it. For out of that well the flocks were watered. A large stone was on the mouth of the well.",
      "links": "<a href='/AIV/1/24/11'>Gen. 24:11</a>",
      "comment": "Wells in ancient times were gathering places and scenes for divine encounters (see Gen. 24:11, where Abraham's servant finds Rebekah)."
    },
    {
      "pk": 29102903,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 3,
      "text": "When all the flocks were gathered there, the shepherds would roll the stone from the mouth of the well and water the sheep, and then put the stone back in its place over the mouth of the well.",
      "links": "",
      "comment": "The well's covering stone suggests special care, possibly to preserve the water or regulate access—a sign of order and community custom."
    },
    {
      "pk": 29102904,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 4,
      "text": "Jacob said to them, 'My brothers, where are you from?' They said, 'We are from Haran.'",
      "links": "<a href='/AIV/1/28/10'>Gen. 28:10</a>",
      "comment": "Jacob’s address ‘my brothers’ shows hospitality and kinship, foreshadowing the unity often emphasized among God’s people."
    },
    {
      "pk": 29102905,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 5,
      "text": "He said to them, 'Do you know Laban, the son of Nahor?' They said, 'We know him.'",
      "links": "<a href='/AIV/1/24/29'>Gen. 24:29</a>; <a href='/AIV/1/28/2'>Gen. 28:2</a>",
      "comment": "Laban, a central figure, is linked through Nahor, Abraham’s brother, reinforcing the interconnectedness of the patriarchal family."
    },
    {
      "pk": 29102906,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 6,
      "text": "He asked them, 'Is he well?' They said, 'He is well, and look, Rachel his daughter is coming with the sheep.'",
      "links": "<a href='/AIV/1/24/15'>Gen. 24:15</a>",
      "comment": "Providential timing is highlighted as Rachel appears—God’s unseen hand directs events, as with Rebekah in Gen. 24."
    },
    {
      "pk": 29102907,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 7,
      "text": "He said, 'Look, it is still broad daylight; it is not yet time to gather the livestock. Water the sheep, then go and pasture them.'",
      "links": "",
      "comment": "Jacob’s initiative contrasts the local customs. His diligence in work foreshadows his own trials and desire for blessing."
    },
    {
      "pk": 29102908,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 8,
      "text": "But they said, 'We cannot until all the flocks are gathered and the stone is rolled from the mouth of the well; then we water the sheep.'",
      "links": "",
      "comment": "The orderliness reflects unity—waiting for all. Early church life also emphasized community practices, reminiscent of Acts 2:44."
    },
    {
      "pk": 29102909,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 9,
      "text": "While he was still speaking with them, Rachel came with her father’s sheep, for she was a shepherdess.",
      "links": "",
      "comment": "Rachel's role as a shepherdess connects her to a recurring Biblical theme of shepherds as God's instruments (cf. Moses, David, and Christ, the Good Shepherd in John 10:11)."
    },
    {
      "pk": 29102910,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 10,
      "text": "When Jacob saw Rachel, the daughter of Laban his mother’s brother, and the sheep of Laban his mother’s brother, Jacob went over and rolled the stone from the mouth of the well and watered the flock of Laban his mother’s brother.",
      "links": "<a href='/AIV/1/24/29'>Gen. 24:29</a>",
      "comment": "Jacob’s act is one of strength and zeal, signaling his dedication and hinting at a divinely arranged meeting."
    },
    {
      "pk": 29102911,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 11,
      "text": "Then Jacob kissed Rachel and wept aloud.",
      "links": "<a href='/AIV/1/33/4'>Gen. 33:4</a>",
      "comment": "The emotional greeting echoes ancient cultural expressions of kinship, as well as foreshadowing the passionate bonds God establishes in holy unions."
    },
    {
      "pk": 29102912,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 12,
      "text": "Jacob told Rachel that he was her father’s relative, and that he was Rebekah’s son. She ran and told her father.",
      "links": "<a href='/AIV/1/24/28-29'>Gen. 24:28–29</a>",
      "comment": "The immediate sharing of good news reflects themes of joyful proclamation seen throughout salvation history (cf. Luke 2:17–18)."
    },
    {
      "pk": 29102913,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 13,
      "text": "As soon as Laban heard the news about Jacob, his sister’s son, he ran to meet him, embraced him, kissed him, and brought him to his house. Jacob told Laban all these things.",
      "links": "<a href='/AIV/1/24/29-31'>Gen. 24:29–31</a>",
      "comment": "Hospitality and joy in welcoming family echo Abraham’s legacy of generosity to kin and stranger alike."
    },
    {
      "pk": 29102914,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 14,
      "text": "Laban said to him, 'Surely you are my own flesh and blood.' And Jacob stayed with him a month.",
      "links": "<a href='/AIV/1/2/23'>Gen. 2:23</a>; <a href='/AIV/1/13/8'>Gen. 13:8</a>",
      "comment": "‘My own flesh and blood’ invokes deep familial bonds—these physical relationships will shape salvation history."
    },
    {
      "pk": 29102915,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 15,
      "text": "Then Laban said to Jacob, 'Because you are my relative, should you serve me for nothing? Tell me, what shall your wages be?'",
      "links": "",
      "comment": "Laban’s proposal of service for wages hints at the coming negotiation and Jacob’s long years of faithful work—service as a path to blessing and covenant fulfillment."
    },
    {
      "pk": 29102916,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 16,
      "text": "Now Laban had two daughters; the name of the older was Leah, and the name of the younger was Rachel.",
      "links": "<a href='/AIV/1/46/14-18'>Gen. 46:14–18</a>",
      "comment": "The order of the daughters will become crucial in the unfolding story—God's will is often revealed through complex family relations."
    },
    {
      "pk": 29102917,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 17,
      "text": "Leah’s eyes were gentle, but Rachel was beautiful in form and appearance.",
      "links": "",
      "comment": "Rachel’s outward beauty contrasts with Leah’s description. Yet, as with David’s choosing over his brothers (1 Sam. 16:7), God’s purposes go deeper than outward appearance."
    },
    {
      "pk": 29102918,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 18,
      "text": "Jacob loved Rachel and said, 'I will serve you seven years for your younger daughter Rachel.'",
      "links": "<a href='/AIV/1/30/26'>Gen. 30:26</a>",
      "comment": "Jacob’s willingness to serve shows the value and cost of holy, covenant love—mirroring Christ’s self-giving (Eph. 5:25)."
    },
    {
      "pk": 29102919,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 19,
      "text": "Laban said, 'It is better that I give her to you than to another man; stay with me.'",
      "links": "",
      "comment": "Marital unions in salvation history often entail both familial covenant and human negotiation, foreshadowing later biblical covenants."
    },
    {
      "pk": 29102920,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 20,
      "text": "Jacob served seven years for Rachel, yet they seemed to him but a few days because of his love for her.",
      "links": "<a href='/AIV/1/31/41'>Gen. 31:41</a>",
      "comment": "Love transforms labor—an underlying principle in Christian discipleship (see 1 John 4:18)."
    },
    {
      "pk": 29102921,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 21,
      "text": "Then Jacob said to Laban, 'Give me my wife, for my time is completed, that I may go in to her.'",
      "links": "",
      "comment": "The completion of a set time recalls fulfillment imagery, later seen in God’s faithfulness to fulfill His promises (Gal. 4:4)."
    },
    {
      "pk": 29102922,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 22,
      "text": "So Laban gathered all the men of the place and made a feast.",
      "links": "<a href='/AIV/1/24/54'>Gen. 24:54</a>",
      "comment": "Wedding feasts carry sacramental echoes, prefiguring nuptial themes fulfilled in the New Covenant (cf. John 2:1–11; Rev. 19:9)."
    },
    {
      "pk": 29102923,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 23,
      "text": "But in the evening he took his daughter Leah and brought her to Jacob, and he went in to her.",
      "links": "",
      "comment": "The substitution of Leah for Rachel is a turning point. God’s providence works even through human deception—echoing how grace can be operative amid brokenness."
    },
    {
      "pk": 29102924,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 24,
      "text": "Laban gave his maid Zilpah to his daughter Leah as her servant.",
      "links": "<a href='/AIV/1/30/9-10'>Gen. 30:9–10</a>",
      "comment": "Zilpah’s introduction foreshadows the twelve tribes’ complex origins. God’s plan unfolds through unexpected means."
    },
    {
      "pk": 29102925,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 25,
      "text": "When morning came, there was Leah! Jacob said to Laban, 'What is this you have done to me? Did I not serve you for Rachel? Why then have you deceived me?'",
      "links": "<a href='/AIV/1/27/35-36'>Gen. 27:35–36</a>",
      "comment": "Jacob, who deceived his own father (Gen. 27), now experiences deception, illustrating the principle of sowing and reaping."
    },
    {
      "pk": 29102926,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 26,
      "text": "Laban said, 'It is not practiced in our place to give the younger before the firstborn.'",
      "links": "",
      "comment": "Cultural customs are cited to justify Laban’s actions. The rights of the firstborn is a major biblical motif (cf. Gen. 25:23, 48:14)."
    },
    {
      "pk": 29102927,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 27,
      "text": "Complete the week with this one, and we will give you the other also, in return for serving me another seven years.'",
      "links": "",
      "comment": "The 'week' refers to a seven-day wedding celebration. The imagery of service and waiting prefigures processes of perseverance in faith and blessing."
    },
    {
      "pk": 29102928,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 28,
      "text": "Jacob did so and completed her week. Then Laban gave him his daughter Rachel as his wife.",
      "links": "",
      "comment": "Jacob’s perseverance results in receiving Rachel, mirroring how God rewards faithfulness—sometimes after trials."
    },
    {
      "pk": 29102929,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 29,
      "text": "Laban gave his servant Bilhah to his daughter Rachel as her servant.",
      "links": "<a href='/AIV/1/30/3-5'>Gen. 30:3–5</a>",
      "comment": "Bilhah and Zilpah will become mothers of tribes of Israel. God’s family is always broader and more complex than first appearances."
    },
    {
      "pk": 29102930,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 30,
      "text": "So Jacob went in to Rachel also, and he loved Rachel more than Leah, and served Laban for another seven years.",
      "links": "<a href='/AIV/1/31/41'>Gen. 31:41</a>",
      "comment": "Jacob’s divided affection leads to later strife, yet God brings good out of imperfect circumstances, foreshadowing Christ’s power to redeem division into unity (John 17:21)."
    },
    {
      "pk": 29102931,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 31,
      "text": "When the LORD saw that Leah was unloved, he opened her womb, but Rachel was barren.",
      "links": "<a href='/AIV/1/30/22'>Gen. 30:22</a>; <a href='/AIV/1/1/28'>Gen. 1:28</a>",
      "comment": "God’s compassion for Leah fulfills His promise to bring fruitfulness from the humble and lowly—echoing the Magnificat (Luke 1:52–53)."
    },
    {
      "pk": 29102932,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 32,
      "text": "Leah conceived and bore a son, and she called his name Reuben, for she said, 'Because the LORD has looked upon my affliction; now surely my husband will love me.'",
      "links": "<a href='/AIV/1/49/3'>Gen. 49:3</a>",
      "comment": "The naming of Reuben recognizes God as the one who sees and acts—every gift of life is divinely given."
    },
    {
      "pk": 29102933,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 33,
      "text": "She conceived again and bore a son, and said, 'Because the LORD has heard that I am unloved, he has given me this son also.' And she called his name Simeon.",
      "links": "<a href='/AIV/1/49/5'>Gen. 49:5</a>",
      "comment": "Simeon's name bears witness to answered prayer—reminiscent of how God hears the cries of His people (Ex. 2:24)."
    },
    {
      "pk": 29102934,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 34,
      "text": "She conceived and bore a son, and said, 'Now this time my husband will be attached to me, because I have borne him three sons.' Therefore his name was called Levi.",
      "links": "<a href='/AIV/1/49/5-7'>Gen. 49:5–7</a>; <a href='/AIV/3/8/18'>Lev. 8:18</a>",
      "comment": "Levi’s name means ‘joined’—the tribe of Levi later mediates the people’s relationship to God. This foreshadows the priestly function and God’s desire for His people’s attachment to Him."
    },
    {
      "pk": 29102935,
      "translation": "AIV",
      "book": 1,
      "chapter": 29,
      "verse": 35,
      "text": "And she conceived again and bore a son, and said, 'This time I will praise the LORD.' Therefore she called his name Judah. Then she ceased bearing.",
      "links": "<a href='/AIV/1/49/8-12'>Gen. 49:8–12</a>; <a href='/AIV/40/1/2'>Matt. 1:2</a>",
      "comment": "Judah’s birth marks a turning point as Leah offers pure praise to God. Judah will become the ancestor of David and ultimately the Messiah (Matt. 1:2), showing God’s power to bring salvation from humbled circumstances."
    }
  ],
  "translatedAt": "2025-12-23T08:49:24.820Z"
}