{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 44,
  "verses": [
    {
      "pk": 1944401,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 1,
      "text": "Then Joseph commanded the steward of his house, saying, “Fill the men’s sacks with as much food as they can carry, and put each man’s silver in the mouth of his sack.”",
      "links": "<a href='/AIV/1/43/16-17'>Gen. 43:16-17</a>",
      "comment": "Joseph continues to test his brothers, but also shows generosity by again returning their silver."
    },
    {
      "pk": 1944402,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 2,
      "text": "And put my cup, the silver cup, in the mouth of the youngest one’s sack, along with his grain money.” So the steward did as Joseph had said.",
      "links": "<a href='/AIV/1/44/12'>Gen. 44:12</a>",
      "comment": "Joseph’s cup, often used for divination, is placed with Benjamin, intentionally leading toward the test of the brothers’ character."
    },
    {
      "pk": 1944403,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 3,
      "text": "As soon as the morning dawned, the men were sent away with their donkeys.",
      "links": "<a href='/AIV/1/44/11'>Gen. 44:11</a>",
      "comment": "The brothers believe their business is complete, unaware of the test to come."
    },
    {
      "pk": 1944404,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 4,
      "text": "They had gone just out of the city, but had not gone far, when Joseph said to his steward, “Get up, pursue the men! When you overtake them, say, ‘Why have you repaid good with evil?’”",
      "links": "<a href='/AIV/1/44/6'>Gen. 44:6</a>",
      "comment": "Joseph’s actions recall earlier betrayals. The question also foreshadows themes of mercy and justice."
    },
    {
      "pk": 1944405,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 5,
      "text": "‘Is not this the cup from which my lord drinks and by which he practices divination? You have done evil in doing this.’”",
      "links": "<a href='/AIV/1/44/15'>Gen. 44:15</a>",
      "comment": "Ancient rulers often claimed knowledge of the divine through objects; Joseph’s divination may be a test as much as a cultural norm (cf. Num. 24:1)."
    },
    {
      "pk": 1944406,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 6,
      "text": "So the steward overtook them and spoke these words to them.",
      "links": "<a href='/AIV/1/44/4'>Gen. 44:4</a>",
      "comment": "Joseph’s steward obeys completely, enacting the plan perfectly."
    },
    {
      "pk": 1944407,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 7,
      "text": "They said to him, “Why does my lord speak such words as these? Far be it from your servants to do such a thing!”",
      "links": "<a href='/AIV/1/43/18'>Gen. 43:18</a>",
      "comment": "The brothers immediately protest their innocence, emphasizing their change from past wrongs."
    },
    {
      "pk": 1944408,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 8,
      "text": "“Look, the money that we found in the mouths of our sacks, we brought back to you from the land of Canaan. How then could we steal silver or gold from your lord’s house?”",
      "links": "<a href='/AIV/1/43/21-22'>Gen. 43:21-22</a>",
      "comment": "Their honesty in returning the past silver points to their reformed character (cf. Luke 19:8)."
    },
    {
      "pk": 1944409,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 9,
      "text": "“Whichever of your servants is found with it shall die, and we also will be my lord’s slaves.”",
      "links": "<a href='/AIV/1/31/32'>Gen. 31:32</a>",
      "comment": "A severe pledge, recalling earlier statements by Jacob’s family, shows the seriousness with which they take the accusation."
    },
    {
      "pk": 1944410,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 10,
      "text": "He said, “Let it be as you say: he who is found with it shall be my slave, but you will be blameless.”",
      "links": "<a href='/AIV/1/44/17'>Gen. 44:17</a>",
      "comment": "Joseph’s steward softens their suggestion, offering a punishment focused on personal responsibility—a model seen in later biblical law (Deut. 24:16)."
    },
    {
      "pk": 1944411,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 11,
      "text": "Then each man quickly lowered his sack to the ground, and each man opened his sack.",
      "links": "<a href='/AIV/1/44/3'>Gen. 44:3</a>",
      "comment": "Their readiness to be searched shows their trust in each other and their innocence."
    },
    {
      "pk": 1944412,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 12,
      "text": "And the steward searched, beginning with the eldest and ending with the youngest. And the cup was found in Benjamin’s sack.",
      "links": "<a href='/AIV/1/42/3-4'>Gen. 42:3-4</a>",
      "comment": "The order of the search heightens suspense and emphasizes Benjamin’s role as the favored son, prefiguring themes of chosen instruments throughout salvation history (cf. 1 Sam. 16:12-13)."
    },
    {
      "pk": 1944413,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 13,
      "text": "Then they tore their clothes, and every man loaded his donkey, and they returned to the city.",
      "links": "<a href='/AIV/1/37/29'>Gen. 37:29</a>",
      "comment": "Tearing garments is an ancient sign of grief. Their shared sorrow contrasts the earlier jealousy over Joseph."
    },
    {
      "pk": 1944414,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 14,
      "text": "When Judah and his brothers came to Joseph’s house, he was still there. They fell to the ground before him.",
      "links": "<a href='/AIV/1/42/6'>Gen. 42:6</a>",
      "comment": "Their obeisance again fulfills Joseph’s earlier dreams (Gen. 37:7, 9), hinting at God’s providential design."
    },
    {
      "pk": 1944415,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 15,
      "text": "And Joseph said to them, “What deed is this that you have done? Do you not know that a man like me can surely practice divination?”",
      "links": "<a href='/AIV/1/44/5'>Gen. 44:5</a>",
      "comment": "Joseph, still concealed from them, uses the language of Egyptian wisdom and power, preparing the moment of revelation."
    },
    {
      "pk": 1944416,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 16,
      "text": "And Judah said, “What shall we say to my lord? What shall we speak? Or how can we clear ourselves? God has found out the guilt of your servants. Behold, we are my lord’s slaves, both we and he in whose hand the cup was found.”",
      "links": "<a href='/AIV/1/42/21'>Gen. 42:21</a>",
      "comment": "Judah’s confession shows a recognition of sin and the need for mercy, paralleling biblical themes of confession and grace (cf. Ps. 32:5). Foreshadowing intercessory roles found later in Scripture."
    },
    {
      "pk": 1944417,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 17,
      "text": "But he said, “Far be it from me that I should do so! The man in whose hand the cup was found, he shall be my slave. But as for you, go up in peace to your father.”",
      "links": "<a href='/AIV/1/44/10'>Gen. 44:10</a>",
      "comment": "Joseph insists on individual justice, recalling God’s demand for personal responsibility and justice."
    },
    {
      "pk": 1944418,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 18,
      "text": "Then Judah drew near to him and said, “O my lord, please let your servant speak a word in my lord’s ear, and do not let your anger burn against your servant, for you are like Pharaoh himself.”",
      "links": "<a href='/AIV/1/18/27'>Gen. 18:27</a>",
      "comment": "Judah’s plea reflects humility before authority, like Abraham’s intercession for Sodom, and prefigures the mediating role of one who will offer himself for many (cf. Isa. 53:12)."
    },
    {
      "pk": 1944419,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 19,
      "text": "My lord asked his servants, saying, ‘Have you a father or a brother?’",
      "links": "<a href='/AIV/1/42/13'>Gen. 42:13</a>",
      "comment": "Judah recounts their previous conversation, preparing to highlight Jacob’s love for Benjamin."
    },
    {
      "pk": 1944420,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 20,
      "text": "And we said to my lord, ‘We have a father, an old man, and a child of his old age, a little one. His brother is dead, and he alone is left of his mother’s children, and his father loves him.’",
      "links": "<a href='/AIV/1/42/38'>Gen. 42:38</a>",
      "comment": "Benjamin’s status as the “one left” of Rachel’s children emphasizes the special role of beloved sons, a biblical motif that prefigures the ‘beloved Son’ in the New Testament (cf. Matt. 3:17)."
    },
    {
      "pk": 1944421,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 21,
      "text": "Then you said to your servants, ‘Bring him down to me, that I may set my eyes on him.’",
      "links": "<a href='/AIV/1/42/15'>Gen. 42:15</a>",
      "comment": "Joseph’s demand initiates the crisis that tests the family’s unity."
    },
    {
      "pk": 1944422,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 22,
      "text": "And we said to my lord, ‘The boy cannot leave his father, for if he should leave his father, his father would die.’",
      "links": "<a href='/AIV/1/42/38'>Gen. 42:38</a>",
      "comment": "A father’s love illustrated here anticipates the love of the heavenly Father who gives up the Beloved Son (cf. John 3:16)."
    },
    {
      "pk": 1944423,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 23,
      "text": "But you said to your servants, ‘Unless your youngest brother comes down with you, you shall not see my face again.’",
      "links": "<a href='/AIV/1/43/5'>Gen. 43:5</a>",
      "comment": "Repeated for emphasis, Joseph’s test calls the brothers to solidarity and sacrifice for one another."
    },
    {
      "pk": 1944424,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 24,
      "text": "When we went back to your servant my father, we told him the words of my lord.",
      "links": "<a href='/AIV/1/42/29'>Gen. 42:29</a>",
      "comment": "The full account demonstrates transparency not present when Joseph was first sold."
    },
    {
      "pk": 1944425,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 25,
      "text": "And when our father said, ‘Go again, buy us a little food,’",
      "links": "<a href='/AIV/1/43/2'>Gen. 43:2</a>",
      "comment": "A reference to the second journey; these events are ordered for God’s purpose."
    },
    {
      "pk": 1944426,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 26,
      "text": "We said, ‘We cannot go down. If our youngest brother goes with us, then we will go down. For we cannot see the man’s face unless our youngest brother is with us.’",
      "links": "<a href='/AIV/1/43/5'>Gen. 43:5</a>",
      "comment": "Judah’s full disclosure again contrasts past deceits, signifying growth in virtue."
    },
    {
      "pk": 1944427,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 27,
      "text": "Then your servant my father said to us, ‘You know that my wife bore me two sons.’",
      "links": "<a href='/AIV/1/35/18'>Gen. 35:18</a>",
      "comment": "Rachel’s sons are set apart, a recurring pattern of favored offspring. Spiritual tradition sees a type or foreshadowing of those uniquely chosen by God’s providence."
    },
    {
      "pk": 1944428,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 28,
      "text": "One went away from me, and I said, ‘Surely he has been torn to pieces,’ and I have not seen him since.",
      "links": "<a href='/AIV/1/37/33-35'>Gen. 37:33-35</a>",
      "comment": "Jacob’s suffering and assumed loss prefigures the sorrow felt over the loss of the beloved Son, a theme realized fully in the Passion narratives."
    },
    {
      "pk": 1944429,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 29,
      "text": "If you take this one also from me, and harm befalls him, you will bring down my gray hairs in sorrow to Sheol.’",
      "links": "<a href='/AIV/1/42/38'>Gen. 42:38</a>",
      "comment": "The depth of a father’s grief points to the seriousness of familial bonds, significant in moral and theological reflection on obedience and honor."
    },
    {
      "pk": 1944430,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 30,
      "text": "Now therefore, as soon as I come to your servant my father, and the boy is not with us, then—as his life is bound up with the boy’s life—",
      "links": "<a href='/AIV/1/44/31'>Gen. 44:31</a>",
      "comment": "Judah argues from the deep union of souls, a mysterious yet real bond, which points toward the communion of persons that lies at the heart of biblical revelation."
    },
    {
      "pk": 1944431,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 31,
      "text": "when he sees that the boy is not with us, he will die. And your servants will bring down the gray hairs of your servant our father with sorrow to Sheol.",
      "links": "<a href='/AIV/1/37/35'>Gen. 37:35</a>",
      "comment": "Again references the ancient worldview concerning Sheol, the place of the dead, highlighting the anguish of loss."
    },
    {
      "pk": 1944432,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 32,
      "text": "For your servant became surety for the boy to my father, saying, ‘If I do not bring him back to you, then I shall bear the blame before my father all my life.’",
      "links": "<a href='/AIV/1/43/9'>Gen. 43:9</a>",
      "comment": "Judah’s offer of himself for Benjamin is a profound act of substitution; this act foreshadows the Christ who will become the substitute for many (cf. John 10:11; Rom. 5:8)."
    },
    {
      "pk": 1944433,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 33,
      "text": "Now therefore, please let your servant remain instead of the boy as a slave to my lord, and let the boy go up with his brothers.",
      "links": "<a href='/AIV/1/22/13'>Gen. 22:13</a>; <a href='/AIV/43/15/13'>John 15:13</a>",
      "comment": "Judah’s self-offering prefigures ultimate sacrifice in redemptive history. The willingness to lay down one’s life for another is fulfilled in the Gospel (cf. John 15:13)."
    },
    {
      "pk": 1944434,
      "translation": "AIV",
      "book": 1,
      "chapter": 44,
      "verse": 34,
      "text": "For how can I go up to my father if the boy is not with me? I fear to see the evil that would come upon my father.”",
      "links": "<a href='/AIV/1/37/35'>Gen. 37:35</a>",
      "comment": "Judah’s empathy and concern for his father marks a complete reversal from the earlier betrayal of Joseph, manifesting the full conversion and spiritual maturity possibly associated with true repentance and ongoing transformation—a pattern lived out by later saints and fulfilled supremely in Christ."
    }
  ],
  "translatedAt": "2025-12-23T08:58:22.217Z"
}