{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 43,
  "verses": [
    {
      "pk": 19433001,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 1,
      "text": "Now the famine was severe in the land.",
      "links": "<a href='/AIV/1/41/56'>Gen. 41:56</a>; <a href='/AIV/1/42/5'>Gen. 42:5</a>",
      "comment": "This verse sets the stage for the events that follow. The emphasis on the famine shows God's sovereignty in bringing about His plan even in hardship."
    },
    {
      "pk": 19433002,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 2,
      "text": "And when they had eaten all the grain which they had brought from Egypt, their father said to them, \"Go again, buy us a little food.\"",
      "links": "<a href='/AIV/1/42/2'>Gen. 42:2</a>",
      "comment": "Jacob’s request highlights human dependence on God’s providence and the necessity of humility in times of need."
    },
    {
      "pk": 19433003,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 3,
      "text": "But Judah said to him, \"The man solemnly warned us, saying, 'You shall not see my face unless your brother is with you.'\"",
      "links": "<a href='/AIV/1/42/20'>Gen. 42:20</a>",
      "comment": "Judah, foreshadowing his tribe’s messianic role, speaks decisively here, taking leadership among the brothers. Compare with <a href='/AIV/58/7/25'>Heb. 7:14</a> for the royal lineage."
    },
    {
      "pk": 19433004,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 4,
      "text": "\"If you will send our brother with us, we will go down and buy you food.\"",
      "links": "",
      "comment": "Full obedience to the authority's command is necessary; parallels can be drawn with submission to spiritual authorities."
    },
    {
      "pk": 19433005,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 5,
      "text": "\"But if you will not send him, we will not go down, for the man said to us, 'You shall not see my face unless your brother is with you.'\"",
      "links": "<a href='/AIV/1/42/20'>Gen. 42:20</a>",
      "comment": "This requirement of bringing Benjamin has spiritual typology, foreshadowing the necessity of unity and completeness for restoration, reminiscent of the reunification needed in the Church."
    },
    {
      "pk": 19433006,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 6,
      "text": "Israel said, \"Why did you bring this trouble upon me by telling the man that you had another brother?\"",
      "links": "",
      "comment": "Jacob’s lament reflects the tension between trust in God and fear of earthly loss."
    },
    {
      "pk": 19433007,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 7,
      "text": "They replied, \"The man questioned us closely about ourselves and our family, saying, 'Is your father alive? Do you have another brother?' We answered him according to these words. Could we in any way know that he would say, 'Bring your brother down'?\"",
      "links": "<a href='/AIV/1/42/13'>Gen. 42:13</a>",
      "comment": "Their honesty, even when difficult, aligns with biblical virtues of truthfulness (see <a href='/AIV/49/4/25'>Eph. 4:25</a>)."
    },
    {
      "pk": 19433008,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 8,
      "text": "Then Judah said to Israel his father, \"Send the boy with me, and we will arise and go, that we may live and not die, both we, and you, and also our little ones.\"",
      "links": "",
      "comment": "Judah’s self-offering anticipates later acts of substitution and sacrifice found throughout Scripture, especially Christ’s sacrifice for life (cf. <a href='/AIV/43/11/50'>John 11:50</a>)."
    },
    {
      "pk": 19433009,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 9,
      "text": "\"I will be surety for him; from my hand you shall require him. If I do not bring him back to you and set him before you, then let me bear the blame forever.\"",
      "links": "<a href='/AIV/1/44/32'>Gen. 44:32</a>",
      "comment": "Judah becomes the pledge for Benjamin, foreshadowing the principle of mediation and intercession found in priestly roles (see <a href='/AIV/58/7/25'>Heb. 7:25</a>)."
    },
    {
      "pk": 19433010,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 10,
      "text": "\"For if we had not delayed, surely by now we could have returned twice.\"",
      "links": "",
      "comment": "Delays due to lack of trust prolong hardship; reliance on God’s timing is a theme echoed in many biblical narratives."
    },
    {
      "pk": 19433011,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 11,
      "text": "Then their father Israel said to them, \"If it must be so, then do this: take some of the best fruits of the land in your bags, and carry them down to the man as a present—a little balm, a little honey, spices, myrrh, pistachio nuts, and almonds.\"",
      "links": "<a href='/AIV/1/37/25'>Gen. 37:25</a>",
      "comment": "Offering gifts recalls the theme of propitiation through gifts or sacrifices, a foreshadowing of rendering due honor in worship."
    },
    {
      "pk": 19433012,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 12,
      "text": "\"Take double the money with you, and the money that was returned in the mouth of your sacks—carry it back in your hand. Perhaps it was a mistake.\"",
      "links": "<a href='/AIV/1/42/25'>Gen. 42:25</a>",
      "comment": "Israel instructs reparation, displaying a concern for justice and honesty. These virtues are core to building communion and reconciliation."
    },
    {
      "pk": 19433013,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 13,
      "text": "\"Also, take your brother and arise, go back to the man;\"",
      "links": "",
      "comment": "Trusting God by letting go of Benjamin; reminiscent of Abraham’s faith in offering Isaac (<a href='/AIV/1/22/2'>Gen. 22:2</a>)."
    },
    {
      "pk": 19433014,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 14,
      "text": "\"And may God Almighty grant you mercy before the man, that he may release your other brother and Benjamin. And if I am bereaved, I am bereaved.\"",
      "links": "<a href='/AIV/1/17/1'>Gen. 17:1</a>",
      "comment": "Israel’s resignation expresses a total surrender to God’s providence, a theme central to the spiritual life."
    },
    {
      "pk": 19433015,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 15,
      "text": "So the men took that gift, and they took double the money in their hand, and Benjamin. Then they arose, went down to Egypt, and stood before Joseph.",
      "links": "",
      "comment": "The journey of the brothers can be seen as a journey toward reconciliation and restoration, important motifs in the overall arc of salvation history."
    },
    {
      "pk": 19433016,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 16,
      "text": "When Joseph saw Benjamin with them, he said to the steward of his house, \"Bring the men into the house. Slaughter an animal and prepare it, for these men will dine with me at noon.\"",
      "links": "<a href='/AIV/1/18/7'>Gen. 18:7</a>",
      "comment": "The special meal prefigures themes of fellowship and covenant meals that appear throughout the Bible, culminating in the Eucharistic banquet in the New Testament."
    },
    {
      "pk": 19433017,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 17,
      "text": "And the man did as Joseph said, and brought the men to Joseph's house.",
      "links": "",
      "comment": "Immediate obedience to Joseph’s word reflects the importance of heeding the voice of God’s chosen servant."
    },
    {
      "pk": 19433018,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 18,
      "text": "Now the men were afraid because they were brought to Joseph's house; and they said, \"It is because of the money, which was returned in our sacks the first time, that we are brought in, so that he may make a case against us and seize us as slaves, and take our donkeys.\"",
      "links": "<a href='/AIV/1/42/28'>Gen. 42:28</a>",
      "comment": "The brothers’ fear derives from a guilty conscience, a universal theme pointing to the need for forgiveness and the grace of absolution."
    },
    {
      "pk": 19433019,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 19,
      "text": "And they came near to the steward of Joseph's house, and talked with him at the door of the house,",
      "links": "",
      "comment": "The steward acts as mediator, a role often filled in Scripture by those who facilitate reconciliation."
    },
    {
      "pk": 19433020,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 20,
      "text": "and said, \"O sir, we indeed came down the first time to buy food;",
      "links": "<a href='/AIV/1/42/3'>Gen. 42:3</a>",
      "comment": "Approaching the steward with their case reflects humility, a key virtue in seeking reconciliation."
    },
    {
      "pk": 19433021,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 21,
      "text": "\"but it happened, when we came to the lodging place, that we opened our sacks, and there, each man's money was in the mouth of his sack, our money in full weight; so we have brought it back in our hand.\"",
      "links": "<a href='/AIV/1/42/27'>Gen. 42:27</a>",
      "comment": "Repentance is shown through their willingness to return what is not rightfully theirs."
    },
    {
      "pk": 19433022,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 22,
      "text": "\"And we have brought down other money in our hands to buy food. We do not know who put our money in our sacks.\"",
      "links": "",
      "comment": "Honesty and transparency are upheld. A moral lesson is drawn out in practical restitution, mirrored in later biblical teaching about making reparation."
    },
    {
      "pk": 19433023,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 23,
      "text": "But he said, \"Peace be to you, do not be afraid. Your God and the God of your father has given you treasure in your sacks; I had your money.\" Then he brought Simeon out to them.",
      "links": "<a href='/AIV/1/42/24'>Gen. 42:24</a>",
      "comment": "The steward attributes the gift to God, recognizing divine providence. Simeon’s release foreshadows spiritual liberation."
    },
    {
      "pk": 19433024,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 24,
      "text": "So the man brought the men into Joseph's house and gave them water, and they washed their feet; and he gave their donkeys feed.",
      "links": "<a href='/AIV/1/18/4'>Gen. 18:4</a>; <a href='/AIV/43/13/5'>John 13:5</a>",
      "comment": "Washing feet is a sign of hospitality and humility, prefiguring Christ’s example of servant-leadership (<a href='/AIV/43/13/14'>John 13:14</a>)."
    },
    {
      "pk": 19433025,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 25,
      "text": "Then they prepared the present for Joseph’s coming at noon, for they heard that they would eat bread there.",
      "links": "",
      "comment": "Table fellowship signifies reconciliation and peace, significant throughout Scripture’s salvation history."
    },
    {
      "pk": 19433026,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 26,
      "text": "And when Joseph came home, they brought him the present that was in their hand into the house, and bowed themselves down to him to the ground.",
      "links": "<a href='/AIV/1/37/7'>Gen. 37:7</a>",
      "comment": "The brothers' prostration fulfills Joseph’s earlier dreams, demonstrating the unfolding of God’s providential vision."
    },
    {
      "pk": 19433027,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 27,
      "text": "And he asked them about their welfare, and said, \"Is your father well, the old man of whom you spoke? Is he still alive?\"",
      "links": "",
      "comment": "Joseph’s concern for his family underscores the importance of honoring fathers and family unity."
    },
    {
      "pk": 19433028,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 28,
      "text": "They answered, \"Your servant our father is well; he is still alive.\" And they bowed their heads and prostrated themselves.",
      "links": "",
      "comment": "Repetition of their bowing emphasizes respect and acknowledgment of authority."
    },
    {
      "pk": 19433029,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 29,
      "text": "Then he lifted his eyes and saw his brother Benjamin, his mother’s son, and said, \"Is this your youngest brother, of whom you spoke to me?\" And he said, \"God be gracious to you, my son.\"",
      "links": "",
      "comment": "Joseph’s blessing upon Benjamin shows familial love and points ahead to the importance of blessing within the family of faith."
    },
    {
      "pk": 19433030,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 30,
      "text": "Then Joseph hurried out, for his compassion grew warm for his brother; and he sought a place to weep. And he entered his chamber and wept there.",
      "links": "<a href='/AIV/1/42/24'>Gen. 42:24</a>",
      "comment": "Joseph’s compassion and vulnerability highlight the humanity of God’s chosen leaders. This emotion undergirds Christ’s weeping (<a href='/AIV/43/11/35'>John 11:35</a>)."
    },
    {
      "pk": 19433031,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 31,
      "text": "Then he washed his face and came out; and controlling himself he said, \"Serve the food.\"",
      "links": "",
      "comment": "Self-mastery and order in hospitality point toward the values of discipline and sacredness in liturgical acts."
    },
    {
      "pk": 19433032,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 32,
      "text": "So they served him by himself, and them by themselves, and the Egyptians who ate with him by themselves; because the Egyptians could not eat bread with the Hebrews, for that is an abomination to the Egyptians.",
      "links": "<a href='/AIV/1/46/34'>Gen. 46:34</a>",
      "comment": "The separation in eating customs reveals early religious and cultural distinctions, anticipating later conflicts and the eventual gathering of all peoples into one family of God."
    },
    {
      "pk": 19433033,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 33,
      "text": "And they sat before him, the firstborn according to his birthright and the youngest according to his youth; and the men looked at one another in astonishment.",
      "links": "",
      "comment": "Joseph's arranging of his brothers reveals hidden knowledge and order, prefiguring the providential order present in divine mysteries."
    },
    {
      "pk": 19433034,
      "translation": "AIV",
      "book": 1,
      "chapter": 43,
      "verse": 34,
      "text": "And he took servings to them from before him, but Benjamin’s portion was five times as much as any of theirs. So they drank and were merry with him.",
      "links": "",
      "comment": "Benjamin’s favored portion signifies grace granted abundantly, not by merit but choice, prefiguring the doctrine of divine election and the overflow of blessings in the new covenant."
    }
  ],
  "translatedAt": "2025-12-23T08:57:46.393Z"
}