{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 37,
  "verses": [
    {
      "pk": 37001,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 1,
      "text": "Jacob lived in the land where his father had stayed, the land of Canaan.",
      "links": "<a href='/AIV/1/36/7'>Genesis 36:7</a>",
      "comment": "Jacob, now settled as an heir of promise, remains in Canaan—the land covenanted by God. This recalls the continuity of God’s promises across generations."
    },
    {
      "pk": 37002,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 2,
      "text": "This is the account of Jacob's family. Joseph, a young man of seventeen, was tending the flock with his brothers—the sons of Bilhah and Zilpah, his father’s wives. Joseph brought a bad report of them to their father.",
      "links": "<a href='/AIV/1/35/25'>Genesis 35:25</a>; <a href='/AIV/1/30/3'>Genesis 30:3</a>",
      "comment": "Joseph’s age is emphasized, marking his youth and vulnerability. His honesty in reporting signals righteousness but also budding conflict with the brothers."
    },
    {
      "pk": 37003,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 3,
      "text": "Now Israel loved Joseph more than all his sons, because he was the son of his old age; and he made him a richly ornamented robe.",
      "links": "<a href='/AIV/1/37/23'>Genesis 37:23</a>",
      "comment": "The special robe symbolizes honor and separation. The father’s favor reveals Joseph’s unique vocation, foreshadowing his future leadership."
    },
    {
      "pk": 37004,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 4,
      "text": "When his brothers saw that their father loved him more than all his brothers, they hated him and could not speak peaceably to him.",
      "links": "<a href='/AIV/1/49/23'>Genesis 49:23</a>",
      "comment": "Sibling jealousy escalates into hatred—an early portrait of unjust persecution, prefiguring later themes of God’s chosen ones suffering among men."
    },
    {
      "pk": 37005,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 5,
      "text": "Joseph had a dream, and when he told it to his brothers, they hated him even more.",
      "links": "<a href='/AIV/27/2/1'>Daniel 2:1</a>",
      "comment": "Joseph’s dreams introduce divine revelation—a motif developed throughout Scripture, often serving as a means of God’s guidance and prophecy."
    },
    {
      "pk": 37006,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 6,
      "text": "He said to them, 'Listen to this dream I had:",
      "links": "<a href='/AIV/1/28/12'>Genesis 28:12</a>",
      "comment": "Dreams as vehicles for God's messages recall earlier patriarchal encounters, suggesting the ongoing intimacy between God and His chosen."
    },
    {
      "pk": 37007,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 7,
      "text": "We were binding sheaves in the field, when suddenly my sheaf stood up and remained upright, and your sheaves gathered around it and bowed down to my sheaf.'",
      "links": "<a href='/AIV/1/42/6'>Genesis 42:6</a>",
      "comment": "Joseph’s dream anticipates future authority, pointing toward God's providential designs. This foreshadows his later rule and the salvation of his family."
    },
    {
      "pk": 37008,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 8,
      "text": "His brothers said to him, 'Are you really going to reign over us? Are you truly to have mastery over us?' And they hated him even more because of his dreams and his words.",
      "links": "<a href='/AIV/1/41/41'>Genesis 41:41</a>",
      "comment": "The brothers interpret the dream as a prophecy of Joseph’s ascendancy. This theme of the rejected one becoming leader finds fulfillment throughout salvation history."
    },
    {
      "pk": 37009,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 9,
      "text": "Then he had another dream and told it to his brothers, saying, 'Behold, I had another dream, and this time the sun, the moon, and eleven stars were bowing down to me.'",
      "links": "<a href='/AIV/1/37/10'>Genesis 37:10</a>; <a href='/AIV/27/7/12'>Daniel 7:12</a>",
      "comment": "Cosmic imagery conveys Joseph’s destiny, with 'sun' and 'moon' representing parents and 'stars' his brothers. This signals God's election, echoing heavenly symbolism."
    },
    {
      "pk": 37010,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 10,
      "text": "When he told his father and his brothers, his father rebuked him and said, 'What is this dream that you have had? Shall I and your mother and your brothers indeed come to bow down to the ground before you?'",
      "links": "<a href='/AIV/1/43/26'>Genesis 43:26</a>",
      "comment": "Jacob’s reaction recognizes prophetic import, yet responds with caution. The notion of family submission hints at God’s order and eventual unity.",
      "_note": "Some manuscripts say 'your mother', but Rachel was dead; this may refer to Leah or a general matriarchal figure."
    },
    {
      "pk": 37011,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 11,
      "text": "His brothers were jealous of him, but his father kept the matter in mind.",
      "links": "<a href='/AIV/42/2/19'>Luke 2:19</a>",
      "comment": "Jacob’s pondering resembles Mary keeping things in her heart, suggesting receptivity to God’s plan even in uncertainty. Envy continues to fester among the brothers."
    },
    {
      "pk": 37012,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 12,
      "text": "Now his brothers went to feed their father’s flock at Shechem.",
      "links": "<a href='/AIV/1/33/18'>Genesis 33:18</a>",
      "comment": "Shechem, site of earlier family events, is again the setting for conflict. The journey anticipates a decisive turning point in Joseph's life."
    },
    {
      "pk": 37013,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 13,
      "text": "Israel said to Joseph, 'Are not your brothers feeding the flock at Shechem? Come, and I will send you to them.' So he said to him, 'I am ready.'",
      "links": "<a href='/AIV/1/22/1'>Genesis 22:1</a>",
      "comment": "Joseph’s obedience aligns with the theme of faithful sonship, foreshadowing his role as a willing servant and instrument in God’s plan."
    },
    {
      "pk": 37014,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 14,
      "text": "Then he said to him, 'Go and see if all is well with your brothers and with the flock, and bring word back to me.' So he sent him out from the valley of Hebron, and Joseph went toward Shechem.",
      "links": "<a href='/AIV/1/13/18'>Genesis 13:18</a>",
      "comment": "Joseph is sent from the father’s house, bearing responsibility for his brothers—paralleling many biblical figures sent on missions of reconciliation."
    },
    {
      "pk": 37015,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 15,
      "text": "A man found him wandering in the fields and asked him, 'What are you looking for?'",
      "links": "<a href='/AIV/1/24/63'>Genesis 24:63</a>",
      "comment": "This unnamed man steers Joseph toward his destiny, suggesting divine guidance at turning points in salvation history."
    },
    {
      "pk": 37016,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 16,
      "text": "He replied, 'I am looking for my brothers. Can you tell me where they are grazing their flock?'",
      "links": "<a href='/AIV/1/37/13'>Genesis 37:13</a>",
      "comment": "Joseph’s earnest search epitomizes the pursuit of familial unity. The motif of searching for the lost echoes throughout Scripture."
    },
    {
      "pk": 37017,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 17,
      "text": "'They have moved from here,' the man answered. 'I heard them say, Let us go to Dothan.' So Joseph went after his brothers and found them at Dothan.",
      "links": "<a href='/AIV/12/6/13'>2 Kings 6:13</a>",
      "comment": "Dothan, later a place of heavenly intervention, becomes the scene where Joseph’s fate unfolds—signaling the mysterious workings of providence."
    },
    {
      "pk": 37018,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 18,
      "text": "When they saw him from afar, even before he reached them, they conspired against him to kill him.",
      "links": "<a href='/AIV/40/21/38'>Matthew 21:38</a>",
      "comment": "The plot to kill Joseph typifies the rejection of God’s chosen. This anticipates the suffering of the righteous throughout history, ultimately fulfilled in Christ (see Mt 21:38)."
    },
    {
      "pk": 37019,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 19,
      "text": "They said to one another, 'Here comes the dreamer.'",
      "links": "<a href='/AIV/6/14/12'>Judges 14:12</a>",
      "comment": "A title of derision, yet it acknowledges Joseph’s gift. Divine dreams are often misunderstood or persecuted before vindication."
    },
    {
      "pk": 37020,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 20,
      "text": "'Come now, let us kill him and throw him into one of the pits. We will say, 'A wild animal devoured him.' Then we’ll see what comes of his dreams.'",
      "links": "<a href='/AIV/1/42/13'>Genesis 42:13</a>",
      "comment": "Their malice aims to destroy both Joseph and the prophetic word. This echoes attempts throughout history to thwart God’s plan, which always prevails."
    },
    {
      "pk": 37021,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 21,
      "text": "But when Reuben heard this, he tried to rescue him from their hands. He said, 'Let us not take his life.'",
      "links": "<a href='/AIV/1/42/22'>Genesis 42:22</a>",
      "comment": "Reuben’s intervention preserves Joseph for a greater purpose, showing that God uses individuals to protect His chosen—even amid human weakness."
    },
    {
      "pk": 37022,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 22,
      "text": "And Reuben said to them, 'Do not shed blood. Throw him into this pit here in the wilderness, but do not lay a hand on him'—intending to rescue him later and return him to his father.",
      "links": "<a href='/AIV/1/42/37'>Genesis 42:37</a>",
      "comment": "Reuben’s plan hints at contrition and mercy. Salvation often comes through unexpected mediators, a theme developed across Scripture."
    },
    {
      "pk": 37023,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 23,
      "text": "So when Joseph came to his brothers, they stripped him of his robe—the ornate robe he wore.",
      "links": "<a href='/AIV/40/27/28'>Matthew 27:28</a>",
      "comment": "Stripping of the robe foreshadows Christ’s own humiliation and suffering (see Mt 27:28). This symbolic act is both a literal and spiritual removal of honor."
    },
    {
      "pk": 37024,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 24,
      "text": "They took him and threw him into the pit. The pit was empty; there was no water in it.",
      "links": "<a href='/AIV/24/38/6'>Jeremiah 38:6</a>",
      "comment": "The imagery of the pit symbolizes exile, death, or spiritual trial. Throughout Scripture, 'pit' or 'Sheol' often suggests suffering before redemption."
    },
    {
      "pk": 37025,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 25,
      "text": "Then they sat down to eat. And looking up, they saw a caravan of Ishmaelites coming from Gilead, their camels loaded with spices, balm, and myrrh, going down to Egypt.",
      "links": "<a href='/AIV/1/16/11'>Genesis 16:11</a>; <a href='/AIV/40/2/11'>Matthew 2:11</a>",
      "comment": "The reference to balm and myrrh links Genesis to Christ’s passion and burial (see Mt 2:11). The Ishmaelites connect Joseph’s fate to broader salvation history."
    },
    {
      "pk": 37026,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 26,
      "text": "Judah said to his brothers, 'What profit is there if we kill our brother and cover up his blood?'",
      "links": "<a href='/AIV/1/4/10'>Genesis 4:10</a>",
      "comment": "Judah proposes another way, echoing concerns for innocence first shown in Abel (Gen 4:10). His role grows as a leader, foreshadowing future significance."
    },
    {
      "pk": 37027,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 27,
      "text": "'Come, let us sell him to the Ishmaelites and not lay our hands on him; after all, he is our brother, our own flesh.' And his brothers listened to him.",
      "links": "<a href='/AIV/1/45/4'>Genesis 45:4</a>",
      "comment": "Though mercenary, this act preserves Joseph’s life by sending him into another land. Redemption in Scripture often involves temporary exile before restoration."
    },
    {
      "pk": 37028,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 28,
      "text": "So when the Midianite merchants passed by, they pulled Joseph up out of the pit and sold him to the Ishmaelites for twenty pieces of silver. And they took Joseph to Egypt.",
      "links": "<a href='/AIV/40/26/15'>Matthew 26:15</a>",
      "comment": "The sale for silver prefigures Christ’s betrayal for thirty pieces. Egypt becomes a place of suffering, but ultimately, salvation (see Mt 26:15)."
    },
    {
      "pk": 37029,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 29,
      "text": "When Reuben returned to the pit and saw that Joseph was not there, he tore his clothes.",
      "links": "<a href='/AIV/12/2/12'>2 Kings 2:12</a>",
      "comment": "Tearing clothes expresses deep mourning—a sign of repentance and sorrow, seen often during moments of great loss in Scripture."
    },
    {
      "pk": 37030,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 30,
      "text": "He returned to his brothers and said, 'The boy is gone, and I—where shall I go?'",
      "links": "<a href='/AIV/1/44/34'>Genesis 44:34</a>",
      "comment": "Reuben’s lament shows personal responsibility and emotional distress over the broken family, a repeated theme in narratives about suffering and restoration."
    },
    {
      "pk": 37031,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 31,
      "text": "Then they took Joseph’s robe, slaughtered a goat, and dipped the robe in the blood.",
      "links": "<a href='/AIV/1/27/16'>Genesis 27:16</a>",
      "comment": "Blood on the robe recalls earlier deception by garments (Jacob and Esau). This act also reflects the motif of innocent blood shed and coverings."
    },
    {
      "pk": 37032,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 32,
      "text": "They took the ornate robe back to their father and said, 'We found this. Examine it to see whether it is your son’s robe.'",
      "links": "<a href='/AIV/1/38/25'>Genesis 38:25</a>",
      "comment": "The robe, formerly a symbol of favor, becomes evidence of loss. False testimony and grief entwine, recurring motifs in Scripture’s account of fallen humanity."
    },
    {
      "pk": 37033,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 33,
      "text": "He recognized it and said, 'It is my son’s robe. A wild animal has devoured him; surely Joseph has been torn to pieces.'",
      "links": "<a href='/AIV/1/44/28'>Genesis 44:28</a>",
      "comment": "Jacob’s conclusion reflects heartbreak and despair, yet God’s plan for rescue unfolds beyond this apparent tragedy."
    },
    {
      "pk": 37034,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 34,
      "text": "Jacob tore his clothes, put on sackcloth, and mourned his son for many days.",
      "links": "<a href='/AIV/10/3/31'>2 Samuel 3:31</a>",
      "comment": "The mourning ritual sets a pattern for grieving the loss of beloved ones. Lengthy mourning reveals the depth of familial love in biblical faith."
    },
    {
      "pk": 37035,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 35,
      "text": "All his sons and daughters tried to comfort him, but he refused to be comforted, saying, 'I will go down to the grave to my son, mourning.' So his father wept for him.",
      "links": "<a href='/AIV/1/42/38'>Genesis 42:38</a>",
      "comment": "Jacob’s inconsolable grief highlights the intensity of parental love and hope. The refusal to be comforted points to a longing for ultimate restoration."
    },
    {
      "pk": 37036,
      "translation": "AIV",
      "book": 1,
      "chapter": 37,
      "verse": 36,
      "text": "Meanwhile, the Midianites sold Joseph in Egypt to Potiphar, an official of Pharaoh, the captain of the guard.",
      "links": "<a href='/AIV/1/39/1'>Genesis 39:1</a>",
      "comment": "Joseph’s journey to Egypt initiates God’s plan for salvation, embedding both literal exile and spiritual ascent. From suffering comes exaltation—an enduring biblical pattern, prefiguring Christ’s humbling and glory (Phil 2:5–11)."
    }
  ],
  "translatedAt": "2025-12-23T08:54:07.484Z"
}