{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 15,
  "verses": [
    {
      "pk": 1932200,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 1,
      "text": "After these things, the word of the LORD came to Abram in a vision, saying, \"Do not be afraid, Abram. I am your shield; your reward will be very great.\"",
      "links": "<a href='/AIV/23/41/10'>Isaiah 41:10</a>; <a href='/AIV/58/11/6'>Hebrews 11:6</a>",
      "comment": "God's personal reassurance to Abram echoes His protective power and promise of reward for faith. The motif of 'vision' signals divine communication, later seen in Christ's revelation to His disciples. The term 'shield' foreshadows spiritual protection through faith (Eph. 6:16)."
    },
    {
      "pk": 1932201,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 2,
      "text": "But Abram said, \"O Lord GOD, what will You give me, for I still remain childless, and the heir of my house is Eliezer of Damascus?\"",
      "links": "<a href='/AIV/1/16/1-2'>Genesis 16:1-2</a>",
      "comment": "Abram's concern about his lack of a son is central to the covenant theme in Scripture, later fulfilled in the miraculous birth of Isaac and finding greater fulfillment in the promised Christ."
    },
    {
      "pk": 1932202,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 3,
      "text": "Abram said, \"Look, You have given me no offspring, so a servant born in my house will be my heir.\"",
      "links": "<a href='/AIV/1/24/2'>Genesis 24:2</a>",
      "comment": "Abram wrestles with God's promise. The concept of inheritance foreshadows spiritual inheritance in Christ, which surpasses natural lineage (<a href='/AIV/48/3/29'>Galatians 3:29</a>)."
    },
    {
      "pk": 1932203,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 4,
      "text": "But the word of the LORD came to him: \"This man will not be your heir, but a son from your own body will be your heir.\"",
      "links": "<a href='/AIV/1/17/16-19'>Genesis 17:16-19</a>; <a href='/AIV/1/21/12'>Genesis 21:12</a>",
      "comment": "God clarifies that the promise involves Abram's own offspring, emphasizing the miraculous nature of God's intervention in salvation history."
    },
    {
      "pk": 1932204,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 5,
      "text": "He brought him outside and said, \"Look up at the sky and count the stars—if you can count them.\" Then He said to him, \"So shall your descendants be.\"",
      "links": "<a href='/AIV/1/22/17'>Genesis 22:17</a>; <a href='/AIV/45/4/18'>Romans 4:18</a>",
      "comment": "The promise of descendants as numerous as the stars is literal for Abram's physical lineage but spiritual for all who follow in the faith, as Paul interprets in Romans. This is a proto-typical foreshadowing of the universal nature of God's people."
    },
    {
      "pk": 1932205,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 6,
      "text": "And Abram believed the LORD, and He credited it to him as righteousness.",
      "links": "<a href='/AIV/45/4/3'>Romans 4:3</a>; <a href='/AIV/48/3/6'>Galatians 3:6</a>; <a href='/AIV/59/2/23'>James 2:23</a>",
      "comment": "Faith as righteousness stands as a foundational teaching, later quoted in New Testament writings to show salvation's origin in trust and obedience. The faith that justifies is completed in works (James 2:23), suggesting a fuller participation in God's plan."
    },
    {
      "pk": 1932206,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 7,
      "text": "God said to him, \"I am the LORD who brought you out from Ur of the Chaldeans to give you this land to possess.\"",
      "links": "<a href='/AIV/1/11/31'>Genesis 11:31</a>; <a href='/AIV/1/12/1'>Genesis 12:1</a>",
      "comment": "The motif of divine election and call echoes later in the vocation of the prophets and apostles. Land as inheritance parallels the fulfillment of God's promises in both earthly and heavenly realms, anticipating the assembly of the faithful."
    },
    {
      "pk": 1932207,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 8,
      "text": "But Abram said, \"O Lord GOD, how will I know that I will possess it?\"",
      "links": "<a href='/AIV/1/24/13-14'>Genesis 24:13-14</a>",
      "comment": "Abram's question reflects the human desire for assurance amidst divine mystery. Faith and certainty begin to intertwine here, foreshadowing the gifts of discernment and trust passed down through spiritual leadership."
    },
    {
      "pk": 1932208,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 9,
      "text": "He said to him, \"Bring Me a three-year-old heifer, a three-year-old goat, a three-year-old ram, a turtledove, and a young pigeon.\"",
      "links": "<a href='/AIV/1/8/20'>Genesis 8:20</a>; <a href='/AIV/3/1/14'>Leviticus 1:14</a>",
      "comment": "The specified sacrifices prefigure later ritual offerings 'instituted for communion,' symbolizing dedication and the gravity of covenant in the relationship between God and man."
    },
    {
      "pk": 1932209,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 10,
      "text": "Then he brought all these to Him, cut them in two, and arranged the halves opposite each other; but he did not cut the birds in two.",
      "links": "<a href='/AIV/3/1/17'>Leviticus 1:17</a>",
      "comment": "Dividing the animals was a customary act in ancient covenant-making, signifying the seriousness and irrevocability of the promise. It shapes later forms of liturgical symbolism."
    },
    {
      "pk": 1932210,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 11,
      "text": "Then birds of prey came down on the carcasses, but Abram drove them away.",
      "links": "<a href='/AIV/1/40/11'>Genesis 40:11</a>",
      "comment": "Birds of prey attempting to disrupt the sacrifice can be interpreted allegorically as threats to the covenant, echoing later persistent opposition to God's unfolding plan."
    },
    {
      "pk": 1932211,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 12,
      "text": "As the sun was going down, Abram fell into a deep sleep, and a thick and fearful darkness fell upon him.",
      "links": "<a href='/AIV/1/2/21'>Genesis 2:21</a>; <a href='/AIV/2/10/21'>Exodus 10:21</a>",
      "comment": "Abram's deep sleep recalls Adam's sleep (Gen. 2:21), a setting for divine action. The darkness signals the mystery and awe of God's work, later reflected in significant divine encounters."
    },
    {
      "pk": 1932212,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 13,
      "text": "Then He said to Abram, \"Know for certain that your descendants will be strangers in a land that is not theirs; they will be enslaved and oppressed for four hundred years.\"",
      "links": "<a href='/AIV/2/1/11'>Exodus 1:11</a>; <a href='/AIV/2/12/40'>Exodus 12:40</a>",
      "comment": "The prophecy of future suffering is literal for the Israelites in Egypt and thematically for the trials all believers endure before liberation. The pattern repeats in salvation history."
    },
    {
      "pk": 1932213,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 14,
      "text": "\"But I will judge the nation they serve, and afterward they will come out with great possessions.\"",
      "links": "<a href='/AIV/2/12/35-36'>Exodus 12:35-36</a>; <a href='/AIV/19/105/37'>Psalm 105:37</a>",
      "comment": "God's judgment and deliverance of Abram's descendants anticipates the pattern of redemption, culminating in final liberation through the work of the Messiah."
    },
    {
      "pk": 1932214,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 15,
      "text": "\"As for you, you will go to your fathers in peace; you will be buried at a good old age.\"",
      "links": "<a href='/AIV/1/25/8'>Genesis 25:8</a>",
      "comment": "The promise of peaceful rest and 'joining the fathers' indicates a vision of the afterlife consistent with Scriptural continuity. It develops the concept of death as a passage rather than just an end."
    },
    {
      "pk": 1932215,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 16,
      "text": "\"In the fourth generation your descendants will return here, for the sin of the Amorites is not yet complete.\"",
      "links": "<a href='/AIV/2/6/16'>Exodus 6:16</a>",
      "comment": "God's timing hinges on justice and mercy. The delay in fulfillment recognizes God's patience and protection of the righteous, a recurring biblical theme."
    },
    {
      "pk": 1932216,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 17,
      "text": "When the sun had gone down and darkness had fallen, a smoking firepot and a flaming torch passed between the pieces.",
      "links": "<a href='/AIV/2/3/2'>Exodus 3:2</a>; <a href='/AIV/2/13/21'>Exodus 13:21</a>",
      "comment": "The appearance of fire represents God's presence and ratification of the covenant. It prefigures later signs—such as the pillar of fire—with spiritual ties to divine guidance and sacramental covenant."
    },
    {
      "pk": 1932217,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 18,
      "text": "On that day the LORD made a covenant with Abram, saying, \"To your descendants I give this land, from the river of Egypt to the great river, the Euphrates:\"",
      "links": "<a href='/AIV/1/12/7'>Genesis 12:7</a>; <a href='/AIV/19/105/8-11'>Psalm 105:8-11</a>",
      "comment": "God solemnly makes a covenant, a sacred and binding promise, later fulfilled and reinterpreted in new covenant language. The land symbolizes both physical inheritance and the gathering of the faithful to God's promise."
    },
    {
      "pk": 1932218,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 19,
      "text": "\"the land of the Kenites, the Kenizzites, the Kadmonites,\"",
      "links": "",
      "comment": "Listing the specific nations further defines the scope of the promise, suggesting the comprehensive nature of God's plan for His people."
    },
    {
      "pk": 1932219,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 20,
      "text": "\"the Hittites, the Perizzites, the Rephaim,\"",
      "links": "",
      "comment": "Enumerating the inhabitants illustrates the challenge and scope of future fulfillment of God's covenant, inviting both historical and spiritual interpretation."
    },
    {
      "pk": 1932220,
      "translation": "AIV",
      "book": 1,
      "chapter": 15,
      "verse": 21,
      "text": "\"the Amorites, the Canaanites, the Girgashites, and the Jebusites.\"",
      "links": "",
      "comment": "The list of peoples concludes the territorial promise, providing a foundation for Israel's vocation as a chosen people and for the ultimate fulfillment of God's plan which finds its completion in unity across all nations through faith."
    }
  ],
  "translatedAt": "2025-12-23T08:41:06.186Z"
}