{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 20,
  "verses": [
    {
      "pk": 1200801,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 1,
      "text": "Abraham journeyed from there toward the region of the Negev, and dwelled between Kadesh and Shur. Then he sojourned in Gerar.",
      "links": "<a href='/AIV/1/12/9'>Gen. 12:9</a>; <a href='/AIV/1/16/7'>Gen. 16:7</a>",
      "comment": "‘Sojourned’ indicates Abraham was a traveler, residing temporarily among foreign peoples. This period is a continuation of his journeys, trusting God’s providence."
    },
    {
      "pk": 1200802,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 2,
      "text": "And Abraham said of Sarah his wife, 'She is my sister.' So Abimelech, king of Gerar, sent and took Sarah.",
      "links": "<a href='/AIV/1/12/13'>Gen. 12:13</a>; <a href='/AIV/1/26/7'>Gen. 26:7</a>",
      "comment": "Abraham repeats a previous deception (see Genesis 12:13), showing his human weakness. This verse sets up God’s later intervention."
    },
    {
      "pk": 1200803,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 3,
      "text": "But God came to Abimelech in a dream by night and said to him, 'Behold, you are a dead man because of the woman you have taken, for she is a man's wife.'",
      "links": "<a href='/AIV/1/31/24'>Gen. 31:24</a>; <a href='/AIV/1/20/18'>Gen. 20:18</a>",
      "comment": "God protects Sarah and the promissory line Himself. Like other Theophanies (divine revelations), God’s providence upholds the promised seed (see Gen 3:15 for protoevangelium context)."
    },
    {
      "pk": 1200804,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 4,
      "text": "Now Abimelech had not come near her. So he said, 'Lord, will you destroy a righteous nation also?'",
      "links": "<a href='/AIV/1/18/23'>Gen. 18:23</a>; <a href='/AIV/1/19/25'>Gen. 19:25</a>",
      "comment": "Abimelech's plea echoes Abraham’s earlier intercession for Sodom. God’s mercy considers innocence and intention, a recurring biblical theme."
    },
    {
      "pk": 1200805,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 5,
      "text": "'Did he not say to me, "
    },
    {
      "pk": 1200805,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 5,
      "text": "'Did he not say to me, \"She is my sister\"? And she herself even said, \"He is my brother.\" In the integrity of my heart and the innocence of my hands I have done this.'",
      "links": "<a href='/AIV/1/12/19'>Gen. 12:19</a>; <a href='/AIV/1/20/6'>Gen. 20:6</a>",
      "comment": "Abimelech claims innocence based on Abraham’s misleading words. The theme of moral culpability and intention appears here, paralleling further teachings about sin and conscience (see 1 Sam. 16:7)."
    },
    {
      "pk": 1200806,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 6,
      "text": "And God said to him in the dream, 'Yes, I know that you did this in the integrity of your heart. For I also withheld you from sinning against Me; therefore I did not let you touch her.'",
      "links": "<a href='/AIV/1/20/18'>Gen. 20:18</a>; <a href='/AIV/1/39/9'>Gen. 39:9</a>",
      "comment": "God’s sovereign grace prevents Abimelech from unknowingly sinning. This reinforces divine initiative in preserving holiness and the chosen line (see Ps. 19:13)."
    },
    {
      "pk": 1200807,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 7,
      "text": "'Now therefore, restore the man's wife; for he is a prophet, and he will pray for you and you shall live. But if you do not restore her, be sure that you shall surely die, you and all who are yours.'",
      "links": "<a href='/AIV/1/12/17'>Gen. 12:17</a>; <a href='/AIV/1/27/19'>Gen. 27:19</a>",
      "comment": "This is the first time in Scripture Abraham is called a 'prophet.' The role of intercessory prayer is highlighted—a theme foundational in biblical mediation (see James 5:16)."
    },
    {
      "pk": 1200808,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 8,
      "text": "So Abimelech rose early in the morning, called all his servants, and told all these things in their hearing; and the men were very much afraid.",
      "links": "<a href='/AIV/1/41/8'>Gen. 41:8</a>; <a href='/AIV/19/33/8'>Psalm 33:8</a>",
      "comment": "Fear of God’s judgment is seen as just and wise. The narrative reflects a communal seriousness about sin and obedience."
    },
    {
      "pk": 1200809,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 9,
      "text": "Then Abimelech called Abraham and said to him, 'What have you done to us? How have I sinned against you, that you have brought on me and my kingdom a great sin? You have done deeds to me that should not be done.'",
      "links": "<a href='/AIV/1/12/18'>Gen. 12:18</a>; <a href='/AIV/1/26/10'>Gen. 26:10</a>",
      "comment": "Abimelech rebukes Abraham for his actions. Even non-Israelite kings recognize moral law. God's moral order is for all peoples (see Rom. 2:15)."
    },
    {
      "pk": 1200810,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 10,
      "text": "And Abimelech said to Abraham, 'What did you see, that you have done this thing?'",
      "links": "<a href='/AIV/1/12/18'>Gen. 12:18</a>",
      "comment": "Abimelech demands Abraham explain his actions. This account exposes Abraham’s fear and frailty, reminding us that even the righteous falter."
    },
    {
      "pk": 1200811,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 11,
      "text": "Abraham replied, 'Because I thought, Surely there is no fear of God in this place, and they will kill me because of my wife.'",
      "links": "<a href='/AIV/1/12/12'>Gen. 12:12</a>",
      "comment": "Abraham justifies his actions by lack of trust. The narrative reveals God's faithfulness despite human weakness."
    },
    {
      "pk": 1200812,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 12,
      "text": "'Besides, she is indeed my sister, the daughter of my father, but not the daughter of my mother; and she became my wife.'",
      "links": "<a href='/AIV/1/11/29'>Gen. 11:29</a>",
      "comment": "Abraham admits a partial truth. Early patriarchal marriages were sometimes between close kin, later prohibited (see Lev. 18:9)."
    },
    {
      "pk": 1200813,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 13,
      "text": "'And when God caused me to wander from my father’s house, I said to her, “This is the kindness you must show me: at every place where we come, say of me, 'He is my brother.'”'",
      "links": "<a href='/AIV/1/12/1'>Gen. 12:1</a>",
      "comment": "Abraham had formed a defensive pact with Sarah. His wandering (exile) recalls themes of pilgrimage and dependence on God's guidance (see Heb. 11:9-10)."
    },
    {
      "pk": 1200814,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 14,
      "text": "Then Abimelech took sheep and oxen, male and female servants, and gave them to Abraham; and he returned Sarah his wife to him.",
      "links": "<a href='/AIV/1/12/16'>Gen. 12:16</a>; <a href='/AIV/1/13/2'>Gen. 13:2</a>",
      "comment": "Despite Abraham's failing, God blesses him through Gentile gifts. Blessing is promised even through difficult circumstances (see Gen. 12:3)."
    },
    {
      "pk": 1200815,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 15,
      "text": "And Abimelech said, 'See, my land is before you; dwell wherever it pleases you.'",
      "links": "<a href='/AIV/1/13/9'>Gen. 13:9</a>",
      "comment": "Hospitality from a foreign king prefigures the blessing of all nations through Abraham’s line (see Gal. 3:8)."
    },
    {
      "pk": 1200816,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 16,
      "text": "Then to Sarah he said, 'Look, I have given your brother a thousand pieces of silver; indeed this is a sign of your vindication before all who are with you, and before everyone you are cleared.'",
      "links": "<a href='/AIV/1/26/11'>Gen. 26:11</a>",
      "comment": "The gift publicly exonerates Sarah, restoring her honor. This points to restoration and even purification after moral danger—a motif developed in further scripture (see Zech. 3:1-5)."
    },
    {
      "pk": 1200817,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 17,
      "text": "Then Abraham prayed to God, and God healed Abimelech, his wife, and his female servants; so they bore children.",
      "links": "<a href='/AIV/1/20/7'>Gen. 20:7</a>; <a href='/AIV/19/107/20'>Ps. 107:20</a>",
      "comment": "Abraham’s intercession brings healing and fruitfulness. Prophetic intercession is a recurring biblical theme, anticipating the role of mediators between God and man (see 1 Tim. 2:1-5)."
    },
    {
      "pk": 1200818,
      "translation": "AIV",
      "book": 1,
      "chapter": 20,
      "verse": 18,
      "text": "For the Lord had completely closed up all the wombs of the house of Abimelech because of Sarah, Abraham's wife.",
      "links": "<a href='/AIV/1/12/17'>Gen. 12:17</a>",
      "comment": "This passage underlines God’s control over fertility and blessing. The restoration points to the importance of divine grace restoring what is lost through sin. See Christ’s miracles of healing and restoration as echoes of this motif."
    }
  ],
  "translatedAt": "2025-12-23T08:43:31.739Z"
}