{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 28,
  "verses": [
    {
      "pk": 1928201,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 1,
      "text": "Then Isaac called Jacob and blessed him. He charged him, saying, 'You must not take a wife from the daughters of Canaan.'",
      "links": "<a href='/AIV/1/24/3-4'>Gen. 24:3-4</a>; <a href='/AIV/1/27/46'>Gen. 27:46</a>",
      "comment": "Isaac's command echoes Abraham's care for the chosen family line, seeking a wife from among their own kin. This foreshadows the call to holiness and separation for God's people."
    },
    {
      "pk": 1928202,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 2,
      "text": "Arise, go to Paddan-aram, to the house of Bethuel your mother’s father, and take a wife from there, from the daughters of Laban your mother’s brother.",
      "links": "<a href='/AIV/1/25/20'>Gen. 25:20</a>",
      "comment": "Isaac instructs Jacob to seek a wife connected to the covenant family. This preserves the spiritual heritage. Compare the concern for faithful lineage in <a href='/AIV/1/24/3-4'>Gen. 24:3-4</a>."
    },
    {
      "pk": 1928203,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 3,
      "text": "May God Almighty bless you and make you fruitful and multiply you, that you may become a company of peoples.",
      "links": "<a href='/AIV/1/17/1-6'>Gen. 17:1-6</a>; <a href='/AIV/1/35/11'>Gen. 35:11</a>",
      "comment": "Echoes the blessing given to Abraham—promise of nationhood and divine fruitfulness, fulfilled ultimately in the people of God. The phrase 'company of peoples' points to inclusion of all nations."
    },
    {
      "pk": 1928204,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 4,
      "text": "And may He give you the blessing of Abraham, to you and to your offspring with you, that you may take possession of the land where you sojourn, which God gave to Abraham.'",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/1/13/15'>Gen. 13:15</a>; <a href='/AIV/1/26/3-4'>Gen. 26:3-4</a>",
      "comment": "The covenant promise is passed from Abraham, through Isaac, to Jacob, affirming the continuity of God's plan. Stresses inheritance through a chosen line, foreshadowing the spiritual inheritance in Christ—see <a href='/AIV/48/3/29'>Gal. 3:29</a>."
    },
    {
      "pk": 1928205,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 5,
      "text": "So Isaac sent Jacob away. He went to Paddan-aram, to Laban, son of Bethuel the Aramean, brother of Rebekah, who was the mother of Jacob and Esau.",
      "links": "<a href='/AIV/1/25/20'>Gen. 25:20</a>",
      "comment": "The journey repeats family connections and God’s providence through specific chosen relationships—a key theme throughout Genesis."
    },
    {
      "pk": 1928206,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 6,
      "text": "Now Esau saw that Isaac had blessed Jacob and sent him away to Paddan-aram to take a wife from there, and that as he blessed him, he charged him, 'You shall not take a wife from the daughters of Canaan.'",
      "links": "<a href='/AIV/1/26/34-35'>Gen. 26:34-35</a>; <a href='/AIV/1/27/46'>Gen. 27:46</a>",
      "comment": "Esau witnesses the difference in parental blessing and covenant direction—highlighting choices that set Jacob apart from Esau."
    },
    {
      "pk": 1928207,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 7,
      "text": "And Jacob obeyed his father and his mother and went to Paddan-aram.",
      "links": "",
      "comment": "Jacob's obedience upholds family tradition and blessing, unlike Esau’s disregard for parental wishes earlier. This obedience is a model for reverence and submission to God’s appointed channels of grace."
    },
    {
      "pk": 1928208,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 8,
      "text": "When Esau saw that the daughters of Canaan did not please Isaac his father,",
      "links": "<a href='/AIV/1/26/35'>Gen. 26:35</a>",
      "comment": "Recognizes Esau’s growing awareness of his own missteps concerning his marriage, but lacking spiritual insight."
    },
    {
      "pk": 1928209,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 9,
      "text": "Esau went to Ishmael and took Mahalath, the daughter of Ishmael, Abraham’s son—the sister of Nebaioth—to be his wife, in addition to the wives he had.",
      "links": "<a href='/AIV/1/16/15'>Gen. 16:15</a>; <a href='/AIV/1/25/13'>Gen. 25:13</a>",
      "comment": "Esau tries to win favor by connecting with Abraham’s family, but acts without God’s direction, illustrating attempts at righteousness apart from faith."
    },
    {
      "pk": 1928210,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 10,
      "text": "Jacob left Beersheba and went toward Haran.",
      "links": "<a href='/AIV/1/27/43'>Gen. 27:43</a>",
      "comment": "Jacob’s journey mirrors earlier departures by Abraham and Isaac, each step guided by divine promise. See <a href='/AIV/1/12/1-4'>Gen. 12:1-4</a>."
    },
    {
      "pk": 1928211,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 11,
      "text": "He reached a certain place and stayed there that night, because the sun had set. Taking a stone from that place, he put it under his head and lay down there to sleep.",
      "links": "",
      "comment": "The setting is ordinary, emphasizing how God meets Jacob in humility and vulnerability."
    },
    {
      "pk": 1928212,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 12,
      "text": "And he dreamed, and behold, a ladder was set up on the earth, and its top reached to heaven. And behold, the angels of God were ascending and descending on it.",
      "links": "<a href='/AIV/43/1/51'>John 1:51</a>",
      "comment": "The vision of the ladder symbolizes the connection between heaven and earth, foreshadowing Christ as the true mediator—see <a href='/AIV/43/1/51'>John 1:51</a>. The ascending and descending angels point to divine communication and liturgical worship."
    },
    {
      "pk": 1928213,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 13,
      "text": "And behold, the LORD stood above it, and said, 'I am the LORD, the God of Abraham your father and the God of Isaac. I will give to you and to your offspring the land on which you lie.'",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/1/26/24'>Gen. 26:24</a>",
      "comment": "God directly affirms the patriarchal promise, presenting Himself as the God of continuity and personal covenant. The land promise is given anew."
    },
    {
      "pk": 1928214,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 14,
      "text": "Your descendants will be like the dust of the earth, and you will spread abroad to the west and to the east and to the north and to the south. And in you and in your offspring all the families of the earth shall be blessed.",
      "links": "<a href='/AIV/1/13/16'>Gen. 13:16</a>; <a href='/AIV/1/12/3'>Gen. 12:3</a>; <a href='/AIV/48/3/14-16'>Gal. 3:14-16</a>",
      "comment": "Universal blessing promised through Jacob anticipates global salvation through Christ’s lineage—see <a href='/AIV/48/3/16'>Gal. 3:16</a>."
    },
    {
      "pk": 1928215,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 15,
      "text": "'And behold, I am with you, and will keep you wherever you go, and will bring you back to this land. For I will not leave you until I have done what I have promised you.'",
      "links": "<a href='/AIV/1/46/4'>Gen. 46:4</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "God’s continual presence recalls His faithfulness to the patriarchs and anticipates the promise, 'I am with you always' (<a href='/AIV/40/28/20'>Matt. 28:20</a>)."
    },
    {
      "pk": 1928216,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 16,
      "text": "Then Jacob awoke from his sleep and said, 'Surely the LORD is in this place, and I did not know it.'",
      "links": "",
      "comment": "Jacob realizes God’s presence even in ordinary places, reminding believers of God’s nearness, especially in worship and sacraments."
    },
    {
      "pk": 1928217,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 17,
      "text": "And he was afraid, and said, 'How awesome is this place! This is none other than the house of God, and this is the gate of heaven.'",
      "links": "<a href='/AIV/1/35/7'>Gen. 35:7</a>",
      "comment": "'House of God' (Bethel) shows reverence for holy places, later reflected in the sacredness of churches. The 'gate of heaven' points to access to God that culminates in Christ."
    },
    {
      "pk": 1928218,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 18,
      "text": "So early in the morning Jacob took the stone that he had put under his head and set it up as a pillar and poured oil on top of it.",
      "links": "<a href='/AIV/1/31/13'>Gen. 31:13</a>",
      "comment": "Jacob consecrates the place, instituting an anointed stone—a sign of worship, foreshadowing the sacramental use of oil and consecration."
    },
    {
      "pk": 1928219,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 19,
      "text": "He called the name of that place Bethel, but the name of the city was Luz at first.",
      "links": "<a href='/AIV/1/35/7'>Gen. 35:7</a>",
      "comment": "'Bethel' means 'house of God.' Renaming indicates a transformation of the place through God’s presence—seen in biblical patterns of name changes after encounters with God."
    },
    {
      "pk": 1928220,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 20,
      "text": "And Jacob made a vow, saying, 'If God will be with me, and keep me in this way that I go, and give me bread to eat and clothing to wear,",
      "links": "",
      "comment": "Jacob responds with a conditional vow—a common ancient practice, showing the beginnings of deeper faith. Vows feature in later Israelite worship."
    },
    {
      "pk": 1928221,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 21,
      "text": "so that I come again to my father’s house in peace, then the LORD will be my God,",
      "links": "<a href='/AIV/1/32/9-12'>Gen. 32:9-12</a>",
      "comment": "Jacob’s vow depends on God’s faithfulness and points toward personal acceptance of the covenant relationship."
    },
    {
      "pk": 1928222,
      "translation": "AIV",
      "book": 1,
      "chapter": 28,
      "verse": 22,
      "text": "and this stone, which I have set up as a pillar, will be God’s house, and of all that you give me I will surely give a tenth to you.'",
      "links": "<a href='/AIV/1/14/20'>Gen. 14:20</a>; <a href='/AIV/3/27/30-32'>Lev. 27:30-32</a>",
      "comment": "Jacob promises a tithe, recognizing God’s provision and prefiguring the biblical practice of giving. The pillar anticipates the idea of dedicated sacred space and worship enacted by the faithful, which finds fulfillment in Christ's one Church."
    }
  ],
  "translatedAt": "2025-12-23T08:48:34.207Z"
}