{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 32,
  "verses": [
    {
      "pk": 1932232,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 1,
      "text": "Jacob went on his way, and the angels of God met him.",
      "links": "<a href='/AIV/1/28/12'>Gen. 28:12</a>; <a href='/AIV/19/91/11'>Ps. 91:11</a>",
      "comment": "This verse echoes Jacob's earlier vision in Bethel (Genesis 28:12). The presence of angels signals God's ongoing protection, foreshadowing key moments where divine messengers mediate between God and man."
    },
    {
      "pk": 1932233,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 2,
      "text": "When Jacob saw them, he said, 'This is God’s camp.' So he called that place Mahanaim.",
      "links": "<a href='/AIV/1/28/17'>Gen. 28:17</a>; <a href='/AIV/12/6/17'>2 Kings 6:17</a>",
      "comment": "Mahaniam means 'two camps,' referencing both Jacob’s camp and the angelic host. This underlines the idea of the visible and invisible realities coexisting, a theme seen in spiritual interpretations of scripture."
    },
    {
      "pk": 1932234,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 3,
      "text": "Jacob sent messengers ahead of him to Esau his brother in the land of Seir, the country of Edom.",
      "links": "<a href='/AIV/1/25/30'>Gen. 25:30</a>; <a href='/AIV/1/36/8'>Gen. 36:8</a>",
      "comment": "Jacob’s attempt at reconciliation reflects humility and the seeking of peace, a principle emphasized throughout both Old and New Testament teaching (see Matthew 5:23–24)."
    },
    {
      "pk": 1932235,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 4,
      "text": "He instructed them, saying, 'This is what you shall say to my lord Esau: Your servant Jacob says, ‘I have lived as a foreigner with Laban and stayed until now.’'",
      "links": "<a href='/AIV/1/27/29'>Gen. 27:29</a>",
      "comment": "Jacob calls Esau 'my lord,' showing deference despite the earlier blessing of authority (Genesis 27:29). This reversal shows his repentance and reconciliation."
    },
    {
      "pk": 1932236,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 5,
      "text": "'I have oxen, donkeys, flocks, male servants, and female servants. I have sent to tell my lord, so that I may find favor in your sight.'",
      "links": "<a href='/AIV/1/30/43'>Gen. 30:43</a>; <a href='/AIV/1/33/8'>Gen. 33:8</a>",
      "comment": "Jacob's gifts prefigure the concept of penance and reparation, offering restitution for past wrongs and seeking reconciliation, a recurring biblical theme."
    },
    {
      "pk": 1932237,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 6,
      "text": "The messengers returned to Jacob, saying, 'We came to your brother Esau, and he is coming to meet you, and four hundred men are with him.'",
      "links": "<a href='/AIV/1/33/1'>Gen. 33:1</a>",
      "comment": "Esau's approach with many men appears threatening, heightening Jacob’s anxiety but also setting the stage for the dramatic encounter that follows."
    },
    {
      "pk": 1932238,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 7,
      "text": "Jacob was greatly afraid and distressed. He divided the people who were with him, and the flocks and herds and camels, into two camps,",
      "links": "<a href='/AIV/1/32/10'>Gen. 32:10</a>",
      "comment": "Jacob acts prudently, preparing for possible disaster. His fear brings him to depend more deeply on God, a pattern mirrored in many biblical stories."
    },
    {
      "pk": 1932239,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 8,
      "text": "thinking, 'If Esau comes to one camp and attacks it, then the camp that is left will escape.'",
      "links": "<a href='/AIV/1/32/7'>Gen. 32:7</a>",
      "comment": "Jacob’s strategic planning alongside prayer illustrates the call to use wisdom in crisis while also relying on divine help."
    },
    {
      "pk": 1932240,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 9,
      "text": "Jacob said, 'O God of my father Abraham and God of my father Isaac, LORD, who said to me, “Return to your country and to your family, and I will do you good,”'",
      "links": "<a href='/AIV/1/28/13-15'>Gen. 28:13–15</a>; <a href='/AIV/2/3/6'>Ex. 3:6</a>",
      "comment": "Jacob appeals to God’s promises to the patriarchs, demonstrating the importance of tradition and continuity in faith. This pattern of invoking ancestral faith finds echoes in later biblical prayers."
    },
    {
      "pk": 1932241,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 10,
      "text": "'I am not worthy of all the kindness and all the faithfulness that you have shown to your servant, for I crossed this Jordan with only my staff, and now I have become two camps.'",
      "links": "<a href='/AIV/1/28/18'>Gen. 28:18</a>; <a href='/AIV/19/8/4'>Ps. 8:4</a>",
      "comment": "Jacob’s humility is central. A recognition of unworthiness is a key attitude before God, connecting with later teachings about grace and mercy."
    },
    {
      "pk": 1932242,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 11,
      "text": "'Deliver me, I pray, from the hand of my brother, from the hand of Esau, for I fear him, that he may come and strike me and the mothers with the children.'",
      "links": "<a href='/AIV/19/34/4'>Ps. 34:4</a>",
      "comment": "Jacob’s prayer for deliverance is echoed in many Psalms. His plea reflects faith in the rescuing power of God, a recurring theme throughout scripture."
    },
    {
      "pk": 1932243,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 12,
      "text": "'But you said, “I will surely do you good, and make your offspring as the sand of the sea, which cannot be counted because of its multitude.”'",
      "links": "<a href='/AIV/1/22/17'>Gen. 22:17</a>; <a href='/AIV/1/28/14'>Gen. 28:14</a>",
      "comment": "He lays claim to God's promises of abundant descendants (see Genesis 13:16 and 22:17). Faith in God's word is shown to be a safeguard in times of trial."
    },
    {
      "pk": 1932244,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 13,
      "text": "He spent that night there, and from what he had he selected a gift for his brother Esau:",
      "links": "<a href='/AIV/1/33/10-11'>Gen. 33:10–11</a>",
      "comment": "The gift is an act of peacemaking, reminiscent of wisdom literature’s teaching to turn away wrath with kindness (Proverbs 15:1)."
    },
    {
      "pk": 1932245,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 14,
      "text": "two hundred female goats and twenty male goats, two hundred ewes and twenty rams,",
      "links": "",
      "comment": "Jacob’s substantial offering testifies to his prosperity, hinting at the theme of blessing received and now being given back sacrificially."
    },
    {
      "pk": 1932246,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 15,
      "text": "thirty female camels with their young, forty cows and ten bulls, twenty female donkeys and ten male donkeys.",
      "links": "",
      "comment": "Such detailed enumeration of gifts exemplifies generosity, a virtue praised in wisdom literature (Proverbs 11:25)."
    },
    {
      "pk": 1932247,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 16,
      "text": "He put them in the care of his servants, every herd by itself, and said to his servants, 'Go on ahead of me, and keep some distance between the herds.'",
      "links": "",
      "comment": "Jacob orders the gifts in succession to create an impression of repeated goodwill, emphasizing reconciliation through repeated acts of kindness."
    },
    {
      "pk": 1932248,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 17,
      "text": "He instructed the first one, saying, 'When my brother Esau meets you and asks, “To whom do you belong? Where are you going, and whose are these ahead of you?”',",
      "links": "",
      "comment": "The carefully prepared message highlights honesty and transparency as foundations for restored relationships."
    },
    {
      "pk": 1932249,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 18,
      "text": "then you shall say, 'They belong to your servant Jacob. They are a gift sent to my lord Esau. And he himself is behind us.'",
      "links": "<a href='/AIV/1/33/3'>Gen. 33:3</a>",
      "comment": "Jacob repeats the servant-lord language, further humbling himself—a model for repentance and reconciliation."
    },
    {
      "pk": 1932250,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 19,
      "text": "He also instructed the second and the third, and all those who followed the herds, 'You shall speak in this way to Esau when you find him,",
      "links": "",
      "comment": "The repeated instruction emphasizes persistent humility and peace-seeking, which lays the groundwork for true reconciliation."
    },
    {
      "pk": 1932251,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 20,
      "text": "and you shall say, “And behold, your servant Jacob is behind us.”' For he thought, 'I may appease him with the gift that goes ahead of me, and afterwards I shall see his face; perhaps he will accept me.'",
      "links": "<a href='/AIV/1/33/10'>Gen. 33:10</a>",
      "comment": "Seeing 'Esau’s face' underscores the longing for restored fellowship. The logic mirrors approaches to reconciliation in spiritual practice."
    },
    {
      "pk": 1932252,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 21,
      "text": "So the gift went ahead of him, but he himself spent that night in the camp.",
      "links": "",
      "comment": "Jacob’s remaining behind stresses his vulnerability and anxiety before the crisis—a foreshadowing of spiritual trials before moments of transformation."
    },
    {
      "pk": 1932253,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 22,
      "text": "That night he got up and took his two wives, his two female servants, and his eleven sons, and crossed over the ford of the Jabbok.",
      "links": "<a href='/AIV/1/33/2'>Gen. 33:2</a>; <a href='/AIV/1/46/8-27'>Gen. 46:8–27</a>",
      "comment": "Jacob’s crossing the Jabbok marks the threshold of his spiritual wrestling, frequently interpreted as an image of conversion or transformation."
    },
    {
      "pk": 1932254,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 23,
      "text": "He took them and sent them across the stream, and sent over everything that he had.",
      "links": "",
      "comment": "Now alone, Jacob is prepared for a direct encounter with God—solitude is often the setting for divine encounters in scripture."
    },
    {
      "pk": 1932255,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 24,
      "text": "Jacob was left alone, and a man wrestled with him until the breaking of day.",
      "links": "<a href='/AIV/1/35/9-13'>Gen. 35:9–13</a>; <a href='/AIV/28/12/3-4'>Hos. 12:3–4</a>",
      "comment": "Tradition holds this 'man' as either an angel or a theophany—a direct encounter with God. The wrestling is seen both literally and spiritually as an image of striving with God in prayer and suffering."
    },
    {
      "pk": 1932256,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 25,
      "text": "When he saw that he could not overpower him, he touched Jacob’s hip socket, and Jacob’s hip was wrenched as he wrestled with him.",
      "links": "",
      "comment": "The permanent injury signifies transformation through costly struggle—a precursor to the 'mark' of discipleship Paul later describes (Galatians 6:17)."
    },
    {
      "pk": 1932257,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 26,
      "text": "Then he said, 'Let me go, for the day is breaking.' But Jacob said, 'I will not let you go unless you bless me.'",
      "links": "<a href='/AIV/1/27/27'>Gen. 27:27</a>; <a href='/AIV/1/28/1'>Gen. 28:1</a>",
      "comment": "Jacob’s demand for blessing shows perseverance in prayer and dependence on God’s favor, themes later echoed in Jesus’ teaching (Luke 11:8–10)."
    },
    {
      "pk": 1932258,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 27,
      "text": "He asked him, 'What is your name?' He replied, 'Jacob.'",
      "links": "<a href='/AIV/1/27/36'>Gen. 27:36</a>",
      "comment": "Naming signifies identity; Jacob comes openly in truth, signifying confession and readiness for a new calling."
    },
    {
      "pk": 1932259,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 28,
      "text": "Then he said, 'Your name shall no longer be Jacob, but Israel; for you have struggled with God and with men, and have prevailed.'",
      "links": "<a href='/AIV/1/35/10'>Gen. 35:10</a>; <a href='/AIV/28/12/3-4'>Hos. 12:3–4</a>",
      "comment": "The renaming prefigures the giving of a new identity after a spiritual victory. ‘Israel’ points to the chosen people, a theme foundational to biblical salvation history."
    },
    {
      "pk": 1932260,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 29,
      "text": "Jacob said, 'Please tell me your name.' But he said, 'Why do you ask my name?' And he blessed him there.",
      "links": "<a href='/AIV/7/13/17-18'>Judges 13:17–18</a>",
      "comment": "The refusal to reveal the name suggests divine mystery, as seen in later encounters (Judges 13:17–18), foreshadowing the mysteries revealed in Christ."
    },
    {
      "pk": 1932261,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 30,
      "text": "Jacob called the name of the place Peniel, saying, 'For I have seen God face to face, and yet my life has been preserved.'",
      "links": "<a href='/AIV/2/33/20-23'>Ex. 33:20–23</a>; <a href='/AIV/7/6/22-23'>Judges 6:22–23</a>",
      "comment": "Seeing God 'face to face' prefigures later biblical quests for the divine presence. Jacob’s preservation anticipates the mercy found in such encounters."
    },
    {
      "pk": 1932262,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 31,
      "text": "The sun rose upon him as he passed by Penuel, limping because of his hip.",
      "links": "<a href='/AIV/2/14/19-22'>Ex. 14:19–22</a>",
      "comment": "Jacob walks away transformed and marked, a recurring motif for those chosen through suffering—anticipating the disciples’ journey in the Gospels."
    },
    {
      "pk": 1932263,
      "translation": "AIV",
      "book": 1,
      "chapter": 32,
      "verse": 32,
      "text": "Therefore, to this day the Israelites do not eat the tendon attached to the socket of the hip, because he touched Jacob’s hip socket at the tendon.",
      "links": "<a href='/AIV/3/11/1-47'>Lev. 11:1–47</a>",
      "comment": "This dietary law commemorates Jacob’s encounter, emphasizing the value of remembrance and sacred tradition within the life of God's people."
    }
  ],
  "translatedAt": "2025-12-23T08:51:29.722Z"
}