{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 27,
  "verses": [
    {
      "pk": 1272701,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 1,
      "text": "When Isaac was old and his eyes were so weak that he could not see, he called Esau his older son and said to him, “My son.” And he answered, “Here I am.”",
      "links": "<a href='/AIV/1/25/25'>Gen. 25:25</a>",
      "comment": "The narrative begins with Isaac’s old age and blindness, signaling the transfer of blessing and leadership."
    },
    {
      "pk": 1272702,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 2,
      "text": "He said, “Look, I am old and do not know the day of my death.",
      "links": "",
      "comment": "Isaac acknowledges his mortality, a theme echoed often in later wisdom literature (Ps. 90:12)."
    },
    {
      "pk": 1272703,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 3,
      "text": "So now, take your hunting gear—your quiver and your bow—and go out to the open country and hunt some game for me.",
      "links": "<a href='/AIV/1/25/27'>Gen. 25:27</a>",
      "comment": "The mention of game underscores Esau’s role as hunter, foreshadowing the coming contrast with Jacob."
    },
    {
      "pk": 1272704,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 4,
      "text": "And prepare for me a tasty meal, such as I love, and bring it to me so that I may eat and give you my blessing before I die.”",
      "links": "<a href='/AIV/1/27/7'>Gen. 27:7</a>",
      "comment": "The blessing was a deeply significant act, believed to confer God’s favor and carry legal and spiritual authority."
    },
    {
      "pk": 1272705,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 5,
      "text": "Now Rebekah was listening as Isaac spoke to his son Esau. And when Esau went out into the field to hunt game and bring it,",
      "links": "",
      "comment": "Rebekah’s intervention is pivotal—she knows God’s prophecy (Gen. 25:23) that the older shall serve the younger."
    },
    {
      "pk": 1272706,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 6,
      "text": "Rebekah said to her son Jacob, “Listen! I heard your father speaking to your brother Esau:",
      "links": "",
      "comment": "Notice that Rebekah refers to Esau as ‘your brother,’ signaling both intimacy and rivalry."
    },
    {
      "pk": 1272707,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 7,
      "text": "‘Bring me some game and prepare a tasty meal for me, that I may eat and bless you in the presence of the Lord before I die.’",
      "links": "",
      "comment": "The presence of the Lord here underlines the sacredness of the blessing act."
    },
    {
      "pk": 1272708,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 8,
      "text": "Now, my son, listen to my voice as I command you.",
      "links": "",
      "comment": "Obedience to parental authority is modeled here, though the method is complex (cf. Ex. 20:12)."
    },
    {
      "pk": 1272709,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 9,
      "text": "Go to the flock and bring me two choice young goats, so I can prepare them as a tasty meal for your father, just as he likes.",
      "links": "",
      "comment": "The substitution of goats for game is key to the plan; this act of mediation will have many implications in salvation history."
    },
    {
      "pk": 1272710,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 10,
      "text": "Then you shall bring it to your father, so that he may eat and give you his blessing before he dies.”",
      "links": "",
      "comment": "The primacy of the father’s blessing in conferring spiritual headship is highlighted (cf. Heb. 11:20)."
    },
    {
      "pk": 1272711,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 11,
      "text": "But Jacob said to his mother Rebekah, “Look, my brother Esau is a hairy man, and I am a smooth man.",
      "links": "<a href='/AIV/1/25/25'>Gen. 25:25</a>",
      "comment": "Jacob’s concern shows his practical nature and sets up the impending deception."
    },
    {
      "pk": 1272712,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 12,
      "text": "Suppose my father touches me, and I will seem to be mocking him, and bring a curse on myself instead of a blessing.”",
      "links": "",
      "comment": "The risk is real—blessings and curses are spoken with weight (cf. Num. 22–24)."
    },
    {
      "pk": 1272713,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 13,
      "text": "His mother said to him, “Let your curse be on me, my son. Just listen to me, and go get them for me.”",
      "links": "",
      "comment": "Rebekah’s willingness to bear a curse for Jacob prefigures ideas of mediation and intercession that appear throughout Scripture."
    },
    {
      "pk": 1272714,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 14,
      "text": "So he went and got them and brought them to his mother, and his mother prepared a tasty meal, just as his father loved.",
      "links": "",
      "comment": "Obedience to his mother leads Jacob directly into the plan that will change the trajectory of salvation history."
    },
    {
      "pk": 1272715,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 15,
      "text": "Then Rebekah took the best clothes of Esau her older son, which were with her in the house, and put them on Jacob her younger son.",
      "links": "",
      "comment": "Esau’s clothing serves to heighten the deception, recalling how clothing often carries symbolic meaning (cf. Gen. 37:3)."
    },
    {
      "pk": 1272716,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 16,
      "text": "And she put the skins of the young goats on his hands and on the smooth part of his neck.",
      "links": "",
      "comment": "Physical reminders and material objects are used to mediate spiritual realities—much as they would be in later biblical worship."
    },
    {
      "pk": 1272717,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 17,
      "text": "Then she put the tasty meal and the bread that she had prepared into the hand of her son Jacob.",
      "links": "",
      "comment": "Jacob now holds both the sign of food and the clothing that signifies birthright."
    },
    {
      "pk": 1272718,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 18,
      "text": "He went in to his father and said, “My father.” He said, “Here I am. Who are you, my son?”",
      "links": "",
      "comment": "Isaac’s repeated questioning anticipates uncertainty, a theme that will appear elsewhere (cf. Gen. 37:32–34)."
    },
    {
      "pk": 1272719,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 19,
      "text": "Jacob said to his father, “I am Esau your firstborn. I have done as you told me. Now sit up and eat from my game, so that you may give me your blessing.”",
      "links": "",
      "comment": "Jacob’s deception is active here. God’s providence still works through flawed human choices (cf. Rom. 8:28)."
    },
    {
      "pk": 1272720,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 20,
      "text": "Isaac said to his son, “How is it that you found it so quickly, my son?” He answered, “Because the Lord your God made it happen for me.”",
      "links": "",
      "comment": "Jacob invokes God’s name, showing both boldness and the seriousness of invoking divine authority."
    },
    {
      "pk": 1272721,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 21,
      "text": "Then Isaac said to Jacob, “Come near so I can touch you, my son, to know whether you really are my son Esau or not.”",
      "links": "",
      "comment": "Isaac seeks physical confirmation, showing the importance of tactile assurance in a world lacking modern verification."
    },
    {
      "pk": 1272722,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 22,
      "text": "So Jacob went near his father Isaac, who touched him and said, “The voice is Jacob’s voice, but the hands are the hands of Esau.”",
      "links": "",
      "comment": "Isaac’s senses are at odds—a motif of mistaken identity that appears throughout the Old Testament."
    },
    {
      "pk": 1272723,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 23,
      "text": "He did not recognize him, because his hands were hairy like his brother Esau’s hands; so he blessed him.",
      "links": "",
      "comment": "Despite all doubt, the blessing is pronounced—a mysterious working of providence that supersedes human intention (cf. Prov. 19:21)."
    },
    {
      "pk": 1272724,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 24,
      "text": "He asked, “Are you really my son Esau?” Jacob answered, “I am.”",
      "links": "",
      "comment": "A last test: the narrative emphasizes the ambiguity of Jacob’s methods, but shows that the blessing is, mysteriously, valid."
    },
    {
      "pk": 1272725,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 25,
      "text": "Then he said, “Bring it to me, so that I may eat from my son’s game and bless you.” So he brought it to him, and he ate. He brought him wine, and he drank.",
      "links": "",
      "comment": "Sharing bread and wine together echoes themes of covenant and the importance of ritual meals (cf. Gen. 14:18; Matt. 26:26–28)."
    },
    {
      "pk": 1272726,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 26,
      "text": "Then his father Isaac said to him, “Come near and kiss me, my son.”",
      "links": "<a href='/AIV/1/48/10'>Gen. 48:10</a>",
      "comment": "A kiss seals the bond—gestures convey spiritual realities, laying groundwork for later rituals of blessing."
    },
    {
      "pk": 1272727,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 27,
      "text": "So he came near and kissed him. And Isaac smelled the scent of his clothes and blessed him, saying: “See, the smell of my son is like the smell of a field that the Lord has blessed.",
      "links": "",
      "comment": "The blessing is closely linked to the physical and material, highlighting the goodness of creation and God’s continued providence."
    },
    {
      "pk": 1272728,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 28,
      "text": "May God give you the dew of heaven and the richness of the earth, an abundance of grain and new wine.",
      "links": "<a href='/AIV/1/49/25'>Gen. 49:25</a>",
      "comment": "Material blessings are recognized as divine gifts. Dew and wine are images used throughout Scripture to signify divine favor."
    },
    {
      "pk": 1272729,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 29,
      "text": "May peoples serve you and nations bow down to you. Be lord over your brothers, and may your mother’s sons bow down to you. Cursed be everyone who curses you, and blessed be everyone who blesses you!”",
      "links": "<a href='/AIV/1/12/3'>Gen. 12:3</a>; <a href='/AIV/1/25/23'>Gen. 25:23</a>",
      "comment": "Echoes God’s covenant promise to Abraham. Through this, the chosen line’s authority is firmly established."
    },
    {
      "pk": 1272730,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 30,
      "text": "As soon as Isaac had finished blessing Jacob, and Jacob had scarcely gone out from the presence of Isaac his father, Esau his brother came in from his hunting.",
      "links": "",
      "comment": "The timing is providential—Jacob leaves just before Esau returns, showing the hidden hand of God."
    },
    {
      "pk": 1272731,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 31,
      "text": "He, too, prepared a tasty meal and brought it to his father. He said to his father, “Let my father arise and eat from his son’s game, so that you may bless me.”",
      "links": "",
      "comment": "Esau’s eagerness reveals his expectation, but also the irrevocable nature of spoken blessing."
    },
    {
      "pk": 1272732,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 32,
      "text": "His father Isaac said to him, “Who are you?” And he answered, “I am your son, your firstborn, Esau.”",
      "links": "",
      "comment": "The crisis point—Isaac discovers the deception and the tension surges."
    },
    {
      "pk": 1272733,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 33,
      "text": "Then Isaac trembled violently and said, “Who was it, then, that hunted game and brought it to me, and I ate before you came, and I blessed him? Indeed, he shall be blessed.”",
      "links": "<a href='/AIV/1/48/20'>Gen. 48:20</a>",
      "comment": "Isaac’s trembling signals awe before God’s will—even human plans cannot override the providence of the Lord."
    },
    {
      "pk": 1272734,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 34,
      "text": "When Esau heard his father’s words, he cried out with an exceedingly great and bitter cry, and said to his father, “Bless me, even me also, O my father!”",
      "links": "<a href='/AIV/58/12/17'>Heb. 12:17</a>",
      "comment": "Esau’s lament shows the value of blessing in Old Testament life. Later referenced in Hebrews 12:17 to illustrate the consequences of despising God’s gift."
    },
    {
      "pk": 1272735,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 35,
      "text": "But he said, “Your brother came deceitfully, and has taken away your blessing.”",
      "links": "",
      "comment": "Isaac confirms the transaction is finished, giving the blessing enduring power even if the means were questionable."
    },
    {
      "pk": 1272736,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 36,
      "text": "Esau said, “Is he not rightly named Jacob? For he has cheated me these two times. He took away my birthright, and now, look, he has taken away my blessing.” And he said, “Have you not reserved a blessing for me?”",
      "links": "<a href='/AIV/1/25/29-34'>Gen. 25:29–34</a>",
      "comment": "Esau’s anguished wordplay highlights the consequences of despising spiritual inheritance."
    },
    {
      "pk": 1272737,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 37,
      "text": "Isaac answered and said to Esau, “Look, I have made him lord over you, and all his brothers I have given to him as servants, and with grain and new wine I have sustained him. What then can I do for you, my son?”",
      "links": "",
      "comment": "Isaac describes the completeness of the blessing—it cannot be undone or retracted (cf. Num. 23:20)."
    },
    {
      "pk": 1272738,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 38,
      "text": "Esau said to his father, “Do you have only one blessing, my father? Bless me also, my father.” And Esau lifted up his voice and wept.",
      "links": "",
      "comment": "Esau’s plea and emotion reveal the deep importance of the spoken word—reminding us that choices regarding God’s gifts matter eternally."
    },
    {
      "pk": 1272739,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 39,
      "text": "Then Isaac his father answered and said to him: “See, your dwelling shall be away from the richness of the earth, and away from the dew of heaven above.",
      "links": "",
      "comment": "The ‘anti-blessing’: Esau’s fate lies apart from the central stream of the promise, yet he is not cursed (cf. Gen. 36:8–9)."
    },
    {
      "pk": 1272740,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 40,
      "text": "By your sword you shall live, and you shall serve your brother; but when you become restless, you shall break his yoke from your neck.”",
      "links": "",
      "comment": "Esau’s descendants will eventually gain independence, but never receive the central promise line."
    },
    {
      "pk": 1272741,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 41,
      "text": "Esau hated Jacob because of the blessing with which his father had blessed him, and Esau said in his heart, 'The days of mourning for my father are at hand; then I will kill my brother Jacob.'",
      "links": "<a href='/AIV/1/37/4'>Gen. 37:4</a>",
      "comment": "Sibling hatred and conflict anticipate many later narratives (cf. Cain and Abel, Gen. 4:8; Joseph and his brothers, Gen. 37)."
    },
    {
      "pk": 1272742,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 42,
      "text": "But the words of Esau her older son were told to Rebekah. So she sent and called Jacob her younger son, and said to him, “Look, your brother Esau is comforting himself by planning to kill you.",
      "links": "",
      "comment": "Rebekah acts to protect Jacob, reminiscent of how mothers often intervene throughout salvation history (cf. Ex. 2:2–3)."
    },
    {
      "pk": 1272743,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 43,
      "text": "Now, my son, obey my voice; arise, flee to my brother Laban in Haran,",
      "links": "<a href='/AIV/1/28/5'>Gen. 28:5</a>",
      "comment": "Jacob’s journey to Laban sets up the next great era of the covenant story."
    },
    {
      "pk": 1272744,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 44,
      "text": "and stay with him a while, until your brother's fury turns away.",
      "links": "",
      "comment": "Time and distance are used as means of reconciliation and protection."
    },
    {
      "pk": 1272745,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 45,
      "text": "Until your brother’s anger turns away, and he forgets what you have done to him. Then I will send and bring you back from there. Why should I be bereaved of you both in one day?”",
      "links": "",
      "comment": "Rebekah’s concern reflects the ongoing theme of the preservation of the promise-bearer."
    },
    {
      "pk": 1272746,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 46,
      "text": "Then Rebekah said to Isaac, “I am weary of my life because of the daughters of Heth. If Jacob takes a wife from the daughters of Heth, like these, from the daughters of the land, what good will my life be to me?”",
      "links": "<a href='/AIV/1/26/34'>Gen. 26:34–35</a>",
      "comment": "Rebekah’s request for Jacob to avoid a Canaanite wife sets the stage for the idea of marrying within the faith (cf. Deut. 7:3–4; 2 Cor. 6:14)."
    }
  ],
  "translatedAt": "2025-12-23T08:48:04.030Z"
}