{
  "book": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 36,
  "verses": [
    {
      "pk": 1933641,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 1,
      "text": "Now these are the generations of Esau, that is, Edom.",
      "links": "<a href='/AIV/1/25/30'>Genesis 25:30</a>; <a href='/AIV/1/32/3'>Genesis 32:3</a>",
      "comment": "This opens the genealogy of Esau, also called Edom. Names and lineage hold special significance, often serving as theological points—not only for heritage but also to demonstrate the unfolding of God's promises, even to those outside the main line of Jacob."
    },
    {
      "pk": 1933642,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 2,
      "text": "Esau took his wives from the daughters of Canaan: Adah the daughter of Elon the Hittite, Oholibamah the daughter of Anah, the daughter of Zibeon the Hivite,",
      "links": "<a href='/AIV/1/26/34'>Genesis 26:34</a>",
      "comment": "Esau’s wives were Canaanites, contrary to Isaac and Rebekah’s wish for their children to marry within their broader family. The faithfulness to God’s family line is a recurring biblical theme (see Genesis 28:1), anticipating the importance of spiritual lineage in later revelation."
    },
    {
      "pk": 1933643,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 3,
      "text": "and Basemath, Ishmael’s daughter, the sister of Nebaioth.",
      "links": "<a href='/AIV/1/28/9'>Genesis 28:9</a>",
      "comment": "Basemath ties Esau’s line to the descendants of Ishmael, reinforcing Edom’s role as both connected to and distinct from the chosen line of Israel."
    },
    {
      "pk": 1933644,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 4,
      "text": "Adah bore to Esau Eliphaz; Basemath bore Reuel;",
      "links": "<a href='/AIV/1/36/10'>Genesis 36:10</a>",
      "comment": "Noting these descendants provides context for Edom’s later development and role alongside Israel in salvation history."
    },
    {
      "pk": 1933645,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 5,
      "text": "Oholibamah bore Jeush, Jalam, and Korah. These are the sons of Esau, who were born to him in the land of Canaan.",
      "links": "",
      "comment": "The three main wives of Esau and their sons. This genealogical detail reflects how nations can trace their beginnings to individuals, showing how God’s providence extends beyond the direct line of promise."
    },
    {
      "pk": 1933646,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 6,
      "text": "Then Esau took his wives, his sons, his daughters, and all the people of his house, and his livestock, all his animals, and all his possessions, which he had gotten in the land of Canaan, and went into a land away from his brother Jacob.",
      "links": "<a href='/AIV/1/31/18'>Genesis 31:18</a>",
      "comment": "Esau’s separation from Jacob fulfills the earlier prophecy that the two would become distinct nations (Genesis 25:23). Such themes are echoed later in biblical history and typologically point to the spiritual reality of separation and reconciliation."
    },
    {
      "pk": 1933647,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 7,
      "text": "For their possessions were too great for them to dwell together, and the land where they sojourned could not support them because of their livestock.",
      "links": "<a href='/AIV/1/13/6'>Genesis 13:6</a>",
      "comment": "Like Abraham and Lot before them, abundance necessitates separation, serving as a practical outworking of God’s providence, yet also fulfilling God’s earlier pronouncement regarding the destinies of Jacob and Esau."
    },
    {
      "pk": 1933648,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 8,
      "text": "So Esau lived in the hill country of Seir. Esau is Edom.",
      "links": "<a href='/AIV/1/32/3'>Genesis 32:3</a>",
      "comment": "‘Seir’ reflects the territory given to Esau’s descendants, distinct from Israel. The restating of ‘Esau is Edom’ reiterates the beginning of a nation by Esau apart from his brother."
    },
    {
      "pk": 1933649,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 9,
      "text": "And these are the generations of Esau the father of the Edomites in the hill country of Seir;",
      "links": "",
      "comment": "Esau becomes the father of the Edomites—a significant Old Testament nation. Edom plays a recurring, sometimes adversarial, role in Israel’s story, setting the stage for future spiritual lessons."
    },
    {
      "pk": 1933650,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 10,
      "text": "These are the names of Esau’s sons: Eliphaz the son of Adah, Esau’s wife; Reuel the son of Basemath, Esau’s wife.",
      "links": "",
      "comment": "The genealogy is repeated to emphasize the fullness of Esau’s line, which can act as a counterpoint to the chosen people’s line, showcasing how God remains just in blessing all the nations (see Genesis 12:3)."
    },
    {
      "pk": 1933651,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 11,
      "text": "The sons of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz.",
      "links": "<a href='/AIV/1/36/15'>Genesis 36:15</a>",
      "comment": "Teman would later become the name of a prominent Edomite clan, and is referenced by the prophets as a symbol of Edomite wisdom and strength (see Jeremiah 49:7)."
    },
    {
      "pk": 1933652,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 12,
      "text": "Timna was a concubine to Eliphaz, Esau’s son; and she bore Amalek to Eliphaz. These are the sons of Adah, Esau’s wife.",
      "links": "<a href='/AIV/1/14/7'>Genesis 14:7</a>; <a href='/AIV/2/17/8'>Exodus 17:8</a>",
      "comment": "The mention of Amalek is crucial; his descendants become later adversaries of Israel (Exodus 17:8). This exemplifies how early familial decisions have long-lasting national significance—a lesson on virtue and faithfulness."
    },
    {
      "pk": 1933653,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 13,
      "text": "These are the sons of Reuel: Nahath, Zerah, Shammah, and Mizzah. These were the sons of Basemath, Esau’s wife.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933654,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 14,
      "text": "These were the sons of Oholibamah the daughter of Anah, the daughter of Zibeon, Esau’s wife: she bore to Esau Jeush, Jalam, and Korah.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933655,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 15,
      "text": "These are the chiefs of the sons of Esau. The sons of Eliphaz, the firstborn of Esau: the chiefs Teman, Omar, Zepho, Kenaz,",
      "links": "",
      "comment": "Every name listed as a 'chief' or 'duke' marks both a family and a territorial group, reminding us how God's providence includes the ordering of nations and peoples (Acts 17:26)."
    },
    {
      "pk": 1933656,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 16,
      "text": "Korah, Gatam, and Amalek. These are the chiefs that came from Eliphaz in the land of Edom. These are the sons of Adah.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933657,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 17,
      "text": "These are the sons of Reuel, Esau's son: the chiefs Nahath, Zerah, Shammah, and Mizzah. These are the chiefs that came from Reuel in the land of Edom. These are the sons of Basemath, Esau’s wife.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933658,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 18,
      "text": "These are the sons of Oholibamah, Esau’s wife: the chiefs Jeush, Jalam, and Korah. These are the chiefs that came from Oholibamah the daughter of Anah, Esau’s wife.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933659,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 19,
      "text": "These are the sons of Esau (that is, Edom), and these are their chiefs.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933660,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 20,
      "text": "These are the sons of Seir the Horite, the natives of the land: Lotan, Shobal, Zibeon, Anah,",
      "links": "<a href='/AIV/1/14/6'>Genesis 14:6</a>",
      "comment": "The Horites were the original people of Seir, with whom Esau’s descendants intermarried and eventually displaced—reflecting the complex unfolding of God’s providence through history."
    },
    {
      "pk": 1933661,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 21,
      "text": "Dishon, Ezer, and Dishan. These are the chiefs of the Horites, the sons of Seir, in the land of Edom.",
      "links": "",
      "comment": "Naming the chiefs emphasizes how governance and community leadership emerge early in biblical history—foreshadowing later spiritual leadership structures."
    },
    {
      "pk": 1933662,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 22,
      "text": "The sons of Lotan were Hori and Hemam; and Lotan’s sister was Timna.",
      "links": "",
      "comment": "Timna, mentioned again, connects to the Amalekites. The linkage of individuals and nations here is a reminder of the far-reaching consequences of family lines."
    },
    {
      "pk": 1933663,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 23,
      "text": "These are the sons of Shobal: Alvan, Manahath, Ebal, Shepho, and Onam.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933664,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 24,
      "text": "These are the sons of Zibeon: Aiah and Anah. (This is the Anah who found the hot springs in the wilderness as he pastured the donkeys of Zibeon his father.)",
      "links": "",
      "comment": "The mention of Anah and the hot springs reflects the retention of real historical detail. The Bible includes both natural and supernatural providence in its record."
    },
    {
      "pk": 1933665,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 25,
      "text": "These are the children of Anah: Dishon, and Oholibamah the daughter of Anah.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933666,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 26,
      "text": "These are the sons of Dishon: Hemdan, Eshban, Ithran, and Cheran.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933667,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 27,
      "text": "These are the sons of Ezer: Bilhan, Zaavan, and Akan.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933668,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 28,
      "text": "These are the sons of Dishan: Uz and Aran.",
      "links": "<a href='/AIV/1/10/23'>Genesis 10:23</a>; <a href='/AIV/18/1/1'>Job 1:1</a>",
      "comment": "Uz is an important name, as the land of Uz is later the setting for the Book of Job. This kind of interconnection of biblical geography and narrative hints at providential order."
    },
    {
      "pk": 1933669,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 29,
      "text": "These are the chiefs of the Horites: chief Lotan, chief Shobal, chief Zibeon, chief Anah,",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933670,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 30,
      "text": "chief Dishon, chief Ezer, and chief Dishan. These are the chiefs of the Horites, according to their clans in the land of Seir.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933671,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 31,
      "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites.",
      "links": "<a href='/AIV/9/8/20'>1 Samuel 8:5</a>; <a href='/AIV/5/17/14'>Deuteronomy 17:14</a>",
      "comment": "Edom’s monarchy predates Israel’s. This detail demonstrates God allows different shapes of governance among nations, but Israel’s monarchy is established by God’s direct command (Deuteronomy 17:14). Spiritual authority in the people of God is always derived, not self-assumed."
    },
    {
      "pk": 1933672,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 32,
      "text": "Bela the son of Beor reigned in Edom, and the name of his city was Dinhabah.",
      "links": "",
      "comment": "Bela’s name recalls Balaam son of Beor in Numbers 22:5. Shared names often indicate shared ancestry or significant links in the ancient world."
    },
    {
      "pk": 1933673,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 33,
      "text": "Bela died, and Jobab the son of Zerah of Bozrah reigned in his place.",
      "links": "",
      "comment": "Bozrah is later mentioned as a significant Edomite city, and Jobab’s name evokes connections with the Book of Job for some scholars."
    },
    {
      "pk": 1933674,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 34,
      "text": "Jobab died, and Husham of the land of the Temanites reigned in his place.",
      "links": "",
      "comment": "The Temanites are associated with wisdom and power (Jeremiah 49:7). That Edom had its own kings and wise men demonstrates how God’s providence engages all peoples, not just the line of Jacob."
    },
    {
      "pk": 1933675,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 35,
      "text": "Husham died, and Hadad the son of Bedad, who defeated Midian in the field of Moab, reigned in his place; and the name of his city was Avith.",
      "links": "",
      "comment": "Hadad’s victory over Midian demonstrates Edom’s power. This foreshadows later conflicts between Israel and Midian (Numbers 22; Judges 6–7)."
    },
    {
      "pk": 1933676,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 36,
      "text": "Hadad died, and Samlah of Masrekah reigned in his place.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933677,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 37,
      "text": "Samlah died, and Shaul of Rehoboth by the River reigned in his place.",
      "links": "<a href='/AIV/1/26/22'>Genesis 26:22</a>",
      "comment": "‘Rehoboth by the River’ is also found earlier in the story of Isaac, again reinforcing the interconnectedness of regional histories in Scripture."
    },
    {
      "pk": 1933678,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 38,
      "text": "Shaul died, and Baal-hanan the son of Achbor reigned in his place.",
      "links": "",
      "comment": "'Baal-hanan' carries the name of the Canaanite god Baal, a reminder of the polytheist temptations that surrounded Israel and its neighbors."
    },
    {
      "pk": 1933679,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 39,
      "text": "Baal-hanan the son of Achbor died, and Hadar reigned in his place; the name of his city was Pau, and his wife’s name was Mehetabel, the daughter of Matred, daughter of Mezahab.",
      "links": "",
      "comment": "The inclusion of a queen's lineage is unusual and suggests her family was prominent. This detail will find echoes in the dignity afforded to women in later salvation history."
    },
    {
      "pk": 1933680,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 40,
      "text": "These are the names of the chiefs of Esau, according to their clans, places, and names: chief Timna, chief Alvah, chief Jetheth,",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933681,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 41,
      "text": "chief Oholibamah, chief Elah, chief Pinon,",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933682,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 42,
      "text": "chief Kenaz, chief Teman, chief Mibzar,",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1933683,
      "translation": "AIV",
      "book": 1,
      "chapter": 36,
      "verse": 43,
      "text": "chief Magdiel, chief Iram. These are the chiefs of Edom, according to their settlements in the land they possessed. This is Esau, the father of the Edomites.",
      "links": "<a href='/AIV/1/36/1'>Genesis 36:1</a>",
      "comment": "The chapter closes by reaffirming Esau’s legacy. Even outside the central line of the promise, God’s providence oversees all families of the earth (Genesis 12:3). Ultimately, in the fullness of time, all nations are called to worship the one true God (Revelation 7:9). The detailed genealogy is a reminder that God's plan is all-encompassing, unfolding in ways sometimes hidden from immediate view, yet perfectly ordered in the end."
    }
  ],
  "translatedAt": "2025-12-23T08:53:33.429Z"
}