{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 6,
  "verses": [
    {
      "pk": 21006001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 1,
      "text": "Not long after this, the king sent an elder from Athens to force the Jews to abandon the customs of their ancestors and to stop living according to the laws of God.",
      "links": "<a href='/AIV/19/119/1-4'>Psalm 119:1-4</a>; <a href='/AIV/05/30/15-20'>Deut. 30:15-20</a>",
      "comment": "The order to forsake ancestral customs underlines the gravity of faithful adherence to divine law. This theme echoes through the Old and New Testaments, inviting reflection on steadfastness in the face of adversity and the unity of God’s people."
    },
    {
      "pk": 21006002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 2,
      "text": "He was also commanded to defile the temple in Jerusalem and to call it the temple of Olympian Zeus, and to name the temple in Gerizim after Zeus, the protector of strangers, as the inhabitants of that place had requested.",
      "links": "<a href='/AIV/27/11/31'>Daniel 11:31</a>; <a href='/AIV/41/13/14'>Mark 13:14</a>",
      "comment": "The desecration of the temple prefigures later abominations and serves as a warning for God's faithful. The renaming of the sanctuary is especially significant, foreshadowing New Testament concerns about right worship (John 4:21)."
    },
    {
      "pk": 21006003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 3,
      "text": "The harshness of this oppression was hard to bear for all.",
      "links": "<a href='/AIV/19/129/1'>Psalm 129:1</a>",
      "comment": "The difficulties endured by the people reflect the suffering of the righteous, which is later seen in Jesus’ suffering and the early Church (Acts 5:41)."
    },
    {
      "pk": 21006004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 4,
      "text": "For the temple was filled with debauchery and revelry by the Gentiles, who took their pleasure with prostitutes within the sacred courts, and brought in forbidden things.",
      "links": "<a href='/AIV/03/18/30'>Lev. 18:30</a>; <a href='/AIV/41/11/17'>Mark 11:17</a>",
      "comment": "The desecration mirrors how unfaithfulness can corrupt worship. Jesus’ cleansing of the temple (Matthew 21:12) recalls this event and calls believers to holiness."
    },
    {
      "pk": 21006005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 5,
      "text": "The altar was heaped with unlawful offerings forbidden by the Law.",
      "links": "<a href='/AIV/03/07/19-27'>Lev. 7:19-27</a>",
      "comment": "Unlawful sacrifices highlight the importance of keeping to correct worship, as God commands. The unity between liturgical law and the sanctity of sacrifice is reaffirmed throughout Scripture."
    },
    {
      "pk": 21006006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 6,
      "text": "It was not possible to keep the Sabbath or the traditional feasts, or even to acknowledge being a Jew openly.",
      "links": "<a href='/AIV/02/20/8'>Exodus 20:8</a>; <a href='/AIV/03/23/1-4'>Lev. 23:1-4</a>",
      "comment": "Loss of Sabbath observance shows how religious identity was under threat. Faithful observance marks out the people of God (Hebrews 10:25)."
    },
    {
      "pk": 21006007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 7,
      "text": "On the monthly feasts of the king’s birthday, they were forced to partake in sacrifices, and when the feast of Dionysus came, they were compelled to march in procession wearing ivy wreaths.",
      "links": "<a href='/AIV/19/106/35-39'>Psalm 106:35-39</a>",
      "comment": "Compulsory idolatrous observances contrast with true worship. This pressure to conform hints at the early Church's persecution and the courage to resist compromise."
    },
    {
      "pk": 21006008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 8,
      "text": "At the suggestion of the citizens of Ptolemais, a decree was sent to neighboring Greek cities to punish those who refused to conform to these customs.",
      "links": "<a href='/AIV/17/3/9'>Esther 3:9</a>",
      "comment": "The extension of anti-Jewish edicts underscores the widespread threat to faithfulness. God’s faithful have always faced opposition, as seen also in Daniel and Esther."
    },
    {
      "pk": 21006009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 9,
      "text": "Those who would not adopt Greek customs were to be put to death. The coming of oppression was especially hard to bear.",
      "links": "<a href='/AIV/27/6/10'>Daniel 6:10</a>; <a href='/AIV/58/11/35-38'>Hebrews 11:35-38</a>",
      "comment": "Martyrdom for faithfulness is highlighted here. The theme is central to Christian understanding of redemptive suffering and witness (John 15:18-20)."
    },
    {
      "pk": 21006010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 10,
      "text": "Two women who had circumcised their children were led openly around the city with their babies hung at their breasts and then hurled down from the wall.",
      "links": "<a href='/AIV/05/28/53-57'>Deut. 28:53-57</a>",
      "comment": "The tragic fate of these women affirms both the sanctity of the Law and the cost of faithfulness. This echoes later in Christian history, where loyalty to God’s commands faces opposition."
    },
    {
      "pk": 21006011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 11,
      "text": "Others, who had come together in secret caves to observe the seventh day, were betrayed to Philip and all burned together, because they held their faith in such reverence that they would not even defend themselves.",
      "links": "<a href='/AIV/02/16/29'>Exodus 16:29</a>",
      "comment": "The respect for Sabbath observance and refusal to fight on the holy day foreshadows later Christian respect for the Lord’s Day and peaceful witness."
    },
    {
      "pk": 21006012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 12,
      "text": "Now I urge those who read this book not to let these tragedies discourage them, but to consider that these punishments are for the correction, not the destruction, of our people.",
      "links": "<a href='/AIV/20/3/11-12'>Proverbs 3:11-12</a>; <a href='/AIV/58/12/6-7'>Hebrews 12:6-7</a>",
      "comment": "Divine discipline is presented here as fatherly correction, not wrathful condemnation—a theme picked up in Hebrews to encourage perseverance."
    },
    {
      "pk": 21006013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 13,
      "text": "Indeed, it is a blessing when judgment begins with us, so that God does not leave us unpunished like other nations.",
      "links": "<a href='/AIV/19/94/12'>Psalm 94:12</a>; <a href='/AIV/60/4/17'>1 Peter 4:17</a>",
      "comment": "Being judged while still in covenant indicates a special relationship with God. The spiritual sense is one of purifying chastisement."
    },
    {
      "pk": 21006014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 14,
      "text": "For the Lord does not wait long to bring punishment upon us, but He deals with the other nations patiently, until they reach the full measure of their sins.",
      "links": "<a href='/AIV/01/15/16'>Genesis 15:16</a>",
      "comment": "God’s severity toward His people is a sign of mercy, meant for discipline, unlike His gradual judgment toward others. This anticipates the New Testament theme of God’s patient forbearance (Romans 2:4)."
    },
    {
      "pk": 21006015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 15,
      "text": "But with us He does not delay, so that He may not have to punish us afterward when our sins have come to their fullness.",
      "links": "<a href='/AIV/19/103/10'>Psalm 103:10</a>",
      "comment": "Prompt discipline is an act of mercy to prevent greater destruction. The principle of being corrected now for eternal good ties into the sacramental economy of ongoing conversion."
    },
    {
      "pk": 21006016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 16,
      "text": "Therefore, He never withdraws His mercy from us. Although He disciplines us with misfortune, He does not forsake His own people.",
      "links": "<a href='/AIV/03/26/44'>Leviticus 26:44</a>; <a href='/AIV/45/11/1-2'>Romans 11:1-2</a>",
      "comment": "God’s enduring covenant faithfulness is celebrated. Even in chastisement, there is hope—a key theme in the larger biblical story culminating in Christ."
    },
    {
      "pk": 21006017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 17,
      "text": "Let this now be said as a reminder. We will return to the story.",
      "links": "",
      "comment": "The author’s reminder reorients readers to interpret what follows as the fulfillment of God’s chastising love."
    },
    {
      "pk": 21006018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 18,
      "text": "Eleazar, one of the leading scribes, a man well advanced in years and of noble appearance, was forced to open his mouth to eat swine’s flesh.",
      "links": "<a href='/AIV/03/11/7'>Leviticus 11:7</a>",
      "comment": "Eleazar’s refusal to eat what is forbidden shows the integrity required of spiritual leaders. The context here honors witness and martyrdom."
    },
    {
      "pk": 21006019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 19,
      "text": "But he, choosing a glorious death above a shameful life, advanced of his own accord to the instrument of torture, spitting out the flesh as all should do who have the courage to refuse unlawful food for the sake of the Law.",
      "links": "<a href='/AIV/58/11/24-26'>Hebrews 11:24-26</a>",
      "comment": "Eleazar’s act models moral courage and faith. The spiritual sense is that fidelity to the Law, even at personal cost, is heroic and sanctifying."
    },
    {
      "pk": 21006020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 20,
      "text": "The men in charge of the unlawful ritual, who had known him from childhood, took him aside and urged him to bring meat of his own providing, which was allowed by the Law, and secretly to eat that, pretending that he had eaten the sacrificial meat as commanded by the king.",
      "links": "<a href='/AIV/20/29/25'>Proverbs 29:25</a>",
      "comment": "The attempted deception by friends reflects the temptation to outwardly conform while inwardly remaining faithful. Jesus later rebukes hypocrisy for similar reasons (Matthew 23:28)."
    },
    {
      "pk": 21006021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 21,
      "text": "They did this out of friendship, wishing to spare him from an unjust death, but he made a noble decision worthy of his years, his age, and the dignity of his gray hair, and the admirable conduct of his life since childhood. Above all, he was mindful of God’s supreme law, blamelessly given.",
      "links": "<a href='/AIV/19/92/12-15'>Psalm 92:12-15</a>",
      "comment": "This passage elevates the importance of steadfastness in faith to the end. It also hints at the value of a saintly perseverance that models integrity for all generations."
    },
    {
      "pk": 21006022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 22,
      "text": "He declared that in our time it is unworthy to dissimulate, so that many young people would not believe that Eleazar, at ninety years of age, had deserted his faith, and thus they, through his example, might be led astray.",
      "links": "<a href='/AIV/40/18/6'>Matthew 18:6</a>",
      "comment": "Scandalizing the weak is condemned. The importance of good example, touched on by Christ, is foundational to the unity of the faithful community."
    },
    {
      "pk": 21006023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 23,
      "text": "If he should pretend, for the sake of temporary survival, he would bring shame and disgrace upon his old age.",
      "links": "<a href='/AIV/40/10/33'>Matthew 10:33</a>",
      "comment": "The integrity of public witness is contrasted with the shame of denying one’s faith, resonating with New Testament warnings about denying Christ before men."
    },
    {
      "pk": 21006024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 24,
      "text": "Even if, for the moment, I were to escape the punishment of the mortals, I shall not escape the hand of the Almighty, either in life or in death.",
      "links": "<a href='/AIV/42/12/4-5'>Luke 12:4-5</a>",
      "comment": "The primacy of divine judgment motivates the saints to remain faithful even unto death, reminding believers that God’s judgment is universal and final."
    },
    {
      "pk": 21006025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 25,
      "text": "Therefore, by courageously giving up my life now, I will show myself worthy of my old age,",
      "links": "",
      "comment": "Martyrdom is seen as a crowning act of faith, and the text implies the concept of redemptive suffering and merit."
    },
    {
      "pk": 21006026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 26,
      "text": "and I will leave to the young a noble example of how to die willingly and courageously for our holy and glorious laws.",
      "links": "<a href='/AIV/58/11/35-38'>Hebrews 11:35-38</a>",
      "comment": "Communal witness and the communion of saints across generations are subtly affirmed here. The transmission of faith by example hints at the idea of sacred tradition."
    },
    {
      "pk": 21006027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 27,
      "text": "Having said this, he went straight to the instrument of torture.",
      "links": "",
      "comment": "Eleazar’s willingness prefigures Christ and the martyrs. There is a literal and spiritual dimension: to suffer and die for God is glorifying to Him."
    },
    {
      "pk": 21006028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 28,
      "text": "Those conducting the unlawful ritual, who just moments before had been friendly, now turned against him, thinking his remarks were insane.",
      "links": "",
      "comment": "Worldly perspectives often misunderstand the wisdom of God’s saints (cf. 1 Corinthians 1:18-25)."
    },
    {
      "pk": 21006029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 29,
      "text": "But as he was about to die under the blows, he groaned and said, 'It is clear to the Lord in His holy knowledge that, though I could have escaped death, I am enduring terrible pain in my body from being scourged, but in my soul I am glad to suffer this because I fear Him.'",
      "links": "<a href='/AIV/40/10/28'>Matthew 10:28</a>",
      "comment": "The distinction between bodily pain and inner peace through fear of God highlights the interior aspect of martyrdom. True worship involves both body and soul."
    },
    {
      "pk": 21006030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 30,
      "text": "With this, he died, leaving not only the young but all his people an example of courage and a noble memorial of virtue.",
      "links": "<a href='/AIV/19/116/15'>Psalm 116:15</a>",
      "comment": "Martyrs leave a lasting testament to the faith. The theme of heroic virtue prefigures later recognition of sanctity and intercessory legacy in the community."
    },
    {
      "pk": 21006031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 6,
      "verse": 31,
      "text": "His death became an example of virtue and courage, not only for his own people, but also as a reminder to future generations to die nobly and not to forsake the sacred laws.",
      "links": "<a href='/AIV/58/12/1-4'>Hebrews 12:1-4</a>",
      "comment": "The enduring witness of the faithful nourishes the life of the Church throughout time. This encourages perseverance, inspired by the example of those who have gone before."
    }
  ],
  "translatedAt": "2025-12-24T05:32:52.685Z"
}