{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 9,
  "verses": [
    {
      "pk": 21009001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 1,
      "text": "While these things were happening, King Antiochus was making his way back from Persia in disgrace.",
      "links": "<a href='/AIV/21/8/7'>2Macc 8:7</a>; <a href='/AIV/27/5/30'>Dan. 5:30</a>",
      "comment": "The disgrace of Antiochus returning from Persia foreshadows God's judgment on proud rulers, similar to Belshazzar in Daniel 5. This sets the tone for divine retribution in the chapter."
    },
    {
      "pk": 21009002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 2,
      "text": "For he had entered the city called Persepolis and attempted to rob the temple and take control of the city. But the people rose up against him with weapons, forcing him and his men to flee in shame.",
      "links": "<a href='/AIV/21/1/13-16'>2Macc 1:13-16</a>; <a href='/AIV/12/19/35'>2Kgs 19:35</a>",
      "comment": "Antiochus’ act of trying to rob the pagan temple parallels other Biblical accounts of desecration and the resulting punishment. God does not allow sacrilege to stand unchecked."
    },
    {
      "pk": 21009003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 3,
      "text": "After this humiliation, he retreated from there and came to Ecbatana. ",
      "links": "<a href='/AIV/17/1/2'>Esth. 1:2</a>",
      "comment": "Ecbatana, a capital city referenced elsewhere in Scripture, marks Antiochus’s continuing retreat, symbolizing his falling fortunes."
    },
    {
      "pk": 21009004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 4,
      "text": "Consumed by pride, he claimed he would make Jerusalem a common burial ground for Jews as soon as he returned.",
      "links": "<a href='/AIV/19/94/1-2'>Ps. 94:1-2</a>; <a href='/AIV/12/19/22'>2Kgs 19:22</a>",
      "comment": "Antiochus’s proud boasts against Jerusalem highlight his defiance of the God of Israel. The Psalmist’s cry for justice resonates with the Jewish plight under Antiochus."
    },
    {
      "pk": 21009005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 5,
      "text": "But the Lord of all saw his arrogance and struck him with an incurable and invisible blow. As soon as he uttered these words, an excruciating pain seized him in his bowels, and he was gripped by sharp internal suffering, beyond the power of healing.",
      "links": "<a href='/AIV/23/37/36'>Isa. 37:36</a>; <a href='/AIV/19/7/11-13'>Ps. 7:11-13</a>",
      "comment": "The Lord’s direct judgment answers Antiochus’s pride immediately. The concept of divine retribution echoes strong themes throughout Scripture, affirming God’s sovereignty over all nations."
    },
    {
      "pk": 21009006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 6,
      "text": "He had cruelly tortured other people’s innards, yet now, in entirely just judgment, he himself was afflicted with an agonizing disease in his own intestines.",
      "links": "<a href='/AIV/21/7/7'>2Macc 7:7</a>; <a href='/AIV/19/18/25-26'>Ps. 18:25-26</a>",
      "comment": "God’s justice is poetic: Antiochus suffers in the very way he had tormented others. This reinforces the biblical principle of reaping what one sows."
    },
    {
      "pk": 21009007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 7,
      "text": "Nor did he cease in his arrogance; instead, he grew even more prideful, breathing fire in his rage against the Jews, ordering the worst acts to be carried out faster.",
      "links": "<a href='/AIV/02/5/2'>Exod. 5:2</a>; <a href='/AIV/19/2/1'>Ps. 2:1</a>",
      "comment": "Despite his suffering, Antiochus persists in pride, reminiscent of Pharaoh’s hardened heart. The Psalmist foreshadows such opposition to God’s chosen people."
    },
    {
      "pk": 21009008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 8,
      "text": "So he fell from his chariot as it was speeding along, and every part of his body was bruised. The result was that his whole appearance became grotesque and so revolting that even his own friends could not bear to approach him.",
      "links": "<a href='/AIV/21/6/16'>2Macc 6:16</a>; <a href='/AIV/19/38/3'>Ps. 38:3</a>",
      "comment": "Antiochus’s physical downfall mirrors his spiritual condition. His repulsiveness symbolizes the corrupting nature of sin and pride."
    },
    {
      "pk": 21009009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 9,
      "text": "His flesh began to rot away while he was still living, and his body was seized with stench and worms. Pain and filth overwhelmed him, so that even his army could not stand to be near him.",
      "links": "<a href='/AIV/23/14/11'>Isa. 14:11</a>; <a href='/AIV/18/7/5'>Job 7:5</a>",
      "comment": "The king’s disease is portrayed with graphic detail, reminiscent of descriptions of judgment and decay in Job and Isaiah. Sin leads to corruption, even physically within the biblical narrative."
    },
    {
      "pk": 21009010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 10,
      "text": "He who thought he could touch the stars with his hand, no one could now carry because of his unbearable stench.",
      "links": "<a href='/AIV/18/20/5-7'>Job 20:5-7</a>",
      "comment": "Pride leads to an inevitable and humiliating fall, vividly displayed in Antiochus’s degenerating condition. Job’s reflection on the fleeting nature of wickedness is fulfilled here."
    },
    {
      "pk": 21009011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 11,
      "text": "From this point, his agony became unbearable, and his suffering increased daily. Realizing his own decay, he finally abandoned his arrogance and pleaded with God—the Lord whom he had previously rejected.",
      "links": "<a href='/AIV/18/42/6'>Job 42:6</a>; <a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "Antiochus’s plea reflects a turning point, reminiscent of repentance found in Job and the Psalms. Spiritual conversion often arises in moments of great suffering."
    },
    {
      "pk": 21009012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 12,
      "text": "He began to beg the Lord for mercy, promising that he would declare Jerusalem a free city and populate it with exiles, equal to the citizens already living there.",
      "links": "<a href='/AIV/21/1/33'>2Macc 1:33</a>; <a href='/AIV/19/51/1'>Ps. 51:1</a>",
      "comment": "The king’s humbled prayer for mercy introduces a theme of reconciliation. The promise to restore Jerusalem prefigures the restoration seen throughout salvation history."
    },
    {
      "pk": 21009013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 13,
      "text": "Even he would equate the Jews with the most honored people in his kingdom, writing them privileges.",
      "links": "<a href='/AIV/21/11/27'>2Macc 11:27</a>; <a href='/AIV/17/8/15'>Esth. 8:15</a>",
      "comment": "The reversal from oppressing to honoring God’s people echoes Esther’s story. God often transforms adversity for the good of His chosen."
    },
    {
      "pk": 21009014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 14,
      "text": "He promised to decorate the Temple with splendid gifts, to restore the sacred vessels, to give back the expenses for the offerings, and to support the sacrifices from his own resources.",
      "links": "<a href='/AIV/21/1/22-23'>2Macc 1:22-23</a>; <a href='/AIV/03/7/37'>Lev. 7:37</a>",
      "comment": "Restoring the Temple and its offerings signals respect for liturgical worship as the central act of faith. The support for sacrifices has strong echoes in the continual sacrificial system ordained by God."
    },
    {
      "pk": 21009015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 15,
      "text": "He even intended to become a Jew himself, visiting every place on earth and proclaiming the power of God.",
      "links": "<a href='/AIV/08/1/16'>Ruth 1:16</a>; <a href='/AIV/41/7/26'>Mark 7:26</a>",
      "comment": "Antiochus’s intention to join God’s people is reminiscent of converts like Ruth. This highlights the universality of salvation and God’s mercy for all who sincerely seek Him."
    },
    {
      "pk": 21009016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 16,
      "text": "But his torments did not relent, for God’s righteous judgment had come upon him. He utterly despaired, and wrote to the Jews a letter in the form of supplication, begging for forgiveness.",
      "links": "<a href='/AIV/19/32/2-5'>Ps. 32:2-5</a>; <a href='/AIV/21/1/8-15'>2Macc 1:8-15</a>",
      "comment": "Divine justice results in persistent suffering until true repentance, a theme recurring in the Psalms. The idea of asking forgiveness from God’s chosen people underlines the intercessory power of the faithful."
    },
    {
      "pk": 21009017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 17,
      "text": "This is the content of the letter: 'To the worthy Jewish citizens, Antiochus, king and governor, wishes health and prosperity.'",
      "links": "<a href='/AIV/21/1/10'>2Macc 1:10</a>",
      "comment": "With formal greeting, Antiochus begins his plea for peace. The language of reconciliation mirrors similar diplomatic exchanges in biblical history."
    },
    {
      "pk": 21009018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 18,
      "text": "'If you are well, I am glad. As for myself, I am burdened by illness. Throughout my life, I had honored you greatly and your interests. But I realize now that my actions have brought me suffering.'",
      "links": "<a href='/AIV/21/1/25'>2Macc 1:25</a>; <a href='/AIV/21/3/35'>2Macc 3:35</a>",
      "comment": "Antiochus’s affliction leads him to recognize the consequences of his actions. This pattern—suffering spurring self-reflection—is often seen in those who encounter the Lord’s discipline."
    },
    {
      "pk": 21009019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 19,
      "text": "'Believing I needed to show you harsh authority, I now repent of my conduct and ask you to forgive me.'",
      "links": "<a href='/AIV/19/51/9'>Ps. 51:9</a>",
      "comment": "The king openly repents, which highlights the biblical concept of communal forgiveness and restoration after sin. This is key in the spiritual tradition, encapsulating humility before God."
    },
    {
      "pk": 21009020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 20,
      "text": "'I hope to recover soon. With God’s mercy I will come to Jerusalem to praise Him and perform thank offerings.'",
      "links": "<a href='/AIV/03/7/12-15'>Lev. 7:12-15</a>",
      "comment": "Antiochus’s intent to offer thanks and praise in Jerusalem reflects the importance of public worship and sacred acts tied to the Temple, a recurring theme in Scripture."
    },
    {
      "pk": 21009021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 21,
      "text": "'Therefore, I urge you to pray for my recovery.'",
      "links": "<a href='/AIV/21/1/36'>2Macc 1:36</a>; <a href='/AIV/59/5/16'>Jas. 5:16</a>",
      "comment": "The power of intercessory prayer is evident here, which is New Testament-affirmed and strongly emphasized in both Old and New Covenants. Shared prayer for others is a sign of community."
    },
    {
      "pk": 21009022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 22,
      "text": "'If I die, I trust you will remember me with kindness and continue the good treatment I showed you.'",
      "links": "<a href='/AIV/19/41/1'>Ps. 41:1</a>; <a href='/AIV/08/1/8'>Ruth 1:8</a>",
      "comment": "Antiochus’s request to be remembered after death subtly points to the practice of praying for the deceased and shows an early witness to this spiritual tradition."
    },
    {
      "pk": 21009023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 23,
      "text": "'My son will inherit the kingdom. I trust you will maintain good relations with him as you have with me.'",
      "links": "<a href='/AIV/11/2/1'>1Kgs 2:1</a>",
      "comment": "The succession of kings and the continuity of blessings are common biblical motifs; trusting God’s people in political transitions is an enduring theme."
    },
    {
      "pk": 21009024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 24,
      "text": "Thus, the murderer and blasphemer endured the worst fate ever seen; he died in utter agony among the mountains in a foreign land.",
      "links": "<a href='/AIV/21/7/35'>2Macc 7:35</a>; <a href='/AIV/23/14/12-16'>Isa. 14:12-16</a>",
      "comment": "The narrative makes explicit the justice of God against blasphemy, echoing Isaiah’s portrayal of a fallen tyrant. Divine judgment is certain for those who war against God’s people."
    },
    {
      "pk": 21009025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 25,
      "text": "His followers took up his body in fear and departed, for terror had gripped them because of the Lord’s power.",
      "links": "<a href='/AIV/02/14/30'>Exod. 14:30</a>; <a href='/AIV/21/5/20'>2Macc 5:20</a>",
      "comment": "The fear and awe inspired by God’s judgement is seen repeatedly when His power is manifest, as at the Red Sea. The effectual warning to all future generations is clear."
    },
    {
      "pk": 21009026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 26,
      "text": "Shortly after this, Philip, Antiochus’s companion, returned from Persia and reported all that had happened. He appointed Antiochus’s son to rule and called him Eupator.",
      "links": "<a href='/AIV/21/10/10'>2Macc 10:10</a>; <a href='/AIV/14/36/20-21'>2Chr 36:20-21</a>",
      "comment": "The appointment of the son indicates succession but also transition after divine judgement. God’s plans continue through human events."
    },
    {
      "pk": 21009027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 27,
      "text": "Meanwhile, the people in Jerusalem and all Judea gave themselves to thanksgiving and prayers to God, who had mercifully delivered them from the tyrant.",
      "links": "<a href='/AIV/19/30/1-2'>Ps. 30:1-2</a>; <a href='/AIV/21/1/11'>2Macc 1:11</a>",
      "comment": "Communal thanksgiving and prayer after deliverance underlines the centrality of worship and gratitude. The faithful responding actively with prayer marks the heart of God’s people."
    },
    {
      "pk": 21009028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 28,
      "text": "Now, I will halt this account here. If you wish to know the full story of the battles and the exploits of the young king, they are recorded in detailed chronicles.",
      "links": "<a href='/AIV/11/14/19'>1Kgs 14:19</a>; <a href='/AIV/13/9/29'>1Chr 9:29</a>",
      "comment": "The author points to further historical records, echoing other biblical books that cite external chronicles for completeness. This shows the importance of historical testimony outside the Scriptures."
    },
    {
      "pk": 21009029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 9,
      "verse": 29,
      "text": "Here we end the account of Antiochus’s life, concluding with his shameful death and the victory of God’s people.",
      "links": "<a href='/AIV/19/9/13-16'>Ps. 9:13-16</a>; <a href='/AIV/21/7/41'>2Macc 7:41</a>",
      "comment": "The closure provides a moral lesson in God’s vindication of His people and final judgment on unrighteous rulers, affirming the hope always present for the faithful."
    }
  ],
  "translatedAt": "2025-12-24T05:35:06.935Z"
}