{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 11,
  "verses": [
    {
      "pk": 21011001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 1,
      "text": "Shortly after, Lysias, the king’s guardian and kinsman, who was also in charge of government affairs, was troubled by what had happened.",
      "links": "<a href='/AIV/21/10/14'>2Macc 10:14</a>",
      "comment": "Lysias’s role as royal guardian and steward highlights the centralized leadership common in biblical historical narratives, connecting to the tradition of godly stewardship. The historical details stress the turmoil surrounding God’s people."
    },
    {
      "pk": 21011002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 2,
      "text": "He gathered around eighty thousand troops and all his cavalry and marched against the Jews, intending to make Jerusalem a Greek colony.",
      "links": "<a href='/AIV/21/13/1'>2Macc 13:1</a>; <a href='/AIV/27/1/1'>Dan. 1:1</a>",
      "comment": "Lysias’s intent to transform Jerusalem recalls earlier attempts to suppress religious identity (Dan. 1:1). The clash between worldly powers and faithful communities mirrors enduring biblical themes."
    },
    {
      "pk": 21011003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 3,
      "text": "He planned to impose tribute on the Temple, like other pagan shrines, and to sell the high priest’s office every year.",
      "links": "<a href='/AIV/21/4/7-8'>2Macc 4:7-8</a>; <a href='/AIV/3/27/30'>Lev. 27:30</a>",
      "comment": "The threat to the sanctity and autonomy of the priesthood prefigures later teachings on the dignity and perpetuity of priestly office, suggesting a continuity in spiritual leadership."
    },
    {
      "pk": 21011004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 4,
      "text": "He did not consider the power of God but was arrogant, trusting in his thousands of infantry, hundreds of cavalry, and his eighty elephants.",
      "links": "<a href='/AIV/19/20/7'>Ps. 20:7</a>; <a href='/AIV/9/7/16'>Judg. 7:16</a>",
      "comment": "Reliance on earthly strength instead of God is a recurring biblical warning. The Psalmist warns against trusting in chariots and horses, urging instead faithfulness to divine protection."
    },
    {
      "pk": 21011005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 5,
      "text": "He entered Judea and approached Beth-zur, a strong fortress about twenty-four miles from Jerusalem, where he pressed the siege.",
      "links": "<a href='/AIV/6/15/53'>Josh. 15:53</a>; <a href='/AIV/21/10/14'>2Macc 10:14</a>",
      "comment": "Beth-zur’s strategic importance reminds readers of ancient battles for holy ground, echoing the defense of sacred territory in Joshua’s time."
    },
    {
      "pk": 21011006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 6,
      "text": "When Maccabeus and his companions learned that Lysias was besieging the strongholds, they and the people lamented with tears, begging God to send a good angel to save Israel.",
      "links": "<a href='/AIV/21/10/29'>2Macc 10:29</a>; <a href='/AIV/19/34/7'>Ps. 34:7</a>",
      "comment": "Their prayer for angelic intervention reaffirms direct heavenly involvement in the struggles of God’s people, foreshadowing later teachings about intercessory prayer and angelic guardianship."
    },
    {
      "pk": 21011007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 7,
      "text": "Maccabeus himself, taking arms, led the men out with trust in the Lord, encouraging his companions to fight valiantly for their laws and their holy city.",
      "links": "<a href='/AIV/21/8/16'>2Macc 8:16</a>; <a href='/AIV/21/2/21'>2Macc 2:21</a>",
      "comment": "The defense of faith and law echoes the enduring theme: zeal for God’s house and fidelity to revealed law motivates true leadership (cf. John 2:17)."
    },
    {
      "pk": 21011008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 8,
      "text": "He rallied his men, reminding them of victories granted by God against overwhelming odds, and set out at night, ready to face the enemy.",
      "links": "<a href='/AIV/21/8/18-22'>2Macc 8:18-22</a>; <a href='/AIV/19/44/5-7'>Ps. 44:5-7</a>",
      "comment": "The remembrance of God’s past faithfulness strengthens present courage, a spiritual lesson in trust and perseverance."
    },
    {
      "pk": 21011009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 9,
      "text": "But as they were still near Jerusalem, a horseman in white appeared at their front, brandishing golden armor, leading them onwards.",
      "links": "<a href='/AIV/21/10/29-30'>2Macc 10:29-30</a>; <a href='/AIV/17/5/13-15'>Judg. 5:13-15</a>",
      "comment": "The heavenly messenger acts as divine assurance. The appearance of an angelic figure aligns with biblical themes of supernatural assistance guiding God’s people."
    },
    {
      "pk": 21011010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 10,
      "text": "All together, filled with joy at this sign of God’s help, they advanced into battle, strengthened not only by courage but by divine favor.",
      "links": "<a href='/AIV/21/15/22'>Exod. 15:22</a>; <a href='/AIV/19/34/5'>Ps. 34:5</a>",
      "comment": "The joy and confidence arising from perceived divine intervention echoes many Old Testament narratives of victory secured by faith."
    },
    {
      "pk": 21011011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 11,
      "text": "They charged into the enemy camp at dawn, and defeated a multitude, slaying up to eleven thousand troops and sixteen hundred cavalry, while forcing the rest to flee.",
      "links": "<a href='/AIV/21/8/24'>2Macc 8:24</a>; <a href='/AIV/9/7/22'>Judg. 7:22</a>",
      "comment": "The decisive victory, granted to those who rely on God’s justice, reaffirms spiritual interpretation that God fights for the faithful, a recurrent motif in biblical salvation history."
    },
    {
      "pk": 21011012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 12,
      "text": "Many of Lysias’s men, injured and stripped of their armor, ran for their lives, showing how the Lord saves the faithful.",
      "links": "<a href='/AIV/19/91/14'>Ps. 91:14</a>; <a href='/AIV/19/18/48'>Ps. 18:48</a>",
      "comment": "God’s protection is manifested in visible deliverance, and the humiliation of the enemy points towards the triumph of those who trust in the Lord."
    },
    {
      "pk": 21011013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 13,
      "text": "Lysias himself saw the disaster his forces had suffered, reflected on Israel’s invincible aid from heaven, and considered making peace.",
      "links": "<a href='/AIV/21/13/23'>2Macc 13:23</a>; <a href='/AIV/2/20/1'>Exod. 20:1</a>",
      "comment": "Recognition of divine favor upon Israel by outsiders highlights the power of God, hinting at the universality of truth and the reverence owed to it."
    },
    {
      "pk": 21011014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 14,
      "text": "He tried to persuade the Jews to accept reasonable terms and promised to persuade the king to be friendly.",
      "links": "<a href='/AIV/21/7/24'>2Macc 7:24</a>",
      "comment": "Diplomatic overtures after defeat are common in biblical history, affirming that God’s people are called to accept peace when offered rightfully, yet remain vigilant guardians of their faith."
    },
    {
      "pk": 21011015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 15,
      "text": "Maccabeus agreed to discuss, focusing only on the interests of his people. Lysias accepted all their requests and swore a solemn oath to uphold them.",
      "links": "<a href='/AIV/21/14/32'>2Macc 14:32</a>; <a href='/AIV/21/8/29'>2Macc 8:29</a>",
      "comment": "The negotiation process includes the element of oath – a sacred commitment underpinning biblical covenants."
    },
    {
      "pk": 21011016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 16,
      "text": "He returned to the king, reporting all that had happened, and the Jews received a letter granting them peace and promising fair treatment.",
      "links": "<a href='/AIV/21/13/23'>2Macc 13:23</a>",
      "comment": "Written agreements and letters echo the ancient tradition of covenant and the authority of written texts—a theme significant in sacred Scripture’s transmission."
    },
    {
      "pk": 21011017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 17,
      "text": "This is the letter Lysias sent: “To the Jewish people, greetings. From Lysias.”",
      "links": "<a href='/AIV/21/11/16-18'>2Macc 11:16-18</a>",
      "comment": "The formal greeting signals diplomatic respect, acknowledging the value of God’s people in the affairs of nations."
    },
    {
      "pk": 21011018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 18,
      "text": "“My men and I have received your requests, and I have presented them all to the king.”",
      "links": "<a href='/AIV/21/11/17'>2Macc 11:17</a>",
      "comment": "The acknowledgment of petitions reflects biblical principles of intercession and advocacy for a people before sovereign authority."
    },
    {
      "pk": 21011019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 19,
      "text": "“He has agreed to grant whatever is in his power. If you continue to act loyally towards the government, I will try to help your interests.”",
      "links": "<a href='/AIV/21/13/23'>2Macc 13:23</a>",
      "comment": "The condition of continued loyalty resonates with the biblical concept of faithfulness within covenant relationships."
    },
    {
      "pk": 21011020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 20,
      "text": "“Concerning these matters, I have authorized you and your representatives to discuss them. Farewell.”",
      "links": "<a href='/AIV/21/11/17-20'>2Macc 11:17-20</a>",
      "comment": "Granting representation acknowledges structured authority and dialogue, reminiscent of early church councils and apostolic leadership."
    },
    {
      "pk": 21011021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 21,
      "text": "The king’s letter followed: “King Antiochus to Lysias, his kinsman: greetings.”",
      "links": "<a href='/AIV/21/11/16-17'>2Macc 11:16-17</a>",
      "comment": "The inclusion of formal correspondence between rulers reflects the historical process wherein divine providence uses secular authority for the protection of the faithful."
    },
    {
      "pk": 21011022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 22,
      "text": "“Since our subjects are often disturbed by the complaints of the Jews, we wish our government to be at peace and our subjects to enjoy calm lives.”",
      "links": "<a href='/AIV/20/12/14'>Prov. 12:14</a>",
      "comment": "The king’s concern for peace evokes Proverbs’ praise of just government that promotes order and the well-being of subjects."
    },
    {
      "pk": 21011023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 23,
      "text": "“We have heard the petition brought by them. If they continue in loyalty, they shall enjoy the privileges they have always held from their ancestors.”",
      "links": "<a href='/AIV/21/8/17'>2Macc 8:17</a>",
      "comment": "Recognition of ancestral rights affirms the biblical idea that faithful tradition is to be safeguarded and preserved."
    },
    {
      "pk": 21011024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 24,
      "text": "“We permit them to live according to their own laws, as previously. Send messengers instructing them not to act against government interests, so that they may live in peace.”",
      "links": "<a href='/AIV/21/11/15'>2Macc 11:15</a>; <a href='/AIV/45/13/1'>Rom. 13:1</a>",
      "comment": "The interaction of loyalty to government and fidelity to divine law foreshadows the later Christian call to be obedient citizens except where it conflicts with faith (Rom. 13:1)."
    },
    {
      "pk": 21011025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 25,
      "text": "“The letter sent through Lysias we have approved. If any complaints arise, report them to us.”",
      "links": "<a href='/AIV/21/11/17'>2Macc 11:17</a>",
      "comment": "The invitation to communicate and address grievances demonstrates openness and the need for ongoing mediation, linking to intercessory prayer."
    },
    {
      "pk": 21011026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 26,
      "text": "“Farewell. Written in the year one hundred forty-eight of the kingdom.”",
      "links": "<a href='/AIV/21/11/16'>2Macc 11:16</a>",
      "comment": "The official dating of the correspondence roots these events in verifiable history, reinforcing the credibility and seriousness of the pledges made."
    },
    {
      "pk": 21011027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 27,
      "text": "Lysias also wrote to the Jews: “Lysias to the Jewish people, greetings.”",
      "links": "<a href='/AIV/21/11/17'>2Macc 11:17</a>",
      "comment": "Direct communication with God’s people through formal letters evokes the concept of living tradition and authoritative leadership."
    },
    {
      "pk": 21011028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 28,
      "text": "“Your representatives have delivered the letter and asked for its provisions to be granted. I have reported everything to the king.”",
      "links": "<a href='/AIV/21/11/17-18'>2Macc 11:17-18</a>",
      "comment": "The process reflects orderly governance and appeals for the well-being of the faithful through appropriate channels."
    },
    {
      "pk": 21011029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 29,
      "text": "“He has agreed to everything. If you remain loyal, I will advocate your interests with more favor in the future.”",
      "links": "<a href='/AIV/21/11/19'>2Macc 11:19</a>",
      "comment": "Continued advocacy for the faithful recalls Christ’s promise to always intercede for his people (cf. Heb. 7:25)."
    },
    {
      "pk": 21011030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 30,
      "text": "“I have also sent instructions to your representatives and to those in charge, so you may know all the details.”",
      "links": "<a href='/AIV/21/11/17-20'>2Macc 11:17-20</a>",
      "comment": "Proper instruction and guidance is a consistent theme in Scripture, where oversight protects the unity and welfare of the community."
    },
    {
      "pk": 21011031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 31,
      "text": "“Farewell. Year one hundred forty-eight, the twenty-fourth of Dioscorinthius.”",
      "links": "<a href='/AIV/21/11/26'>2Macc 11:26</a>",
      "comment": "The detailed date establishes sequence and reinforces the historicity of God’s interventions."
    },
    {
      "pk": 21011032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 32,
      "text": "The king sent instructions to Ptolemy, the governor of Coele-Syria and Phoenicia, authorizing him to favor the Jews.",
      "links": "<a href='/AIV/21/10/11'>2Macc 10:11</a>",
      "comment": "Kingly authority delegated suggests a pattern for order and obedience under divinely instituted leadership structures."
    },
    {
      "pk": 21011033,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 33,
      "text": "Ptolemy wrote back, saying: “Ptolemy to the Jewish elders, greetings.”",
      "links": "<a href='/AIV/21/11/17'>2Macc 11:17</a>",
      "comment": "Greetings to elders highlights respect for legitimate religious authority, anchoring ancient precedent for governance."
    },
    {
      "pk": 21011034,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 34,
      "text": "“The king has granted Lysias’s instructions. I protect your interests as instructed.”",
      "links": "<a href='/AIV/21/13/23'>2Macc 13:23</a>",
      "comment": "Governmental protection for the faithful demonstrates God’s sovereignty working through secular agents, as seen elsewhere in Scripture (cf. Neh. 2:8)."
    },
    {
      "pk": 21011035,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 35,
      "text": "“If there are men sent to you for government matters, send them away as you have received instructions. No one is to harm you.”",
      "links": "<a href='/AIV/15/7/21-22'>Ezra 7:21-22</a>",
      "comment": "Protection against harm links directly to biblical promises of safety for those under God’s favor."
    },
    {
      "pk": 21011036,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 36,
      "text": "“I have also sent instructions to these men. Farewell. Year one hundred forty-eight, the twenty-fourth of Dioscorinthius.”",
      "links": "<a href='/AIV/21/11/31'>2Macc 11:31</a>",
      "comment": "Repeated meticulous records affirm authenticity and care for proper procedure, a hallmark of enduring tradition."
    },
    {
      "pk": 21011037,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 37,
      "text": "The Romans also sent a letter, saying: “Quintus Memmius and Titus Manius, Roman envoys, to the Jewish people, greetings.”",
      "links": "<a href='/AIV/44/18/2'>Acts 18:2</a>",
      "comment": "International support for God’s people reflects a growing recognition of the one true faith among other nations, prefiguring the outward spread of faith seen in the Acts of the Apostles."
    },
    {
      "pk": 21011038,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 11,
      "verse": 38,
      "text": "“We approve all that Lysias has guaranteed to you. Farewell.”",
      "links": "<a href='/AIV/21/11/17'>2Macc 11:17</a>",
      "comment": "The Roman endorsement further safeguards the Jews’ autonomy, echoing the biblical principle of God raising up allies among the nations to protect and support the faithful (cf. Isa. 60:3)."
    }
  ],
  "translatedAt": "2025-12-24T05:36:22.160Z"
}