{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 3,
  "verses": [
    {
      "pk": 21003001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 1,
      "text": "While the holy city lived in perfect peace and the laws were carefully kept because Onias the high priest was devout, and hatred for evil prevailed,",
      "links": "<a href='/AIV/19/122/6'>Ps. 122:6</a>; <a href='/AIV/39/2/6-7'>Mal. 2:6-7</a>",
      "comment": "This opening tells us Jerusalem's peace was linked to faithful leadership and devotion to God's law, paralleling passages about the blessings of righteous priests."
    },
    {
      "pk": 21003002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 2,
      "text": "The temple was respected throughout the nations, and its sanctuary was filled with great wealth because of the generosity and offerings that were continually brought there.",
      "links": "<a href='/AIV/11/10/23'>1 Kings 10:23</a>; <a href='/AIV/19/68/29'>Ps. 68:29</a>",
      "comment": "The reverence of foreign nations for the temple highlights its unique role as the dwelling place of God, not only for Israel but drawing the admiration of the Gentiles."
    },
    {
      "pk": 21003003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 3,
      "text": "So Seleucus, king of Asia, even provided for the expenses of the service by providing from his own revenues.",
      "links": "<a href='/AIV/15/7/15-16'>Ezra 7:15-16</a>",
      "comment": "The support from Seleucus shows that God can move the hearts of rulers in favor of His house, recalling earlier examples such as Cyrus and Darius."
    },
    {
      "pk": 21003004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 4,
      "text": "But Simon, from the tribe of Benjamin, who had been made governor of the temple, became contentious with the high priest over management of the market in the city.",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>",
      "comment": "Internal conflict among leaders threatens the unity and sanctity of worship; similar warnings appear in the Psalms and during Israel's history."
    },
    {
      "pk": 21003005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 5,
      "text": "Unable to overcome Onias, Simon went to Apollonius, son of Thrasaeus, who was governor of Coele-Syria and Phoenicia,",
      "links": "<a href='/AIV/15/4/6'>Ezra 4:6</a>",
      "comment": "When wrong motives lead leaders to appeal to secular authorities, it often brings trouble to God's people. See also Ezra’s experience."
    },
    {
      "pk": 21003006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 6,
      "text": "He explained that the treasury in Jerusalem was overflowing with countless amounts of money and that it did not belong to the priests but could be available for the king.",
      "links": "<a href='/AIV/15/1/4'>Ezra 1:4</a>",
      "comment": "Simon’s accusation is both false and greedy, reminding us of selfish motives that jeopardize the things set apart for God."
    },
    {
      "pk": 21003007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 7,
      "text": "Apollonius met with the king and told him about the reported wealth. The king ordered Heliodorus, his chief minister, to go and confiscate these supposed riches.",
      "links": "<a href='/AIV/15/6/8'>Ezra 6:8</a>",
      "comment": "Secular authorities often misunderstand or disregard what is sacred. Ezra’s time saw similar threats to temple resources."
    },
    {
      "pk": 21003008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 8,
      "text": "Heliodorus immediately set out on his journey, pretending to inspect the cities of Coele-Syria and Phoenicia, but in fact, he had another purpose.",
      "links": "<a href='/AIV/20/26/24'>Prov. 26:24</a>",
      "comment": "Heliodorus’s duplicity reflects warnings against deceit found in Proverbs and other wisdom literature."
    },
    {
      "pk": 21003009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 9,
      "text": "When he arrived in Jerusalem, he was warmly received by the high priest and city officials.",
      "links": "<a href='/AIV/01/18/2'>Gen. 18:2</a>",
      "comment": "Hospitality towards strangers is upheld even when those strangers have hidden intentions; see Abraham’s example."
    },
    {
      "pk": 21003010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 10,
      "text": "Heliodorus explained the king’s instructions and asked directly if these funds really existed.",
      "links": "<a href='/AIV/18/29/16'>Job 29:16</a>",
      "comment": "Heliodorus acts as an investigator, similar to seekers of truth, but here with a motive aimed at worldly gain."
    },
    {
      "pk": 21003011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 11,
      "text": "The high priest assured him that much of the money was deposits from widows and orphans, and part belonged to Hyrcanus, son of Tobias, a man of high social standing.",
      "links": "<a href='/AIV/19/68/5'>Ps. 68:5</a>; <a href='/AIV/23/1/17'>Isa. 1:17</a>",
      "comment": "Provision for the vulnerable is a recurring theme in Scripture; the funds were safeguarded by the religious authorities."
    },
    {
      "pk": 21003012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 12,
      "text": "It was wrong to harm those who had placed their trust in the sacred treasury and in the honor of the place respected by all the world.",
      "links": "<a href='/AIV/19/146/9'>Ps. 146:9</a>; <a href='/AIV/02/22/22'>Ex. 22:22</a>",
      "comment": "Justice and defense of the helpless is highlighted, paralleling the Lord’s concern in Exodus and the Psalms."
    },
    {
      "pk": 21003013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 13,
      "text": "However, Heliodorus insisted, because the king had commanded him, and he announced that he must complete his work.",
      "links": "<a href='/AIV/17/3/13'>Esth. 3:13</a>",
      "comment": "Imperial authority often demands compliance, even in violation of religious principles. Esther faced similar pressure."
    },
    {
      "pk": 21003014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 14,
      "text": "So Heliodorus formally entered the temple, accompanied by the king’s guards.",
      "links": "<a href='/AIV/19/79/1'>Ps. 79:1</a>",
      "comment": "Gentile intrusion into the holy place foreshadows later desecration and suffering prophesied throughout Scripture."
    },
    {
      "pk": 21003015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 15,
      "text": "The priests, together with the women and children, begged God to keep His holy place pure, since it was about to be violated.",
      "links": "<a href='/AIV/19/26/8'>Ps. 26:8</a>; <a href='/AIV/23/56/7'>Isa. 56:7</a>",
      "comment": "The communal prayer for protection reveals the people's understanding of corporate intercession—see how worship involves all ages and genders."
    },
    {
      "pk": 21003016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 16,
      "text": "While the crowd grieved over the impending danger, the high priest appeared heartbroken; his face changed, and fear overcame him.",
      "links": "<a href='/AIV/19/6/3'>Ps. 6:3</a>",
      "comment": "The distress experienced here is similar to that found in David’s laments when the sanctuary was attacked or threatened."
    },
    {
      "pk": 21003017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 17,
      "text": "He shook with terror, and the agony of his soul revealed the inner horror he felt at the desecration that was planned.",
      "links": "<a href='/AIV/27/10/8'>Dan. 10:8</a>",
      "comment": "Physical and spiritual anguish are intertwined in crisis, demonstrating the depth of connection between God’s people and His house."
    },
    {
      "pk": 21003018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 18,
      "text": "People rushed out of their homes in groups, urgently praying because the temple was about to be dishonored.",
      "links": "<a href='/AIV/19/84/1-2'>Ps. 84:1-2</a>",
      "comment": "Fervent communal prayer in times of spiritual danger points to the importance of unity in supplication."
    },
    {
      "pk": 21003019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 19,
      "text": "The women clothed themselves in sackcloth, filling the streets, while young girls gathered in public, some running to the gates and others to the walls, all begging God for mercy.",
      "links": "<a href='/AIV/32/3/8'>Jonah 3:8</a>; <a href='/AIV/29/2/16'>Joel 2:16</a>",
      "comment": "Repentance and intercession are expressed physically and spiritually; similar scenes occur in Jonah and Joel when people seek deliverance."
    },
    {
      "pk": 21003020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 20,
      "text": "The priests, in their priestly garments, knelt before the altar and called upon heaven, asking Him to preserve the sacred treasures entrusted to them.",
      "links": "<a href='/AIV/03/16/2'>Lev. 16:2</a>; <a href='/AIV/19/134/2'>Ps. 134:2</a>",
      "comment": "Priestly intercession is a key biblical pattern, prefiguring the ultimate High Priest’s role in interceding for God's people."
    },
    {
      "pk": 21003021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 21,
      "text": "It seemed certain Heliodorus would carry out his orders, and the city was gripped by confusion and mourning.",
      "links": "<a href='/AIV/19/102/21-22'>Ps. 102:21-22</a>",
      "comment": "Disorder and grief often precede God’s intervention; see other moments when distress leads to deep prayer and divine deliverance."
    },
    {
      "pk": 21003022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 22,
      "text": "The people knelt together and entreated the Lord Almighty to intervene against the threat to the deposits entrusted by the community.",
      "links": "<a href='/AIV/19/17/1'>Ps. 17:1</a>",
      "comment": "The approach to God as ‘Almighty’ reflects deep reverence and trust in His protection, a title that appears often in Psalms."
    },
    {
      "pk": 21003023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 23,
      "text": "While Heliodorus carried out his plan, God’s power was made clear to everyone.",
      "links": "<a href='/AIV/02/14/27'>Ex. 14:27</a>; <a href='/AIV/27/6/27'>Dan. 6:27</a>",
      "comment": "Divine intervention that reveals God’s authority echoes the Red Sea miracle and Daniel’s deliverance."
    },
    {
      "pk": 21003024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 24,
      "text": "When Heliodorus entered the treasury with his guards, the Lord of spirits and all authority sent a powerful manifestation. This was evident to all who saw it.",
      "links": "<a href='/AIV/27/10/6'>Dan. 10:6</a>; <a href='/AIV/02/40/34-35'>Ex. 40:34-35</a>",
      "comment": "God’s supernatural defense of His sanctuary recalls the Shekinah glory that once filled the tabernacle and temple."
    },
    {
      "pk": 21003025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 25,
      "text": "They saw a fearsome horse, beautifully adorned, rushing powerfully at Heliodorus and striking him with its hooves. Its rider wore terrifying armor.",
      "links": "<a href='/AIV/01/32/24'>Gen. 32:24</a>; <a href='/AIV/66/19/11-16'>Rev. 19:11-16</a>",
      "comment": "Heavenly intervention through symbolic horses, recalling Jacob wrestling with God and John’s vision in Revelation."
    },
    {
      "pk": 21003026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 26,
      "text": "Beside him appeared two young men, strong, glistening in beauty and radiance, dressed in splendid clothing, who stood on each side and struck Heliodorus repeatedly.",
      "links": "<a href='/AIV/27/10/5'>Dan. 10:5</a>; <a href='/AIV/42/24/4'>Luke 24:4</a>",
      "comment": "Angelic figures appear in times of crisis; their presence is a recurring motif throughout the Old and New Testament."
    },
    {
      "pk": 21003027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 27,
      "text": "Heliodorus fell unconscious to the ground; covered in darkness, he was carried out on a stretcher.",
      "links": "<a href='/AIV/44/9/8'>Acts 9:8</a>",
      "comment": "The effect of divine power sometimes leaves men physically incapacitated, as seen in Saul’s conversion experience."
    },
    {
      "pk": 21003028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 28,
      "text": "And Heliodorus, who had entered with great pomp and his military entourage, was carried away helpless, acknowledging divine power.",
      "links": "<a href='/AIV/20/16/18'>Prov. 16:18</a>",
      "comment": "God humbles the proud; Proverbs notes that pride precedes destruction."
    },
    {
      "pk": 21003029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 29,
      "text": "So everyone praised the Lord who had miraculously protected His temple.",
      "links": "<a href='/AIV/19/105/1-2'>Ps. 105:1-2</a>",
      "comment": "God’s mighty works in history inspire corporate worship and thanksgiving."
    },
    {
      "pk": 21003030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 30,
      "text": "Heliodorus lay speechless and without any hope of recovery, having tasted the power of God.",
      "links": "<a href='/AIV/19/39/13'>Ps. 39:13</a>",
      "comment": "Physical inability after a supernatural encounter points toward the awesomeness and mystery of God’s presence."
    },
    {
      "pk": 21003031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 31,
      "text": "Those close to Heliodorus asked Onias to pray for his life, fearing that the king would blame him for Heliodorus’s death.",
      "links": "<a href='/AIV/18/42/8'>Job 42:8</a>",
      "comment": "Even authorities recognize the special intercessory role of God’s appointed servants; compare with Job’s role for his friends."
    },
    {
      "pk": 21003032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 32,
      "text": "The high priest, fearing royal punishment, offered sacrifices for Heliodorus’s recovery.",
      "links": "<a href='/AIV/03/16/17'>Lev. 16:17</a>",
      "comment": "Sacrificial intercession for the afflicted anticipates deeper mysteries of atonement and priestly mediation."
    },
    {
      "pk": 21003033,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 33,
      "text": "The same young men appeared again to Heliodorus, saying, 'Give thanks to Onias, for the Lord has spared your life because of his prayers.'",
      "links": "<a href='/AIV/19/106/8'>Ps. 106:8</a>",
      "comment": "God's mercy is extended through the prayers of the righteous; spiritual authority acts as a channel for divine favor."
    },
    {
      "pk": 21003034,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 34,
      "text": "Heliodorus offered a sacrifice to the Lord, made vows, and thanked Onias before returning to the king.",
      "links": "<a href='/AIV/46/9/13'>1 Cor. 9:13</a>",
      "comment": "Post-trauma, Heliodorus acknowledges sacred mediators and makes restitution; see how New Testament ministers are supported by offerings."
    },
    {
      "pk": 21003035,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 35,
      "text": "He testified to everyone about the manifest works of the Supreme God that he had seen with his own eyes.",
      "links": "<a href='/AIV/19/126/3'>Ps. 126:3</a>",
      "comment": "Personal testimony to miracles forms part of the biblical witness to God’s power."
    },
    {
      "pk": 21003036,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 36,
      "text": "King Seleucus, amazed by the account, ordered that the temple remain untouchable and its deposits undisturbed.",
      "links": "<a href='/AIV/11/8/61'>1 Kings 8:61</a>",
      "comment": "Earthly rulers sometimes affirm divine authority when confronted by signs; the king’s response preserves the sanctity of the temple."
    },
    {
      "pk": 21003037,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 37,
      "text": "Heliodorus, however, advised everyone not to attempt anything against the temple if they wished to live.",
      "links": "<a href='/AIV/09/6/20'>1 Sam. 6:20</a>",
      "comment": "The warning echoes other moments when people who violated sacred places faced divine judgment."
    },
    {
      "pk": 21003038,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 38,
      "text": "This is how the protection of the temple funds was assured, and how Onias’s character as a noble and godly priest was confirmed.",
      "links": "<a href='/AIV/19/132/9'>Ps. 132:9</a>",
      "comment": "The steadfast character of the priest brings blessing and security to the community, reflecting the role of mediators in God’s plan."
    },
    {
      "pk": 21003039,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 39,
      "text": "Peace returned to the city, and the temple continued to be honored by foreigners from every nation.",
      "links": "<a href='/AIV/19/87/4'>Ps. 87:4</a>",
      "comment": "The universal esteem of the temple prefigures the gathering of many nations to God's house, revealed more fully in the prophets and the gospels."
    },
    {
      "pk": 21003040,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 3,
      "verse": 40,
      "text": "Such was the story of Heliodorus and how he was saved from peril through the power of God.",
      "links": "<a href='/AIV/19/34/7'>Ps. 34:7</a>",
      "comment": "God’s deliverance is personal and communal; many psalms record similar interventions, and this points to God’s continuing protection of His sacred people and places."
    }
  ],
  "translatedAt": "2025-12-24T05:30:42.429Z"
}