{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 7,
  "verses": [
    {
      "pk": 21007001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 1,
      "text": "It happened also that seven brothers and their mother were arrested and forced by the king to eat pork in violation of the law, and were tortured with whips and scourges.",
      "links": "<a href='/AIV/03/11/7'>Lev. 11:7</a>; <a href='/AIV/05/14/8'>Deut. 14:8</a>",
      "comment": "This introduces the story of the martyrdom of the seven brothers and their mother for refusing to violate God's Law. Their refusal to eat pork demonstrates faithfulness to the Law of Moses even under persecution—a theme echoed later in Christian martyrdom."
    },
    {
      "pk": 21007002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 2,
      "text": "One of them, speaking for the others, said, 'What do you want to ask or learn from us? We are ready to die rather than break the laws of our ancestors.'",
      "links": "<a href='/AIV/27/03/16-18'>Dan. 3:16-18</a>; <a href='/AIV/58/11/35-38'>Heb. 11:35-38</a>",
      "comment": "Their willingness to choose death over violating God's commandments foreshadows later Christian martyrs' steadfastness. The theme of obedience to God's laws above human authority is central here."
    },
    {
      "pk": 21007003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 3,
      "text": "The king, enraged, commanded that pans and caldrons be heated.",
      "links": "",
      "comment": "The intensifying torture shows the severity of the persecution endured for the faith, as well as the resolve of those who choose fidelity to God over their own lives."
    },
    {
      "pk": 21007004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 4,
      "text": "As soon as they were heated, he commanded to cut out the tongue of the one who spoke for all, to scalp him, and to cut off his hands and feet, while the rest of his brothers and his mother watched.",
      "links": "",
      "comment": "The graphic torture amplifies the gravity of their sacrifice. The willingness to suffer such torment for the faith is a testimony that inspired later generations, and echoes Christ's own passion."
    },
    {
      "pk": 21007005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 5,
      "text": "After he was maimed in this way, the king ordered them to bring him to the fire, still breathing, and fry him in the pan. The fumes spread widely, but the brothers and their mother encouraged each other to die nobly, saying,",
      "links": "<a href='/AIV/58/11/35-37'>Heb. 11:35-37</a>",
      "comment": "Their encouragement to one another in the face of death reflects Christian fellowship and mutual support in persecution. The focus on a noble death for the faith echoes in Acts 7:59-60."
    },
    {
      "pk": 21007006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 6,
      "text": "'The Lord God is watching over us and truly has compassion on us, as Moses declared in his song, “He will have compassion on his servants.”'",
      "links": "<a href='/AIV/05/32/36'>Deut. 32:36</a>",
      "comment": "Their trust in God's faithfulness is rooted in the Scriptures. Citing Moses connects their suffering with Israel’s history and confidence in God’s ultimate justice."
    },
    {
      "pk": 21007007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 7,
      "text": "After the first brother died in this way, they brought the second to be mocked. When they tore the skin from his head with the hair, he declared, 'Before you begin to torture me, let me say this:'",
      "links": "",
      "comment": "Each brother’s witness becomes increasingly bold, displaying a conviction that suffering for God is of eternal value. This courageous speech echoes the boldness found in early Christian witness (Acts 4:13)."
    },
    {
      "pk": 21007008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 8,
      "text": "'You may free us from this present life, but the King of the universe will raise us up to everlasting life, because we have died for His laws.'",
      "links": "<a href='/AIV/27/12/2'>Dan. 12:2</a>; <a href='/AIV/43/11/25'>John 11:25</a>",
      "comment": "Here, a clear belief in the resurrection is expressed—God’s faithful will be raised to life everlasting. This development of resurrection hope anticipates later Christian doctrine of bodily resurrection (see 1 Cor. 15:42-44)."
    },
    {
      "pk": 21007009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 9,
      "text": "After him, the third was subjected to their torture. When it was demanded, he stuck out his tongue immediately, and courageously held out his hands,",
      "links": "",
      "comment": "The voluntary surrender of tongue and hands highlights their offering of themselves completely to God, reminiscent of Paul’s call to offer one’s body as a living sacrifice (Rom. 12:1)."
    },
    {
      "pk": 21007010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 10,
      "text": "and he bravely said, 'Heaven gave these to me; for the sake of His laws I disdain them, and from Him I hope to receive them back again.'",
      "links": "<a href='/AIV/18/19/25-27'>Job 19:25-27</a>; <a href='/AIV/50/03/21'>Phil. 3:21</a>",
      "comment": "This bold profession of faith in resurrection—expecting God to restore his limbs—foreshadows Christian belief in the resurrection of the body. The allusion to Heaven as the provider reflects a trust in God's sovereign authority."
    },
    {
      "pk": 21007011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 11,
      "text": "The king and his attendants were astonished at the young man's courage, because he regarded his sufferings as nothing.",
      "links": "<a href='/AIV/45/8/18'>Rom. 8:18</a>",
      "comment": "The power of faith gives courage that even worldly rulers cannot comprehend. Paul echoes this spirit, teaching that present sufferings are not worth comparing with future glory."
    },
    {
      "pk": 21007012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 12,
      "text": "When the third had died, they tortured the fourth with the same cruelty.",
      "links": "",
      "comment": "The relentless suffering of the brothers provides a model of perseverance in faith, enduring trials for a higher hope—making them forerunners of the martyrs in the early Church."
    },
    {
      "pk": 21007013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 13,
      "text": "When he was near death, he said: 'It is better to die at the hands of men, hoping God gives us resurrection, than to be resurrected to judgment by you, for you will have no resurrection to life.'",
      "links": "<a href='/AIV/40/10/28'>Matt. 10:28</a>; <a href='/AIV/65/1/7'>Jude 1:7</a>",
      "comment": "He clearly distinguishes between the resurrection to life for the faithful and the resurrection to judgment for the wicked—a concept Jesus later affirms in John 5:29."
    },
    {
      "pk": 21007014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 14,
      "text": "Next they brought the fifth brother and brutally tortured him. But looking at the king, he said,",
      "links": "",
      "comment": "The example of boldness in the face of suffering continues. Their confidence rooted in God, not human rulers, exemplifies the biblical call to fear God above men."
    },
    {
      "pk": 21007015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 15,
      "text": "'Having authority among men, you may do as you wish, but you are only mortal. Do not think God has abandoned our people.'",
      "links": "<a href='/AIV/19/94/14'>Ps. 94:14</a>",
      "comment": "The martyr affirms God’s continual faithfulness to His people, foreshadowing the assurance Jesus gives: He is with His followers always (Matt. 28:20)."
    },
    {
      "pk": 21007016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 16,
      "text": "'But endure, and you will see His great power, how He will torment you and your descendants.'",
      "links": "<a href='/AIV/02/20/5'>Ex. 20:5</a>",
      "comment": "Divine justice is emphasized—the suffering of the righteous is not the end; the wicked will face God's just judgment."
    },
    {
      "pk": 21007017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 17,
      "text": "After him, they brought the sixth, and as he was about to die, he said, 'Do not be deceived; we suffer these things because of our own sins against our God.'",
      "links": "<a href='/AIV/27/09/5-7'>Dan. 9:5-7</a>",
      "comment": "This confession of national sin and just punishment echoes the prophets, showing an acceptance of collective responsibility and the mystery of redemptive suffering."
    },
    {
      "pk": 21007018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 18,
      "text": "'Amazingly, do not think you will go unpunished for daring to fight against God.'",
      "links": "<a href='/AIV/05/32/41-43'>Deut. 32:41-43</a>",
      "comment": "A warning is given that persecutors of God’s faithful will face ultimate accountability. This strengthens the hope of justice for believers."
    },
    {
      "pk": 21007019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 19,
      "text": "But their mother was especially admirable and worthy of lasting remembrance. Though she saw her seven sons perish within a single day, she bore it with courageous faith because she trusted in the Lord.",
      "links": "<a href='/AIV/58/11/35'>Heb. 11:35</a>",
      "comment": "The courage and faith of the mother prefigure Mary’s own suffering at the cross. The veneration of pious women of faith is reflected here."
    },
    {
      "pk": 21007020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 20,
      "text": "She encouraged each one in the language of their forefathers, filled with a noble spirit, and her womanly heart, strengthened with a man’s courage, spoke to them:",
      "links": "<a href='/AIV/01/21/12'>Gen. 21:12</a>, <a href='/AIV/07/04/4-9'>Judg. 4:4-9</a>",
      "comment": "Her strength and exhortation recall the noble women of Israel’s history—Sarah, Deborah, and Hannah—showing God’s grace works powerfully through women."
    },
    {
      "pk": 21007021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 21,
      "text": "She said to them: 'I do not know how you came into being in my womb. It was not I who gave you life and breath, nor I who arranged the elements each of you is composed of.'",
      "links": "<a href='/AIV/18/10/8-12'>Job 10:8-12</a>; <a href='/AIV/19/139/13-14'>Ps. 139:13-14</a>",
      "comment": "The mother’s words acknowledge God as Creator, affirming that life itself is God’s gift—a key biblical truth (Gen. 2:7)."
    },
    {
      "pk": 21007022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 22,
      "text": "'Therefore, the Creator of the world, who formed the human race and brought all things into being, in His mercy, will give you back both life and breath, because you now disregard yourselves for His sake.'",
      "links": "<a href='/AIV/01/02/7'>Gen. 2:7</a>; <a href='/AIV/40/16/25'>Matt. 16:25</a>",
      "comment": "Resurrection is here directly linked with God's mercy—laying down one's life for God’s Law is rewarded with new life, a theme Jesus reaffirms (Matt. 16:25)."
    },
    {
      "pk": 21007023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 23,
      "text": "'But for you, who have plotted against us and all Israel, you will not escape God’s judgment, either now or in the future.'",
      "links": "<a href='/AIV/19/94/23'>Ps. 94:23</a>",
      "comment": "God’s justice is reaffirmed: oppressors will ultimately answer to Him. This points to divine vindication, another motif fulfilled in the New Testament."
    },
    {
      "pk": 21007024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 24,
      "text": "The king, enraged by the scorn, took even worse measures, suspecting her words were contemptuous. He begged the youngest son, while promising with oaths, to make him rich and happy if he would turn from the traditions of his ancestors, and he would make him a friend and appoint him to high office.",
      "links": "<a href='/AIV/40/04/8-10'>Matt. 4:8-10</a>",
      "comment": "Here, worldly rewards are offered to forsake God’s traditions—reminiscent of Satan's temptation of Jesus with earthly power. True faith values fidelity over compromise."
    },
    {
      "pk": 21007025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 25,
      "text": "But, as the young man paid no attention at all, the king called the mother and urged her to advise the boy to save himself.",
      "links": "",
      "comment": "The king appeals to maternal affection, attempting to break the resolve of faith through emotional pressure—a common tactic in persecution."
    },
    {
      "pk": 21007026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 26,
      "text": "After much persuasion from the king, she agreed to counsel her son, but leaning in close, she mocked the cruel tyrant in the language of her ancestors:",
      "links": "",
      "comment": "The use of their ancestral language is a sign of inner unity and faithfulness to heritage, nurturing faith even under pressure."
    },
    {
      "pk": 21007027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 27,
      "text": "'My son, have pity on me. I carried you nine months in my womb, nursed you for three years, raised you and cared for you until now.'",
      "links": "",
      "comment": "The mother appeals tenderly, paralleling parental sacrifice. Her words echo motifs of deep, nurturing love."
    },
    {
      "pk": 21007028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 28,
      "text": "'I beg you, my child, look at the sky and the earth. Consider all that is in them, and recognize that God made them from nothing, and so the human race came into being.'",
      "links": "<a href='/AIV/01/01/1'>Gen. 1:1</a>; <a href='/AIV/45/4/17'>Rom. 4:17</a>",
      "comment": "She proclaims God’s creatio ex nihilo (creation from nothing), foundational to Christian doctrine and later creedal formulations. Faith in God as Creator supports belief in resurrection."
    },
    {
      "pk": 21007029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 29,
      "text": "'Do not fear this executioner, but prove yourself worthy of your brothers. Accept death, so that by God’s mercy I may receive you again with your brothers.'",
      "links": "<a href='/AIV/66/20/4'>Rev. 20:4</a>",
      "comment": "Her hope of reunion through resurrection prefigures the Christian hope of meeting loved ones again in God's kingdom."
    },
    {
      "pk": 21007030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 30,
      "text": "Before she finished speaking, the young man said, 'What are you waiting for? I will not obey the king's command. I obey the command of the law given to our ancestors through Moses.'",
      "links": "<a href='/AIV/05/06/5'>Deut. 6:5</a>",
      "comment": "The stubborn fidelity to God’s law reflects the Shema’s call to love God above all, even to the point of death. Obedience to divine command over human command is highlighted."
    },
    {
      "pk": 21007031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 31,
      "text": "'You, who have plotted all kinds of evil against the Hebrews, will not escape the hands of God.'",
      "links": "<a href='/AIV/19/37/12-13'>Ps. 37:12-13</a>",
      "comment": "God's retribution for evildoers is a persistent biblical message. The confidence in divine justice is strong here."
    },
    {
      "pk": 21007032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 32,
      "text": "'For we are suffering because of our own sins.'",
      "links": "<a href='/AIV/27/09/16'>Dan. 9:16</a>",
      "comment": "Here, the doctrine of redemptive suffering finds voice—suffering can be a consequence of sin but also leads to purification."
    },
    {
      "pk": 21007033,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 33,
      "text": "'But our living Lord is angry for a little while to discipline us and correct us; again He will be reconciled with His own servants.'",
      "links": "<a href='/AIV/19/103/9'>Ps. 103:9</a>; <a href='/AIV/58/12/6'>Heb. 12:6</a>",
      "comment": "The interplay of discipline, correction, and reconciliation hints at the mercy of God, a theology fulfilled in Christ as the reconciler and intercessor."
    },
    {
      "pk": 21007034,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 34,
      "text": "'But you, unholy man, the most wicked of all, do not think you will go unpunished for daring to fight against God.'",
      "links": "<a href='/AIV/44/12/23'>Acts 12:23</a>",
      "comment": "Divine retribution is assured for those who resist God—echoing warnings in Acts and the Epistles."
    },
    {
      "pk": 21007035,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 35,
      "text": "Having endured extreme torture, the last of the brothers died, completely trusting in the Lord.",
      "links": "",
      "comment": "The final brother’s death completes the witness of unwavering faith, trusting God even unto death—a theme realized in the Apostle’s martyrdom."
    },
    {
      "pk": 21007036,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 36,
      "text": "Last of all, the mother died after her sons.",
      "links": "",
      "comment": "Her death seals her faith and love, reminiscent of women martyrs in Christian tradition."
    },
    {
      "pk": 21007037,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 37,
      "text": "Let this be enough, then, about the eating of sacrifices and extraordinary tortures.",
      "links": "",
      "comment": "The narrator concludes the account, inviting reflection on the power of faithfulness over the pressure of compromise."
    },
    {
      "pk": 21007038,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 38,
      "text": "But I urge those who read this book not to be discouraged by such sufferings, but to recognize that God disciplines those whom He loves, as Moses declared in his song.",
      "links": "<a href='/AIV/05/08/5'>Deut. 8:5</a>; <a href='/AIV/58/12/6'>Heb. 12:6</a>",
      "comment": "Discipline as love comes from God (see Heb. 12:6). Moses' teaching is echoed—a sign that God’s correction aims to restore, not destroy."
    },
    {
      "pk": 21007039,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 39,
      "text": "Let these events be a reminder of the power of faith, that after times of affliction there will come joy and divine deliverance.",
      "links": "<a href='/AIV/19/30/5'>Ps. 30:5</a>; <a href='/AIV/60/05/10'>1 Pet. 5:10</a>",
      "comment": "The promise of joy after suffering is consistent with both Old and New Testament teaching. Affliction leads to glory through perseverance in faith."
    },
    {
      "pk": 21007040,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 40,
      "text": "Let us be brave, like these brothers and their mother, willing to suffer for righteousness to inherit life everlasting.",
      "links": "<a href='/AIV/40/05/10-12'>Matt. 5:10-12</a>",
      "comment": "This call to emulate these martyrs is mirrored in Jesus’ beatitudes: blessed are those persecuted for righteousness’ sake, for theirs is the kingdom of heaven."
    },
    {
      "pk": 21007041,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 41,
      "text": "Such examples were recorded to strengthen faith, so that in the midst of trials we may remember the great reward God prepares for those who love Him.",
      "links": "<a href='/AIV/59/1/12'>Jas. 1:12</a>; <a href='/AIV/46/2/9'>1 Cor. 2:9</a>",
      "comment": "Instruction by example is a hallmark of biblical teaching. These martyrs’ stories serve as encouragement to persevere in faith."
    },
    {
      "pk": 21007042,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 7,
      "verse": 42,
      "text": "So ends the account of the extraordinary courage and steadfast faith of the mother and her seven sons.",
      "links": "",
      "comment": "The final verse closes this powerful account of martyrdom for obedience to God’s law—a profound precursor to Christian teachings on redemptive suffering, resurrection, and perseverance."
    }
  ],
  "translatedAt": "2025-12-24T05:33:40.183Z"
}