{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 5,
  "verses": [
    {
      "pk": 21005001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 1,
      "text": "About this time, Antiochus set out on a second expedition into Egypt.",
      "links": "<a href='/AIV/27/11/29'>Dan. 11:29</a>",
      "comment": "Antiochus Epiphanes, the persecutor of the Jews, invades Egypt again as predicted in Daniel 11. The text highlights how the turmoil unfolds due to his ambition. This prepares for God's intervention, reminiscent of God's sovereignty over empires (see Daniel)."
    },
    {
      "pk": 21005002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 2,
      "text": "At the same time, there appeared throughout all Jerusalem visions of horses clad in gold charging through the air, with warriors riding on them in battle formation, launching attacks and brandishing swords—an army seen in fearsome array.",
      "links": "<a href='/AIV/12/6/17'>2 Kgs. 6:17</a>; <a href='/AIV/66/19/11-16'>Rev. 19:11-16</a>",
      "comment": "This is a supernatural vision indicating divine intervention, much like when Elisha's servant saw the armies of heaven. The spiritual reality behind physical events is emphasized. In Christian theology, such angelic hosts prefigure spiritual battles won through divine power, themes fulfilled in Revelation."
    },
    {
      "pk": 21005003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 3,
      "text": "All people prayed for these visions to be a good sign.",
      "links": "<a href='/AIV/44/12/5'>Acts 12:5</a>",
      "comment": "The faithful turn to prayer when confronted by supernatural signs, demonstrating a communal trust in God's providence. This echoes the importance of persistent prayer for deliverance, a theme found throughout both Old and New Testament."
    },
    {
      "pk": 21005004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 4,
      "text": "But a false report was spread that Antiochus had died. Jason took at least a thousand men and made a sudden attack on the city. When the defenders on the wall were forced to retreat, the city was finally taken; Menelaus fled to the citadel.",
      "links": "<a href='/AIV/21/4/41-42'>1 Macc. 4:41-42</a>",
      "comment": "Jason, the former high priest, exploits civil turmoil for power. Internal strife weakens the people, mirroring conflicts over rightful leadership—a recurring theme in Israel's history and the early Church."
    },
    {
      "pk": 21005005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 5,
      "text": "Jason mercilessly slaughtered the citizens, seeing not his countrymen, but enemies, and did not realize that success against his people would bring his own downfall.",
      "links": "<a href='/AIV/19/7/15-16'>Ps. 7:15-16</a>; <a href='/AIV/40/26/52'>Matt. 26:52</a>",
      "comment": "Violence against one's own people is always condemned in Scripture. This verse foreshadows the principle that those who take up the sword will perish by it—a warning against divisions within the community of faith."
    },
    {
      "pk": 21005006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 6,
      "text": "He did not win power; instead, in the end, he was forced to flee to the country of the Ammonites. Then, his evil deeds finally caught up with him. Doomed by so many accusations, pursued by all, he eventually destroyed himself by the sword.",
      "links": "<a href='/AIV/19/9/15-16'>Ps. 9:15-16</a>",
      "comment": "The punishment fits the crime: those who sow violence reap it. This notion of justice is common in wisdom literature and later Christian teaching on sowing and reaping."
    },
    {
      "pk": 21005007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 7,
      "text": "Jason took refuge from one city to another, pursued by everyone, hated as a traitor to the laws and his country, driven out to Egypt.",
      "links": "<a href='/AIV/21/4/25'>1 Macc. 4:25</a>",
      "comment": "Betrayal of the sacred and the community leads to isolation. The motif of the exile appears—one cut off because of rejection of God’s law. An implicit warning about faithfulness to the sacred tradition entrusted by God to His people."
    },
    {
      "pk": 21005008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 8,
      "text": "Jason, who had betrayed so many for power, finally perished in exile among foreigners, cast away without a decent burial and without mourning, nor the respect of his people.",
      "links": "<a href='/AIV/19/109/9-10'>Ps. 109:9-10</a>",
      "comment": "Lack of burial and mourning is significant shame in Jewish thought, often seen as a judgment from God. The verse underscores the importance of righteous leadership and the consequences of betraying one's spiritual responsibility."
    },
    {
      "pk": 21005009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 9,
      "text": "Returning to Antiochus, after his defeat in Egypt, Antiochus advanced against the city in a fury, believing the Jews had rebelled.",
      "links": "<a href='/AIV/21/1/16'>1 Macc. 1:16</a>",
      "comment": "Antiochus’s wrath against Jerusalem is a well-documented historical event. Persecution often follows when God's people are faithful. This passage sets the stage for the 'abomination'—an event prefiguring later spiritual persecutions."
    },
    {
      "pk": 21005010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 10,
      "text": "Therefore, he commanded his soldiers to mercilessly cut down those who came out of their houses or went out to the city, and to kill all who were found in hiding.",
      "links": "<a href='/AIV/21/1/31-32'>1 Macc. 1:31-32</a>",
      "comment": "The indiscriminate violence against the innocent recalls other biblical massacres. Such suffering highlights the reality of evil, but also the need for deliverance and a Redeemer."
    },
    {
      "pk": 21005011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 11,
      "text": "The massacre lasted for three days: eighty thousand were killed, forty thousand taken prisoner, and at least as many sold as slaves.",
      "links": "<a href='/AIV/24/32/28-29'>Jer. 32:28-29</a>",
      "comment": "The numbers emphasize the scale of suffering when God's people are subjected to pagan rule. Later, slavery and exile were seen as discipline calling people to repentance and faithfulness. Compare with the exile to Babylon."
    },
    {
      "pk": 21005012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 12,
      "text": "Yet not satisfied with this, he dared to enter the holiest Temple in the world, led by Menelaus, who had become a traitor to the laws and to his people.",
      "links": "<a href='/AIV/21/1/21-22'>1 Macc. 1:21-22</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>",
      "comment": "The desecration of the Temple is described as blasphemy of the highest order. Jesus later refers to this event as a prophecy of future abomination, highlighting the seriousness of profaning what is holy."
    },
    {
      "pk": 21005013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 13,
      "text": "He took the sacred vessels with his unholy hands, carried away gifts given by other kings for the enhancement and glory of the Temple, and with unclean hands seized what was consecrated.",
      "links": "<a href='/AIV/27/5/2-4'>Dan. 5:2-4</a>",
      "comment": "The theme of defiling sacred vessels recurs in Daniel. This is a grave sin, as true worship requires purity, foreshadowing the purity demanded of Christ's sacrifice in the New Covenant."
    },
    {
      "pk": 21005014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 14,
      "text": "Antiochus grew proud, not realizing that the Lord’s anger, provoked by the sins of the city’s inhabitants, was the true cause of their suffering, and not his own power.",
      "links": "<a href='/AIV/23/10/5-6'>Isa. 10:5-6</a>",
      "comment": "God sometimes uses pagan rulers to discipline His people, as in Isaiah and Jeremiah, though He holds them accountable for their pride. The passage teaches humility and trust in God's providential sovereignty."
    },
    {
      "pk": 21005015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 15,
      "text": "For if the people had not sinned so greatly, he, like Heliodorus sent by King Seleucus to Jerusalem, would have been beaten back and kept from touching anything inside.",
      "links": "<a href='/AIV/21/3/24-27'>2 Macc. 3:24-27</a>",
      "comment": "Past divine interventions protected the Temple. Persistent sin forfeits such protection. The importance of repentance and honoring what is holy stands out, a continual invitation for all believers."
    },
    {
      "pk": 21005016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 16,
      "text": "But the Lord did not choose His people for the sake of the place but the place for the sake of His people.",
      "links": "<a href='/AIV/05/12/11-14'>Deut. 12:11-14</a>; <a href='/AIV/44/7/48-50'>Acts 7:48-50</a>",
      "comment": "Sacred places are significant, but God's relationship with His people is primary. This is echoed in Stephen’s speech in Acts, showing God transcends any one location. The true temple is ultimately the community gathered in His name."
    },
    {
      "pk": 21005017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 17,
      "text": "Therefore, the Temple also shared in the punishment of the people, but later it participated in their prosperity, and the Lord restored it with all its glory, showing His mercy.",
      "links": "<a href='/AIV/16/12/43'>Neh. 12:43</a>; <a href='/AIV/19/102/13-16'>Ps. 102:13-16</a>",
      "comment": "The fate of the Temple is linked to the spiritual health of God’s people. Restoration and mercy are prominent, themes fulfilled in the coming of Christ, who rebuilds and glorifies the true spiritual Temple."
    },
    {
      "pk": 21005018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 18,
      "text": "Antiochus, being arrogant, did not understand that the Lord is angered for a little while but is soon merciful to His chosen nation, never abandoning them.",
      "links": "<a href='/AIV/19/30/5'>Ps. 30:5</a>; <a href='/AIV/45/11/29'>Rom. 11:29</a>",
      "comment": "God’s faithfulness endures despite temporary discipline. His mercy ultimately prevails, a mystery deepened in Christ’s fulfillment of God’s promises to His beloved people."
    },
    {
      "pk": 21005019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 19,
      "text": "He thought he was punishing the people, but, in reality, he was punishing himself because when he evildoingly attacked the Temple, he became the object of God's wrath.",
      "links": "<a href='/AIV/19/137/8-9'>Ps. 137:8-9</a>",
      "comment": "The passage reveals God’s justice: those used as instruments of discipline are not exempt from His judgment if they act out of malice. This theme recurs in biblical history, teaching respect for God’s holy things."
    },
    {
      "pk": 21005020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 20,
      "text": "The Temple, which even the Gentiles revered and to which had come abundant gifts for its glory and honor, was dishonored and robbed by Antiochus.",
      "links": "<a href='/AIV/11/8/41-43'>1 Kgs. 8:41-43</a>",
      "comment": "The reverence of outsiders for Jerusalem’s Temple reflects universal awareness of God’s presence. Christ later identifies His own person as the true Temple, uniting both Jew and Gentile in worship."
    },
    {
      "pk": 21005021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 21,
      "text": "After carrying away the sacred treasures from the Temple, Antiochus returned to Antioch, arrogant in his heart, believing he controlled the land and the sea. Yet he did not realize that divine wrath awaited him.",
      "links": "<a href='/AIV/19/73/18-20'>Ps. 73:18-20</a>",
      "comment": "Human power is fleeting. The rich imagery here points to the ultimate accountability of all before God. Pride goes before destruction, a wisdom echoed by Jesus and the apostles."
    },
    {
      "pk": 21005022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 22,
      "text": "He left governors to oppress the people: in Jerusalem, Philip, a Phrygian by birth, more brutal than the one who appointed him;",
      "links": "<a href='/AIV/21/1/34'>1 Macc. 1:34</a>",
      "comment": "The appointment of oppressive officials further highlights the sufferings endured. Leadership either builds up or destroys God's people—a motif that sets the stage for Christ’s promise of shepherds after His own heart."
    },
    {
      "pk": 21005023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 23,
      "text": "And in Gerizim, Andronicus; and besides these, Menelaus, who lorded it over his fellow citizens worse than the foreigners did.",
      "links": "<a href='/AIV/21/4/25'>1 Macc. 4:25</a>",
      "comment": "Internal betrayal can be more destructive than external oppression. Leadership’s moral quality remains a central concern, anticipating the New Testament emphasis on faithful stewardship in the household of God."
    },
    {
      "pk": 21005024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 24,
      "text": "Antiochus sent Apollonius with an army of twenty-two thousand, commanding him to slaughter the adult men and sell women and boys as slaves.",
      "links": "<a href='/AIV/02/1/22'>Ex. 1:22</a>",
      "comment": "The systematic campaign against Israel’s men, women, and children recalls Pharaoh’s attempts to destroy Israel in Egypt. Yet God’s providence repeatedly preserves His faithful remnant."
    },
    {
      "pk": 21005025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 25,
      "text": "Arriving in Jerusalem, he pretended to come in peace. But on the Sabbath, when the Jews refrained from work, he ordered his men to launch a sudden attack, killing all who had come out to see him, then rushed through the city with his armed men, slaughtering a great number.",
      "links": "<a href='/AIV/02/20/8-11'>Ex. 20:8-11</a>",
      "comment": "The Sabbath is purposefully targeted, highlighting the invader's contempt for God’s commands. Keeping the Sabbath is integral to Israel’s identity—a foreshadowing of the Lord’s Day, rooted in sacred tradition."
    },
    {
      "pk": 21005026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 26,
      "text": "But Judas Maccabeus, with about nine others, escaped to the mountains, living like wild animals in the wilderness. They survived on what grew naturally, to avoid defiling themselves by sharing in the unclean food.",
      "links": "<a href='/AIV/19/11/1'>Ps. 11:1</a>; <a href='/AIV/42/4/1-2'>Luke 4:1-2</a>",
      "comment": "Judas’s withdrawal is an act of faithfulness, reminiscent of prophets and the Messiah spending time in the wilderness. The idea of avoiding 'unclean food' connects to the importance of holiness and the discipline of fasting."
    },
    {
      "pk": 21005027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 5,
      "verse": 27,
      "text": "They kept themselves strictly according to the law, remaining pure during these days.",
      "links": "<a href='/AIV/03/11/44-45'>Lev. 11:44-45</a>; <a href='/AIV/60/1/15-16'>1 Pet. 1:15-16</a>",
      "comment": "Faithfulness to the law, especially under trial, is seen as evidence of true devotion. The call to be 'holy as God is holy' remains central. This pursuit of holiness is fulfilled in the body of Christ, who forms a pure and holy assembly set apart for God."
    }
  ],
  "translatedAt": "2025-12-24T05:32:15.679Z"
}