{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 4,
  "verses": [
    {
      "pk": 21004001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 1,
      "text": "But Simon, who had spoken against Onias, accused him before the governor, claiming that Onias was the reason for the troubles in the city and that he was stirring up rebellion against the nation.",
      "links": "<a href='/AIV/21/3/37'>2Macc 3:37</a>; <a href='/AIV/16/6/6'>Neh. 6:6</a>",
      "comment": "Simon’s opposition to Onias sets the stage for the struggle over spiritual leadership. This reflects tensions in maintaining unity and true worship, paralleling conflicts in the tradition around legitimate priesthood."
    },
    {
      "pk": 21004002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 2,
      "text": "He accused Onias of plotting against the state, saying he was responsible for the unrest among the people and that he prevented peace through his influence.",
      "links": "<a href='/AIV/21/4/1'>2Macc 4:1</a>",
      "comment": "False accusations against godly leadership echo incidents such as those against Daniel and Jeremiah (<a href='/AIV/27/6/4'>Dan 6:4</a>; <a href='/AIV/24/38/4'>Jer. 38:4</a>). The theme of suffering for righteousness is present."
    },
    {
      "pk": 21004003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 3,
      "text": "When the hostility continued, Apollonius, the governor of Coele-Syria and Phoenicia, was provoked and took action against Onias.",
      "links": "<a href='/AIV/21/3/5'>2Macc 3:5</a>",
      "comment": "Civil authorities intervene in temple matters, connecting the political with the spiritual. The harmony of Church and state in safeguarding true worship is implied here."
    },
    {
      "pk": 21004004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 4,
      "text": "Then Onias, seeing the danger to his people and the threats posed by Simon’s conspiracy, withdrew to take sanctuary near the temple.",
      "links": "<a href='/AIV/19/27/5'>Ps. 27:5</a>",
      "comment": "Seeking shelter in God’s house reveals a trust in the sacred as a refuge, later mirrored in Christ’s emphasis on the temple (<a href='/AIV/40/21/13'>Matt 21:13</a>)."
    },
    {
      "pk": 21004005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 5,
      "text": "But Simon continued in his evil plans, striving to harm Onias even among foreigners, and did not stop in his pursuit.",
      "links": "<a href='/AIV/20/24/8'>Prov. 24:8</a>",
      "comment": "Simon’s persistence in evil shows the enduring struggle between worldly ambition and holiness, recalling Jesus warning about persecution of true shepherds (<a href='/AIV/43/15/20'>John 15:20</a>)."
    },
    {
      "pk": 21004006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 6,
      "text": "Onias, recognizing Simon's danger and understanding the threat to the public welfare, viewed the conflict as serious and went to the king, not for his own sake but for the protection of his people.",
      "links": "<a href='/AIV/17/4/14'>Est. 4:14</a>",
      "comment": "Selfless intercession for others alludes to Christ's priestly role, foreshadowing the mediation for the people (<a href='/AIV/58/7/25'>Heb 7:25</a>)."
    },
    {
      "pk": 21004007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 7,
      "text": "After Seleucus died and Antiochus, who was called Epiphanes, took the throne, Jason, Onias’s brother, tried to seize the high priesthood through corruption.",
      "links": "<a href='/AIV/21/1/16'>2Macc 1:16</a>; <a href='/AIV/27/11/21'>Dan 11:21</a>",
      "comment": "The struggle over legitimate priestly succession points to the necessity of divinely established authority. Epiphanes (“manifest god”) foreshadows later conflicts over true worship."
    },
    {
      "pk": 21004008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 8,
      "text": "Jason approached the king and promised a large sum of money if he were appointed high priest, even more than what was required, as well as extra for granting the power to set up a Greek-style gymnasium and youth center.",
      "links": "<a href='/AIV/21/4/9'>2Macc 4:9</a>",
      "comment": "Bribery for spiritual office contradicts the divine pattern of calling, establishing the danger of worldly infiltration into God’s order, a lesson for church governance."
    },
    {
      "pk": 21004009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 9,
      "text": "The king granted Jason’s request, giving him authority to train Jerusalem’s youth after the customs of the Greeks and to establish places for athletic contests.",
      "links": "<a href='/AIV/21/6/9'>2Macc 6:9</a>",
      "comment": "The introduction of foreign customs challenges God’s revealed ways, foreshadowing the tension between the holy tradition and the spirit of the age."
    },
    {
      "pk": 21004010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 10,
      "text": "Jason accepted the king’s terms and, as soon as he had authority, began transforming his compatriots by introducing foreign habits and rejecting the ancestral laws.",
      "links": "<a href='/AIV/21/4/12'>2Macc 4:12</a>",
      "comment": "Abandoning the faith of the fathers teaches the importance of continuity in doctrine and worship."
    },
    {
      "pk": 21004011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 11,
      "text": "He abolished the privileges that had been given by previous kings for the practice of their religion, losing the right to self-governance that had been divinely granted.",
      "links": "<a href='/AIV/21/2/23'>2Macc 2:23</a>",
      "comment": "Removal of sacred privileges signals a breach in the bond between God and His people, recalling Paul’s warning against apostasy (<a href='/AIV/53/2/3'>2Thess 2:3</a>)."
    },
    {
      "pk": 21004012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 12,
      "text": "He eagerly built a gymnasium at the foot of the citadel, making the most influential youths train in Greek ways.",
      "links": "<a href='/AIV/21/4/9'>2Macc 4:9</a>",
      "comment": "The physical transformation of young people pictures the spiritual dangers of syncretism – blending sacred tradition with secular culture."
    },
    {
      "pk": 21004013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 13,
      "text": "This reached such a level that even priests neglected their duties at the altar, rushing for the wrestling school and the contests forbidden by the Law.",
      "links": "<a href='/AIV/21/6/10'>2Macc 6:10</a>; <a href='/AIV/39/2/7'>Mal. 2:7</a>",
      "comment": "Neglect of priestly duties for secular activities signals a crisis of spiritual leadership, reminiscent of Eli’s sons (<a href='/AIV/9/2/12'>1Sam 2:12</a>)."
    },
    {
      "pk": 21004014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 14,
      "text": "They disdained the things honored by their ancestors and loved the glory granted by the Greeks, even to the point of abandoning the dignity of their own service.",
      "links": "<a href='/AIV/43/12/43'>John 12:43</a>",
      "comment": "Seeking worldly honor above God’s calls to remain faithful. Christ urges His disciples to renounce worldly glory (<a href='/AIV/40/6/1-4'>Matt 6:1-4</a>)."
    },
    {
      "pk": 21004015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 15,
      "text": "For this reason, they were not merely disregarding the Law but were living as enemies to the ancient customs.",
      "links": "<a href='/AIV/19/78/56-57'>Ps. 78:56-57</a>",
      "comment": "Rebellion against tradition is depicted as enmity to God, highlighting the sacred continuity between generations through faith."
    },
    {
      "pk": 21004016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 16,
      "text": "When they imitated foreign ways and customs, they faced the worst kinds of misery, as the One who gave them their privilege turned against them.",
      "links": "<a href='/AIV/23/1/4'>Isa. 1:4</a>",
      "comment": "Spiritual consequence follows unfaithfulness; God’s blessings are tied to covenant fidelity."
    },
    {
      "pk": 21004017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 17,
      "text": "For it is not easy to break the divine laws and escape punishment, as history has shown of those who persistently transgress them.",
      "links": "<a href='/AIV/5/11/26-28'>Deut. 11:26-28</a>",
      "comment": "The spiritual principle of retribution and mercy through covenant is demonstrated here. The seriousness of sin is precisely why the need for mediators and repentance is essential."
    },
    {
      "pk": 21004018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 18,
      "text": "When the quadrennial games were held in Tyre, in the presence of the king, some from Jerusalem were sent as delegates with gifts.",
      "links": "<a href='/AIV/21/4/9'>2Macc 4:9</a>",
      "comment": "Participation in pagan festivals by Jewish delegates underscores the dilemma of cultural assimilation versus faithfulness."
    },
    {
      "pk": 21004019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 19,
      "text": "Jason, the sponsor of the delegation, sent three men with silver to pay for a sacrifice to Hercules, but those men did not use the money for that purpose out of conscience.",
      "links": "<a href='/AIV/19/115/2-8'>Ps. 115:2-8</a>",
      "comment": "The refusal to offer to idols marks a remnant of faithfulness, bearing witness to the enduring call to avoid idolatry. Conscience guides the true believer."
    },
    {
      "pk": 21004020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 20,
      "text": "Instead, they brought the money back and used it as appropriate at the people's discretion.",
      "links": "<a href='/AIV/21/3/10'>2Macc 3:10</a>",
      "comment": "Proper stewardship of resources reflects the principle of holy use for God’s purposes, not pagan ones."
    },
    {
      "pk": 21004021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 21,
      "text": "When Apollonius, son of Menestheus, was sent to Egypt for the coronation of King Philometor, Antiochus learned the king was against his interests, and was concerned for his own safety.",
      "links": "<a href='/AIV/27/11/17'>Dan 11:17</a>",
      "comment": "Political alliances and rivalries often impacted spiritual life, influencing who would support or oppose true worship."
    },
    {
      "pk": 21004022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 22,
      "text": "So Antiochus traveled to Joppa and then to Jerusalem, welcomed splendidly by Jason and the city, with torches, processions, and cheers.",
      "links": "<a href='/AIV/21/4/9'>2Macc 4:9</a>",
      "comment": "The welcoming of foreign rule highlights the temptation to seek human approval over divine authority."
    },
    {
      "pk": 21004023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 23,
      "text": "After spending some time there, Antiochus left for Tyre, leaving Menelaus in charge, who began using his authority for selfish ends.",
      "links": "<a href='/AIV/21/4/24'>2Macc 4:24</a>",
      "comment": "Entrusting leadership to unworthy men leads to spiritual decline, a warning repeated in the epistles (<a href='/AIV/54/3/2-7'>1Tim 3:2-7</a>)."
    },
    {
      "pk": 21004024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 24,
      "text": "Menelaus, seeing an opportunity for gain, bribed the king even more than Jason did, and obtained the high priesthood for himself, even though he was unqualified and had no lineage for it.",
      "links": "<a href='/AIV/4/16/1-2'>Num. 16:1-2</a>",
      "comment": "Illegitimate claim to priesthood recalls the rebellion of Korah, reinforcing the necessity of divine preservation of apostolic succession."
    },
    {
      "pk": 21004025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 25,
      "text": "Jason, ousted by someone less honorable, fled as an exile into the region of Ammon, pursued as a traitor to his people and laws.",
      "links": "<a href='/AIV/21/4/7'>2Macc 4:7</a>",
      "comment": "Even leaders who compromise with foreign customs eventually lose favor. This reveals the transient nature of worldly alliances."
    },
    {
      "pk": 21004026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 26,
      "text": "Menelaus, although gaining power, did nothing befitting his office; constantly resorting to further corruption against the city and its sacred institutions.",
      "links": "<a href='/AIV/21/4/14'>2Macc 4:14</a>",
      "comment": "Abuse of spiritual office for personal gain is condemned throughout Scripture, spotlighting the need for sanctity among leaders. See <a href='/AIV/43/10/12-13'>John 10:12-13</a>."
    },
    {
      "pk": 21004027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 27,
      "text": "When Sostratus, who was in charge of the temple finances, was called to account by the king for the unpaid funds, Menelaus fled, leaving others to answer for his actions.",
      "links": "<a href='/AIV/21/3/7'>2Macc 3:7</a>",
      "comment": "Irresponsibility with sacred offerings warns against this sin, which would also later cause trouble in the early Church (cf. <a href='/AIV/44/5/1-11'>Acts 5:1-11</a>)."
    },
    {
      "pk": 21004028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 28,
      "text": "Sostratus’s absence forced Crates, the city governor, to represent him before the king.",
      "links": "<a href='/AIV/21/4/27'>2Macc 4:27</a>",
      "comment": "Substitution in representation foreshadows the need for true mediators between God and man; a type later fulfilled in Christ."
    },
    {
      "pk": 21004029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 29,
      "text": "While all this was going on, the people in Jerusalem suffered continual turmoil as the two rival high priests fought for supremacy.",
      "links": "<a href='/AIV/21/4/7'>2Macc 4:7</a>; <a href='/AIV/21/4/24'>2Macc 4:24</a>",
      "comment": "Division in spiritual leadership causes strife and disorder, emphasizing the blessing of unity in faith (<a href='/AIV/19/133/1'>Ps. 133:1</a>)."
    },
    {
      "pk": 21004030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 30,
      "text": "Meanwhile, the king’s men from Tarsus and Malus were upset over being annexed to Antioch, and started a revolt.",
      "links": "<a href='/AIV/21/5/5'>2Macc 5:5</a>",
      "comment": "Political rebellion accompanies spiritual instability. Socio-political upheaval often parallels times of faith crisis."
    },
    {
      "pk": 21004031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 31,
      "text": "Antiochus, trying to restore order, left Andronicus in charge of Jerusalem and moved to resolve the unrest in Cilicia.",
      "links": "<a href='/AIV/21/5/22'>2Macc 5:22</a>",
      "comment": "Imperial interventions in local religious affairs threaten religious autonomy and purity."
    },
    {
      "pk": 21004032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 32,
      "text": "When Onias realized Andronicus was plotting against him, he sought asylum in the sanctuary of Daphne near Antioch.",
      "links": "<a href='/AIV/19/27/5'>Ps. 27:5</a>",
      "comment": "Onias’s flight to sanctuary echoes the importance of holy places as refuges, a theme later seen in Christ’s reverence for the temple (<a href='/AIV/42/19/45-46'>Luke 19:45-46</a>)."
    },
    {
      "pk": 21004033,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 33,
      "text": "Andronicus, compelled by Antiochus, persuaded Onias out of sanctuary by deceit, swearing solemn oaths, then murdered him at once.",
      "links": "<a href='/AIV/19/55/21'>Ps. 55:21</a>; <a href='/AIV/41/14/44'>Mark 14:44</a>",
      "comment": "Murder under false oaths shows the gravity of sacrilege, with echoes of betrayal as in Judas (<a href='/AIV/41/14/44'>Mark 14:44</a>), stressing the sanctity of God’s promises."
    },
    {
      "pk": 21004034,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 34,
      "text": "Though guilty, Andronicus was not spared by the people, who hated his crime. When the king returned from Cilicia, the Jews complained to him, with other nationals outraged at this sacrilege.",
      "links": "<a href='/AIV/21/4/36'>2Macc 4:36</a>",
      "comment": "Popular justice avenges sacrilege, showing a universal acknowledgment of sacred things, a principle later affirmed in Romans (<a href='/AIV/45/2/15'>Rom. 2:15</a>)."
    },
    {
      "pk": 21004035,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 35,
      "text": "The grief over Onias moved Antiochus, and he remembered the man's wisdom and noble character. He was so angry he shed tears and ordered Andronicus’s execution on the spot.",
      "links": "<a href='/AIV/21/4/33'>2Macc 4:33</a>",
      "comment": "The righteous are honored after death, and justice prevails in God’s timing, reflecting divine vindication of His servants."
    },
    {
      "pk": 21004036,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 36,
      "text": "Antiochus ordered Andronicus to be stripped of his purple robe, led around the city, and executed for his heinous deeds against Onias.",
      "links": "<a href='/AIV/21/4/34'>2Macc 4:34</a>; <a href='/AIV/40/27/28'>Matt 27:28</a>",
      "comment": "The public nature of the punishment recalls how evil is exposed and defeated openly, a foreshadowing of Christ’s triumph over sin through visible suffering."
    },
    {
      "pk": 21004037,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 37,
      "text": "Many acts of injustice were committed by Menelaus against sacred objects and laws. He was not punished but instead gained more power with bribery.",
      "links": "<a href='/AIV/21/4/24'>2Macc 4:24</a>",
      "comment": "The apparent success of evil is a test of faith, yet in God’s providence judgment will come even if delayed. Compare <a href='/AIV/19/73/3'>Ps. 73:3</a>."
    },
    {
      "pk": 21004038,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 38,
      "text": "Menelaus even stole sacred vessels from the temple, selling others that were priceless, only to be repeatedly censured by the people.",
      "links": "<a href='/AIV/27/1/2'>Dan 1:2</a>",
      "comment": "The desecration of the holy objects is an outrage, paralleling the destruction of the temple’s sanctity referenced throughout prophecy."
    },
    {
      "pk": 21004039,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 39,
      "text": "When Lysimachus, through Menelaus’s orders, committed similar sacrilege, the people became outraged and a crowd formed, furious at the injustice.",
      "links": "<a href='/AIV/21/4/38'>2Macc 4:38</a>",
      "comment": "Collective resistance to sacrilege shows communal responsibility in preserving holiness."
    },
    {
      "pk": 21004040,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 40,
      "text": "Lysimachus armed about three thousand men, some led by a certain Auranus, attacking the people with violence.",
      "links": "<a href='/AIV/21/4/39'>2Macc 4:39</a>",
      "comment": "Violent suppression of true worship prefigures persecutions of the faithful throughout history, a call to perseverance."
    },
    {
      "pk": 21004041,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 41,
      "text": "When the crowd realized Lysimachus’s violent intent, they armed themselves with stones and clubs found nearby, overcoming many attackers and even killing some, including Lysimachus by the treasury.",
      "links": "<a href='/AIV/21/4/40'>2Macc 4:40</a>",
      "comment": "The defense of the temple with improvised weapons recalls David’s victories by God’s strength, aligning literal and spiritual resistance (<a href='/AIV/9/17/49'>1Sam 17:49</a>)."
    },
    {
      "pk": 21004042,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 42,
      "text": "The cause of Lysimachus’s death was thoroughly investigated, and the people found it was justified.",
      "links": "<a href='/AIV/5/17/4'>Deut 17:4</a>",
      "comment": "Legitimate inquiry and justice in the face of sacrilege upholds the role of authority and discernment in the faith community."
    },
    {
      "pk": 21004043,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 43,
      "text": "Menelaus was tried over these matters, with debate held before the king.",
      "links": "<a href='/AIV/21/4/24'>2Macc 4:24</a>",
      "comment": "Trials over sacrilege place the gravity of spiritual offenses at the center of governance, revealing the need for righteous judgment."
    },
    {
      "pk": 21004044,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 44,
      "text": "Those in the royal court of Tyre, outraged by Menelaus’s actions, backed the Jewish accusers.",
      "links": "<a href='/AIV/21/4/34'>2Macc 4:34</a>",
      "comment": "Even Gentiles honor the sanctity of holy things, supporting the idea of universal spiritual truths."
    },
    {
      "pk": 21004045,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 45,
      "text": "But Menelaus bribed Ptolemy, son of Dorymenes, for support. As a result, the king was swayed not against Menelaus.",
      "links": "<a href='/AIV/21/4/24'>2Macc 4:24</a>",
      "comment": "Influence through bribery corrupts true justice, a continual warning about mixing spiritual authority with worldly politics."
    },
    {
      "pk": 21004046,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 46,
      "text": "The king acquitted Menelaus of all charges and sentenced the unfortunate accusers, whom the city’s elders had declared innocent, to death.",
      "links": "<a href='/AIV/19/94/20-21'>Ps. 94:20-21</a>",
      "comment": "False acquittal of evil and condemnation of the righteous is lamented in wisdom literature, underscoring the expectation of the final Judgment."
    },
    {
      "pk": 21004047,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 47,
      "text": "Thus, unjust men who argued their people’s cause were punished horribly, suffering publicly without pity, while Menelaus prevailed through bribery.",
      "links": "<a href='/AIV/19/58/2-3'>Ps. 58:2-3</a>",
      "comment": "Public suffering of the righteous has a redemptive dimension, foreshadowing the innocent sufferings in salvation history, e.g. Christ’s Passion."
    },
    {
      "pk": 21004048,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 48,
      "text": "Menelaus’s power persisted despite his crimes, as high officials failed to recognize the holiness of the Law.",
      "links": "<a href='/AIV/19/82/5'>Ps. 82:5</a>; <a href='/AIV/19/119/126'>Ps. 119:126</a>",
      "comment": "Willful ignorance of sacred law by authorities brings communal suffering, compelling renewed faithfulness to divine revelation."
    },
    {
      "pk": 21004049,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 49,
      "text": "Even at Tyre, the citizens were outraged at the injustice and provided a fitting burial for the accused men.",
      "links": "<a href='/AIV/40/27/57-60'>Matt 27:57-60</a>",
      "comment": "Honoring the dead expresses hope in the resurrection and respect for martyrs, mirrored in the gospel narrative of Jesus’s burial."
    },
    {
      "pk": 21004050,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 4,
      "verse": 50,
      "text": "But Menelaus escaped justice through bribery, continuing in his office, always plotting evil against his fellow citizens.",
      "links": "<a href='/AIV/19/36/1'>Ps. 36:1</a>",
      "comment": "Perseverance of evil for a time is permitted for the greater display of God’s future justice, encouraging humility and patient trust in divine providence."
    }
  ],
  "translatedAt": "2025-12-24T05:31:31.210Z"
}