{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 14,
  "verses": [
    {
      "pk": 21014001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 1,
      "text": "Three years later, news came to Judas and his companions that Demetrius, the son of Seleucus, had landed at the port of Tripolis with a powerful army and navy,",
      "links": "<a href='/AIV/21/10/11'>2Macc 10:11</a>; <a href='/AIV/27/11/20'>Dan. 11:20</a>",
      "comment": "The arrival of Demetrius marks a new phase in the political situation. The historical setting points to a period of instability in the Seleucid Empire. This verse sets up Demetrius as an important figure challenging the rule established by Antiochus."
    },
    {
      "pk": 21014002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 2,
      "text": "and had taken control of the region, killing Antiochus and his guardian Lysias.",
      "links": "<a href='/AIV/21/13/4'>2Macc 13:4</a>",
      "comment": "Demetrius quickly establishes his authority over the Seleucid Empire. Lysias previously acted as regent, as described earlier in this book."
    },
    {
      "pk": 21014003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 3,
      "text": "A certain Alcimus, who had been High Priest but had defiled himself in the time of the revolt, knowing that he was excluded from the priesthood,",
      "links": "<a href='/AIV/21/4/23'>2Macc 4:23</a>; <a href='/AIV/3/21/6-8'>Lev. 21:6-8</a>",
      "comment": "Alcimus was a former High Priest but was rejected due to defilement. This disqualification connects to the importance of ritual purity, which points to the seriousness of the priestly office."
    },
    {
      "pk": 21014004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 4,
      "text": "went to King Demetrius in the one hundred and fifty-first year and presented him with a gold crown, a palm branch, and some of the customary olive branches from the Temple.",
      "links": "<a href='/AIV/21/1/10'>2Macc 1:10</a>; <a href='/AIV/3/23/40'>Lev. 23:40</a>",
      "comment": "Alcimus tries to legitimize his approach by bringing offerings from the temple worship, indicating the ongoing link between political and religious authority."
    },
    {
      "pk": 21014005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 5,
      "text": "That day, he maintained his silence, but when the king called him to his council, he was questioned about the state and intentions of the Judeans.",
      "links": "",
      "comment": "Alcimus is presented as cunning and patient, awaiting an audience before revealing his motives."
    },
    {
      "pk": 21014006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 6,
      "text": "\"There is a group among the Judeans called Hasideans, led by Judas Maccabeus, who provoke unrest and cannot be left alone,\" Alcimus said.",
      "links": "<a href='/AIV/21/7/13-17'>2Macc 7:13-17</a>",
      "comment": "Alcimus slanders the faithful remnant, the Hasideans, showing the persecution faced by those loyal to God's law. This echoes the biblical pattern of opposition faced by the righteous."
    },
    {
      "pk": 21014007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 7,
      "text": "\"I was deprived of my ancestral honor, that is, the High Priesthood, so I came here, first for the sake of my people, but second for the king’s interest.\"",
      "links": "",
      "comment": "Alcimus appeals to the king’s self-interest while painting his actions in a patriotic light. There is irony in his professions, since his motives are selfish."
    },
    {
      "pk": 21014008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 8,
      "text": "\"Unrest has taken over all of Judea because of Judas and his followers, and I am here to ensure the stability of the region and the king's reputation.\"",
      "links": "",
      "comment": "Alcimus continues the accusation, portraying the faithful group as rebels rather than defenders of true worship."
    },
    {
      "pk": 21014009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 9,
      "text": "\"So, king, investigate these matters in detail. Care for our country and our harassed people with kindness, for all are looking to you for leadership.\"",
      "links": "<a href='/AIV/16/2/17'>Neh. 2:17</a>",
      "comment": "Subtly, Alcimus positions himself as the people's advocate. This verse shows the political exploitation of spiritual matters."
    },
    {
      "pk": 21014010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 10,
      "text": "The king was flattered, and he immediately appointed Alcimus as High Priest—one of his oldest friends—giving him orders to destroy the opposition and restore order.",
      "links": "",
      "comment": "The appointment of Alcimus by the king, not by divine calling, contrasts the authentic succession of leaders with those politically appointed."
    },
    {
      "pk": 21014011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 11,
      "text": "So the Gentile leaders, who had long suffered the troubles raised by Judas, rushed to Alcimus, supposing that his appointment meant an end to Jewish independence.",
      "links": "",
      "comment": "Gentile leaders seek suppression of Jewish religious autonomy. The high priest’s appointment by external political powers foreshadows later challenges to true worship and leadership."
    },
    {
      "pk": 21014012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 12,
      "text": "Alcimus and his supporters called for the military commander Bacchides, one of the king’s trusted men, who commanded the region west of the Euphrates.",
      "links": "<a href='/AIV/21/15/1-3'>2Macc 15:1-3</a>",
      "comment": "Here, political and military might are invoked to oppose the faithful community, setting up the coming conflict with Judas."
    },
    {
      "pk": 21014013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 13,
      "text": "He was sent with a large army, instructed to kill Judas, scatter his followers, and appoint Alcimus as the first authority over the region’s holy places.",
      "links": "",
      "comment": "Bacchides is tasked with eliminating the lawful opposition and imposing a high priest through violence, contrasting man’s authority with God’s."
    },
    {
      "pk": 21014014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 14,
      "text": "Gentile villagers, who had long hated and persecuted Judas, joined Bacchides, thinking the defeat of Judas meant an end to their troubles.",
      "links": "",
      "comment": "The local enemies of the faithful side with the oppressors—this opposition from inside and outside was a common experience for God’s people."
    },
    {
      "pk": 21014015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 15,
      "text": "Hearing that Bacchides and the army were coming, Judas and his allies prayed to God, with dust and ashes on their heads, asking Him to look with favor on His chosen people.",
      "links": "<a href='/AIV/09/7/6'>1Sam. 7:6</a>; <a href='/AIV/16/9/1'>Neh. 9:1</a>",
      "comment": "The gesture of dust and ashes shows deep humility and repentance. Calling on God’s favor reinforces the notion of an elect, covenant people."
    },
    {
      "pk": 21014016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 16,
      "text": "Encouraged by their prayers, they were ready to fight, so they went out from the city and confronted the royal army.",
      "links": "<a href='/AIV/06/23/10'>Josh. 23:10</a>",
      "comment": "Prayer and trust in God provide courage, a recurring biblical theme—courage comes not only from personal strength but from divine support."
    },
    {
      "pk": 21014017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 17,
      "text": "But as soon as Judas and his army came into view, Bacchides’ army was overwhelmed with fear and retreated, losing many soldiers.",
      "links": "",
      "comment": "The divine support for Judas’ army is shown as God causes fear to fall on their enemies—recalling other Old Testament victories won through God’s intervention."
    },
    {
      "pk": 21014018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 18,
      "text": "Bacchides saw that Judas had become powerful in the region, and he hesitated to move further,",
      "links": "",
      "comment": "Bacchides' hesitation illustrates an implicit recognition of a divine presence with the Maccabeans."
    },
    {
      "pk": 21014019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 19,
      "text": "so he sent messengers to Judas with peaceful proposals, swearing to do them no harm for the rest of their lives.",
      "links": "",
      "comment": "This turn to diplomacy after violence shows a pattern where God's intervention brings even enemies to seek peace."
    },
    {
      "pk": 21014020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 20,
      "text": "Judas accepted the terms and exchanged solemn oaths with Bacchides and his army. Afterward, the enemy returned to the king, and there was peace in the land for a while.",
      "links": "",
      "comment": "Oaths and covenants play a crucial role throughout the Bible. The temporary peace here is secured through solemn promise, hinting at the greater spiritual peace promised through Christ."
    },
    {
      "pk": 21014021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 21,
      "text": "But Alcimus found nothing in the covenant to further his ambitions.",
      "links": "",
      "comment": "Alcimus's dissatisfaction with the peace exposes his persistent ambition and the tension between human motivations and God's will."
    },
    {
      "pk": 21014022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 22,
      "text": "He went to Demetrius, accusing Judas of breaking the agreement,",
      "links": "",
      "comment": "Accusation and betrayal are consistent biblical motifs. Alcimus represents the treachery often faced by God's faithful."
    },
    {
      "pk": 21014023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 23,
      "text": "and Demetrius, angered by such reports, sent his general Nicanor, an experienced commander, to destroy the Jewish nation.",
      "links": "<a href='/AIV/21/8/9'>2Macc 8:9</a>",
      "comment": "A new antagonist arrives. The cycle of hostility resumes, highlighting the ongoing battle for the faithfulness and survival of Israel."
    },
    {
      "pk": 21014024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 24,
      "text": "Nicanor came to Jerusalem with a great army. He tried to take Judas by treachery but failed.",
      "links": "",
      "comment": "Nicanor's failed plot demonstrates the inability to overcome God's chosen through deceit. God’s providence protects His people."
    },
    {
      "pk": 21014025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 25,
      "text": "He met and exchanged friendly greetings with Judas and his followers, showing good faith in all he said.",
      "links": "",
      "comment": "The display of friendship may be deceptive; Scripture often warns to be wise as serpents (cf. Matt. 10:16)."
    },
    {
      "pk": 21014026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 26,
      "text": "But some of Judas’ opponents accused him to Nicanor, charging him with plotting against the king.",
      "links": "",
      "comment": "False accusations are a recurring biblical theme, echoing the trials of Daniel and, ultimately, Christ (cf. Matt. 26:59-60)."
    },
    {
      "pk": 21014027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 27,
      "text": "Angered by these charges, Nicanor, learning of Judas' whereabouts, decided to arrest him by force.",
      "links": "",
      "comment": "Once more, betrayal within the community leads to persecution. This reflects the wisdom of Christ's words: 'A man's enemies will be the members of his own household.' (Matt. 10:36)"
    },
    {
      "pk": 21014028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 28,
      "text": "Learning this, Judas and his followers prayed to God for help. They withdrew to a place called Hakdasa in the wilderness, where they fasted.",
      "links": "<a href='/AIV/44/13/3'>Acts 13:3</a>",
      "comment": "Praying and fasting remain powerful means of seeking God’s guidance and deliverance, as seen through both Old and New Testament practice."
    },
    {
      "pk": 21014029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 29,
      "text": "Nicanor, enraged by Judas’ escape, went to the Temple priests and made offerings in a show of piety,",
      "links": "",
      "comment": "Superficial religiosity is contrasted with true devotion. Nicanor honors ritual but not the God behind them, a subtle allusion to the necessity of inward holiness complementing external acts (cf. Isa. 29:13)."
    },
    {
      "pk": 21014030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 30,
      "text": "while inwardly plotting to seize Judas and betray him to the king.",
      "links": "",
      "comment": "Nicanor’s duplicity shows the biblical lesson that true intention matters more than outward practice (cf. Jer. 17:10)."
    },
    {
      "pk": 21014031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 31,
      "text": "But after Judas was not found, he accused the priests of harboring traitors and threatened to destroy the place of worship as soon as he returned safely with the king’s troops.",
      "links": "<a href='/AIV/40/26/61'>Matt. 26:61</a>",
      "comment": "Nicanor’s threatening speech recalls later threats against the Temple, foreshadowing the destruction of Jerusalem and the deeper reality of God's indwelling in His people (cf. John 2:19)."
    },
    {
      "pk": 21014032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 32,
      "text": "The priests lifted up their hands toward heaven and called on the ever-living Lord, saying,",
      "links": "",
      "comment": "The priestly role as intercessor is emphasized here, a theme developed further in Christ as the High Priest (cf. Heb. 4:14)."
    },
    {
      "pk": 21014033,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 33,
      "text": "\"You, O Lord of all, who have need of nothing, were pleased to grant us this holy place for our dwelling. So now, preserve it undefiled forever!\"",
      "links": "<a href='/AIV/11/8/27'>1Kgs 8:27</a>",
      "comment": "God's transcendence is declared, and yet He chooses to dwell among His people. The plea to keep the temple holy anticipates the Christian idea of the indwelling of the Spirit."
    },
    {
      "pk": 21014034,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 34,
      "text": "\"Do not let anyone desecrate this sanctuary, for You have sanctified it above all others.\"",
      "links": "<a href='/AIV/19/74/7'>Ps. 74:7</a>; <a href='/AIV/19/132/13-14'>Ps. 132:13-14</a>",
      "comment": "God's choice of a particular holy place connects Old Testament promises to New Testament fulfillment in Christ, the true Temple (cf. John 2:19)."
    },
    {
      "pk": 21014035,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 35,
      "text": "When Nicanor returned, he was met by Judas and his men. Fierce fighting followed, and some of Nicanor’s troops fell in battle.",
      "links": "",
      "comment": "Again, divine assistance enables victory for Judah’s faithful remnant against larger forces."
    },
    {
      "pk": 21014036,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 36,
      "text": "During the battle, a man named Razis, a leader of Jerusalem and a man of great reputation, was accused before Nicanor.",
      "links": "",
      "comment": "Razis’s reputation as 'a lover of his fellow citizens' foreshadows his willingness to suffer for righteousness’ sake, much like several Old Testament prophets."
    },
    {
      "pk": 21014037,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 37,
      "text": "He was called the father of the Jews for his goodwill toward them.",
      "links": "<a href='/AIV/01/45/8'>Gen. 45:8</a>",
      "comment": "The phrasing mirrors Joseph, who was also called a father to his people and points to righteous leaders interceding for the nation."
    },
    {
      "pk": 21014038,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 38,
      "text": "In earlier days, he had boldly risked his life for Judaism and had always been known for his zeal.",
      "links": "<a href='/AIV/04/25/7-13'>Num. 25:7-13</a>",
      "comment": "Razis exhibits the zeal for God’s law seen throughout the Old Testament. Righteous suffering as seen in his story foreshadows the sacrificial nature of true leadership."
    },
    {
      "pk": 21014039,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 39,
      "text": "Nicanor, wanting to display his contempt for the Jews, sent more than five hundred soldiers to arrest Razis.",
      "links": "",
      "comment": "The deployment of overwhelming force demonstrates both the courage of Razis and the seriousness of his threat to the enemy."
    },
    {
      "pk": 21014040,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 40,
      "text": "They besieged the tower and began to break down the gates. Seeing that he was about to be taken and preferring to die nobly rather than fall into the hands of evil men and suffer outrageous abuse,",
      "links": "",
      "comment": "Razis's choice echoes the virtue of martyrdom—a willingness to suffer or die for fidelity to God rather than yield to evil, a theme central to both Old and New Covenants."
    },
    {
      "pk": 21014041,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 41,
      "text": "he fell on his sword, choosing to die with honor rather than be mistreated by the wicked.",
      "links": "",
      "comment": "Acts of heroic self-sacrifice mark those who trust in God’s ultimate vindication; his act is considered noble by the sacred historian."
    },
    {
      "pk": 21014042,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 42,
      "text": "But, due to haste among the crowd, he only wounded himself heavily. So, rushing through the crowds, he found himself standing on a steep rock.",
      "links": "",
      "comment": "Details are drawn out to emphasize his intense courage and commitment to avoid capture, echoing other scenes of biblical heroism."
    },
    {
      "pk": 21014043,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 43,
      "text": "Still bleeding and nearly dead, he tore out his innards with both hands and hurled them into the crowd, calling upon the Lord who gives life and breath to restore them to him again.",
      "links": "<a href='/AIV/01/2/7'>Gen. 2:7</a>",
      "comment": "Razis expresses faith in God's power over life and death, a bold hint toward a belief in the resurrection (cf. Dan. 12:2), prefiguring later Christian hope."
    },
    {
      "pk": 21014044,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 44,
      "text": "With this, he died, leaving his courage and faith as an example to the entire nation.",
      "links": "<a href='/AIV/58/11/35-38'>Heb. 11:35-38</a>",
      "comment": "Razis’ death is celebrated as martyrdom. The resurrection hope becomes more explicit here, as dying fidelity is seen as leading to eternal reward."
    },
    {
      "pk": 21014045,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 45,
      "text": "He not only endured to the end but, in the noblest manner, left a model of courage and faith for all the people.",
      "links": "",
      "comment": "The author highlights perseverance in the faith as a model to be followed—echoed in Christian teaching on enduring to the end (cf. Matt. 10:22)."
    },
    {
      "pk": 21014046,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 14,
      "verse": 46,
      "text": "So, in this way, his death became a testimony for all the people to remember eternal life and God's faithfulness.",
      "links": "<a href='/AIV/21/7/9'>2Macc 7:9</a>; <a href='/AIV/40/10/28'>Matt. 10:28</a>",
      "comment": "This verse brings the theme of resurrection and hope for eternal life into focus. The emphasis on God's faithfulness and the martyr's witness points to the fuller revelation given in Christ, who overcomes death for His people."
    }
  ],
  "translatedAt": "2025-12-24T05:38:38.623Z"
}