{
  "book": 21,
  "bookName": "2 Maccabees",
  "bookAbbreviation": "2Macc",
  "chapter": 1,
  "verses": [
    {
      "pk": 21001001,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 1,
      "text": "To our Jewish brothers in Egypt, greetings from your brothers, the Jews in Jerusalem and in the land of Judea. May God give you peace.",
      "links": "<a href='/AIV/44/7/14-16'>Acts 7:14-16</a>",
      "comment": "This opening salutation is characteristic of ancient epistles, showing unity in faith and brotherhood among the dispersed Jews. The reference to peace connects with Old Testament greetings such as those in Nehemiah 1:2."
    },
    {
      "pk": 21001002,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 2,
      "text": "May God bless you and remember his covenant with Abraham, Isaac, and Jacob, his faithful servants.",
      "links": "<a href='/AIV/01/17/7-8'>Gen 17:7-8</a>; <a href='/AIV/02/02/24'>Ex 2:24</a>",
      "comment": "The emphasis on the covenant recalls the enduring relationship between God and his people established through the patriarchs, a theme that points towards God's ongoing involvement in salvation history."
    },
    {
      "pk": 21001003,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 3,
      "text": "May he give you all a heart to worship him and to do his will with a generous spirit and a willing mind.",
      "links": "<a href='/AIV/19/51/10'>Ps. 51:10</a>; <a href='/AIV/05/06/5'>Deut 6:5</a>",
      "comment": "The transformation of the heart is repeated throughout Scripture as the key to faithfulness to God; cf. Ezekiel 36:26, Psalm 51. This union of heart and will with God's commands is a central theme in the spiritual life."
    },
    {
      "pk": 21001004,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 4,
      "text": "May he open your hearts to his Law and his commandments and bring you peace.",
      "links": "<a href='/AIV/19/119/18'>Ps. 119:18</a>",
      "comment": "The request for an open heart toward God's Law foreshadows the emphasis in later revelation on the Law being written on the heart (Jer. 31:33, Heb. 8:10), highlighting both obedience and interior transformation."
    },
    {
      "pk": 21001005,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 5,
      "text": "May he hear your prayers and be reconciled to you, and never abandon you in times of trouble.",
      "links": "<a href='/AIV/05/31/6'>Deut 31:6</a>; <a href='/AIV/58/13/5'>Heb 13:5</a>",
      "comment": "The theme of reconciliation with God is foundational for the spiritual life. The assurance that God does not abandon his people, seen consistently throughout the Scriptures, points to his faithfulness and steadfast love."
    },
    {
      "pk": 21001006,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 6,
      "text": "Now we are praying for you here.",
      "links": "<a href='/AIV/01/20/7'>Gen 20:7</a>",
      "comment": "Prayer for others reflects the idea of intercessory prayer, which is found throughout Scripture and forms an important practice of the faith. See also 1 Tim 2:1 for New Testament parallels."
    },
    {
      "pk": 21001007,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 7,
      "text": "During the rule of Demetrius, in the year one hundred sixty-nine, we Jews wrote to you in the midst of oppression. We wrote to you at the time when Jason and his followers had revolted against the holy land and the holy people.",
      "links": "<a href='/AIV/27/11/20'>Dan 11:20</a>",
      "comment": "The historical setting is provided here. Jason's revolt led to a major crisis for faithful Jews. The reference to the holy land and people underscores God's special relationship with his chosen nation."
    },
    {
      "pk": 21001008,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 8,
      "text": "The fire was set to the sanctuary, and the altar was profaned. As a result, we found it necessary to pray to the Lord and were answered.",
      "links": "<a href='/AIV/27/11/31'>Dan 11:31</a>; <a href='/AIV/40/24/15'>Matt 24:15</a>",
      "comment": "Destruction of the sanctuary is a foreshadow of the necessity of both corporal and spiritual renewal and restoration. The pollution of the altar is linked with the 'abomination of desolation' prophecy."
    },
    {
      "pk": 21001009,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 9,
      "text": "We offered sacrifices and fine flour, lit the lamps, and set out the loaves of bread.",
      "links": "<a href='/AIV/03/24/5-7'>Lev 24:5-7</a>",
      "comment": "Resumption of worship and sacrifice signifies spiritual restoration. The use of bread in the sanctuary has typological connections with the Bread of Life discourse in the New Testament (John 6)."
    },
    {
      "pk": 21001010,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 10,
      "text": "We now urge you to celebrate the festival of Booths in the month of Chislev.",
      "links": "<a href='/AIV/03/23/34-43'>Lev 23:34-43</a>; <a href='/AIV/43/07/2-14'>John 7:2-14</a>",
      "comment": "Celebrating the festival of Booths (or Sukkot) during Chislev is unusual, yet mirrors the dedication of the altar after its profanation. This re-dedication is linked historically to the Feast of Dedication (Hanukkah in John 10:22)."
    },
    {
      "pk": 21001011,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 11,
      "text": "Written in the year one hundred eighty-eight of the Greek kingdom.",
      "links": "<a href='/AIV/27/08/21'>Dan 8:21</a>",
      "comment": "The dating uses the Seleucid era, pointing to the Hellenistic context. Chronicling such dates provides historical reliability."
    },
    {
      "pk": 21001012,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 12,
      "text": "Those in Jerusalem and in Judea, the council of elders, and Judas, send greetings to Aristobulus, the teacher of King Ptolemy, and to the Jews in Egypt.",
      "links": "<a href='/AIV/44/18/24'>Acts 18:24</a>",
      "comment": "This shows the unity beyond borders among the Jewish diaspora and solidarity in faith, which is significant for understanding the wider reach of God's people."
    },
    {
      "pk": 21001013,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 13,
      "text": "We wish you health and prosperity!",
      "links": "<a href='/AIV/45/01/7'>Rom 1:7</a>",
      "comment": "A standard greeting, emphasizing the wholeness and well-being that comes from being united to God's people."
    },
    {
      "pk": 21001014,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 14,
      "text": "We thank God for having thrown down our enemies.",
      "links": "<a href='/AIV/02/15/1-21'>Ex 15:1-21</a>; <a href='/AIV/02/23/27'>Ex 23:27</a>",
      "comment": "Giving thanks for deliverance is common throughout the Old Testament, echoing the psalms where salvation from danger is attributed always to God's power."
    },
    {
      "pk": 21001015,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 15,
      "text": "It was he who led our people out of Egypt and caused great wonders.",
      "links": "<a href='/AIV/02/12/42'>Ex 12:42</a>; <a href='/AIV/05/07/19'>Deut 7:19</a>",
      "comment": "Connecting God's deliverance in the Exodus with the current experience reminds the faithful of God's unchanging power and faithfulness."
    },
    {
      "pk": 21001016,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 16,
      "text": "He led our ancestors through the sea when Pharaoh and his army pursued them, drowning them in the Red Sea.",
      "links": "<a href='/AIV/02/14/27-31'>Ex 14:27-31</a>",
      "comment": "A clear reminder of the mighty act of redemption in the Exodus, foreshadowing greater acts of salvation for the whole world."
    },
    {
      "pk": 21001017,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 17,
      "text": "He brought our people into his holy land and into a land flowing with milk and honey.",
      "links": "<a href='/AIV/02/03/8'>Ex 3:8</a>",
      "comment": "Entering the promised land not only fulfills God's promises but symbolizes the inheritance of eternal blessing."
    },
    {
      "pk": 21001018,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 18,
      "text": "After being delivered from great dangers, we purified the House and celebrated the dedication with sacrifices and thanksgivings.",
      "links": "<a href='/AIV/16/12/27'>Neh 12:27</a>; <a href='/AIV/03/07/12'>Lev 7:12</a>",
      "comment": "The process of purification and re-dedication of the Temple foreshadows the continual need for communal renewal and gratitude for redemption."
    },
    {
      "pk": 21001019,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 19,
      "text": "We celebrated this, and our ancestors and all the people decided to observe the dedication each year.",
      "links": "<a href='/AIV/43/10/22'>John 10:22</a>",
      "comment": "The annual celebration points to the institution of Hanukkah. Jesus himself attended this festival in John 10:22, linking Old Testament tradition with the New Testament context."
    },
    {
      "pk": 21001020,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 20,
      "text": "At the time of Nehemiah, our ancestors carried the sacred fire from the altar secretly into a hollow place, a dry well, where they kept it hidden.",
      "links": "<a href='/AIV/16/02/1'>Neh 2:1</a>",
      "comment": "The secret preservation of the altar fire shows reverence for God's commandments and the importance placed on continuity in the worship of God, mirroring later preservations of faith in times of persecution."
    },
    {
      "pk": 21001021,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 21,
      "text": "They kept it so well concealed that when many years had passed, both our people and the Persian king forgot about it.",
      "links": "<a href='/AIV/16/01/1-11'>Neh 1:1-11</a>",
      "comment": "This highlights the perseverance and safeguarding of the sacred, even when hope and memory have faded among the people."
    },
    {
      "pk": 21001022,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 22,
      "text": "After Nehemiah returned from Persia, he asked the descendants of the priests who had hidden the fire to retrieve it, but they reported that they found only thick liquid, like water.",
      "links": "<a href='/AIV/16/02/3-7'>Neh 2:3-7</a>",
      "comment": "A miraculous transformation, suggesting that God's providence can work through ordinary means, a theme mirrored in the miracles of the New Testament (cf. John 2:1-11)."
    },
    {
      "pk": 21001023,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 23,
      "text": "He told them to draw some out and bring it to him. When the sacrifices for purification were offered, Nehemiah ordered the priests to sprinkle the wood and what was laid upon it with the liquid.",
      "links": "<a href='/AIV/03/09/17'>Lev 9:17</a>",
      "comment": "The act of sprinkling connects liturgical acts with obedience to God's instructions, a principle found throughout the Law."
    },
    {
      "pk": 21001024,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 24,
      "text": "After they had done this, and the time came for the sun, which had been hidden by clouds, to shine, a great fire blazed out so that everyone was amazed.",
      "links": "<a href='/AIV/03/09/24'>Lev 9:24</a>; <a href='/AIV/11/18/38'>1 Kings 18:38</a>",
      "comment": "Miraculous fire from heaven signifies God's acceptance of the offering. This is paralleled in Elijah's ministry and in the original dedication ceremonies of the tabernacle and temple."
    },
    {
      "pk": 21001025,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 25,
      "text": "Everyone fell on their faces and worshipped the Lord, praising him who does great wonders.",
      "links": "<a href='/AIV/41/05/42'>Mark 5:42</a>; <a href='/AIV/19/136/4'>Ps 136:4</a>",
      "comment": "The response of awe and worship at divine intervention is a constant theme in both Old and New Testaments."
    },
    {
      "pk": 21001026,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 26,
      "text": "Then the priests began to sing hymns.",
      "links": "<a href='/AIV/19/135/1'>Ps 135:1</a>",
      "comment": "Liturgical singing is fundamental to the worship of God, seen from the Psalms to early Christian liturgies (Eph 5:19)."
    },
    {
      "pk": 21001027,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 27,
      "text": "Nehemiah ordered that the remainder of the liquid be poured over large stones.",
      "links": "",
      "comment": "Continuing the ceremonial acts connects the physical with the sacred, highlighting how ordinary material things can become instruments of God’s power and grace."
    },
    {
      "pk": 21001028,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 28,
      "text": "As soon as this was done, a flame flared up, which was consumed by the light from the altar.",
      "links": "",
      "comment": "God’s action through fire is a recurring sign of his presence and approval (cf. Exodus 3:2; Acts 2:3)."
    },
    {
      "pk": 21001029,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 29,
      "text": "A report of this event spread everywhere.",
      "links": "<a href='/AIV/02/34/29'>Ex 34:29</a>",
      "comment": "Miracles as signs of God's favor are often witnessed and recounted, strengthening faith in the wider community."
    },
    {
      "pk": 21001030,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 30,
      "text": "When the matter was reported to the king of the Persians, he had the place investigated and made it holy.",
      "links": "<a href='/AIV/15/06/3-5'>Ezra 6:3-5</a>",
      "comment": "A foreign king recognizing the holiness there underscores the universality of God's reign and the extension of his works beyond Israel alone (Is 45:1)."
    },
    {
      "pk": 21001031,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 31,
      "text": "The king verified the event and built a shrine for it.",
      "links": "<a href='/AIV/15/01/2'>Ezra 1:2</a>",
      "comment": "Secular acknowledgment of sacred events reveals how God can move the hearts of even those outside the faith to respect his works."
    },
    {
      "pk": 21001032,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 32,
      "text": "Those with Nehemiah called the liquid 'nephthar,' which means purification, but most people called it 'naphta.'",
      "links": "",
      "comment": "The specific naming of the liquid ties into liturgical traditions. Purification ceremonies point toward the deeper spiritual cleansing the Messiah will later bring (Heb 9:13-14)."
    },
    {
      "pk": 21001033,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 33,
      "text": "It is also called 'nephthar,' which means 'purification.'",
      "links": "",
      "comment": "The repeated emphasis on purification prefigures the central theme of cleansing from sin, later fulfilled in Christ's ultimate sacrifice."
    },
    {
      "pk": 21001034,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 34,
      "text": "Nehemiah and his companions called it 'nephthar,' which is translated as 'purification.'",
      "links": "",
      "comment": "This final naming further underscores the importance of ongoing purification for God's people and hints at a continuous tradition of visible and material acts linked to spiritual realities."
    },
    {
      "pk": 21001035,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 35,
      "text": "Many years later, under a different king, the priests who succeeded Nehemiah were instructed to take some of the purification liquid to give to their descendants.",
      "links": "",
      "comment": "The passing down of sacred elements through priestly succession signals the importance of continuity and tradition in spiritual leadership—a principle vital to the faithful passing down of true doctrine (see 2 Tim 2:2)."
    },
    {
      "pk": 21001036,
      "translation": "AIV",
      "book": 21,
      "bookName": "2 Maccabees",
      "bookAbbreviation": "2Macc",
      "chapter": 1,
      "verse": 36,
      "text": "When those who received it, remembered and recorded what had happened, they called it 'purification.'",
      "links": "",
      "comment": "Recording and remembering God’s wonders through tradition ensures that faith is preserved and accessible for future generations, echoing Deut 6:6-9 and the continual unfolding of God's plan through his ordained ministers."
    }
  ],
  "translatedAt": "2025-12-24T05:29:20.883Z"
}