{
  "book": 51,
  "bookName": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 18,
  "verses": [
    {
      "pk": 51018001,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 1,
      "text": "After this, Paul left Athens and went to Corinth.",
      "links": "<a href='/AIV/51/17/15'>Acts 17:15</a>",
      "comment": "Paul transitions from the intellectual atmosphere of Athens to Corinth, a pivotal city for the early Christian mission."
    },
    {
      "pk": 51018002,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 2,
      "text": "There he found a Jew named Aquila, a native of Pontus, who had recently come from Italy with his wife Priscilla, because Claudius had ordered all Jews to leave Rome. Paul went to see them,",
      "links": "<a href='/AIV/51/2/9'>Acts 2:9</a>; <a href='/AIV/45/16/3'>Rom. 16:3</a>",
      "comment": "Aquila and Priscilla are introduced as prominent early Christian partners. Expulsions of Jews from Rome are corroborated by extra-biblical history."
    },
    {
      "pk": 51018003,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 3,
      "text": "and because he was of the same trade, he stayed with them and worked—they were tentmakers by trade.",
      "links": "<a href='/AIV/52/20/34'>Acts 20:34</a>; <a href='/AIV/46/4/12'>1 Cor. 4:12</a>",
      "comment": "Paul, Aquila, and Priscilla share manual labor, displaying humility and the dignity of work, foundational for Christian life."
    },
    {
      "pk": 51018004,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 4,
      "text": "He reasoned in the synagogue every Sabbath, persuading both Jews and Greeks.",
      "links": "<a href='/AIV/51/17/17'>Acts 17:17</a>; <a href='/AIV/42/4/16'>Luke 4:16</a>",
      "comment": "Paul regularly engages in synagogue teaching, exhibiting a pattern of evangelism and the initial outreach to Jews and God-fearing Gentiles."
    },
    {
      "pk": 51018005,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 5,
      "text": "When Silas and Timothy arrived from Macedonia, Paul devoted himself entirely to preaching, testifying to the Jews that Jesus is the Christ.",
      "links": "<a href='/AIV/51/17/14-15'>Acts 17:14-15</a>; <a href='/AIV/54/3/14'>2 Tim. 3:14</a>",
      "comment": "With co-workers present, Paul can focus fully on proclaiming Jesus as the promised Messiah. This underlines the necessity of ministerial partnership."
    },
    {
      "pk": 51018006,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 6,
      "text": "But when they opposed him and insulted him, he shook out his clothes and said to them, 'Your blood is on your own heads! I am innocent. From now on I will go to the Gentiles.'",
      "links": "<a href='/AIV/26/3/18-19'>Ezek. 3:18-19</a>; <a href='/AIV/51/13/46'>Acts 13:46</a>",
      "comment": "Paul's action echoes Ezekiel's 'watchman' imagery, emphasizing accountability in hearing the gospel. His focus shifts, foreshadowing the inclusion of Gentiles in the Church."
    },
    {
      "pk": 51018007,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 7,
      "text": "Then he left there and went to the house of a man named Titius Justus, a worshiper of God, whose house was next door to the synagogue.",
      "links": "<a href='/AIV/51/16/14'>Acts 16:14</a>; <a href='/AIV/51/17/4'>Acts 17:4</a>",
      "comment": "The proximity to the synagogue means Paul's mission to the Jews continues indirectly, reflecting a natural growth from Old Covenant worship to the new assembly of believers."
    },
    {
      "pk": 51018008,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 8,
      "text": "Crispus, the synagogue leader, believed in the Lord, along with his entire household. Many of the Corinthians who heard Paul believed and were baptized.",
      "links": "<a href='/AIV/46/1/14'>1 Cor. 1:14</a>; <a href='/AIV/44/16/31-33'>Acts 16:31-33</a>",
      "comment": "Whole households are baptized, consistent with the early Church's sacramental practice—an early testimony to family inclusion in the faith, likely including children."
    },
    {
      "pk": 51018009,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 9,
      "text": "The Lord said to Paul in a vision at night, 'Do not be afraid, but speak, and do not be silent,",
      "links": "<a href='/AIV/43/16/33'>John 16:33</a>; <a href='/AIV/24/1/8'>Jer. 1:8</a>",
      "comment": "Divine communication encourages Paul, paralleling God’s assurance to Old Testament prophets, signifying Paul's apostolic authority."
    },
    {
      "pk": 51018010,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 10,
      "text": "for I am with you, and no one will attack you to harm you, for I have many people in this city.'",
      "links": "<a href='/AIV/06/1/5'>Josh. 1:5</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "God’s protective presence recalls promises made to Joshua and the disciples, emphasizing the continuity of Divine protection for His leaders."
    },
    {
      "pk": 51018011,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 11,
      "text": "So he stayed there a year and six months, teaching the word of God among them.",
      "links": "<a href='/AIV/51/20/31'>Acts 20:31</a>",
      "comment": "An extended period of teaching shows the need for strong doctrinal and moral foundation in each local church, which flourishes under sustained apostolic ministry."
    },
    {
      "pk": 51018012,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 12,
      "text": "But while Gallio was proconsul of Achaia, the Jews made a united attack against Paul and brought him before the tribunal,",
      "links": "<a href='/AIV/51/13/50'>Acts 13:50</a>",
      "comment": "The tribunal scene is a historical marker, as Gallio is attested in non-Christian sources, providing a fixed date for Paul’s ministry."
    },
    {
      "pk": 51018013,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 13,
      "text": "saying, 'This man is persuading people to worship God contrary to the law.'",
      "links": "<a href='/AIV/51/16/21'>Acts 16:21</a>",
      "comment": "The accusation centers on religious law, underscoring early conflicts due to the revolutionary nature of Christianity’s claims."
    },
    {
      "pk": 51018014,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 14,
      "text": "But when Paul was about to open his mouth, Gallio said to the Jews, 'If it were a matter of wrongdoing or serious crime, I would have reason to accept your complaint, O Jews;",
      "links": "<a href='/AIV/51/23/29'>Acts 23:29</a>",
      "comment": "Gallio, a secular authority, discerns a religious argument rather than a civil crime—highlighting the mystery of authority and justice, and the early Christian experience within Roman society."
    },
    {
      "pk": 51018015,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 15,
      "text": "but since it is a question about words and names and your own law, see to it yourselves. I refuse to judge such matters.'",
      "links": "<a href='/AIV/42/23/4'>Luke 23:4</a>",
      "comment": "The state's detachment here allows faith to grow in freedom. Gallio’s refusal to intervene sets a precedent for religious liberty, rooted in freedom of conscience."
    },
    {
      "pk": 51018016,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 16,
      "text": "And he drove them out from the tribunal.",
      "links": "<a href='/AIV/51/19/38-40'>Acts 19:38-40</a>",
      "comment": "Paul’s mission continues unhindered, evidence of God’s providential care for the spread of the gospel within changing political climates."
    },
    {
      "pk": 51018017,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 17,
      "text": "Then all of them seized Sosthenes, the synagogue leader, and beat him in front of the tribunal. But none of this was a concern to Gallio.",
      "links": "<a href='/AIV/46/1/1'>1 Cor. 1:1</a>",
      "comment": "Sosthenes may later be a Christian leader (see 1 Cor. 1:1). Suffering for the faith is a recurring biblical theme, and those once opposed can become great servants of the Lord."
    },
    {
      "pk": 51018018,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 18,
      "text": "Paul stayed on for many days. Then he took leave of the brothers and set sail for Syria, taking Priscilla and Aquila with him. At Cenchreae he had his hair cut, for he was under a vow.",
      "links": "<a href='/AIV/04/6/18'>Num. 6:18</a>; <a href='/AIV/51/21/23-24'>Acts 21:23-24</a>",
      "comment": "Paul’s vow is reminiscent of Nazirite practices, showing continuity between old and new covenant observances and communal spiritual discipline."
    },
    {
      "pk": 51018019,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 19,
      "text": "They came to Ephesus, and he left them there. But he himself entered the synagogue and reasoned with the Jews.",
      "links": "<a href='/AIV/51/19/1'>Acts 19:1</a>",
      "comment": "Ephesus becomes a strong church through Paul's teaching, as seen in later epistles. Priscilla and Aquila continue the apostolic work, highlighting the importance of lay collaboration."
    },
    {
      "pk": 51018020,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 20,
      "text": "When they asked him to stay longer, he would not consent.",
      "links": "<a href='/AIV/51/19/8'>Acts 19:8</a>",
      "comment": "Paul's travels are guided both by human invitation and divine direction, revealing the Church’s mission is not according to man's timetable but God's plan."
    },
    {
      "pk": 51018021,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 21,
      "text": "But as he took leave of them, he said, 'I will return to you, if God wills.' Then he set sail from Ephesus.",
      "links": "<a href='/AIV/59/4/15'>Jas. 4:15</a>",
      "comment": "Paul recognizes all events depend on God’s will, showing humility and trust—a model for Christian discernment."
    },
    {
      "pk": 51018022,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 22,
      "text": "When he landed at Caesarea, he went up and greeted the church, and then went down to Antioch.",
      "links": "<a href='/AIV/51/11/22'>Acts 11:22</a>",
      "comment": "Paul's visit to the church shows the principle of unity and apostolic succession—leaders return to the wider assembly for mutual support and accountability."
    },
    {
      "pk": 51018023,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 23,
      "text": "After spending some time there, he departed and traveled from place to place through the region of Galatia and Phrygia, strengthening all the disciples.",
      "links": "<a href='/AIV/48/1/2'>Gal. 1:2</a>; <a href='/AIV/51/16/6'>Acts 16:6</a>",
      "comment": "Paul’s strengthening of the churches models the necessity of ongoing pastoral care, apostolic oversight, and formation of faith."
    },
    {
      "pk": 51018024,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 24,
      "text": "Now a Jew named Apollos, a native of Alexandria, an eloquent man and well-versed in the Scriptures, came to Ephesus.",
      "links": "<a href='/AIV/46/1/12'>1 Cor. 1:12</a>",
      "comment": "Apollos's scriptural knowledge and eloquence show the importance of learning and rhetoric in spreading Christian truth."
    },
    {
      "pk": 51018025,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 25,
      "text": "He had been instructed in the way of the Lord, and being fervent in spirit, he spoke and taught accurately about Jesus, though he knew only the baptism of John.",
      "links": "<a href='/AIV/51/19/3'>Acts 19:3</a>; <a href='/AIV/42/3/16'>Luke 3:16</a>",
      "comment": "Apollos understands Jesus, but his knowledge is incomplete, only knowing John's baptism—pointing toward the fuller sacramental initiation established by Christ."
    },
    {
      "pk": 51018026,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 26,
      "text": "He began to speak boldly in the synagogue. But when Priscilla and Aquila heard him, they took him aside and explained to him the way of God more accurately.",
      "links": "<a href='/AIV/51/18/2'>Acts 18:2</a>",
      "comment": "Priscilla and Aquila’s careful, private catechesis of Apollos is an example of apostolic teaching authority being exercised informally, helping preserve unity and ensure doctrine."
    },
    {
      "pk": 51018027,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 27,
      "text": "When he wanted to go across to Achaia, the brothers encouraged him and wrote to the disciples there to welcome him. When he arrived, he greatly helped those who had believed through grace,",
      "links": "<a href='/AIV/46/3/6'>1 Cor. 3:6</a>",
      "comment": "Letters of recommendation for Apollos are an early form of credentials and communion—evidence of the Spirit-led order and visible unity among the first disciples."
    },
    {
      "pk": 51018028,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 18,
      "verse": 28,
      "text": "for he vigorously refuted the Jews in public, showing by the Scriptures that Jesus is the Christ.",
      "links": "<a href='/AIV/42/24/27'>Luke 24:27</a>; <a href='/AIV/43/5/39'>John 5:39</a>",
      "comment": "Apollos proclaims Jesus as the fulfillment of the Scriptures—a high Christology and the heart of apostolic preaching, drawing on both literal and spiritual meaning for the early Church."
    }
  ],
  "translatedAt": "2025-12-24T11:28:55.320Z"
}