{
  "book": 51,
  "bookName": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 12,
  "verses": [
    {
      "pk": 51012001,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 1,
      "text": "About that time, King Herod stretched out his hand to harm certain people belonging to the church.",
      "links": "<a href='/AIV/40/2/1'>Matt. 2:1</a>; <a href='/AIV/44/4/3'>Acts 4:3</a>",
      "comment": "Herod’s persecution reflects the opposition the early believers faced. The mention of 'church' points to the visible, organized community of believers, emphasizing their unity."
    },
    {
      "pk": 51012002,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 2,
      "text": "He killed James the brother of John with the sword.",
      "links": "<a href='/AIV/40/20/23'>Matt. 20:23</a>; <a href='/AIV/41/10/39'>Mark 10:39</a>",
      "comment": "James’s martyrdom fulfills Christ’s prophecy of suffering for the apostles (Matt. 20:23), highlighting the cost of discipleship and the special calling of the apostles."
    },
    {
      "pk": 51012003,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 3,
      "text": "And when Herod saw that it pleased the Jews, he proceeded to arrest Peter also. This was during the days of Unleavened Bread.",
      "links": "<a href='/AIV/42/22/1'>Luke 22:1</a>; <a href='/AIV/44/5/18'>Acts 5:18</a>",
      "comment": "The timing places these events during Passover, recalling Jesus’ Passion. Peter’s importance in leadership is again emphasized as Herod targets the head of the apostles."
    },
    {
      "pk": 51012004,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 4,
      "text": "After seizing him, he put him in prison, delivering him to four squads of soldiers to guard him, intending after the Passover to bring him out to the people.",
      "links": "<a href='/AIV/44/4/3'>Acts 4:3</a>; <a href='/AIV/44/5/18'>Acts 5:18</a>",
      "comment": "The heavy guard shows Peter’s significance and Herod’s fear, hinting at Peter’s special position among the apostles and the threat he posed to opposing powers."
    },
    {
      "pk": 51012005,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 5,
      "text": "So Peter was kept in prison, but earnest prayer for him was being made to God by the church.",
      "links": "<a href='/AIV/44/1/14'>Acts 1:14</a>; <a href='/AIV/40/18/19-20'>Matt. 18:19-20</a>",
      "comment": "Note how the whole church gathers to pray continuously for Peter. This corporate prayer reveals the early expectation for divine intervention and shows the power of communal petition."
    },
    {
      "pk": 51012006,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 6,
      "text": "Now when Herod was about to bring him out, on that night, Peter was sleeping between two soldiers, bound with two chains, and sentries before the door were guarding the prison.",
      "links": "<a href='/AIV/44/16/23-24'>Acts 16:23-24</a>",
      "comment": "Peter’s calm despite imminent execution mirrors Christ’s peace before His own Passion. The detail underscores Peter’s trust in God’s will."
    },
    {
      "pk": 51012007,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 7,
      "text": "Suddenly, an angel of the Lord stood next to him, and a light shone in the cell. He struck Peter’s side and woke him, saying, 'Get up quickly!' And the chains fell off his hands.",
      "links": "<a href='/AIV/44/5/19'>Acts 5:19</a>; <a href='/AIV/42/2/9'>Luke 2:9</a>",
      "comment": "The angelic deliverance recalls other divine interventions (Acts 5:19) and signals God’s protection of apostolic authority, reminiscent of the liberation themes from the Exodus."
    },
    {
      "pk": 51012008,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 8,
      "text": "Then the angel said to him, 'Dress yourself and put on your sandals.' And Peter did so. And he said to him, 'Wrap your cloak around you and follow me.'",
      "links": "<a href='/AIV/43/21/19'>John 21:19</a>",
      "comment": "These instructions recall Jesus’ words to Peter in John 21:19—'Follow me.' Peter’s obedience demonstrates his submission to God’s plan and authority."
    },
    {
      "pk": 51012009,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 9,
      "text": "And going out, he followed him; he did not know that what was being done by the angel was real, but thought he was seeing a vision.",
      "links": "<a href='/AIV/44/10/10'>Acts 10:10</a>",
      "comment": "Peter’s uncertainty between vision and reality echoes earlier experiences (Acts 10:10), underlining the supernatural nature of apostolic experiences and leadership."
    },
    {
      "pk": 51012010,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 10,
      "text": "After they had passed the first and second guard, they came to the iron gate leading into the city. It opened for them of its own accord. And they went out and went along one street, and immediately the angel left him.",
      "links": "<a href='/AIV/44/5/19'>Acts 5:19</a>",
      "comment": "Miraculous escape displays God’s direct intervention for Peter, affirming the authority placed on him, and foreshadowing similar acts bestowed through apostolic ministry."
    },
    {
      "pk": 51012011,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 11,
      "text": "When Peter came to himself, he said, 'Now I am sure that the Lord has sent his angel and rescued me from Herod’s hand and from all that the Jewish people were expecting.'",
      "links": "<a href='/AIV/19/34/7'>Psalm 34:7</a>; <a href='/AIV/44/5/19'>Acts 5:19</a>",
      "comment": "Peter’s recognition of divine liberation connects to Old Testament deliverances (e.g., Psalm 34:7), showing continuity in God’s saving acts through chosen leaders."
    },
    {
      "pk": 51012012,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 12,
      "text": "And when he realized this, he went to the house of Mary, the mother of John called Mark, where many were gathered together and praying.",
      "links": "<a href='/AIV/44/1/14'>Acts 1:14</a>; <a href='/AIV/44/15/37'>Acts 15:37</a>",
      "comment": "Gathering at Mary’s house displays the early church’s unity and devotion, and foreshadows John Mark’s role in spreading the Gospel tradition."
    },
    {
      "pk": 51012013,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 13,
      "text": "And when he knocked at the door of the gateway, a servant girl named Rhoda came to answer.",
      "links": "<a href='/AIV/44/16/14'>Acts 16:14</a>",
      "comment": "Rhoda's role emphasizes the participation of all members within the community, affirming the dignity and value of service in the life of the church."
    },
    {
      "pk": 51012014,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 14,
      "text": "When she recognized Peter’s voice, out of joy she did not open the gate, but ran in and reported that Peter was standing at the gate.",
      "links": "<a href='/AIV/44/5/14'>Acts 5:14</a>",
      "comment": "Rhoda’s joy and excitement highlight the church’s expectation and surprise at God’s miraculous acts among their leaders."
    },
    {
      "pk": 51012015,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 15,
      "text": "They said to her, 'You are out of your mind.' But she kept insisting that it was so, and they kept saying, 'It is his angel.'",
      "links": "<a href='/AIV/44/23/8'>Acts 23:8</a>",
      "comment": "The reference to 'his angel' shows early Christian belief in angelic guardianship, hinting at spiritual realities that support the visible ministry of the church."
    },
    {
      "pk": 51012016,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 16,
      "text": "But Peter continued knocking, and when they opened, they saw him and were amazed.",
      "links": "<a href='/AIV/42/24/41'>Luke 24:41</a>",
      "comment": "Their amazement parallels apostolic witnesses’ disbelief at Christ’s resurrection, showing how God often exceeds human expectation in establishing leadership."
    },
    {
      "pk": 51012017,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 17,
      "text": "But motioning to them with his hand to be silent, he described to them how the Lord had brought him out of the prison. And he said, 'Tell these things to James and to the brothers.' Then he departed and went to another place.",
      "links": "<a href='/AIV/59/1/1'>James 1:1</a>; <a href='/AIV/44/15/13'>Acts 15:13</a>",
      "comment": "Peter’s directive to inform James (the Lord’s brother) indicates emerging apostolic leadership and stresses the importance of communication among ordained leaders."
    },
    {
      "pk": 51012018,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 18,
      "text": "Now when day came, there was no small disturbance among the soldiers over what had become of Peter.",
      "links": "<a href='/AIV/40/28/4'>Matt. 28:4</a>",
      "comment": "The confusion among the soldiers resembles the guards’ reaction at Jesus’ empty tomb, drawing attention to the supernatural nature of apostolic signs and ministries."
    },
    {
      "pk": 51012019,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 19,
      "text": "Herod, after searching for him and not finding him, examined the guards and ordered them to be executed. Then he went down from Judea to Caesarea and stayed there.",
      "links": "<a href='/AIV/44/23/33'>Acts 23:33</a>",
      "comment": "Herod’s severe response shows the impotence of worldly authority against God’s protection of His church and its leaders."
    },
    {
      "pk": 51012020,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 20,
      "text": "Now Herod was angry with the people of Tyre and Sidon. And they came to him with one accord, and having persuaded Blastus, the king’s chamberlain, they asked for peace, because their country depended on the king’s country for food.",
      "links": "<a href='/AIV/11/5/1'>1 Kings 5:1</a>",
      "comment": "This interaction highlights political dependence and negotiation, setting the stage for God’s sovereign judgment of prideful rulers."
    },
    {
      "pk": 51012021,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 21,
      "text": "On an appointed day Herod put on his royal robes, took his seat on the throne, and delivered a speech to them.",
      "links": "<a href='/AIV/26/28/2'>Ezek. 28:2</a>",
      "comment": "Herod’s throne imagery recalls prophecies against prideful kings (Ezek. 28:2), contrasting earthly glory with divine authority over the church."
    },
    {
      "pk": 51012022,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 22,
      "text": "And the people shouted, 'The voice of a god, and not of a man!'",
      "links": "<a href='/AIV/27/3/5'>Dan. 3:5</a>; <a href='/AIV/41/15/12-13'>Mark 15:12-13</a>",
      "comment": "The crowds’ response reflects idolatrous tendencies, reminiscent of Daniel 3:5, and warns against exalting men over God."
    },
    {
      "pk": 51012023,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 23,
      "text": "Immediately an angel of the Lord struck him down, because he did not give God the glory, and he was eaten by worms and died.",
      "links": "<a href='/AIV/19/115/1'>Ps. 115:1</a>; <a href='/AIV/26/28/9'>Ezek. 28:9</a>",
      "comment": "Herod’s death is divine justice for pride and self-glorification, emphasizing God’s sovereignty over rulers and the protection of His church."
    },
    {
      "pk": 51012024,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 24,
      "text": "But the word of God increased and multiplied.",
      "links": "<a href='/AIV/44/6/7'>Acts 6:7</a>; <a href='/AIV/23/55/11'>Isa. 55:11</a>",
      "comment": "Despite persecution, the spread of the Word testifies to the Church’s resilience and foundation in apostolic authority—fulfilling Isaiah’s prophecy of God’s word prospering."
    },
    {
      "pk": 51012025,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 12,
      "verse": 25,
      "text": "And Barnabas and Saul returned from Jerusalem when they had completed their service, bringing with them John, whose other name was Mark.",
      "links": "<a href='/AIV/44/11/30'>Acts 11:30</a>; <a href='/AIV/44/13/5'>Acts 13:5</a>",
      "comment": "The mention of service fulfilled and bringing John Mark points to the importance of apostolic succession and reliable transmission of authentic teaching within the church."
    }
  ],
  "translatedAt": "2025-12-24T11:24:43.216Z"
}