{
  "book": 51,
  "bookName": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 19,
  "verses": [
    {
      "pk": 51019001,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 1,
      "text": "While Apollos was at Corinth, Paul traveled through the inland regions and came to Ephesus. There he found some disciples.",
      "links": "<a href='/AIV/51/18/24'>Acts 18:24</a>; <a href='/AIV/51/18/19'>Acts 18:19</a>",
      "comment": "Paul continues his missionary work, visiting Ephesus where he had left Priscilla and Aquila. The mention of 'disciples' shows the growing Christian community in the city, reflecting apostolic foundation."
    },
    {
      "pk": 51019002,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 2,
      "text": "He asked them, 'Did you receive the Holy Spirit when you believed?' They answered, 'No, we have not even heard that there is a Holy Spirit.'",
      "links": "<a href='/AIV/51/8/15-17'>Acts 8:15-17</a>; <a href='/AIV/43/7/39'>John 7:39</a>",
      "comment": "Paul's question reveals an expectation of the reception of the Holy Spirit in the early Christian experience, a sign of sacramental initiation. Their reply indicates incomplete instruction—showing the importance of full apostolic teaching."
    },
    {
      "pk": 51019003,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 3,
      "text": "So Paul asked, 'Then into what were you baptized?' They replied, 'Into John's baptism.'",
      "links": "<a href='/AIV/40/3/11'>Matt. 3:11</a>; <a href='/AIV/51/1/5'>Acts 1:5</a>",
      "comment": "John’s baptism was preparatory, not the full initiation into Christ. The critical distinction between John's and Christian baptism emerges here, highlighting apostolic authority in administering true Christian rites."
    },
    {
      "pk": 51019004,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 4,
      "text": "Paul said, 'John baptized with a baptism of repentance, telling the people to believe in the one who was coming after him, that is, in Jesus.'",
      "links": "<a href='/AIV/43/1/26-27'>John 1:26-27</a>; <a href='/AIV/40/11/3'>Matt. 11:3</a>",
      "comment": "Paul clarifies the role of John as forerunner to Christ. The emphasis on Jesus as the object of faith directs all authority and salvation to Him, and foreshadows the importance of receiving the fullness of faith."
    },
    {
      "pk": 51019005,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 5,
      "text": "Upon hearing this, they were baptized in the name of the Lord Jesus.",
      "links": "<a href='/AIV/51/8/16'>Acts 8:16</a>; <a href='/AIV/51/2/38'>Acts 2:38</a>",
      "comment": "Reception of Christian baptism by apostolic hands displays the necessity of valid initiation for full inclusion in the Church, emphasizing the role of authority and proper sacramental form."
    },
    {
      "pk": 51019006,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 6,
      "text": "When Paul laid his hands on them, the Holy Spirit came upon them, and they began speaking in tongues and prophesying.",
      "links": "<a href='/AIV/51/8/17'>Acts 8:17</a>; <a href='/AIV/46/12/10'>1 Cor. 12:10</a>",
      "comment": "The laying on of hands is a clear sign of apostolic succession in transmitting the Holy Spirit, an act of spiritual authority. Gifts received confirm the presence and power of the Spirit."
    },
    {
      "pk": 51019007,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 7,
      "text": "There were about twelve men in all.",
      "links": "<a href='/AIV/40/10/1'>Matt. 10:1</a>; <a href='/AIV/42/6/13'>Luke 6:13</a>",
      "comment": "The number twelve recalls Israel’s tribes and the apostles, symbolizing completeness and continuity of God’s people under the new covenant."
    },
    {
      "pk": 51019008,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 8,
      "text": "Paul entered the synagogue and spoke boldly there for three months, arguing and persuading about the kingdom of God.",
      "links": "<a href='/AIV/51/13/5'>Acts 13:5</a>; <a href='/AIV/42/4/43'>Luke 4:43</a>",
      "comment": "Paul’s teaching reflects the continuity of salvation history from Old to New Testament, demonstrating the kingdom’s unfolding through Christ. His boldness signifies missionary zeal and apostolic leadership."
    },
    {
      "pk": 51019009,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 9,
      "text": "But when some became hardened and refused to believe, speaking evil of the Way before the crowd, he withdrew from them and took the disciples with him, reasoning daily in the hall of Tyrannus.",
      "links": "<a href='/AIV/51/24/14'>Acts 24:14</a>; <a href='/AIV/51/9/2'>Acts 9:2</a>",
      "comment": "Resistance among the Jews and Paul’s withdrawal illustrates the movement from synagogue to distinct community life. Teaching in the hall shows the Church adapting her mission as needed."
    },
    {
      "pk": 51019010,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 10,
      "text": "This continued for two years, so that all who lived in Asia heard the word of the Lord, both Jews and Greeks.",
      "links": "<a href='/AIV/51/20/31'>Acts 20:31</a>; <a href='/AIV/51/13/49'>Acts 13:49</a>",
      "comment": "Paul’s extended ministry demonstrates the spread of the Gospel to all nations—a fulfillment of prophecy about the universal reach of God’s salvation. The perseverance of teaching is noteworthy for Church life."
    },
    {
      "pk": 51019011,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 11,
      "text": "God was doing extraordinary miracles through Paul.",
      "links": "<a href='/AIV/51/5/15-16'>Acts 5:15-16</a>; <a href='/AIV/41/6/13'>Mark 6:13</a>",
      "comment": "Miracles confirm Paul’s apostolic authority, echoing Christ’s works and demonstrating God’s ongoing intervention through His chosen servants. Miracles are signs accompanying true teaching."
    },
    {
      "pk": 51019012,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 12,
      "text": "So even handkerchiefs or aprons that had touched his skin were carried to the sick, and their diseases left them, and evil spirits went out.",
      "links": "<a href='/AIV/42/8/44'>Luke 8:44</a>; <a href='/AIV/41/5/30'>Mark 5:30</a>",
      "comment": "Physical objects becoming vehicles of healing reflect the reality of sacramental signs—God working through material means to convey grace and power. It shows faith in God’s power transmitted through His servants."
    },
    {
      "pk": 51019013,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 13,
      "text": "Then some itinerant Jewish exorcists tried to invoke the name of the Lord Jesus over those with evil spirits, saying, 'I adjure you by Jesus whom Paul proclaims.'",
      "links": "<a href='/AIV/41/9/38'>Mark 9:38</a>; <a href='/AIV/44/3/16'>Acts 3:16</a>",
      "comment": "Their invocation of Jesus’ name without faith or authority highlights the difference between genuine apostolic ministry and mere use of sacred words."
    },
    {
      "pk": 51019014,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 14,
      "text": "Seven sons of Sceva, a Jewish high priest, were doing this.",
      "links": "<a href='/AIV/51/19/13'>Acts 19:13</a>",
      "comment": "The naming of Sceva connects this event to Jewish religious leaders, contrasting the difference in authority and results between apostolic and non-apostolic actions."
    },
    {
      "pk": 51019015,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 15,
      "text": "But the evil spirit answered them, 'Jesus I know, and Paul I recognize, but who are you?'",
      "links": "<a href='/AIV/42/10/17'>Luke 10:17</a>; <a href='/AIV/41/1/24'>Mark 1:24</a>",
      "comment": "The demon’s response reveals the unique authority Jesus gives to His apostles; such authority is not gained merely by using His name, but by union with Him and His Church."
    },
    {
      "pk": 51019016,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 16,
      "text": "Then the man in whom the evil spirit was leaped on them, overpowered them all, and beat them so that they fled from that house naked and wounded.",
      "links": "<a href='/AIV/42/8/29'>Luke 8:29</a>",
      "comment": "A dramatic lesson: authentic spiritual power cannot be appropriated apart from submission to the true faith and authority. It signals the need for right relationship with Christ and His apostolic ministers."
    },
    {
      "pk": 51019017,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 17,
      "text": "This became known to all the Jews and Greeks living in Ephesus. They were all seized with fear, and the name of the Lord Jesus was held in high honor.",
      "links": "<a href='/AIV/51/5/11'>Acts 5:11</a>; <a href='/AIV/40/9/8'>Matt. 9:8</a>",
      "comment": "The power and holiness connected to Jesus’ name brings awe and reverence in the city, a spiritual atmosphere that favors true worship and conversion."
    },
    {
      "pk": 51019018,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 18,
      "text": "Many who had believed came and openly confessed their deeds.",
      "links": "<a href='/AIV/40/3/6'>Matt. 3:6</a>; <a href='/AIV/59/5/16'>James 5:16</a>",
      "comment": "Public confession shows the practice of repentance and conversion, highlighting the importance of acknowledging sins among believers as part of the life of grace and healing."
    },
    {
      "pk": 51019019,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 19,
      "text": "A number who had practiced magic brought their books together and burned them before everyone. They calculated the value and found it to be fifty thousand pieces of silver.",
      "links": "<a href='/AIV/51/8/9-20'>Acts 8:9-20</a>; <a href='/AIV/51/14/15'>Acts 14:15</a>",
      "comment": "Conversion leads believers to renounce former sinful practices, even at great material cost, revealing the transformative power of grace and the call to radical discipleship."
    },
    {
      "pk": 51019020,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 20,
      "text": "So the word of the Lord continued to grow and prevail mightily.",
      "links": "<a href='/AIV/51/6/7'>Acts 6:7</a>; <a href='/AIV/51/12/24'>Acts 12:24</a>",
      "comment": "The unstoppable advance of the Gospel is a sign of divine favor. The word ‘prevail’ points to the triumph of Christ’s Kingdom over darkness—both spiritually and in society."
    },
    {
      "pk": 51019021,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 21,
      "text": "After these events, Paul resolved in the Spirit to pass through Macedonia and Achaia, and go to Jerusalem, saying, 'After I have been there, I must also see Rome.'",
      "links": "<a href='/AIV/51/20/1-16'>Acts 20:1-16</a>; <a href='/AIV/45/1/11-15'>Rom. 1:11-15</a>",
      "comment": "Paul’s journey is guided by the Spirit, showing the divine plan directing apostolic mission. His intent to go to Jerusalem and Rome links the Gospel to key centers of faith and authority."
    },
    {
      "pk": 51019022,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 22,
      "text": "He sent two of his helpers, Timothy and Erastus, ahead to Macedonia, while he stayed a while longer in Asia.",
      "links": "<a href='/AIV/51/16/1'>Acts 16:1</a>; <a href='/AIV/45/16/23'>Rom. 16:23</a>",
      "comment": "Paul’s delegation is an example of orderly mission work, with trusted co-workers aiding the expansion of the Church. Timothy’s special mention symbolizes apostolic succession and faithful service."
    },
    {
      "pk": 51019023,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 23,
      "text": "About that time a great disturbance broke out concerning the Way.",
      "links": "<a href='/AIV/51/9/2'>Acts 9:2</a>",
      "comment": "‘The Way’ was the early name for the Christian movement, indicating a distinct path to salvation. Opposition often accompanied the Church’s growth, fulfilling Christ’s predictions of persecution."
    },
    {
      "pk": 51019024,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 24,
      "text": "A silversmith named Demetrius, who made silver shrines for Artemis, brought much business to the craftsmen.",
      "links": "<a href='/AIV/51/19/35'>Acts 19:35</a>; <a href='/AIV/23/46/1'>Isa. 46:1</a>",
      "comment": "Commerce linked to idolatry shows how spiritual choices affect economic and social life. The Artemis cult was a major pagan influence, illustrating the clash between the gospel and societal idols."
    },
    {
      "pk": 51019025,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 25,
      "text": "He called together the craftsmen and workers in related trades and said, 'Men, you know that our prosperity comes from this business.'",
      "links": "<a href='/AIV/51/19/24'>Acts 19:24</a>",
      "comment": "Demetrius appeals to economic interest, exposing a heart divided between earthly gain and spiritual truth—a warning about choosing temporal or eternal values."
    },
    {
      "pk": 51019026,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 26,
      "text": "'And you see and hear that not only in Ephesus, but throughout almost all of Asia, this Paul has convinced and turned away many people, saying that gods made by hands are not gods.'",
      "links": "<a href='/AIV/19/115/4'>Ps. 115:4</a>; <a href='/AIV/23/44/10-20'>Isa. 44:10-20</a>",
      "comment": "Paul’s teaching against idols echoes the Old Testament prophets, upholding the worship of the one true God and rejecting false deities."
    },
    {
      "pk": 51019027,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 27,
      "text": "'There is danger that our trade may lose its good name, and that the temple of the great goddess Artemis may be discredited—and that she whom all Asia and the world worship may be dethroned from her magnificence.'",
      "links": "<a href='/AIV/24/10/11'>Jer. 10:11</a>",
      "comment": "The threat to Artemis demonstrates how true faith tends to unsettle corrupt social structures, while Paul’s ministry exposes the emptiness of false worship."
    },
    {
      "pk": 51019028,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 28,
      "text": "When they heard this, they were furious and began shouting, 'Great is Artemis of the Ephesians!'",
      "links": "<a href='/AIV/51/19/34'>Acts 19:34</a>",
      "comment": "Popular opposition reveals the spiritual battle between the Gospel and paganism. The fervor for Artemis mirrors humanity’s tendency to defend religious traditions, even against evidence."
    },
    {
      "pk": 51019029,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 29,
      "text": "The city was filled with confusion, and the people rushed together into the theater, dragging along Gaius and Aristarchus, Paul's traveling companions from Macedonia.",
      "links": "<a href='/AIV/51/20/4'>Acts 20:4</a>; <a href='/AIV/51/27/2'>Acts 27:2</a>",
      "comment": "Paul’s companions face persecution, illustrating how solidarity and brotherhood support believers in trial. The chaos contrasts the peace and order found in the true Church."
    },
    {
      "pk": 51019030,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 30,
      "text": "Paul wanted to go in before the crowd, but the disciples would not let him.",
      "links": "<a href='/AIV/51/21/12'>Acts 21:12</a>",
      "comment": "Out of prudence, Paul’s safety is protected by the community, showing how Church leaders sometimes must listen to wise counsel."
    },
    {
      "pk": 51019031,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 31,
      "text": "Even some officials of the province, who were friends of his, sent word to him, urging him not to venture into the theater.",
      "links": "<a href='/AIV/51/13/7'>Acts 13:7</a>",
      "comment": "Friendships with authorities can aid the Church’s mission; Paul’s influence reaches even outside the Christian community."
    },
    {
      "pk": 51019032,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 32,
      "text": "Some in the crowd were shouting one thing, some another. Most of the people did not even know why they had come together.",
      "links": "<a href='/AIV/51/19/29'>Acts 19:29</a>",
      "comment": "Mob confusion contrasts the unity and purpose of the Church gathered by the Holy Spirit."
    },
    {
      "pk": 51019033,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 33,
      "text": "The Jews pushed Alexander forward, and some of the crowd explained things to him. He motioned for silence to make a defense before the people.",
      "links": "<a href='/AIV/51/21/40'>Acts 21:40</a>",
      "comment": "Alexander’s attempt to speak likely reflects concern to distance the Jewish community from the Christians, showing the tension between the old and new covenants."
    },
    {
      "pk": 51019034,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 34,
      "text": "But when they realized he was a Jew, they all shouted in unison for about two hours, 'Great is Artemis of the Ephesians!'",
      "links": "<a href='/AIV/51/19/28'>Acts 19:28</a>",
      "comment": "The crowd’s reaction against Alexander reveals deep-rooted prejudice, as well as the force of mob mentality and spiritual blindness."
    },
    {
      "pk": 51019035,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 35,
      "text": "Finally, the city clerk quieted the crowd and said, 'Men of Ephesus, who does not know that the city of Ephesus is guardian of the temple of the great Artemis, and of her image that fell from heaven?'",
      "links": "<a href='/AIV/51/19/24'>Acts 19:24</a>",
      "comment": "The clerk appeals to civic pride and tradition, showing how secular authorities act to maintain order vs. truth. Reference to a heavenly image echoes pagan superstition vs. Christian revelation."
    },
    {
      "pk": 51019036,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 36,
      "text": "'Since these facts are undeniable, you ought to be quiet and not do anything rash.'",
      "links": "<a href='/AIV/51/19/35'>Acts 19:35</a>",
      "comment": "His call to order is a practical solution, not a spiritual answer. Genuine peace comes not from preserving old ways, but from accepting truth."
    },
    {
      "pk": 51019037,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 37,
      "text": "'For you have brought these men here who are neither sacrilegious nor blasphemers of our goddess.'",
      "links": "<a href='/AIV/51/18/13'>Acts 18:13</a>",
      "comment": "The Christians are declared innocent of civic crime, showing the truthfulness and moral uprightness associated with followers of the Way."
    },
    {
      "pk": 51019038,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 38,
      "text": "'If then Demetrius and the craftsmen have a complaint against anyone, the courts are open and there are officials. Let them bring charges against one another.'",
      "links": "<a href='/AIV/51/24/1'>Acts 24:1</a>",
      "comment": "Civil recourse, not mob violence, is the proper approach. Christianity seeks order and justice, not chaos."
    },
    {
      "pk": 51019039,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 39,
      "text": "'If there is anything further you want to ask, it must be settled in a lawful assembly.'",
      "links": "<a href='/AIV/51/19/38'>Acts 19:38</a>",
      "comment": "Encouragement to lawful conduct is highlighted; true reform is established with legitimacy and order."
    },
    {
      "pk": 51019040,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 40,
      "text": "'For we are in danger of being charged with rioting over today’s events, since there is no basis for this commotion, and we could not give a reason for it.'",
      "links": "<a href='/AIV/51/21/34'>Acts 21:34</a>",
      "comment": "Concern for public reputation and legal ramifications shows the power of order amidst confusion. Christians are seen as reasonable, not rebellious."
    },
    {
      "pk": 51019041,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 19,
      "verse": 41,
      "text": "After saying this, he dismissed the assembly.",
      "links": "<a href='/AIV/51/20/1'>Acts 20:1</a>",
      "comment": "Order is restored, and Paul prepares for further mission. The episode demonstrates the resilience of the Church amid persecution and civic unrest, and the quiet triumph of truth supported by God’s providence."
    }
  ],
  "translatedAt": "2025-12-24T11:29:39.069Z"
}