{
  "book": 51,
  "bookName": "Acts",
  "bookAbbreviation": "Acts",
  "chapter": 1,
  "verses": [
    {
      "pk": 51001001,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 1,
      "text": "In my first book, O Theophilus, I wrote about all that Jesus began to do and teach,",
      "links": "<a href='/AIV/42/1/3'>Luke 1:3</a>",
      "comment": "The author, traditionally identified as Luke, addresses Theophilus as he did in his earlier narrative (the Gospel according to Luke). This sets the stage for a continuation of the mission of Jesus, now through his apostles."
    },
    {
      "pk": 51001002,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 2,
      "text": "until the day when he was taken up, after he had given commands through the Holy Spirit to the apostles whom he had chosen.",
      "links": "<a href='/AIV/42/24/51'>Luke 24:51</a>; <a href='/AIV/40/28/19-20'>Matt. 28:19-20</a>",
      "comment": "Jesus acts and teaches by the Holy Spirit. The authority and guidance of the Spirit are crucial for the apostolic mission, indicating the importance of divine inspiration in church leadership."
    },
    {
      "pk": 51001003,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 3,
      "text": "He presented himself alive to them after his suffering, by many proofs, appearing to them over forty days and speaking about the kingdom of God.",
      "links": "<a href='/AIV/42/24/36-43'>Luke 24:36-43</a>; <a href='/AIV/46/15/5-8'>1 Cor. 15:5-8</a>",
      "comment": "Jesus' resurrection is central, confirmed by many appearances. His discussion of the kingdom shows the ongoing fulfillment of God’s promises, connecting both earthly ministry and the mission of the Church."
    },
    {
      "pk": 51001004,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 4,
      "text": "And while staying with them, he ordered them not to depart from Jerusalem, but to wait for the promise of the Father, which, he said, 'you heard from me.'",
      "links": "<a href='/AIV/42/24/49'>Luke 24:49</a>; <a href='/AIV/43/14/16-17'>John 14:16-17</a>",
      "comment": "Waiting in Jerusalem fulfills Old Testament prophecy (Isaiah 2:3), and underscores the apostles’ obedience to Christ and the value of tradition received from the Lord."
    },
    {
      "pk": 51001005,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 5,
      "text": "'For John baptized with water, but you will be baptized with the Holy Spirit not many days from now.'",
      "links": "<a href='/AIV/40/3/11'>Matt. 3:11</a>; <a href='/AIV/42/3/16'>Luke 3:16</a>",
      "comment": "This contrasts outward ritual with a deeper, inward transformation brought by the Spirit—anticipating Pentecost and the Church’s sacramental life."
    },
    {
      "pk": 51001006,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 6,
      "text": "So when they had come together, they asked him, 'Lord, will you at this time restore the kingdom to Israel?'",
      "links": "<a href='/AIV/42/24/21'>Luke 24:21</a>; <a href='/AIV/33/4/8'>Micah 4:8</a>",
      "comment": "The apostles expect a political restoration, but Jesus redirects their expectations toward a spiritual and universal mission of His Church."
    },
    {
      "pk": 51001007,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 7,
      "text": "He said to them, 'It is not for you to know times or seasons that the Father has set by his own authority.'",
      "links": "<a href='/AIV/41/13/32-33'>Mark 13:32-33</a>",
      "comment": "Jesus affirms the Father’s ultimate authority and emphasizes trustful obedience, a characteristic of true discipleship within the Church."
    },
    {
      "pk": 51001008,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 8,
      "text": "But you will receive power when the Holy Spirit has come upon you, and you will be my witnesses in Jerusalem and in all Judea and Samaria, and to the ends of the earth.'",
      "links": "<a href='/AIV/24/31/31-34'>Jer. 31:31-34</a>; <a href='/AIV/23/49/6'>Isa. 49:6</a>; <a href='/AIV/44/13/47'>Acts 13:47</a>",
      "comment": "The spread of the Gospel beyond Israel is fulfilled here. The Spirit’s power is the foundation for the unity and mission of the Church."
    },
    {
      "pk": 51001009,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 9,
      "text": "And when he had said these things, as they were looking on, he was lifted up, and a cloud took him out of their sight.",
      "links": "<a href='/AIV/27/7/13'>Dan. 7:13</a>; <a href='/AIV/42/24/51'>Luke 24:51</a>",
      "comment": "The ascension fulfills prophecy and Christ’s promise, showing his divine authority and heavenly priesthood (Heb. 4:14). The cloud often symbolizes God’s presence."
    },
    {
      "pk": 51001010,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 10,
      "text": "While they gazed intently into heaven as he went, behold, two men stood by them in white robes,",
      "links": "<a href='/AIV/42/24/4'>Luke 24:4</a>",
      "comment": "The two men in white likely refer to angels (as at the Resurrection), reinforcing divine confirmation of the ascension and mission."
    },
    {
      "pk": 51001011,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 11,
      "text": "and said, 'Men of Galilee, why do you stand looking into heaven? This Jesus, who was taken from you into heaven, will come in the same way as you saw him go into heaven.'",
      "links": "<a href='/AIV/40/24/30'>Matt. 24:30</a>; <a href='/AIV/66/1/7'>Rev. 1:7</a>",
      "comment": "Jesus’ promise to return implies an ongoing presence and anticipation among believers, reinforcing the Church’s hope in his Second Coming."
    },
    {
      "pk": 51001012,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 12,
      "text": "Then they returned to Jerusalem from the mount called Olivet, which is near Jerusalem, a Sabbath day's journey away.",
      "links": "<a href='/AIV/38/14/4'>Zech. 14:4</a>",
      "comment": "Their obedience to Jesus’ words and the significance of the Mount of Olives (a place of messianic expectation) prepare for new beginnings in Jerusalem."
    },
    {
      "pk": 51001013,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 13,
      "text": "When they had entered, they went up to the upper room, where they were staying: Peter, John, James, Andrew, Philip, Thomas, Bartholomew, Matthew, James son of Alphaeus, Simon the Zealot, and Judas the son of James.",
      "links": "<a href='/AIV/42/22/12'>Luke 22:12</a>; <a href='/AIV/40/10/2-4'>Matt. 10:2-4</a>",
      "comment": "The naming of the apostles highlights apostolic authority and unity as the foundation stones of the Church (Eph. 2:20)."
    },
    {
      "pk": 51001014,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 14,
      "text": "All these with one accord were devoting themselves to prayer, together with the women and Mary the mother of Jesus, and with his brothers.",
      "links": "<a href='/AIV/42/23/49'>Luke 23:49</a>; <a href='/AIV/43/2/12'>John 2:12</a>",
      "comment": "Unity in prayer, including Mary and the brothers of Jesus, shows the Church gathered in its earliest form waiting for the Holy Spirit—Mary present as the mother of the community."
    },
    {
      "pk": 51001015,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 15,
      "text": "In those days Peter stood up among the brothers (the company of persons was in all about one hundred and twenty) and said,",
      "links": "<a href='/AIV/40/16/18-19'>Matt. 16:18-19</a>",
      "comment": "Peter’s initiative as the leader among the apostles aligns with Jesus’ earlier statement about his foundational role among the disciples."
    },
    {
      "pk": 51001016,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 16,
      "text": "'Brothers, the Scripture had to be fulfilled, which the Holy Spirit spoke beforehand by the mouth of David concerning Judas, who became a guide to those who arrested Jesus.'",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>; <a href='/AIV/19/55/12-14'>Ps. 55:12-14</a>",
      "comment": "Peter affirms the inspiration of Scripture and its fulfillment, showing a tradition of interpreting Old Testament prophecy in light of Christ."
    },
    {
      "pk": 51001017,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 17,
      "text": "'For he was numbered among us and was allotted his share in this ministry.'",
      "links": "<a href='/AIV/40/10/4'>Matt. 10:4</a>",
      "comment": "Judas had an original office among the apostles. The use of 'ministry' implies an official role and succession, foundational for apostolic authority and its transmission."
    },
    {
      "pk": 51001018,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 18,
      "text": "Now this man bought a field with the reward of his wickedness, and falling headlong, he burst open in the middle and all his intestines spilled out.",
      "links": "<a href='/AIV/40/27/5-8'>Matt. 27:5-8</a>",
      "comment": "The consequences of Judas' betrayal are described graphically. This echoes Old Testament warnings about betrayal and judgment."
    },
    {
      "pk": 51001019,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 19,
      "text": "And it became known to all the inhabitants of Jerusalem, so that the field was called in their own language Akeldama, that is, Field of Blood.",
      "links": "<a href='/AIV/38/11/13'>Zech. 11:13</a>",
      "comment": "The place name fulfills prophecy and links Judas’ actions to scriptural foreknowledge, deepening the sense of continuity between Old and New Covenants."
    },
    {
      "pk": 51001020,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 20,
      "text": "'For it is written in the Book of Psalms, “Let his dwelling become desolate, and let no one live in it”; and, “Let another take his office.”'",
      "links": "<a href='/AIV/19/69/25'>Ps. 69:25</a>; <a href='/AIV/19/109/8'>Ps. 109:8</a>",
      "comment": "Peter cites Old Testament authority for replacing Judas, reinforcing the succession and continuity of apostolic oversight."
    },
    {
      "pk": 51001021,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 21,
      "text": "'So one of the men who have accompanied us during all the time that the Lord Jesus went in and out among us,",
      "links": "<a href='/AIV/40/19/28'>Matt. 19:28</a>",
      "comment": "Apostolic succession requires a firsthand witness to Jesus' ministry, stressing the importance of living tradition as the Church is established."
    },
    {
      "pk": 51001022,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 22,
      "text": "beginning from the baptism of John until the day when he was taken up from us—one of these men must become with us a witness to his resurrection.'",
      "links": "<a href='/AIV/41/1/9-11'>Mark 1:9-11</a>; <a href='/AIV/42/24/48'>Luke 24:48</a>",
      "comment": "Eyewitness testimony is foundational for apostolic authority and the proclamation of the resurrection—the core of Christian faith."
    },
    {
      "pk": 51001023,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 23,
      "text": "And they put forward two, Joseph called Barsabbas, who was also called Justus, and Matthias.",
      "links": "",
      "comment": "The naming of candidates demonstrates the practice of discernment within the Church’s apostolic community."
    },
    {
      "pk": 51001024,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 24,
      "text": "And they prayed and said, 'You, Lord, who know the hearts of all, show which one of these two you have chosen",
      "links": "<a href='/AIV/09/16/7'>1 Sam. 16:7</a>",
      "comment": "The apostles seek divine guidance through prayer in choosing leadership, showing a pattern of dependence on God for a visible, authoritative church structure."
    },
    {
      "pk": 51001025,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 25,
      "text": "to take the place in this ministry and apostleship from which Judas turned aside to go to his own place.'",
      "links": "",
      "comment": "The office of apostle is clearly replaceable and intended to be perpetuated, laying groundwork for the continuation of Church leadership through succession."
    },
    {
      "pk": 51001026,
      "translation": "AIV",
      "book": 51,
      "bookName": "Acts",
      "bookAbbreviation": "Acts",
      "chapter": 1,
      "verse": 26,
      "text": "And they cast lots for them, and the lot fell on Matthias, and he was numbered with the eleven apostles.",
      "links": "<a href='/AIV/20/16/33'>Prov. 16:33</a>",
      "comment": "This ancient practice shows reliance on God’s will and the restoration of the apostolic foundation to twelve—a sign of continuity and authentic authority in the Church."
    }
  ],
  "translatedAt": "2025-12-24T11:17:35.780Z"
}