{
  "book": "Philemon",
  "bookAbbreviation": "Phlm",
  "chapter": 1,
  "verses": [
    {
      "pk": 3001001,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 1,
      "text": "Paul, a prisoner for Christ Jesus, and Timothy our brother, to Philemon our beloved and fellow worker,",
      "links": "<a href='/AIV/44/16/40'>Acts 16:40</a>; <a href='/AIV/50/1/1'>Philippians 1:1</a>",
      "comment": "Paul introduces himself as a prisoner, emphasizing his suffering for Christ. This note of personal sacrifice is a hallmark of Christian leadership modeled after Christ (see Colossians 1:24)."
    },
    {
      "pk": 3001002,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 2,
      "text": "and to Apphia our sister, and Archippus our fellow soldier, and to the church that meets in your house:",
      "links": "<a href='/AIV/51/4/17'>Colossians 4:17</a>",
      "comment": "The early church gathered in homes, showing the intimacy of Christian fellowship and a living example of God's family."
    },
    {
      "pk": 3001003,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 3,
      "text": "Grace to you and peace from God our Father and the Lord Jesus Christ.",
      "links": "<a href='/AIV/54/1/2'>1 Timothy 1:2</a>",
      "comment": "Paul uses a greeting integrating both divine favor and reconciliation, echoing numbers of his other letters (see Romans 1:7)."
    },
    {
      "pk": 3001004,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 4,
      "text": "I always thank my God when I remember you in my prayers,",
      "links": "<a href='/AIV/51/1/3'>Colossians 1:3</a>",
      "comment": "Paul's prayer for Philemon is continual, signifying the importance of intercessory prayer for fellow believers."
    },
    {
      "pk": 3001005,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 5,
      "text": "because I hear of your love and faith toward the Lord Jesus and for all the saints.",
      "links": "<a href='/AIV/51/1/4'>Colossians 1:4</a>",
      "comment": "Faith in Christ naturally leads to love for the saints—showing the deep unity and communion among believers (cf. John 13:35)."
    },
    {
      "pk": 3001006,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 6,
      "text": "I pray that the sharing of your faith may become effective by the acknowledgment of every good thing that is in us for Christ.",
      "links": "<a href='/AIV/50/1/6'>Philippians 1:6</a>; <a href='/AIV/56/1/1'>Titus 1:1</a>",
      "comment": "The phrase suggests a deepening of faith through active participation in the body of Christ, highlighting the transformative power of shared grace."
    },
    {
      "pk": 3001007,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 7,
      "text": "For I have derived much joy and comfort from your love, my brother, because the hearts of the saints have been refreshed through you.",
      "links": "<a href='/AIV/52/3/6'>1 Thessalonians 3:6</a>",
      "comment": "Philemon's example brings encouragement to the community, showing how one believer's charity edifies others spiritually."
    },
    {
      "pk": 3001008,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 8,
      "text": "Therefore, though I have boldness in Christ to command you to do what is proper,",
      "links": "<a href='/AIV/47/10/8'>2 Corinthians 10:8</a>",
      "comment": "Paul hints at apostolic authority, but chooses persuasion over compulsion. This demonstrates the gentle leadership characteristic of Christ's apostles."
    },
    {
      "pk": 3001009,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 9,
      "text": "yet for love’s sake I appeal to you—I, Paul, an aged man and now a prisoner also for Christ Jesus—",
      "links": "<a href='/AIV/56/2/2'>Titus 2:2</a>; <a href='/AIV/56/1/1'>Titus 1:1</a>",
      "comment": "Paul appeals gently and lovingly, echoing the Christian teaching to lead by humility and suffering, after the pattern of Christ."
    },
    {
      "pk": 3001010,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 10,
      "text": "I appeal to you for my child Onesimus, whose father I became in prison.",
      "links": "<a href='/AIV/46/4/15'>1 Corinthians 4:15</a>",
      "comment": "Paul speaks spiritually—he has begotten Onesimus in the faith. Implies spiritual fatherhood, a common biblical theme (see Titus 1:4)."
    },
    {
      "pk": 3001011,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 11,
      "text": "Formerly he was useless to you, but now he is useful both to you and to me.",
      "links": "<a href='/AIV/51/1/10-11'>Colossians 1:10-11</a>",
      "comment": "Plays on the meaning of the name Onesimus (“useful”). A picture of the transformative power of the gospel."
    },
    {
      "pk": 3001012,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 12,
      "text": "I am sending him back to you—he is my very heart.",
      "links": "<a href='/AIV/47/8/16-17'>2 Corinthians 8:16-17</a>",
      "comment": "Paul's deep affection for Onesimus reveals the profound union possible between believers through Christ."
    },
    {
      "pk": 3001013,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 13,
      "text": "I would have liked to keep him with me, so that on your behalf he might serve me in my imprisonment for the gospel.",
      "links": "<a href='/AIV/50/2/22'>Philippians 2:22</a>",
      "comment": "Ministry and service are communal acts; Paul respects Philemon’s rightful role in the relationship (see Romans 12:5)."
    },
    {
      "pk": 3001014,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 14,
      "text": "But I preferred to do nothing without your consent, so that your goodness might not be by compulsion but by your own free will.",
      "links": "<a href='/AIV/47/9/7'>2 Corinthians 9:7</a>",
      "comment": "True Christian charity is never forced. Paul emphasizes freedom of conscience, a subtle affirmation of free will."
    },
    {
      "pk": 3001015,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 15,
      "text": "For perhaps he was separated from you for a short time, that you might have him back forever—",
      "links": "<a href='/AIV/01/45/5-8'>Genesis 45:5-8</a>",
      "comment": "Paul draws on providence—the idea that God orchestrates events for a greater good, reflecting Old Testament examples (e.g., Joseph's story)."
    },
    {
      "pk": 3001016,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 16,
      "text": "no longer as a slave but more than a slave—a beloved brother, especially to me, and even more to you, both in the flesh and in the Lord.",
      "links": "<a href='/AIV/51/3/11'>Colossians 3:11</a>",
      "comment": "Onesimus’s new status illustrates spiritual adoption and the abolition of distinction in Christ, echoing Galatians 3:28."
    },
    {
      "pk": 3001017,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 17,
      "text": "So if you consider me your partner, receive him as you would receive me.",
      "links": "<a href='/AIV/40/25/40'>Matthew 25:40</a>; <a href='/AIV/47/8/23'>2 Corinthians 8:23</a>",
      "comment": "Paul likens Christian fellowship to receiving Christ himself in the person of a brother—a profound teaching on unity in the body."
    },
    {
      "pk": 3001018,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 18,
      "text": "If he has wronged you at all or owes you anything, charge that to my account.",
      "links": "<a href='/AIV/48/6/2'>Galatians 6:2</a>",
      "comment": "Paul models Christ’s bearing of our debts—a substitutionary aspect reminiscent of the cross."
    },
    {
      "pk": 3001019,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 19,
      "text": "I, Paul, write this with my own hand: I will repay it—not to mention that you owe me even your own self.",
      "links": "<a href='/AIV/46/9/15'>1 Corinthians 9:15</a>",
      "comment": "Paul reminds Philemon of his debt to apostolic ministry, gently recalling spiritual authority and gratitude."
    },
    {
      "pk": 3001020,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 20,
      "text": "Yes, brother, may I have joy from you in the Lord; refresh my heart in Christ.",
      "links": "<a href='/AIV/51/4/8-9'>Colossians 4:8-9</a>",
      "comment": "Paul’s request points to holy refreshment found in loving obedience to Christ, and the mutual joy of Christian life."
    },
    {
      "pk": 3001021,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 21,
      "text": "Confident of your obedience, I write to you, knowing that you will do even more than I ask.",
      "links": "<a href='/AIV/50/2/12'>Philippians 2:12</a>",
      "comment": "Obedience to apostolic authority is gently encouraged. Paul hints at fullness of charity going even beyond expectations."
    },
    {
      "pk": 3001022,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 22,
      "text": "At the same time, prepare a guest room for me, for I hope that through your prayers I will be graciously given to you.",
      "links": "<a href='/AIV/45/15/30-32'>Romans 15:30-32</a>",
      "comment": "Paul requests hospitality, expressing the importance of practical love and the power of the church’s prayers for deliverance."
    },
    {
      "pk": 3001023,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 23,
      "text": "Epaphras, my fellow prisoner in Christ Jesus, greets you",
      "links": "<a href='/AIV/51/4/12'>Colossians 4:12</a>",
      "comment": "Personal greetings reinforce the close relationships among Christian leaders and the value of community in faith."
    },
    {
      "pk": 3001024,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 24,
      "text": "as do Mark, Aristarchus, Demas, and Luke, my fellow workers.",
      "links": "<a href='/AIV/51/4/10-14'>Colossians 4:10-14</a>; <a href='/AIV/55/4/11'>2 Timothy 4:11</a>",
      "comment": "This closing reminds of the collegial apostolic ministry. Connection with Mark and Luke signals canonical authority of the gospels."
    },
    {
      "pk": 3001025,
      "translation": "AIV",
      "book": 57,
      "chapter": 1,
      "verse": 25,
      "text": "The grace of the Lord Jesus Christ be with your spirit.",
      "links": "<a href='/AIV/50/4/23'>Philippians 4:23</a>; <a href='/AIV/54/6/21'>1 Timothy 6:21</a>",
      "comment": "Paul's final blessing recalls the continual need for divine grace, the heart of Christian life and unity with Christ."
    }
  ],
  "translatedAt": "2025-12-23T04:06:06.816Z"
}