{
  "book": 24,
  "bookName": "Proverbs",
  "bookAbbreviation": "Prov",
  "chapter": 30,
  "verses": [
    {
      "pk": 24030001,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 1,
      "text": "The words of Agur son of Jakeh, the oracle. The man declares to Ithiel, to Ithiel and Ucal:",
      "links": "<a href='/AIV/20/1/1'>Prov. 1:1</a>",
      "comment": "This heading introduces a wise saying, attributing it to Agur, little known outside this chapter. Like other wisdom figures, his words become scripture and thus part of the inspired wisdom tradition, highlighting the value of tradition in transmitting faith."
    },
    {
      "pk": 24030002,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 2,
      "text": "Surely I am more ignorant than any man, and I lack human understanding.",
      "links": "<a href='/AIV/19/73/22'>Ps. 73:22</a>",
      "comment": "Agur confesses his limitation, echoing biblical humility (see Psalm 73:22). This sets the stage for receiving divine wisdom, suggesting knowledge is not self-derived but a gift and pointing to the necessity of spiritual enlightenment."
    },
    {
      "pk": 24030003,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 3,
      "text": "I have not learned wisdom, nor do I possess the knowledge of the Holy One.",
      "links": "<a href='/AIV/20/2/6'>Prov. 2:6</a>; <a href='/AIV/20/9/10'>Prov. 9:10</a>",
      "comment": "Agur admits his lack of wisdom and knowledge of God, paralleling Proverbs 9:10, where true wisdom is found in knowing the Holy One. Spiritual revelation is made possible only through grace, reinforcing the mysteries of faith."
    },
    {
      "pk": 24030004,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 4,
      "text": "Who has ascended to heaven and come down? Who has gathered the wind in his hands? Who has wrapped up the waters in a garment? Who has established all the ends of the earth? What is his name, and what is the name of his son? Surely you know!",
      "links": "<a href='/AIV/19/24/3'>Ps. 24:3</a>; <a href='/AIV/43/3/13'>John 3:13</a>",
      "comment": "Agur asks rhetorical questions about divine actions, foreshadowing Christ (see John 3:13, where Jesus speaks of ascending and descending). The reference to 'his son' invites spiritual interpretation, seen by many as a subtle hint to the mysterious relationship between God and the Son, later revealed in the New Testament."
    },
    {
      "pk": 24030005,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 5,
      "text": "Every word of God is pure; he is a shield to those who take refuge in him.",
      "links": "<a href='/AIV/19/12/6'>Ps. 12:6</a>; <a href='/AIV/19/18/30'>Ps. 18:30</a>",
      "comment": "Affirms the perfection and reliability of God's word, echoing Psalms. The image of shielding those who trust points to divine protection available through faith and the sacraments, and reliance on revealed scripture."
    },
    {
      "pk": 24030006,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 6,
      "text": "Do not add to his words, or he will rebuke you and prove you a liar.",
      "links": "<a href='/AIV/5/4/2'>Deut. 4:2</a>; <a href='/AIV/66/22/18'>Rev. 22:18</a>",
      "comment": "Warns against altering divine revelation, consistent with warnings elsewhere in scripture. This supports the concept of fidelity to what has been handed down and the legitimacy of authentic tradition."
    },
    {
      "pk": 24030007,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 7,
      "text": "Two things I ask of you; deny them not to me before I die:",
      "links": "<a href='/AIV/19/27/4'>Ps. 27:4</a>",
      "comment": "Agur models asking for spiritual and practical needs from God, paralleling other prayers for wisdom and truth."
    },
    {
      "pk": 24030008,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 8,
      "text": "Remove falsehood and lies far from me; give me neither poverty nor riches, but provide me with the food that is my share.",
      "links": "<a href='/AIV/40/6/11'>Matt. 6:11</a>",
      "comment": "A prayer for honesty and moderation, resonant with the Lord’s Prayer for 'daily bread.' Highlights the spiritual value of humility and temperance, virtues elevated in Christian teaching."
    },
    {
      "pk": 24030009,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 9,
      "text": "Lest, being full, I deny you and say, 'Who is the Lord?' or, being poor, I steal and profane the name of my God.",
      "links": "<a href='/AIV/5/8/11-14'>Deut. 8:11-14</a>",
      "comment": "Warns of spiritual dangers in both excess and lack, connecting temptations with the state of one's soul. This echoes biblical warnings about prosperity leading to forgetfulness of God."
    },
    {
      "pk": 24030010,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 10,
      "text": "Do not slander a servant to his master, lest he curse you, and you are found guilty.",
      "links": "<a href='/AIV/2/23/1'>Ex. 23:1</a>",
      "comment": "Condemns bearing false witness or slander, reinforcing biblical prohibitions on dishonesty. Preserves harmony in relationships, in keeping with ethical teaching."
    },
    {
      "pk": 24030011,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 11,
      "text": "There is a generation that curses its father and does not bless its mother.",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>",
      "comment": "Complaints about generations failing parental respect, pointing to the importance of family and generational transmission of faith and honor."
    },
    {
      "pk": 24030012,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 12,
      "text": "There is a generation that is pure in its own eyes, yet is not cleansed from its filth.",
      "links": "<a href='/AIV/23/64/6'>Isa. 64:6</a>",
      "comment": "Describes spiritual pride and self-delusion, needing true cleansing, hinting at the necessity for purification beyond human effort."
    },
    {
      "pk": 24030013,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 13,
      "text": "There is a generation—oh, how lofty are their eyes, and their eyelids are lifted up.",
      "links": "<a href='/AIV/19/101/5'>Ps. 101:5</a>",
      "comment": "Focuses on pride, a vice repeatedly condemned in scripture as a root of spiritual downfall."
    },
    {
      "pk": 24030014,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 14,
      "text": "There is a generation whose teeth are swords and whose jaws are knives, to devour the poor from the earth and the needy from among mankind.",
      "links": "<a href='/AIV/19/52/4'>Ps. 52:4</a>",
      "comment": "Describes those who prey on the vulnerable, emphasizing the biblical value of justice and compassion for the poor."
    },
    {
      "pk": 24030015,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 15,
      "text": "The leech has two daughters: 'Give! Give!' Three things are never satisfied; four never say, 'Enough':",
      "links": "<a href='/AIV/20/27/20'>Prov. 27:20</a>",
      "comment": "The image of the leech and the enumeration formula teach about insatiable desires and the dangers of unchecked appetites, inviting a spiritual discipline of moderation."
    },
    {
      "pk": 24030016,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 16,
      "text": "Sheol, the barren womb, the earth that is never satisfied with water, and fire that never says, 'Enough.'",
      "links": "<a href='/AIV/23/5/14'>Isa. 5:14</a>",
      "comment": "These four images show persistent longing, reinforcing teachings about the limits of human fulfillment outside of God."
    },
    {
      "pk": 24030017,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 17,
      "text": "The eye that mocks a father and scorns obedience to a mother will be pecked out by the ravens of the valley and eaten by the vultures.",
      "links": "<a href='/AIV/20/20/20'>Prov. 20:20</a>",
      "comment": "Vivid warning against dishonoring parents, amplifying the importance of commandments honoring family and tradition."
    },
    {
      "pk": 24030018,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 18,
      "text": "Three things are too wonderful for me; four I do not understand:",
      "links": "",
      "comment": "Agur expresses awe at the mysteries of creation, reminding readers that human wisdom is incomplete before the greatness of God’s work."
    },
    {
      "pk": 24030019,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 19,
      "text": "The way of an eagle in the sky, the way of a serpent on a rock, the way of a ship in the heart of the sea, and the way of a man with a woman.",
      "links": "",
      "comment": "Each image points to mysteries that cannot be fully explained, including human love—a sign of how profound and sacramental relationships can be, reflecting deeper spiritual realities."
    },
    {
      "pk": 24030020,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 20,
      "text": "This is the way of an adulterous woman: she eats and wipes her mouth and says, 'I have done no wrong.'",
      "links": "<a href='/AIV/20/7/13-14'>Prov. 7:13-14</a>",
      "comment": "Illustrates self-deception and denial of sin, showing the need for authentic confession and repentance as core to spiritual health."
    },
    {
      "pk": 24030021,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 21,
      "text": "Under three things the earth trembles; under four it cannot bear up:",
      "links": "",
      "comment": "Repetition of the numerical proverb formula, highlighting conditions that disrupt natural order—wisdom observes both created and moral order."
    },
    {
      "pk": 24030022,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 22,
      "text": "A slave who becomes king, a fool who is filled with food,",
      "links": "",
      "comment": "Focuses on disorder when positions are reversed and wisdom denied, suggesting that virtue and order are intimately connected in biblical thinking."
    },
    {
      "pk": 24030023,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 23,
      "text": "an unloved woman when she is married, and a servant girl who displaces her mistress.",
      "links": "",
      "comment": "Continues the list, highlighting challenges in relationships and households, emphasizing harmony and right order."
    },
    {
      "pk": 24030024,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 24,
      "text": "Four things on earth are small, yet they are exceedingly wise:",
      "links": "",
      "comment": "Shifts to examples from nature, teaching lessons about humility and wisdom from lowly creatures."
    },
    {
      "pk": 24030025,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 25,
      "text": "The ants are a people not strong, yet they store their food in the summer;",
      "links": "<a href='/AIV/20/6/6-8'>Prov. 6:6-8</a>",
      "comment": "Ants illustrate the virtues of diligence and foresight, which are considered hallmarks of prudent living, echoing earlier Proverbs."
    },
    {
      "pk": 24030026,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 26,
      "text": "The rock badgers are a people not mighty, yet they make their home in the cliffs;",
      "links": "",
      "comment": "Rock badgers embrace safety despite vulnerability. This reflects a spiritual principle: safety is found in seeking firm foundations for faith."
    },
    {
      "pk": 24030027,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 27,
      "text": "The locusts have no king, yet they march in formation;",
      "links": "",
      "comment": "Locusts symbolize unity and cooperation, which can be seen as reflecting the desired harmony and unity among believers."
    },
    {
      "pk": 24030028,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 28,
      "text": "The lizard can be caught with the hand, yet it is found in kings’ palaces.",
      "links": "",
      "comment": "Lizards show how lowly creatures may dwell in the presence of kings, hinting at the mystery of grace whereby the humble are exalted."
    },
    {
      "pk": 24030029,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 29,
      "text": "Three things have a stately stride; four are stately in their walk:",
      "links": "",
      "comment": "Introduces another numerical proverb to illustrate traits worth emulating in character and dignity."
    },
    {
      "pk": 24030030,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 30,
      "text": "The lion, which is mighty among beasts and does not turn away before anyone;",
      "links": "<a href='/AIV/19/91/13'>Ps. 91:13</a>",
      "comment": "The lion is a symbol of strength and courage, often used in scripture to refer to Christ as the Lion of Judah."
    },
    {
      "pk": 24030031,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 31,
      "text": "the strutting rooster, the male goat, and a king with his army around him.",
      "links": "",
      "comment": "Images of leadership, order, and authority, showing the virtue of discipline and proper governance within the community."
    },
    {
      "pk": 24030032,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 32,
      "text": "If you have been foolish, exalting yourself, or if you have devised evil, put your hand on your mouth.",
      "links": "<a href='/AIV/20/17/28'>Prov. 17:28</a>",
      "comment": "Counsels humility and repentance, virtues promoted throughout scripture and essential for spiritual growth."
    },
    {
      "pk": 24030033,
      "translation": "AIV",
      "book": 24,
      "bookName": "Proverbs",
      "bookAbbreviation": "Prov",
      "chapter": 30,
      "verse": 33,
      "text": "For pressing milk produces curds, pressing the nose brings blood, so pressing anger produces strife.",
      "links": "",
      "comment": "Ends with a vivid proverb showing the consequences of our actions. Sows the idea that peace is a fruit of virtue, widely espoused in biblical tradition and spiritual communities."
    }
  ],
  "translatedAt": "2025-12-24T07:06:06.995Z"
}