{
  "book": "Proverbs",
  "bookAbbreviation": "Prov",
  "chapter": 7,
  "verses": [
    {
      "pk": 2000701,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 1,
      "text": "My son, keep my words and treasure my commandments within you.",
      "links": "<a href='/AIV/20/2/1'>Prov. 2:1</a>; <a href='/AIV/20/3/1'>Prov. 3:1</a>",
      "comment": "Solomon urges his son to internalize his teachings, indicating the value of sacred tradition and faithful observance."
    },
    {
      "pk": 2000702,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 2,
      "text": "Keep my commandments and live; guard my teaching as the apple of your eye.",
      "links": "<a href='/AIV/5/32/10'>Deut. 32:10</a>; <a href='/AIV/19/17/8'>Ps. 17:8</a>",
      "comment": "Obedience is connected with life. The 'apple of your eye' echoes God’s special care for His people (cf. Deut. 32:10)."
    },
    {
      "pk": 2000703,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 3,
      "text": "Bind them on your fingers; write them on the tablet of your heart.",
      "links": "<a href='/AIV/5/6/8'>Deut. 6:8</a>; <a href='/AIV/20/3/3'>Prov. 3:3</a>",
      "comment": "The imagery recalls the physical reminders of the law in Deuteronomy 6:8, emphasizing continual remembrance and inward transformation."
    },
    {
      "pk": 2000704,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 4,
      "text": "Say to wisdom, 'You are my sister,' and call understanding your close relative,",
      "links": "<a href='/AIV/20/6/20-22'>Prov. 6:20-22</a>",
      "comment": "Wisdom and understanding are to be cherished as intimately as family, suggesting the role of spiritual kinship in guiding the faithful."
    },
    {
      "pk": 2000705,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 5,
      "text": "to keep you from the immoral woman, from the stranger with her smooth words.",
      "links": "<a href='/AIV/20/5/3-8'>Prov. 5:3-8</a>",
      "comment": "The 'immoral woman' represents not just literal temptation but also spiritual infidelity—worldly wisdom that leads away from God’s covenant."
    },
    {
      "pk": 2000706,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 6,
      "text": "For at the window of my house, I looked out through my lattice,",
      "links": "",
      "comment": "The scene shifts to a fatherly warning through a personal observation—Solomon as a wise observer, underscoring the need for vigilance."
    },
    {
      "pk": 2000707,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 7,
      "text": "and I saw among the naive, I discerned among the youths, a young man lacking sense,",
      "links": "",
      "comment": "The 'youth lacking sense' serves as a warning to those without spiritual maturity or discernment, stressing the need for guidance in all ages."
    },
    {
      "pk": 2000708,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 8,
      "text": "passing along the street near her corner, taking the road to her house",
      "links": "",
      "comment": "Movement toward danger is intentional. This demonstrates free will and responsibility—paralleling man’s choice between good and evil (Gen. 2:16-17)."
    },
    {
      "pk": 2000709,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 9,
      "text": "in the twilight, in the evening, in the black and dark of night.",
      "links": "<a href='/AIV/43/3/19-20'>John 3:19-20</a>",
      "comment": "Darkness often symbolizes sin and secrecy—see parallels in John 3:19-20, where evil deeds are concealed in darkness."
    },
    {
      "pk": 2000710,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 10,
      "text": "And look, a woman came out to meet him, dressed like a prostitute and with crafty intent.",
      "links": "<a href='/AIV/20/6/24-26'>Prov. 6:24-26</a>",
      "comment": "The seductive approach represents both physical and spiritual dangers—temptations that lure believers away from truth and discipline."
    },
    {
      "pk": 2000711,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 11,
      "text": "She is loud and rebellious; her feet do not stay at home.",
      "links": "<a href='/AIV/20/9/13-18'>Prov. 9:13-18</a>",
      "comment": "'Loud and rebellious' contrasts with the peace found in communion with God, reflecting the disorder that comes from abandoning divine wisdom."
    },
    {
      "pk": 2000712,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 12,
      "text": "Now she is in the streets, now in the squares; she lurks at every corner.",
      "links": "",
      "comment": "Temptation is pervasive—modern contexts also echo this, calling for vigilance and involvement in a disciplined community for protection."
    },
    {
      "pk": 2000713,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 13,
      "text": "So she caught him and kissed him, and with a bold face she said to him:",
      "links": "",
      "comment": "The aggressiveness of temptation contrasts with the prudent, patient love modeled by God. The embrace is a counterfeit of covenant love."
    },
    {
      "pk": 2000714,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 14,
      "text": "'I had to offer peace offerings; today I have paid my vows.'",
      "links": "<a href='/AIV/3/7/16'>Lev. 7:16</a>; <a href='/AIV/20/30/20'>Prov. 30:20</a>",
      "comment": "She seeks to cloak sin with religious deeds—a warning against hypocrisy and the misuse of ritual apart from heartfelt obedience."
    },
    {
      "pk": 2000715,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 15,
      "text": "So I came out to meet you, to diligently seek your face, and I have found you.",
      "links": "",
      "comment": "The false sense of being 'chosen' by temptation parodies the earnest pursuit found in authentic spiritual seeking (cf. Song of Solomon)."
    },
    {
      "pk": 2000716,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 16,
      "text": "I have spread my couch with coverings, colored linens from Egypt.",
      "links": "<a href='/AIV/26/16/10'>Ezek. 16:10</a>",
      "comment": "Luxury and sensuality are seen here as tools of seduction, urging a contrast with life devoted to worship and self-sacrifice."
    },
    {
      "pk": 2000717,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 17,
      "text": "I have perfumed my bed with myrrh, aloes, and cinnamon.",
      "links": "<a href='/AIV/19/45/8'>Ps. 45:8</a>; <a href='/AIV/22/4/14'>Song 4:14</a>",
      "comment": "Imagery parallels the perfumes used in temple worship, highlighting the distortion of what is sacred when used for sinful purposes."
    },
    {
      "pk": 2000718,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 18,
      "text": "'Come, let us drink our fill of love until morning; let us delight ourselves with love.'",
      "links": "<a href='/AIV/20/5/18-19'>Prov. 5:18-19</a>",
      "comment": "The misuse of 'love' here is selfish and fleeting, opposed to the faithful, covenantal love between God and His people."
    },
    {
      "pk": 2000719,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 19,
      "text": "For my husband is not at home; he has gone on a long journey.",
      "links": "",
      "comment": "Secrecy hides sin, yet nothing is hidden from God (Heb. 4:13). The reference to the absent husband further parallels spiritual unfaithfulness."
    },
    {
      "pk": 2000720,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 20,
      "text": "He took a bag of money with him; he will not come home until the full moon.",
      "links": "",
      "comment": "The expectation of impunity emboldens wrongdoing, but divine justice is sure. There is a temporal patience but eventual reckoning."
    },
    {
      "pk": 2000721,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 21,
      "text": "With her many persuasive words she led him astray; with her smooth talk she seduced him.",
      "links": "<a href='/AIV/20/5/3'>Prov. 5:3</a>",
      "comment": "The power of words to deceive recalls the serpent’s temptation in Genesis 3:1-6, highlighting the need for discernment and truth."
    },
    {
      "pk": 2000722,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 22,
      "text": "All at once he follows her, like an ox goes to the slaughter, like a deer caught in a trap,",
      "links": "",
      "comment": "Sin leads to destruction. The animal imagery stresses the inevitability and unawareness of the consequences when one departs from wisdom."
    },
    {
      "pk": 2000723,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 23,
      "text": "until an arrow pierces its liver; like a bird rushing into a snare, not knowing it will cost him his life.",
      "links": "<a href='/AIV/20/9/18'>Prov. 9:18</a>",
      "comment": "The fatal consequence of moral failure highlights the seriousness of spiritual purity. The warning applies beyond the literal narrative."
    },
    {
      "pk": 2000724,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 24,
      "text": "Now, sons, listen to me, and pay attention to the words of my mouth.",
      "links": "<a href='/AIV/20/4/1'>Prov. 4:1</a>",
      "comment": "The father’s repeated admonition echoes the biblical pattern of generational transmission of faith and wisdom (cf. Deut. 6:7)."
    },
    {
      "pk": 2000725,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 25,
      "text": "Do not let your heart turn aside to her ways; do not stray into her paths.",
      "links": "",
      "comment": "Guarding the heart is central in scripture (Prov. 4:23), signifying the importance of inner transformation, not just external compliance."
    },
    {
      "pk": 2000726,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 26,
      "text": "For she has brought down many wounded; indeed, all her slain are a mighty army.",
      "links": "<a href='/AIV/20/6/26'>Prov. 6:26</a>",
      "comment": "Many have fallen to temptation, emphasizing the universality of the struggle with sin and the need for steadfastness in true worship and discipline."
    },
    {
      "pk": 2000727,
      "translation": "AIV",
      "book": 20,
      "chapter": 7,
      "verse": 27,
      "text": "Her house is the way to Sheol, going down to the chambers of death.",
      "links": "<a href='/AIV/20/2/18-19'>Prov. 2:18-19</a>; <a href='/AIV/20/5/5'>Prov. 5:5</a>",
      "comment": "The 'way to Sheol' is a symbol of spiritual death. The ultimate consequence of unrepented sin is separation from God—a sobering call to repentance and right relationship through faith and sacrament."
    }
  ],
  "translatedAt": "2025-12-23T05:55:55.658Z"
}