{
  "book": "Proverbs",
  "bookAbbreviation": "Prov",
  "chapter": 6,
  "verses": [
    {
      "pk": 2006001,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 1,
      "text": "My son, if you have become surety for your neighbor, if you have given your pledge for a stranger,",
      "links": "<a href='/AIV/20/11/15'>Prov. 11:15</a>; <a href='/AIV/20/17/18'>Prov. 17:18</a>",
      "comment": "The warning here is about making unwise financial commitments on behalf of others, a theme repeated throughout Proverbs."
    },
    {
      "pk": 2006002,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 2,
      "text": "if you are trapped by the words of your mouth, caught by the words of your mouth,",
      "links": "<a href='/AIV/20/12/13'>Prov. 12:13</a>",
      "comment": "Being ensnared by your own speech underscores the seriousness of making rash promises or oaths."
    },
    {
      "pk": 2006003,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 3,
      "text": "then do this, my son, and save yourself, for you have come into the hand of your neighbor: Go, hurry, and plead earnestly with your neighbor.",
      "links": "<a href='/AIV/20/27/13'>Prov. 27:13</a>",
      "comment": "Urgency is advised in seeking release from foolish or hasty agreements, a principle of humility and prudence."
    },
    {
      "pk": 2006004,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 4,
      "text": "Do not give sleep to your eyes or slumber to your eyelids;",
      "links": "<a href='/AIV/19/132/4'>Ps. 132:4</a>",
      "comment": "A call not to delay in addressing the error, emphasizing diligence and responsibility."
    },
    {
      "pk": 2006005,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 5,
      "text": "save yourself like a gazelle from the hunter’s hand, like a bird from the hand of the fowler.",
      "links": "<a href='/AIV/19/124/7'>Ps. 124:7</a>",
      "comment": "This imagery of escape underscores the danger of foolish binding and the wisdom of seeking freedom from it."
    },
    {
      "pk": 2006006,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 6,
      "text": "Go to the ant, you sluggard; consider its ways, and be wise.",
      "links": "<a href='/AIV/20/30/25'>Prov. 30:25</a>",
      "comment": "The ant as a model of diligence and foresight calls to mind Christ’s parables of stewardship (see <a href='/AIV/42/12/42-48'>Luke 12:42-48</a>)."
    },
    {
      "pk": 2006007,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 7,
      "text": "It has no chief, officer, or ruler,",
      "links": "",
      "comment": "The ant works industriously without needing external supervision—implying virtue comes from within and is sustained by habit."
    },
    {
      "pk": 2006008,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 8,
      "text": "yet it prepares its food in the summer and gathers its provision at harvest.",
      "links": "<a href='/AIV/20/10/5'>Prov. 10:5</a>",
      "comment": "Spiritual application: Just as the ant prepares for the future, Christians are called to prepare for eternal life through continual conversion of heart and sacrificial acts."
    },
    {
      "pk": 2006009,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 9,
      "text": "How long will you lie there, O sluggard? When will you arise from your sleep?",
      "links": "<a href='/AIV/45/13/11'>Rom. 13:11</a>",
      "comment": "A wake-up call, paralleling Paul’s exhortation to awaken from spiritual slumber and live in the light of Christ."
    },
    {
      "pk": 2006010,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 10,
      "text": "A little sleep, a little slumber, a little folding of the hands to rest—",
      "links": "<a href='/AIV/20/24/33'>Prov. 24:33</a>",
      "comment": "A repeated proverb, warning of the gradual dangers of habitual laziness."
    },
    {
      "pk": 2006011,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 11,
      "text": "and poverty will come upon you like a robber, and want like an armed man.",
      "links": "",
      "comment": "The suddenness of ruin is the result of persistent neglect; spiritually, sloth endangers the soul (cf. <a href='/AIV/40/25/26-30'>Matt. 25:26-30</a>)."
    },
    {
      "pk": 2006012,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 12,
      "text": "A worthless person, a wicked man, goes about with crooked speech,",
      "links": "<a href='/AIV/20/2/12-15'>Prov. 2:12-15</a>",
      "comment": "The Hebrew word for 'worthless' is related to 'Belial,' denoting utter wickedness—frequently encountered in the wisdom literature."
    },
    {
      "pk": 2006013,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 13,
      "text": "he winks with his eyes, signals with his feet, points with his fingers,",
      "links": "",
      "comment": "Nonverbal cues used deceptively—an early depiction of how sin pervades both words and actions."
    },
    {
      "pk": 2006014,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 14,
      "text": "with perversity in his heart he devises evil, continually sowing discord.",
      "links": "<a href='/AIV/20/16/28'>Prov. 16:28</a>",
      "comment": "Discord is seen as an abomination; Christ’s call is to unity—hinting at one faith, one communion (see <a href='/AIV/43/17/21'>John 17:21</a>)."
    },
    {
      "pk": 2006015,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 15,
      "text": "Therefore calamity will suddenly come upon him; in a moment he will be broken beyond healing.",
      "links": "",
      "comment": "Divine justice falls swiftly on the evildoer, a warning mirrored throughout Scripture."
    },
    {
      "pk": 2006016,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 16,
      "text": "There are six things the LORD hates, seven that are detestable to him:",
      "links": "<a href='/AIV/20/30/15-31'>Prov. 30:15-31</a>",
      "comment": "A literary device—'six, even seven'—intensifies the solemnity of this list."
    },
    {
      "pk": 2006017,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 17,
      "text": "arrogant eyes, a lying tongue, hands that shed innocent blood,",
      "links": "<a href='/AIV/20/16/5'>Prov. 16:5</a>",
      "comment": "Echoes of the sixth commandment and the emphasis on humility and truth."
    },
    {
      "pk": 2006018,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 18,
      "text": "a heart that devises wicked plans, feet that are quick to run to evil,",
      "links": "",
      "comment": "Sin begins in the heart and moves outward, reminding that internal conversion is necessary, not merely exterior observance."
    },
    {
      "pk": 2006019,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 19,
      "text": "a false witness who breathes out lies, and one who sows discord among brothers.",
      "links": "<a href='/AIV/19/133/1'>Ps. 133:1</a>",
      "comment": "Unity among believers is precious in the eyes of the Lord, a foretaste of the unity willed by the Lord for His followers."
    },
    {
      "pk": 2006020,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 20,
      "text": "My son, keep your father's commandment, and do not forsake your mother's teaching.",
      "links": "<a href='/AIV/20/1/8'>Prov. 1:8</a>; <a href='/AIV/49/6/2'>Eph. 6:2</a>",
      "comment": "Respect for parental instruction points to the wider theme of authority and tradition, foundational for maintaining right belief."
    },
    {
      "pk": 2006021,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 21,
      "text": "Bind them on your heart always; tie them around your neck.",
      "links": "<a href='/AIV/20/3/3'>Prov. 3:3</a>",
      "comment": "Visual metaphor for internalizing God's law, reminiscent of biblical passages where physical reminders symbolize spiritual realities (cf. <a href='/AIV/5/6/8'>Deut. 6:8</a>)."
    },
    {
      "pk": 2006022,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 22,
      "text": "When you walk, they will guide you; when you lie down, they will watch over you; and when you awake, they will speak to you.",
      "links": "<a href='/AIV/20/23/19'>Prov. 23:19</a>",
      "comment": "The formative power of tradition and right teaching, working constantly in the believer’s life."
    },
    {
      "pk": 2006023,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 23,
      "text": "For the commandment is a lamp and teaching a light, and the reproofs of discipline are the way of life,",
      "links": "<a href='/AIV/19/119/105'>Ps. 119:105</a>",
      "comment": "'Lamp' and 'light'—symbols of divine wisdom, as Jesus Himself is the true light (cf. <a href='/AIV/43/8/12'>John 8:12</a>)."
    },
    {
      "pk": 2006024,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 24,
      "text": "to preserve you from the evil woman, from the smooth tongue of the adulteress.",
      "links": "<a href='/AIV/20/2/16-19'>Prov. 2:16-19</a>",
      "comment": "Adultery is here both literal and a symbol for unfaithfulness in religion—paralleling Old Testament imagery for spiritual infidelity."
    },
    {
      "pk": 2006025,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 25,
      "text": "Do not desire her beauty in your heart, nor let her capture you with her eyelashes;",
      "links": "<a href='/AIV/20/7/21'>Prov. 7:21</a>",
      "comment": "Warning that sin begins internally—desires must be purified, not merely actions restrained. This prefigures Christ’s teaching in <a href='/AIV/40/5/28'>Matt. 5:28</a>."
    },
    {
      "pk": 2006026,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 26,
      "text": "for the price of a prostitute is only a loaf of bread, but a married woman hunts down a precious life.",
      "links": "<a href='/AIV/20/7/26'>Prov. 7:26</a>",
      "comment": "Foolishness in matters of chastity leads to greater ruin; allusions to the pricelessness of the soul."
    },
    {
      "pk": 2006027,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 27,
      "text": "Can a man carry fire in his lap and his clothes not be burned?",
      "links": "<a href='/AIV/20/26/18-19'>Prov. 26:18-19</a>",
      "comment": "Sin’s consequences are inevitable, just as natural law brings inevitable results."
    },
    {
      "pk": 2006028,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 28,
      "text": "Or can a man walk on hot coals and his feet not be scorched?",
      "links": "",
      "comment": "Another image of unavoidable consequences, foreshadowing the New Testament warnings about spiritual danger."
    },
    {
      "pk": 2006029,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 29,
      "text": "So he who goes in to his neighbor's wife; none who touches her will go unpunished.",
      "links": "<a href='/AIV/20/5/8-11'>Prov. 5:8-11</a>",
      "comment": "Justice is assured for offenses against the sanctity of marriage—seen as a covenant pointing to Christ’s union with His people (<a href='/AIV/49/5/32'>Eph. 5:32</a>)."
    },
    {
      "pk": 2006030,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 30,
      "text": "People do not despise a thief if he steals to satisfy his hunger when he is starving,",
      "links": "<a href='/AIV/2/22/1-4'>Ex. 22:1-4</a>",
      "comment": "Distinguishes offenses of desperation from those motivated by lust or malice."
    },
    {
      "pk": 2006031,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 31,
      "text": "but if he is caught, he must repay sevenfold; he must give all the goods of his house.",
      "links": "",
      "comment": "Even necessity does not erase the obligation to make restitution—justice and mercy work together."
    },
    {
      "pk": 2006032,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 32,
      "text": "He who commits adultery with a woman lacks sense; he who does it destroys himself.",
      "links": "",
      "comment": "The spiritual death accompanying adultery is highlighted—holiness is necessary for seeing God (<a href='/AIV/58/12/14'>Heb. 12:14</a>)."
    },
    {
      "pk": 2006033,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 33,
      "text": "He will get wounds and dishonor, and his disgrace will not be wiped away.",
      "links": "",
      "comment": "Earthly consequences of sin persist; the gravity of certain sins is underlined."
    },
    {
      "pk": 2006034,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 34,
      "text": "For jealousy enrages a man, and he will show no mercy in the day of vengeance.",
      "links": "",
      "comment": "A human parallel to God’s jealous love for His people—righteous zeal for the sanctity of covenant."
    },
    {
      "pk": 2006035,
      "translation": "AIV",
      "book": 20,
      "chapter": 6,
      "verse": 35,
      "text": "He will not accept any compensation, nor will he be appeased, though you offer him many gifts.",
      "links": "",
      "comment": "Some breaches cannot be healed with earthly payment; only true repentance and reconciliation of hearts bring restoration. This is why sins wound not only man, but also require the divine remedy offered by Christ."
    }
  ],
  "translatedAt": "2025-12-23T05:55:26.321Z"
}