{
  "book": "Proverbs",
  "bookAbbreviation": "Prov",
  "chapter": 29,
  "verses": [
    {
      "pk": 2902901,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 1,
      "text": "A man often reproved but hardens his neck will suddenly be broken, and beyond healing.",
      "links": "<a href='/ESV/20/6/15'>Prov. 6:15</a>; <a href='/ESV/10/12/9-10'>2 Sam. 12:9–10</a>",
      "comment": "This verse is a warning to those who persistently reject correction. The imagery of a stiff neck echoes Old Testament references to stubbornness (Ex. 32:9). Brokenness 'beyond healing' highlights the serious consequences of spiritual pride and the importance of obeying correction, hinting at the need for humility and penance."
    },
    {
      "pk": 2902902,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 2,
      "text": "When the righteous are in authority, the people rejoice; but when the wicked rule, the people groan.",
      "links": "<a href='/ESV/20/28/12'>Prov. 28:12</a>; <a href='/ESV/19/58/2'>Ps. 58:2</a>",
      "comment": "Contrasts the joy under righteous leadership versus sorrow under wicked rulers. Leadership affects the peace and flourishing of a community, suggesting the importance of just governance, echoed throughout scripture."
    },
    {
      "pk": 2902903,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 3,
      "text": "Whoever loves wisdom brings joy to his father, but a companion of prostitutes squanders wealth.",
      "links": "<a href='/ESV/20/10/1'>Prov. 10:1</a>; <a href='/ESV/20/5/8-10'>Prov. 5:8–10</a>",
      "comment": "Wisdom leads to familial blessing, while moral failure leads to ruin. The contrast teaches about virtue and consequences, interpreting wisdom as a way of life that upholds God’s will and preserves what God provides, a pattern seen throughout biblical instruction."
    },
    {
      "pk": 2902904,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 4,
      "text": "By justice, a king builds up the land; but he who takes bribes tears it down.",
      "links": "<a href='/ESV/20/16/12'>Prov. 16:12</a>; <a href='/ESV/23/1/23'>Isa. 1:23</a>",
      "comment": "Righteous governance is key to a nation’s stability. The condemnation of bribery aligns with wider biblical teaching on justice and social order."
    },
    {
      "pk": 2902905,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 5,
      "text": "A man who flatters his neighbor spreads a net for his own feet.",
      "links": "<a href='/ESV/20/26/28'>Prov. 26:28</a>; <a href='/ESV/19/55/21'>Ps. 55:21</a>",
      "comment": "Warning against insincere praise. Flattery can be manipulative and ultimately self-destructive, showing the biblical preference for truthfulness."
    },
    {
      "pk": 2902906,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 6,
      "text": "An evil man is ensnared by his own sin, but a righteous man sings and rejoices.",
      "links": "<a href='/ESV/20/11/5-6'>Prov. 11:5–6</a>; <a href='/ESV/19/32/11'>Ps. 32:11</a>",
      "comment": "Wickedness entraps, while righteousness brings freedom and joy. The spiritual interpretation points to the liberation found in living according to God's law."
    },
    {
      "pk": 2902907,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 7,
      "text": "The righteous care about the rights of the poor, but the wicked have no understanding.",
      "links": "<a href='/ESV/20/21/13'>Prov. 21:13</a>; <a href='/ESV/23/10/2'>Isa. 10:2</a>",
      "comment": "Highlights the social conscience of the righteous. Defending the vulnerable is a theme throughout Scripture, and taking concrete action to help those in need showcases a living faith."
    },
    {
      "pk": 2902908,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 8,
      "text": "Scoffers set a city aflame, but the wise turn away anger.",
      "links": "<a href='/ESV/20/15/1'>Prov. 15:1</a>; <a href='/ESV/20/16/14'>Prov. 16:14</a>",
      "comment": "Mockers provoke conflict; the wise pursue peace. The wisdom tradition here calls believers to be peacemakers, connecting to Christ’s teaching in Matthew 5:9."
    },
    {
      "pk": 2902909,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 9,
      "text": "If a wise man contends with a foolish man, the fool rages or laughs, and there is no peace.",
      "links": "<a href='/ESV/20/23/9'>Prov. 23:9</a>",
      "comment": "Speaks to the futility of arguing with those unwilling to listen. Spiritual discernment is needed in choosing when to engage."
    },
    {
      "pk": 2902910,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 10,
      "text": "Bloodthirsty men hate one who is blameless and seek the life of the upright.",
      "links": "<a href='/ESV/19/37/12-14'>Ps. 37:12–14</a>; <a href='/ESV/40/23/34-35'>Matt. 23:34–35</a>",
      "comment": "Echoes the perennial conflict between wicked and righteous, foreshadowing the persecution of saints throughout salvation history and the ultimate victory of the innocent."
    },
    {
      "pk": 2902911,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 11,
      "text": "A fool gives full vent to his spirit, but a wise man quietly holds it back.",
      "links": "<a href='/ESV/20/14/29'>Prov. 14:29</a>; <a href='/ESV/59/1/19'>James 1:19</a>",
      "comment": "Self-control is a mark of wisdom. This theme finds fulfillment in the New Testament's exhortations to temperance, a key virtue in the Christian life."
    },
    {
      "pk": 2902912,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 12,
      "text": "If a ruler listens to lies, all his officials become wicked.",
      "links": "<a href='/ESV/20/16/12'>Prov. 16:12</a>; <a href='/ESV/20/29/4'>Prov. 29:4</a>",
      "comment": "Corruption spreads from the top down. This highlights the ripple effect of leadership, linking responsibilities of authority to the broader community."
    },
    {
      "pk": 2902913,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 13,
      "text": "The poor man and the oppressor have this in common: the Lord gives light to the eyes of both.",
      "links": "<a href='/ESV/20/22/2'>Prov. 22:2</a>; <a href='/ESV/19/145/9'>Ps. 145:9</a>",
      "comment": "Emphasizes God’s sovereignty over all humanity, rich or poor. God’s grace is available to everyone, an underlying principle in both Old and New Testament."
    },
    {
      "pk": 2902914,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 14,
      "text": "If a king judges the poor faithfully, his throne will be established forever.",
      "links": "<a href='/ESV/20/20/28'>Prov. 20:28</a>; <a href='/ESV/19/72/2-4'>Ps. 72:2–4</a>",
      "comment": "True authority is strengthened by justice, especially towards the poor. The everlasting throne subtly alludes to Davidic kingship and, ultimately, Christ's eternal reign (Luke 1:33)."
    },
    {
      "pk": 2902915,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 15,
      "text": "The rod and reproof give wisdom, but a child left to himself brings shame to his mother.",
      "links": "<a href='/ESV/20/13/24'>Prov. 13:24</a>; <a href='/ESV/20/19/18'>Prov. 19:18</a>",
      "comment": "Traditional discipline imparts wisdom. The importance of formative instruction is a key theme in Proverbs, connecting to spiritual guidance in the Church."
    },
    {
      "pk": 2902916,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 16,
      "text": "When the wicked increase, transgression increases, but the righteous will see their fall.",
      "links": "<a href='/ESV/19/37/34'>Ps. 37:34</a>; <a href='/ESV/20/28/12'>Prov. 28:12</a>",
      "comment": "Evil may flourish for a time, but God's justice prevails. The righteous, preserved through divine promise, witness the downfall of wickedness."
    },
    {
      "pk": 2902917,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 17,
      "text": "Discipline your son, and he will give you rest; he will give delight to your heart.",
      "links": "<a href='/ESV/20/22/6'>Prov. 22:6</a>; <a href='/ESV/20/23/24'>Prov. 23:24</a>",
      "comment": "Proper upbringing results in generational blessing, an echo of God’s promise to those who are faithful within the family covenant."
    },
    {
      "pk": 2902918,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 18,
      "text": "Where there is no vision, the people cast off restraint; but blessed is he who keeps the law.",
      "links": "<a href='/ESV/20/28/9'>Prov. 28:9</a>; <a href='/ESV/19/1/2'>Ps. 1:2</a>",
      "comment": "'Vision' can mean prophetic revelation or divine guidance. The need for clear spiritual direction foreshadows the centrality of the Church’s teaching and the necessity to remain within divinely instituted tradition."
    },
    {
      "pk": 2902919,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 19,
      "text": "A servant is not corrected by mere words; though he understands, he will not respond.",
      "links": "<a href='/ESV/20/28/19'>Prov. 28:19</a>",
      "comment": "Correction sometimes needs discipline, not just instruction. This principle underscores the necessity of active leadership and the importance of action, as reflected in Church tradition."
    },
    {
      "pk": 2902920,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 20,
      "text": "Do you see a man who is hasty in his words? There is more hope for a fool than for him.",
      "links": "<a href='/ESV/20/26/12'>Prov. 26:12</a>; <a href='/ESV/59/1/19'>James 1:19</a>",
      "comment": "Impulsive speech is dangerous, pointing toward the deeper wisdom of silence and reflection. James 1:19 reaffirms this in the New Testament."
    },
    {
      "pk": 2902921,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 21,
      "text": "If you pamper your servant from youth, in the end he will become your heir.",
      "links": "<a href='/ESV/20/17/2'>Prov. 17:2</a>",
      "comment": "A servant overly indulged may act as a son, highlighting dynamics of authority and inheritance seen in biblical tradition."
    },
    {
      "pk": 2902922,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 22,
      "text": "An angry man stirs up conflict, and a hot-tempered man commits many transgressions.",
      "links": "<a href='/ESV/20/15/18'>Prov. 15:18</a>; <a href='/ESV/20/22/24-25'>Prov. 22:24–25</a>",
      "comment": "Anger leads to sin. True peace comes from submission to God’s will and practicing active charity."
    },
    {
      "pk": 2902923,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 23,
      "text": "A man's pride will bring him low, but he who is humble in spirit will obtain honor.",
      "links": "<a href='/ESV/20/16/18-19'>Prov. 16:18–19</a>; <a href='/ESV/40/23/12'>Matt. 23:12</a>",
      "comment": "Humility is a path to God’s favor, a theme echoed in Christ’s own teachings (Matt. 23:12) regarding exalting the humble and humbling the proud."
    },
    {
      "pk": 2902924,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 24,
      "text": "Whoever shares with a thief hates his own life; he hears the curse but does not confess.",
      "links": "<a href='/ESV/20/18/2'>Prov. 18:2</a>; <a href='/ESV/20/28/13'>Prov. 28:13</a>",
      "comment": "Complicity in evil implicates oneself. Silence when a curse is pronounced evidences guilt, recalling James 5:16’s stress on confession for forgiveness."
    },
    {
      "pk": 2902925,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 25,
      "text": "The fear of man lays a snare, but whoever trusts in the Lord is safe.",
      "links": "<a href='/ESV/19/56/3-4'>Ps. 56:3–4</a>; <a href='/ESV/20/18/10'>Prov. 18:10</a>",
      "comment": "Putting trust in God rather than fearing others is a repeated theme. Ultimate safety comes through divine protection."
    },
    {
      "pk": 2902926,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 26,
      "text": "Many seek the face of a ruler, but justice comes from the Lord.",
      "links": "<a href='/ESV/20/21/1'>Prov. 21:1</a>; <a href='/ESV/19/75/7'>Ps. 75:7</a>",
      "comment": "Human appeals are common, but true justice proceeds from the Lord alone. This links to the centrality of God’s authority and the divine foundation of judgment."
    },
    {
      "pk": 2902927,
      "translation": "AIV",
      "book": 20,
      "chapter": 29,
      "verse": 27,
      "text": "An unjust man is detestable to the righteous, and he who is upright in the way is detestable to the wicked.",
      "links": "<a href='/ESV/20/29/10'>Prov. 29:10</a>; <a href='/ESV/19/101/3'>Ps. 101:3</a>",
      "comment": "Shows the irreconcilable opposition between the godly and the ungodly. This foreshadows the eternal separation described in Matthew 25:46."
    }
  ],
  "translatedAt": "2025-12-23T06:06:47.602Z"
}