{
  "book": "Proverbs",
  "bookAbbreviation": "Prov",
  "chapter": 28,
  "verses": [
    {
      "pk": 2802801,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 1,
      "text": "The wicked flee when no one pursues, but the righteous are as bold as a lion.",
      "links": "<a href='/AIV/3/26/17'>Lev. 26:17</a>; <a href='/AIV/19/27/1'>Ps. 27:1</a>",
      "comment": "The contrast here between fearfulness and boldness points to the strength that comes from righteousness rooted in God. Righteousness leads to confident action, reminiscent of the apostles' boldness after the resurrection (Acts 4:13)."
    },
    {
      "pk": 2802802,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 2,
      "text": "When a land transgresses, it has many rulers; but with a man of understanding and knowledge, its order endures.",
      "links": "<a href='/AIV/20/11/14'>Prov. 11:14</a>; <a href='/AIV/23/3/4'>Isa. 3:4</a>",
      "comment": "Moral decay brings instability, but wise leadership brings order. This anticipates the importance placed on shepherds and good teaching authority throughout Scripture (Jer. 3:15; Heb. 13:17)."
    },
    {
      "pk": 2802803,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 3,
      "text": "A poor man who oppresses the poor is a sweeping rain that leaves no food.",
      "links": "<a href='/AIV/20/22/16'>Prov. 22:16</a>; <a href='/AIV/20/14/31'>Prov. 14:31</a>",
      "comment": "Even the poor are capable of injustice, highlighting the universality of sin. The image signifies destruction; even those who suffer can bring harm when lacking virtue."
    },
    {
      "pk": 2802804,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 4,
      "text": "Those who forsake the law praise the wicked, but those who keep the law strive against them.",
      "links": "<a href='/AIV/19/94/16'>Ps. 94:16</a>; <a href='/AIV/20/29/27'>Prov. 29:27</a>",
      "comment": "Allegiance to God’s law creates conflict with wickedness. Echoes spiritual warfare seen throughout the New Testament (Eph. 6:12)."
    },
    {
      "pk": 2802805,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 5,
      "text": "Evil men do not understand justice, but those who seek the LORD understand it completely.",
      "links": "<a href='/AIV/20/2/6-9'>Prov. 2:6-9</a>; <a href='/AIV/19/25/14'>Ps. 25:14</a>",
      "comment": "Justice is not merely intellectual, but the fruit of relationship with God. True understanding requires seeking the LORD, a theme consistent with the entire spiritual tradition."
    },
    {
      "pk": 2802806,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 6,
      "text": "Better is a poor man who walks in his integrity than a rich man who is crooked in his ways.",
      "links": "<a href='/AIV/20/19/1'>Prov. 19:1</a>; <a href='/AIV/20/28/18'>Prov. 28:18</a>",
      "comment": "Moral integrity is more valuable than wealth. This sets the stage for Christ’s teaching regarding the danger of riches (Mark 10:23–25)."
    },
    {
      "pk": 2802807,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 7,
      "text": "Whoever keeps the law is a wise son, but a companion of gluttons shames his father.",
      "links": "<a href='/AIV/20/29/3'>Prov. 29:3</a>; <a href='/AIV/20/13/20'>Prov. 13:20</a>",
      "comment": "Emphasizes the role of choices and companions. Keeping the law corresponds to wisdom, especially in family and community."
    },
    {
      "pk": 2802808,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 8,
      "text": "Whoever increases his wealth by interest and unjust gain gathers it for him who is generous to the poor.",
      "links": "<a href='/AIV/19/112/9'>Ps. 112:9</a>; <a href='/AIV/20/13/22'>Prov. 13:22</a>",
      "comment": "Unjust gain will ultimately serve the righteous. There is a reversal here much like that seen in the Magnificat (Luke 1:52–53)."
    },
    {
      "pk": 2802809,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 9,
      "text": "If one turns away his ear from hearing the law, even his prayer is an abomination.",
      "links": "<a href='/AIV/19/66/18'>Ps. 66:18</a>; <a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "Obedience is a prerequisite for pleasing prayer. This aligns with calls to repentance in both Old and New Testaments (James 5:16)."
    },
    {
      "pk": 2802810,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 10,
      "text": "Whoever leads the upright astray on an evil path will fall into his own pit, but the blameless will inherit good things.",
      "links": "<a href='/AIV/19/7/15'>Ps. 7:15</a>; <a href='/AIV/20/26/27'>Prov. 26:27</a>",
      "comment": "The downfall of tempters is a persistent Scriptural theme (Matt. 18:6). The inheritance anticipates spiritual blessings promised the righteous."
    },
    {
      "pk": 2802811,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 11,
      "text": "A rich man is wise in his own eyes, but a poor man who has understanding will see through him.",
      "links": "<a href='/AIV/20/26/12'>Prov. 26:12</a>; <a href='/AIV/20/18/11'>Prov. 18:11</a>",
      "comment": "The text subtly warns against pride that comes from wealth. True wisdom is not dependent on status, mirroring the virtues Christ praises."
    },
    {
      "pk": 2802812,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 12,
      "text": "When the righteous triumph, there is great glory; but when the wicked rise, people hide themselves.",
      "links": "<a href='/AIV/20/28/28'>Prov. 28:28</a>; <a href='/AIV/20/11/10'>Prov. 11:10</a>",
      "comment": "Society flourishes under the righteous, while tyranny leads to fear. Points to the call for godly leadership in the Church (1 Tim. 3:1-7)."
    },
    {
      "pk": 2802813,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 13,
      "text": "Whoever conceals his sins will not prosper, but he who confesses and forsakes them will obtain mercy.",
      "links": "<a href='/AIV/19/32/3-5'>Ps. 32:3-5</a>; <a href='/AIV/62/1/9'>1 Jn. 1:9</a>",
      "comment": "Confession and repentance are required for mercy. In the New Testament, confession takes on a communal and sacramental form (John 20:23; James 5:16)."
    },
    {
      "pk": 2802814,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 14,
      "text": "Blessed is the one who always fears, but whoever hardens his heart will fall into disaster.",
      "links": "<a href='/AIV/58/3/12-13'>Heb. 3:12-13</a>; <a href='/AIV/2/4/21'>Ex. 4:21</a>",
      "comment": "‘Fear’ here connotes reverence, not terror. Hardness of heart is repeatedly condemned throughout the Bible, often indicating refusal to believe or obey."
    },
    {
      "pk": 2802815,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 15,
      "text": "Like a roaring lion or a charging bear is a wicked ruler over a poor people.",
      "links": "<a href='/AIV/20/19/12'>Prov. 19:12</a>; <a href='/AIV/20/28/3'>Prov. 28:3</a>",
      "comment": "The imagery underscores the destructive force of unjust leadership. Spiritual application can be made to bad shepherds (John 10:12-13)."
    },
    {
      "pk": 2802816,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 16,
      "text": "A ruler who lacks understanding is a cruel oppressor, but one who hates unjust gain will prolong his days.",
      "links": "<a href='/AIV/2/18/21'>Ex. 18:21</a>; <a href='/AIV/20/29/2'>Prov. 29:2</a>",
      "comment": "Moral integrity in leadership benefits society. This anticipates the requirement of upright overseers within the New Testament model for the church (Titus 1:7)."
    },
    {
      "pk": 2802817,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 17,
      "text": "If a man is burdened with the guilt of bloodshed, let him be a fugitive till death; let no one support him.",
      "links": "<a href='/AIV/1/4/11-12'>Gen. 4:11-12</a>; <a href='/AIV/4/35/31'>Num. 35:31</a>",
      "comment": "Serious sin has grave consequences and cannot be ignored. This prefigures the seriousness with which the apostolic tradition deals with grave public sin (1 Cor. 5:13)."
    },
    {
      "pk": 2802818,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 18,
      "text": "Whoever walks in integrity will be delivered, but he who is crooked in his ways will suddenly fall.",
      "links": "<a href='/AIV/20/10/9'>Prov. 10:9</a>; <a href='/AIV/20/28/6'>Prov. 28:6</a>",
      "comment": "Deliverance is tied to uprightness. This is a recurring idea, emphasizing both moral and spiritual consequences of integrity."
    },
    {
      "pk": 2802819,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 19,
      "text": "Whoever works his land will have plenty of bread, but he who follows worthless pursuits will have plenty of poverty.",
      "links": "<a href='/AIV/20/12/11'>Prov. 12:11</a>; <a href='/AIV/20/13/4'>Prov. 13:4</a>",
      "comment": "Diligence in honest work is extolled, while idleness leads to ruin. This echoes principles taught in Paul’s epistles (2 Thess. 3:10)."
    },
    {
      "pk": 2802820,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 20,
      "text": "A faithful man will abound with blessings, but whoever hastens to be rich will not go unpunished.",
      "links": "<a href='/AIV/20/28/22'>Prov. 28:22</a>; <a href='/AIV/20/13/11'>Prov. 13:11</a>",
      "comment": "Faithfulness, not the pursuit of riches, leads to true blessing. There’s a warning against greed here echoed by Jesus (Luke 12:15)."
    },
    {
      "pk": 2802821,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 21,
      "text": "To show partiality is not good; yet for a piece of bread a man will do wrong.",
      "links": "<a href='/AIV/20/24/23'>Prov. 24:23</a>; <a href='/AIV/59/2/1'>Jas. 2:1</a>",
      "comment": "Impartiality is a command in both Old and New Testaments; even small temptations can lead to sin if unguarded."
    },
    {
      "pk": 2802822,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 22,
      "text": "A man with an evil eye hastens after wealth and does not know that poverty will come upon him.",
      "links": "<a href='/AIV/20/28/20'>Prov. 28:20</a>; <a href='/AIV/20/23/4-5'>Prov. 23:4–5</a>",
      "comment": "Greed blinds, ensuring its own punishment. The Lord’s warnings about riches and the necessity of generosity are echoed here."
    },
    {
      "pk": 2802823,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 23,
      "text": "Whoever rebukes a man will afterward find more favor than he who flatters with his tongue.",
      "links": "<a href='/AIV/20/27/5-6'>Prov. 27:5-6</a>; <a href='/AIV/48/6/1'>Gal. 6:1</a>",
      "comment": "Loving correction is ultimately more beneficial than empty flattery, foreshadowing the Christian practice of admonishing one another in love."
    },
    {
      "pk": 2802824,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 24,
      "text": "Whoever robs his father or mother and says, 'It’s no transgression,' is companion to a destroyer.",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/41/7/10-11'>Mark 7:10-11</a>",
      "comment": "Dishonoring parents is condemned as tantamount to wickedness. Jesus reiterates the importance of honoring parents in His teaching."
    },
    {
      "pk": 2802825,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 25,
      "text": "A greedy man stirs up strife, but whoever trusts in the LORD will prosper.",
      "links": "<a href='/AIV/20/16/28'>Prov. 16:28</a>; <a href='/AIV/19/1/3'>Ps. 1:3</a>",
      "comment": "Selfishness divides, while trust in God brings blessing. This is a theme picked up by Jesus in the Sermon on the Mount (Matt. 6:33)."
    },
    {
      "pk": 2802826,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 26,
      "text": "Whoever trusts in his own heart is a fool, but whoever walks in wisdom will be delivered.",
      "links": "<a href='/AIV/20/3/5'>Prov. 3:5</a>; <a href='/AIV/24/17/9'>Jer. 17:9</a>",
      "comment": "Trusting oneself above all is folly—a call towards humility and the wisdom handed down through sound doctrine and faithful teaching."
    },
    {
      "pk": 2802827,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 27,
      "text": "Whoever gives to the poor will not lack, but he who hides his eyes will receive many curses.",
      "links": "<a href='/AIV/19/112/9'>Ps. 112:9</a>; <a href='/AIV/40/25/40'>Matt. 25:40</a>",
      "comment": "Generosity is rewarded, a command that runs throughout both Testaments and closely connected to the teaching of Christ about service and charity."
    },
    {
      "pk": 2802828,
      "translation": "AIV",
      "book": 20,
      "chapter": 28,
      "verse": 28,
      "text": "When the wicked rise, people hide themselves; but when they perish, the righteous increase.",
      "links": "<a href='/AIV/20/28/12'>Prov. 28:12</a>; <a href='/AIV/20/11/10'>Prov. 11:10</a>",
      "comment": "History shows that the flourishing of the righteous follows the removal of corrupt rule. This finds spiritual fulfillment in Christ’s Kingship and the growth of His kingdom on earth."
    }
  ],
  "translatedAt": "2025-12-23T06:06:20.088Z"
}