{
  "book": 15,
  "bookName": "Ezra",
  "bookAbbreviation": "Ezra",
  "chapter": 9,
  "verses": [
    {
      "pk": 15009001,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 1,
      "text": "After these things were completed, the leaders approached me and said, 'The people of Israel, the priests, and the Levites have not separated themselves from the peoples of the lands with their detestable practices, like those of the Canaanites, Hittites, Perizzites, Jebusites, Ammonites, Moabites, Egyptians, and Amorites.'",
      "links": "<a href='/AIV/2/34/16'>Deut. 7:1-6</a>; <a href='/AIV/15/6/21'>Ezra 6:21</a>; <a href='/AIV/16/13/3'>Neh. 13:3</a>",
      "comment": "The leaders report a failure of separation from pagan nations, touching both ritual purity and spiritual fidelity. The mention of priests and Levites indicates this is not just a lay issue, but involves those responsible for religious leadership, foreshadowing the importance of both individual and leadership holiness."
    },
    {
      "pk": 15009002,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 2,
      "text": "For they have taken some of their daughters as wives for themselves and their sons, so that the holy seed has mixed with the peoples of the lands. Indeed, the hand of the officials and leaders has been foremost in this unfaithfulness.",
      "links": "<a href='/AIV/1/6/2'>Gen. 6:2</a>; <a href='/AIV/2/34/16'>Deut. 7:3</a>; <a href='/AIV/16/13/23'>Neh. 13:23</a>",
      "comment": "Marriage covenants symbolize the joining or mingling of peoples. The phrase 'holy seed' emphasizes the special calling of God's people and the concern for spiritual purity, which prefigures the call to holiness for all who would become part of the redeemed people. The unfaithfulness of leaders stresses the gravity of proper spiritual authority."
    },
    {
      "pk": 15009003,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 3,
      "text": "When I heard this report, I tore my garment and my cloak, pulled hair from my head and beard, and sat appalled.",
      "links": "<a href='/AIV/18/1/20'>Job 1:20</a>; <a href='/AIV/16/13/25'>Neh. 13:25</a>",
      "comment": "Ezra’s physical acts of mourning (tearing garments, pulling hair) are traditional signs of deep grief and repentance. This response to communal sin underscores the responsibility of spiritual leaders to both intercede and model repentance."
    },
    {
      "pk": 15009004,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 4,
      "text": "Then everyone who trembled at the words of the God of Israel, because of the unfaithfulness of the exiles, gathered around me while I sat appalled until the evening sacrifice.",
      "links": "<a href='/AIV/23/66/2'>Isa. 66:2</a>; <a href='/AIV/19/119/120'>Ps. 119:120</a>",
      "comment": "The mention of the 'evening sacrifice' serves as a reference point for communal worship and atonement, signifying the importance of regular, liturgical prayer in uniting God's people in repentance."
    },
    {
      "pk": 15009005,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 5,
      "text": "At the time of the evening sacrifice, I rose from my self-abasement, with my garment and cloak torn, and I fell on my knees and spread out my hands to the Lord my God",
      "links": "<a href='/AIV/19/28/2'>Ps. 28:2</a>; <a href='/AIV/19/141/2'>Ps. 141:2</a>",
      "comment": "Ezra’s posture—kneeling with hands spread—is characteristic of deep supplication, reminiscent of priestly intercession, and hints at the significance of mediation on behalf of the people."
    },
    {
      "pk": 15009006,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 6,
      "text": "and said: 'O my God, I am ashamed and humiliated to lift up my face to you, my God, because our iniquities have risen higher than our heads, and our guilt has grown up to the heavens.'",
      "links": "<a href='/AIV/19/38/4'>Ps. 38:4</a>; <a href='/AIV/27/9/7-8'>Dan. 9:7-8</a>",
      "comment": "Ezra’s confession is collective—'our iniquities'—demonstrating the responsibility of the many for the sins of the community, an early foreshadowing of the power and necessity of united confession and penance."
    },
    {
      "pk": 15009007,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 7,
      "text": "'From the days of our ancestors until now, our guilt has been great; because of our iniquities, we, our kings, and our priests have been handed over to the sword, captivity, plunder, and shame, as it is this day.'",
      "links": "<a href='/AIV/27/9/8-12'>Dan. 9:8-12</a>; <a href='/AIV/14/36/16-17'>2 Chr. 36:16-17</a>",
      "comment": "Sin affects all levels of the covenant community—from the people to the monarchy to the priesthood. This shows the importance of spiritual continuity and historical memory for God’s people."
    },
    {
      "pk": 15009008,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 8,
      "text": "'But now, for a brief moment, favor has come from the Lord our God, to leave us a remnant and to give us a secure foothold in his holy place, so that our God may light our eyes and renew a little vigor in our slavery.'",
      "links": "<a href='/AIV/23/10/20-21'>Isa. 10:20-21</a>; <a href='/AIV/16/2/8'>Neh. 2:8</a>",
      "comment": "Despite great sin, God’s mercy leaves a remnant and reestablishes a 'secure place.' This foreshadows the abiding presence of the worshipping community and the role of worship spaces as centers of renewal; the 'light to our eyes' alludes to spiritual illumination and hope."
    },
    {
      "pk": 15009009,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 9,
      "text": "'For we are slaves; yet our God has not abandoned us in our slavery, but has extended steadfast love to us in the sight of the kings of Persia, to give us new life to rebuild the house of our God and repair its ruins, and to give us a wall in Judah and Jerusalem.'",
      "links": "<a href='/AIV/23/44/28'>Isa. 44:28</a>; <a href='/AIV/15/1/1-4'>Ezra 1:1-4</a>",
      "comment": "God’s love is shown even in perceived exile, emphasizing hope and restoration through temple worship and the protection of the community. The mention of a 'wall' has both literal (city protection) and spiritual (God as our protector) meanings."
    },
    {
      "pk": 15009010,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 10,
      "text": "'And now, our God, what shall we say after this? For we have forsaken the commandments'",
      "links": "<a href='/AIV/19/119/176'>Ps. 119:176</a>; <a href='/AIV/27/9/5-10'>Dan. 9:5-10</a>",
      "comment": "The theme of collective confession continues, and the acknowledgement of God’s law as the measure of right living prompts humility and ongoing conversion."
    },
    {
      "pk": 15009011,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 11,
      "text": "'which you commanded through your servants the prophets, saying: ‘The land which you are entering to possess is a land impure by the impurity of its peoples, by their abominations that have filled it from end to end with their uncleanness.’'",
      "links": "<a href='/AIV/2/7/3-5'>Deut. 7:3-5</a>; <a href='/AIV/3/18/24-30'>Lev. 18:24-30</a>",
      "comment": "God’s instructions come through His authorized messengers, highlighting respect for prophetic tradition and continuity of revelation."
    },
    {
      "pk": 15009012,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 12,
      "text": "'Therefore do not give your daughters to their sons or take their daughters for your sons; never seek their peace or prosperity, so that you may be strong and eat the good of the land and leave it as an inheritance to your children forever.'",
      "links": "<a href='/AIV/5/23/6'>Deut. 23:6</a>; <a href='/AIV/2/34/15-16'>Deut. 7:3-4</a>",
      "comment": "Strict separation is for spiritual preservation, to safeguard God's promises for future generations. The warning against intermarriage is not about ethnicity but about the spiritual dangers of idolatry infiltrating the community."
    },
    {
      "pk": 15009013,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 13,
      "text": "'After all that has come upon us for our evil deeds and our great guilt—since you, our God, have punished us less than our iniquities deserved and have given us such a remnant as this—'",
      "links": "<a href='/AIV/19/103/10'>Ps. 103:10</a>; <a href='/AIV/16/9/31'>Neh. 9:31</a>",
      "comment": "God’s mercy exceeds His judgment. Preservation of a 'remnant' shows divine faithfulness despite human unfaithfulness, which is foundational for understanding the Church as the ongoing remnant of God’s people."
    },
    {
      "pk": 15009014,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 14,
      "text": "'should we again break your commandments and intermarry with the peoples who practice these abominations? Would you not be angry with us until you had consumed us, so that there would be no remnant or survivor?'",
      "links": "<a href='/AIV/4/2/2'>Judg. 2:2</a>; <a href='/AIV/2/34/12-16'>Deut. 7:2-4</a>",
      "comment": "The rhetorical question stresses the gravity of presuming upon God’s mercy. The survival of a remnant depends on fidelity; this continuity and the theme of discipline and mercy prefigure later teachings about the necessity to adhere to apostolic doctrine and holy living."
    },
    {
      "pk": 15009015,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 9,
      "verse": 15,
      "text": "'O LORD, God of Israel, you are righteous, for we are left as a remnant that has escaped, as it is this day. Behold, we are before you in our guilt, for none can stand before you because of this.'",
      "links": "<a href='/AIV/19/130/3'>Ps. 130:3</a>; <a href='/AIV/45/3/23-26'>Rom. 3:23-26</a>",
      "comment": "Confession of God’s righteousness and the unworthiness of the people expresses the need for mercy—hinting at the idea of mediation and atonement. The corporate aspect of guilt here, and the hope for reliance on God’s mercy, foreshadows the New Testament revelation of Christ’s intercession and the continuity of God’s people through every age."
    }
  ],
  "translatedAt": "2025-12-24T04:45:07.646Z"
}