{
  "book": 15,
  "bookName": "Ezra",
  "bookAbbreviation": "Ezra",
  "chapter": 7,
  "verses": [
    {
      "pk": 15007001,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 1,
      "text": "After these events, during the reign of Artaxerxes king of Persia, Ezra son of Seraiah, son of Azariah, son of Hilkiah,",
      "links": "<a href='/AIV/15/2/2'>Ezra 2:2</a>; <a href='/AIV/16/7/7'>Neh. 7:7</a>",
      "comment": "A new phase begins with the introduction of Ezra, a direct priestly descendant. Artaxerxes here is most likely Artaxerxes I (465–424 BC)."
    },
    {
      "pk": 15007002,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 2,
      "text": "son of Shallum, son of Zadok, son of Ahitub,",
      "links": "<a href='/AIV/13/6/4-8'>1 Chr. 6:4–8</a>",
      "comment": "Ezra's lineage traces through the priestly line of Zadok, signifying spiritual authority and continuity with Israel's ancient worship."
    },
    {
      "pk": 15007003,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 3,
      "text": "son of Amariah, son of Azariah, son of Meraioth,",
      "links": "<a href='/AIV/13/6/7'>1 Chr. 6:7</a>",
      "comment": "This genealogy is detailed to highlight the continuity of God’s priestly promises from generation to generation."
    },
    {
      "pk": 15007004,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 4,
      "text": "son of Zerahiah, son of Uzzi, son of Bukki,",
      "links": "<a href='/AIV/13/6/5-6'>1 Chr. 6:5-6</a>",
      "comment": "Each name carries significance, anchoring Ezra within the legitimate line of temple servants."
    },
    {
      "pk": 15007005,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 5,
      "text": "son of Abishua, son of Phinehas, son of Eleazar, son of Aaron the chief priest—",
      "links": "<a href='/AIV/02/06/25'>Exod. 6:25</a>; <a href='/AIV/04/25/11'>Num. 25:11</a>",
      "comment": "Aaron, the first high priest, directly links Ezra to the foundational worship instituted by God. Priesthood is seen as something handed down, not self-appointed."
    },
    {
      "pk": 15007006,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 6,
      "text": "this Ezra went up from Babylon. He was a skilled scribe in the Law of Moses, which the LORD, the God of Israel, had given. The king granted him everything he requested, for the hand of the LORD his God was upon him.",
      "links": "<a href='/AIV/15/1/8'>Ezra 1:8</a>; <a href='/AIV/19/119/1'>Ps. 119:1</a>",
      "comment": "Ezra is presented as both scholar and priest. The hand of God affirms divine selection and gifting. This echoes God’s blessing on chosen leaders throughout salvation history."
    },
    {
      "pk": 15007007,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 7,
      "text": "Some of the Israelites, along with priests, Levites, singers, gatekeepers, and the temple servants, also went up to Jerusalem in the seventh year of King Artaxerxes.",
      "links": "<a href='/AIV/15/2/40-43'>Ezra 2:40-43</a>",
      "comment": "The restoration involves all parts of Israel’s worship—leadership, worship, and service. True worship includes hierarchy and various vocations united together."
    },
    {
      "pk": 15007008,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 8,
      "text": "Ezra arrived in Jerusalem in the fifth month, in the seventh year of the king.",
      "links": "<a href='/AIV/16/2/1'>Neh. 2:1</a>",
      "comment": "A precise date grounds the narrative in history. God’s salvific acts are always rooted in tangible reality."
    },
    {
      "pk": 15007009,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 9,
      "text": "On the first day of the first month, he began his journey from Babylon, and on the first day of the fifth month he arrived in Jerusalem, because the gracious hand of his God was upon him.",
      "links": "<a href='/AIV/15/8/31-32'>Ezra 8:31-32</a>",
      "comment": "Four months of travel show the dedication and cost of returning to God’s city. God’s providence guides His people’s journeys, echoing Israel’s exodus."
    },
    {
      "pk": 15007010,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 10,
      "text": "For Ezra had devoted himself to study the Law of the LORD, and to do it, and to teach its statutes and rules to Israel.",
      "links": "<a href='/AIV/15/10/3'>Ezra 10:3</a>; <a href='/AIV/05/6/7'>Deut. 6:7</a>",
      "comment": "Ezra models how teaching, living, and studying God’s law are interconnected—a pattern echoed when Christ appoints leaders to shepherd His people (cf. <a href='/AIV/43/21/15-17'>John 21:15-17</a>)."
    },
    {
      "pk": 15007011,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 11,
      "text": "This is a copy of the letter that King Artaxerxes gave to Ezra the priest and scribe, who was learned in the words of the commandments of the LORD and His statutes for Israel:",
      "links": "<a href='/AIV/15/4/11-16'>Ezra 4:11-16</a>",
      "comment": "Official royal authority is given to the scribe-priest. Sacred leadership has both spiritual and civil dimensions."
    },
    {
      "pk": 15007012,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 12,
      "text": "\"Artaxerxes, king of kings, to Ezra the priest, scribe of the law of the God of heaven. Peace. And now...",
      "links": "<a href='/AIV/15/5/1-6'>Ezra 5:6</a>",
      "comment": "The title “king of kings” for the Persian king reflects earthly authority, but true kingship is ultimately from God (cf. <a href='/AIV/27/2/47'>Dan. 2:47</a>), later fulfilled in Christ (<a href='/AIV/66/19/16'>Rev. 19:16</a>)."
    },
    {
      "pk": 15007013,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 13,
      "text": "I issue a decree that anyone among the people of Israel, including their priests and Levites, who wishes to go to Jerusalem with you, may go.",
      "links": "<a href='/AIV/15/1/3'>Ezra 1:3</a>",
      "comment": "The king affirms freedom for religious pilgrimage, echoing earlier royal decrees allowing spiritual restoration."
    },
    {
      "pk": 15007014,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 14,
      "text": "You are sent by the king and his seven counselors to inquire about Judah and Jerusalem, according to the Law of your God, which is in your hand,",
      "links": "<a href='/AIV/17/1/14'>Esth. 1:14</a>",
      "comment": "The 'seven counselors' recalls traditional royal advisory bodies (cf. Esth. 1:14). Ezra’s authority flows from both royal and divine mandate."
    },
    {
      "pk": 15007015,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 15,
      "text": "and to bring the silver and gold that the king and his counselors have freely given to the God of Israel, whose dwelling is in Jerusalem,",
      "links": "<a href='/AIV/15/1/4'>Ezra 1:4</a>",
      "comment": "Provision for the temple is funded by Gentile rulers—God can use earthly power for His heavenly purposes."
    },
    {
      "pk": 15007016,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 16,
      "text": "along with all the silver and gold that you find throughout the province of Babylon, along with the freewill offerings of the people and the priests, offered willingly for the house of their God in Jerusalem—",
      "links": "<a href='/AIV/15/2/68-69'>Ezra 2:68-69</a>",
      "comment": "True worship is supported by both offerings and voluntary sacrifices from God’s people, reminiscent of the giving for the tabernacle."
    },
    {
      "pk": 15007017,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 17,
      "text": "with this money you shall buy bulls, rams, and lambs, together with their grain offerings and drink offerings, and bring them to the altar of the house of your God which is in Jerusalem.",
      "links": "<a href='/AIV/03/1/2-3'>Lev. 1:2-3</a>; <a href='/AIV/04/15/5-7'>Num. 15:5-7</a>",
      "comment": "The restoration of sacrificial worship emphasizes the importance of priestly mediation. This anticipates New Testament fulfillment in the perfect sacrifice of Christ."
    },
    {
      "pk": 15007018,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 18,
      "text": "Whatever seems good to you and your brothers to do with the rest of the silver and gold, do it according to the will of your God.",
      "links": "",
      "comment": "The king grants freedom to follow divine guidance—spiritual discernment and stewardship over the community’s resources is affirmed."
    },
    {
      "pk": 15007019,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 19,
      "text": "The vessels that have been given to you for the service of the house of your God, deliver directly to the God of Jerusalem.",
      "links": "<a href='/AIV/15/1/7'>Ezra 1:7</a>",
      "comment": "Restoring temple vessels signals the recovery of true worship and the sacredness of holy objects."
    },
    {
      "pk": 15007020,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 20,
      "text": "And whatever else is required for the house of your God, which you may have occasion to provide, you may do, from the king’s treasury.",
      "links": "",
      "comment": "The full resources of the kingdom are enlisted for God’s house, prefiguring Christ’s teaching on the building of God’s house and the support of its ministers (<a href='/AIV/40/10/10'>Matt. 10:10</a>)."
    },
    {
      "pk": 15007021,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 21,
      "text": "And I, Artaxerxes the king, issue a decree to all the treasurers in the province Beyond the River: Whatever Ezra the priest, the scribe of the law of the God of heaven, asks of you, let it be done diligently,",
      "links": "",
      "comment": "Royal authority again recognizes the need for zeal in supporting sacred leadership."
    },
    {
      "pk": 15007022,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 22,
      "text": "up to one hundred talents of silver, one hundred cors of wheat, one hundred baths of wine, one hundred baths of oil, and unlimited salt.",
      "links": "",
      "comment": "Detailed provisions demonstrate the concrete needs of worship and priestly service, drawing on Israel’s laws of sacrifice (<a href='/AIV/03/2/13'>Lev. 2:13</a>)."
    },
    {
      "pk": 15007023,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 23,
      "text": "Whatever is commanded by the God of heaven, let it be done diligently for the house of the God of heaven, lest wrath come upon the realm of the king and his sons.",
      "links": "<a href='/AIV/27/6/26-27'>Dan. 6:26-27</a>",
      "comment": "Obedience to God’s worship guards the welfare of nations; recognizing the spiritual authority of the priestly office shapes the people’s well-being."
    },
    {
      "pk": 15007024,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 24,
      "text": "We also inform you that it is not permitted to impose tribute, custom, or toll on any of the priests, Levites, singers, gatekeepers, temple servants, or other servants of this house of God.",
      "links": "<a href='/AIV/16/13/10'>Neh. 13:10</a>",
      "comment": "Clergy and those set apart for sacred service are released from tax burdens—a spiritual principle that the support of ministry is the community’s concern."
    },
    {
      "pk": 15007025,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 25,
      "text": "And you, Ezra, according to the wisdom of your God that is in your hand, appoint magistrates and judges who may judge all the people in the province Beyond the River, all who know the laws of your God; and you shall teach those who do not know them.",
      "links": "<a href='/AIV/02/18/21-22'>Exod. 18:21-22</a>",
      "comment": "Ezra is entrusted with appointing leaders and teaching law—a principle continuing in the church’s formation of leaders and teachers (see <a href='/AIV/55/2/2'>2 Tim. 2:2</a>)."
    },
    {
      "pk": 15007026,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 26,
      "text": "Whoever will not observe the law of your God and the law of the king, let judgment be executed speedily on him, whether for death or for banishment, for confiscation of goods or imprisonment.",
      "links": "",
      "comment": "Civil and spiritual authority are united—reminding us that obedience leads to order and peace within God’s people."
    },
    {
      "pk": 15007027,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 27,
      "text": "Blessed be the LORD, the God of our fathers, who has put such a thing as this into the king’s heart, to beautify the house of the LORD that is in Jerusalem,",
      "links": "<a href='/AIV/15/1/1'>Ezra 1:1</a>",
      "comment": "Ezra acknowledges God’s sovereignty, giving Him glory for stirring earthly rulers to support the temple—a spiritual parallel to the Spirit guiding leaders today."
    },
    {
      "pk": 15007028,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 7,
      "verse": 28,
      "text": "and who has extended steadfast love to me before the king, his counselors, and all the king’s mighty officials. So I was strengthened by the hand of the LORD my God upon me, and I gathered leading men from Israel to go up with me.",
      "links": "<a href='/AIV/15/8/1-20'>Ezra 8:1-20</a>",
      "comment": "The closing highlights God’s mercy and the role of strong, divinely guided leadership. God works through both spiritual and civic means to build His people’s unity."
    }
  ],
  "translatedAt": "2025-12-24T04:43:49.709Z"
}