{
  "book": 15,
  "bookName": "Ezra",
  "bookAbbreviation": "Ezra",
  "chapter": 6,
  "verses": [
    {
      "pk": 15006001,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 1,
      "text": "Then King Darius issued an order, and a search was made in the archives stored in Babylon.",
      "links": "<a href='/AIV/15/5/17'>Ezra 5:17</a>; <a href='/AIV/14/36/22'>2 Chron. 36:22</a>",
      "comment": "Darius responds to the request to verify Cyrus’s decree. The careful search for legal precedent highlights how divine providence often works through secular authority."
    },
    {
      "pk": 15006002,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 2,
      "text": "A scroll was found in the fortress of Ecbatana, in the province of Media, containing this record:",
      "links": "<a href='/AIV/27/6/2'>Dan. 6:2</a>",
      "comment": "Ecbatana, not Babylon, was the location of the decree. This confirms the authenticity of Cyrus’s command and God’s plan for restoring worship in Jerusalem."
    },
    {
      "pk": 15006003,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 3,
      "text": "'In the first year of King Cyrus, a decree was issued concerning the house of God in Jerusalem: Let the house be rebuilt as a place for offering sacrifices, and let its foundations be laid. Its height shall be sixty cubits and its width sixty cubits,",
      "links": "<a href='/AIV/15/1/2-4'>Ezra 1:2-4</a>; <a href='/AIV/11/6/2'>1 Kings 6:2</a>",
      "comment": "Cyrus’s decree sets the ornate dimensions for the temple, evoking the grandeur of Solomon’s Temple and the continued importance of worship through sacrificial offerings."
    },
    {
      "pk": 15006004,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 4,
      "text": "with three layers of large stones and one layer of new timber. Let the costs be paid from the royal treasury.",
      "links": "<a href='/AIV/11/5/17'>1 Kings 5:17</a>",
      "comment": "The provision for royal funding reveals God’s ability to move even pagan kings to support His worship. The layers symbolize sturdy construction worthy for holy purposes."
    },
    {
      "pk": 15006005,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 5,
      "text": "Also let the gold and silver vessels of the house of God, which Nebuchadnezzar took from the temple in Jerusalem and brought to Babylon, be returned and taken back to the temple in Jerusalem, each to its place, and you shall deposit them in the house of God.'",
      "links": "<a href='/AIV/27/1/2'>Dan. 1:2</a>; <a href='/AIV/12/25/13-15'>2 Kings 25:13-15</a>",
      "comment": "The restoration of sacred vessels signifies continuity of worship and reverence for holy objects. The centrality of the temple prefigures the importance of sacred space for true worship."
    },
    {
      "pk": 15006006,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 6,
      "text": "Now therefore, Tattenai, governor of the region west of the Euphrates, Shethar-Bozenai, and your associates, the officials who are in that land, keep away from there.",
      "links": "<a href='/AIV/15/5/3'>Ezra 5:3</a>",
      "comment": "Darius instructs opposition to cease, affirming the divine protection over the temple builders. This foreshadows God’s defense of His people throughout salvation history."
    },
    {
      "pk": 15006007,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 7,
      "text": "Let the work of this house of God alone; let the governor of the Jews and the elders of the Jews build this house of God on its site.",
      "links": "<a href='/AIV/15/4/3'>Ezra 4:3</a>",
      "comment": "The authority given to Jewish leaders presages the enduring role of spiritual leaders as overseers of worship and doctrine."
    },
    {
      "pk": 15006008,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 8,
      "text": "Moreover, I issue a decree regarding what you shall do for the elders of these Jews for the rebuilding of this house of God: The full cost is to be paid to these men from the royal treasury, from the taxes collected from the region west of the Euphrates, so that the work will not stop.",
      "links": "<a href='/AIV/15/1/4'>Ezra 1:4</a>",
      "comment": "Royal support for the temple ensures uninterrupted worship, reflecting God’s providential care. This provision parallels the principle of supporting church ministry materially."
    },
    {
      "pk": 15006009,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 9,
      "text": "And whatever is needed—young bulls, rams, and lambs for burnt offerings to the God of heaven; wheat, salt, wine, and oil, as requested by the priests in Jerusalem—let it be given to them daily without fail,",
      "links": "<a href='/AIV/03/2/1-2'>Lev. 2:1-2</a>; <a href='/AIV/04/28/3-8'>Num. 28:3-8</a>",
      "comment": "This verse underscores the importance of sacrifices and offerings for worship. Daily provision highlights the rhythm and centrality of worship in life."
    },
    {
      "pk": 15006010,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 10,
      "text": "so that they may offer pleasing sacrifices to the God of heaven and pray for the life of the king and his sons.",
      "links": "<a href='/AIV/54/2/1-2'>1 Tim. 2:1-2</a>",
      "comment": "Intercession by priests for rulers is seen here; the ordained priesthood mediates for both people and civil authorities, anticipating spiritual intercession in the new covenant."
    },
    {
      "pk": 15006011,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 11,
      "text": "Furthermore, I issue a decree that if anyone alters this edict, a beam shall be pulled from his house and he shall be impaled on it, and his house shall be made a heap of rubble.",
      "links": "<a href='/AIV/17/7/9-10'>Est. 7:9-10</a>; <a href='/AIV/27/6/24'>Dan. 6:24</a>",
      "comment": "Harsh physical penalty reflects the seriousness of maintaining true worship. Religious mandates are protected by civil authority, indicating synergy between faith and governance."
    },
    {
      "pk": 15006012,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 12,
      "text": "May the God who has caused His name to dwell there overthrow any king or peoples who attempt to destroy this house of God in Jerusalem. I, Darius, have issued this decree; let it be carried out with diligence.",
      "links": "<a href='/AIV/11/8/29'>1 Kings 8:29</a>",
      "comment": "Darius invokes divine protection for the temple. The phrase about God’s name dwelling in the temple anticipates Christ’s presence with His people."
    },
    {
      "pk": 15006013,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 13,
      "text": "Then Tattenai, governor of the region west of the Euphrates, Shethar-Bozenai, and their associates diligently carried out everything King Darius had commanded.",
      "links": "<a href='/AIV/15/5/6'>Ezra 5:6</a>",
      "comment": "Obedience to royal authority facilitates God’s plan, showing God can use unexpected agents to achieve His purposes."
    },
    {
      "pk": 15006014,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 14,
      "text": "So the elders of the Jews continued building and prospered through the prophesying of Haggai the prophet and Zechariah son of Iddo. They finished building the temple, according to the command of the God of Israel and the decrees of Cyrus, Darius, and Artaxerxes, kings of Persia.",
      "links": "<a href='/AIV/37/1/1'>Hag. 1:1</a>; <a href='/AIV/38/1/1'>Zech. 1:1</a>",
      "comment": "Prophetic ministry guides and encourages God’s people, which demonstrates the vital place of spiritual leadership and tradition in maintaining faithfulness."
    },
    {
      "pk": 15006015,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 15,
      "text": "This temple was completed on the third day of the month of Adar, in the sixth year of King Darius.",
      "links": "<a href='/AIV/15/3/8'>Ezra 3:8</a>",
      "comment": "Completion in the month of Adar ties the rebuilding to the annual cycle of religious festivals, emphasizing continuity in sacred tradition and worship."
    },
    {
      "pk": 15006016,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 16,
      "text": "And the people of Israel, the priests, the Levites, and the rest of the exiles celebrated the dedication of this house of God with joy.",
      "links": "<a href='/AIV/14/7/9-10'>2 Chron. 7:9-10</a>",
      "comment": "The collective rejoicing underscores the unity of all believers around the restoration of worship, foreshadowing the spiritual unity within the church."
    },
    {
      "pk": 15006017,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 17,
      "text": "At the dedication of this house of God, they offered a hundred bulls, two hundred rams, four hundred lambs, and as a sin offering for all Israel, twelve male goats, according to the number of the tribes of Israel.",
      "links": "<a href='/AIV/03/4/13-21'>Lev. 4:13-21</a>; <a href='/AIV/04/7/87'>Num. 7:87</a>",
      "comment": "Emphasis on sin offerings for all Israel mirrors the concept of corporate repentance and points forward to the once-for-all sacrifice made by Christ for His church."
    },
    {
      "pk": 15006018,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 18,
      "text": "And they set the priests in their divisions and the Levites in their orders for the service of God at Jerusalem, as it is written in the Book of Moses.",
      "links": "<a href='/AIV/04/3/6-10'>Num. 3:6-10</a>; <a href='/AIV/13/23/6-32'>1 Chron. 23:6-32</a>",
      "comment": "Ordination and orderly service point to the importance of ministerial succession and sacred tradition in maintaining pure worship. See also <a href='/AIV/55/2/2'>2 Tim. 2:2</a>."
    },
    {
      "pk": 15006019,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 19,
      "text": "On the fourteenth day of the first month, the exiles celebrated the Passover.",
      "links": "<a href='/AIV/02/12/6'>Exod. 12:6</a>; <a href='/AIV/46/5/7-8'>1 Cor. 5:7-8</a>",
      "comment": "Restoration of Passover after exile reflects God’s faithfulness and prefigures the new Passover of Christ. See <a href='/AIV/42/22/15-20'>Luke 22:15-20</a>."
    },
    {
      "pk": 15006020,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 20,
      "text": "For the priests and Levites had purified themselves together; all of them were ritually clean. They slaughtered the Passover lamb for all the exiles, for their brothers the priests, and for themselves.",
      "links": "<a href='/AIV/04/9/6-14'>Num. 9:6-14</a>; <a href='/AIV/58/9/13-14'>Heb. 9:13-14</a>",
      "comment": "Collective purity stresses the need for spiritual preparation before approaching God, foreshadowing the notion of sacramental grace and inner renewal."
    },
    {
      "pk": 15006021,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 21,
      "text": "The Israelites who had returned from exile ate it, together with all who had separated themselves from the impurity of the peoples of the land in order to seek the LORD, the God of Israel.",
      "links": "<a href='/AIV/19/24/3-6'>Ps. 24:3-6</a>; <a href='/AIV/44/15/9'>Acts 15:9</a>",
      "comment": "Participation in Passover is restricted to those purified and separated to seek God, reflecting the need for holiness and intention in communal worship and sacred rites."
    },
    {
      "pk": 15006022,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 6,
      "verse": 22,
      "text": "They celebrated the Feast of Unleavened Bread for seven days with joy, for the LORD had made them joyful by turning the heart of the king of Assyria toward them, so that he helped them in the work on the house of God, the God of Israel.",
      "links": "<a href='/AIV/02/12/15-20'>Exod. 12:15-20</a>; <a href='/AIV/20/21/1'>Prov. 21:1</a>",
      "comment": "The seven-day festival of Unleavened Bread represents full restoration and joy after exile. God’s turning the heart of rulers for His purposes signifies divine sovereignty over history and nations."
    }
  ],
  "translatedAt": "2025-12-24T04:43:05.193Z"
}