{
  "book": 15,
  "bookName": "Ezra",
  "bookAbbreviation": "Ezra",
  "chapter": 8,
  "verses": [
    {
      "pk": 15008001,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 1,
      "text": "These are the family heads and their genealogical records, those who went up with me from Babylon during the reign of King Artaxerxes:",
      "links": "<a href='/AIV/15/2/1'>Ezra 2:1</a>; <a href='/AIV/16/7/7'>Neh. 7:7</a>",
      "comment": "This verse introduces the genealogy of those returning with Ezra. The historical listings of names underscore the continuity and faithfulness of God's people, which is often highlighted throughout Scripture (see also Neh. 7:7)."
    },
    {
      "pk": 15008002,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 2,
      "text": "from the descendants of Phinehas: Gershom; from the descendants of Ithamar: Daniel; from the descendants of David: Hattush,",
      "links": "<a href='/AIV/04/25/11-13'>Num. 25:11-13</a>; <a href='/AIV/10/8/15'>2 Sam. 8:15</a>",
      "comment": "These genealogies establish connections to prominent priestly and royal lines. This lineage highlights the importance of both priestly and kingly offices working together, which prefigures the unity of sacred leadership found in the New Covenant."
    },
    {
      "pk": 15008003,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 3,
      "text": "from the descendants of Shecaniah; from the descendants of Parosh: Zechariah, and with him were listed 150 men by genealogy;",
      "links": "<a href='/AIV/15/2/3'>Ezra 2:3</a>",
      "comment": "Listing the numbers and families emphasizes the faithfulness in keeping genealogical records, essential for the restoration community."
    },
    {
      "pk": 15008004,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 4,
      "text": "from the descendants of Pahath-moab: Eliehoenai son of Zerahiah, and 200 men with him;",
      "links": "<a href='/AIV/15/2/6'>Ezra 2:6</a>",
      "comment": "The specific mention of numbers points to organizational order and communal structure within the restored people of God."
    },
    {
      "pk": 15008005,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 5,
      "text": "from the descendants of Zattu: Shecaniah son of Jahaziel, and 300 men with him;",
      "links": "<a href='/AIV/15/2/8'>Ezra 2:8</a>",
      "comment": "Maintaining precise records reinforced communal identity and trust in God's providence. Such records echo the importance of apostolic succession in preserving doctrinal continuity."
    },
    {
      "pk": 15008006,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 6,
      "text": "from the descendants of Adin: Ebed son of Jonathan, and 50 men with him;",
      "links": "<a href='/AIV/15/2/15'>Ezra 2:15</a>",
      "comment": "Every family, even small groups, is recognized. The community is composed of many parts, reflecting a unity in diversity."
    },
    {
      "pk": 15008007,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 7,
      "text": "from the descendants of Elam: Jeshaiah son of Athaliah, and 70 men with him;",
      "links": "<a href='/AIV/15/2/7'>Ezra 2:7</a>",
      "comment": "The repetition of these family groups reaffirms the theme of restoration and covenant faithfulness."
    },
    {
      "pk": 15008008,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 8,
      "text": "from the descendants of Shephatiah: Zebadiah son of Michael, and 80 men with him;",
      "links": "<a href='/AIV/15/2/4'>Ezra 2:4</a>",
      "comment": "The recounting of these names ensures the integrity of the returning exiles, serving as a witness to legitimate descent and fulfilled promises."
    },
    {
      "pk": 15008009,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 9,
      "text": "from the descendants of Joab: Obadiah son of Jehiel, and 218 men with him;",
      "links": "<a href='/AIV/15/2/6'>Ezra 2:6</a>",
      "comment": "These leaders' names testify to the faith of those willing to return, paralleling later leaders in the Church who shepherd the faithful in difficult times."
    },
    {
      "pk": 15008010,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 10,
      "text": "from the descendants of Bani: Shelomith son of Josiphiah, and 160 men with him;",
      "links": "<a href='/AIV/15/2/10'>Ezra 2:10</a>",
      "comment": "Such precise listings demonstrate God's concern for every member of His people, reminiscent of Jesus' teaching about the Good Shepherd knowing His sheep (John 10:14)."
    },
    {
      "pk": 15008011,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 11,
      "text": "from the descendants of Bebai: Zechariah son of Bebai, and 28 men with him;",
      "links": "<a href='/AIV/15/2/11'>Ezra 2:11</a>",
      "comment": "Even small groups are listed, underlining that no one is overlooked in God's household."
    },
    {
      "pk": 15008012,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 12,
      "text": "from the descendants of Azgad: Johanan son of Hakkatan, and 110 men with him;",
      "links": "<a href='/AIV/15/2/12'>Ezra 2:12</a>",
      "comment": "These lists ground the narrative in historical reality, embodying the physical restoration of worship and community."
    },
    {
      "pk": 15008013,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 13,
      "text": "from the descendants of Adonikam, there were the later ones, these being Eliphelet, Jeuel, and Shemaiah, and 60 men with them;",
      "links": "<a href='/AIV/15/2/13'>Ezra 2:13</a>",
      "comment": "The mention of 'the later ones' may reflect a second group or later reinforcement, demonstrating God’s ongoing call throughout time."
    },
    {
      "pk": 15008014,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 14,
      "text": "from the descendants of Bigvai: Uthai and Zabbud, and 70 men with them.",
      "links": "<a href='/AIV/15/2/14'>Ezra 2:14</a>",
      "comment": "These names round out the list, closing the census of those faithfully returning. The accuracy reflects the orderly nature that characterizes the people of God."
    },
    {
      "pk": 15008015,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 15,
      "text": "I gathered them by the river that runs to Ahava, and we camped there three days. I reviewed the people and the priests, and found none of the sons of Levi there.",
      "links": "<a href='/AIV/04/18/23'>Num. 18:23</a>; <a href='/AIV/15/7/7'>Ezra 7:7</a>",
      "comment": "Ezra's concern for the presence of Levites highlights the necessity of proper priestly order for true worship—an important principle for rightly ordered worship communities."
    },
    {
      "pk": 15008016,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 16,
      "text": "So I sent for Eliezer, Ariel, Shemaiah, Elnathan, Jarib, Elnathan, Nathan, Zechariah, and Meshullam, leading men, and also for Joiarib and Elnathan, who were men of understanding.",
      "links": "<a href='/AIV/15/7/28'>Ezra 7:28</a>",
      "comment": "Ezra's choice of wise men for the mission shows the need for both leadership and discernment in guiding God’s people."
    },
    {
      "pk": 15008017,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 17,
      "text": "I gave them orders for Iddo, the leader at the place Casiphia, and put in their mouths the words to speak to Iddo and his brothers, the temple servants at Casiphia, that they might bring us ministers for the house of our God.",
      "links": "<a href='/AIV/06/9/27'>Josh. 9:27</a>; <a href='/AIV/15/2/43-54'>Ezra 2:43–54</a>",
      "comment": "Ezra desires proper ministers, emphasizing continuity and succession in sacred service—paralleling the necessity of valid ministry in later ages."
    },
    {
      "pk": 15008018,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 18,
      "text": "Because the good hand of our God was upon us, they brought us a man of discretion from the lineage of Mahli, the son of Levi, the son of Israel—namely Sherebiah with his sons and brothers, eighteen men;",
      "links": "<a href='/AIV/02/6/16-19'>Exod. 6:16-19</a>",
      "comment": "Ezra gives God the glory for providing qualified ministers, recognizing divine providence in the establishment and organization of His people."
    },
    {
      "pk": 15008019,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 19,
      "text": "and Hashabiah, and with him Jeshaiah of the sons of Merari, with his brothers and their sons, twenty men;",
      "links": "<a href='/AIV/13/6/19-30'>1 Chr. 6:19-30</a>",
      "comment": "Details about the Levites further reinforce the necessity of valid lineage and proper order in worship."
    },
    {
      "pk": 15008020,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 20,
      "text": "and 220 of the temple servants, whom David and the officials had appointed for the service of the Levites—all were designated by name.",
      "links": "<a href='/AIV/13/9/2'>1 Chr. 9:2</a>; <a href='/AIV/15/2/43'>Ezra 2:43</a>",
      "comment": "Temple servants (Nethinim) help maintain worship. Their role, instituted in David’s time, shows the abiding importance of ministerial service."
    },
    {
      "pk": 15008021,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 21,
      "text": "Then I proclaimed a fast there at the river Ahava, that we might humble ourselves before our God, to seek from Him a safe journey for ourselves, our children, and all our possessions.",
      "links": "<a href='/AIV/10/12/16'>2 Sam. 12:16</a>; <a href='/AIV/40/6/16-18'>Matt. 6:16–18</a>",
      "comment": "Fasting and humbling oneself is a spiritual practice linked to deeper dependence on God—a discipline foundational for both Old and New Covenant believers."
    },
    {
      "pk": 15008022,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 22,
      "text": "For I was ashamed to ask the king for soldiers and horsemen to protect us from enemies on the way, since we had told the king, 'The hand of our God is for good upon all who seek Him, but His power and wrath are against all who forsake Him.'",
      "links": "<a href='/AIV/19/33/18-19'>Ps. 33:18-19</a>; <a href='/AIV/20/3/5-6'>Prov. 3:5-6</a>",
      "comment": "Ezra’s reliance on God alone, rather than earthly rulers, demonstrates trust in divine Providence. This prepares the way for Christian teaching about abandoning self-reliance for God-reliance."
    },
    {
      "pk": 15008023,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 23,
      "text": "So we fasted and sought our God for this, and He listened to our prayer.",
      "links": "<a href='/AIV/19/34/4-5'>Ps. 34:4-5</a>; <a href='/AIV/19/66/19-20'>Ps. 66:19-20</a>",
      "comment": "The act of fasting linked to answered prayer shows the power of bodily and spiritual disciplines—an enduring principle for the people of God."
    },
    {
      "pk": 15008024,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 24,
      "text": "Then I set apart twelve of the leading priests: Sherebiah, Hashabiah, and ten of their brothers with them,",
      "links": "<a href='/AIV/15/2/36'>Ezra 2:36</a>; <a href='/AIV/40/10/2-4'>Matt. 10:2-4</a>",
      "comment": "Selecting twelve priests echoes symbolic completeness in Scripture (see also the twelve Apostles). Sacred leadership is divinely instituted and preserved."
    },
    {
      "pk": 15008025,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 25,
      "text": "and weighed out to them the silver, the gold, and the holy vessels, the offering for the house of our God that the king, his advisors, his officials, and all Israel there present had offered.",
      "links": "<a href='/AIV/13/29/6-8'>1 Chr. 29:6-8</a>",
      "comment": "The consecration of offerings for worship reflects the understanding of stewardship and the sanctity of sacred objects."
    },
    {
      "pk": 15008026,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 26,
      "text": "I weighed out into their hands 650 talents of silver, silver vessels worth 100 talents, 100 talents of gold,",
      "links": "<a href='/AIV/11/10/14'>1 Kgs. 10:14</a>",
      "comment": "Listing the precise measure of the treasure shows transparency and accountability in God’s house."
    },
    {
      "pk": 15008027,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 27,
      "text": "and twenty bowls of gold worth 1,000 darics, and two fine vessels of polished bronze, as precious as gold.",
      "links": "<a href='/AIV/15/1/9-10'>Ezra 1:9-10</a>",
      "comment": "The sanctity of sacred vessels for worship points forward to how material things, when set apart, can serve holy purposes—even in the New Covenant."
    },
    {
      "pk": 15008028,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 28,
      "text": "I said to them, 'You are holy to the LORD, and the vessels are holy. The silver and gold are a freewill offering to the LORD, the God of your fathers.'",
      "links": "<a href='/AIV/03/21/6-8'>Lev. 21:6-8</a>",
      "comment": "Priests and their sacred objects are set apart. This idea is fulfilled and magnified in the Church's concept of holiness for persons and things dedicated to God."
    },
    {
      "pk": 15008029,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 29,
      "text": "'Guard them and keep them until you weigh them before the chief priests and Levites and the leaders of the fathers' houses in Jerusalem, at the chambers of the house of the LORD.'",
      "links": "<a href='/AIV/16/13/4-5'>Neh. 13:4-5</a>",
      "comment": "Careful stewardship and accountability for sacred offerings reflect the spiritual principle of guarding what is holy, seen also in New Testament warnings about fidelity and stewardship."
    },
    {
      "pk": 15008030,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 30,
      "text": "So the priests and Levites took charge of the silver, gold, and vessels, to bring them to Jerusalem to the house of our God.",
      "links": "<a href='/AIV/15/1/7-11'>Ezra 1:7-11</a>",
      "comment": "The entrusted objects reached Jerusalem, a foretaste of the fulfillment of God’s promises and the completion of sacred tasks."
    },
    {
      "pk": 15008031,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 31,
      "text": "Then we departed from the river Ahava on the twelfth day of the first month to go to Jerusalem. The hand of our God was upon us, and He rescued us from the hand of the enemy and from ambushes on the way.",
      "links": "<a href='/AIV/19/121/7-8'>Ps. 121:7-8</a>",
      "comment": "God’s protecting hand over journeys and missions is an ongoing theme pointing to His providential care for His people, especially those bringing offerings to Him."
    },
    {
      "pk": 15008032,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 32,
      "text": "We arrived at Jerusalem, and we rested there three days.",
      "links": "<a href='/AIV/15/2/68'>Ezra 2:68</a>; <a href='/AIV/06/2/22'>Josh. 2:22</a>",
      "comment": "A three-day period echoes the motif of completion and rest, which later takes on deeper symbolism in Christian understanding (see also Christ rising on the third day)."
    },
    {
      "pk": 15008033,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 33,
      "text": "On the fourth day, the silver, gold, and vessels were weighed in the house of our God into the hands of Meremoth the priest son of Uriah, and with him was Eleazar son of Phinehas, and with them were the Levites: Jozabad son of Jeshua and Noadiah son of Binnui.",
      "links": "<a href='/AIV/15/2/2'>Ezra 2:2</a>",
      "comment": "Witnesses ensure transparency—a principle that emphasizes ecclesial order and the necessity of many witnesses in sacred transactions."
    },
    {
      "pk": 15008034,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 34,
      "text": "Everything was counted and weighed, and all the weight recorded at that time.",
      "links": "<a href='/AIV/16/13/13'>Neh. 13:13</a>",
      "comment": "The community’s transparency and faithfulness serve as an enduring foundation for trusting religious leadership with material and spiritual treasures."
    },
    {
      "pk": 15008035,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 35,
      "text": "The returned exiles offered burnt offerings to the God of Israel: twelve bulls for all Israel, ninety-six rams, seventy-seven lambs, and as a sin offering, twelve male goats—all this was a burnt offering to the LORD.",
      "links": "<a href='/AIV/03/4/13-15'>Lev. 4:13-15</a>; <a href='/AIV/15/6/17'>Ezra 6:17</a>",
      "comment": "The twelvefold offering symbolizes representation for all Israel, anticipating spiritual sacrifices of the New Covenant people (see 1 Pet. 2:5)."
    },
    {
      "pk": 15008036,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 8,
      "verse": 36,
      "text": "They delivered the king’s orders to the king’s satraps and to the governors of the region Beyond the River. They helped the people and the house of God.",
      "links": "<a href='/AIV/15/7/21-26'>Ezra 7:21-26</a>",
      "comment": "The cooperation of civil authorities with temple leadership shows the harmony of sacred and secular spheres, and the necessity of submission to legitimate authority for the welfare of God’s people."
    }
  ],
  "translatedAt": "2025-12-24T04:44:40.943Z"
}