{
  "book": 15,
  "bookName": "Ezra",
  "bookAbbreviation": "Ezra",
  "chapter": 5,
  "verses": [
    {
      "pk": 15005001,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 1,
      "text": "Now the prophets Haggai and Zechariah, son of Iddo, spoke to the Jews in Judah and Jerusalem in the name of the God of Israel who was over them.",
      "links": "<a href='/AIV/37/1/1'>Haggai 1:1</a>; <a href='/AIV/38/1/1'>Zechariah 1:1</a>",
      "comment": "The emergence of prophetic voices marks divine guidance and authenticates the restoration efforts. Prophets here speak with authority, showing God's continued care for His people despite exile. The reality of prophecy also points to the ongoing tradition of God working through earthly mediators, anticipating New Testament prophets and apostles as visible leaders. See also Acts 2:16-18, where prophecy continues in the new covenant."
    },
    {
      "pk": 15005002,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 2,
      "text": "Then Zerubbabel son of Shealtiel and Jeshua son of Jozadak arose and began to rebuild the house of God in Jerusalem, and the prophets of God were with them, supporting them.",
      "links": "<a href='/AIV/37/1/12'>Haggai 1:12</a>; <a href='/AIV/38/4/6-10'>Zechariah 4:6-10</a>",
      "comment": "Zerubbabel and Jeshua act in partnership, with prophetic encouragement fueling their work. The idea of rebuilding under spiritual authority is important for understanding apostolic succession in later Christian communities. The mention of the 'house of God' points to the continuity of worship from the tabernacle to the temple and ultimately to the Church, both as a physical building and a spiritual reality (see Ephesians 2:19-22)."
    },
    {
      "pk": 15005003,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 3,
      "text": "At that time, Tattenai, the governor of the province west of the Euphrates, and Shethar-bozenai and their associates came to them and said, 'Who issued you a decree to rebuild this house and to repair this structure?'",
      "links": "<a href='/AIV/15/4/9'>Ezra 4:9</a>; <a href='/AIV/15/6/6'>Ezra 6:6</a>",
      "comment": "Here we see external opposition and bureaucratic obstruction. Civil authorities frequently questioned the legitimacy of God’s people, recalling similar conflicts in Acts 4:18-21, where the apostles face governmental resistance. True authority to build comes ultimately from God’s commission, though often confirmed through lawful order."
    },
    {
      "pk": 15005004,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 4,
      "text": "They also asked, 'What are the names of the men who are building this structure?'",
      "links": "<a href='/AIV/15/4/17'>Ezra 4:17</a>",
      "comment": "Naming names shows formal accountability and the necessity of ordered leadership in godly projects. This reflects the biblical principle of established leadership and apostolic authority within the Church, reinforced in Titus 1:5."
    },
    {
      "pk": 15005005,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 5,
      "text": "But the eye of their God was upon the elders of the Jews, and they were not stopped until a report could go to Darius and his reply was received.",
      "links": "<a href='/AIV/19/33/18'>Psalm 33:18</a>; <a href='/AIV/15/6/7'>Ezra 6:7</a>",
      "comment": "God’s providence is emphasized—He actively guards and directs those serving Him. This reinforces the theme of divine protection and mission continuation, a motif echoed in Matthew 16:18, where Christ promises that the Church’s mission will never ultimately be thwarted."
    },
    {
      "pk": 15005006,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 6,
      "text": "This is the copy of the letter that Tattenai, governor of the province west of the Euphrates, and Shethar-bozenai and their associates, the officials of the province, sent to King Darius.",
      "links": "<a href='/AIV/15/6/6'>Ezra 6:6</a>",
      "comment": "Written documentation serves to safeguard the integrity of the work. The faithful have often relied on official correspondence to defend God’s work (see Acts 23:25-30, Paul’s protection through letters)."
    },
    {
      "pk": 15005007,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 7,
      "text": "They sent a report to him, in which it was written, 'To King Darius, all peace.'",
      "links": "<a href='/AIV/15/4/17'>Ezra 4:17</a>",
      "comment": "The officials display formal respect, which reflects the biblical command to honor earthly authorities even when following the higher law of God (see Romans 13:1)."
    },
    {
      "pk": 15005008,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 8,
      "text": "'Let it be known to the king, that we went to the province of Judah, to the house of the great God. It is being rebuilt with large stones, and timber is being laid in the walls. The work is going forward rapidly and is prospering in their hands.'",
      "links": "<a href='/AIV/15/6/4'>Ezra 6:4</a>; <a href='/AIV/21/9/10'>Ecclesiastes 9:10</a>",
      "comment": "The temple is described as the house of the great God—this physical house foreshadows Christ’s body as the greater temple (see John 2:19-21) and the spiritual house built on living stones (1 Peter 2:5). The use of 'large stones' and 'timber' recalls Solomon’s temple, emphasizing continuity and tradition in worship."
    },
    {
      "pk": 15005009,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 9,
      "text": "'We asked those elders, \"Who gave you a decree to build this house and to finish this structure?\"'",
      "links": "<a href='/AIV/15/5/3'>Ezra 5:3</a>",
      "comment": "Emphasis on authority and lawful command for worship points to the principle of succession and the need for proper commissioning in ministry, anticipating the recognition of apostolic mandate in the New Testament (see John 20:21)."
    },
    {
      "pk": 15005010,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 10,
      "text": "'We also asked them their names, so we could write down the names of their leaders for you.'",
      "links": "<a href='/AIV/15/2/2'>Ezra 2:2</a>",
      "comment": "The emphasis on identified leadership is crucial for any spiritual community. It points to the tradition of named successors and the structure of those called to shepherd God’s people (see Acts 1:23)."
    },
    {
      "pk": 15005011,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 11,
      "text": "'And this is their reply to us: \"We are servants of the God of heaven and earth, and we are rebuilding the house that was built many years ago, which a great king of Israel built and finished.\"'",
      "links": "<a href='/AIV/11/6/38'>1 Kings 6:38</a>; <a href='/AIV/19/135/4-5'>Psalm 135:4-5</a>",
      "comment": "Acknowledgement as servants reveals humility and divine mission. Reference to Solomon connects them to the historical foundation and deep tradition of the faith, with an implicit understanding of God’s unfolding plan over centuries."
    },
    {
      "pk": 15005012,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 12,
      "text": "\"But because our ancestors angered the God of heaven, He gave them into the hand of Nebuchadnezzar king of Babylon, the Chaldean, who destroyed this house and carried the people away to Babylon.\"",
      "links": "<a href='/AIV/12/24/10-16'>2 Kings 24:10-16</a>; <a href='/AIV/27/1/1-2'>Daniel 1:1-2</a>",
      "comment": "The exile is seen as divine judgment for sin. Restoring the temple reflects repentance, mercy, and restoration—a model for individual conversion and communal reconciliation. The interplay of justice and mercy points ahead to Christ as the one who pays the penalty and restores communion (Romans 5:10-11)."
    },
    {
      "pk": 15005013,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 13,
      "text": "\"But in the first year of King Cyrus of Babylon, King Cyrus issued a decree to rebuild this house of God.\"",
      "links": "<a href='/AIV/15/1/2'>Ezra 1:2</a>; <a href='/AIV/23/44/28'>Isaiah 44:28</a>",
      "comment": "Cyrus’s decree is a fulfillment of prophecy (Isaiah 44:28), highlighting God’s sovereignty over pagan rulers in achieving His plans. The return facilitates the preservation of true worship and continuity of God’s promises, showing God's action through history to maintain a visible worshiping community."
    },
    {
      "pk": 15005014,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 14,
      "text": "\"Also, the gold and silver vessels of the house of God, which Nebuchadnezzar had taken from the temple in Jerusalem and brought into the temple of Babylon, these King Cyrus took out from the temple of Babylon, and they were given to a man named Sheshbazzar, whom he had made governor.\"",
      "links": "<a href='/AIV/15/1/7-8'>Ezra 1:7-8</a>; <a href='/AIV/27/5/2-3'>Daniel 5:2-3</a>",
      "comment": "The vessels’ return points to restoration of pure worship and the sacredness of dedicated things. This prefigures the restoration of right worship in Christ, and the tradition of setting apart sacred objects for divine service (compare 2 Timothy 2:21)."
    },
    {
      "pk": 15005015,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 15,
      "text": "\"And he said to him, ‘Take these vessels. Go and put them in the temple in Jerusalem and let the house of God be rebuilt on its site.’\"",
      "links": "<a href='/AIV/15/1/7-11'>Ezra 1:7-11</a>",
      "comment": "Cyrus’s command shows reverence for sacred space and objects. This reverence for a physical holy place anticipates the care for sacred buildings and altars in later Christian worship (see Hebrews 9:21-24)."
    },
    {
      "pk": 15005016,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 16,
      "text": "\"So this Sheshbazzar came and laid the foundations of the house of God in Jerusalem. And from that time until now, it has been under construction, and is not yet finished.\"",
      "links": "<a href='/AIV/15/3/8'>Ezra 3:8</a>; <a href='/AIV/37/2/18'>Haggai 2:18</a>",
      "comment": "The process of laying foundations and ongoing construction reflects the progressive revelation and the gradual unfolding of God’s plan. Just as the physical temple takes time to build, so does the spiritual temple (the Church and individual souls). See 1 Corinthians 3:10-11 for Paul’s commentary on building on Christ as the true foundation."
    },
    {
      "pk": 15005017,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 5,
      "verse": 17,
      "text": "\"Now therefore, if it pleases the king, let a search be made in the royal archives of Babylon to see if a decree was issued by King Cyrus to rebuild this house of God in Jerusalem. Then let the king send us his decision concerning this matter.\"",
      "links": "<a href='/AIV/15/6/1-2'>Ezra 6:1-2</a>",
      "comment": "Seeking confirmation from the royal archives reflects the legitimacy and safeguarding of tradition. This principle is echoed later in Christian history through the appeal to apostolic tradition and documentary evidence for governance and doctrine (2 Thessalonians 2:15)."
    }
  ],
  "translatedAt": "2025-12-24T04:42:36.656Z"
}