{
  "book": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 4,
  "verses": [
    {
      "pk": 3000001,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 1,
      "text": "But in the last days, the mountain of the LORD’s house will be established as the highest of the mountains, and it will be lifted up above the hills; peoples will stream to it.",
      "links": "<a href='/AIV/23/2/2'>Isaiah 2:2</a>; <a href='/AIV/19/68/16'>Psalm 68:16</a>",
      "comment": "Here the prophecy speaks of a future time when God's dwelling, often understood as the temple, will be recognized above all earthly powers. The 'mountain' symbolically foreshadows the Church as the center of true worship, drawing all nations. This is echoed in Isaiah 2:2 and points to the universal scope of God’s salvation."
    },
    {
      "pk": 3000002,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 2,
      "text": "Many nations will come and say, 'Come, let us go up to the mountain of the LORD, to the house of the God of Jacob, so He may teach us His ways and we may walk in His paths.' For out of Zion comes instruction, and the word of the LORD from Jerusalem.",
      "links": "<a href='/AIV/23/2/3'>Isaiah 2:3</a>; <a href='/AIV/43/4/22'>John 4:22</a>",
      "comment": "This verse reveals that God’s revelation is intended for all peoples, not just Israel. The central role of instruction from Zion suggests a visible, established authority in teaching the faith—a principle reflected in the apostolic structure of the Church. The reference to Jerusalem also looks forward to spiritual fulfillment through Christ."
    },
    {
      "pk": 3000003,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 3,
      "text": "He will judge between many peoples and settle disputes for mighty nations far away; and they will beat their swords into plowshares, and their spears into pruning hooks. Nation will not lift up sword against nation, nor will they train for war anymore.",
      "links": "<a href='/AIV/23/2/4'>Isaiah 2:4</a>; <a href='/AIV/19/72/7'>Psalm 72:7</a>",
      "comment": "A promise of peace comes with God's reign, resulting in true justice and harmony among nations. The transformation of weapons into tools reflects the redemptive power of grace, and prefigures the peace that comes with Christ’s kingdom—both spiritually now and fully in the age to come."
    },
    {
      "pk": 3000004,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 4,
      "text": "But each will sit under his vine and fig tree, and no one will make them afraid, for the mouth of the LORD of hosts has spoken.",
      "links": "<a href='/AIV/11/4/25'>1 Kings 4:25</a>; <a href='/AIV/38/3/10'>Zechariah 3:10</a>",
      "comment": "The image of security and peace, where every person can rest in safety, reflects the ultimate fulfillment of God's promises. This finds parallels in Solomon’s reign, a time of peace—reaching, in spiritual meaning, to the lasting peace offered through faith."
    },
    {
      "pk": 3000005,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 5,
      "text": "Though all peoples walk in the name of their own gods, we will walk in the name of the LORD our God forever and ever.",
      "links": "<a href='/AIV/6/24/15'>Joshua 24:15</a>; <a href='/AIV/19/89/16'>Psalm 89:16</a>",
      "comment": "A contrast is made between idolatry and true worship. The commitment to walk in the LORD’s name forever signifies an unbroken covenant with God—central to the faith understood as both personal devotion and communal worship through the one true tradition."
    },
    {
      "pk": 3000006,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 6,
      "text": "On that day, declares the LORD, I will assemble the lame and gather those who have been driven away, and those whom I have afflicted.",
      "links": "<a href='/AIV/23/35/5-6'>Isaiah 35:5–6</a>; <a href='/AIV/42/14/13'>Luke 14:13</a>",
      "comment": "God’s heart for the marginalized is clear. The gathering of the weak and afflicted is spiritually fulfilled in Christ, who gathers all to Himself, especially those cast aside. This has deep resonance for the inclusive nature of the Church, calling all to unity."
    },
    {
      "pk": 3000007,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 7,
      "text": "I will make the lame a remnant and those driven far off a strong nation; and the LORD will reign over them in Mount Zion from now on and forever.",
      "links": "<a href='/AIV/23/9/7'>Isaiah 9:7</a>; <a href='/AIV/18/42/10-16'>Job 42:10–16</a>",
      "comment": "The promise of a remnant connects Israel’s restoration with those who are spiritually humble. The everlasting reign on Mount Zion points to Christ as King, with an enduring kingdom, fulfilled both physically and spiritually through His Church."
    },
    {
      "pk": 3000008,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 8,
      "text": "And you, O tower of the flock, hill of the daughter of Zion—to you it will come, yes, the former dominion will come, kingship will come to the daughter of Jerusalem.",
      "links": "<a href='/AIV/1/35/21'>Genesis 35:21</a>; <a href='/AIV/42/2/8'>Luke 2:8</a>",
      "comment": "‘Tower of the flock’ is a significant term, identified with the Messiah’s birthplace by some traditions. The restoration of kingship links to prophetic anticipation of Christ, who establishes a new dominion in continuity with David’s kingship—a visible gathering around the Messiah."
    },
    {
      "pk": 3000009,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 9,
      "text": "Now, why do you cry aloud? Is there no king among you? Has your counselor perished, so that pain seizes you like a woman in labor?",
      "links": "<a href='/AIV/23/22/4'>Isaiah 22:4</a>; <a href='/AIV/19/48/6'>Psalm 48:6</a>",
      "comment": "This verse expresses the agony of Jerusalem deprived of guidance—evoking the need for an enduring leader and comforting counselor. Prophetic voices see this fulfilled by Christ as the eternal King and the Spirit as the true Counselor."
    },
    {
      "pk": 3000010,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 10,
      "text": "Writhe and groan, daughter of Zion, like a woman in labor; for now you will go out from the city and dwell in the open country. You will go to Babylon; there you will be rescued. There the LORD will redeem you from the hand of your enemies.",
      "links": "<a href='/AIV/23/37/3'>Isaiah 37:3</a>; <a href='/AIV/44/7/34'>Acts 7:34</a>",
      "comment": "This prophecy foretells exile in Babylon, followed by redemption—a cycle of suffering transformed into deliverance. Spiritually, it prefigures the greater redemption brought about by Christ, rescuing God's people from spiritual captivity."
    },
    {
      "pk": 3000011,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 11,
      "text": "Now many nations are assembled against you, saying, 'Let her be defiled, and let our eyes look on Zion.'",
      "links": "<a href='/AIV/19/83/4'>Psalm 83:4</a>; <a href='/AIV/19/79/1'>Psalm 79:1</a>",
      "comment": "The hatred and plotting of nations against Zion demonstrate the continual attacks on God’s chosen people. Throughout history, God's assembly experiences persecution but is never abandoned—a theme that strengthens faith in visible, invincible unity."
    },
    {
      "pk": 3000012,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 12,
      "text": "But they do not know the thoughts of the LORD, nor do they understand His plan; for He will gather them like sheaves for the threshing floor.",
      "links": "<a href='/AIV/23/55/8'>Isaiah 55:8</a>; <a href='/AIV/19/76/10'>Psalm 76:10</a>",
      "comment": "God’s divine wisdom and plan remain hidden from those who oppose Him. The imagery of gathering sheaves points to final judgment. Those who persevere in faith are purified and brought safely through, reinforcing hope in an assured future."
    },
    {
      "pk": 3000013,
      "translation": "AIV",
      "book": 33,
      "chapter": 4,
      "verse": 13,
      "text": "Rise and thresh, daughter of Zion, for I will make your horn iron, and your hooves bronze; you will crush many peoples. I will devote their gain to the LORD, their wealth to the Lord of all the earth.",
      "links": "<a href='/AIV/19/2/9'>Psalm 2:9</a>; <a href='/AIV/23/60/6'>Isaiah 60:6</a>",
      "comment": "The language of victory assures Zion of God’s power to overcome enemies. The devotion of spoils to the LORD hints at the sanctification of all things to divine service—a spiritual principle visible in the Church, as all aspects of life are offered to God in worship."
    }
  ],
  "translatedAt": "2025-12-23T07:31:24.743Z"
}