{
  "book": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 1,
  "verses": [
    {
      "pk": 25030101,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 1,
      "text": "The word of the LORD that came to Micah of Moresheth in the days of Jotham, Ahaz, and Hezekiah, kings of Judah, which he saw concerning Samaria and Jerusalem.",
      "links": "<a href='/AIV/23/1/1'>Isa. 1:1</a>; <a href='/AIV/24/1/1'>Jer. 1:1</a>",
      "comment": "The introduction frames Micah as a prophet during the reigns of Judean kings, linking his messages to both Samaria and Jerusalem, indicating judgment over all Israel. The prophets often specify the time and place to give authority to their message."
    },
    {
      "pk": 25030102,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 2,
      "text": "Hear, all you peoples! Listen, O earth, and all who are in it! For the LORD God is a witness against you, the Lord from his holy temple.",
      "links": "<a href='/AIV/19/50/4'>Ps. 50:4</a>; <a href='/AIV/24/6/19'>Jer. 6:19</a>",
      "comment": "The prophetic address to the nations shows God's sovereignty over all peoples, not just Israel. The 'holy temple' reflects God's presence and authority."
    },
    {
      "pk": 25030103,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 3,
      "text": "For behold, the LORD is coming out from his place, and will come down and tread upon the high places of the earth.",
      "links": "<a href='/AIV/19/18/9'>Ps. 18:9</a>; <a href='/AIV/23/26/21'>Isa. 26:21</a>",
      "comment": "God's descent signifies direct involvement; 'high places' often refer to sites of idolatry. The language foreshadows divine judgment and recalls theophanies where God 'comes down' (Ex. 3:8)."
    },
    {
      "pk": 25030104,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 4,
      "text": "The mountains will melt beneath him, and the valleys will split open, like wax before fire, like waters poured down a steep place.",
      "links": "<a href='/AIV/19/97/5'>Ps. 97:5</a>; <a href='/AIV/34/1/5-6'>Nah. 1:5–6</a>",
      "comment": "The imagery of melting mountains shows God’s overwhelming power. Similar imagery is used in eschatological descriptions throughout the prophets. Spiritually, it signifies that nothing can withstand God's presence."
    },
    {
      "pk": 25030105,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 5,
      "text": "All this is because of the transgression of Jacob, and because of the sins of the house of Israel. What is the transgression of Jacob? Is it not Samaria? And what is the high place of Judah? Is it not Jerusalem?",
      "links": "<a href='/AIV/28/10/8'>Hos. 10:8</a>; <a href='/AIV/11/12/28-30'>1 Kings 12:28–30</a>",
      "comment": "Judgment is tied to the sins of the people, specifically idolatry in both Samaria and Jerusalem. These cities represent spiritual corruption at the heart of God’s people."
    },
    {
      "pk": 25030106,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 6,
      "text": "Therefore, I will make Samaria a heap in the open country, a place for planting vineyards; I will pour her stones into the valley and lay bare her foundations.",
      "links": "<a href='/AIV/24/26/18'>Jer. 26:18</a>; <a href='/AIV/33/3/12'>Mic. 3:12</a>",
      "comment": "Samaria’s destruction is depicted as total: from city to farmland, with its structures broken down. This was fulfilled during the Assyrian conquest (2 Kings 17)."
    },
    {
      "pk": 25030107,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 7,
      "text": "All her carved images shall be beaten to pieces, all her wages shall be burned with fire, and all her idols I will lay waste; for from the wages of a prostitute she gathered them, and to the wages of a prostitute they shall return.",
      "links": "<a href='/AIV/28/2/12'>Hos. 2:12</a>; <a href='/AIV/23/30/22'>Isa. 30:22</a>",
      "comment": "Idolatry is likened to prostitution, a common prophetic metaphor for unfaithfulness to God. Spiritual unfaithfulness leads to destruction of what was gained by sin."
    },
    {
      "pk": 25030108,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 8,
      "text": "Because of this I will lament and wail; I will go barefoot and naked; I will make lamentation like the jackals, and mourning like the ostriches.",
      "links": "<a href='/AIV/23/20/2'>Isa. 20:2</a>; <a href='/AIV/24/47/5'>Jer. 47:5</a>",
      "comment": "Prophets would demonstrate grief physically to symbolize the deep sorrow over Israel’s fate. Shows a model of intercessory prayer and mourning for communal sin."
    },
    {
      "pk": 25030109,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 9,
      "text": "For her wound is incurable, and it has come to Judah; it has reached the gate of my people, to Jerusalem itself.",
      "links": "<a href='/AIV/24/8/22'>Jer. 8:22</a>; <a href='/AIV/33/3/10-12'>Mic. 3:10–12</a>",
      "comment": "Sin spreads like an infection, illustrating the danger of compromise with evil. This is a warning to the faithful to remain vigilant."
    },
    {
      "pk": 25030110,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 10,
      "text": "Do not tell it in Gath; weep not at all. In Beth-le-aphrah roll yourself in the dust.",
      "links": "<a href='/AIV/10/1/20'>2 Sam. 1:20</a>",
      "comment": "This verse uses wordplay with towns’ names; weeping in Gath (a Philistine city) would bring shame. Mourning practices highlight the seriousness of the judgment."
    },
    {
      "pk": 25030111,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 11,
      "text": "Pass on your way, inhabitants of Shaphir, in nakedness and shame; the inhabitants of Zaanan do not come out; the lamentation of Beth-ezel shall take from you its support.",
      "links": "<a href='/AIV/23/47/3'>Isa. 47:3</a>",
      "comment": "God’s judgment causes shame and isolation; the punning on town names would resonate deeply for the original audience."
    },
    {
      "pk": 25030112,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 12,
      "text": "For the inhabitants of Maroth wait anxiously for good, because disaster has come down from the LORD to the gate of Jerusalem.",
      "links": "<a href='/AIV/33/3/10-12'>Mic. 3:10–12</a>",
      "comment": "Even those hoping for relief wait in vain; judgment is aimed at the heart of God’s people. The progression to Jerusalem shows the seriousness of approaching divine judgment."
    },
    {
      "pk": 25030113,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 13,
      "text": "Harness the chariot to the swift steeds, inhabitants of Lachish—you were the beginning of sin to the daughter of Zion, because in you were found the transgressions of Israel.",
      "links": "<a href='/AIV/12/18/14'>2 Kings 18:14</a>",
      "comment": "Lachish was a key city for both defense and religious compromise. Connections to 'daughter of Zion' echo how unfaithfulness often started in seemingly secure places."
    },
    {
      "pk": 25030114,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 14,
      "text": "Therefore you shall give parting gifts to Moresheth-gath; the houses of Achzib shall be a deception to the kings of Israel.",
      "links": "<a href='/AIV/06/15/44'>Josh. 15:44</a>",
      "comment": "'Parting gifts' implies loss, and 'Achzib' sounding like 'deception' points to disappointment in false confidence. God’s judgments often invert human expectations."
    },
    {
      "pk": 25030115,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 15,
      "text": "I will again bring a conqueror to you, inhabitants of Mareshah; the glory of Israel shall come to Adullam.",
      "links": "<a href='/AIV/09/22/1'>1 Sam. 22:1</a>",
      "comment": "Foreign invaders will come. 'Adullam' recalls David's refuge—suggests the people will be driven from power to hiding, as in earlier times."
    },
    {
      "pk": 25030116,
      "translation": "AIV",
      "book": 33,
      "chapter": 1,
      "verse": 16,
      "text": "Shave your head and cut off your hair for your children, whom you delight in; make yourself as bald as the vulture, for they will go from you into exile.",
      "links": "<a href='/AIV/24/7/29'>Jer. 7:29</a>",
      "comment": "Shaving heads signifies mourning; exile is the consequence for collective sin. Spiritually, this shows sin's impact not only on individuals but on families and future generations. It foreshadows themes of exile and restoration found throughout Scripture."
    }
  ],
  "translatedAt": "2025-12-23T07:30:32.844Z"
}