{
  "book": 40,
  "bookName": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 7,
  "verses": [
    {
      "pk": 40007001,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 1,
      "text": "How miserable I have become, like one who gathers fruit after the harvest, like one picking grapes after the vintage. There is no cluster to eat, none of the first-ripe figs I crave.",
      "links": "<a href='/AIV/23/17/6'>Isa. 17:6</a>; <a href='/AIV/24/8/13'>Jer. 8:13</a>",
      "comment": "Micah laments the spiritual barrenness of his people, comparing it to a failed harvest. The imagery recalls prophetic warnings elsewhere about judgment and fruitlessness (cf. Isa. 5:1-7). There is also a sense of longing for 'first fruits,' which elsewhere become a sacrificial offering, suggesting that true worship and devotion have vanished."
    },
    {
      "pk": 40007002,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 2,
      "text": "The faithful have disappeared from the land; no upright person remains. Everyone lies in wait to shed blood; each hunts his own brother with a net.",
      "links": "<a href='/AIV/19/12/1'>Ps. 12:1</a>; <a href='/AIV/28/4/1-2'>Hos. 4:1-2</a>",
      "comment": "Micah mourns the absence of godly people. The theme is echoing the psalmist's cry (Ps. 12), and shows the breakdown of fellowship and trust—a sign of deep moral decline. The use of the word 'faithful' parallels the theme of covenant loyalty that is central to God's relationship with His people."
    },
    {
      "pk": 40007003,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 3,
      "text": "Their hands are ready to do evil; the ruler demands a bribe, the judge is paid off, the powerful speak selfishly. Together they plan it out.",
      "links": "<a href='/AIV/23/1/23'>Isa. 1:23</a>; <a href='/AIV/26/22/27'>Ezek. 22:27</a>",
      "comment": "Micah exposes the corruption among the leaders—bribery, injustice, and conspiracy. This matches other prophets who challenge injustice. Note how 'together they plan it out' suggests a systematic evil, contrasting with the unity among Christians that is called for in John 17:21."
    },
    {
      "pk": 40007004,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 4,
      "text": "The best of them is like a thorn; the most upright worse than a hedge of briars. The day of your watchmen, your punishment comes; now their confusion is at hand.",
      "links": "<a href='/AIV/23/5/6'>Isa. 5:6</a>; <a href='/AIV/26/33/2-6'>Ezek. 33:2-6</a>",
      "comment": "Even the 'upright' are compared to thorns—a repeated biblical image of judgment and unfruitfulness (cf. Heb. 6:8). The 'watchmen' were supposed to warn the city; here, their failure brings confusion and punishment. This warning and accountability resonates with spiritual offices of oversight within the Church."
    },
    {
      "pk": 40007005,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 5,
      "text": "Do not trust a neighbor, do not put confidence in a friend; guard the doors of your mouth from your own wife.",
      "links": "<a href='/AIV/24/9/4-5'>Jer. 9:4-5</a>",
      "comment": "Micah describes utter social breakdown and mistrust—even at home. The emphasis on secrecy and guarded speech points to the loss of intimacy and trust, which underlines the biblical call for restored relationships and the importance of truth and openness in the Christian community."
    },
    {
      "pk": 40007006,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 6,
      "text": "For son dishonors father, daughter rises against her mother, daughter-in-law against her mother-in-law; a person's enemies are the people of his own household.",
      "links": "<a href='/AIV/40/10/35-36'>Matt. 10:35-36</a>; <a href='/AIV/19/41/9'>Ps. 41:9</a>",
      "comment": "Micah echoes a theme that Jesus later applies directly to His own ministry (Matt. 10:35-36). The division within families signals the challenge of following God amid a corrupted world, with deep spiritual implications that find a fuller solution in Christ's call to radical commitment and peace through true unity."
    },
    {
      "pk": 40007007,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 7,
      "text": "But as for me, I will look to the LORD; I will wait for the God who saves me; my God will hear me.",
      "links": "<a href='/AIV/19/3/4'>Ps. 3:4</a>; <a href='/AIV/34/1/7'>Nah. 1:7</a>",
      "comment": "Micah sets his hope in the Lord alone, foreshadowing Christian trust in Christ as Savior. 'Wait for the God who saves me' is both literal and an anticipation of messianic expectation, pointing to the ultimate salvation offered in Jesus."
    },
    {
      "pk": 40007008,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 8,
      "text": "Do not rejoice over me, my enemy! Though I have fallen, I will rise; though I sit in darkness, the LORD will be my light.",
      "links": "<a href='/AIV/19/27/1'>Ps. 27:1</a>; <a href='/AIV/23/60/1-2'>Isa. 60:1-2</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "The language of rising from a fall and the Lord as light is commonly applied christologically—Jesus himself claims to be 'the light of the world' (John 8:12). This text foreshadows resurrection hope and the victory of God over darkness and sin."
    },
    {
      "pk": 40007009,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 9,
      "text": "I will bear the indignation of the LORD, because I have sinned against him, until he pleads my cause and establishes justice for me. He will bring me out to the light; I will see his righteousness.",
      "links": "<a href='/AIV/23/54/7-8'>Isa. 54:7-8</a>; <a href='/AIV/19/143/1'>Ps. 143:1</a>",
      "comment": "Micah acknowledges guilt and waits for God's intervention. The phrase 'pleads my cause' invokes God's role as righteous judge, ultimately fulfilled in Christ our Advocate (cf. 1 John 2:1), connecting personal repentance to restored fellowship."
    },
    {
      "pk": 40007010,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 10,
      "text": "Then my enemy will see, and shame will cover her who said to me, 'Where is the LORD your God?' My eyes will look upon her; now she will be trampled down like mud in the streets.",
      "links": "<a href='/AIV/19/42/3'>Ps. 42:3</a>; <a href='/AIV/23/26/5-6'>Isa. 26:5-6</a>",
      "comment": "Micah speaks of vindication before those who mocked his faith. There is a prophetic certainty that God will ultimately triumph, reminiscent of Christ's vindication in resurrection and believers' participation in God's victory over all spiritual enemies."
    },
    {
      "pk": 40007011,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 11,
      "text": "A day will come for rebuilding your walls; on that day, your boundaries will be extended.",
      "links": "<a href='/AIV/15/2/17'>Neh. 2:17</a>; <a href='/AIV/23/54/2'>Isa. 54:2</a>",
      "comment": "The promise of rebuilding and expanding boundaries speaks of restoration, not only materially but also spiritually. The Church is often seen as the new, expanded people of God, fulfilling Old Testament types in a new spiritual reality."
    },
    {
      "pk": 40007012,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 12,
      "text": "At that time, people will come to you from Assyria and from the cities of Egypt, and from Egypt to the Euphrates, from sea to sea, and from mountain to mountain.",
      "links": "<a href='/AIV/19/72/8'>Ps. 72:8</a>; <a href='/AIV/23/19/23-25'>Isa. 19:23-25</a>",
      "comment": "Micah pictures the ingathering of nations, anticipating New Testament themes of Gentile inclusion in God's people (e.g., Acts 13:47). The theme of a universal family of faith is foundational for Church teaching on spiritual unity."
    },
    {
      "pk": 40007013,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 13,
      "text": "But the earth will be desolate because of its inhabitants, for the fruit of their deeds.",
      "links": "<a href='/AIV/23/24/3-5'>Isa. 24:3-5</a>; <a href='/AIV/19/107/34'>Ps. 107:34</a>",
      "comment": "Despite the promise of restoration, judgment remains for persistent sin. This balance between justice and mercy is developed through the biblical narrative, culminating in Christ as both Judge and Redeemer."
    },
    {
      "pk": 40007014,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 14,
      "text": "Shepherd your people with your staff, the flock of your inheritance, living alone in a forest, in fertile pasturelands. Let them graze in Bashan and Gilead as in days of old.",
      "links": "<a href='/AIV/19/23/1'>Ps. 23:1</a>; <a href='/AIV/26/34/23'>Ezek. 34:23</a>",
      "comment": "The image of God as Shepherd is one of tender care and leadership. Jesus applies this title to Himself (cf. John 10:11), and shepherds in the Church continue this pastoral ministry in spiritual succession."
    },
    {
      "pk": 40007015,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 15,
      "text": "As in the days when you came out from Egypt, I will show them miraculous deeds.",
      "links": "<a href='/AIV/2/7/3'>Ex. 7:3</a>; <a href='/AIV/19/78/12'>Ps. 78:12</a>",
      "comment": "Micah reminds the people of the Exodus miracles, anticipating a new era of divine intervention. The motif of signs and wonders continues in the New Testament as the confirmation of God's saving acts (Acts 2:22)."
    },
    {
      "pk": 40007016,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 16,
      "text": "Nations will see and be ashamed of all their power; they will put their hands over their mouths, their ears will be deaf.",
      "links": "<a href='/AIV/23/52/15'>Isa. 52:15</a>; <a href='/AIV/19/48/4-6'>Ps. 48:4-6</a>",
      "comment": "God's mighty acts will humble even the nations. The gesture of covering the mouth recalls awe before God’s mystery, a theme continued in the reverent worship and silence before God described in the Book of Revelation."
    },
    {
      "pk": 40007017,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 17,
      "text": "They will lick the dust like a snake, like crawling things of the earth; they will come trembling out of their strongholds to the LORD our God, and will fear before you.",
      "links": "<a href='/AIV/1/3/14'>Gen. 3:14</a>; <a href='/AIV/23/49/23'>Isa. 49:23</a>",
      "comment": "The imagery echoes the curse on the serpent and anticipates the final subjugation of evil. Nations coming in trembling foreshadows conversion and worship, which in Scripture becomes a universal vision for all peoples."
    },
    {
      "pk": 40007018,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 18,
      "text": "Who is a God like you, who forgives iniquity and passes over the transgressions of the remnant of his inheritance? He does not retain his anger forever, he delights in lovingkindness.",
      "links": "<a href='/AIV/19/103/8-12'>Ps. 103:8-12</a>; <a href='/AIV/2/34/6-7'>Ex. 34:6-7</a>",
      "comment": "This climactic verse celebrates God's unique mercy, forming the basis for revealed forgiveness. 'Passes over' recalls the Passover, ultimately pointing to Christ's sacrifice for our redemption and the perpetual mercy available through the sacraments."
    },
    {
      "pk": 40007019,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 19,
      "text": "He will again have compassion on us; he will tread our iniquities underfoot. You will cast all our sins into the depths of the sea.",
      "links": "<a href='/AIV/19/85/10'>Ps. 85:10</a>; <a href='/AIV/23/38/17'>Isa. 38:17</a>",
      "comment": "God’s mercy is thorough—our sins are removed entirely, echoing the fullness of reconciliation. The imagery here is one of absolute forgiveness, further signified in the washing away and forgetting of sin, a theme pointedly fulfilled in New Testament sacraments and liturgy."
    },
    {
      "pk": 40007020,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 7,
      "verse": 20,
      "text": "You will show faithfulness to Jacob and steadfast love to Abraham, as you swore to our ancestors from days long ago.",
      "links": "<a href='/AIV/1/12/1-3'>Gen. 12:1-3</a>; <a href='/AIV/19/105/8-11'>Ps. 105:8-11</a>; <a href='/AIV/42/1/72-73'>Luke 1:72-73</a>",
      "comment": "Micah closes with God's fidelity to His promises, tying the Old Testament covenants to future hope. This theme is foundational for Christian faith—the fulfillment of God’s promises in Christ links the ancient patriarchs to the whole Church, drawing all believers into one family united by sacramental and spiritual bonds."
    }
  ],
  "translatedAt": "2025-12-24T09:49:38.258Z"
}