{
  "book": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 7,
  "verses": [
    {
      "pk": 3070101,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 1,
      "text": "Woe is me! For I have become like one gathering summer fruit, like the gleanings after the grape harvest. No cluster to eat—no early figs that my soul desires.",
      "links": "<a href='/AIV/23/17/6'>Isa. 17:6</a>; <a href='/AIV/28/9/10'>Hos. 9:10</a>",
      "comment": "Micah laments the lack of righteous people, symbolized by the absence of fruit after harvest. This is a metaphor for spiritual barrenness in Israel."
    },
    {
      "pk": 3070102,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 2,
      "text": "The godly have vanished from the land, and no upright person remains. Everyone lies in wait for blood; they hunt each other with nets.",
      "links": "<a href='/AIV/19/12/1'>Ps. 12:1</a>; <a href='/AIV/24/5/1'>Jer. 5:1</a>",
      "comment": "Micah describes moral decay, paralleling Psalm 12 and Jeremiah 5. This highlights humanity’s universal need for redemption."
    },
    {
      "pk": 3070103,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 3,
      "text": "Both hands are skilled at evil—the official and the judge ask for a bribe, and the powerful dictate their desires; they weave it together.",
      "links": "<a href='/AIV/23/1/23'>Isa. 1:23</a>; <a href='/AIV/28/4/18'>Hos. 4:18</a>",
      "comment": "Corruption is shown at every level, emphasizing the depth of sin and the need for righteous leadership."
    },
    {
      "pk": 3070104,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 4,
      "text": "The best among them is like a thorn; the most upright is worse than a hedge of thorns. The day of your watchmen, your punishment, has come. Now is their confusion.",
      "links": "<a href='/AIV/23/5/6'>Isa. 5:6</a>; <a href='/AIV/26/33/2-6'>Ezek. 33:2-6</a>",
      "comment": "Even the ‘best’ people are dangerous and unfruitful. The punishment is imminent, underscoring the holiness of God's justice."
    },
    {
      "pk": 3070105,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 5,
      "text": "Do not trust a neighbor; do not put confidence in a friend. Guard the doors of your mouth from her who lies in your arms.",
      "links": "<a href='/AIV/24/9/4'>Jer. 9:4</a>",
      "comment": "Micah warns of betrayal even in closest relationships. This points to the brokenness caused by sin and foreshadows Christ’s experience."
    },
    {
      "pk": 3070106,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 6,
      "text": "For the son treats the father with contempt, the daughter rises up against her mother, the daughter-in-law against her mother-in-law; a person’s enemies are the members of his own household.",
      "links": "<a href='/AIV/40/10/35-36'>Matt. 10:35-36</a>; <a href='/AIV/41/13/12'>Mark 13:12</a>",
      "comment": "Jesus quotes this verse, applying it to His own ministry. The division caused by following Him fulfills Micah’s prophecy, revealing the cost of discipleship."
    },
    {
      "pk": 3070107,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 7,
      "text": "But as for me, I will look to the Lord; I will wait for the God of my salvation. My God will hear me.",
      "links": "<a href='/AIV/19/27/14'>Ps. 27:14</a>; <a href='/AIV/19/62/1'>Ps. 62:1</a>",
      "comment": "Micah turns to God with steadfast hope for salvation, foreshadowing the spiritual attitude of trust central to Christian faith."
    },
    {
      "pk": 3070108,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 8,
      "text": "Do not rejoice over me, my enemy. Though I have fallen, I will rise; though I sit in darkness, the Lord will be my light.",
      "links": "<a href='/AIV/19/37/24'>Ps. 37:24</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "The rising from darkness prefigures resurrection themes and Christ as the Light of the world. John 8:12 presents Jesus as this fulfillment."
    },
    {
      "pk": 3070109,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 9,
      "text": "I will endure the anger of the Lord because I have sinned against Him, until He pleads my case and executes justice for me. He will bring me to the light; I will see His righteousness.",
      "links": "<a href='/AIV/19/143/2'>Ps. 143:2</a>; <a href='/AIV/23/42/6'>Isa. 42:6</a>",
      "comment": "Micah accepts God’s discipline but anticipates vindication, echoing themes of intercession and atonement ultimately fulfilled in Christ."
    },
    {
      "pk": 3070110,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 10,
      "text": "Then my enemy will see, and shame will cover her who said to me, 'Where is the Lord your God?' My eyes will look upon her; now she will be trampled down like mud in the streets.",
      "links": "<a href='/AIV/19/42/3'>Ps. 42:3</a>; <a href='/AIV/23/51/23'>Isa. 51:23</a>",
      "comment": "The vindication of the faithful is promised. This links to themes of suffering for faith and ultimate triumph over evil."
    },
    {
      "pk": 3070111,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 11,
      "text": "A day for building your walls will come; the boundary will be extended in that day.",
      "links": "<a href='/AIV/16/2/17'>Neh. 2:17</a>; <a href='/AIV/23/60/18'>Isa. 60:18</a>",
      "comment": "Promise of restoration and expansion. Scriptural motif of the city’s walls recalls the spiritual building up of the people of God."
    },
    {
      "pk": 3070112,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 12,
      "text": "In that day people will come to you from Assyria and the cities of Egypt, and from Egypt to the Euphrates, from sea to sea and mountain to mountain.",
      "links": "<a href='/AIV/19/72/8-9'>Ps. 72:8-9</a>; <a href='/AIV/23/19/23-25'>Isa. 19:23-25</a>",
      "comment": "The ingathering of nations is promised—the openness of God’s people to the whole earth prefigures the universal mission of Christ’s Church."
    },
    {
      "pk": 3070113,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 13,
      "text": "Yet the earth will become desolate because of its inhabitants, as a result of their deeds.",
      "links": "<a href='/AIV/23/24/3-6'>Isa. 24:3-6</a>",
      "comment": "Sin brings judgment and desolation on the earth, affirming the seriousness of moral consequences for creation."
    },
    {
      "pk": 3070114,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 14,
      "text": "Shepherd your people with your staff, the flock of your inheritance, dwelling by itself in a forest in fertile land; let them graze in Bashan and Gilead as in days of old.",
      "links": "<a href='/AIV/19/80/1'>Ps. 80:1</a>; <a href='/AIV/26/34/23'>Ezek. 34:23</a>",
      "comment": "Micah appeals to God as shepherd, echoing Psalm 80 and Ezekiel 34, prefiguring Christ as the Good Shepherd."
    },
    {
      "pk": 3070115,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 15,
      "text": "As in the days when you came out from the land of Egypt, I will show them marvelous things.",
      "links": "<a href='/AIV/02/3/20'>Ex. 3:20</a>; <a href='/AIV/23/11/16'>Isa. 11:16</a>",
      "comment": "God’s saving acts are recalled, connecting the Exodus to future salvation—miraculous deliverance that foreshadows Christ’s work."
    },
    {
      "pk": 3070116,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 16,
      "text": "The nations will see and be ashamed of all their might; they will put their hand over their mouth; their ears will become deaf.",
      "links": "<a href='/AIV/23/52/15'>Isa. 52:15</a>",
      "comment": "Universal recognition of God’s power and silence before His majesty, foreshadowing the spread of the Gospel and conversion of the nations."
    },
    {
      "pk": 3070117,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 17,
      "text": "They will lick dust like a serpent; like crawling creatures on the earth, they will come trembling out of their strongholds; they will turn in dread to the Lord our God, and will fear you.",
      "links": "<a href='/AIV/01/3/14'>Gen. 3:14</a>; <a href='/AIV/19/72/9'>Ps. 72:9</a>",
      "comment": "Imagery recalls Genesis 3:14, linking divine judgment and humility, underscoring triumph of God over evil."
    },
    {
      "pk": 3070118,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 18,
      "text": "Who is a God like you, forgiving iniquity and passing over transgression for the remnant of His inheritance? He does not hold on to His anger forever, because He delights in mercy.",
      "links": "<a href='/AIV/02/34/6-7'>Ex. 34:6-7</a>; <a href='/AIV/19/103/8-12'>Ps. 103:8-12</a>",
      "comment": "The heart of Micah’s prophecy—God’s mercy is limitless. This connects with the central Christian teaching of forgiveness and grace."
    },
    {
      "pk": 3070119,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 19,
      "text": "He will again have compassion on us. He will tread our iniquities underfoot. You will cast all our sins into the depths of the sea.",
      "links": "<a href='/AIV/19/85/10'>Ps. 85:10</a>; <a href='/AIV/19/103/12'>Ps. 103:12</a>",
      "comment": "God’s victory over sin is total: casting sins into the sea prefigures complete forgiveness, foreshadowing Christ’s redemptive work."
    },
    {
      "pk": 3070120,
      "translation": "AIV",
      "book": 33,
      "chapter": 7,
      "verse": 20,
      "text": "You will show faithfulness to Jacob, and steadfast love to Abraham, as you swore to our ancestors from days of old.",
      "links": "<a href='/AIV/01/22/16-18'>Gen. 22:16-18</a>; <a href='/AIV/19/105/8-10'>Ps. 105:8-10</a>",
      "comment": "Micah concludes with God’s covenant fidelity—fulfilled supremely in Christ, and experienced through the community gathered in unity and sacramental life."
    }
  ],
  "translatedAt": "2025-12-23T07:32:34.990Z"
}