{
  "book": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 6,
  "verses": [
    {
      "pk": 2106001,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 1,
      "text": "Listen now to what the LORD says: \"Arise, present your case before the mountains, and let the hills hear your voice.\"",
      "links": "<a href='/AIV/23/1/2'>Isa. 1:2</a>; <a href='/AIV/19/50/1'>Ps. 50:1</a>",
      "comment": "God summons the creation itself as a witness to Israel's behavior. This highlights the seriousness of the covenant relationship."
    },
    {
      "pk": 2106002,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 2,
      "text": "\"Hear, you mountains, the LORD's lawsuit, and you enduring foundations of the earth. For the LORD has a case against His people, and He will dispute with Israel.\"",
      "links": "<a href='/AIV/23/1/2'>Isa. 1:2</a>; <a href='/AIV/29/3/2'>Joel 3:2</a>",
      "comment": "Creation itself is called to listen; covenant-breaking affects all of creation, underlining both physical and spiritual harm from sin."
    },
    {
      "pk": 2106003,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 3,
      "text": "\"My people, what have I done to you? How have I burdened you? Testify against Me!\"",
      "links": "<a href='/AIV/23/5/4'>Isa. 5:4</a>",
      "comment": "God’s question emphasizes His graciousness; a reminder of God's gentle approach and call for sincere relationship, foreshadowing deeper communion."
    },
    {
      "pk": 2106004,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 4,
      "text": "\"For I brought you up out of the land of Egypt and redeemed you from the house of slavery. I sent before you Moses, Aaron, and Miriam.\"",
      "links": "<a href='/AIV/2/12/51'>Ex. 12:51</a>; <a href='/AIV/2/15/20'>Ex. 15:20</a>",
      "comment": "Redemption from Egypt prefigures future deliverance and spiritual redemption, fulfilled perfectly in Christ (see <a href='/AIV/40/20/28'>Matt. 20:28</a>)."
    },
    {
      "pk": 2106005,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 5,
      "text": "\"My people, remember what Balak king of Moab plotted, and what Balaam son of Beor answered him, and what happened from Shittim to Gilgal—that you may recognize the righteous acts of the LORD.\"",
      "links": "<a href='/AIV/4/22/2'>Num. 22:2</a>; <a href='/AIV/6/4/19'>Josh. 4:19</a>",
      "comment": "Balak and Balaam episodes show God's intention to bless; 'Shittim to Gilgal' marks entry into the Promised Land—connecting covenant faithfulness and sacred history."
    },
    {
      "pk": 2106006,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 6,
      "text": "\"With what shall I come before the LORD, and bow down before the God Most High? Shall I come before Him with burnt offerings, with calves a year old?\"",
      "links": "<a href='/AIV/19/40/6'>Ps. 40:6</a>; <a href='/AIV/1/4/4'>Gen. 4:4</a>",
      "comment": "Here, ritual alone is questioned; true worship means more than sacrifice—a theme echoed in the New Testament (<a href='/AIV/58/10/8'>Heb. 10:8</a>)."
    },
    {
      "pk": 2106007,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 7,
      "text": "\"Will the LORD be pleased with thousands of rams, with ten thousand rivers of oil? Shall I give my firstborn for my transgression, the fruit of my body for the sin of my soul?\"",
      "links": "<a href='/AIV/1/22/2'>Gen. 22:2</a>; <a href='/AIV/23/1/11'>Isa. 1:11</a>",
      "comment": "Hyperbolic offerings show the heart must be changed. 'Firstborn for sin' prefigures the necessity of a divine, perfect sacrifice—fulfilled in Christ’s self-offering (<a href='/AIV/45/8/32'>Rom. 8:32</a>), hinting at the mystery of redemption."
    },
    {
      "pk": 2106008,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 8,
      "text": "He has shown you, O man, what is good. And what does the LORD require of you, but to act justly, to love mercy, and to walk humbly with your God?",
      "links": "<a href='/AIV/5/10/12'>Deut. 10:12</a>; <a href='/AIV/40/23/23'>Matt. 23:23</a>",
      "comment": "The core of God's will: justice, mercy, humility. This foundation prepares for Christ’s Sermon on the Mount (<a href='/AIV/40/5/3-12'>Matt. 5:3–12</a>); interior transformation is essential, and lived out through personal holiness and ongoing spiritual formation."
    },
    {
      "pk": 2106009,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 9,
      "text": "The LORD’s voice cries out to the city—wisdom fears Your Name: \"Pay attention to the rod and to Him who appointed it.\"",
      "links": "<a href='/AIV/20/1/7'>Prov. 1:7</a>; <a href='/AIV/23/10/5'>Isa. 10:5</a>",
      "comment": "Divine discipline is for correction, not destruction (see <a href='/AIV/58/12/6'>Heb. 12:6</a>). Wisdom comes from reverence and submitting to God’s chosen means of correction."
    },
    {
      "pk": 2106010,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 10,
      "text": "\"Are there still treasures of wickedness in the house of the wicked, and the short measure that is cursed?\"",
      "links": "<a href='/AIV/3/19/35-36'>Lev. 19:35–36</a>; <a href='/AIV/20/11/1'>Prov. 11:1</a>",
      "comment": "Fraud and injustice are condemned, reflecting God’s concern for integrity—a reality lived in all aspects of life, material and spiritual."
    },
    {
      "pk": 2106011,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 11,
      "text": "\"Shall I acquit a person with dishonest scales, with a bag of deceitful weights?\"",
      "links": "<a href='/AIV/20/20/10'>Prov. 20:10</a>; <a href='/AIV/23/1/22'>Isa. 1:22</a>",
      "comment": "Justice in business and every area of life is a sign of true worship and reflects an ordered heart; justice is tangible, almost sacramental."
    },
    {
      "pk": 2106012,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 12,
      "text": "Your rich are full of violence; your inhabitants speak lies, and their tongues are deceitful in their mouths.",
      "links": "<a href='/AIV/19/12/2'>Ps. 12:2</a>; <a href='/AIV/23/59/3'>Isa. 59:3</a>",
      "comment": "Social and personal sins reinforce the need for conversion and grace—our actions must reflect interior holiness, a continual process."
    },
    {
      "pk": 2106013,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 13,
      "text": "Therefore I have struck you down, making you sick because of your sins.",
      "links": "<a href='/AIV/3/26/16'>Lev. 26:16</a>; <a href='/AIV/23/1/5-6'>Isa. 1:5–6</a>",
      "comment": "Divine chastisement is always medicinal, leading back to repentance. Discipline is permitted for spiritual healing and restoration."
    },
    {
      "pk": 2106014,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 14,
      "text": "You will eat, but not be satisfied; your emptiness will remain within you. You will store up, but not keep safe; what you save I will give to the sword.",
      "links": "<a href='/AIV/3/26/26'>Lev. 26:26</a>; <a href='/AIV/5/28/30'>Deut. 28:30</a>",
      "comment": "A lack of true fulfillment signals a need for spiritual food, fulfilled fully in Christ, ‘the Bread of Life’ (<a href='/AIV/43/6/35'>John 6:35</a>), where nourishment is both bodily and spiritual."
    },
    {
      "pk": 2106015,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 15,
      "text": "You will sow, but not reap; you will tread olives, but not anoint yourself with oil; you will press grapes, but not drink the wine.",
      "links": "<a href='/AIV/5/28/38-40'>Deut. 28:38–40</a>",
      "comment": "Material frustration reflects spiritual deprivation. The promise of new wine and oil is fulfilled in the sacraments instituted by Christ for spiritual healing and joy."
    },
    {
      "pk": 2106016,
      "translation": "AIV",
      "book": 33,
      "chapter": 6,
      "verse": 16,
      "text": "You keep the statutes of Omri and all the practices of the house of Ahab, and you walk in their counsels; therefore I will make you a horror, and your inhabitants a scorn; you shall bear the reproach of My people.",
      "links": "<a href='/AIV/11/16/25'>1 Kings 16:25–26</a>; <a href='/AIV/23/65/15'>Isa. 65:15</a>",
      "comment": "Idolatry and sinful traditions bring ruin; following the ways contrary to God’s revealed order brings reproach. True blessing is found in embracing true worship and apostolic faith handed down through the ages."
    }
  ],
  "translatedAt": "2025-12-23T07:32:14.751Z"
}