{
  "book": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 2,
  "verses": [
    {
      "pk": 2102001,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 1,
      "text": "Woe to those who devise wickedness and plot evil on their beds! At morning light they carry it out because it is in their power to do so.",
      "links": "<a href='/AIV/19/36/4'>Ps. 36:4</a>; <a href='/AIV/20/6/14'>Prov. 6:14</a>",
      "comment": "Signifies intentional, premeditated sin. Micah rebukes not only sinful actions, but hearts that willingly plot evil—emphasizing the need for interior conversion, as seen also in Psalm 36:4."
    },
    {
      "pk": 2102002,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 2,
      "text": "They covet fields and seize them, and houses, and take them away. They oppress a man and his house, a man and his inheritance.",
      "links": "<a href='/AIV/02/20/17'>Ex. 20:17</a>; <a href='/AIV/11/21/15'>1 Kgs. 21:15-16</a>",
      "comment": "Echoes the commandment against coveting (Ex. 20:17) and references Naboth's vineyard (1 Kgs. 21). The prophetic warning here targets injustice, especially against the structure of inheritance given by God."
    },
    {
      "pk": 2102003,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 3,
      "text": "Therefore thus says the LORD: Behold, I am planning disaster against this family, from which you will not remove your necks; nor will you walk proudly, for it will be an evil time.",
      "links": "<a href='/AIV/34/1/12'>Nah. 1:12</a>; <a href='/AIV/24/13/16'>Jer. 13:16</a>",
      "comment": "God’s justice is portrayed as inescapable. Notice the contrast of God’s plans with those of the wicked in verse 1. The warning not to ‘walk proudly’ recalls the biblical theme of humility before God."
    },
    {
      "pk": 2102004,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 4,
      "text": "On that day, people will take up a proverb against you and utter a bitter lament, saying, ‘We are utterly ruined; he changes the portion of my people. How he removes it from me! He allots our fields to traitors.’",
      "links": "<a href='/AIV/05/28/37'>Deut. 28:37</a>; <a href='/AIV/18/17/6'>Job 17:6</a>",
      "comment": "Public lament expresses the shame and loss caused by breaking covenant. The removal of inheritance hints toward Israel’s loss in exile, a discipline meant to draw people to repentance and restoration."
    },
    {
      "pk": 2102005,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 5,
      "text": "Therefore, you will have none to cast the line by lot in the assembly of the LORD.",
      "links": "<a href='/AIV/06/18/10'>Josh. 18:10</a>; <a href='/AIV/19/16/6'>Ps. 16:6</a>",
      "comment": "Recall Joshua’s allotment of land; to be excluded from this is a grave consequence—a foretaste of separation from God’s people, which later Christian teaching interprets as a warning against being cut off from the fullness of God’s family."
    },
    {
      "pk": 2102006,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 6,
      "text": "'Do not prophesy!' their prophets say. 'They must not prophesy about these things; disgrace will not overtake us.'",
      "links": "<a href='/AIV/23/30/10'>Isa. 30:10</a>; <a href='/AIV/24/6/14'>Jer. 6:14</a>",
      "comment": "Here, false prophets silence God’s true messages. Compare with Isa. 30:10. Throughout Scripture, a remnant endures while others reject discipline—anticipating the promise of God’s guidance through a faithful teaching authority."
    },
    {
      "pk": 2102007,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 7,
      "text": "Should it be said, O house of Jacob: ‘Is the Spirit of the LORD impatient? Are these his deeds?’ Do not my words do good to those who walk uprightly?",
      "links": "<a href='/AIV/19/25/10'>Ps. 25:10</a>; <a href='/AIV/23/63/10'>Isa. 63:10</a>",
      "comment": "God reminds His people of His justice and mercy; His correction is a form of love. The emphasis on walking uprightly points toward continual conversion and the spiritual benefits of remaining in God’s covenant."
    },
    {
      "pk": 2102008,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 8,
      "text": "But lately my people have risen up as an enemy; you strip off the robe from those who pass by trustingly, men returning from war.",
      "links": "<a href='/AIV/02/22/26'>Ex. 22:26-27</a>; <a href='/AIV/23/3/15'>Isa. 3:15</a>",
      "comment": "The prophet emphasizes exploitation even of the vulnerable. This breach of charity underscores true religion being not just ritual, but works of mercy and justice."
    },
    {
      "pk": 2102009,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 9,
      "text": "You drive the women of my people from their pleasant homes; from their children you take away my glory forever.",
      "links": "<a href='/AIV/05/28/41'>Deut. 28:41</a>; <a href='/AIV/19/127/3'>Ps. 127:3</a>",
      "comment": "Breaking family bonds deprives both present and future generations of God’s blessings. The spiritual sense foreshadows the value of protecting and nurturing the family, as taught throughout Scripture."
    },
    {
      "pk": 2102010,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 10,
      "text": "Arise and go, for this is no place of rest, because of uncleanness that destroys with a grievous destruction.",
      "links": "<a href='/AIV/03/18/25'>Lev. 18:25</a>; <a href='/AIV/58/13/14'>Heb. 13:14</a>",
      "comment": "Micah points to exile as punishment for moral corruption. The hope for a ‘place of rest’ is found in fulfillment through Christ, who prepares a lasting rest for His people (Heb. 13:14)."
    },
    {
      "pk": 2102011,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 11,
      "text": "If a man walks in wind and lies, saying, 'I will prophesy to you of wine and strong drink,’ he would be the prophet for this people!",
      "links": "<a href='/AIV/23/56/12'>Isa. 56:12</a>; <a href='/AIV/24/5/31'>Jer. 5:31</a>",
      "comment": "People prefer prophets who tell them what they want to hear, not the truth. Authentic prophecy is characterized by fidelity to God’s message, not mere popularity—a warning repeated in many New Testament exhortations."
    },
    {
      "pk": 2102012,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 12,
      "text": "I will surely gather all of you, O Jacob; I will surely bring together the remnant of Israel; I will set them together like sheep in a fold, like a flock in its pasture, a noisy multitude of men.",
      "links": "<a href='/AIV/24/23/3'>Jer. 23:3</a>; <a href='/AIV/43/10/16'>John 10:16</a>",
      "comment": "God promises restoration for a faithful remnant—gathered as one flock. Jesus explicitly references this unity in John 10:16, indicating His intention to unite all under one shepherd. There is both a literal return from exile and a greater spiritual gathering in the new covenant."
    },
    {
      "pk": 2102013,
      "translation": "AIV",
      "book": 33,
      "chapter": 2,
      "verse": 13,
      "text": "He who opens the way goes up before them; they break through and pass the gate, going out by it. Their king passes on before them, the LORD at their head.",
      "links": "<a href='/AIV/23/52/12'>Isa. 52:12</a>; <a href='/AIV/58/6/20'>Heb. 6:20</a>",
      "comment": "This verse has messianic overtones: the 'breaker' leading the way speaks of Christ, the true King, leading His people into freedom. For the early Church, this was seen as a prophecy of Jesus opening the way to salvation, prefiguring the leadership of Christ as head of His people (cf. Heb. 6:20; Isa. 52:12)."
    }
  ],
  "translatedAt": "2025-12-23T07:30:52.000Z"
}