{
  "book": 40,
  "bookName": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 6,
  "verses": [
    {
      "pk": 40006001,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 1,
      "text": "Hear what the LORD says: Arise, plead your case before the mountains, and let the hills hear your voice.",
      "links": "<a href='/AIV/23/1/2'>Isa. 1:2</a>; <a href='/AIV/05/32/1'>Deut. 32:1</a>",
      "comment": "God summons creation itself as witnesses in a legal case, showing the universal scope of His judgment and concern. This echoes other passages where heavens and earth are called to witness God's covenantal dealings."
    },
    {
      "pk": 40006002,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 2,
      "text": "Hear, you mountains, the LORD’s accusation, and you enduring foundations of the earth! For the LORD has a case against his people, and He will contend with Israel.",
      "links": "<a href='/AIV/05/32/1'>Deut. 32:1</a>; <a href='/AIV/23/3/13'>Isa. 3:13</a>",
      "comment": "The scene is set for God's direct dealings with Israel. The mountains and foundations, symbolic of permanence, are witnesses to the long-standing nature of God's relationship and the seriousness of Israel's covenant."
    },
    {
      "pk": 40006003,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 3,
      "text": "\"My people, what have I done to you? And how have I wearied you? Answer me!",
      "links": "<a href='/AIV/23/5/4'>Isa. 5:4</a>; <a href='/AIV/02/20/2'>Ex. 20:2</a>",
      "comment": "God speaks tenderly yet directly, using language reminiscent of a caring parent. This verse emphasizes God's faithfulness and asks Israel to honestly evaluate His actions, highlighting His mercy."
    },
    {
      "pk": 40006004,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 4,
      "text": "For I brought you up from the land of Egypt, and redeemed you from the house of slavery; and I sent before you Moses, Aaron, and Miriam.",
      "links": "<a href='/AIV/02/12/51'>Ex. 12:51</a>; <a href='/AIV/19/77/20'>Ps. 77:20</a>",
      "comment": "God recalls how he rescued His people and provided them with divinely appointed leaders—Moses, Aaron (priestly leadership), and Miriam (prophetic leadership). This display of leadership points to the enduring pattern of God guiding His people through spiritual authority."
    },
    {
      "pk": 40006005,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 5,
      "text": "My people, remember what Balak king of Moab plotted, and what Balaam son of Beor answered him; and what happened from Shittim to Gilgal, so that you may know the righteous acts of the LORD.",
      "links": "<a href='/AIV/04/22/2-24/25'>Num. 22:2–24:25</a>; <a href='/AIV/06/4/19'>Josh. 4:19</a>",
      "comment": "References to Balaam's prophecy and the crossing from Shittim to Gilgal recall God's protection and faithfulness. These historical acts point to God’s ongoing work in salvation and his just actions."
    },
    {
      "pk": 40006006,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 6,
      "text": "With what shall I come before the LORD, and bow myself before God on high? Shall I come before Him with burnt offerings, with calves a year old?",
      "links": "<a href='/AIV/19/15/1'>Ps. 15:1</a>; <a href='/AIV/23/1/11'>Isa. 1:11</a>",
      "comment": "This verse reflects a search for the proper way to worship and approach God, questioning if ritual sacrifices alone can satisfy Him. It prepares for the profound revelation of inner righteousness over mere ritual."
    },
    {
      "pk": 40006007,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 7,
      "text": "Will the LORD be pleased with thousands of rams, with ten thousand rivers of oil? Shall I give my firstborn for my transgression, the fruit of my body for the sin of my soul?",
      "links": "<a href='/AIV/19/50/9-13'>Ps. 50:9-13</a>; <a href='/AIV/01/22/2-12'>Gen. 22:2-12</a>",
      "comment": "Hyperbolic offerings represent the futility of external acts without sincere repentance and faith. The mention of 'firstborn' echoes the binding of Isaac, which later finds fulfillment in Christ's sacrificial love—showing true satisfaction is found in a deeper spiritual reality."
    },
    {
      "pk": 40006008,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 8,
      "text": "He has told you, O man, what is good; and what does the LORD require of you but to act justly, to love mercy, and to walk humbly with your God?",
      "links": "<a href='/AIV/23/1/17'>Isa. 1:17</a>; <a href='/AIV/05/10/12'>Deut. 10:12-13</a>",
      "comment": "Here, the essence of authentic faith is defined: justice, mercy, and humble fellowship with God. This holistic obedience prefigures Christ, who perfectly embodied all three—as taught in the Sermon on the Mount and lived in the Gospel narratives. This spiritual path encompasses internal transformation leading to outward righteousness."
    },
    {
      "pk": 40006009,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 9,
      "text": "The voice of the LORD cries out to the city—and wisdom shall see your name: Hear the rod and Him who appointed it.",
      "links": "<a href='/AIV/19/107/43'>Ps. 107:43</a>; <a href='/AIV/20/8/33-36'>Prov. 8:33-36</a>",
      "comment": "God’s voice offers both warning and wisdom, calling all to recognize His authority and correction. The reference to the ‘rod’ evokes discipline that brings true wisdom, a recurring theme in Proverbs. This calls for recognition of God's name and His right to rule and guide."
    },
    {
      "pk": 40006010,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 10,
      "text": "Are there still treasures of wickedness in the house of the wicked, and the scant measure that is cursed?",
      "links": "<a href='/AIV/03/19/35-36'>Lev. 19:35-36</a>; <a href='/AIV/20/11/1'>Prov. 11:1</a>",
      "comment": "Unjust gain, especially through false measurements, is condemned throughout scripture. The principle stands that holiness requires just dealings, and care for the poor and downtrodden—a foreshadowing of Christ’s teaching on justice and the dignity of every person."
    },
    {
      "pk": 40006011,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 11,
      "text": "Shall I acquit someone with dishonest scales, with a bag of deceptive weights?",
      "links": "<a href='/AIV/20/20/10'>Prov. 20:10</a>; <a href='/AIV/19/94/20'>Ps. 94:20</a>",
      "comment": "God’s holiness means He cannot ignore injustice or corruption. His call for honesty parallels the requirement of interior conversion, showing that true righteousness cannot be separated from faithful living."
    },
    {
      "pk": 40006012,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 12,
      "text": "For the rich men of the city are full of violence, and its inhabitants speak lies, and their tongues are deceitful in their mouths.",
      "links": "<a href='/AIV/19/73/6-8'>Ps. 73:6-8</a>; <a href='/AIV/23/59/3'>Isa. 59:3</a>",
      "comment": "The prophets often condemn social injustice as detrimental to true worship. Jesus further intensifies this in the Gospels by calling believers to truth and concern for the marginalized—emphasizing that the faith community is called to both holiness and mercy."
    },
    {
      "pk": 40006013,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 13,
      "text": "Therefore I will strike you with a grievous wound, making you desolate because of your sins.",
      "links": "<a href='/AIV/03/26/16-39'>Lev. 26:16-39</a>; <a href='/AIV/23/1/7'>Isa. 1:7</a>",
      "comment": "God’s judgment here is consistent with covenantal cursing for persistent sin. Yet, in light of salvation history, these judgments ultimately call the people to repentance and restoration, anticipating New Testament themes of discipline leading to grace."
    },
    {
      "pk": 40006014,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 14,
      "text": "You shall eat, but not be satisfied; your emptiness shall remain within you. You will store up, but not save; and what you save I will give to the sword.",
      "links": "<a href='/AIV/03/26/26'>Lev. 26:26</a>; <a href='/AIV/05/28/39'>Deut. 28:39</a>",
      "comment": "Physical deprivation is a result of spiritual emptiness—a recurring Biblical theme. Only authentic relationship with God fulfills. This anticipates Christ’s teaching on Himself as the Bread of Life who alone satisfies."
    },
    {
      "pk": 40006015,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 15,
      "text": "You shall sow, but not reap; you shall tread olives, but not anoint yourself with oil; and tread grapes, but not drink the wine.",
      "links": "<a href='/AIV/05/28/40'>Deut. 28:40</a>; <a href='/AIV/30/5/11'>Amos 5:11</a>",
      "comment": "Frustration of harvest points to the consequences of disobedience. The imagery of oil and wine can subtly point toward later sacramental themes of anointing and spiritual refreshment, which find fullness in the life of the faith community."
    },
    {
      "pk": 40006016,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 6,
      "verse": 16,
      "text": "For you have kept the statutes of Omri and all the works of the house of Ahab, and you walk in their counsels, so I will give you up to destruction, and your people to derision; you shall bear the scorn of my people.",
      "links": "<a href='/AIV/11/16/25'>1 Kings 16:25-30</a>; <a href='/AIV/11/21/25'>1 Kings 21:25</a>",
      "comment": "The reference to idolatrous kings of Israel marks sinfulness through following false models of leadership. This is a reminder to rely on God’s established order and authority, rejecting both self-made religion and rebellion against appointed spiritual governors."
    }
  ],
  "translatedAt": "2025-12-24T09:49:12.119Z"
}