{
  "book": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 5,
  "verses": [
    {
      "pk": 1505001,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 1,
      "text": "Now rally your troops, O daughter of troops; a siege is laid against us. With a rod they strike the judge of Israel on the cheek.",
      "links": "<a href='/AIV/23/7/14'>Isa. 7:14</a>; <a href='/AIV/19/2/2'>Ps. 2:2</a>",
      "comment": "This verse introduces the theme of coming hardship. The 'judge of Israel' foreshadows the humiliation of the Messiah, referencing the striking of Christ (see Matt. 27:30)."
    },
    {
      "pk": 1505002,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 2,
      "text": "But you, Bethlehem Ephrathah, though you are small among the clans of Judah, from you one will come forth for Me who is to be ruler in Israel, whose going out is from of old, from ancient days.",
      "links": "<a href='/AIV/40/2/6'>Matt. 2:6</a>; <a href='/AIV/19/90/2'>Ps. 90:2</a>; <a href='/AIV/01/35/19'>Gen. 35:19</a>",
      "comment": "A pivotal prophecy revealed: Bethlehem is identified as the birthplace of the eternal ruler—directly fulfilled in the birth of Jesus (Matt. 2:1-6). The phrase 'from ancient days' hints at His pre-existence, showing the divine nature of Christ."
    },
    {
      "pk": 1505003,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 3,
      "text": "Therefore He will give them up until the time when she who is in labor has given birth; then the rest of His brothers shall return to the people of Israel.",
      "links": "<a href='/AIV/23/66/7-8'>Isa. 66:7-8</a>; <a href='/AIV/40/1/21'>Matt. 1:21</a>",
      "comment": "The period of waiting concludes with the birth of the Messiah. The 'rest of His brothers' points to the reunification and restoration of God's people, fulfilled in the ministry of Christ and the calling of the nations into one people."
    },
    {
      "pk": 1505004,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 4,
      "text": "And He will stand and shepherd His flock in the strength of the LORD, in the majesty of the name of the LORD His God. And they will dwell secure, for now He will be great to the ends of the earth.",
      "links": "<a href='/AIV/19/23/1-4'>Ps. 23:1-4</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "The Messiah as the Good Shepherd, a role clearly fulfilled by Jesus (see John 10:11). His reign extends 'to the ends of the earth,' indicating a universal kingship. The secure dwelling points to the assurance of belonging to the one true fold."
    },
    {
      "pk": 1505005,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 5,
      "text": "And He will be their peace. When the Assyrian comes into our land and treads in our palaces, then we will raise against him seven shepherds and eight leaders of men.",
      "links": "<a href='/AIV/49/2/14'>Eph. 2:14</a>; <a href='/AIV/23/14/25'>Isa. 14:25</a>",
      "comment": "Christ Himself is declared as peace (Eph. 2:14). The seven shepherds and eight leaders symbolize completeness and abundance of rulers raised for the protection and guidance of God's people."
    },
    {
      "pk": 1505006,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 6,
      "text": "They will shepherd the land of Assyria with the sword, and the land of Nimrod at its entrances; and He will deliver us from the Assyrian when he comes into our land and treads within our borders.",
      "links": "<a href='/AIV/01/10/8-11'>Gen. 10:8-11</a>; <a href='/AIV/23/31/8'>Isa. 31:8</a>",
      "comment": "This prophecy portrays deliverance from Israel's enemies, signifying God's ongoing protection for His people throughout history."
    },
    {
      "pk": 1505007,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 7,
      "text": "Then the remnant of Jacob will be in the midst of many peoples like dew from the LORD, like showers on the grass, which do not wait for man nor delay for the sons of men.",
      "links": "<a href='/AIV/01/45/7'>Gen. 45:7</a>; <a href='/AIV/38/8/12'>Zech. 8:12</a>",
      "comment": "God's people will be a blessing among the nations, a fulfillment seen in the spreading of the Gospel and the fruitful witness of the remnant."
    },
    {
      "pk": 1505008,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 8,
      "text": "And the remnant of Jacob will be among the nations, in the midst of many peoples, like a lion among the beasts of the forest, like a young lion among flocks of sheep, who, when he passes through, tramples and tears in pieces, and there is no one to deliver.",
      "links": "<a href='/AIV/04/24/9'>Num. 24:9</a>; <a href='/AIV/38/10/5'>Zech. 10:5</a>",
      "comment": "The strength and authority of God's people depicted as a lion suggest divine empowerment amid the nations. This points toward Christ's body on earth, carrying spiritual authority and mission."
    },
    {
      "pk": 1505009,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 9,
      "text": "Your hand will be lifted up over your adversaries, and all your enemies will be cut off.",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/66/2/26-27'>Rev. 2:26-27</a>",
      "comment": "Ultimate victory over enemies is promised, a theme fulfilled in the triumph of the Messiah over sin, death, and spiritual adversaries."
    },
    {
      "pk": 1505010,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 10,
      "text": "And in that day, declares the LORD, I will cut off your horses from among you and will destroy your chariots.",
      "links": "<a href='/AIV/05/17/16'>Deut. 17:16</a>; <a href='/AIV/28/14/3'>Hos. 14:3</a>",
      "comment": "God promises to remove reliance on worldly power and military might, refocusing His people on trust in divine provision."
    },
    {
      "pk": 1505011,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 11,
      "text": "I will cut off the cities of your land and tear down all your strongholds.",
      "links": "<a href='/AIV/23/2/12-15'>Isa. 2:12-15</a>; <a href='/AIV/24/1/10'>Jer. 1:10</a>",
      "comment": "The dismantling of fortified cities symbolizes God's intervention to purify His people, calling them to deeper faith rather than dependence on earthly security."
    },
    {
      "pk": 1505012,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 12,
      "text": "And I will cut off witchcrafts from your hand, and you shall have no more soothsayers.",
      "links": "<a href='/AIV/05/18/10-12'>Deut. 18:10-12</a>; <a href='/AIV/23/2/6'>Isa. 2:6</a>",
      "comment": "A clear rejection of occult practices, affirming purity of worship and exclusive reliance on God—anticipating a people spiritually set apart."
    },
    {
      "pk": 1505013,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 13,
      "text": "And I will cut off your carved images and your pillars from among you, and you shall no longer worship the work of your hands.",
      "links": "<a href='/AIV/02/20/4-5'>Ex. 20:4-5</a>; <a href='/AIV/19/115/4-8'>Ps. 115:4-8</a>",
      "comment": "God commands the removal of idolatry, pointing to true worship founded on His revelation and promise. This renewal of faith leads to spiritual unity and authentic devotion."
    },
    {
      "pk": 1505014,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 14,
      "text": "And I will uproot your Asherah poles from among you and destroy your cities.",
      "links": "<a href='/AIV/05/16/21'>Deut. 16:21</a>; <a href='/AIV/23/27/9'>Isa. 27:9</a>",
      "comment": "Purging foreign worship ensures exclusive devotion to the God of Israel. This thorough cleansing prepares for a renewed relationship with God."
    },
    {
      "pk": 1505015,
      "translation": "AIV",
      "book": 33,
      "chapter": 5,
      "verse": 15,
      "text": "And I will take vengeance in anger and wrath on the nations that did not obey.",
      "links": "<a href='/AIV/19/2/12'>Ps. 2:12</a>; <a href='/AIV/45/1/18'>Rom. 1:18</a>",
      "comment": "God's justice is sure for those who persist in disobedience. The call remains open for all to enter His kingdom by faith and obedience, foreshadowed by the Messiah's ultimate authority and return."
    }
  ],
  "translatedAt": "2025-12-23T07:31:57.002Z"
}