{
  "book": 40,
  "bookName": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 2,
  "verses": [
    {
      "pk": 40002001,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 1,
      "text": "Woe to those who devise wickedness and plan evil on their beds! When morning comes, they carry it out because it is in their power to do so.",
      "links": "<a href='/AIV/19/36/4'>Ps. 36:4</a>; <a href='/AIV/23/59/7'>Isa. 59:7</a>",
      "comment": "This verse introduces the judgment against those who actively plan and carry out evil, highlighting the moral responsibility for sinful intentions as well as actions. Similar prophetic warnings appear in Psalms and Isaiah."
    },
    {
      "pk": 40002002,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 2,
      "text": "They covet fields and seize them, and houses, and take them away. They oppress a man and his house, a person and his inheritance.",
      "links": "<a href='/AIV/11/21/2-3'>1 Kings 21:2-3</a>; <a href='/AIV/26/22/27'>Ezek. 22:27</a>",
      "comment": "Micah describes social injustice, particularly theft and oppression of the vulnerable, echoing themes from Naboth’s vineyard and Ezekiel’s condemnation of the rulers. This highlights God’s concern for justice and inheritance, pointing to a harmony rooted in compassion for neighbor. There is also a subtle emphasis on the rightful inheritance—both physical and spiritual—entrusted to God's people, which finds its fullest expression in the Church’s sacraments."
    },
    {
      "pk": 40002003,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 3,
      "text": "Therefore, thus says the LORD: I am planning disaster against this family, from which you cannot remove your necks; you will not walk proudly, for it will be an evil time.",
      "links": "<a href='/AIV/23/10/5-6'>Isa. 10:5-6</a>; <a href='/AIV/29/1/15'>Joel 1:15</a>",
      "comment": "God’s sovereign plan of judgment matches the evil the people devised. The motif of 'yoke' and humiliation reflects the consequences of sin, linking spiritual pride with eventual correction. In the broader revelation, this kind of discipline can purify and prepare for restoration, a theme developed throughout both testaments."
    },
    {
      "pk": 40002004,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 4,
      "text": "On that day they will take up a proverb against you and sing a bitter lament, saying, 'We are utterly ruined; he has changed the portion of my people! How he removes it from me! He allots our fields to traitors.'",
      "links": "<a href='/AIV/24/18/16'>Jer. 18:16</a>; <a href='/AIV/05/28/37'>Deut. 28:37</a>",
      "comment": "Public shame and lost inheritance are part of the curse for covenant unfaithfulness, echoing Deuteronomy and Jeremiah. The idea of God reassigning portions points symbolically to the ways God reforms his people, giving what was promised to new stewards when the original possessors are unfaithful."
    },
    {
      "pk": 40002005,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 5,
      "text": "Therefore, you will have no one to cast the measuring line by lot in the assembly of the LORD.",
      "links": "<a href='/AIV/06/18/10'>Josh. 18:10</a>; <a href='/AIV/19/16/6'>Ps. 16:6</a>",
      "comment": "Losing the right to 'measure by lot' means exclusion from the promised inheritance among God’s people, a serious penalty. This foreshadows the spiritual reality fulfilled in the Christian assembly, where only the faithful partake fully in God’s blessings."
    },
    {
      "pk": 40002006,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 6,
      "text": "'Do not prophesy,' they say to those who prophesy. 'They must not prophesy of such things; disgrace will not overtake us.'",
      "links": "<a href='/AIV/30/7/12-13'>Amos 7:12-13</a>; <a href='/AIV/24/5/12-13'>Jer. 5:12-13</a>",
      "comment": "The people resist true prophecy, preferring comfortable messages even when correction is needed. This echoes the rejection of God’s spokesmen throughout salvation history, underlining the importance of listening to the full counsel of God."
    },
    {
      "pk": 40002007,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 7,
      "text": "Should it be said, 'O house of Jacob, is the Spirit of the LORD impatient? Are these his deeds?' Do not my words do good to the one who walks uprightly?",
      "links": "<a href='/AIV/23/55/10-11'>Isa. 55:10-11</a>; <a href='/AIV/19/19/7-11'>Ps. 19:7-11</a>",
      "comment": "Micah rebukes those who question God's justice, affirming that God’s words bless the righteous. This speaks to divine patience and the goodness found in obedience, a spiritual truth carried on in all who remain faithful in every generation."
    },
    {
      "pk": 40002008,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 8,
      "text": "But lately my people have risen up as an enemy; you strip the robe from those who pass by trustingly, like men returning from war.",
      "links": "<a href='/AIV/19/55/20'>Ps. 55:20</a>; <a href='/AIV/16/5/15'>Neh. 5:15</a>",
      "comment": "The prophet laments that the people have become adversaries of their own brethren, highlighting internal injustice. The stripping of the robe indicates both material and symbolic harm, contrary to God’s command to love one’s neighbor and care for the poor."
    },
    {
      "pk": 40002009,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 9,
      "text": "You drive the women of my people from their pleasant houses; from their young children you take away my glory forever.",
      "links": "<a href='/AIV/23/10/2'>Isa. 10:2</a>; <a href='/AIV/19/127/3'>Ps. 127:3</a>",
      "comment": "The oppression affects families deeply, particularly women and children. Removing 'my glory' alludes to the spiritual heritage and presence of God, which passes through generations—especially as passed on through the home and communal worship."
    },
    {
      "pk": 40002010,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 10,
      "text": "Arise and go, for this is no longer your resting place, because of uncleanness that destroys, with a grievous destruction.",
      "links": "<a href='/AIV/03/18/25'>Lev. 18:25</a>; <a href='/AIV/58/13/14'>Heb. 13:14</a>",
      "comment": "Judgment brings exile—'arise and go' is a warning that the promised land will not remain their home if they persist in impurity. The reference to uncleanness recalls Levitical standards for holiness, prefiguring the final rest promised in Christ."
    },
    {
      "pk": 40002011,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 11,
      "text": "If a man comes, uttering wind and lies, saying, 'I will prophesy to you of wine and strong drink,' he would be the prophet for this people!",
      "links": "<a href='/AIV/24/5/31'>Jer. 5:31</a>; <a href='/AIV/23/30/10'>Isa. 30:10</a>",
      "comment": "Micah exposes the people’s desire for prophets who promise material pleasure and comfort, not truth. The warning about 'false prophets' who appeal to the passions of the crowd remains relevant, underscoring the need for discernment in receiving teaching."
    },
    {
      "pk": 40002012,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 12,
      "text": "Surely I will gather all of you, O Jacob; I will assemble the remnant of Israel. I will bring them together like sheep in a fold, like a flock in the midst of their pasture—noisy with many people.",
      "links": "<a href='/AIV/23/11/11-12'>Isa. 11:11-12</a>; <a href='/AIV/43/10/16'>John 10:16</a>",
      "comment": "God’s promise to gather the faithful remnant points to hope beyond judgment. The image of sheep in a fold anticipates Christ as the Good Shepherd who unites his flock—a key theme Jesus fulfills (see John 10:16). This also prefigures the unity of God’s people under one spiritual shepherd, sign of the unity God desires in worship and doctrine."
    },
    {
      "pk": 40002013,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 2,
      "verse": 13,
      "text": "The one who breaks open the way goes before them; they break out, pass through the gate, and go out. Their king passes on before them, the LORD at their head.",
      "links": "<a href='/AIV/52/4/16'>1 Thess. 4:16</a>; <a href='/AIV/43/14/6'>John 14:6</a>",
      "comment": "The 'breaker' and the 'king'—the LORD himself—lead the people to liberation and safety. Early Christians saw this as a prophecy of Christ, the ultimate leader and deliverer. Jesus as both Shepherd and King paves the way for his people into the fullness of God's promises. This spiritual leadership and unity find continuity through the visible, ordered assembly centered on Christ’s authority."
    }
  ],
  "translatedAt": "2025-12-24T09:47:56.142Z"
}