{
  "book": 40,
  "bookName": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 1,
  "verses": [
    {
      "pk": 40001001,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 1,
      "text": "The word of the Lord that came to Micah the Morasthite in the days of Jotham, Ahaz, and Hezekiah, kings of Judah, which he saw concerning Samaria and Jerusalem.",
      "links": "<a href='/AIV/23/1/1'>Isa. 1:1</a>; <a href='/AIV/24/23/13'>Jer. 23:13</a>",
      "comment": "Micah is identified as a prophet who ministered during the reigns of these Judean kings. Note the focus on both Samaria and Jerusalem, representing the northern and southern kingdoms. The phrase 'word of the Lord' asserts divine inspiration and authority, a mark of true prophecy."
    },
    {
      "pk": 40001002,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 2,
      "text": "Hear, all you peoples! Pay attention, O earth, and all who are in it! And let the Lord God be a witness against you, the Lord from his holy temple.",
      "links": "<a href='/AIV/05/32/1'>Deut. 32:1</a>; <a href='/AIV/19/50/1-4'>Ps. 50:1-4</a>",
      "comment": "The call to all nations shows the universality of God's message and judgment. The reference to God's holy temple hints at His presence not just locally but as a transcendent reality—foreshadowing the spiritual temple established in Christ and His Church. The call is both juridical and liturgical, echoing heavenly court imagery."
    },
    {
      "pk": 40001003,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 3,
      "text": "For behold, the Lord is coming out from his place, and will come down and tread upon the high places of the earth.",
      "links": "<a href='/AIV/19/18/9-10'>Ps. 18:9-10</a>; <a href='/AIV/23/26/21'>Isa. 26:21</a>",
      "comment": "This image of God's descent recalls theophanies where the Lord intervenes directly in history. 'High places' refer to both literal hills and sites of idolatry; the passage sets a tone of judgment and purification. Spiritually, it foresees the incarnation—God coming among men."
    },
    {
      "pk": 40001004,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 4,
      "text": "The mountains will melt beneath him, and the valleys will split open, like wax before the fire, like waters poured down a steep place.",
      "links": "<a href='/AIV/19/97/5'>Ps. 97:5</a>; <a href='/AIV/34/1/5-6'>Nah. 1:5-6</a>",
      "comment": "This poetic imagery speaks to the irresistible power of God's presence. The mountains melting and valleys splitting symbolize the undoing of creation's order in the face of divine judgment. Spiritually, such language is echoed at the cross, when nature reacts to the death of Christ (see <a href='/AIV/40/27/51'>Matt. 27:51</a>)."
    },
    {
      "pk": 40001005,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 5,
      "text": "All this is because of the transgression of Jacob, and because of the sins of the house of Israel. What is the transgression of Jacob? Is it not Samaria? And what are the high places of Judah? Are they not Jerusalem?",
      "links": "<a href='/AIV/11/12/28-30'>1 Kings 12:28-30</a>; <a href='/AIV/23/1/4-9'>Isa. 1:4-9</a>",
      "comment": "Sin in Samaria and Jerusalem—centers of worship and power—has brought about this judgment. Note the emphasis on both Israel (Samaria) and Judah (Jerusalem), pointing to corporate responsibility and leadership's influence in communal sin. The reference to 'high places' is both literal and symbolic of worship gone astray."
    },
    {
      "pk": 40001006,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 6,
      "text": "Therefore I will make Samaria a heap in the open country, a place for planting vineyards; and I will pour down her stones into the valley and uncover her foundations.",
      "links": "<a href='/AIV/24/26/18'>Jer. 26:18</a>; <a href='/AIV/28/13/16'>Hos. 13:16</a>",
      "comment": "The destruction foretold is severe and complete—Samaria will be reduced to ruins fit only for agriculture, her grandeur stripped bare. This judgment points to God's concern for holiness and foreshadows Christ's later teaching on cities that reject the message (see <a href='/AIV/40/11/21-22'>Matt. 11:21-22</a>)."
    },
    {
      "pk": 40001007,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 7,
      "text": "All her carved images shall be beaten to pieces, and all her wages shall be burned with fire, and all her idols I will lay waste; for from the wages of a prostitute she gathered them, and to the wages of a prostitute they shall return.",
      "links": "<a href='/AIV/26/16/33-41'>Ezek. 16:33-41</a>; <a href='/AIV/28/2/5'>Hos. 2:5</a>",
      "comment": "Idolatry is described as unfaithfulness, similar to adultery. The destruction of idols purifies the people, a recurring theme fulfilled when Christ cleanses the Temple. The link between idolatry and immorality hints at the spiritual dangers of false worship, a warning relevant for the Church as the new Israel."
    },
    {
      "pk": 40001008,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 8,
      "text": "For this I will lament and wail; I will go stripped and naked; I will make lamentation like the jackals, and mourning like the ostriches.",
      "links": "<a href='/AIV/24/9/1'>Jer. 9:1</a>; <a href='/AIV/18/30/29'>Job 30:29</a>",
      "comment": "Micah personally takes on a prophetic mourning, symbolizing deep empathy for his people. His dramatic grief prefigures Jesus' lament over Jerusalem (see <a href='/AIV/42/19/41-44'>Luke 19:41-44</a>), showing the role of the prophet as both intercessor and spiritual leader."
    },
    {
      "pk": 40001009,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 9,
      "text": "For her wound is incurable; it has come up to Judah. It has reached the gate of my people—to Jerusalem.",
      "links": "<a href='/AIV/23/1/6'>Isa. 1:6</a>; <a href='/AIV/24/30/12'>Jer. 30:12</a>",
      "comment": "The spread of sin is likened to an incurable disease, threatening even God's chosen city. The gravity of the situation prefigures the need for radical healing—ultimately accomplished by Christ, the divine physician, who brings God's mercy through sacramental grace (<a href='/AIV/40/9/12'>Matt. 9:12</a>)."
    },
    {
      "pk": 40001010,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 10,
      "text": "Do not tell it in Gath; do not weep at all. In Beth-le-aphrah, roll yourself in the dust.",
      "links": "<a href='/AIV/10/1/20'>2 Sam. 1:20</a>",
      "comment": "The reference to Gath, a Philistine city, echoes David's lament, while rolling in the dust at Beth-le-aphrah represents deep mourning. The prophet's careful instructions recall traditional expressions of grief and also stress the importance of rightly ordered worship and liturgical practice in times of suffering."
    },
    {
      "pk": 40001011,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 11,
      "text": "Pass on, inhabitants of Shaphir, in naked shame; the inhabitants of Zaanan do not come out. Beth-ezel is mourning; its support is taken away from you.",
      "links": "<a href='/AIV/23/20/4'>Isa. 20:4</a>",
      "comment": "Each city's judgment carries a symbolic meaning through wordplay on their names—Shaphir (beauty) shamed, Zaanan (going out) not coming out. Such attention to names highlights the prophetic use of symbolism and the depth of biblical literary artistry."
    },
    {
      "pk": 40001012,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 12,
      "text": "For the inhabitants of Maroth writhe in pain for good, because disaster has come down from the Lord to the gate of Jerusalem.",
      "links": "<a href='/AIV/24/6/26'>Jer. 6:26</a>",
      "comment": "The agony of Maroth ('bitterness') shows suffering for the hope of good amid disaster. The Lord's action is sovereign, reminding us that even painful trials can serve as a path to deeper communion with God and purification for His people."
    },
    {
      "pk": 40001013,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 13,
      "text": "Harness the chariot to the steeds, inhabitants of Lachish—you were the beginning of sin for the daughter of Zion, for in you the transgressions of Israel were found.",
      "links": "<a href='/AIV/12/18/14'>2 Kings 18:14</a>",
      "comment": "Lachish, on the border, was a conduit of Israel's idolatry into Judah. The command to 'harness the chariot' is a call to face imminent judgment. Note the interconnectedness of the people of God—a lesson about the spiritual solidarity of believers and the far-reaching effects of sin."
    },
    {
      "pk": 40001014,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 14,
      "text": "Therefore you shall give parting gifts to Moresheth-Gath; the houses of Achzib shall be a deception to the kings of Israel.",
      "links": "<a href='/AIV/06/15/44'>Josh. 15:44</a>",
      "comment": "Moresheth-Gath's tribute and Achzib's untrustworthiness reveal the breakdown of national unity and trust. Wordplay here ties the city's name ('Achzib' means 'deception') to its fate, again highlighting both the literal and deeper spiritual dimension present in prophetic texts."
    },
    {
      "pk": 40001015,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 15,
      "text": "I will yet bring a conqueror to you, inhabitants of Mareshah; the glory of Israel shall come to Adullam.",
      "links": "<a href='/AIV/09/22/1'>1 Sam. 22:1</a>",
      "comment": "Mareshah is warned of coming invasion; 'the glory of Israel' coming to Adullam (a place of refuge for David) signals a humbled remnant seeking shelter. This hints at divine protection and the eventual gathering of God's faithful—prefigured in Christ who gathers the scattered into unity."
    },
    {
      "pk": 40001016,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 1,
      "verse": 16,
      "text": "Shave your head and cut off your hair for the children you love; make yourself bald as an eagle, for they shall go from you into exile.",
      "links": "<a href='/AIV/23/22/12'>Isa. 22:12</a>; <a href='/AIV/05/14/1'>Deut. 14:1</a>",
      "comment": "This penitential gesture of mourning for lost children prefigures the spiritual lament for the loss of communion caused by sin and exile. The passage affirms the importance of repentance and external signs of interior conversion—a practice rooted in biblical tradition and continued in the life of the Church. Christ Himself calls for repentance, promising to restore those who return (<a href='/AIV/42/15/20'>Luke 15:20</a>)."
    }
  ],
  "translatedAt": "2025-12-24T09:47:32.244Z"
}