{
  "book": 40,
  "bookName": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 3,
  "verses": [
    {
      "pk": 40003001,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 3,
      "verse": 1,
      "text": "And I said, 'Listen now, leaders of Jacob, and rulers of the house of Israel! Should you not know justice?'",
      "links": "<a href='/AIV/23/1/23'>Isa. 1:23</a>; <a href='/AIV/20/8/15'>Prov. 8:15</a>",
      "comment": "Micah rebukes the leaders for their failure to practice justice, reminding them of their duty before God. This reflects on the responsibility God gives leadership to be righteous—a theme echoed throughout the Old Testament and crucial in apostolic succession in the early Church."
    },
    {
      "pk": 40003002,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 3,
      "verse": 2,
      "text": "You who hate good and love evil, who tear the skin from off my people and the flesh from their bones—",
      "links": "<a href='/AIV/23/5/7-8'>Isa. 5:7-8</a>; <a href='/AIV/26/34/2-4'>Ezek. 34:2-4</a>",
      "comment": "The vivid imagery emphasizes the corruption and abuse of power. Spiritual leaders must defend the flock, prefiguring the care entrusted to the apostles and their successors."
    },
    {
      "pk": 40003003,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 3,
      "verse": 3,
      "text": "who eat the flesh of my people, strip their skin from them, break their bones, and chop them up like meat for the cooking pot.",
      "links": "<a href='/AIV/19/53/4'>Ps. 53:4</a>",
      "comment": "The metaphor illustrates the extent of the leaders' evil; it's both literal violence and spiritual betrayal. This passage anticipates Christ as the true shepherd who gives Himself, contrasting with the selfishness of false shepherds."
    },
    {
      "pk": 40003004,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 3,
      "verse": 4,
      "text": "Then they will cry out to the LORD, but He will not answer them; He will hide His face from them at that time because they have done evil.",
      "links": "<a href='/AIV/19/66/18'>Ps. 66:18</a>; <a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "Divine justice is withheld from those who persist in wickedness. The separation recalls sin’s effect on communion with God, which is restored only through repentance and sacramental reconciliation."
    },
    {
      "pk": 40003005,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 3,
      "verse": 5,
      "text": "Thus says the LORD about the prophets who mislead my people, who cry 'Peace' when they have something to eat, but prepare war against those who put nothing into their mouths:",
      "links": "<a href='/AIV/24/5/31'>Jer. 5:31</a>; <a href='/AIV/26/13/10'>Ezek. 13:10</a>",
      "comment": "False teaching for personal gain is condemned. This highlights the importance of sound doctrine passed down from the apostles, safeguarded by faithful tradition."
    },
    {
      "pk": 40003006,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 3,
      "verse": 6,
      "text": "Therefore night will come upon you, with no vision, and darkness, without divination; the sun will go down on the prophets, and the day will grow black over them.",
      "links": "<a href='/AIV/23/8/20-22'>Isa. 8:20-22</a>",
      "comment": "Prophetic vision ceases for the corrupt; spiritual blindness results from rejecting the light of truth, which is manifest fully in Christ and maintained in His Church."
    },
    {
      "pk": 40003007,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 3,
      "verse": 7,
      "text": "The seers will be ashamed and the diviners will be disgraced; they will all cover their faces, because there is no answer from God.",
      "links": "<a href='/AIV/23/29/10'>Isa. 29:10</a>",
      "comment": "God withdraws revelation from those who misuse their calling. Spiritual gifts are authentic only when aligned with divine authority and tradition handed down through apostolic succession."
    },
    {
      "pk": 40003008,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 3,
      "verse": 8,
      "text": "But as for me, I am filled with power—with the Spirit of the LORD—and with justice and strength, to declare to Jacob his transgression and to Israel his sin.",
      "links": "<a href='/AIV/24/15/19-21'>Jer. 15:19-21</a>; <a href='/AIV/43/16/8'>John 16:8</a>",
      "comment": "True prophetic ministry is empowered by the Spirit and boldness in proclaiming truth. This foreshadows Jesus and the apostles, who act with divine authority and infallibility."
    },
    {
      "pk": 40003009,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 3,
      "verse": 9,
      "text": "Now hear this, heads of the house of Jacob and rulers of the house of Israel, who despise justice and twist all that is right:",
      "links": "<a href='/AIV/23/5/23-24'>Isa. 5:23-24</a>",
      "comment": "The call to uprightness reaffirms the foundational role of justice, a virtue essential for any true leader in the community of faith."
    },
    {
      "pk": 40003010,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 3,
      "verse": 10,
      "text": "They build Zion with blood and Jerusalem with wickedness.",
      "links": "<a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "Evil foundations corrupt communities; the contrast is visible in how Christ builds His Church on the apostles, establishing it on truth and sacrificial love."
    },
    {
      "pk": 40003011,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 3,
      "verse": 11,
      "text": "Her leaders judge for bribes, her priests teach for a price, and her prophets divine for money. Yet they lean on the LORD and say, 'Is not the LORD among us? No disaster will come upon us.'",
      "links": "<a href='/AIV/24/6/13'>Jer. 6:13</a>; <a href='/AIV/26/22/25-28'>Ezek. 22:25-28</a>",
      "comment": "The temptation to use spiritual gifts for personal benefit is condemned. True ministry is freely given, sustained by divine authority and faithful stewardship, prefiguring the life of grace in the New Covenant."
    },
    {
      "pk": 40003012,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 3,
      "verse": 12,
      "text": "Therefore because of you, Zion will be plowed like a field, Jerusalem will become a heap of ruins, and the temple mount will be a thicket.",
      "links": "<a href='/AIV/24/26/18'>Jer. 26:18</a>; <a href='/AIV/41/13/2'>Mark 13:2</a>",
      "comment": "The consequences of spiritual corruption are destruction and loss of God’s presence. The promise of restoration finds fulfillment in Christ, who rebuilds the spiritual temple through His self-giving and the enduring foundation of the apostolic Church."
    }
  ],
  "translatedAt": "2025-12-24T09:48:10.225Z"
}