{
  "book": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 3,
  "verses": [
    {
      "pk": 2100301,
      "translation": "AIV",
      "book": 33,
      "chapter": 3,
      "verse": 1,
      "text": "Then I said, \"Listen now, leaders of Jacob, you rulers of the house of Israel! Is it not your responsibility to know justice?\"",
      "links": "<a href='/AIV/23/1/23'>Isa. 1:23</a>; <a href='/AIV/19/82/1-2'>Ps. 82:1–2</a>",
      "comment": "Micah challenges the leaders’ divine obligation to know and act justly—a frequent theme in prophetic literature (see Isaiah 1:23). Spiritual leaders have an enduring responsibility to seek God’s justice, a call that later echoes in New Testament teachings on pastoral care and apostolic authority."
    },
    {
      "pk": 2100302,
      "translation": "AIV",
      "book": 33,
      "chapter": 3,
      "verse": 2,
      "text": "But you hate good and love evil. You tear the skin from my people and the flesh from their bones.",
      "links": "<a href='/AIV/19/14/4'>Ps. 14:4</a>; <a href='/AIV/26/34/3-4'>Ezek. 34:3–4</a>",
      "comment": "The vivid imagery here underscores the leaders' exploitation. The shepherd metaphor, expanded in Ezekiel (Ezek. 34), later finds fulfillment in Christ as the Good Shepherd who cares for His flock. The spiritual meaning involves the responsibility of those in authority to care for souls."
    },
    {
      "pk": 2100303,
      "translation": "AIV",
      "book": 33,
      "chapter": 3,
      "verse": 3,
      "text": "You devour the flesh of my people, strip off their skin, break their bones, and chop them up like meat in a pot, like flesh in a cauldron.",
      "links": "<a href='/AIV/19/53/4'>Ps. 53:4</a>; <a href='/AIV/23/9/19'>Isa. 9:19</a>",
      "comment": "This dark metaphor illustrates total corruption—paralleling other prophecies relating to judgement on shepherds (Isaiah 9:19). The physical description emphasizes spiritual decay. Early Christian commentators saw in this the danger of neglecting the needs of the faithful."
    },
    {
      "pk": 2100304,
      "translation": "AIV",
      "book": 33,
      "chapter": 3,
      "verse": 4,
      "text": "Then they will cry out to the LORD, but He will not answer them. He will hide His face from them at that time, because of the evil they have done.",
      "links": "<a href='/AIV/19/66/18'>Ps. 66:18</a>; <a href='/AIV/20/1/28'>Prov. 1:28</a>",
      "comment": "Sin creates separation from God. The motif of God 'hiding His face’ recurs in scripture, noting that justice and mercy are intertwined (see Proverbs 1:28). This foreshadows the New Testament teaching on repentance and reconciliation, especially through the authority given to the apostles in John 20:23."
    },
    {
      "pk": 2100305,
      "translation": "AIV",
      "book": 33,
      "chapter": 3,
      "verse": 5,
      "text": "Thus says the LORD about the prophets who mislead my people, who cry 'Peace' when they have food to eat, but prepare war against those who do not put something in their mouths:",
      "links": "<a href='/AIV/24/6/14'>Jer. 6:14</a>; <a href='/AIV/26/13/10'>Ezek. 13:10</a>",
      "comment": "False prophets abused their position for personal gain. Spiritual interpretation recognizes the prophetic office as divinely instituted, with the expectation of truth. The division over food has echoes in early Christian disputes about table fellowship and in warnings about false teachers (see 2 Peter 2:1)."
    },
    {
      "pk": 2100306,
      "translation": "AIV",
      "book": 33,
      "chapter": 3,
      "verse": 6,
      "text": "Therefore night will come upon you—without vision—and darkness for you—without divination. The sun will set on the prophets, and the day will grow dark over them.",
      "links": "<a href='/AIV/23/8/22'>Isa. 8:22</a>; <a href='/AIV/24/15/9'>Jer. 15:9</a>",
      "comment": "The loss of prophecy signals abandonment by God, later fulfilled in the intertestamental period's prophetic silence. The motif of ‘darkness’ points forward to the arrival of Christ, the true light (John 1:4–5; 8:12). In tradition, the authority to interpret and proclaim God's Word rests on those truly commissioned by Him."
    },
    {
      "pk": 2100307,
      "translation": "AIV",
      "book": 33,
      "chapter": 3,
      "verse": 7,
      "text": "The seers will be ashamed and the diviners disgraced. They will all cover their faces, because there will be no answer from God.",
      "links": "<a href='/AIV/23/29/10'>Isa. 29:10</a>; <a href='/AIV/19/34/5'>Ps. 34:5</a>",
      "comment": "The humiliation of the false prophets contrasts with the true prophet’s glory. Spiritual shame reflects disconnection from divine guidance. Traditionally, teachers who stray from the truth are seen as subject to divine discipline, while those who remain faithful share in divine revelation."
    },
    {
      "pk": 2100308,
      "translation": "AIV",
      "book": 33,
      "chapter": 3,
      "verse": 8,
      "text": "But as for me, I am filled with power—with the Spirit of the LORD—and with justice and might, to declare to Jacob his transgression and to Israel his sin.",
      "links": "<a href='/AIV/19/51/11'>Ps. 51:11</a>; <a href='/AIV/42/1/15'>Luke 1:15</a>",
      "comment": "Micah contrasts himself with the false prophets, highlighting the true prophet’s empowerment by the Spirit of the LORD, foreshadowing the Spirit’s role in the apostles and in the Church’s teaching authority (Acts 2:4). This links Old Testament prophetic witness with New Testament apostolic mission."
    },
    {
      "pk": 2100309,
      "translation": "AIV",
      "book": 33,
      "chapter": 3,
      "verse": 9,
      "text": "Hear this, leaders of the house of Jacob, rulers of the house of Israel, you who despise justice and make everything crooked that is right;",
      "links": "<a href='/AIV/19/58/1'>Ps. 58:1</a>; <a href='/AIV/23/10/1-2'>Isa. 10:1–2</a>",
      "comment": "The leadership is again condemned for perverting justice, similar to themes in Isaiah and Psalms (see Psalm 58:1). Spiritual authority must be exercised in holy fear and love for God, underlining the importance of doctrine and tradition handed down faithfully."
    },
    {
      "pk": 2100310,
      "translation": "AIV",
      "book": 33,
      "chapter": 3,
      "verse": 10,
      "text": "You build Zion with blood, and Jerusalem with wickedness.",
      "links": "<a href='/AIV/19/127/1'>Ps. 127:1</a>; <a href='/AIV/26/22/27'>Ezek. 22:27</a>",
      "comment": "Unjust foundations cannot endure. The contrast of earthly power with spiritual purity anticipates New Testament images of the new Jerusalem, built not of violence but of grace and sacrificial love (see Hebrews 12:22). This verse critiques worldly ambition and exalts divine authority."
    },
    {
      "pk": 2100311,
      "translation": "AIV",
      "book": 33,
      "chapter": 3,
      "verse": 11,
      "text": "Her leaders judge for a bribe, her priests teach for price, and her prophets give omens for money—yet they lean on the LORD and say, 'Is not the LORD among us? No harm will come upon us.'",
      "links": "<a href='/AIV/24/5/12'>Jer. 5:12</a>; <a href='/AIV/26/22/26'>Ezek. 22:26</a>",
      "comment": "The passage critiques the commercialization of sacred offices and presumption on God’s protection. Spiritual interpretation cautions against relying on God's presence apart from personal and communal holiness. The priestly, teaching, and prophetic functions here prefigure the New Testament's threefold ministry, which is later affirmed by apostolic succession."
    },
    {
      "pk": 2100312,
      "translation": "AIV",
      "book": 33,
      "chapter": 3,
      "verse": 12,
      "text": "Therefore, because of you, Zion will be plowed like a field, Jerusalem will become heaps of rubble, and the temple hill a forested height.",
      "links": "<a href='/AIV/24/26/18'>Jer. 26:18</a>; <a href='/AIV/40/24/2'>Matt. 24:2</a>",
      "comment": "Micah's prophecy of Jerusalem’s destruction anticipates fulfillment during the Babylonian exile, and later Christ’s prophecy in Mark 13:2 and Matthew 24:2. Interpreted both literally and spiritually, it warns that rejection of God’s law leads to desolation, but hints toward restoration through a messianic hope fulfilled in Christ and in the enduring presence of God’s people."
    }
  ],
  "translatedAt": "2025-12-23T07:31:09.220Z"
}