{
  "book": 36,
  "bookName": "Joel",
  "bookAbbreviation": "Joel",
  "chapter": 3,
  "verses": [
    {
      "pk": 36003001,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 1,
      "text": "For, behold, in those days and at that time, when I restore the fortunes of Judah and Jerusalem,",
      "links": "<a href='/AIV/24/30/3'>Jer. 30:3</a>; <a href='/AIV/26/39/25'>Ezek. 39:25'>Ezek. 39:25</a>",
      "comment": "Joel begins a prophecy about the last days and the restoration of God's people, showing a pattern of divine mercy and restoration seen throughout scripture."
    },
    {
      "pk": 36003002,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 2,
      "text": "I will gather all the nations and bring them down to the Valley of Jehoshaphat; there I will enter into judgment with them on behalf of my people and my inheritance, Israel, whom they scattered among the nations; and they divided up my land.",
      "links": "<a href='/AIV/23/66/18'>Isa. 66:18</a>; <a href='/AIV/26/38/22'>Ezek. 38:22</a>; <a href='/AIV/38/12/3'>Zech. 12:3</a>",
      "comment": "The 'Valley of Jehoshaphat' symbolizes God's final judgment, echoing universal themes of God's justice. The scattering of Israel points to events both historic and prophetic, with restoration and judgment intertwined."
    },
    {
      "pk": 36003003,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 3,
      "text": "They have cast lots for my people; traded boys for prostitutes, and sold girls for wine, that they might drink.",
      "links": "<a href='/AIV/25/5/13'>Lam. 5:13</a>",
      "comment": "Describes the abuse and dehumanization of Israel. The selling of children for trivial pleasures exposes the depth of societal corruption that draws God’s wrath."
    },
    {
      "pk": 36003004,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 4,
      "text": "Also, what are you to me, Tyre and Sidon, and all the regions of Philistia? Are you repaying me for something? If you repay me, swiftly and quickly I will return your payment upon your own head.",
      "links": "<a href='/AIV/26/28/22'>Ezek. 28:22</a>; <a href='/AIV/24/47/4'>Jer. 47:4</a>",
      "comment": "God addresses Tyre, Sidon, and Philistia (Gentile powers), emphasizing His sovereignty over all nations. This counteraction signifies divine justice and the futility of human rebellion."
    },
    {
      "pk": 36003005,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 5,
      "text": "For you have taken my silver and my gold, and carried my precious treasures into your temples.",
      "links": "<a href='/AIV/26/7/20'>Ezek. 7:20</a>; <a href='/AIV/12/14/14'>2 Kings 14:14</a>",
      "comment": "Describes theft of sacred items, which have spiritual implications regarding the desecration of what belongs to God. The concept of sacred objects reflects deeper realities about worship and reverence."
    },
    {
      "pk": 36003006,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 6,
      "text": "You sold the people of Judah and Jerusalem to the Greeks, in order to remove them far from their own border.",
      "links": "<a href='/AIV/16/13/23'>Neh. 13:23</a>",
      "comment": "Selling God's people to foreign lands highlights the spiritual exile and longing for true homecoming—a prophecy later fulfilled in Christ’s gathering of scattered peoples."
    },
    {
      "pk": 36003007,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 7,
      "text": "See, I will rouse them from the place you sold them, and I will return your own action on your head.",
      "links": "<a href='/AIV/19/79/11'>Ps. 79:11</a>; <a href='/AIV/36/1/15'>Zeph. 1:15</a>",
      "comment": "God promises reversal of injustice. The spiritual principle: God's justice never fails; those who persecute His people face divine recompense."
    },
    {
      "pk": 36003008,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 8,
      "text": "I will sell your sons and your daughters into the hand of the people of Judah, and they shall sell them to the Sabeans, to a nation far away; for the LORD has spoken.",
      "links": "<a href='/AIV/01/10/7'>Gen. 10:7</a>",
      "comment": "God’s retribution turns the tables. Shows emphasis on the gravity of violating God’s covenant people and reminds of God's fidelity."
    },
    {
      "pk": 36003009,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 9,
      "text": "Proclaim this among the nations: Prepare for war! Stir up the mighty. Let all the fighters draw near; let them come up.",
      "links": "<a href='/AIV/26/38/7'>Ezek. 38:7</a>; <a href='/AIV/29/3/2'>Joel 3:2</a>",
      "comment": "The imagery of martial summons foreshadows eschatological battle. Interpreted both literally and spiritually, it points to spiritual preparation and vigilance before the Day of the Lord."
    },
    {
      "pk": 36003010,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 10,
      "text": "Beat your plowshares into swords, and your pruning hooks into spears; let the weak say, 'I am a warrior.'",
      "links": "<a href='/AIV/23/2/4'>Isa. 2:4</a>; <a href='/AIV/33/4/3'>Mic. 4:3</a>",
      "comment": "A reversal of the peace prophecy (see Isaiah 2:4), signifying the seriousness of the coming judgment. Also points to the spiritual call for every believer to be prepared for battle (Eph. 6:10-18)."
    },
    {
      "pk": 36003011,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 11,
      "text": "Hasten and come, all you surrounding nations, and assemble yourselves. Bring down, O LORD, your mighty ones.",
      "links": "<a href='/AIV/26/38/7'>Ezek. 38:7</a>; <a href='/AIV/66/19/19'>Rev. 19:19</a>",
      "comment": "The assembling of nations shows both a literal gathering for battle and a spiritual gathering for divine judgment. The 'mighty ones' refers to angelic hosts or sanctified people."
    },
    {
      "pk": 36003012,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 12,
      "text": "Let the nations rise and advance to the Valley of Jehoshaphat; for there I will sit to judge all the surrounding nations.",
      "links": "<a href='/AIV/19/9/8'>Ps. 9:8</a>; <a href='/AIV/66/20/11-15'>Rev. 20:11-15</a>",
      "comment": "God Himself is the judge. Valley of Jehoshaphat functions as imagery for the great judgment scene, connecting Old Testament justice traditions to the final judgment depicted in Revelation."
    },
    {
      "pk": 36003013,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 13,
      "text": "Put in the sickle, for the harvest is ripe. Go in and tread, for the winepress is full. The vats overflow, for their wickedness is great.",
      "links": "<a href='/AIV/23/63/3'>Isa. 63:3</a>; <a href='/AIV/66/14/15-20'>Rev. 14:15-20</a>",
      "comment": "The harvest and winepress imagery indicate imminent judgment. Revelation references explicitly connect this prophecy to New Testament eschatology, with strong christological implications regarding the final separation."
    },
    {
      "pk": 36003014,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 14,
      "text": "Multitudes, multitudes in the valley of decision! For the day of the LORD is near in the valley of decision.",
      "links": "<a href='/AIV/19/96/13'>Ps. 96:13</a>; <a href='/AIV/66/16/16'>Rev. 16:16</a>",
      "comment": "The 'valley of decision' is a place of final choice and judgment, establishing a theme of urgency that is echoed in Christ’s own warnings about the final day (Matt. 25:31–46)."
    },
    {
      "pk": 36003015,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 15,
      "text": "The sun and the moon grow dark, and the stars withdraw their shining.",
      "links": "<a href='/AIV/23/13/10'>Isa. 13:10</a>; <a href='/AIV/40/24/29'>Matt. 24:29</a>",
      "comment": "Cosmic signs mark the arrival of the day of the LORD. These motifs reappear in both Old and New Testaments when describing divine intervention or the coming of the Messiah."
    },
    {
      "pk": 36003016,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 16,
      "text": "The LORD roars from Zion and utters His voice from Jerusalem, and the heavens and the earth tremble. But the LORD is a refuge for His people, a stronghold for the children of Israel.",
      "links": "<a href='/AIV/30/1/2'>Amos 1:2</a>; <a href='/AIV/19/46/1'>Ps. 46:1</a>",
      "comment": "God is both terrifying in judgment and merciful as a refuge. The image of God roaring from Zion connects to the kingly, priestly role of Christ, who both judges and saves (see John 10:28-30, Heb. 7:24-25)."
    },
    {
      "pk": 36003017,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 17,
      "text": "So you shall know that I am the LORD your God, dwelling in Zion, my holy mountain. Jerusalem will be holy, and strangers will pass through it no longer.",
      "links": "<a href='/AIV/26/48/35'>Ezek. 48:35</a>; <a href='/AIV/66/21/27'>Rev. 21:27</a>",
      "comment": "God's dwelling in Zion expresses a fulfillment of the temple prophecy, prefiguring the fullness of God’s presence in the New Jerusalem (Rev. 21), and the perpetual holiness and unity of His people."
    },
    {
      "pk": 36003018,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 18,
      "text": "In that day, the mountains shall drip with sweet wine, the hills shall flow with milk, and all the streams of Judah shall flow with water. A fountain shall come forth from the house of the LORD and water the Valley of Acacias.",
      "links": "<a href='/AIV/26/47/1'>Ezek. 47:1</a>; <a href='/AIV/38/13/1'>Zech. 13:1</a>",
      "comment": "Abundant blessings symbolize restoration and spiritual nourishment. The fountain from the LORD’s house foreshadows living water flowing from Christ (John 4:14; 7:38), and ongoing sacramental grace."
    },
    {
      "pk": 36003019,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 19,
      "text": "Egypt shall become a desolation and Edom a wilderness, for the violence against the people of Judah, because they have shed innocent blood in their land.",
      "links": "<a href='/AIV/23/19/1'>Isa. 19:1</a>; <a href='/AIV/26/25/12'>Ezek. 25:12</a>",
      "comment": "Egypt and Edom represent unrepentant nations opposed to God’s people. God's judgment falls for innocent blood, underscoring the seriousness of justice and mercy in God’s economy."
    },
    {
      "pk": 36003020,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 20,
      "text": "Judah shall be inhabited forever, and Jerusalem from generation to generation.",
      "links": "<a href='/AIV/26/37/25'>Ezek. 37:25</a>; <a href='/AIV/19/125/1-2'>Ps. 125:1-2</a>",
      "comment": "Eternal inheritance is promised. This prophecy finds spiritual fulfillment in the unity and indestructibility of God’s one people, established by Christ in the new covenant."
    },
    {
      "pk": 36003021,
      "translation": "AIV",
      "book": 36,
      "bookName": "Joel",
      "bookAbbreviation": "Joel",
      "chapter": 3,
      "verse": 21,
      "text": "I will avenge their blood, which I have not yet avenged, for the LORD dwells in Zion.",
      "links": "<a href='/AIV/05/32/43'>Deut. 32:43</a>; <a href='/AIV/66/6/10'>Rev. 6:10</a>",
      "comment": "God’s final justice and perpetual presence—Zion as God’s dwelling—signals the fulfillment of all prophetic promises, culminating in the complete redemption and sanctification of His people."
    }
  ],
  "translatedAt": "2025-12-24T09:41:14.139Z"
}