{
  "book": "Jonah",
  "bookAbbreviation": "Jonah",
  "chapter": 4,
  "verses": [
    {
      "pk": 2404001,
      "translation": "AIV",
      "book": 32,
      "chapter": 4,
      "verse": 1,
      "text": "But this greatly displeased Jonah, and he became angry.",
      "links": "<a href='/AIV/32/3/10'>Jonah 3:10</a>; <a href='/AIV/19/37/1'>Psalm 37:1</a>",
      "comment": "Jonah's displeasure at God's mercy highlights the difference between human and divine compassion. Note how Jonah reacts to God's decision to relent from disaster, exposing a common human struggle with God's boundless mercy."
    },
    {
      "pk": 2404002,
      "translation": "AIV",
      "book": 32,
      "chapter": 4,
      "verse": 2,
      "text": "He prayed to the LORD and said, 'O LORD, is this not what I said when I was still in my own country? Therefore I fled to Tarshish earlier; for I knew that you are gracious and compassionate, slow to anger, and overflowing in steadfast love, one who relents from sending disaster.'",
      "links": "<a href='/AIV/23/30/18'>Isaiah 30:18</a>; <a href='/AIV/2/34/6'>Exodus 34:6</a>; <a href='/AIV/19/103/8'>Psalm 103:8</a>",
      "comment": "Jonah recognizes central attributes of the LORD: grace, compassion, patience, and unfailing love. This echoes how God consistently reveals Himself in Israel's history and foreshadows the abundance of mercy later fully revealed in Christ. The phrase 'slow to anger' appears throughout the Old Testament as part of God's self-description."
    },
    {
      "pk": 2404003,
      "translation": "AIV",
      "book": 32,
      "chapter": 4,
      "verse": 3,
      "text": "So now, LORD, please take my life from me, for it is better for me to die than to live.'",
      "links": "<a href='/AIV/11/19/4'>1 Kings 19:4</a>; <a href='/AIV/19/42/5'>Psalm 42:5</a>",
      "comment": "Jonah's despair is reminiscent of the discouragement of other prophets, like Elijah. God's servants can experience profound discouragement, but God remains patient, inviting them to deeper conversion. This spiritual journey is like purification through suffering, echoed also in the lives of the saints."
    },
    {
      "pk": 2404004,
      "translation": "AIV",
      "book": 32,
      "chapter": 4,
      "verse": 4,
      "text": "And the LORD said, 'Is it right for you to be angry?'",
      "links": "<a href='/AIV/19/145/8'>Psalm 145:8</a>; <a href='/AIV/40/20/15'>Matthew 20:15</a>",
      "comment": "God's gentle question invites Jonah, and the reader, to examine our hearts regarding God’s mercy. The LORD often challenges us to align our sense of justice with His, which is always fuller and more merciful."
    },
    {
      "pk": 2404005,
      "translation": "AIV",
      "book": 32,
      "chapter": 4,
      "verse": 5,
      "text": "So Jonah went out of the city and sat to the east of the city. There he made a shelter for himself and sat under its shade, waiting to see what would happen to the city.",
      "links": "<a href='/AIV/32/3/4'>Jonah 3:4</a>",
      "comment": "Jonah’s separation from the city shows his continued struggle with accepting God’s plan of mercy. Symbolically, waiting outside the city hints at the tension between human expectations and divine initiative that is explored more fully in the New Testament (see Luke 15:28)."
    },
    {
      "pk": 2404006,
      "translation": "AIV",
      "book": 32,
      "chapter": 4,
      "verse": 6,
      "text": "Then the LORD God appointed a plant, and it grew up over Jonah to give shade over his head, to deliver him from his discomfort. So Jonah rejoiced greatly because of the plant.",
      "links": "<a href='/AIV/32/1/17'>Jonah 1:17</a>; <a href='/AIV/19/84/11'>Psalm 84:11</a>",
      "comment": "The plant is a sign of God’s sovereign kindness and care, even for a rebellious prophet. God often provides for His people in unexpected ways and meets them in their weakness."
    },
    {
      "pk": 2404007,
      "translation": "AIV",
      "book": 32,
      "chapter": 4,
      "verse": 7,
      "text": "But at dawn the next day, God appointed a worm, which attacked the plant so that it withered.",
      "links": "<a href='/AIV/32/1/4'>Jonah 1:4</a>; <a href='/AIV/18/1/21'>Job 1:21</a>",
      "comment": "Just as God appointed the fish and the plant, He now appoints the worm. Every element of creation is under God’s sovereignty. In His providence, suffering and loss can become moments of spiritual teaching and growth."
    },
    {
      "pk": 2404008,
      "translation": "AIV",
      "book": 32,
      "chapter": 4,
      "verse": 8,
      "text": "When the sun rose, God appointed a scorching east wind, and the sun beat down on Jonah’s head so that he grew faint. Then he wished for death, saying, 'It is better for me to die than to live.'",
      "links": "<a href='/AIV/32/4/3'>Jonah 4:3</a>; <a href='/AIV/19/121/6'>Psalm 121:6</a>",
      "comment": "Jonah’s suffering points to the larger theme of desolation and the need to surrender to God’s will even when it is mysterious or difficult. The reference to the east wind is a common biblical image for trial or judgment (see Ezekiel 17:10)."
    },
    {
      "pk": 2404009,
      "translation": "AIV",
      "book": 32,
      "chapter": 4,
      "verse": 9,
      "text": "But God said to Jonah, 'Is it right for you to be angry about the plant?' And he said, 'It is right for me to be angry, even to death.'",
      "links": "<a href='/AIV/32/4/4'>Jonah 4:4</a>",
      "comment": "God’s continued questioning draws Jonah deeper into self-reflection. This mirrors God’s way of gradually leading His people towards a deeper understanding and reformation of heart (see Genesis 4:6)."
    },
    {
      "pk": 2404010,
      "translation": "AIV",
      "book": 32,
      "chapter": 4,
      "verse": 10,
      "text": "Then the LORD said, 'You have had pity on the plant, for which you did not labor, nor did you make it grow. It came up in a night, and perished in a night.'",
      "links": "<a href='/AIV/19/145/9'>Psalm 145:9</a>; <a href='/AIV/46/3/7'>1 Corinthians 3:7</a>",
      "comment": "God contrasts Jonah’s compassion for the plant with His own compassion for the people of Nineveh. The plant serves as an object lesson about the Creator’s rightful sovereignty and love, not only over Israel but over all nations."
    },
    {
      "pk": 2404011,
      "translation": "AIV",
      "book": 32,
      "chapter": 4,
      "verse": 11,
      "text": "Should I not have concern for Nineveh, that great city, in which there are more than 120,000 people who do not know their right hand from their left, and also many animals?'",
      "links": "<a href='/AIV/19/36/6'>Psalm 36:6</a>; <a href='/AIV/55/2/25-26'>2 Timothy 2:25–26</a>",
      "comment": "The book ends with God’s appeal to mercy, not with a traditional conclusion, inviting ongoing reflection. God’s compassion for the ignorant and even the animals shows His universal love. This anticipates the universal mission seen in the New Testament: God’s saving plan extends to all humanity. Compare Jesus's own concern for the lost (Luke 19:10), and the inclusion of Gentiles as part of God's people (Acts 10:34-35)."
    }
  ],
  "translatedAt": "2025-12-23T07:30:12.562Z"
}