{
  "book": 26,
  "bookName": "Song of Songs",
  "bookAbbreviation": "Song",
  "chapter": 1,
  "verses": [
    {
      "pk": 26001001,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 1,
      "text": "The Song of Songs, which is Solomon's.",
      "links": "<a href='/AIV/11/4/32'>1 Kings 4:32</a>",
      "comment": "This opening verse establishes Solomon as the attributed author or inspiration. The phrase 'Song of Songs' indicates this is the greatest or most exquisite of songs, echoing other superlative forms in Scripture, such as 'Holy of Holies.'"
    },
    {
      "pk": 26001002,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 2,
      "text": "Let him kiss me with the kisses of his mouth! For your love is better than wine.",
      "links": "<a href='/AIV/19/63/3'>Psalm 63:3</a>; <a href='/AIV/28/14/7'>Hosea 14:7</a>",
      "comment": "The passionate longing seen here has been interpreted both as marital love and, spiritually, as the soul's longing for union with God. The tradition sees in this intensity of love an image of the closeness God desires with His people, foreshadowing the intimacy of Christ and the Church as the Bridegroom and Bride (see Ephesians 5:25-32)."
    },
    {
      "pk": 26001003,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 3,
      "text": "Your anointing oils are fragrant; your name is poured out like oil; therefore the maidens love you.",
      "links": "<a href='/AIV/19/45/7'>Psalm 45:7-8</a>; <a href='/AIV/42/7/46'>Luke 7:46</a>",
      "comment": "Oil often signifies consecration or holiness (see Leviticus 8:12). The 'name' being 'poured out' points toward the reputation and essence of the beloved being a source of joy and attraction, which is later echoed in the precious name of Jesus (Philippians 2:9)."
    },
    {
      "pk": 26001004,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 4,
      "text": "Draw me after you, let us run! The king has brought me into his chambers. We rejoice and are glad in you; we will extol your love more than wine; rightly do they love you.",
      "links": "<a href='/AIV/19/45/14-15'>Psalm 45:14-15</a>; <a href='/AIV/23/26/20'>Isaiah 26:20</a>",
      "comment": "The king's chambers are a symbol of intimacy and privilege. This is a profound image of spiritual union, echoing God's invitation to intimacy and joy in His presence. The plural 'we' shows communal joy, suggesting the people of God celebrating together, as seen in the New Testament depiction of the Church as the Bride of Christ (Revelation 19:7)."
    },
    {
      "pk": 26001005,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 5,
      "text": "I am dark, but lovely, O daughters of Jerusalem, like the tents of Kedar, like the curtains of Solomon.",
      "links": "<a href='/AIV/19/120/5'>Psalm 120:5</a>; <a href='/AIV/23/60/2'>Isaiah 60:2</a>",
      "comment": "The bride describes herself as 'dark, but lovely,' signifying humility yet awareness of beauty. Her value is intrinsic, not based on outward standards. This humility yet dignity is a theme in the Old and New Testament, showing God exalting the lowly (Luke 1:48-52)."
    },
    {
      "pk": 26001006,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 6,
      "text": "Do not gaze at me because I am dark, because the sun has looked upon me. My mother's sons were angry with me; they made me keeper of the vineyards, but my own vineyard I have not kept!",
      "links": "<a href='/AIV/19/69/8'>Psalm 69:8</a>; <a href='/AIV/23/5/1-7'>Isaiah 5:1-7</a>",
      "comment": "The reference to labor and neglect hints at suffering and self-sacrifice. The vineyard is sometimes symbolic of one’s soul or spiritual life (see Isaiah 5:7). This foreshadows Christ’s humility and service, and also the call to self-giving for the sake of others—a major theme throughout Scripture."
    },
    {
      "pk": 26001007,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 7,
      "text": "Tell me, you whom my soul loves, where you pasture your flock, where you make it lie down at noon. For why should I be like one who wanders beside the flocks of your companions?",
      "links": "<a href='/AIV/19/23/1-2'>Psalm 23:1-2</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "This pastoral image invokes the shepherd motif, a recurring biblical symbol for God’s care (Psalm 23; John 10:11). Seeking the beloved’s presence shows the soul’s longing for guidance from the true Shepherd, anticipating Jesus as the Good Shepherd."
    },
    {
      "pk": 26001008,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 8,
      "text": "If you do not know, most beautiful among women, follow the tracks of the flock, and pasture your young goats beside the shepherds' tents.",
      "links": "<a href='/AIV/26/34/15'>Ezekiel 34:15</a>; <a href='/AIV/41/6/34'>Mark 6:34</a>",
      "comment": "The encouragement to follow the flock and the shepherds’ tents points to guided community life, hinting at the importance of spiritual authority and tradition in following God’s ways (see 2 Thessalonians 2:15)."
    },
    {
      "pk": 26001009,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 9,
      "text": "I compare you, my love, to a mare among Pharaoh’s chariots.",
      "links": "<a href='/AIV/02/14/6-7'>Exodus 14:6-7</a>",
      "comment": "This evocative metaphor praises the beloved’s beauty and nobility. The mare among Pharaoh's chariots stands out as unique and dignified among the best, suggesting the chosen people’s distinction among the nations (Exodus 19:5-6)."
    },
    {
      "pk": 26001010,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 10,
      "text": "Your cheeks are lovely with ornaments, your neck with strings of jewels.",
      "links": "<a href='/AIV/19/45/13'>Psalm 45:13</a>",
      "comment": "Adornment here represents not vanity but prepared beauty, reminiscent of the Church, adorned for her Bridegroom (Revelation 21:2). The spiritual meaning points toward the virtues and gifts that should adorn God’s people."
    },
    {
      "pk": 26001011,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 11,
      "text": "We will make for you ornaments of gold, studded with silver.",
      "links": "<a href='/AIV/02/39/2-6'>Exodus 39:2-6</a>",
      "comment": "The imagery of crafted adornments recalls the priestly and temple decorations of the Old Testament, suggesting the dignity and spiritual beauty bestowed upon the people of God (see Ephesians 5:27)."
    },
    {
      "pk": 26001012,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 12,
      "text": "While the king was at his table, my perfume spread its fragrance.",
      "links": "<a href='/AIV/19/141/2'>Psalm 141:2</a>; <a href='/AIV/43/12/3'>John 12:3</a>",
      "comment": "The fragrance released in the king’s presence alludes to prayer, worship, and sacrificial love (Psalm 141:2). As in John 12:3, the pouring out of perfume is a sign of devotion, echoing the offering of oneself to God."
    },
    {
      "pk": 26001013,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 13,
      "text": "My beloved is to me a sachet of myrrh that lies between my breasts.",
      "links": "<a href='/AIV/19/45/8'>Psalm 45:8</a>; <a href='/AIV/40/2/11'>Matthew 2:11</a>",
      "comment": "Myrrh is a symbol of both love and sacrifice—used for anointing and burial. The intimacy here foreshadows the closeness of Christ with those who love Him. Myrrh’s association with Christ’s incarnation (Matthew 2:11) and His death and burial deepens the spiritual interpretation."
    },
    {
      "pk": 26001014,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 14,
      "text": "My beloved is to me a cluster of henna blossoms in the vineyards of En Gedi.",
      "links": "<a href='/AIV/09/23/29'>1 Samuel 23:29</a>",
      "comment": "Henna blossoms were prized for fragrance and beauty; En Gedi was an oasis. The beloved is a source of refreshment and delight, suggesting the soul finds rest and joy in God’s presence."
    },
    {
      "pk": 26001015,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 15,
      "text": "Behold, you are beautiful, my love; behold, you are beautiful; your eyes are doves.",
      "links": "<a href='/AIV/40/3/16'>Matthew 3:16</a>",
      "comment": "Dove’s eyes signify purity, innocence, and peace, connecting again to the Holy Spirit (Matthew 3:16). The repetition emphasizes the beloved’s unmatched beauty in the eyes of the lover."
    },
    {
      "pk": 26001016,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 16,
      "text": "Behold, you are handsome, my beloved, truly delightful. Our couch is green;",
      "links": "<a href='/AIV/19/23/2'>Psalm 23:2</a>",
      "comment": "The scene shifts to an idyllic pasture, imagery reminiscent of Psalm 23:2. The setting of restful abundance hints at the spiritual nourishment and peace found in union with God."
    },
    {
      "pk": 26001017,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 1,
      "verse": 17,
      "text": "the beams of our house are cedar; our rafters are cypress.",
      "links": "<a href='/AIV/11/5/6-8'>1 Kings 5:6-8</a>",
      "comment": "Cedar and cypress were used for building the temple (1 Kings 5:6-8). The durability and fragrance of these woods symbolize the strength, beauty, and permanence of the union between God and His people, paralleling the everlasting dwelling prepared for those who love God."
    }
  ],
  "translatedAt": "2025-12-24T07:12:05.849Z"
}