{
  "book": 26,
  "bookName": "Song of Songs",
  "bookAbbreviation": "Song",
  "chapter": 7,
  "verses": [
    {
      "pk": 26007001,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 1,
      "text": "How beautiful are your feet in sandals, O prince’s daughter! The curves of your thighs are like jewels, the work of a master’s hand.",
      "links": "<a href='/AIV/19/45/13'>Ps. 45:13</a>; <a href='/AIV/23/52/7'>Isa. 52:7</a>",
      "comment": "This verse begins a description of the beloved’s body with poetic symbolism, signifying both physical beauty and spiritual dignity. The reference to 'feet in sandals' recalls images of royalty and purity. In traditional interpretation, this passage also points allegorically to the dignity and beauty of the Church as the bride of Christ (Eph. 5:25-27)."
    },
    {
      "pk": 26007002,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 2,
      "text": "Your navel is a rounded bowl that does not lack blended wine. Your waist is a heap of wheat, encircled with lilies.",
      "links": "<a href='/AIV/08/2/14'>Ruth 2:14</a>; <a href='/AIV/43/2/6-10'>John 2:6-10</a>",
      "comment": "The use of wine and wheat imagery symbolizes both nourishment and abundance, with echoes in the sacramental themes of the New Covenant (John 6:35, John 6:55-56). The Church is often seen as the vessel filled with spiritual blessings."
    },
    {
      "pk": 26007003,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 3,
      "text": "Your two breasts are like two fawns, twins of a gazelle.",
      "links": "<a href='/AIV/26/4/5'>Song 4:5</a>",
      "comment": "This repeated imagery points to innocence and gentleness. Spiritually, the breasts have been seen as symbols of nurturing and teaching, consistent with the way God provides for and sustains His people (Isa. 66:11-12)."
    },
    {
      "pk": 26007004,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 4,
      "text": "Your neck is like an ivory tower. Your eyes are pools in Heshbon, by the gate of Bath-rabbim. Your nose is like a tower of Lebanon overlooking Damascus.",
      "links": "<a href='/AIV/26/4/4'>Song 4:4</a>; <a href='/AIV/14/3/3-4'>2 Chr. 3:3-4</a>",
      "comment": "The metaphors of towers and pools indicate beauty, strength, and meditative depth. Spiritually, the elevated position symbolizes the Church’s role as a visible witness to the nations, just as a city on a hill (Matt. 5:14)."
    },
    {
      "pk": 26007005,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 5,
      "text": "Your head crowns you like Carmel, and the hair of your head is like purple; a king is held captive by your tresses.",
      "links": "<a href='/AIV/11/18/42'>1 Kings 18:42</a>; <a href='/AIV/19/45/11'>Ps. 45:11</a>",
      "comment": "Carmel was known for its majesty and fruitfulness. The color purple and kingly imagery allude to royal dignity and the beloved’s allure. Ultimately, this points to Christ's love for the Church as His bride, adorned in splendor (Rev. 21:2)."
    },
    {
      "pk": 26007006,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 6,
      "text": "How fair and pleasant you are, O beloved, with all your delights!",
      "links": "<a href='/AIV/19/16/6'>Ps. 16:6</a>; <a href='/AIV/26/1/2'>Song 1:2</a>",
      "comment": "This verse further emphasizes the delightfulness of the beloved, an image that traditionally points to God’s favor upon His chosen people and, in Christian allegory, the pure and holy life God desires for the Church (Eph. 5:27)."
    },
    {
      "pk": 26007007,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 7,
      "text": "Your stature is like a palm tree, and your breasts are like its clusters.",
      "links": "<a href='/AIV/19/92/12'>Ps. 92:12</a>",
      "comment": "The palm tree, an image of victory and fruitfulness, recalls the righteous flourishing in God’s presence (Ps. 92:12). The clusters suggest abundance and the promise of spiritual fruit."
    },
    {
      "pk": 26007008,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 8,
      "text": "I said, I will climb the palm tree, I will take hold of its fruit. Let your breasts be like clusters of the vine, the scent of your breath like apples,",
      "links": "<a href='/AIV/26/2/3'>Song 2:3</a>; <a href='/AIV/26/4/10-11'>Song 4:10-11</a>",
      "comment": "Here the language is intimate, expressing desire for union. The vine and apples both have connotations of life and renewal—interpreted spiritually as the soul’s longing for communion with God (John 15:5)."
    },
    {
      "pk": 26007009,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 9,
      "text": "and your mouth like the best wine. May it go down smoothly for my beloved, gliding over lips and teeth.",
      "links": "<a href='/AIV/26/1/2'>Song 1:2</a>; <a href='/AIV/19/104/15'>Ps. 104:15</a>",
      "comment": "Wine here is a symbol of joy and spiritual blessing (Ps. 104:15). The image of lips and teeth hints at the sweetness of true and faithful teaching, which many Church fathers have associated with the guidance provided by Christ through His Church."
    },
    {
      "pk": 26007010,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 10,
      "text": "I am my beloved’s, and his desire is for me.",
      "links": "<a href='/AIV/26/6/3'>Song 6:3</a>; <a href='/AIV/19/45/11'>Ps. 45:11</a>",
      "comment": "Mutual belonging echoes the New Testament imagery of the Church as the bride of Christ (Eph. 5:31-32). This verse denotes both the security of belonging to God and the transformative power of His love."
    },
    {
      "pk": 26007011,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 11,
      "text": "Come, my beloved, let us go out into the fields, let us lodge in the villages.",
      "links": "<a href='/AIV/42/9/6'>Luke 9:6</a>",
      "comment": "The invitation to go out to the fields suggests a call to mission and activity. Christians have seen in this an image of participating in Christ’s mission to the world, echoing the sending of the apostles."
    },
    {
      "pk": 26007012,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 12,
      "text": "Let us go early to the vineyards, let us see if the vines have budded, if the blossoms have opened and the pomegranates are in bloom. There I will give you my love.",
      "links": "<a href='/AIV/26/2/13'>Song 2:13</a>; <a href='/AIV/43/15/1-8'>John 15:1-8</a>",
      "comment": "Vineyard imagery recurs throughout Scripture, representing both the people of God and their fruitfulness (John 15:1-8). Spiritual fruit arises from union with Christ and faithfulness to His word."
    },
    {
      "pk": 26007013,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 7,
      "verse": 13,
      "text": "The mandrakes give off fragrance, and at our doors are all choice fruits, new as well as old, which I have stored for you, my beloved.",
      "links": "<a href='/AIV/01/30/14-16'>Gen. 30:14-16</a>; <a href='/AIV/26/2/3'>Song 2:3</a>",
      "comment": "Mandrakes symbolized love and fertility in ancient times (Gen. 30:14-16). The 'choice fruits' preserved for the beloved suggest the Church’s fullness—retaining both new and old treasures (Matt. 13:52)—and the continuous, living tradition passed down to God’s people."
    }
  ],
  "translatedAt": "2025-12-24T07:13:59.608Z"
}