{
  "book": "Hebrews",
  "bookAbbreviation": "Heb",
  "chapter": 9,
  "verses": [
    {
      "pk": 2930901,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 1,
      "text": "Now in the first covenant, there were ordinances for worship and an earthly sanctuary.",
      "links": "<a href='/AIV/2/25/8-9'>Ex. 25:8–9</a>; <a href='/AIV/3/16/16'>Lev. 16:16</a>",
      "comment": "The text refers to the regulations given under the Mosaic covenant regarding the tabernacle, establishing the connection between worship and sacred space. This sets the stage for Christ's fulfillment of these symbols."
    },
    {
      "pk": 2930902,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 2,
      "text": "For a tabernacle was prepared; in the first part were the lampstand, the table, and the bread of the Presence, which is called the Holy Place.",
      "links": "<a href='/AIV/2/25/30-31'>Ex. 25:30–31</a>; <a href='/AIV/2/26/35'>Ex. 26:35</a>",
      "comment": "Details of the sanctuary's furnishing highlight the holiness of God’s dwelling. The bread of the Presence foreshadows communion with God."
    },
    {
      "pk": 2930903,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 3,
      "text": "Behind the second curtain was a section called the Most Holy Place.",
      "links": "<a href='/AIV/2/26/33'>Ex. 26:33</a>",
      "comment": "The veil separated sinful man from the direct presence of God, pointing to humanity’s need for redemption."
    },
    {
      "pk": 2930904,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 4,
      "text": "In it were the golden altar of incense and the ark of the covenant, covered all around with gold, in which was a golden urn holding the manna, Aaron’s rod that budded, and the tablets of the covenant.",
      "links": "<a href='/AIV/2/25/10-22'>Ex. 25:10–22</a>; <a href='/AIV/4/17/10'>Num. 17:10</a>",
      "comment": "The items inside the ark each represented aspects of God's providence, authority, and law."
    },
    {
      "pk": 2930905,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 5,
      "text": "Above it were the cherubim of glory overshadowing the mercy seat. Of these things we cannot now speak in detail.",
      "links": "<a href='/AIV/2/25/20-22'>Ex. 25:20–22</a>",
      "comment": "God’s presence was understood to dwell above the mercy seat, prefiguring Christ as the ultimate mediator."
    },
    {
      "pk": 2930906,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 6,
      "text": "With these preparations made, the priests regularly enter the outer room to perform their worship.",
      "links": "<a href='/AIV/3/24/3'>Lev. 24:3</a>",
      "comment": "Priestly ministry was ongoing, symbolizing the continual need for intercession on behalf of the people."
    },
    {
      "pk": 2930907,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 7,
      "text": "But into the second room only the high priest enters, and only once a year, never without blood, which he offers for himself and for the unintentional sins of the people.",
      "links": "<a href='/AIV/3/16/2-15'>Lev. 16:2–15</a>",
      "comment": "The annual Day of Atonement prefigures Christ’s once-for-all sacrifice. Only the high priest could enter, pointing to the unique role of Christ as High Priest."
    },
    {
      "pk": 2930908,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 8,
      "text": "By this the Holy Spirit shows that the way into the Most Holy Place was not yet opened as long as the first tabernacle still stood.",
      "links": "<a href='/AIV/40/27/51'>Matt. 27:51</a>",
      "comment": "The veil symbolized the separation from God prior to Christ. The Spirit’s guidance alludes to spiritual realities revealed through the physical structure."
    },
    {
      "pk": 2930909,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 9,
      "text": "This is a symbol for the present time, indicating that the gifts and sacrifices being offered cannot perfect the conscience of the worshiper.",
      "links": "<a href='/AIV/58/10/1-4'>Heb. 10:1–4</a>",
      "comment": "Old Testament rituals had no power to cleanse inwardly, highlighting the need for true, spiritual transformation."
    },
    {
      "pk": 2930910,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 10,
      "text": "They are only regulations about food, drink, and ceremonial washings—external ordinances imposed until the time of the new order.",
      "links": "<a href='/AIV/3/11/1-47'>Lev. 11:1–47</a>; <a href='/AIV/43/2/6'>John 2:6</a>",
      "comment": "The law’s emphasis on external purity points to a greater internal purification brought by Christ."
    },
    {
      "pk": 2930911,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 11,
      "text": "But when Christ appeared as High Priest of the good things that have come, through the greater and more perfect tabernacle not made by human hands—that is, not of this creation—",
      "links": "<a href='/AIV/58/8/2'>Heb. 8:2</a>; <a href='/AIV/40/12/6'>Matt. 12:6</a>",
      "comment": "Christ's priesthood and sanctuary are spiritual and heavenly, surpassing the earthly system. His mediation opens direct communion with God."
    },
    {
      "pk": 2930912,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 12,
      "text": "he entered once for all into the Most Holy Place, not by means of the blood of goats and calves, but by his own blood, thus obtaining eternal redemption.",
      "links": "<a href='/AIV/3/16/14-15'>Lev. 16:14–15</a>; <a href='/AIV/58/7/27'>Heb. 7:27</a>",
      "comment": "Jesus' single, perfect sacrifice contrasts with repetitive animal sacrifices, providing eternal salvation."
    },
    {
      "pk": 2930913,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 13,
      "text": "For if the blood of goats and bulls, and the ashes of a young cow sprinkled on those who are ritually unclean, sanctify for the purification of the flesh,",
      "links": "<a href='/AIV/4/19/2-10'>Num. 19:2–10</a>",
      "comment": "Physical purity rites symbolize deeper spiritual realities. Christ brings greater cleansing."
    },
    {
      "pk": 2930914,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 14,
      "text": "how much more will the blood of Christ, who through the eternal Spirit offered himself without blemish to God, cleanse our conscience from dead works to serve the living God?",
      "links": "<a href='/AIV/60/1/19'>1 Pet. 1:19</a>; <a href='/AIV/52/1/9'>1 Thess. 1:9</a>",
      "comment": "Christ’s perfect offering, empowered by the Spirit, accomplishes inner renewal and sanctifies believers for true worship. The Trinitarian structure is evident here: Christ, Spirit, and God."
    },
    {
      "pk": 2930915,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 15,
      "text": "For this reason, he is the mediator of a new covenant, so that those who are called may receive the promised eternal inheritance, since a death has occurred that redeems them from transgressions committed under the first covenant.",
      "links": "<a href='/AIV/24/31/31'>Jer. 31:31</a>; <a href='/AIV/58/8/6'>Heb. 8:6</a>",
      "comment": "The concept of mediator echoes Old Testament prophecy, fulfilling the role of go-between for God and humanity. Redemption through sacrificial death is central."
    },
    {
      "pk": 2930916,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 16,
      "text": "For where there is a will, the death of the one who made it must be established.",
      "links": "<a href='/AIV/48/3/15'>Gal. 3:15</a>",
      "comment": "The Greek word for 'covenant' can also mean 'will' or 'testament,' and so the analogy of a will requiring death is apt."
    },
    {
      "pk": 2930917,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 17,
      "text": "For a will is only in force after death, since it has no power while the one who made it is alive.",
      "links": "<a href='/AIV/48/3/17'>Gal. 3:17</a>",
      "comment": "Christ's death activates the blessings of the new covenant, much like a testament is valid only after the testator dies."
    },
    {
      "pk": 2930918,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 18,
      "text": "So the first covenant was not inaugurated without blood.",
      "links": "<a href='/AIV/2/24/8'>Ex. 24:8</a>",
      "comment": "Covenants are sealed by blood, a sign of life offered up. Ancient rituals often had this pattern."
    },
    {
      "pk": 2930919,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 19,
      "text": "For when every commandment had been spoken by Moses to all the people according to the law, he took the blood of calves and goats, with water, scarlet wool, and hyssop, and sprinkled both the book itself and all the people,",
      "links": "<a href='/AIV/2/24/3-8'>Ex. 24:3–8</a>",
      "comment": "The sprinkling symbolizes the effect of the covenant on every aspect of Israel’s relationship with God."
    },
    {
      "pk": 2930920,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 20,
      "text": "saying, 'This is the blood of the covenant that God has commanded for you.'",
      "links": "<a href='/AIV/2/24/8'>Ex. 24:8</a>; <a href='/AIV/40/26/28'>Matt. 26:28</a>",
      "comment": "This phrase is echoed by Jesus at the Last Supper, linking the old and new covenants together—indicating Eucharistic theology and the permanence of the new covenant (see Matt. 26:28)."
    },
    {
      "pk": 2930921,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 21,
      "text": "And in the same way, he sprinkled with blood both the tabernacle and all the vessels used in worship.",
      "links": "<a href='/AIV/3/8/15'>Lev. 8:15</a>",
      "comment": "All objects and persons connected with worship are consecrated through sacrificial blood—a pattern that Christ fulfills in his self-giving."
    },
    {
      "pk": 2930922,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 22,
      "text": "Indeed, under the law almost everything is purified with blood, and without the shedding of blood there is no forgiveness.",
      "links": "<a href='/AIV/3/17/11'>Lev. 17:11</a>",
      "comment": "The necessity of blood for atonement points to the seriousness of sin and the power of Christ’s sacrifice."
    },
    {
      "pk": 2930923,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 23,
      "text": "So it was necessary for the copies of the heavenly things to be purified with these sacrifices, but the heavenly things themselves require better sacrifices than these.",
      "links": "<a href='/AIV/58/8/5'>Heb. 8:5</a>",
      "comment": "Earthly rituals are a shadow of greater spiritual realities. Only Christ’s sacrifice purifies the heavenly sanctuary."
    },
    {
      "pk": 2930924,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 24,
      "text": "For Christ did not enter a sanctuary made by human hands, a mere copy of the true one, but he entered heaven itself, now to appear before God on our behalf.",
      "links": "<a href='/AIV/58/7/25'>Heb. 7:25</a>; <a href='/AIV/53/1/10'>2 Thess. 1:10</a>",
      "comment": "Christ’s high priestly ministry is ongoing in heaven. This emphasizes his unique, perpetual mediation for believers."
    },
    {
      "pk": 2930925,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 25,
      "text": "Nor did he enter to offer himself many times, as the high priest enters the Most Holy Place every year with blood that is not his own;",
      "links": "<a href='/AIV/58/10/1'>Heb. 10:1</a>",
      "comment": "The once-for-all nature of Christ’s sacrifice distinguishes it from the repeated Old Testament offerings."
    },
    {
      "pk": 2930926,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 26,
      "text": "Otherwise he would have had to suffer many times since the foundation of the world. But now, at the end of the ages, he has appeared once to put away sin by the sacrifice of himself.",
      "links": "<a href='/AIV/45/6/10'>Rom. 6:10</a>; <a href='/AIV/58/1/2'>Heb. 1:2</a>",
      "comment": "Christ’s sacrifice marks a climactic point in history—'the end of the ages'—initiating the new spiritual reality for all who believe."
    },
    {
      "pk": 2930927,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 27,
      "text": "And just as it is appointed for people to die once, and after that comes judgment,",
      "links": "<a href='/AIV/21/12/7'>Eccl. 12:7</a>",
      "comment": "Death and judgment are universal and final, underscoring the necessity of spiritual preparation through faith and adherence to God’s sacramental grace."
    },
    {
      "pk": 2930928,
      "translation": "AIV",
      "book": 58,
      "chapter": 9,
      "verse": 28,
      "text": "so Christ, after being offered once to bear the sins of many, will appear a second time, not to deal with sin, but to bring salvation to those who eagerly wait for him.",
      "links": "<a href='/AIV/23/53/12'>Isa. 53:12</a>; <a href='/AIV/40/24/30'>Matt. 24:30</a>",
      "comment": "Christ’s return completes the process of salvation for the faithful, connecting the expectation of his second coming with the full hope of redemption. The key phrase ‘bear the sins of many’ fulfills prophecy in Isaiah 53:12 and deepens understanding of Christ’s priestly role and intercessory ministry. This hints at the importance of sacramental living and awaiting with perseverance, as interpreted in apostolic tradition."
    }
  ],
  "translatedAt": "2025-12-23T04:09:28.401Z"
}