{
  "book": 65,
  "bookName": "Hebrews",
  "bookAbbreviation": "Heb",
  "chapter": 9,
  "verses": [
    {
      "pk": 65009001,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 1,
      "text": "Now even the first covenant had regulations for worship and an earthly sanctuary.",
      "links": "<a href='/AIV/02/25/8-9'>Ex. 25:8-9</a>; <a href='/AIV/03/16/1-34'>Lev. 16:1-34</a>",
      "comment": "The author introduces the idea that both the old and new covenants have appointed ways of worship, but the old was centered on physical, earthly rituals."
    },
    {
      "pk": 65009002,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 2,
      "text": "For a tent was prepared. The first part, called the Holy Place, had the lampstand, the table, and the bread of the Presence.",
      "links": "<a href='/AIV/02/26/33-35'>Ex. 26:33-35</a>; <a href='/AIV/02/40/22-24'>Ex. 40:22-24</a>",
      "comment": "A description of the interior of the tabernacle, showing the detailed symbolism of God's dwelling and provision in the old covenant."
    },
    {
      "pk": 65009003,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 3,
      "text": "Behind the second curtain was a tent called the Most Holy Place.",
      "links": "<a href='/AIV/02/26/33'>Ex. 26:33</a>; <a href='/AIV/03/16/2'>Lev. 16:2</a>",
      "comment": "This inner sanctuary represents the very presence of God, separated from people apart from appointed mediation."
    },
    {
      "pk": 65009004,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 4,
      "text": "Inside it were the golden altar for incense and the ark of the covenant, all covered with gold. In the ark were a golden jar holding manna, Aaron’s staff that had budded, and the tablets of the covenant.",
      "links": "<a href='/AIV/02/25/10-22'>Ex. 25:10-22</a>; <a href='/AIV/04/17/10'>Num. 17:10</a>; <a href='/AIV/02/16/33'>Ex. 16:33</a>",
      "comment": "These objects recall God's provision, authority, and law—foreshadowing the fullness of Christ's priesthood and mediation."
    },
    {
      "pk": 65009005,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 5,
      "text": "Above the ark were the cherubim of glory, overshadowing the mercy seat. Of these things, we cannot now speak in detail.",
      "links": "<a href='/AIV/02/25/17-22'>Ex. 25:17-22</a>",
      "comment": "The mercy seat was considered the throne of God on earth, a powerful anticipation of Christ's role as Mediator."
    },
    {
      "pk": 65009006,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 6,
      "text": "With these things prepared, the priests enter the first section of the tent regularly to perform their duties.",
      "links": "<a href='/AIV/03/24/3'>Lev. 24:3</a>",
      "comment": "Priests continually served at the sanctuary, pointing to the constant need for mediation between God and His people."
    },
    {
      "pk": 65009007,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 7,
      "text": "But only the high priest can enter the second section, once a year, and never without blood, which he offers for himself and for the sins the people committed in ignorance.",
      "links": "<a href='/AIV/03/16/11-15'>Lev. 16:11-15</a>",
      "comment": "This annual entrance of the high priest prefigures the fuller mediation and atonement accomplished by Christ."
    },
    {
      "pk": 65009008,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 8,
      "text": "By this, the Holy Spirit indicates that the way into the Most Holy Place was not yet open as long as the first tent still stood.",
      "links": "<a href='/AIV/43/14/6'>John 14:6</a>; <a href='/AIV/40/27/51'>Matt. 27:51</a>",
      "comment": "Here, the Spirit's teaching shows that full access to God's presence would only come through a new means—hinting at the greater spiritual reality established in Christ."
    },
    {
      "pk": 65009009,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 9,
      "text": "The present is a symbol for this age. Gifts and sacrifices offered cannot perfect the worshiper’s conscience,",
      "links": "<a href='/AIV/03/17/11'>Lev. 17:11</a>; <a href='/AIV/58/10/1-4'>Heb. 10:1-4</a>",
      "comment": "Earthly sacrifices were outward and unable to truly cleanse the heart, highlighting the need for a deeper, spiritual renewal."
    },
    {
      "pk": 65009010,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 10,
      "text": "They deal only with food and drink and various washings, regulations for the body imposed until the time of reformation.",
      "links": "<a href='/AIV/03/11/1-47'>Lev. 11:1-47</a>; <a href='/AIV/03/16/4'>Lev. 16:4</a>",
      "comment": "These external rituals are provisional, awaiting a spiritual renewal that would truly cleanse the conscience."
    },
    {
      "pk": 65009011,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 11,
      "text": "But Christ came as high priest of the good things to come, through the greater and more perfect tent not made with hands, that is, not of this creation.",
      "links": "<a href='/AIV/43/2/19-21'>John 2:19-21</a>; <a href='/AIV/58/4/14'>Heb. 4:14</a>",
      "comment": "Christ’s priesthood transcends earthly rituals, entering not an earthly sanctuary, but the heavenly reality itself—a sign of fulfillment and spiritual depth."
    },
    {
      "pk": 65009012,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 12,
      "text": "He entered once for all into the Most Holy Place, not by the blood of goats and calves, but by his own blood, securing eternal redemption.",
      "links": "<a href='/AIV/03/16/15'>Lev. 16:15</a>; <a href='/AIV/58/10/10-12'>Heb. 10:10-12</a>",
      "comment": "Christ’s single, perfect sacrifice gains everlasting redemption, unlike the repetitive sacrifices of the old covenant."
    },
    {
      "pk": 65009013,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 13,
      "text": "For if the blood of goats and bulls, and the scattering of ashes from a heifer sanctifies those who have been defiled, making them outwardly clean,",
      "links": "<a href='/AIV/04/19/9-13'>Num. 19:9-13</a>",
      "comment": "Old Testament ritual cleansings only affected the exterior, prefiguring the deeper cleansing offered by Christ."
    },
    {
      "pk": 65009014,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 14,
      "text": "how much more will the blood of Christ, who through the eternal Spirit offered himself without blemish to God, purify our conscience from dead works to serve the living God?",
      "links": "<a href='/AIV/23/53/7-12'>Isa. 53:7-12</a>; <a href='/AIV/43/1/29'>John 1:29</a>",
      "comment": "Christ’s offering is perfect and spiritual, capable of cleansing the soul itself and enabling true worship—a hint toward sacramental grace."
    },
    {
      "pk": 65009015,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 15,
      "text": "Therefore he is the mediator of a new covenant, so that those who are called may receive the promised eternal inheritance, since a death has occurred to redeem them from sins committed under the first covenant.",
      "links": "<a href='/AIV/24/31/31-34'>Jer. 31:31-34</a>; <a href='/AIV/43/3/16'>John 3:16</a>",
      "comment": "Jesus inaugurates a new covenant, bringing mediation and redemption for all who are called—a strong fulfillment of prophecy and a pointer to the need for effective mediation."
    },
    {
      "pk": 65009016,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 16,
      "text": "For where a will exists, it is necessary to verify the death of the one who made it.",
      "links": "<a href='/AIV/50/3/7'>Gal. 3:7</a>",
      "comment": "The comparison to a last will and testament links the new covenant to an effective transfer of inheritance through the death of Christ."
    },
    {
      "pk": 65009017,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 17,
      "text": "A will takes effect only after death; it is not in force as long as the one who made it is alive.",
      "links": "<a href='/AIV/48/3/15'>Gal. 3:15</a>",
      "comment": "Christ’s death is essential for the new covenant’s blessings to come to believers."
    },
    {
      "pk": 65009018,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 18,
      "text": "Therefore, not even the first covenant was inaugurated without blood.",
      "links": "<a href='/AIV/02/24/8'>Ex. 24:8</a>",
      "comment": "Blood symbolizes covenant commitment and the seriousness of entering into relationship with God."
    },
    {
      "pk": 65009019,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 19,
      "text": "For when every command had been spoken by Moses to all the people according to the law, he took the blood of calves and goats, with water, scarlet wool, and hyssop, and sprinkled both the book itself and all the people.",
      "links": "<a href='/AIV/02/24/3-8'>Ex. 24:3-8</a>",
      "comment": "The sprinkling of blood sanctifies both the law and the people, foreshadowing a spiritual means of sanctification in the new covenant."
    },
    {
      "pk": 65009020,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 20,
      "text": "He said, 'This is the blood of the covenant that God has commanded you.'",
      "links": "<a href='/AIV/02/24/8'>Ex. 24:8</a>; <a href='/AIV/40/26/28'>Matt. 26:28</a>",
      "comment": "The use of blood to seal a covenant ties Old Testament worship to the words of Jesus at the Last Supper, linking both to the institution of new spiritual practices."
    },
    {
      "pk": 65009021,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 21,
      "text": "Likewise, he sprinkled with blood both the tent and all the vessels used in worship.",
      "links": "<a href='/AIV/03/8/15'>Lev. 8:15</a>",
      "comment": "Sanctification of all the objects of worship hints at the necessity of spiritual cleansing for true liturgical worship."
    },
    {
      "pk": 65009022,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 22,
      "text": "Indeed, under the law almost everything is purified with blood, and without the shedding of blood there is no forgiveness of sins.",
      "links": "<a href='/AIV/03/17/11'>Lev. 17:11</a>; <a href='/AIV/40/26/28'>Matt. 26:28</a>",
      "comment": "Divine forgiveness always requires sacrifice—pointing to the ultimate sacrifice fulfilled in Christ, and to the ongoing importance of sacramental grace."
    },
    {
      "pk": 65009023,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 23,
      "text": "Therefore, it was necessary for the copies of the heavenly things to be purified with these rites, but the heavenly things themselves require better sacrifices than these.",
      "links": "<a href='/AIV/58/8/5'>Heb. 8:5</a>",
      "comment": "Earthly worship points to a higher reality, which requires a fundamentally greater (once-for-all) sacrifice."
    },
    {
      "pk": 65009024,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 24,
      "text": "For Christ did not enter a sanctuary made by human hands, which is only a copy of the true one, but into heaven itself, to appear now before God on our behalf.",
      "links": "<a href='/AIV/43/20/17'>John 20:17</a>; <a href='/AIV/58/7/25'>Heb. 7:25</a>",
      "comment": "Christ’s intercession is ongoing and heavenly, showing both the unique value of his priestly ministry and the importance of spiritual mediation."
    },
    {
      "pk": 65009025,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 25,
      "text": "Nor did he enter to offer himself repeatedly, as the high priest enters the Most Holy Place year after year with blood that is not his own.",
      "links": "<a href='/AIV/58/10/1-2'>Heb. 10:1-2</a>",
      "comment": "Unlike the old priesthood, Christ's sacrifice is unique, completed once-for-all for eternal effect—removing the need for repeated sacrifices."
    },
    {
      "pk": 65009026,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 26,
      "text": "Otherwise, he would have had to suffer repeatedly since the foundation of the world. But as it is, he has appeared once for all at the end of the ages to put away sin by the sacrifice of himself.",
      "links": "<a href='/AIV/40/27/50-51'>Matt. 27:50-51</a>; <a href='/AIV/58/1/2'>Heb. 1:2</a>",
      "comment": "The effectiveness and finality of Christ’s sacrifice highlights the profound depth of New Testament worship and the gravity of sin’s removal."
    },
    {
      "pk": 65009027,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 27,
      "text": "And just as it is appointed for people to die once, and after that comes judgment,",
      "links": "<a href='/AIV/21/12/7'>Eccl. 12:7</a>; <a href='/AIV/40/25/31-46'>Matt. 25:31-46</a>",
      "comment": "This points to the finality of human existence and judgment—a theological anchor for the seriousness of salvation."
    },
    {
      "pk": 65009028,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 9,
      "verse": 28,
      "text": "so Christ, having been offered once to bear the sins of many, will appear a second time, not to deal with sin, but to bring salvation to those who are eagerly waiting for him.",
      "links": "<a href='/AIV/23/53/12'>Isa. 53:12</a>; <a href='/AIV/45/8/23'>Rom. 8:23</a>; <a href='/AIV/66/22/12'>Rev. 22:12</a>",
      "comment": "Christ's future return will complete the promises of salvation, confirming the enduring hope rooted in sacramental life and participation. Encourages believers to await Jesus with a living, active hope."
    }
  ],
  "translatedAt": "2025-12-24T12:20:56.815Z"
}