{
  "book": 65,
  "bookName": "Hebrews",
  "bookAbbreviation": "Heb",
  "chapter": 4,
  "verses": [
    {
      "pk": 65004001,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 1,
      "text": "Therefore, since the promise of entering His rest remains, let us be afraid, lest any of you seem to have failed to reach it.",
      "links": "<a href='/AIV/19/95/11'>Ps. 95:11</a>; <a href='/AIV/58/3/12-19'>Heb. 3:12-19</a>",
      "comment": "The author warns believers not to fall short of entering God's rest, echoing Psalm 95:11. This rest points both to salvation and to a future spiritual fulfillment. The reference to 'fear' stresses perseverance and active faith, consistent with traditional Christian teaching on 'working out salvation with fear and trembling' (<a href='/AIV/50/2/12'>Phil. 2:12</a>)."
    },
    {
      "pk": 65004002,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 2,
      "text": "For we also have had the good news proclaimed to us, just as they did; but the message they heard did not benefit them, because those who heard it did not combine it with faith.",
      "links": "<a href='/AIV/19/78/22'>Ps. 78:22</a>; <a href='/AIV/58/3/16-19'>Heb. 3:16-19</a>",
      "comment": "The 'good news' here refers to the gospel and also the promise of rest in the Old Testament. Faith and response are necessary for the promise to produce fruit. This echoes themes of obedience tied to faith in Old Testament examples, and calls to authentic, living faith within the community."
    },
    {
      "pk": 65004003,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 3,
      "text": "For we who have believed enter that rest, just as He said: 'So I swore in My wrath, they shall not enter My rest,' even though His works have been finished since the foundation of the world.",
      "links": "<a href='/AIV/19/95/11'>Ps. 95:11</a>; <a href='/AIV/01/2/2'>Gen. 2:2</a>",
      "comment": "Believers participate in God's promised rest even now, a foretaste of the fullness to come. The quotation from Psalm 95:11 highlights God's sovereignty and the importance of faith. The reference to finished works from creation draws a link between Sabbath rest and the eternal rest believers anticipate, showing continuity between old and new covenants."
    },
    {
      "pk": 65004004,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 4,
      "text": "For somewhere He has spoken about the seventh day in this way: 'And God rested on the seventh day from all His works.'",
      "links": "<a href='/AIV/01/2/2'>Gen. 2:2</a>; <a href='/AIV/19/95/11'>Ps. 95:11</a>",
      "comment": "The creation Sabbath in Genesis 2:2 becomes a type for the spiritual rest offered in Christ, interpreted allegorically as well as literally. The link between the literal day of rest and the spiritual rest invites deeper contemplation of the sacramental and eschatological meanings present."
    },
    {
      "pk": 65004005,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 5,
      "text": "And again in this passage, 'They shall not enter My rest.'",
      "links": "<a href='/AIV/19/95/11'>Ps. 95:11</a>",
      "comment": "The repetition from Psalm 95 underlines the seriousness of unbelief and disobedience. The ongoing nature of the promise points to a continued opportunity for entrance into God's rest, underscoring the corporate and enduring nature of salvation."
    },
    {
      "pk": 65004006,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 6,
      "text": "Therefore, since it remains for some to enter it, and those who formerly received the good news failed to enter because of disobedience,",
      "links": "<a href='/AIV/04/14/22-23'>Num. 14:22-23</a>; <a href='/AIV/58/3/18-19'>Heb. 3:18-19</a>",
      "comment": "The warning about disobedience echoes Israel's rejection in the wilderness. The door to God's rest is still open for those who respond in faith and obedience, encouraging unity and perseverance among believers."
    },
    {
      "pk": 65004007,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 7,
      "text": "He again sets a certain day, saying through David, so long afterward, as it was already stated: 'Today, if you hear His voice, do not harden your hearts.'",
      "links": "<a href='/AIV/19/95/7-8'>Ps. 95:7-8</a>; <a href='/AIV/58/3/7'>Heb. 3:7</a>",
      "comment": "The invitation is still active—'Today'—underscoring the urgency of responding to God's call. The reference to David shows continuity in God’s salvific plan, and hints at the living voice of God continuing to speak through the worshiping Church."
    },
    {
      "pk": 65004008,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 8,
      "text": "For if Joshua had given them rest, God would not have spoken later about another day.",
      "links": "<a href='/AIV/06/22/4'>Josh. 22:4</a>; <a href='/AIV/19/95/11'>Ps. 95:11</a>",
      "comment": "The rest provided by Joshua was incomplete, pointing toward a fuller, spiritual rest yet to come. The hint at a greater fulfillment found later encourages reflection on the ongoing work of salvation drawn from both Old and New Covenant promises."
    },
    {
      "pk": 65004009,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 9,
      "text": "So then, a Sabbath rest remains for the people of God.",
      "links": "<a href='/AIV/01/2/2-3'>Gen. 2:2-3</a>; <a href='/AIV/19/95/11'>Ps. 95:11</a>",
      "comment": "The reference to a continuing Sabbath rest is rich with spiritual meaning, anticipating eternal rest in Christ and the celebration of worship unveiled in heaven. This verse accentuates the spiritual practice of worship as essential in Christian life, pointing to the liturgical depth of 'rest.'"
    },
    {
      "pk": 65004010,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 10,
      "text": "For whoever has entered His rest has also rested from his own works, just as God did from His.",
      "links": "<a href='/AIV/01/2/2'>Gen. 2:2</a>; <a href='/AIV/58/9/14'>Heb. 9:14</a>",
      "comment": "Believers rest from their own striving for justification, entering into the grace given by God. This points to the completed work of Christ, and supports the understanding of salvation as both present and future, experienced through active participation in faith."
    },
    {
      "pk": 65004011,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 11,
      "text": "Let us therefore make every effort to enter that rest, so that none may fall by following the same pattern of disobedience.",
      "links": "<a href='/AIV/61/1/10'>2 Pet. 1:10</a>; <a href='/AIV/58/3/18-19'>Heb. 3:18-19</a>",
      "comment": "Discipline and perseverance in faith are required—rest is not passive, but must be pursued through active obedience. This understanding fits with historic views of salvation as a journey involving cooperation with grace."
    },
    {
      "pk": 65004012,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 12,
      "text": "For the word of God is living and active, sharper than any two-edged sword, piercing even to the division of soul and spirit, joints and marrow, and able to judge the thoughts and intentions of the heart.",
      "links": "<a href='/AIV/23/55/11'>Isa. 55:11</a>; <a href='/AIV/49/6/17'>Eph. 6:17</a>",
      "comment": "God's word performs powerfully in the believer, discerning true intentions and sanctifying the heart. This verse speaks to the real presence and efficacy of God's revelation, working not only intellectually, but spiritually and sacramentally."
    },
    {
      "pk": 65004013,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 13,
      "text": "And there is no creature hidden from His sight, but all things are naked and exposed to the eyes of Him to whom we must give account.",
      "links": "<a href='/AIV/19/139/1-4'>Ps. 139:1-4</a>; <a href='/AIV/45/14/12'>Rom. 14:12</a>",
      "comment": "God's omniscience is emphasized; each person is fully known and must answer for their lives. This calls the believer to self-examination and humility, echoing ancient traditions of confession and penance before God."
    },
    {
      "pk": 65004014,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 14,
      "text": "Since then we have a great High Priest who has passed through the heavens, Jesus, the Son of God, let us hold firmly to our confession.",
      "links": "<a href='/AIV/03/16/2'>Lev. 16:2</a>; <a href='/AIV/58/7/26'>Heb. 7:26</a>",
      "comment": "Jesus as High Priest brings the old covenant priesthood to fulfillment. This mediatorial role emphasizes His divinity and humanity (cf. John 1:1, 14), and the sacrificial nature of His work, inviting believers to remain steadfast, as would be encouraged in the apostolic tradition."
    },
    {
      "pk": 65004015,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 15,
      "text": "For we do not have a High Priest unable to sympathize with our weaknesses, but one who has been tempted in every way as we are, yet without sin.",
      "links": "<a href='/AIV/40/4/1-11'>Matt. 4:1-11</a>; <a href='/AIV/47/5/21'>2 Cor. 5:21</a>",
      "comment": "The sinless humanity of Jesus is highlighted, demonstrating that He knows our suffering and temptation but remains perfect. This dual reality deepens our confidence in His ability to intercede and extends the assurance of mercy in the sacramental life of the Church."
    },
    {
      "pk": 65004016,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 4,
      "verse": 16,
      "text": "Let us then approach the throne of grace with confidence, so that we may receive mercy and find grace to help us in our time of need.",
      "links": "<a href='/AIV/58/10/19-22'>Heb. 10:19-22</a>; <a href='/AIV/19/103/8-12'>Ps. 103:8-12</a>",
      "comment": "Direct access to divine mercy through Christ is proclaimed. The idea of a 'throne of grace' suggests a real, ongoing means by which God gives grace and mercy—a theme deeply rooted in both Old Testament worship and the practice of approaching God through the mediation of Christ."
    }
  ],
  "translatedAt": "2025-12-24T12:17:44.528Z"
}