{
  "book": "Hebrews",
  "bookAbbreviation": "Heb",
  "chapter": 12,
  "verses": [
    {
      "pk": 1200121,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 1,
      "text": "Therefore, since we are surrounded by such a great cloud of witnesses, let us lay aside every weight and the sin that so easily entangles, and let us run with endurance the race set before us.",
      "links": "<a href='/AIV/58/11/1-40'>Heb. 11:1–40</a>; <a href='/AIV/46/9/24'>1 Cor. 9:24</a>",
      "comment": "The 'great cloud of witnesses' points to the saints of faith described in chapter 11. The endurance in faith echoes themes from the Old Testament, emphasizing perseverance within the community of believers."
    },
    {
      "pk": 1200122,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 2,
      "text": "Let us fix our eyes on Jesus, the author and perfecter of faith, who for the joy set before him endured the cross, despising its shame, and is seated at the right hand of the throne of God.",
      "links": "<a href='/AIV/41/16/19'>Mark 16:19</a>; <a href='/AIV/44/2/33'>Acts 2:33</a>; <a href='/AIV/11/22/19'>1 Kings 22:19</a>",
      "comment": "Jesus as 'author and perfecter' presents him as both the initiator and completer of faith, highlighting his unique mediation. His enthronement fulfills Psalm 110:1, pointing to divine kingship and priesthood."
    },
    {
      "pk": 1200123,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 3,
      "text": "Consider him who endured such hostility from sinners, so that you will not grow weary or lose heart.",
      "links": "<a href='/AIV/40/27/39-44'>Matt. 27:39–44</a>; <a href='/AIV/45/8/17'>Rom. 8:17</a>",
      "comment": "By focusing on Christ’s suffering, Christians are encouraged to remain steadfast, sharing in his endurance."
    },
    {
      "pk": 1200124,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 4,
      "text": "In your struggle against sin, you have not yet resisted to the point of shedding your blood.",
      "links": "<a href='/AIV/46/10/13'>1 Cor. 10:13</a>",
      "comment": "Believers are reminded that Christ’s sacrificial struggle went further than theirs, urging earnest resistance to sin."
    },
    {
      "pk": 1200125,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 5,
      "text": "And you have forgotten the exhortation that addresses you as sons: 'My son, do not regard lightly the Lord’s discipline, nor be discouraged when he corrects you.'",
      "links": "<a href='/AIV/20/3/11-12'>Prov. 3:11–12</a>",
      "comment": "The quotation from Proverbs establishes divine discipline as a token of sonship, echoing the parental relationship between God and believers."
    },
    {
      "pk": 1200126,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 6,
      "text": "For the Lord disciplines the one he loves, and chastises every son whom he receives.",
      "links": "<a href='/AIV/20/3/12'>Prov. 3:12</a>; <a href='/AIV/66/3/19'>Rev. 3:19</a>",
      "comment": "God’s discipline is a mark of love and acceptance, aligning with spiritual maturity and growth in holiness."
    },
    {
      "pk": 1200127,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 7,
      "text": "Endure discipline; God is treating you as sons. For what son is there whom a father does not discipline?",
      "links": "<a href='/AIV/20/13/24'>Prov. 13:24</a>",
      "comment": "Here, the analogy of a father and son reinforces the importance of corrective love, which forms and strengthens spiritual identity."
    },
    {
      "pk": 1200128,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 8,
      "text": "If you are without discipline, in which all have participated, then you are illegitimate children, and not true sons.",
      "links": "<a href='/AIV/45/8/14-17'>Rom. 8:14–17</a>",
      "comment": "Discipline affirms genuine familial relationship with God, reflecting the spiritual inheritance given to those in union with Christ."
    },
    {
      "pk": 1200129,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 9,
      "text": "Furthermore, we had earthly fathers who disciplined us and we respected them. Shall we not much more willingly submit to the Father of spirits and live?",
      "links": "<a href='/AIV/04/16/22'>Num. 16:22</a>",
      "comment": "Submission to God, the 'Father of spirits', suggests a deeper spiritual order, implying reverence and obedience nurtures true life."
    },
    {
      "pk": 1200130,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 10,
      "text": "For they disciplined us for a little while as seemed good to them, but he for our benefit, so that we may share in his holiness.",
      "links": "<a href='/AIV/60/1/15-16'>1 Pet. 1:15–16</a>",
      "comment": "Divine discipline’s ultimate aim is to make us holy, sharing God’s own nature, a profound spiritual transformation."
    },
    {
      "pk": 1200131,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 11,
      "text": "For the moment, all discipline seems painful rather than pleasant, but later it yields the peaceful fruit of righteousness to those who have been trained by it.",
      "links": "<a href='/AIV/50/4/7'>Phil. 4:7</a>",
      "comment": "Spiritual growth through discipline produces enduring righteousness, a promise echoing sanctifying grace."
    },
    {
      "pk": 1200132,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 12,
      "text": "Therefore lift your drooping hands and strengthen your weak knees.",
      "links": "<a href='/AIV/23/35/3'>Isa. 35:3</a>",
      "comment": "This exhortation echoes Isaiah’s call to encouragement and renewal, urging perseverance amidst trial."
    },
    {
      "pk": 1200133,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 13,
      "text": "And make straight paths for your feet, so that what is lame may not be out of joint, but rather be healed.",
      "links": "<a href='/AIV/23/35/8'>Isa. 35:8</a>",
      "comment": "A reference to spiritual healing, suggesting that a steady, direct path in faith fosters restoration and wholeness."
    },
    {
      "pk": 1200134,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 14,
      "text": "Pursue peace with everyone, and the holiness without which no one will see the Lord.",
      "links": "<a href='/AIV/19/24/3-4'>Ps. 24:3–4</a>; <a href='/AIV/40/5/8-9'>Matt. 5:8-9</a>",
      "comment": "Peace and holiness are essential for communion with God, reflecting a call to both personal and communal sanctity."
    },
    {
      "pk": 1200135,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 15,
      "text": "See to it that no one fails to receive the grace of God, and that no root of bitterness grows up and causes trouble, and by it many are defiled.",
      "links": "<a href='/AIV/05/29/18'>Deut. 29:18</a>",
      "comment": "This warns against division and bitterness within the fellowship, advocating for diligence in preserving unity through grace."
    },
    {
      "pk": 1200136,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 16,
      "text": "Let no one be sexually immoral or unholy like Esau, who sold his birthright for a single meal.",
      "links": "<a href='/AIV/01/25/34'>Gen. 25:34</a>",
      "comment": "Esau’s loss of spiritual inheritance is a caution against short-sightedness and profaning what is sacred."
    },
    {
      "pk": 1200137,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 17,
      "text": "For you know that afterward, when he wanted to inherit the blessing, he was rejected, for he found no place for repentance, though he sought it with tears.",
      "links": "<a href='/AIV/01/27/34-38'>Gen. 27:34–38</a>",
      "comment": "There's a sober warning about the consequences of rejecting God’s gift, linking repentance with genuine conversion and perseverance."
    },
    {
      "pk": 1200138,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 18,
      "text": "For you have not come to a mountain that can be touched and that blazed with fire, and to darkness, gloom, and storm,",
      "links": "<a href='/AIV/02/19/12-19'>Ex. 19:12–19</a>",
      "comment": "Contrast with Sinai: the Old Covenant was marked by physical phenomena and awe that highlight the limitation of earthly mediation."
    },
    {
      "pk": 1200139,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 19,
      "text": "and to a trumpet’s sound and a voice speaking words, so that those who heard begged that no further message be spoken to them.",
      "links": "<a href='/AIV/02/20/18-19'>Ex. 20:18–19</a>",
      "comment": "People’s request at Sinai shows the barriers to communion under the old order."
    },
    {
      "pk": 1200140,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 20,
      "text": "For they could not endure the command, 'If even a beast touches the mountain, it must be stoned.'",
      "links": "<a href='/AIV/02/19/13'>Ex. 19:13</a>",
      "comment": "Sanctity of Sinai required separation; law’s severity underscored humanity’s distance from God."
    },
    {
      "pk": 1200141,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 21,
      "text": "And so terrifying was the sight that Moses said, 'I am trembling with fear.'",
      "links": "<a href='/AIV/05/9/19'>Deut. 9:19</a>",
      "comment": "Even Moses, the mediator, stood in awe and fear, showing the gravity of direct encounter with God’s holiness under the law."
    },
    {
      "pk": 1200142,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 22,
      "text": "But you have come to Mount Zion, to the city of the living God, the heavenly Jerusalem, and to countless angels in festal gathering,",
      "links": "<a href='/AIV/19/87/2'>Ps. 87:2</a>; <a href='/AIV/66/21/2'>Rev. 21:2</a>",
      "comment": "This spiritual vision highlights the fulfillment of temple worship in the heavenly city—a motif drawn from Old Testament prophecy and realized in Christ."
    },
    {
      "pk": 1200143,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 23,
      "text": "to the assembly of the firstborn enrolled in heaven, and to God, the Judge of all, and to the spirits of the righteous made perfect,",
      "links": "<a href='/AIV/66/7/9-17'>Rev. 7:9–17</a>; <a href='/AIV/20/11/30'>Prov. 11:30</a>",
      "comment": "Reference to the heavenly assembly emphasizes spiritual union and perfection, interpreted throughout church tradition as the communion of saints."
    },
    {
      "pk": 1200144,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 24,
      "text": "and to Jesus, the mediator of a new covenant, and to the sprinkled blood that speaks better things than the blood of Abel.",
      "links": "<a href='/AIV/58/8/6'>Heb. 8:6</a>; <a href='/AIV/01/4/10'>Gen. 4:10</a>",
      "comment": "Jesus as mediator replaces the Old Covenant with a superior one; his blood gives life, unlike Abel’s blood, which only cried out for justice. Suggests the ongoing power of sacramental realities in the life of the faithful."
    },
    {
      "pk": 1200145,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 25,
      "text": "See that you do not refuse him who speaks. For if they did not escape when they refused him who warned them on earth, much less will we if we turn away from him who warns us from heaven.",
      "links": "<a href='/AIV/02/20/22'>Ex. 20:22</a>; <a href='/AIV/40/17/5'>Matt. 17:5</a>",
      "comment": "There is a direct warning against rejecting God’s Word, now spoken through the heavenly mediator, stressing the necessity of hearing and obedience."
    },
    {
      "pk": 1200146,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 26,
      "text": "At that time his voice shook the earth, but now he has promised, 'Yet once more I will shake not only the earth but also the heavens.'",
      "links": "<a href='/AIV/37/2/6'>Hag. 2:6</a>",
      "comment": "This prophecy points to cosmic renewal and the passing away of temporary things, looking ahead to eschatological fulfillment."
    },
    {
      "pk": 1200147,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 27,
      "text": "The words 'Yet once more' indicate the removal of things that can be shaken—that is, things created—so that what cannot be shaken may remain.",
      "links": "<a href='/AIV/66/21/1-4'>Rev. 21:1–4</a>",
      "comment": "Temporary earthly realities give way to the eternal, unshakeable spiritual kingdom promised to believers."
    },
    {
      "pk": 1200148,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 28,
      "text": "Therefore, since we are receiving a kingdom that cannot be shaken, let us be thankful and worship God acceptably with reverence and awe.",
      "links": "<a href='/AIV/66/22/3'>Rev. 22:3</a>; <a href='/AIV/03/9/24'>Lev. 9:24</a>",
      "comment": "Worship here is set in the context of the eternal kingdom, fulfilled in Christ, and realized in the ongoing reverent spiritual practice of the community."
    },
    {
      "pk": 1200149,
      "translation": "AIV",
      "book": 58,
      "chapter": 12,
      "verse": 29,
      "text": "For our God is a consuming fire.",
      "links": "<a href='/AIV/05/4/24'>Deut. 4:24</a>",
      "comment": "God’s holiness is overwhelming and purifying, requiring sincere devotion and true worship—an echo of Old Testament teaching now realized through Christ’s mediation."
    }
  ],
  "translatedAt": "2025-12-23T04:11:23.332Z"
}