{
  "book": "Hebrews",
  "bookAbbreviation": "Heb",
  "chapter": 3,
  "verses": [
    {
      "pk": 1933010,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 1,
      "text": "Therefore, holy brothers, sharers in a heavenly calling, fix your thoughts on Jesus, the Apostle and High Priest of our confession.",
      "links": "<a href='/AIV/1/1/26'>Gen. 1:26</a>; <a href='/AIV/2/17/1-4'>Heb. 2:17</a>; <a href='/AIV/4/14/1-3'>Heb. 4:14</a>",
      "comment": "The unique title 'Apostle and High Priest' is only applied to Jesus here, highlighting both his mission from the Father (see John 20:21) and his mediatorial role (cf. 1 Tim. 2:5). The mention of 'confession' points to the unity and visible profession of faith among the holy brothers."
    },
    {
      "pk": 1933011,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 2,
      "text": "He was faithful to him who appointed him, just as Moses also was faithful in all his house.",
      "links": "<a href='/AIV/4/12/7'>Num. 12:7</a>; <a href='/AIV/6/1/5'>Heb. 6:5</a>",
      "comment": "Both Jesus and Moses were faithful, but Jesus is about to be shown as greater. The reference to 'his house' is an allusion to God’s people as a spiritual household (see Num. 12:7)."
    },
    {
      "pk": 1933012,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 3,
      "text": "Yet Jesus is counted worthy of more glory than Moses, just as the builder of a house has more honor than the house itself.",
      "links": "<a href='/AIV/3/6/6'>1 Cor. 3:6</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "Jesus is the builder, indicating his divinity and creative authority over the people of God (see Col. 1:16; John 1:3). Moses was a servant inside the house, but Jesus is over it."
    },
    {
      "pk": 1933013,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 4,
      "text": "For every house is built by someone, but the one who built all things is God.",
      "links": "<a href='/AIV/1/1/1'>Gen. 1:1</a>; <a href='/AIV/43/1/1-3'>John 1:1-3</a>",
      "comment": "This explicitly links Jesus with God as Creator, as affirmed elsewhere (John 1:3, Col. 1:16). Christians are a spiritual house, built by God."
    },
    {
      "pk": 1933014,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 5,
      "text": "Moses was faithful as a servant in all his house, bearing witness to what would be spoken by God in the future.",
      "links": "<a href='/AIV/4/12/7'>Num. 12:7</a>; <a href='/AIV/5/18/15'>Deut. 18:15</a>",
      "comment": "Moses is called 'servant,' prefiguring the coming of a greater prophet; Moses' fidelity points ahead to the fullness that is revealed in Jesus."
    },
    {
      "pk": 1933015,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 6,
      "text": "But Christ is faithful as the Son over his own house. And we are his house, if we hold firm our confidence and the hope in which we glory.",
      "links": "<a href='/AIV/2/3/6'>Eph. 2:19-22</a>; <a href='/AIV/60/2/5'>1 Pet. 2:5</a>",
      "comment": "Christians are God’s household, built upon and ruled by Christ the Son, not a mere servant. Perseverance and fidelity are essential, suggesting the ongoing cooperation with grace."
    },
    {
      "pk": 1933016,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 7,
      "text": "Therefore, as the Holy Spirit says, 'Today, if you hear his voice,",
      "links": "<a href='/AIV/19/95/7'>Ps. 95:7</a>",
      "comment": "Direct quotation from Psalm 95, attributed here to the Spirit, pointing to the divine inspiration of the Old Testament."
    },
    {
      "pk": 1933017,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 8,
      "text": "do not harden your hearts as in the rebellion, on the day of testing in the desert,",
      "links": "<a href='/AIV/19/95/8'>Ps. 95:8</a>; <a href='/AIV/2/17/1-7'>Ex. 17:1-7</a>",
      "comment": "The reference is to the Israelites’ rebellion in the wilderness (see Ex. 17:1–7; Num. 14:22-23). The warning applies to Christian perseverance."
    },
    {
      "pk": 1933018,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 9,
      "text": "where your fathers tested and tried me, and saw my works for forty years.",
      "links": "<a href='/AIV/19/95/9'>Ps. 95:9</a>",
      "comment": "God’s patience and Israel’s failure are emphasized. The 'forty years' tie to the wandering, a repeated symbol of the need to remain steadfast in faith."
    },
    {
      "pk": 1933019,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 10,
      "text": "Therefore I was angry with that generation, and said, 'They always go astray in their hearts; they have not known my ways.'",
      "links": "<a href='/AIV/19/95/10'>Ps. 95:10</a>",
      "comment": "Divine judgment is tied to the heart’s disposition, not mere external disobedience. A warning for Christians to guard the inner life."
    },
    {
      "pk": 1933020,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 11,
      "text": "As I swore in my wrath, 'They shall never enter my rest.'",
      "links": "<a href='/AIV/19/95/11'>Ps. 95:11</a>; <a href='/AIV/4/14/23'>Num. 14:23</a>",
      "comment": "'Rest' is not only literal entry into Canaan but also points typologically to eternal rest with God, a theme developed more in Hebrews 4."
    },
    {
      "pk": 1933021,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 12,
      "text": "See to it, brothers, that none of you has an evil, unbelieving heart that turns away from the living God.",
      "links": "<a href='/AIV/5/29/18'>Deut. 29:18</a>",
      "comment": "The exhortation highlights the reality of apostasy. Faith is not a one-time event but an ongoing commitment."
    },
    {
      "pk": 1933022,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 13,
      "text": "But encourage one another daily, as long as it is called 'Today,' so that none of you may be hardened by the deceitfulness of sin.",
      "links": "<a href='/AIV/19/95/7'>Ps. 95:7</a>; <a href='/AIV/10/12/1'>Prov. 12:1</a>",
      "comment": "Ongoing mutual encouragement within the visible community of believers is necessary for perseverance. This points to the communal, not merely individual, life of faith."
    },
    {
      "pk": 1933023,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 14,
      "text": "For we have become partners with Christ, if we hold our original confidence firm to the end.",
      "links": "<a href='/AIV/1/2/6'>1 Cor. 2:6</a>; <a href='/AIV/40/10/22'>Matt. 10:22</a>",
      "comment": "Union with Christ is ongoing and is contingent on perseverance. This stresses the necessity of cooperating with grace throughout the Christian life."
    },
    {
      "pk": 1933024,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 15,
      "text": "As it is said, 'Today, if you hear his voice, do not harden your hearts as in the rebellion.'",
      "links": "<a href='/AIV/19/95/7-8'>Ps. 95:7-8</a>",
      "comment": "Repetition of the Spirit’s warning shows the urgency and ongoing relevance for all generations of believers."
    },
    {
      "pk": 1933025,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 16,
      "text": "For who were those who heard and yet rebelled? Was it not all who came out of Egypt led by Moses?",
      "links": "<a href='/AIV/2/14/30-31'>Ex. 14:30-31</a>",
      "comment": "Even those who experienced salvation (exodus) can fall into unbelief. Salvation history warns believers not to presume upon initial grace."
    },
    {
      "pk": 1933026,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 17,
      "text": "And with whom was he angry for forty years? Was it not those who sinned, whose bodies fell in the wilderness?",
      "links": "<a href='/AIV/4/14/29'>Num. 14:29</a>",
      "comment": "The grave consequences of unfaithfulness are underscored. The visible community is not automatically secure but must persevere."
    },
    {
      "pk": 1933027,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 18,
      "text": "And to whom did he swear that they would not enter his rest, if not to those who disobeyed?",
      "links": "<a href='/AIV/19/95/11'>Ps. 95:11</a>",
      "comment": "'Rest' is both the earthly Promised Land and its ultimate fulfillment in union with God. Disobedience can forfeit this promise."
    },
    {
      "pk": 1933028,
      "translation": "AIV",
      "book": 58,
      "chapter": 3,
      "verse": 19,
      "text": "So we see that they were unable to enter because of unbelief.",
      "links": "<a href='/AIV/4/14/22'>Num. 14:22</a>",
      "comment": "The entire section emphasizes that faith and obedience are necessary to enter God’s ultimate rest. The communal warnings and daily exhortations suggest the need for a tangible, corporate faith life, expressed visibly through mutual encouragement and fidelity to the tradition."
    }
  ],
  "translatedAt": "2025-12-23T04:07:15.817Z"
}