{
  "book": "Hebrews",
  "bookAbbreviation": "Heb",
  "chapter": 1,
  "verses": [
    {
      "pk": 34001001,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 1,
      "text": "Long ago, God spoke to our fathers in many parts and in many ways by the prophets.",
      "links": "<a href='/AIV/2/3/6'>Ex. 3:6</a>; <a href='/AIV/23/1/1'>Isa. 1:1</a>",
      "comment": "God's communication in the past through prophets laid the foundation for the fuller revelation in Christ, emphasizing continuity in salvation history."
    },
    {
      "pk": 34001002,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 2,
      "text": "But in these last days, He has spoken to us by His Son, whom He appointed heir of all things, through whom also He made the ages.",
      "links": "<a href='/AIV/40/21/38'>Matt. 21:38</a>; <a href='/AIV/43/1/3'>John 1:3</a>; <a href='/AIV/51/1/16'>Col. 1:16</a>",
      "comment": "This verse teaches that revelation is now complete in the Son, who shares in God's divine work of creation and authority (see John 1:3). The word 'ages' highlights Christ's eternal role."
    },
    {
      "pk": 34001003,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 3,
      "text": "He is the radiance of God's glory and the exact imprint of His being, and He upholds all things by His powerful word. After making purification for sins, He sat down at the right hand of the Majesty on high.",
      "links": "<a href='/AIV/43/14/9'>John 14:9</a>; <a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/51/1/15'>Col. 1:15</a>",
      "comment": "Christ is described here in terms used only for God, affirming His divinity and role as sustainer. Sitting 'at the right hand' refers to His exaltation, a theme that hints at His ongoing priestly ministry (Ps. 110:1)."
    },
    {
      "pk": 34001004,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 4,
      "text": "Having become as much superior to the angels as the name He has inherited is more excellent than theirs.",
      "links": "<a href='/AIV/50/2/9-11'>Phil. 2:9–11</a>",
      "comment": "The 'name' refers to Sonship and divine authority. Christ is honored above the angels, reflecting His unique status."
    },
    {
      "pk": 34001005,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 5,
      "text": "For to which of the angels did God ever say, 'You are My Son, today I have begotten You'? Or again, 'I will be to Him a Father, and He shall be to Me a Son'?",
      "links": "<a href='/AIV/19/2/7'>Ps. 2:7</a>; <a href='/AIV/10/7/14'>2 Sam. 7:14</a>",
      "comment": "Old Testament prophecy is fulfilled in Christ, declared uniquely as God's Son (Ps. 2:7). This sonship also implies authority and intimacy beyond angelic beings."
    },
    {
      "pk": 34001006,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 6,
      "text": "And again, when He brings the Firstborn into the world, He says, 'Let all God's angels worship Him.'",
      "links": "<a href='/AIV/5/32/43'>Deut. 32:43 (LXX)</a>; <a href='/AIV/19/97/7'>Ps. 97:7</a>",
      "comment": "Worship due to the Son shows His divine status. This worship, reserved for God alone, reflects the high christology found throughout the New Testament."
    },
    {
      "pk": 34001007,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 7,
      "text": "And of the angels He says, 'He makes His angels winds, and His servants flames of fire.'",
      "links": "<a href='/AIV/19/104/4'>Ps. 104:4</a>",
      "comment": "Angels are God's messengers and serve His will, but do not share in the eternal reign of the Son."
    },
    {
      "pk": 34001008,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 8,
      "text": "But of the Son He says, 'Your throne, O God, is forever and ever, and the scepter of uprightness is the scepter of Your kingdom.'",
      "links": "<a href='/AIV/19/45/6-7'>Ps. 45:6-7</a>",
      "comment": "God the Father addresses the Son as 'God,' reinforcing the full divinity of Christ and the eternal nature of His reign. Compare to Psalm 45:6-7 for the Old Testament context."
    },
    {
      "pk": 34001009,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 9,
      "text": "You have loved righteousness and hated lawlessness; therefore God, your God, has anointed you with the oil of gladness beyond your companions.",
      "links": "<a href='/AIV/19/45/7'>Ps. 45:7</a>; <a href='/AIV/44/10/38'>Acts 10:38</a>",
      "comment": "Christ's perfect obedience and anointing set Him apart as the unique Messiah and mediator, interpreted by early Christians as a reference to His consecration and priestly office."
    },
    {
      "pk": 34001010,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 10,
      "text": "And, 'You, Lord, in the beginning laid the foundation of the earth, and the heavens are the work of Your hands.'",
      "links": "<a href='/AIV/19/102/25'>Ps. 102:25</a>; <a href='/AIV/43/1/1-3'>John 1:1-3</a>",
      "comment": "The Son is addressed as the Creator, another clear statement of His divinity (Ps. 102:25 applied directly to Christ)."
    },
    {
      "pk": 34001011,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 11,
      "text": "They will perish, but You remain. They will all wear out like a garment;",
      "links": "<a href='/AIV/19/102/26'>Ps. 102:26</a>",
      "comment": "Creation is transient, but the Son is eternal. This underlines His unchanging nature, a quality unique to God."
    },
    {
      "pk": 34001012,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 12,
      "text": "like a robe You will roll them up, like a garment they will be changed. But You are the same, and Your years will have no end.",
      "links": "<a href='/AIV/19/102/26-27'>Ps. 102:26-27</a>",
      "comment": "The same attributes of God in the Old Testament are now directly ascribed to Christ, affirming His eternal kingship. This spiritual interpretation implies the permanence and ever-living priesthood of the Son."
    },
    {
      "pk": 34001013,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 13,
      "text": "But to which of the angels has He ever said, 'Sit at My right hand until I make Your enemies a footstool for Your feet'?",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/40/22/44'>Matt. 22:44</a>",
      "comment": "This is a messianic prophecy (Ps. 110:1) always applied to Christ, indicating His divine authority and the future subjection of all to Him, pointing towards His final victory and continuing rule."
    },
    {
      "pk": 34001014,
      "translation": "AIV",
      "book": 58,
      "chapter": 1,
      "verse": 14,
      "text": "Are they not all ministering spirits sent out to serve those who are to inherit salvation?",
      "links": "<a href='/AIV/19/103/20-21'>Ps. 103:20-21</a>",
      "comment": "Angels are servants sent to assist believers, but Christ alone is the source of salvation and eternal life. This distinction emphasizes the unique mediation and continuing ministry of the Son."
    }
  ],
  "translatedAt": "2025-12-23T04:06:23.196Z"
}