{
  "book": 65,
  "bookName": "Hebrews",
  "bookAbbreviation": "Heb",
  "chapter": 7,
  "verses": [
    {
      "pk": 65007001,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 1,
      "text": "For this Melchizedek, king of Salem, priest of the Most High God, met Abraham returning from defeating the kings and blessed him.",
      "links": "<a href='/AIV/01/14/18'>Gen. 14:18-20</a>; <a href='/AIV/19/110/4'>Ps. 110:4</a>",
      "comment": "Melchizedek is a mysterious Old Testament figure—both a king and a priest—and blesses Abraham, signifying his superiority to Abraham. This lays the groundwork for Christ's eternal priesthood, which supersedes the Levitical order. See also Genesis 14:18 and Psalm 110:4."
    },
    {
      "pk": 65007002,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 2,
      "text": "And Abraham gave him a tenth of everything. First, his name means 'king of righteousness,' and also he is king of Salem, that is, 'king of peace.'",
      "links": "<a href='/AIV/01/14/20'>Gen. 14:20</a>; <a href='/AIV/19/76/2'>Ps. 76:2</a>",
      "comment": "Melchizedek receives tithes from Abraham and his names mean 'king of righteousness' and 'king of peace.' This points to Christ, the true source of righteousness and peace. The act of tithing shows recognition of a higher priestly authority."
    },
    {
      "pk": 65007003,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 3,
      "text": "He is without father, without mother, without genealogy, having neither beginning of days nor end of life, but resembling the Son of God, he remains a priest forever.",
      "links": "<a href='/AIV/19/110/4'>Ps. 110:4</a>; <a href='/AIV/43/1/1-2'>John 1:1-2</a>",
      "comment": "The eternal nature of Melchizedek prefigures Christ’s everlasting priesthood; there is no record of his parentage or death. This typology shows Jesus' unique, unending priesthood, surpassing all earthly priests."
    },
    {
      "pk": 65007004,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 4,
      "text": "See how great this man was: Abraham the patriarch gave him a tenth of the spoils.",
      "links": "<a href='/AIV/01/14/20'>Gen. 14:20</a>",
      "comment": "Abraham, the father of the faith, honors Melchizedek by offering him a tithe. This demonstrates Melchizedek’s exalted status, foreshadowing the ultimate priestly role fulfilled in Christ."
    },
    {
      "pk": 65007005,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 5,
      "text": "Now the sons of Levi who receive the priestly office have a commandment in the Law to collect tithes from the people, that is, from their brothers, even though they too are descended from Abraham.",
      "links": "<a href='/AIV/04/18/21'>Num. 18:21</a>; <a href='/AIV/03/27/30'>Lev. 27:30</a>",
      "comment": "The Levitical priests received tithes by the Mosaic law, but were themselves Abraham’s descendants. This distinction shows a priesthood above theirs had already existed."
    },
    {
      "pk": 65007006,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 6,
      "text": "But the one who did not trace his descent from them received tithes from Abraham and blessed him who had the promises.",
      "links": "<a href='/AIV/01/12/2-3'>Gen. 12:2-3</a>",
      "comment": "Melchizedek, with no genealogical ties to Levi, receives tithes from Abraham and bestows a blessing on him, highlighting a superior priestly office."
    },
    {
      "pk": 65007007,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 7,
      "text": "It is beyond all dispute that the lesser is blessed by the greater.",
      "links": "<a href='/AIV/01/27/27-29'>Gen. 27:27-29</a>",
      "comment": "Biblically, a superior figure bestows blessings on a lesser. This underscores Melchizedek’s greatness over Abraham and, by extension, the Levitical priests."
    },
    {
      "pk": 65007008,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 8,
      "text": "In one case, tithes are received by those who die; but there, by one of whom it is testified that he lives.",
      "links": "<a href='/AIV/19/110/4'>Ps. 110:4</a>",
      "comment": "Levitical priests die, but the text speaks as if Melchizedek lives, foreshadowing Christ’s living, unending priesthood."
    },
    {
      "pk": 65007009,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 9,
      "text": "One could even say that Levi, who receives tithes, paid tithes through Abraham,",
      "links": "<a href='/AIV/01/14/20'>Gen. 14:20</a>",
      "comment": "Christologically significant, this demonstrates the Levitical priesthood’s inferiority even within Abraham’s lineage."
    },
    {
      "pk": 65007010,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 10,
      "text": "for he was still in the loins of his ancestor when Melchizedek met him.",
      "links": "<a href='/AIV/01/14/18'>Gen. 14:18</a>",
      "comment": "Even Levi, unborn, recognizes Melchizedek’s greatness through Abraham. The logic reinforces the perpetual and higher priesthood of Christ."
    },
    {
      "pk": 65007011,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 11,
      "text": "If perfection had been attainable through the Levitical priesthood—for under it the people received the Law—what further need would there have been for another priest to arise after the order of Melchizedek, rather than one named after the order of Aaron?",
      "links": "<a href='/AIV/19/110/4'>Ps. 110:4</a>; <a href='/AIV/03/8/1'>Lev. 8:1</a>",
      "comment": "The Levitical priesthood could not bring perfection, necessitating a new order of priesthood. The Old Testament (Psalm 110:4) prophesied a priest arising from Melchizedek’s order—fulfilled in Jesus."
    },
    {
      "pk": 65007012,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 12,
      "text": "For when the priesthood is changed, there must also be a change in the law as well.",
      "links": "<a href='/AIV/19/110/4'>Ps. 110:4</a>; <a href='/AIV/40/5/17'>Matt. 5:17</a>",
      "comment": "A new priesthood requires a new covenantal structure. In Christ, the priesthood and law are both fulfilled and transitioned into something greater and more permanent."
    },
    {
      "pk": 65007013,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 13,
      "text": "For the one of whom these things are spoken belonged to another tribe, from which no one has ever served at the altar.",
      "links": "<a href='/AIV/01/49/10'>Gen. 49:10</a>; <a href='/AIV/04/3/10'>Num. 3:10</a>",
      "comment": "Jesus came from Judah, a tribe not associated with the priesthood, further highlighting the uniqueness of his priestly role."
    },
    {
      "pk": 65007014,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 14,
      "text": "For it is clear that our Lord arose from Judah, and concerning that tribe Moses said nothing about priests.",
      "links": "<a href='/AIV/01/49/10'>Gen. 49:10</a>; <a href='/AIV/40/1/2'>Matt. 1:2</a>",
      "comment": "Christ’s lineage is traced through Judah, not Levi. His priesthood is established by divine appointment, not merely by genealogy."
    },
    {
      "pk": 65007015,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 15,
      "text": "And it is even more clear if another priest arises in the likeness of Melchizedek,",
      "links": "<a href='/AIV/19/110/4'>Ps. 110:4</a>",
      "comment": "Christ fulfills the prophecy as a priest not according to Aaron but after the eternal order of Melchizedek—a pattern prefigured in scripture."
    },
    {
      "pk": 65007016,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 16,
      "text": "who has become a priest, not based on a law of physical descent, but by the power of an indestructible life.",
      "links": "<a href='/AIV/19/16/10'>Ps. 16:10</a>; <a href='/AIV/19/110/4'>Ps. 110:4</a>",
      "comment": "Jesus’ priesthood is marked by his resurrection—he lives forever. His right to serve is by divine authority, not mere ancestry."
    },
    {
      "pk": 65007017,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 17,
      "text": "For it is witnessed of him, 'You are a priest forever, after the order of Melchizedek.'",
      "links": "<a href='/AIV/19/110/4'>Ps. 110:4</a>",
      "comment": "Psalm 110:4 prophetically testifies to Christ’s eternal, unending priesthood—greater than the Levitical priests and rooted in Old Testament promise."
    },
    {
      "pk": 65007018,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 18,
      "text": "For on the one hand, a former commandment is set aside because of its weakness and uselessness",
      "links": "<a href='/AIV/03/16/34'>Lev. 16:34</a>; <a href='/AIV/45/8/3'>Rom. 8:3</a>",
      "comment": "The Mosaic law—including its priesthood—was set aside, having been incapable of bringing true spiritual perfection."
    },
    {
      "pk": 65007019,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 19,
      "text": "—for the law made nothing perfect—but on the other hand, a better hope is introduced, through which we draw near to God.",
      "links": "<a href='/AIV/45/3/20'>Rom. 3:20</a>; <a href='/AIV/43/14/6'>John 14:6</a>",
      "comment": "The law could not perfect anyone; only through Jesus’ priesthood do we have a sure means of approaching God—a theme foundational for apostolic succession and the visible, sacramental priestly ministry."
    },
    {
      "pk": 65007020,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 20,
      "text": "And it was not without an oath; for those who become priests are made so without an oath,",
      "links": "<a href='/AIV/19/110/4'>Ps. 110:4</a>",
      "comment": "Christ’s priesthood is uniquely established by God’s oath, not by ancestral inheritance as in the old law."
    },
    {
      "pk": 65007021,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 21,
      "text": "but this one was made a priest with an oath by the One who said to him: 'The Lord has sworn and will not change his mind, “You are a priest forever.”'",
      "links": "<a href='/AIV/19/110/4'>Ps. 110:4</a>",
      "comment": "Christ’s priesthood is eternal and guaranteed by God’s unbreakable promise, fulfilling Psalm 110:4."
    },
    {
      "pk": 65007022,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 22,
      "text": "Because of this, Jesus has become the guarantee of a better covenant.",
      "links": "<a href='/AIV/24/31/31-34'>Jer. 31:31-34</a>; <a href='/AIV/42/22/20'>Luke 22:20</a>",
      "comment": "Jesus is the mediator and surety of the new and everlasting covenant, guaranteeing our relationship with God through his eternal priesthood."
    },
    {
      "pk": 65007023,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 23,
      "text": "The former priests were many in number, because death prevented them from continuing in office.",
      "links": "<a href='/AIV/04/20/28'>Num. 20:28</a>",
      "comment": "Levitical priests had to be replaced as they died; in contrast, Christ’s priesthood is singular and everlasting since he rose from the dead."
    },
    {
      "pk": 65007024,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 24,
      "text": "But he holds his priesthood permanently, because he continues forever.",
      "links": "<a href='/AIV/19/16/10'>Ps. 16:10</a>; <a href='/AIV/45/6/9'>Rom. 6:9</a>",
      "comment": "Christ, living forever, exercises an unchangeable priesthood. No successor is needed, making his priestly mediation all-sufficient."
    },
    {
      "pk": 65007025,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 25,
      "text": "Therefore he is able to save completely those who draw near to God through him, since he always lives to intercede for them.",
      "links": "<a href='/AIV/45/8/34'>Rom. 8:34</a>; <a href='/AIV/62/2/1'>1 John 2:1</a>",
      "comment": "Christ’s eternal intercession is the reason we can have complete confidence in approaching God. This corresponds to the idea of Christ as a continual mediator on our behalf."
    },
    {
      "pk": 65007026,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 26,
      "text": "For it was fitting that we should have such a high priest—holy, innocent, undefiled, set apart from sinners, and exalted above the heavens.",
      "links": "<a href='/AIV/58/4/15'>Heb. 4:15</a>; <a href='/AIV/43/8/46'>John 8:46</a>",
      "comment": "Only Christ fits the description of the perfect high priest: sinless, absolutely holy, and transcendent, able to mediate perfectly for us."
    },
    {
      "pk": 65007027,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 27,
      "text": "He does not need, as those high priests do, to offer sacrifices daily, first for his own sins and then for those of the people, because he did this once for all when he offered up himself.",
      "links": "<a href='/AIV/03/9/7'>Lev. 9:7</a>; <a href='/AIV/58/9/12'>Heb. 9:12</a>",
      "comment": "Jesus’ one sacrifice for all suffices forever; he does not need to offer sacrifices for himself as earthly priests did, affirming the uniqueness and sufficiency of his priestly and sacrificial role."
    },
    {
      "pk": 65007028,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 7,
      "verse": 28,
      "text": "For the law appoints men in their weakness as high priests, but the word of the oath, which came after the law, appoints the Son, who has been made perfect forever.",
      "links": "<a href='/AIV/19/110/4'>Ps. 110:4</a>; <a href='/AIV/40/3/17'>Matt. 3:17</a>",
      "comment": "The Mosaic Law made weak men priests; the divine oath appoints Jesus, Son of God, as the perfect and eternal high priest. This perfection is tied to his divine Sonship, reinforcing high Christology and the importance of apostolic, divinely-instituted mediation."
    }
  ],
  "translatedAt": "2025-12-24T12:20:14.392Z"
}