{
  "book": 65,
  "bookName": "Hebrews",
  "bookAbbreviation": "Heb",
  "chapter": 3,
  "verses": [
    {
      "pk": 65003001,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 1,
      "text": "Therefore, holy brothers and sisters, sharers in the heavenly calling, consider Jesus, the Apostle and High Priest of our confession.",
      "links": "<a href='/AIV/43/20/21'>John 20:21</a>; <a href='/AIV/58/4/14'>Heb. 4:14</a>",
      "comment": "Here, Jesus is called both Apostle (sent one) and High Priest, revealing his unique mediating role. The reference to 'holy brothers and sisters' highlights the family of believers united in Christ through a heavenly calling. The role of High Priest builds on Old Testament priesthood imagery, now fulfilled and perfected in Jesus (see Heb. 4:14)."
    },
    {
      "pk": 65003002,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 2,
      "text": "He was faithful to the One who appointed him, just as Moses was faithful in all God’s house.",
      "links": "<a href='/AIV/04/12/7'>Num. 12:7</a>; <a href='/AIV/02/40/16'>Ex. 40:16</a>",
      "comment": "The faithfulness of Jesus is compared to Moses, who was also seen as a faithful servant in God’s house. The house imagery links to the covenant people; Christ fulfills and surpasses the role Moses had (Num. 12:7)."
    },
    {
      "pk": 65003003,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 3,
      "text": "For Jesus is considered worthy of greater glory than Moses, just as the builder of a house has more honor than the house itself.",
      "links": "<a href='/AIV/40/16/18'>Matt. 16:18</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "The distinction is made between the house (God’s people under the Law) and the builder (Christ, who brings a new covenant). Jesus is not just another part of God’s house, but its architect and foundation, connecting to his promise about building the Church in Matt. 16:18."
    },
    {
      "pk": 65003004,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 4,
      "text": "For every house is built by someone, but the One who built everything is God.",
      "links": "<a href='/AIV/01/1/1'>Gen. 1:1</a>; <a href='/AIV/19/24/1'>Ps. 24:1</a>",
      "comment": "This verse points to God as the ultimate Creator and Sustainer, affirming Christ’s divinity by implication, since Christ is being described as the builder of God’s house (Gen. 1:1)."
    },
    {
      "pk": 65003005,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 5,
      "text": "Now Moses was faithful as a servant in all God’s house, as a testimony to what would be said in the future.",
      "links": "<a href='/AIV/04/12/7'>Num. 12:7</a>; <a href='/AIV/43/5/39'>John 5:39</a>",
      "comment": "Moses’s role was preparatory; he pointed to things yet to come, namely, the ultimate revelation in Christ. Jesus fulfills what Moses foreshadowed (John 5:39)."
    },
    {
      "pk": 65003006,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 6,
      "text": "But Christ is faithful as the Son over God’s house, and we are his house if we hold fast to our boldness and the hope in which we boast.",
      "links": "<a href='/AIV/49/2/19-22'>Eph. 2:19-22</a>; <a href='/AIV/46/3/16'>1 Cor. 3:16</a>",
      "comment": "Unlike Moses, Jesus is the Son—heir and ruler—over God’s people, and believers are now the living temple if they persevere. Early Christian tradition places emphasis on holding firm, linking to the assurance of salvation."
    },
    {
      "pk": 65003007,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 7,
      "text": "Therefore, as the Holy Spirit says: 'Today, if you hear his voice,",
      "links": "<a href='/AIV/19/95/7'>Ps. 95:7</a>; <a href='/AIV/58/4/7'>Heb. 4:7</a>",
      "comment": "The quote is from Psalm 95, attributed explicitly to the Holy Spirit, showing how Scripture is divinely inspired and continues to speak to us. This highlights the living tradition of the Church, listening to God’s ongoing voice."
    },
    {
      "pk": 65003008,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 8,
      "text": "do not harden your hearts as in the rebellion, on the day of testing in the wilderness,",
      "links": "<a href='/AIV/19/95/8'>Ps. 95:8</a>; <a href='/AIV/02/17/2-7'>Ex. 17:2-7</a>",
      "comment": "This refers to Israel’s rebellion during the Exodus. It becomes a warning for Christians not to fall into unbelief or reject divine authority, crucially linking faith to obedience."
    },
    {
      "pk": 65003009,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 9,
      "text": "where your ancestors tested and tried me, and saw my works for forty years.",
      "links": "<a href='/AIV/04/14/22-33'>Num. 14:22-33</a>; <a href='/AIV/19/95/9'>Ps. 95:9</a>",
      "comment": "Recalling the Israelites’ lack of faith after witnessing God’s miracles, this serves as a call to trust and persevere, lest believers fall into similar spiritual danger."
    },
    {
      "pk": 65003010,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 10,
      "text": "Therefore I was angry with that generation and said, 'They always go astray in their hearts; they have not known my ways.'",
      "links": "<a href='/AIV/19/95/10'>Ps. 95:10</a>; <a href='/AIV/26/18/30'>Ezek. 18:30</a>",
      "comment": "Divine displeasure is due not only to external actions but heart attitudes. True faith requires interior acceptance and living according to God’s revealed ways."
    },
    {
      "pk": 65003011,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 11,
      "text": "So I swore in my anger, 'They shall not enter my rest.'",
      "links": "<a href='/AIV/19/95/11'>Ps. 95:11</a>; <a href='/AIV/04/20/12'>Num. 20:12</a>; <a href='/AIV/58/4/3'>Heb. 4:3</a>",
      "comment": "‘Rest’ refers both to the Promised Land and, on a spiritual level, the eternal rest found in Christ. The warning foreshadows Christian hope of entering God’s final rest, showing a continuity of promise through history."
    },
    {
      "pk": 65003012,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 12,
      "text": "See to it, brothers and sisters, that none of you has an evil and unbelieving heart, leading you to fall away from the living God.",
      "links": "<a href='/AIV/58/10/26-31'>Heb. 10:26-31</a>; <a href='/AIV/24/17/9'>Jer. 17:9</a>",
      "comment": "Salvation requires perseverance; falling away is a real danger (Heb. 10:26-31). The text urges vigilance in faith and warns against presumption."
    },
    {
      "pk": 65003013,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 13,
      "text": "But encourage one another every day, as long as it is called 'Today,' so that none of you may be hardened by the deceitfulness of sin.",
      "links": "<a href='/AIV/58/10/24-25'>Heb. 10:24-25</a>; <a href='/AIV/20/27/17'>Prov. 27:17</a>",
      "comment": "The daily encouragement is a communal responsibility—implying the necessity of regular gathering and shared accountability within the ecclesial community."
    },
    {
      "pk": 65003014,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 14,
      "text": "For we have become sharers in Christ, if we hold firmly until the end the confidence we had at first.",
      "links": "<a href='/AIV/45/11/22'>Rom. 11:22</a>; <a href='/AIV/58/6/11'>Heb. 6:11</a>",
      "comment": "Participation in Christ is not simply a momentary event but requires continued fidelity. The close link between faith and endurance is foundational for salvation."
    },
    {
      "pk": 65003015,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 15,
      "text": "As it has been said: 'Today, if you hear his voice, do not harden your hearts as in the rebellion.'",
      "links": "<a href='/AIV/19/95/7-8'>Ps. 95:7-8</a>; <a href='/AIV/58/4/7'>Heb. 4:7</a>",
      "comment": "Repetition of the Psalm’s warning stresses its ongoing relevance and the importance of softening the heart to receive God's call daily."
    },
    {
      "pk": 65003016,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 16,
      "text": "For who were those who heard and rebelled? Were they not all who came out of Egypt, led by Moses?",
      "links": "<a href='/AIV/02/14/30-31'>Ex. 14:30-31</a>; <a href='/AIV/04/14/1-4'>Num. 14:1-4</a>",
      "comment": "The historical rebellion of Israel after the Exodus is cited as a warning. Privilege (deliverance) did not guarantee fidelity; ongoing trust is needed."
    },
    {
      "pk": 65003017,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 17,
      "text": "And with whom was he angry for forty years? Was it not those who sinned, whose bodies fell in the wilderness?",
      "links": "<a href='/AIV/04/14/29-32'>Num. 14:29-32</a>; <a href='/AIV/19/106/25-26'>Ps. 106:25-26</a>",
      "comment": "The judgment of the wilderness generation illustrates the consequence of persistent unbelief. Spiritual death can result from deliberate hardness of heart."
    },
    {
      "pk": 65003018,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 18,
      "text": "And to whom did he swear that they would not enter his rest, except to those who were disobedient?",
      "links": "<a href='/AIV/04/20/12'>Num. 20:12</a>; <a href='/AIV/58/4/6'>Heb. 4:6</a>",
      "comment": "The failure to enter rest is directly linked to disobedience. Entry into God’s promise requires both faith and obedient response."
    },
    {
      "pk": 65003019,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 3,
      "verse": 19,
      "text": "So we see that they were unable to enter because of unbelief.",
      "links": "<a href='/AIV/58/4/2'>Heb. 4:2</a>; <a href='/AIV/45/11/20'>Rom. 11:20</a>",
      "comment": "The summary stresses the danger of unbelief—not merely intellectual doubt, but a lack of trust expressed through reliance and obedience. Full participation in God’s promise requires a persevering faith, sacramental life, and communal encouragement."
    }
  ],
  "translatedAt": "2025-12-24T12:17:25.161Z"
}