{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 17,
  "verses": [
    {
      "pk": 2017001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 1,
      "text": "Then the entire congregation of the children of Israel set out from the Wilderness of Sin by stages, as the LORD commanded, and camped at Rephidim. But there was no water for the people to drink.",
      "links": "<a href='/AIV/2/15/22'>Exod. 15:22</a>; <a href='/AIV/4/33/12-14'>Num. 33:12-14</a>",
      "comment": "The Israelites journey according to God's command, reflecting divine guidance even in adversity. The people find themselves once again facing trial, highlighting humanity's dependence on God's provision. 'Stages' shows an ordered, communal pilgrimage."
    },
    {
      "pk": 2017002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 2,
      "text": "So the people quarreled with Moses and said, 'Give us water to drink.' And Moses said to them, 'Why do you quarrel with me? Why do you test the LORD?'",
      "links": "<a href='/AIV/2/16/2'>Exod. 16:2</a>; <a href='/AIV/2/17/7'>Exod. 17:7</a>; <a href='/AIV/19/78/18'>Ps. 78:18</a>",
      "comment": "The Israelites' demand reveals both their physical thirst and a spiritual lack of trust. Moses reminds them their complaint is not just with leadership, but a test of God himself—a theme found throughout Scripture."
    },
    {
      "pk": 2017003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 3,
      "text": "But the people were thirsty there for water, and the people grumbled against Moses and said, 'Why did you bring us up out of Egypt, to kill us and our children and our livestock with thirst?'",
      "links": "<a href='/AIV/2/14/11'>Exod. 14:11</a>; <a href='/AIV/2/16/3'>Exod. 16:3</a>",
      "comment": "The repetition of complaints shows persistent lack of faith. This pattern demonstrates the need for faith especially when trusting God through appointed leaders. Note the parallel to earlier grumblings."
    },
    {
      "pk": 2017004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 4,
      "text": "So Moses cried out to the LORD, saying, 'What shall I do with this people? They are almost ready to stone me!'",
      "links": "<a href='/AIV/4/14/10'>Num. 14:10</a>; <a href='/AIV/9/30/6'>1 Sam. 30:6</a>",
      "comment": "Moses turns to God, highlighting the role of intercession by the leader for his people—a motif for spiritual leadership and shepherding the flock. The tension reveals the seriousness of rebellion."
    },
    {
      "pk": 2017005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 5,
      "text": "And the LORD said to Moses, 'Pass before the people, and take with you some of the elders of Israel. And take in your hand the staff with which you struck the Nile, and go.'",
      "links": "<a href='/AIV/2/7/20'>Exod. 7:20</a>; <a href='/AIV/2/4/17'>Exod. 4:17</a>",
      "comment": "Elders as witnesses emphasizes authority and apostolic succession. The staff, a sign of God's power, recalls earlier miracles and anticipates God working through physical signs, prefiguring sacraments."
    },
    {
      "pk": 2017006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 6,
      "text": "Behold, I will stand before you there on the rock at Horeb, and you shall strike the rock, and water will come out of it, so that the people may drink.' Moses did so in the sight of the elders of Israel.",
      "links": "<a href='/AIV/19/78/15-16'>Ps. 78:15-16</a>; <a href='/AIV/54/10/4'>1 Cor. 10:4</a>",
      "comment": "God's presence on the rock and the water flowing forth is a profound image. In the New Testament, Christ is described as the spiritual Rock (1 Cor. 10:4) who gives living water (John 4:10-14; 7:37-39). The elders as witnesses signify authoritative tradition."
    },
    {
      "pk": 2017007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 7,
      "text": "He named the place Massah and Meribah, because of the quarreling of the children of Israel and because they tested the LORD by saying, 'Is the LORD among us or not?'",
      "links": "<a href='/AIV/5/6/16'>Deut. 6:16</a>; <a href='/AIV/19/95/8-9'>Ps. 95:8-9</a>",
      "comment": "'Massah' means 'testing' and 'Meribah' means 'quarreling.' This incident becomes a warning in later Scripture about the danger of doubting God's presence (Ps. 95:8-11, referenced in Heb. 3:7-19)."
    },
    {
      "pk": 2017008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 8,
      "text": "Then Amalek came and fought with Israel at Rephidim.",
      "links": "<a href='/AIV/5/25/17-18'>Deut. 25:17-18</a>; <a href='/AIV/9/15/2'>1 Sam. 15:2</a>",
      "comment": "Amalek is often seen as a symbol of opposition to God's people, representing continual struggles against evil. The context of spiritual and physical battle is important for the faithful."
    },
    {
      "pk": 2017009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 9,
      "text": "So Moses said to Joshua, 'Choose men for us and go out to fight with Amalek. Tomorrow I will stand on the top of the hill with the staff of God in my hand.'",
      "links": "<a href='/AIV/4/13/8'>Num. 13:8</a>; <a href='/AIV/2/4/20'>Exod. 4:20</a>",
      "comment": "This is the first mention of Joshua. Moses' position on the hill suggests spiritual leadership through both prayer and action—intercessory leadership is necessary for victory."
    },
    {
      "pk": 2017010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 10,
      "text": "So Joshua did as Moses told him and fought with Amalek, while Moses, Aaron, and Hur went up to the top of the hill.",
      "links": "<a href='/AIV/2/24/14'>Exod. 24:14</a>; <a href='/AIV/2/17/12'>Exod. 17:12</a>",
      "comment": "Moses is supported by Aaron and Hur, illustrating the importance of community and cooperation in leadership, and points to the need for a visible, enduring authority."
    },
    {
      "pk": 2017011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 11,
      "text": "Whenever Moses held up his hand, Israel prevailed; but whenever he let his hand down, Amalek prevailed.",
      "links": "<a href='/AIV/5/25/18'>Deut. 25:18</a>; <a href='/AIV/19/28/2'>Ps. 28:2</a>",
      "comment": "The victory depends upon Moses' actions of intercession, foreshadowing the power of prayer, and even liturgical gestures, for spiritual victory."
    },
    {
      "pk": 2017012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 12,
      "text": "But Moses’ hands grew heavy, so they took a stone and put it under him, and he sat on it. Aaron and Hur supported his hands, one on one side and the other on the other side. So his hands were steady until the sun went down.",
      "links": "<a href='/AIV/2/17/10'>Exod. 17:10</a>; <a href='/AIV/2/24/14'>Exod. 24:14</a>",
      "comment": "The support of Moses' hands by Aaron and Hur reveals a cooperative ministry and the need for assistance in leadership, reflecting an ordained, visible structure for the people’s benefit."
    },
    {
      "pk": 2017013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 13,
      "text": "And Joshua defeated Amalek and his people with the edge of the sword.",
      "links": "<a href='/AIV/9/15/7'>1 Sam. 15:7</a>; <a href='/AIV/6/10/12-13'>Josh. 10:12-13</a>",
      "comment": "Joshua’s victory conveys both God’s action through human agency and the reality that the spiritual and physical must work together. Joshua as a savior figure will be important in later typology."
    },
    {
      "pk": 2017014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 14,
      "text": "Then the LORD said to Moses, 'Write this as a memorial in a book, and recite it in the hearing of Joshua, that I will utterly blot out the memory of Amalek from under heaven.'",
      "links": "<a href='/AIV/5/25/19'>Deut. 25:19</a>; <a href='/AIV/9/15/3'>1 Sam. 15:3</a>",
      "comment": "God commands a written tradition for remembrance, anticipating the value of inspired Scripture and tradition being passed on through generations for teaching and remembrance."
    },
    {
      "pk": 2017015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 15,
      "text": "And Moses built an altar and called its name, 'The LORD is my Banner,'",
      "links": "<a href='/AIV/19/20/5'>Ps. 20:5</a>; <a href='/AIV/23/11/10-12'>Isa. 11:10-12</a>",
      "comment": "An altar is built in thanksgiving, with the name signifying the LORD as the rallying point for His people. The use of physical memorials anticipates later worship elements and ongoing commemorations."
    },
    {
      "pk": 2017016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 17,
      "verse": 16,
      "text": "saying, 'For hands were lifted up to the throne of the LORD; the LORD will have war with Amalek from generation to generation.'",
      "links": "<a href='/AIV/5/25/17-19'>Deut. 25:17-19</a>; <a href='/AIV/19/21/8-10'>Ps. 21:8-10</a>",
      "comment": "The lifting of hands signifies intercessory prayer and worship. Divine judgment against Amalek is ongoing, revealing both the reality of spiritual warfare and the necessity of persevering in faith, worship, and tradition."
    }
  ],
  "translatedAt": "2025-12-24T00:55:55.519Z"
}