{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 15,
  "verses": [
    {
      "pk": 2015001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 1,
      "text": "Then Moses and the sons of Israel sang this song to the LORD, and said: \"I will sing to the LORD, for He has triumphed gloriously; the horse and his rider He has thrown into the sea.\"",
      "links": "<a href='/AIV/19/118/14'>Ps. 118:14</a>; <a href='/AIV/23/12/1'>Isa. 12:1</a>",
      "comment": "This is the first recorded song in Scripture, marking an act of worship after deliverance. Throughout salvation history, song and liturgy accompany God's mighty works. The same structure of praise is later found in the worship of God among the redeemed in heaven (see Rev. 15:3)."
    },
    {
      "pk": 2015002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 2,
      "text": "The LORD is my strength and my song, and He has become my salvation; this is my God, and I will praise Him; my father's God, and I will exalt Him.",
      "links": "<a href='/AIV/19/118/14'>Ps. 118:14</a>; <a href='/AIV/23/12/2'>Isa. 12:2</a>",
      "comment": "Notice the personal relationship described—'my strength, my song, my salvation.' The continual use of repetition in Hebrew poetry underscores God's saving act as central for His people. The language anticipates the salvation to be fulfilled in Christ (see Luke 1:69; Acts 4:12)."
    },
    {
      "pk": 2015003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 3,
      "text": "The LORD is a warrior; the LORD is His name.",
      "links": "<a href='/AIV/19/24/8'>Ps. 24:8</a>; <a href='/AIV/2/3/14'>Exod. 3:14</a>",
      "comment": "God is portrayed as the mighty defender of His people. The title 'the LORD is His name' recalls God's revelation to Moses in the burning bush (Exod. 3:14), later interpreted as the One who delivers decisively."
    },
    {
      "pk": 2015004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 4,
      "text": "Pharaoh's chariots and his army He has cast into the sea, and his chosen officers are sunk in the Red Sea.",
      "links": "<a href='/AIV/2/14/28'>Exod. 14:28</a>",
      "comment": "The defeat of Egypt’s military was total and irreversible, signifying that God’s judgments are final. This prefigures the final defeat of evil (Rev. 19:20)."
    },
    {
      "pk": 2015005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 5,
      "text": "The depths cover them; they went down into the depths like a stone.",
      "links": "<a href='/AIV/19/69/2'>Ps. 69:2</a>",
      "comment": "The imagery of sinking like a stone adds to the sense of the finality of God’s deliverance. The waters that saved Israel drowned their enemies, a theme later fulfilled in the Sacrament of Baptism (Rom. 6:4), where death to the old life precedes resurrection to the new."
    },
    {
      "pk": 2015006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 6,
      "text": "Your right hand, O LORD, is glorious in power. Your right hand, O LORD, shatters the enemy.",
      "links": "<a href='/AIV/19/20/6'>Ps. 20:6</a>; <a href='/AIV/19/44/3'>Ps. 44:3</a>",
      "comment": "The right hand symbolizes divine power and authority. Scripturally, God's 'right hand' is associated with mighty acts and victory over evil. In the New Testament, Christ sits at the right hand of the Father (Mark 16:19), taking up this same authority."
    },
    {
      "pk": 2015007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 7,
      "text": "In the greatness of Your majesty You overthrow those who rise against You; You send forth Your wrath, it consumes them like stubble.",
      "links": "<a href='/AIV/19/78/49-50'>Ps. 78:49-50</a>",
      "comment": "The consuming fire of God’s judgment is a recurring theme, illustrating both justice and holiness (cf. Heb. 12:29). Those who oppose God’s plan are decisively defeated."
    },
    {
      "pk": 2015008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 8,
      "text": "With the blast of Your nostrils the waters piled up, the flowing waters stood up like a heap; the deeps congealed in the heart of the sea.",
      "links": "<a href='/AIV/2/14/21-22'>Exod. 14:21-22</a>",
      "comment": "The anthropomorphic language ('blast of Your nostrils') highlights God’s direct intervention. The miracle of the divided sea is a key event illustrating divine sovereignty over creation."
    },
    {
      "pk": 2015009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 9,
      "text": "\"The enemy said, 'I will pursue, I will overtake, I will divide the spoil; my desire shall have its fill of them. I will draw my sword, my hand shall destroy them.'\"",
      "links": "<a href='/AIV/2/14/5-9'>Exod. 14:5-9</a>",
      "comment": "This verse reveals human arrogance when opposing God. The enemy’s boasting is futile against the LORD’s power—a motif revisited repeatedly (Isa. 10:15)."
    },
    {
      "pk": 2015010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 10,
      "text": "You blew with Your wind, the sea covered them; they sank like lead in the mighty waters.",
      "links": "<a href='/AIV/2/14/28-29'>Exod. 14:28-29</a>",
      "comment": "Divine power is displayed through creation itself, serving God’s purpose. This echoes both God's control over the waters (Ps. 104:7) and prefigures the ultimate authority of Christ over the winds and sea (Mark 4:39)."
    },
    {
      "pk": 2015011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 11,
      "text": "Who is like You, O LORD, among the gods? Who is like You, majestic in holiness, awesome in glory, working wonders?",
      "links": "<a href='/AIV/19/86/8'>Ps. 86:8</a>; <a href='/AIV/19/77/14'>Ps. 77:14</a>",
      "comment": "This rhetorical question denies the existence or power of any rival god, emphasizing monotheism. The people's awe before God's wonders would later be echoed in Christian worship and the recognition of miracles."
    },
    {
      "pk": 2015012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 12,
      "text": "You stretched out Your right hand; the earth swallowed them.",
      "links": "<a href='/AIV/2/14/27-28'>Exod. 14:27-28</a>",
      "comment": "God’s direct action is likened to a king stretching forth his scepter. His saving deeds are both literal (as in this case) and become spiritual images for salvation—being delivered from sin and death (see Isa. 12:2)."
    },
    {
      "pk": 2015013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 13,
      "text": "In Your faithful love You have led the people whom You have redeemed; in Your strength You have guided them to Your holy dwelling.",
      "links": "<a href='/AIV/19/78/54'>Ps. 78:54</a>; <a href='/AIV/19/77/20'>Ps. 77:20</a>",
      "comment": "The phrase 'redeemed' points toward a sacrificial deliverance—a motif fulfilled in the perfect redemption through Christ (Eph. 1:7). God’s 'holy dwelling' looks ahead to both the tabernacle and the heavenly sanctuary (Heb. 9:24)."
    },
    {
      "pk": 2015014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 14,
      "text": "The peoples heard; they trembled; anguish has seized the inhabitants of Philistia.",
      "links": "<a href='/AIV/6/2/10-11'>Josh. 2:10-11</a>",
      "comment": "The miraculous deliverance makes the nations fear Israel’s God—anticipating the universal recognition of the LORD’s power (see Rev. 15:4)."
    },
    {
      "pk": 2015015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 15,
      "text": "Then the chiefs of Edom were dismayed; trembling seized the leaders of Moab; all the inhabitants of Canaan have melted away.",
      "links": "<a href='/AIV/2/23/27-28'>Exod. 23:27-28</a>",
      "comment": "The impact of God’s actions extends beyond Israel—He is Lord over the nations. The phrase 'melted away' shows the effect of God’s miraculous deliverance on the psychological warfare of surrounding peoples."
    },
    {
      "pk": 2015016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 16,
      "text": "Terror and dread fall upon them; by the greatness of Your arm they are as still as a stone, till Your people, O LORD, pass by, till the people whom You have purchased pass by.",
      "links": "<a href='/AIV/19/74/2'>Ps. 74:2</a>; <a href='/AIV/23/43/1'>Isa. 43:1</a>",
      "comment": "The concept of being 'purchased' or redeemed appears again, emphasizing ownership and covenant relationship (see 1 Cor. 6:20). The deliverance language hints at the ultimate spiritual reality where God leads His people into the Promised Land of heaven."
    },
    {
      "pk": 2015017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 17,
      "text": "You shall bring them in and plant them on the mountain of Your inheritance, the place, O LORD, which You have made for Your dwelling, the sanctuary, O LORD, which Your hands have established.",
      "links": "<a href='/AIV/19/78/54'>Ps. 78:54</a>; <a href='/AIV/19/132/13-14'>Ps. 132:13-14</a>",
      "comment": "This prophecy looks forward to Mount Zion and eventually to the everlasting sanctuary. The language of 'planting' and 'sanctuary' is later used in the New Testament to describe the church as God’s temple (1 Pet. 2:5), making the physical sanctuary a sign of a greater reality."
    },
    {
      "pk": 2015018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 18,
      "text": "The LORD will reign forever and ever.",
      "links": "<a href='/AIV/19/146/10'>Ps. 146:10</a>; <a href='/AIV/66/11/15'>Rev. 11:15</a>",
      "comment": "God’s kingship is eternal, foreshadowing the everlasting reign of the Messiah. The language is echoed powerfully in the Book of Revelation (Rev. 11:15), uniting Old and New Testament visions of God’s reign."
    },
    {
      "pk": 2015019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 19,
      "text": "For when the horses of Pharaoh with his chariots and his horsemen went into the sea, the LORD brought back the waters of the sea upon them, but the sons of Israel walked on dry ground through the midst of the sea.",
      "links": "<a href='/AIV/2/14/22-28'>Exod. 14:22-28</a>",
      "comment": "This verse restates the central miracle, emphasizing the contrast between judgment of the oppressors and salvation for God’s people. The motif comes up later in Christian baptismal typology."
    },
    {
      "pk": 2015020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 20,
      "text": "Then Miriam the prophetess, the sister of Aaron, took a tambourine in her hand; and all the women went out after her with tambourines and with dancing.",
      "links": "<a href='/AIV/7/11/34'>Judg. 11:34</a>; <a href='/AIV/19/68/25'>Ps. 68:25</a>",
      "comment": "Miriam’s leadership of women in liturgical praise highlights the participatory nature of worship. This sets a pattern for the communal worship of God amongst His people, involving both genders in praise."
    },
    {
      "pk": 2015021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 21,
      "text": "Miriam sang to them: \"Sing to the LORD, for He has triumphed gloriously; the horse and his rider He has thrown into the sea.\"",
      "links": "<a href='/AIV/2/15/1'>Exod. 15:1</a>",
      "comment": "Miriam’s echoing of Moses’ song forms a refrain, typical of Hebrew poetry and communal worship. Her role here anticipates prominent female participation in the faith community (see Luke 1:46-55)."
    },
    {
      "pk": 2015022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 22,
      "text": "Then Moses made Israel set out from the Red Sea, and they went into the wilderness of Shur. They went three days in the wilderness and found no water.",
      "links": "<a href='/AIV/4/33/8'>Num. 33:8</a>",
      "comment": "After deliverance comes a time of testing. The journey through the wilderness is a recurring theme of spiritual purification (see Deut. 8:2; Matt. 4:1). The detail of 'three days' anticipates later patterns (Jonah, Christ's resurrection on the third day)."
    },
    {
      "pk": 2015023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 23,
      "text": "When they came to Marah, they could not drink the water of Marah, for it was bitter; therefore it was named Marah.",
      "links": "<a href='/AIV/8/1/20'>Ruth 1:20</a>; <a href='/AIV/19/81/7'>Ps. 81:7</a>",
      "comment": "Marah means 'bitter.' Periods of difficulty often follow experiences of triumph, testing the faith of God’s people. These times prefigure the suffering and purification that accompany following Christ."
    },
    {
      "pk": 2015024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 24,
      "text": "And the people grumbled against Moses, saying, \"What shall we drink?\"",
      "links": "<a href='/AIV/2/14/11'>Exod. 14:11</a>; <a href='/AIV/4/20/2'>Num. 20:2</a>",
      "comment": "Complaints against God’s chosen leader reflect the ongoing struggle with faith in adversity. This motif highlights the need for obedience to God’s appointed leaders, a theme that runs throughout the Scriptures."
    },
    {
      "pk": 2015025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 25,
      "text": "And he cried to the LORD, and the LORD showed him a tree, and he threw it into the waters, and the waters became sweet. There the LORD made for them a statute and a rule, and there He tested them,",
      "links": "<a href='/AIV/2/16/4'>Exod. 16:4</a>; <a href='/AIV/2/24/3'>Exod. 24:3</a>",
      "comment": "God’s intervention through the tree prefigures the power of the cross to transform suffering into blessing. The giving of statutes and testing mirrors the process by which faith grows through obedience to divine law."
    },
    {
      "pk": 2015026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 26,
      "text": "saying, \"If you will diligently listen to the voice of the LORD your God, and do what is right in His eyes, and give ear to His commandments and keep all His statutes, I will put none of the diseases on you that I put on the Egyptians; for I am the LORD, your healer.\"",
      "links": "<a href='/AIV/5/28/60'>Deut. 28:60</a>; <a href='/AIV/19/103/3'>Ps. 103:3</a>",
      "comment": "Obedience brings blessing and protection, while disobedience invites judgment. God reveals Himself as healer, a title fulfilled ultimately in Christ, who heals both body and soul (Matt. 8:17; 1 Pet. 2:24)."
    },
    {
      "pk": 2015027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 15,
      "verse": 27,
      "text": "Then they came to Elim, where there were twelve springs of water and seventy palm trees, and they encamped there by the water.",
      "links": "<a href='/AIV/4/33/9'>Num. 33:9</a>",
      "comment": "The numbers twelve and seventy echo the structure of Israel and later, Christ’s appointment of the twelve apostles and the sending of the seventy (Luke 9:1; 10:1). The oasis at Elim points to the refreshment God gives through ordered, divinely guided community."
    }
  ],
  "translatedAt": "2025-12-24T00:54:42.585Z"
}