{
  "book": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 13,
  "verses": [
    {
      "pk": 19401301,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 1,
      "text": "The LORD spoke to Moses, saying,",
      "links": "<a href='/AIV/3/27/26'>Lev. 27:26</a>; <a href='/AIV/4/3/13'>Num. 3:13</a>",
      "comment": "The phrase 'The LORD spoke to Moses' is repeated frequently and indicates direct speech from God."
    },
    {
      "pk": 19401302,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 2,
      "text": "\"Set apart to me all the firstborn. Whatever opens the womb among the Israelites, both of man and animal, is mine.\"",
      "links": "<a href='/AIV/4/18/15'>Num. 18:15</a>; <a href='/AIV/5/15/19'>Deut. 15:19</a>",
      "comment": "The phrase 'opens the womb' literally refers to the first offspring born."
    },
    {
      "pk": 19401303,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 3,
      "text": "And Moses said to the people, \"Remember this day, when you came out of Egypt, out of the house of slavery, for by a strong hand the LORD brought you out from there. No leavened bread shall be eaten.\"",
      "links": "<a href='/AIV/2/12/14-17'>Exod. 12:14-17</a>",
      "comment": "\"House of slavery\" is a literal translation; 'leavened bread' (yeast bread) is forbidden during Passover."
    },
    {
      "pk": 19401304,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 4,
      "text": "\"Today, in the month of Abib, you are leaving.\"",
      "links": "<a href='/AIV/2/12/2'>Exod. 12:2</a>",
      "comment": "Abib is the original month name, later called Nisan; retained here for accuracy."
    },
    {
      "pk": 19401305,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 5,
      "text": "\"When the LORD brings you into the land of the Canaanites, the Hittites, the Amorites, the Hivites, and the Jebusites, which he swore to your fathers to give you—a land flowing with milk and honey—you shall keep this service in this month.\"",
      "links": "<a href='/AIV/2/3/8'>Exod. 3:8</a>; <a href='/AIV/2/33/3'>Exod. 33:3</a>",
      "comment": "The names of peoples are rendered as in the Hebrew; 'service' here refers to the Passover observance."
    },
    {
      "pk": 19401306,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 6,
      "text": "\"For seven days you shall eat unleavened bread, and on the seventh day there shall be a feast to the LORD.\"",
      "links": "<a href='/AIV/2/12/15'>Exod. 12:15</a>",
      "comment": "The number and sequence of days matches Hebrew ritual instructions."
    },
    {
      "pk": 19401307,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 7,
      "text": "\"Unleavened bread shall be eaten for seven days; no leavened bread shall be seen with you, nor shall any leaven be seen in all your territory.\"",
      "links": "<a href='/AIV/2/12/19'>Exod. 12:19</a>",
      "comment": "Emphasis on complete removal of leaven, as in the Hebrew."
    },
    {
      "pk": 19401308,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 8,
      "text": "\"You shall tell your son on that day, 'It is because of what the LORD did for me when I came out of Egypt.'\"",
      "links": "<a href='/AIV/2/12/26-27'>Exod. 12:26-27</a>",
      "comment": "Direct instruction to pass down remembrance to the next generation."
    },
    {
      "pk": 19401309,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 9,
      "text": "\"And it shall be for a sign to you on your hand, and for a reminder between your eyes, that the law of the LORD may be in your mouth. For with a strong hand the LORD brought you out of Egypt.\"",
      "links": "<a href='/AIV/5/6/8'>Deut. 6:8</a>",
      "comment": "\"Sign on your hand\" and \"reminder between your eyes\" are literal renderings; these later became tefillin in Jewish practice."
    },
    {
      "pk": 19401310,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 10,
      "text": "\"You shall keep this ordinance at its appointed time from year to year.\"",
      "links": "<a href='/AIV/2/12/24'>Exod. 12:24</a>",
      "comment": "Annual repetition of Passover instructions is emphasized."
    },
    {
      "pk": 19401311,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 11,
      "text": "\"When the LORD brings you into the land of the Canaanites, as he swore to you and your fathers, and gives it to you,\"",
      "links": "<a href='/AIV/1/15/18'>Gen. 15:18</a>; <a href='/AIV/2/3/17'>Exod. 3:17</a>",
      "comment": "Promise of entering the land reaffirms covenant with Abraham."
    },
    {
      "pk": 19401312,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 12,
      "text": "\"then you shall set apart to the LORD all that first opens the womb. Every firstborn of your animals that are males shall be the LORD's.\"",
      "links": "<a href='/AIV/4/18/15'>Num. 18:15</a>",
      "comment": "Firstborn males, both human and animal, are devoted to God."
    },
    {
      "pk": 19401313,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 13,
      "text": "\"Every firstborn of a donkey you shall redeem with a lamb, and if you do not redeem it, you shall break its neck. Every firstborn of man among your sons you shall redeem.\"",
      "links": "<a href='/AIV/4/3/46-47'>Num. 3:46-47</a>; <a href='/AIV/4/18/15-16'>Num. 18:15-16</a>",
      "comment": "The law of redemption for firstborn donkeys and sons; physical act (breaking neck) is literal from Hebrew."
    },
    {
      "pk": 19401314,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 14,
      "text": "\"And when in time your son asks you, 'What does this mean?' you shall say to him, 'By a strong hand the LORD brought us out of Egypt, out of the house of slavery.'\"",
      "links": "<a href='/AIV/2/12/26'>Exod. 12:26</a>; <a href='/AIV/5/6/20'>Deut. 6:20</a>",
      "comment": "Emphasis on passing on meaning of rituals to next generation."
    },
    {
      "pk": 19401315,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 15,
      "text": "\"For when Pharaoh stubbornly refused to let us go, the LORD killed all the firstborn in the land of Egypt, both the firstborn of man and the firstborn of animals. Therefore I sacrifice to the LORD all males that first open the womb, but all the firstborn of my sons I redeem.\"",
      "links": "<a href='/AIV/2/12/29'>Exod. 12:29</a>; <a href='/AIV/4/18/15'>Num. 18:15</a>",
      "comment": "Connects the ritual to the tenth plague and the need for redemption."
    },
    {
      "pk": 19401316,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 16,
      "text": "\"It shall be as a sign on your hand and as a frontlet between your eyes, for by a strong hand the LORD brought us out of Egypt.\"",
      "links": "<a href='/AIV/2/13/9'>Exod. 13:9</a>; <a href='/AIV/5/6/8'>Deut. 6:8</a>",
      "comment": "Repetition of v. 9; 'frontlet' is a literal and traditional word for Hebrew 'totafot'."
    },
    {
      "pk": 19401317,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 17,
      "text": "When Pharaoh let the people go, God did not lead them by way of the land of the Philistines, though that way was near. For God said, \"Lest the people change their minds when they see war and return to Egypt.\"",
      "links": "<a href='/AIV/2/14/11-12'>Exod. 14:11-12</a>",
      "comment": "God's concern for the people's fear; 'land of the Philistines' refers to the coastal route."
    },
    {
      "pk": 19401318,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 18,
      "text": "But God led the people around by the way of the wilderness toward the Red Sea. The Israelites went up out of the land of Egypt prepared for battle.",
      "links": "<a href='/AIV/2/14/2'>Exod. 14:2</a>; <a href='/AIV/2/14/27'>Exod. 14:27</a>",
      "comment": "Literally 'Sea of Reeds' ('Yam Suph'); 'prepared for battle'—traditional translation of Hebrew 'chamushim'."
    },
    {
      "pk": 19401319,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 19,
      "text": "And Moses took the bones of Joseph with him, for Joseph had made the Israelites solemnly swear, saying, \"God will surely visit you, and you shall carry up my bones with you from here.\"",
      "links": "<a href='/AIV/1/50/25'>Gen. 50:25</a>; <a href='/AIV/6/24/32'>Josh. 24:32</a>",
      "comment": "Joseph’s request is a fulfillment of Genesis 50:25; 'God will surely visit you' is a literal rendering."
    },
    {
      "pk": 19401320,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 20,
      "text": "And they set out from Succoth and camped at Etham, at the edge of the wilderness.",
      "links": "<a href='/AIV/2/12/37'>Exod. 12:37</a>; <a href='/AIV/4/33/6'>Num. 33:6</a>",
      "comment": "Locations retained as Hebrew; no interpretive geographic comments added."
    },
    {
      "pk": 19401321,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 21,
      "text": "And the LORD went before them by day in a pillar of cloud to lead them along the way, and by night in a pillar of fire to give them light, so that they could travel by day and by night.",
      "links": "<a href='/AIV/2/14/19-20'>Exod. 14:19-20</a>; <a href='/AIV/2/40/36-38'>Exod. 40:36-38</a>",
      "comment": "Literal rendering of signs; explanation of their purpose retained."
    },
    {
      "pk": 19401322,
      "translation": "AIV",
      "book": 2,
      "chapter": 13,
      "verse": 22,
      "text": "He did not remove the pillar of cloud by day nor the pillar of fire by night from before the people.",
      "links": "<a href='/AIV/2/40/38'>Exod. 40:38</a>",
      "comment": "Both pillars remained with Israel continually as described in the text."
    }
  ],
  "translatedAt": "2025-12-20T08:38:15.258Z"
}