{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 10,
  "verses": [
    {
      "pk": 2010001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 1,
      "text": "Then the Lord said to Moses, ‘Go to Pharaoh, for I have hardened his heart and the heart of his servants, so that I may show these signs of mine among them,’",
      "links": "<a href='/AIV/2/4/21'>Exod. 4:21</a>; <a href='/AIV/2/7/3'>Exod. 7:3</a>",
      "comment": "God’s sovereignty over Pharaoh’s heart is demonstrated here. This is a recurring theme: the hardness of heart is permitted for a greater revelation of God’s power. Compare with Romans 9:17-18, where Paul draws on this passage to discuss God’s freedom in mercy and judgment."
    },
    {
      "pk": 2010002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 2,
      "text": "‘and so that you may tell your children and grandchildren how I dealt harshly with the Egyptians and performed my signs among them, so that you may know that I am the Lord.’",
      "links": "<a href='/AIV/5/6/20-21'>Deut. 6:20-21</a>; <a href='/AIV/19/78/4-7'>Ps. 78:4-7</a>",
      "comment": "The command to remember and teach God’s works establishes the importance of sacred tradition in faith. Passing down the works of God is not merely individual, but communal, and includes telling the story within the family. Spiritual formation begins in the home."
    },
    {
      "pk": 2010003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 3,
      "text": "So Moses and Aaron went to Pharaoh, and said to him, ‘Thus says the Lord, the God of the Hebrews: How long will you refuse to humble yourself before me? Let my people go, so that they may serve me.’",
      "links": "<a href='/AIV/2/5/1'>Exod. 5:1</a>; <a href='/AIV/2/9/17'>Exod. 9:17</a>",
      "comment": "Humility before God is portrayed as necessary for liberation and worship. Serving God is the end goal of deliverance, seen fulfilled in Christ calling people to worship 'in spirit and truth' (John 4:23)."
    },
    {
      "pk": 2010004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 4,
      "text": "‘If you refuse to let my people go, behold, tomorrow I will bring locusts into your country.’",
      "links": "<a href='/AIV/2/7/14-18'>Exod. 7:14-18</a>; <a href='/AIV/29/1/4'>Joel 1:4</a>",
      "comment": "The warning of locusts illustrates God’s control over nature, reminiscent of prophetic warnings later in Scripture. The use of plagues as judgment appears in Revelation 9:3-4."
    },
    {
      "pk": 2010005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 5,
      "text": "‘They shall cover the face of the land, so that no one can see the ground. They shall devour what is left to you after the hail, and eat every tree of yours that grows in the field.’",
      "links": "<a href='/AIV/20/30/27'>Prov. 30:27</a>; <a href='/AIV/29/2/3'>Joel 2:3</a>",
      "comment": "The devastation to the land is total, showing the seriousness of ignoring God's commands. This has echoes in the prophecy about the end times where the earth suffers (cf. Revelation 8:7)."
    },
    {
      "pk": 2010006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 6,
      "text": "‘And your houses shall be filled, and the houses of all your servants, and of all the Egyptians, as neither your fathers nor your grandfathers have seen, from the day they came on the earth until this day.’ Then he turned and went out from Pharaoh.",
      "links": "<a href='/AIV/19/105/30'>Ps. 105:30</a>; <a href='/AIV/2/7/24'>Exod. 7:24</a>",
      "comment": "The punishment is said to surpass anything in Egyptian memory, emphasizing both justice and an historical marker for Israel’s recollection. In spiritual interpretation, this prefigures judgment on those who persistently reject God’s will."
    },
    {
      "pk": 2010007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 7,
      "text": "Pharaoh’s servants said to him, ‘How long shall this man be a snare to us? Let the men go, so that they may serve the Lord their God. Do you not yet understand that Egypt is ruined?’",
      "links": "<a href='/AIV/2/7/23'>Exod. 7:23</a>; <a href='/AIV/2/8/19'>Exod. 8:19</a>",
      "comment": "Even the officials urge Pharaoh to give in, realizing the consequences of resisting God. This demonstrates how sin blinds even leaders to reality; wisdom (sometimes through counsel) calls us to obedience."
    },
    {
      "pk": 2010008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 8,
      "text": "So Moses and Aaron were brought back to Pharaoh, and he said to them, ‘Go, serve the Lord your God. But who are those that shall go?’",
      "links": "<a href='/AIV/2/5/1'>Exod. 5:1</a>; <a href='/AIV/2/12/31'>Exod. 12:31</a>",
      "comment": "Pharaoh appears willing to bargain, but his heart is still resistant. Note how leadership negotiates about the scope of worship—a theme seen in later biblical discussions on worship and the people’s participation."
    },
    {
      "pk": 2010009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 9,
      "text": "And Moses said, ‘We will go with our young and old, with our sons and daughters, and with our flocks and herds, for we must hold a feast to the Lord.’",
      "links": "<a href='/AIV/2/12/24'>Exod. 12:24</a>; <a href='/AIV/19/66/1-4'>Ps. 66:1-4</a>",
      "comment": "Moses insists all must participate in worship. This echoes the inclusive nature of assembly and communal feasts before God, tying into the theology of liturgical celebration and the importance that all—from the greatest to the least—join in worship."
    },
    {
      "pk": 2010010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 10,
      "text": "He said to them, ‘The Lord be with you, if ever I let you and your little ones go! See, you have some evil purpose in mind.’",
      "links": "<a href='/AIV/2/8/28'>Exod. 8:28</a>; <a href='/AIV/2/12/31'>Exod. 12:31</a>",
      "comment": "Pharaoh’s suspicion comes from his hardened heart. Sometimes, the refusal to accept God’s demands is grounded in fear and mistrust."
    },
    {
      "pk": 2010011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 11,
      "text": "‘No! Only the men may go and serve the Lord, since that is what you were asking.’ Then they were driven out from Pharaoh’s presence.",
      "links": "<a href='/AIV/2/8/25'>Exod. 8:25</a>; <a href='/AIV/2/12/31'>Exod. 12:31</a>",
      "comment": "Pharaoh attempts to restrict worship, keeping control. Worship is meant for everyone—not just for a select few—revealed in later Christian teaching on full participation in the community."
    },
    {
      "pk": 2010012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 12,
      "text": "Then the Lord said to Moses, ‘Stretch out your hand over the land of Egypt for the locusts, that they may come upon the land and eat every plant of the land, all that the hail has left.’",
      "links": "<a href='/AIV/2/9/22'>Exod. 9:22</a>; <a href='/AIV/19/78/46'>Ps. 78:46</a>",
      "comment": "The action of Moses prefigures the role of the mediator between God and people—a divine authority delegated to appointed leaders."
    },
    {
      "pk": 2010013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 13,
      "text": "So Moses stretched out his staff over the land of Egypt, and the Lord brought an east wind upon the land all that day and all that night. And in the morning the east wind had brought the locusts.",
      "links": "<a href='/AIV/19/105/34'>Ps. 105:34</a>; <a href='/AIV/2/14/21'>Exod. 14:21</a>",
      "comment": "The east wind appears as an agent of God’s judgment; recurring motif in Exodus. This power over the elements finds fulfillment in Jesus’ authority over nature (Mark 4:39)."
    },
    {
      "pk": 2010014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 14,
      "text": "The locusts came up over all the land of Egypt and settled in every part of the country, so dense that there had never been such locusts before, nor ever will be again.",
      "links": "<a href='/AIV/29/2/2'>Joel 2:2</a>; <a href='/AIV/19/78/46'>Ps. 78:46</a>",
      "comment": "Unique judgment—God’s justice is both specific and unmatched. This foreshadows final judgments that are unparalleled (cf. Matthew 24:21)."
    },
    {
      "pk": 2010015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 15,
      "text": "For they covered the whole face of the land, so that the land was darkened. They ate all the plants of the land and all the fruit of the trees that the hail had left. Not a green thing remained, neither tree nor plant of the field, throughout all the land of Egypt.",
      "links": "<a href='/AIV/19/105/34-35'>Ps. 105:34-35</a>; <a href='/AIV/2/9/25'>Exod. 9:25</a>",
      "comment": "The complete devastation is a sign of God’s total authority. The darkness and destruction recall spiritual darkness without God (cf. John 1:5)."
    },
    {
      "pk": 2010016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 16,
      "text": "Then Pharaoh quickly called Moses and Aaron and said, ‘I have sinned against the Lord your God and against you.’",
      "links": "<a href='/AIV/2/9/27'>Exod. 9:27</a>; <a href='/AIV/19/51/4'>Ps. 51:4</a>",
      "comment": "Pharaoh's confession is noteworthy, though it lacks true repentance. True confession is an essential part of restoration, later fulfilled in the sacrament of reconciliation instituted by Christ for the body of believers (cf. John 20:22-23)."
    },
    {
      "pk": 2010017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 17,
      "text": "‘Now, please forgive my sin just this once, and plead with the Lord your God to take away this death from me.’",
      "links": "<a href='/AIV/19/130/3-4'>Ps. 130:3-4</a>; <a href='/AIV/2/32/32'>Exod. 32:32</a>",
      "comment": "Pharaoh asks for intercession—a pattern later of believers seeking prayer and mediation for forgiveness, established in the practice of confessing sins and seeking grace through the ministry of appointed leaders."
    },
    {
      "pk": 2010018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 18,
      "text": "So he went out from Pharaoh and prayed to the Lord.",
      "links": "<a href='/AIV/2/8/12'>Exod. 8:12</a>; <a href='/AIV/19/106/23'>Ps. 106:23</a>",
      "comment": "Moses acts as the intercessor. This anticipates the role of Christ as the great High Priest who intercedes for His people (Hebrews 7:25), and prefigures the ongoing ministry of the Church’s appointed leaders."
    },
    {
      "pk": 2010019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 19,
      "text": "And the Lord turned the wind into a very strong west wind, which lifted the locusts and drove them into the Red Sea. Not a single locust remained in all the land of Egypt.",
      "links": "<a href='/AIV/2/14/21-28'>Exod. 14:21-28</a>; <a href='/AIV/19/105/35'>Ps. 105:35</a>",
      "comment": "Divine reversal—God’s mercy in answering the mediator’s prayer. This foreshadows deliverance that comes through intercession and intervention."
    },
    {
      "pk": 2010020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 20,
      "text": "But the Lord hardened Pharaoh's heart, and he did not let the children of Israel go.",
      "links": "<a href='/AIV/2/9/12'>Exod. 9:12</a>; <a href='/AIV/45/9/18'>Rom. 9:18</a>",
      "comment": "The hardness of heart is reaffirmed, showing human resistance contrasted against God’s sovereignty and mercy. This theme of stubbornness runs throughout human history, but God patiently offers many chances for repentance."
    },
    {
      "pk": 2010021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 21,
      "text": "Then the Lord said to Moses, ‘Stretch out your hand toward heaven, so that there may be darkness over the land of Egypt, a darkness that can be felt.’",
      "links": "<a href='/AIV/19/105/28'>Ps. 105:28</a>; <a href='/AIV/23/60/2'>Isa. 60:2</a>",
      "comment": "The darkness signifies both physical and spiritual blindness. In messianic interpretation, darkness is dispelled when Christ—the light of the world—comes (John 8:12)."
    },
    {
      "pk": 2010022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 22,
      "text": "So Moses stretched out his hand toward heaven, and there was thick darkness in all the land of Egypt for three days.",
      "links": "<a href='/AIV/19/105/28'>Ps. 105:28</a>; <a href='/AIV/40/27/45'>Matt. 27:45</a>",
      "comment": "Three days of darkness—symbolic of judgment and of Christ’s death, when darkness covered the land for three hours (Matthew 27:45)."
    },
    {
      "pk": 2010023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 23,
      "text": "They did not see one another, nor did anyone rise from his place for three days, but all the Israelites had light where they lived.",
      "links": "<a href='/AIV/19/27/1'>Ps. 27:1</a>; <a href='/AIV/40/5/14'>Matt. 5:14</a>",
      "comment": "Separation between Egyptians and Israelites—God’s people dwell in light. This distinction sets apart the people for a special mission, foreshadowing the holiness and unity essential for the body of believers."
    },
    {
      "pk": 2010024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 24,
      "text": "Then Pharaoh called Moses and said, ‘Go, serve the Lord; your little ones also may go with you. Only let your flocks and your herds remain behind.’",
      "links": "<a href='/AIV/2/8/28'>Exod. 8:28</a>; <a href='/AIV/2/12/31'>Exod. 12:31</a>",
      "comment": "Pharaoh tries to negotiate, restricting resources for worship. True worship demands the full offering—echoing sacrificial language found throughout Scripture."
    },
    {
      "pk": 2010025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 25,
      "text": "But Moses said, ‘You must also let us have sacrifices and burnt offerings, so that we may offer them to the Lord our God.’",
      "links": "<a href='/AIV/2/3/18'>Exod. 3:18</a>; <a href='/AIV/2/29/18'>Exod. 29:18</a>",
      "comment": "The necessity of sacrifice is emphasized. Sacrificial worship is foundational and later fulfilled most perfectly in Christ's ultimate sacrifice, which believers unite with in a perpetual memorial."
    },
    {
      "pk": 2010026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 26,
      "text": "‘Our livestock must also go with us; not a hoof shall be left behind. For we must take them to serve the Lord our God, and we do not know with what we must serve the Lord until we arrive there.’",
      "links": "<a href='/AIV/2/12/38'>Exod. 12:38</a>; <a href='/AIV/19/50/14'>Ps. 50:14</a>",
      "comment": "The complete readiness to respond to God—holding nothing back for worship—establishes total commitment, a principle realized in the fullness of Christian discipleship."
    },
    {
      "pk": 2010027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 27,
      "text": "But the Lord hardened Pharaoh’s heart, and he would not let them go.",
      "links": "<a href='/AIV/2/4/21'>Exod. 4:21</a>; <a href='/AIV/45/9/17-18'>Rom. 9:17-18</a>",
      "comment": "Reiteration of God’s sovereign judgment—human pride prevents reconciliation with God, requiring divine initiative for salvation."
    },
    {
      "pk": 2010028,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 28,
      "text": "Pharaoh said to him, ‘Get away from me; take care never to see my face again, for on the day you see my face, you will die.’",
      "links": "<a href='/AIV/2/7/15'>Exod. 7:15</a>; <a href='/AIV/2/11/8'>Exod. 11:8</a>",
      "comment": "Pharaoh’s anger marks the final break. This foreshadows the judicial hardening of hearts and the distinct roles given to God’s appointed messengers in confronting the world."
    },
    {
      "pk": 2010029,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 10,
      "verse": 29,
      "text": "Moses said, ‘As you say! I will not see your face again.’",
      "links": "<a href='/AIV/2/11/8'>Exod. 11:8</a>; <a href='/AIV/2/12/31'>Exod. 12:31</a>",
      "comment": "This passage closes the cycle of confrontations. God’s messenger delivers his full warning and judgment, reiterating the need for faithful obedience and trust in the promises and mediators appointed by the Lord."
    }
  ],
  "translatedAt": "2025-12-24T00:51:53.731Z"
}