{
  "book": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 3,
  "verses": [
    {
      "pk": 2003001,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 1,
      "text": "Now Moses was shepherding the flock of Jethro, his father-in-law, the priest of Midian. And he led the flock to the far side of the wilderness and came to the mountain of God, Horeb.",
      "links": "<a href='/AIV/2/18/1'>Ex. 18:1</a>; <a href='/AIV/11/19/8'>1 Kgs. 19:8</a>",
      "comment": "Horeb and Sinai are often considered the same mountain."
    },
    {
      "pk": 2003002,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 2,
      "text": "And the Angel of the LORD appeared to him in a flame of fire out of the midst of a bush. Moses looked, and saw that the bush was burning with fire, but the bush was not consumed.",
      "links": "<a href='/AIV/7/6/12'>Judg. 6:12</a>; <a href='/AIV/44/7/30'>Acts 7:30</a>",
      "comment": "\"Angel of the LORD\" often understood as a visible manifestation of God in the Old Testament."
    },
    {
      "pk": 2003003,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 3,
      "text": "Then Moses said, \"I will turn aside and see this great sight, why the bush is not burned up.\"",
      "links": "<a href='/AIV/44/7/31'>Acts 7:31</a>",
      "comment": "No significant difference from the original text."
    },
    {
      "pk": 2003004,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 4,
      "text": "When the LORD saw that he had turned aside to look, God called to him out of the midst of the bush, saying, \"Moses, Moses!\" And he said, \"Here I am.\"",
      "links": "<a href='/AIV/1/22/11'>Gen. 22:11</a>",
      "comment": "\"Here I am\" reflects readiness in response to God."
    },
    {
      "pk": 2003005,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 5,
      "text": "Then he said, \"Do not come near. Take off your sandals from your feet, for the place where you are standing is holy ground.\"",
      "links": "<a href='/AIV/6/5/15'>Josh. 5:15</a>",
      "comment": "Modern English retains \"sandals\" for accuracy."
    },
    {
      "pk": 2003006,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 6,
      "text": "And he said, \"I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.\" And Moses hid his face, for he was afraid to look at God.",
      "links": "<a href='/AIV/1/26/24'>Gen. 26:24</a>; <a href='/AIV/40/22/32'>Matt. 22:32</a>",
      "comment": "Plural 'fathers' in some manuscripts, but singular retained here for clarity."
    },
    {
      "pk": 2003007,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 7,
      "text": "Then the LORD said, \"I have surely seen the oppression of my people who are in Egypt, and have heard their cry because of their taskmasters; for I know their sufferings.\"",
      "links": "<a href='/AIV/2/2/23-25'>Ex. 2:23–25</a>",
      "comment": "No significant change; \"taskmasters\" kept as in original."
    },
    {
      "pk": 2003008,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 8,
      "text": "\"So I have come down to deliver them out of the hand of the Egyptians and to bring them up out of that land to a good and broad land, a land flowing with milk and honey, to the place of the Canaanites, the Hittites, the Amorites, the Perizzites, the Hivites, and the Jebusites.\"",
      "links": "<a href='/AIV/2/13/5'>Ex. 13:5</a>; <a href='/AIV/2/33/3'>Ex. 33:3</a>",
      "comment": "\"Milk and honey\" kept as a Hebrew idiom meaning abundance."
    },
    {
      "pk": 2003009,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 9,
      "text": "\"And now, behold, the cry of the children of Israel has come to me, and I have seen the oppression with which the Egyptians are oppressing them.\"",
      "links": "<a href='/AIV/2/2/23'>Ex. 2:23</a>",
      "comment": "Repetition in Hebrew emphasized here."
    },
    {
      "pk": 2003010,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 10,
      "text": "\"Come now, therefore, and I will send you to Pharaoh, that you may bring my people, the children of Israel, out of Egypt.\"",
      "links": "<a href='/AIV/2/6/13'>Ex. 6:13</a>",
      "comment": "Direct speech kept intact."
    },
    {
      "pk": 2003011,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 11,
      "text": "But Moses said to God, \"Who am I that I should go to Pharaoh and that I should bring the children of Israel out of Egypt?\"",
      "links": "<a href='/AIV/2/4/10'>Ex. 4:10</a>",
      "comment": "Moses' humility reflected."
    },
    {
      "pk": 2003012,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 12,
      "text": "God said, \"I will be with you, and this will be the sign for you that I have sent you: when you have brought the people out of Egypt, you will serve God on this mountain.\"",
      "links": "<a href='/AIV/2/19/2'>Ex. 19:2</a>",
      "comment": "\"Serve\" can also mean \"worship\" or \"work\" depending on context."
    },
    {
      "pk": 2003013,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 13,
      "text": "Then Moses said to God, \"If I come to the children of Israel and say to them, 'The God of your fathers has sent me to you,' and they ask me, 'What is his name?' what shall I say to them?\"",
      "links": "<a href='/AIV/2/6/3'>Ex. 6:3</a>",
      "comment": "\"Children of Israel\" is faithful to Hebrew 'benê Yisraêl'."
    },
    {
      "pk": 2003014,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 14,
      "text": "God said to Moses, \"I AM WHO I AM.\" And he said, \"Say this to the children of Israel: 'I AM has sent me to you.'\"",
      "links": "<a href='/AIV/43/8/58'>John 8:58</a>",
      "comment": "\"I AM WHO I AM\" translates the Hebrew \"Ehyeh asher ehyeh.\""
    },
    {
      "pk": 2003015,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 15,
      "text": "And God said further to Moses, \"Say to the children of Israel, 'The LORD, the God of your fathers, the God of Abraham, the God of Isaac, and the God of Jacob, has sent me to you.' This is my name forever, and this is how I am to be remembered through all generations.\"",
      "links": "<a href='/AIV/1/28/13'>Gen. 28:13</a>; <a href='/AIV/19/135/13'>Ps. 135:13</a>",
      "comment": "\"LORD\" in capital letters renders the Hebrew YHWH."
    },
    {
      "pk": 2003016,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 16,
      "text": "\"Go and gather the elders of Israel together and say to them, 'The LORD, the God of your fathers, the God of Abraham, Isaac, and Jacob, has appeared to me, saying: I have surely visited you and seen what is done to you in Egypt.'\"",
      "links": "<a href='/AIV/2/4/29'>Ex. 4:29</a>",
      "comment": "\"Elders of Israel\" refers to tribal leaders."
    },
    {
      "pk": 2003017,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 17,
      "text": "\"And I have said, I will bring you up out of the affliction of Egypt to the land of the Canaanites, the Hittites, the Amorites, the Perizzites, the Hivites, and the Jebusites—a land flowing with milk and honey.'\"",
      "links": "<a href='/AIV/2/13/5'>Ex. 13:5</a>",
      "comment": "Repeated from earlier verse for emphasis."
    },
    {
      "pk": 2003018,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 18,
      "text": "\"They will listen to your voice, and you shall go, you and the elders of Israel, to the king of Egypt, and you shall say to him, 'The LORD, the God of the Hebrews, has met with us; and now, please let us go a three-day journey into the wilderness, that we may sacrifice to the LORD our God.'\"",
      "links": "<a href='/AIV/2/5/3'>Ex. 5:3</a>",
      "comment": "\"Three-day journey\" is a Hebrew idiom meaning a short but significant trip."
    },
    {
      "pk": 2003019,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 19,
      "text": "\"But I know that the king of Egypt will not let you go except by a strong hand.\"",
      "links": "<a href='/AIV/2/6/1'>Ex. 6:1</a>",
      "comment": "\"Strong hand\" signifies divine power."
    },
    {
      "pk": 2003020,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 20,
      "text": "\"So I will stretch out my hand and strike Egypt with all my wonders that I will do in its midst; and after that he will let you go.\"",
      "links": "<a href='/AIV/2/7/4'>Ex. 7:4</a>; <a href='/AIV/2/12/31'>Ex. 12:31",
      "comment": "\"Wonders\" refers to the plagues."
    },
    {
      "pk": 2003021,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 21,
      "text": "\"And I will give this people favor in the sight of the Egyptians; and when you go, you shall not go empty-handed.\"",
      "links": "<a href='/AIV/2/11/3'>Ex. 11:3</a>",
      "comment": "\"Favor\" echoes the Hebrew 'chen' meaning grace or goodwill."
    },
    {
      "pk": 2003022,
      "translation": "AIV",
      "book": 2,
      "chapter": 3,
      "verse": 22,
      "text": "\"But every woman shall ask from her neighbor, and from the one who lives in her house, objects of silver and gold, and garments. And you shall put them on your sons and on your daughters. So you shall plunder the Egyptians.\"",
      "links": "<a href='/AIV/2/12/35'>Ex. 12:35</a>",
      "comment": "\"Plunder\" kept as literal translation of the Hebrew 'natzel.'"
    }
  ],
  "translatedAt": "2025-12-20T08:33:41.932Z"
}