{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 32,
  "verses": [
    {
      "pk": 2032001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 1,
      "text": "When the people saw that Moses was delayed in coming down from the mountain, they gathered around Aaron and said, “Come, make us gods who will go before us. As for this Moses, the man who brought us up out of Egypt, we do not know what has become of him.”",
      "links": "<a href='/AIV/44/7/40'>Acts 7:40</a>; <a href='/AIV/19/106/19-20'>Ps. 106:19-20</a>",
      "comment": "Israel's impatience leads them into idolatry, forgetting the true God who delivered them. This impatience with God's timing is repeated throughout Scripture, suggesting the need for ongoing faith and perseverance. See <a href='/AIV/40/24/48'>Matt. 24:48</a>."
    },
    {
      "pk": 2032002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 2,
      "text": "And Aaron said to them, “Take off the gold rings that are in the ears of your wives, your sons, and your daughters, and bring them to me.”",
      "links": "<a href='/AIV/02/12/35'>Exod 12:35</a>",
      "comment": "Aaron, though a spiritual leader, succumbs to the pressure of the people. Leadership must resist popular opinion when it contradicts God's commands."
    },
    {
      "pk": 2032003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 3,
      "text": "So all the people took off the gold rings that were in their ears and brought them to Aaron.",
      "links": "<a href='/AIV/02/35/22'>Exod 35:22</a>",
      "comment": "The gold was originally a blessing from God, taken from Egypt, but is now misused. Material gifts are meant for God’s service, not our own desires."
    },
    {
      "pk": 2032004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 4,
      "text": "He received the gold from their hand and fashioned it with a tool, making a molten calf. They said, “These are your gods, O Israel, who brought you up out of the land of Egypt!”",
      "links": "<a href='/AIV/11/12/28'>1 Kings 12:28</a>; <a href='/AIV/19/106/19'>Ps. 106:19</a>",
      "comment": "The calf echoes Egyptian idol worship. True worship is directed only towards God, as later reaffirmed by Christ in <a href='/AIV/40/4/10'>Matt. 4:10</a>."
    },
    {
      "pk": 2032005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 5,
      "text": "When Aaron saw this, he built an altar before it. Aaron made a proclamation and said, “Tomorrow shall be a feast to the LORD.”",
      "links": "<a href='/AIV/03/23/2'>Lev. 23:2</a>",
      "comment": "Aaron attempts to blend idol worship with the worship of the LORD, reflecting a confusion between true and false worship still seen in later biblical controversy."
    },
    {
      "pk": 2032006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 6,
      "text": "They rose up early the next day and offered burnt offerings and brought peace offerings. The people sat down to eat and drink and rose up to play.",
      "links": "<a href='/AIV/46/10/7'>1 Cor. 10:7</a>",
      "comment": "Paul cites this as an example of self-indulgence and idolatry. The phrase 'rose up to play' hints at disorder and immorality following false worship."
    },
    {
      "pk": 2032007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 7,
      "text": "Then the LORD said to Moses, “Go down, for your people, whom you brought up out of the land of Egypt, have corrupted themselves.”",
      "links": "<a href='/AIV/05/09/12'>Deut. 9:12</a>",
      "comment": "God addresses Israel as 'your people,' indicating a temporary distancing due to their sin. Mediatorship is key here, prefiguring the greater Mediator, Christ (<a href='/AIV/54/02/5'>1 Tim. 2:5</a>)."
    },
    {
      "pk": 2032008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 8,
      "text": "They have turned aside quickly out of the way which I commanded them. They have made for themselves a molten calf, have worshiped it and sacrificed to it, and said, ‘These are your gods, O Israel, who brought you up out of Egypt.’”",
      "links": "<a href='/AIV/02/20/4-5'>Exod 20:4-5</a>",
      "comment": "A direct violation of the commandment against idols given just earlier. The covenant relationship demands fidelity, shown later in Christ's teachings (<a href='/AIV/40/22/37'>Matt. 22:37</a>)."
    },
    {
      "pk": 2032009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 9,
      "text": "The LORD said to Moses, “I have seen this people, and indeed, they are a stiff-necked people.”",
      "links": "<a href='/AIV/44/7/51'>Acts 7:51</a>",
      "comment": "‘Stiff-necked’ refers to stubbornness. Repeated in later prophetic reproaches, it reinforces humanity’s need for grace and spiritual renewal."
    },
    {
      "pk": 2032010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 10,
      "text": "Now therefore let Me alone, so that my anger may burn against them and destroy them. But I will make you into a great nation.”",
      "links": "<a href='/AIV/01/12/2'>Gen. 12:2</a>",
      "comment": "God proposes judgment but also offers to start anew through Moses. This heightens the role of the mediator, echoed in intercessory prayer and later in Christ's role as High Priest."
    },
    {
      "pk": 2032011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 11,
      "text": "But Moses pleaded with the LORD his God and said, “O LORD, why does Your anger burn against Your people whom You brought out of Egypt with great power and a mighty hand?",
      "links": "<a href='/AIV/05/09/18-19'>Deut. 9:18-19</a>",
      "comment": "Moses intercedes as mediator, prefiguring Christ’s mediation. Intercessory prayer is shown to be pleasing and effectual before God."
    },
    {
      "pk": 2032012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 12,
      "text": "Why should the Egyptians say, ‘He brought them out for evil, to kill them in the mountains and wipe them from the face of the earth’? Turn from your fierce anger and relent from this harm against your people.",
      "links": "<a href='/AIV/02/12/31-32'>Exod 12:31-32</a>",
      "comment": "The honor of God's name among the nations is a motive for mercy, an early anticipation of the importance of visible, communal witness in worship."
    },
    {
      "pk": 2032013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 13,
      "text": "Remember Abraham, Isaac, and Israel, Your servants, to whom You swore by Yourself, saying, ‘I will multiply your descendants as the stars of heaven, and all this land that I promised I will give to your descendants, and they shall inherit it forever.’”",
      "links": "<a href='/AIV/01/15/5'>Gen. 15:5</a>; <a href='/AIV/01/26/4'>Gen 26:4</a>; <a href='/AIV/01/28/13'>Gen 28:13</a>",
      "comment": "Moses appeals to the everlasting covenant and the faithfulness of God's promise. Such continuity of promise is foundational to biblical theology."
    },
    {
      "pk": 2032014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 14,
      "text": "So the LORD relented from the harm He had said He would do to His people.",
      "links": "<a href='/AIV/19/106/23'>Ps. 106:23</a>",
      "comment": "God's mercy, even in judgment, is emphasized. The language speaks to the mystery of God's providence and human intercession."
    },
    {
      "pk": 2032015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 15,
      "text": "Then Moses turned and went down from the mountain with the two tablets of the testimony in his hands. The tablets were written on both sides; on the front and on the back, they were written.",
      "links": "<a href='/AIV/02/31/18'>Exod 31:18</a>; <a href='/AIV/05/09/15'>Deut. 9:15</a>",
      "comment": "The tablets, written on both sides, symbolize completeness. These tablets represent the unchangeable law of God."
    },
    {
      "pk": 2032016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 16,
      "text": "The tablets were the work of God, and the writing was the writing of God engraved on the tablets.",
      "links": "<a href='/AIV/02/24/12'>Exod 24:12</a>; <a href='/AIV/02/31/18'>Exod 31:18</a>",
      "comment": "God's direct authorship of the law is underscored, pointing ahead to the word made flesh who fulfills the law perfectly (<a href='/AIV/43/1/14'>John 1:14</a>)."
    },
    {
      "pk": 2032017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 17,
      "text": "When Joshua heard the noise of the people as they shouted, he said to Moses, “There is a noise of war in the camp.”",
      "links": "<a href='/AIV/02/33/11'>Exod 33:11</a>",
      "comment": "Joshua, the faithful assistant, misinterprets the uproar as combat rather than revelry, demonstrating the confusion that sin brings."
    },
    {
      "pk": 2032018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 18,
      "text": "But Moses said, “It is not the sound of the victory shout, nor the sound of defeat, but the sound of singing that I hear.”",
      "links": "<a href='/AIV/02/15/1'>Exod 15:1</a>",
      "comment": "Moses, knowing the true cause, prepares to confront the people about their sin. Singing here is associated with illicit worship rather than true liturgical song."
    },
    {
      "pk": 2032019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 19,
      "text": "As soon as he came near the camp and saw the calf and dancing, Moses’ anger burned, and he threw the tablets from his hands and shattered them at the foot of the mountain.",
      "links": "<a href='/AIV/05/09/17'>Deut. 9:17</a>",
      "comment": "The breaking of the tablets symbolizes the breach of covenant. Moses’ righteous anger also recalls Christ driving out the money changers (<a href='/AIV/43/2/15'>John 2:15</a>)."
    },
    {
      "pk": 2032020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 20,
      "text": "He took the calf that they had made, burned it with fire, ground it to powder, scattered it on the water, and made the sons of Israel drink it.",
      "links": "<a href='/AIV/05/09/21'>Deut. 9:21</a>",
      "comment": "Moses enacts a complete destruction of the idol, even making its consequences personal. The physicality of this act highlights the seriousness of idolatry."
    },
    {
      "pk": 2032021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 21,
      "text": "Moses said to Aaron, “What did this people do to you, that you have brought so great a sin upon them?”",
      "links": "<a href='/AIV/02/16/2'>Exod 16:2</a>",
      "comment": "Moses confronts Aaron with responsibility for spiritual leadership. Leaders are accountable for guiding people away from sin."
    },
    {
      "pk": 2032022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 22,
      "text": "Aaron said, “Let not the anger of my lord burn hot; you know the people, that they are set on evil.",
      "links": "<a href='/AIV/19/106/16'>Ps. 106:16</a>",
      "comment": "Aaron attempts to defend himself, blaming the people's evil inclinations. It shows the human tendency to deflect responsibility."
    },
    {
      "pk": 2032023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 23,
      "text": "For they said to me, ‘Make us gods who shall go before us. As for this Moses, the man who brought us up out of Egypt, we do not know what has become of him.’",
      "links": "<a href='/AIV/44/7/40'>Acts 7:40</a>",
      "comment": "Repeats the people's faithlessness. Leadership must hold firm to truth even when others demand compromise."
    },
    {
      "pk": 2032024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 24,
      "text": "So I said to them, ‘Whoever has any gold, take it off.’ So they gave it to me, and I threw it into the fire, and out came this calf.”",
      "links": "<a href='/AIV/19/115/4-7'>Ps. 115:4-7</a>",
      "comment": "Aaron’s excuse borders on absurdity, downplaying his role. Highlights the dangers of rationalizing sin."
    },
    {
      "pk": 2032025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 25,
      "text": "When Moses saw that the people had broken loose, for Aaron had let them get out of control, making them an object of mockery among their enemies,",
      "links": "<a href='/AIV/07/21/25'>Judg. 21:25</a>",
      "comment": "Disorder among God’s people brings scandal before unbelievers. Proper discipline and visible holiness are essential for authentic witness."
    },
    {
      "pk": 2032026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 26,
      "text": "Then Moses stood in the entrance of the camp and said, “Whoever is for the LORD, come to me.” All the sons of Levi gathered around him.",
      "links": "<a href='/AIV/05/33/9'>Deut. 33:9</a>",
      "comment": "The Levites distinguish themselves by loyalty. Priestly consecration and separation from sin continue in later apostolic practice (<a href='/AIV/60/2/5'>1 Pet. 2:5</a>)."
    },
    {
      "pk": 2032027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 27,
      "text": "He said to them, “This is what the LORD, the God of Israel, says: Each man strap on his sword. Go throughout the camp from gate to gate, and each one kill his brother, his friend, and his neighbor.”",
      "links": "<a href='/AIV/02/20/5'>Exod 20:5</a>",
      "comment": "Judgment for idolatry is severe, emphasizing the seriousness of sin. The Levites' zeal sets them apart for special service."
    },
    {
      "pk": 2032028,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 28,
      "text": "The sons of Levi did as Moses commanded, and about three thousand men among the people fell that day.",
      "links": "<a href='/AIV/44/2/41'>Acts 2:41</a>",
      "comment": "The cost of disobedience is high, underscoring that true holiness may demand sacrifice. For contrast see the three thousand saved at Pentecost through the Spirit."
    },
    {
      "pk": 2032029,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 29,
      "text": "Then Moses said, “Consecrate yourselves today to the LORD, for every man has been against his son and his brother, so that He may bestow a blessing upon you this day.”",
      "links": "<a href='/AIV/05/33/9-10'>Deut. 33:9-10</a>",
      "comment": "Consecration after judgment sets apart the Levites for religious service, foreshadowing the necessity of spiritual purification before serving."
    },
    {
      "pk": 2032030,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 30,
      "text": "The next day Moses said to the people, “You have committed a great sin. Now I will go up to the LORD; perhaps I can make atonement for your sin.”",
      "links": "<a href='/AIV/02/34/9'>Exod 34:9</a>",
      "comment": "Moses’ willingness to seek atonement foreshadows the need for a mediator who makes true expiation, fulfilled ultimately through Jesus."
    },
    {
      "pk": 2032031,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 31,
      "text": "So Moses returned to the LORD and said, “Oh, this people has sinned a great sin; they have made themselves gods of gold.",
      "links": "<a href='/AIV/19/106/19-20'>Ps. 106:19-20</a>",
      "comment": "True repentance recognizes the gravity of the offense. Only honest confession can open the door to mercy and reconciliation."
    },
    {
      "pk": 2032032,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 32,
      "text": "Yet now, please forgive their sin—but if not, erase me from the book that You have written.”",
      "links": "<a href='/AIV/19/69/28'>Ps. 69:28</a>; <a href='/AIV/66/3/5'>Rev. 3:5</a>",
      "comment": "Moses offers himself as a substitute, a profound act anticipating the sacrificial mediation fulfilled in Christ’s offering on the cross."
    },
    {
      "pk": 2032033,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 33,
      "text": "But the LORD said to Moses, “Whoever has sinned against Me, I will erase from My book.",
      "links": "<a href='/AIV/19/69/28'>Ps. 69:28</a>; <a href='/AIV/66/20/12'>Rev. 20:12</a>",
      "comment": "Each person is accountable before God’s justice. The book of life concept prefigures judgment themes found in Daniel and Revelation."
    },
    {
      "pk": 2032034,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 34,
      "text": "Now go and lead the people to the place I spoke of. Behold, My Messenger shall go before you; but in the day I visit, I will punish them for their sin.”",
      "links": "<a href='/AIV/02/23/20'>Exod 23:20</a>",
      "comment": "The assurance of ongoing guidance, despite sin, points to God’s persistent, guiding presence—even amid discipline. Tradition sees the Messenger as a foreshadowing of the incarnate Word."
    },
    {
      "pk": 2032035,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 32,
      "verse": 35,
      "text": "The LORD struck the people with a plague because of what they did with the calf Aaron had made.",
      "links": "<a href='/AIV/04/16/49'>Num. 16:49</a>; <a href='/AIV/19/78/50'>Ps. 78:50</a>",
      "comment": "Judgment follows sin, even after forgiveness. God’s justice and mercy are balanced, seen ultimately in Christ, who bears the cost of sin while offering healing to the people."
    }
  ],
  "translatedAt": "2025-12-24T01:04:27.276Z"
}