{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 35,
  "verses": [
    {
      "pk": 2035001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 1,
      "text": "Moses assembled all the congregation of the people of Israel and said to them, \"These are the words that the LORD has commanded you to do:",
      "links": "<a href='/AIV/2/34/32'>Exod 34:32</a>; <a href='/AIV/3/8/3'>Lev 8:3</a>",
      "comment": "Moses gathers all Israel for instruction. This recalls the pattern of communal worship and the solemnity of the covenant (Exod 19:7-8)."
    },
    {
      "pk": 2035002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 2,
      "text": "Six days work shall be done, but on the seventh day you shall have a holy day, a Sabbath of solemn rest to the LORD. Anyone who does work on it shall be put to death.",
      "links": "<a href='/AIV/2/20/9-10'>Exod 20:9-10</a>; <a href='/AIV/3/23/3'>Lev 23:3</a>",
      "comment": "The command of Sabbath rest precedes the building of the tabernacle, showing God's rhythm of work and worship. The seriousness of this command anticipates Jesus fulfilling the law (Matt 5:17)."
    },
    {
      "pk": 2035003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 3,
      "text": "You shall not kindle a fire in any of your dwelling places on the Sabbath day.\"",
      "links": "<a href='/AIV/2/16/23'>Exod 16:23</a>",
      "comment": "A specific restriction on fire, highlighting practical ways people can dedicate the day wholly to God. Observing sacred times foreshadows liturgical worship in the New Covenant."
    },
    {
      "pk": 2035004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 4,
      "text": "Moses spoke to all the congregation of the people of Israel, saying, \"This is the thing which the LORD has commanded:",
      "links": "<a href='/AIV/2/25/1-2'>Exod 25:1-2</a>",
      "comment": "Moses here shifts focus from Sabbath to instructions for offerings for the tabernacle—ritual and worship are always closely linked in Hebrew tradition and point forward to the Church's practice."
    },
    {
      "pk": 2035005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 5,
      "text": "\"Take from among you an offering to the LORD. Whoever is of a willing heart, let him bring it as the LORD’s offering: gold, silver, and bronze;",
      "links": "<a href='/AIV/2/25/2'>Exod 25:2</a>",
      "comment": "God desires free, willing offerings from the people’s hearts—a theme echoed by Paul in 2 Cor 9:7 about cheerful giving. The abundance for God's house comes from the generosity inspired by God Himself."
    },
    {
      "pk": 2035006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 6,
      "text": "blue, purple, and scarlet yarns, and fine linen; goats’ hair,",
      "links": "<a href='/AIV/2/25/4'>Exod 25:4</a>",
      "comment": "Precious materials reflect the dignity and beauty due to God's dwelling. Blue was often a symbol for heaven, purple for royalty, and scarlet for sacrifice; all pointing towards Christ's passion."
    },
    {
      "pk": 2035007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 7,
      "text": "rams’ skins dyed red, and fine leather, acacia wood,",
      "links": "<a href='/AIV/2/26/14-15'>Exod 26:14-15</a>",
      "comment": "Materials for sacred use were set aside and sanctified for God. This theme resonates with later practices of sacred architecture and furnishings for worship."
    },
    {
      "pk": 2035008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 8,
      "text": "oil for the light, spices for the anointing oil and for the fragrant incense,",
      "links": "<a href='/AIV/2/27/20'>Exod 27:20</a>; <a href='/AIV/2/30/23-25'>Exod 30:23-25</a>",
      "comment": "Oil, anointing, and incense all became symbols of prayer and the Holy Spirit (cf. Ps 141:2; 1 John 2:20,27). Anointing oil foreshadows the New Testament’s sacraments."
    },
    {
      "pk": 2035009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 9,
      "text": "and onyx stones and stones to be set, for the ephod and for the breastpiece.",
      "links": "<a href='/AIV/2/28/9-21'>Exod 28:9-21</a>",
      "comment": "The priest’s ephod and breastpiece, adorned with precious stones, signify the mediatory, representative role of spiritual leaders and point to Christ as our High Priest (Heb 4:14-15)."
    },
    {
      "pk": 2035010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 10,
      "text": "\"Let every skilled craftsman among you come and make all that the LORD has commanded:",
      "links": "<a href='/AIV/2/31/6'>Exod 31:6</a>",
      "comment": "Not just offerings but skills are consecrated to God. The Spirit’s gifts are diverse, yet unified in building the Lord’s house, echoing Eph 4:11-13."
    },
    {
      "pk": 2035011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 11,
      "text": "the tabernacle, its tent and its covering, its hooks and its frames, its bars, its pillars, and its bases;",
      "links": "<a href='/AIV/2/26/1-30'>Exod 26:1-30</a>",
      "comment": "Detailing the precise structure of God’s dwelling recalls the order and harmony desired by God—reflected in apostolic teaching on unity and order (1 Cor 14:40)."
    },
    {
      "pk": 2035012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 12,
      "text": "the ark with its poles, the mercy seat, and the veil of the screen;",
      "links": "<a href='/AIV/2/25/10-22'>Exod 25:10-22</a>",
      "comment": "The ark as God’s throne and the mercy seat as a sign of God's presence among His people anticipated the incarnation—God dwelling among us in Christ (John 1:14)."
    },
    {
      "pk": 2035013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 13,
      "text": "the table with its poles and all its utensils, and the bread of the Presence;",
      "links": "<a href='/AIV/2/25/23-30'>Exod 25:23-30</a>",
      "comment": "The bread of the Presence provided a pattern for Eucharistic realities, foreshadowing mysterious realities fulfilled in Christ (Luke 22:19)."
    },
    {
      "pk": 2035014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 14,
      "text": "the lampstand also for the light, with its utensils and its lamps, and the oil for the light;",
      "links": "<a href='/AIV/2/25/31-39'>Exod 25:31-39</a>",
      "comment": "The lampstand symbolizes God’s presence and spiritual illumination (Zech 4:2; Rev 1:12-13). Jesus calls Himself the Light of the World (John 8:12)."
    },
    {
      "pk": 2035015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 15,
      "text": "and the altar of incense, with its poles, and the anointing oil and the fragrant incense, and the screen for the entrance at the entrance of the tabernacle;",
      "links": "<a href='/AIV/2/30/1-10'>Exod 30:1-10</a>",
      "comment": "Incense symbolizes the prayers of the saints (Ps 141:2; Rev 5:8), and its continued use in worship traditions underlines the continuity of God's worship through the ages."
    },
    {
      "pk": 2035016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 16,
      "text": "the altar of burnt offering, with its bronze grating, its poles and all its utensils, the basin and its stand;",
      "links": "<a href='/AIV/2/27/1-8'>Exod 27:1-8</a>",
      "comment": "Sacrificial elements point to the need for atonement through blood, all fulfilled in Christ’s sacrifice (Heb 9:22-26)."
    },
    {
      "pk": 2035017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 17,
      "text": "the hangings of the court, its pillars and its bases, and the screen for the gate of the court;",
      "links": "<a href='/AIV/2/27/9-19'>Exod 27:9-19</a>",
      "comment": "The court set boundaries and created a space for the sacred. Sanctuary architecture in the New Covenant era reflects such divine order."
    },
    {
      "pk": 2035018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 18,
      "text": "the pegs of the tabernacle and the pegs of the court, and their cords;",
      "links": "<a href='/AIV/2/27/19'>Exod 27:19</a>",
      "comment": "Even the smallest elements contributed to the structure's unity, reflecting the truth that every member and gift has a place in God’s household (1 Cor 12:18-27)."
    },
    {
      "pk": 2035019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 19,
      "text": "the finely worked garments for ministering in the Holy Place, the holy garments for Aaron the priest and the garments for his sons, to serve as priests.\"",
      "links": "<a href='/AIV/2/28/2-4'>Exod 28:2-4</a>",
      "comment": "Distinctive priestly garments emphasized sacred ministry set apart by God—pointing to apostolic succession and the continual ministerial priesthood (cf. Heb 5:1-4)."
    },
    {
      "pk": 2035020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 20,
      "text": "Then all the congregation of the people of Israel departed from the presence of Moses.",
      "links": "<a href='/AIV/2/34/32'>Exod 34:32</a>",
      "comment": "The people respond to God’s word. This rhythmic pattern of proclamation and response underlies all authentic worship."
    },
    {
      "pk": 2035021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 21,
      "text": "And they came, everyone whose heart stirred him, and everyone whose spirit was willing, and brought the LORD’s offering for the work of the Tent of Meeting, for all its service, and for the holy garments.",
      "links": "<a href='/AIV/2/25/2'>Exod 25:2</a>",
      "comment": "The Spirit moves the hearts of the people, and their willingness brings abundance for God's work—an image of the Holy Spirit drawing souls into active service."
    },
    {
      "pk": 2035022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 22,
      "text": "So they came, both men and women, all who were willing of heart, and brought brooches and earrings and signet rings and armlets, all sorts of gold objects—every man dedicating an offering of gold to the LORD.",
      "links": "<a href='/AIV/2/12/35-36'>Exod 12:35-36</a>",
      "comment": "Their generosity draws from treasures acquired from Egypt; God calls all to dedicate our riches for His glory and worship."
    },
    {
      "pk": 2035023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 23,
      "text": "And everyone who possessed blue or purple or scarlet yarns, or fine linen, or goats’ hair, or rams’ skins dyed red, or fine leather, brought them.",
      "links": "<a href='/AIV/2/25/4-6'>Exod 25:4-6</a>",
      "comment": "The contributions were not only precious metals but also textiles and animal skins. Every resource is valued in God’s house, prefiguring the diversity of gifts in the Body of Christ."
    },
    {
      "pk": 2035024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 24,
      "text": "Everyone who could make a contribution of silver or bronze brought it as the LORD’s offering. And everyone who had acacia wood of any use for the work brought it.",
      "links": "<a href='/AIV/2/25/3-7'>Exod 25:3-7</a>",
      "comment": "No gift is too small if offered for God’s glory—anticipating the parable of the widow’s offering (Mark 12:41-44)."
    },
    {
      "pk": 2035025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 25,
      "text": "And every skilled woman spun with her hands, and they all brought what they had spun in blue and purple and scarlet yarns and fine linen.",
      "links": "<a href='/AIV/2/35/10'>Exod 35:10</a>",
      "comment": "The empowerment of women in the tabernacle’s construction shows that all are called to serve according to their gifts (cf. Prov 31:13, 19-20)."
    },
    {
      "pk": 2035026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 26,
      "text": "All the women whose hearts were stirred by skill spun the goats’ hair.",
      "links": "<a href='/AIV/2/35/21'>Exod 35:21</a>",
      "comment": "Gifts come from the heart, spurred by the Spirit. Again, willing service is a prelude to the New Covenant teaching (Rom 12:6–8)."
    },
    {
      "pk": 2035027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 27,
      "text": "The leaders brought onyx stones and stones to be set, for the ephod and for the breastpiece,",
      "links": "<a href='/AIV/2/28/9-12'>Exod 28:9-12</a>",
      "comment": "Spiritual leaders provided from their own abundance, reflecting a model in which those in spiritual authority give generously for the sacred purpose."
    },
    {
      "pk": 2035028,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 28,
      "text": "and spices and oil for the light, and for the anointing oil, and for the fragrant incense.",
      "links": "<a href='/AIV/2/30/23-25'>Exod 30:23-25</a>",
      "comment": "The leaders’ contributions of oil and incense kept the worship life regular—a foreshadowing of perpetual prayer (1 Thess 5:17) and sacramental grace."
    },
    {
      "pk": 2035029,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 29,
      "text": "All the men and women, the people of Israel, whose heart moved them to bring anything for the work that the LORD had commanded by Moses to be done, brought it as a freewill offering to the LORD.",
      "links": "<a href='/AIV/2/35/21'>Exod 35:21</a>; <a href='/AIV/2/25/2'>Exod 25:2</a>",
      "comment": "Worship in spirit and truth finds expression in generous participation and unity—a vision realized in the earliest Christian communities (Acts 2:44-47)."
    },
    {
      "pk": 2035030,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 30,
      "text": "Then Moses said to the people of Israel, \"See, the LORD has called by name Bezalel the son of Uri, son of Hur, of the tribe of Judah;",
      "links": "<a href='/AIV/2/31/2'>Exod 31:2</a>",
      "comment": "God personally calls Bezalel, showing that vocations come from the divine will—God appoints whom He chooses for sacred work."
    },
    {
      "pk": 2035031,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 31,
      "text": "and he has filled him with the Spirit of God, with wisdom, with understanding, with knowledge, and with all kinds of workmanship,",
      "links": "<a href='/AIV/2/31/3'>Exod 31:3</a>",
      "comment": "The Spirit imparts wisdom and special charisms for specific purposes, later referenced by Paul (1 Cor 12:4-11)."
    },
    {
      "pk": 2035032,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 32,
      "text": "to devise artistic designs, to work in gold and silver and bronze,",
      "links": "<a href='/AIV/2/31/4'>Exod 31:4</a>",
      "comment": "Artistry and craftsmanship have a divine origin and purpose, echoing humanity created in God’s image as co-creators in beauty and worship."
    },
    {
      "pk": 2035033,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 33,
      "text": "in cutting stones for setting, and in carving wood, for work in every skillful craft.",
      "links": "<a href='/AIV/2/31/5'>Exod 31:5</a>",
      "comment": "Excellence in work is a spiritual virtue, teaching that every task can be offered in worship (Col 3:23)."
    },
    {
      "pk": 2035034,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 34,
      "text": "And he has inspired him to teach, both him and Oholiab the son of Ahisamach, of the tribe of Dan.",
      "links": "<a href='/AIV/2/31/6'>Exod 31:6</a>",
      "comment": "God not only gives gifts but raises up teachers, establishing the importance of instruction and apprenticeship for passing on faith and skills (cf. 2 Tim 2:2)."
    },
    {
      "pk": 2035035,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 35,
      "verse": 35,
      "text": "He has filled them with skill to do every sort of work done by a craftsman or designer or embroiderer in blue, purple, and scarlet yarns, and fine linen, or by a weaver—by any sort of workman or skilled designer.",
      "links": "<a href='/AIV/2/31/6'>Exod 31:6</a>; <a href='/AIV/2/36/1'>Exod 36:1</a>",
      "comment": "This summary emphasizes that God equips his people for every work needed in His worship, foreshadowing the diversity and unity of ministries in the Church (Eph 4:11-13)."
    }
  ],
  "translatedAt": "2025-12-24T01:06:25.507Z"
}