{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 24,
  "verses": [
    {
      "pk": 2024001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 1,
      "text": "Then He said to Moses, \"Come up to Yahweh, you and Aaron, Nadab and Abihu, and seventy of the elders of Israel, and worship from a distance.\"",
      "links": "<a href='/AIV/2/19/24'>Exod. 19:24</a>; <a href='/AIV/2/24/9'>Exod. 24:9</a>",
      "comment": "God calls Moses and select leaders to approach, symbolizing the beginning of a covenant encounter. The limitation of access foreshadows distinctions in sacred ministry and worship."
    },
    {
      "pk": 2024002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 2,
      "text": "\"But Moses alone shall come near Yahweh; the others shall not come near, and the people shall not come up with him.\"",
      "links": "<a href='/AIV/2/20/19'>Exod. 20:19</a>; <a href='/AIV/3/16/2'>Lev. 16:2</a>",
      "comment": "Moses acts as mediator, highlighting the spiritual principle of intercession and the role of a chosen leader in God's covenant plan."
    },
    {
      "pk": 2024003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 3,
      "text": "Moses came and told the people all the words of Yahweh and all the ordinances. And all the people answered with one voice, saying, \"We will do all the words which Yahweh has spoken.\"",
      "links": "<a href='/AIV/2/19/8'>Exod. 19:8</a>; <a href='/AIV/5/5/27'>Deut. 5:27</a>",
      "comment": "The communal response signifies corporate acceptance of God’s law, a foundational moment for the people united in faith and obedience (see Acts 2:42, early Christian community)."
    },
    {
      "pk": 2024004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 4,
      "text": "And Moses wrote down all the words of Yahweh. He rose up early in the morning and built an altar at the foot of the mountain, with twelve pillars for the twelve tribes of Israel.",
      "links": "<a href='/AIV/2/17/15'>Exod. 17:15</a>; <a href='/AIV/6/4/20'>Josh. 4:20</a>",
      "comment": "Written law and the altar symbolize the lasting foundation of God's covenant, and the twelve pillars represent unity among all the tribes, echoing the apostolic structure seen later in history (cf. Luke 6:13, Twelve Apostles)."
    },
    {
      "pk": 2024005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 5,
      "text": "He sent young men from the sons of Israel, who offered burnt offerings and sacrificed peace offerings of oxen to Yahweh.",
      "links": "<a href='/AIV/3/1/3'>Lev. 1:3</a>; <a href='/AIV/3/3/1'>Lev. 3:1</a>",
      "comment": "The sacrifice of peace offerings indicates covenantal fellowship with God, prefiguring the spiritual communion found in later liturgical worship (see Heb. 9:13-14)."
    },
    {
      "pk": 2024006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 6,
      "text": "Moses took half of the blood and put it in bowls, and he sprinkled half of the blood on the altar.",
      "links": "<a href='/AIV/3/8/15'>Lev. 8:15</a>; <a href='/AIV/58/9/21-22'>Heb. 9:21-22</a>",
      "comment": "Blood on the altar signifies atonement and dedication, foreshadowing the ultimate sacrifice in Christ where blood brings forgiveness and reconciliation (cf. Heb. 12:24)."
    },
    {
      "pk": 2024007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 7,
      "text": "He took the Book of the Covenant and read it aloud for the people to hear. They said, \"We will do and obey all that Yahweh has spoken.\"",
      "links": "<a href='/AIV/2/19/8'>Exod. 19:8</a>; <a href='/AIV/24/31/33'>Jer. 31:33</a>",
      "comment": "Public reading and affirmation create a binding spiritual contract, pointing to the importance of Scripture and obedience (see James 1:22)."
    },
    {
      "pk": 2024008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 8,
      "text": "Moses took the blood and sprinkled it on the people, saying, \"Behold, the blood of the covenant which Yahweh has made with you according to all these words.\"",
      "links": "<a href='/AIV/40/26/28'>Matt. 26:28</a>; <a href='/AIV/58/9/20'>Heb. 9:20</a>",
      "comment": "The covenant sealed by blood finds its ultimate fulfillment in Christ’s words at the Last Supper, establishing a new eternal covenant (Matt. 26:28, Heb. 9:15-20). Ritual sprinkling establishes a visible connection between God’s promise and the people."
    },
    {
      "pk": 2024009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 9,
      "text": "Then Moses, Aaron, Nadab, Abihu, and seventy of the elders of Israel went up,",
      "links": "<a href='/AIV/2/24/1'>Exod. 24:1</a>; <a href='/AIV/2/24/14'>Exod. 24:14</a>",
      "comment": "The ascent of Moses and the elders mirrors patterns of ascending to God for special revelation or fellowship, signifying leadership and the privilege of drawing near to God."
    },
    {
      "pk": 2024010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 10,
      "text": "and they saw the God of Israel. Under His feet there was something like a pavement of sapphire, clear as the sky itself.",
      "links": "<a href='/AIV/26/1/26'>Ezek. 1:26</a>; <a href='/AIV/66/4/6'>Rev. 4:6</a>",
      "comment": "A rare vision of God’s glory, described with vivid imagery. The sapphire pavement suggests heavenly transcendence, reminiscent of other biblical throne visions (Ezekiel, Revelation)."
    },
    {
      "pk": 2024011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 11,
      "text": "But He did not lay His hand on the nobles of the sons of Israel. So they saw God, and they ate and drank.",
      "links": "<a href='/AIV/43/6/53-56'>John 6:53-56</a>; <a href='/AIV/66/19/9'>Rev. 19:9</a>",
      "comment": "God permits them to behold Him and share a sacred meal, highlighting the connection between communion with God and spiritual fellowship (cf. the Eucharistic imagery in John 6, Revelation 19:9)."
    },
    {
      "pk": 2024012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 12,
      "text": "Yahweh said to Moses, \"Come up to Me on the mountain and stay there, and I will give you the tablets of stone, with the law and commandments which I have written, so that you may teach them.\"",
      "links": "<a href='/AIV/2/31/18'>Exod. 31:18</a>; <a href='/AIV/5/4/13'>Deut. 4:13</a>",
      "comment": "God’s own writing and delivery of the law establishes its supreme authority and purpose for instruction, paralleling later tradition and teaching offices in the church (see Matt. 28:20, spiritual teaching and discipleship)."
    },
    {
      "pk": 2024013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 13,
      "text": "So Moses rose up with Joshua his assistant, and Moses went up onto the mountain of God.",
      "links": "<a href='/AIV/6/1/1'>Josh. 1:1</a>; <a href='/AIV/2/33/11'>Exod. 33:11</a>",
      "comment": "Joshua’s presence as Moses’ assistant shows the continuity of leadership, anticipation of succession, and fidelity in God’s plan."
    },
    {
      "pk": 2024014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 14,
      "text": "And he said to the elders, \"Wait here for us until we return to you. Aaron and Hur are with you; whoever has a legal matter, let him go to them.\"",
      "links": "<a href='/AIV/2/17/10-12'>Exod. 17:10-12</a>; <a href='/AIV/5/1/16-17'>Deut. 1:16-17</a>",
      "comment": "Delegation of authority to Aaron and Hur establishes a model for spiritual oversight and leadership among God’s people."
    },
    {
      "pk": 2024015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 15,
      "text": "Then Moses went up on the mountain, and the cloud covered the mountain.",
      "links": "<a href='/AIV/2/19/9'>Exod. 19:9</a>; <a href='/AIV/40/17/5'>Matt. 17:5</a>",
      "comment": "The cloud signifies God’s holy presence, surrounding Moses as at other major revelations. The motif of the cloud marks divine encounters (cf. Mt. 17:5, Transfiguration)."
    },
    {
      "pk": 2024016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 16,
      "text": "And the glory of Yahweh rested on Mount Sinai, and the cloud covered it for six days. On the seventh day He called to Moses out of the midst of the cloud.",
      "links": "<a href='/AIV/26/1/28'>Ezek. 1:28</a>; <a href='/AIV/40/17/5'>Matt. 17:5</a>",
      "comment": "The pattern of waiting and calling on the seventh day reflects sacred time and preparation (see Gen. 2:2-3, Sabbath rest and holiness)."
    },
    {
      "pk": 2024017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 17,
      "text": "Now the appearance of the glory of Yahweh was like a consuming fire on the top of the mountain before the eyes of the people of Israel.",
      "links": "<a href='/AIV/5/4/24'>Deut. 4:24</a>; <a href='/AIV/58/12/29'>Heb. 12:29</a>",
      "comment": "God’s glory as fire signifies holiness, awe, and purifying judgment—an image picked up in New Testament descriptions of God’s majesty (Heb. 12:29)."
    },
    {
      "pk": 2024018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 24,
      "verse": 18,
      "text": "Moses entered the midst of the cloud and went up the mountain. Moses was on the mountain forty days and forty nights.",
      "links": "<a href='/AIV/2/34/28'>Exod. 34:28</a>; <a href='/AIV/40/4/2'>Matt. 4:2</a>",
      "comment": "Forty days and nights denotes a period of spiritual preparation and transformation, also seen in Jesus’ fast (Matt. 4:2), linking Moses’ experience with future revelation."
    }
  ],
  "translatedAt": "2025-12-24T00:59:40.715Z"
}