{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 12,
  "verses": [
    {
      "pk": 2012001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 1,
      "text": "The LORD spoke to Moses and Aaron in the land of Egypt, saying,",
      "links": "<a href='/AIV/3/23/33'>Lev. 23:33</a>; <a href='/AIV/4/9/1'>Num. 9:1-5</a>",
      "comment": "God initiates a new revelation to Moses and Aaron, setting the stage for the institution of the Passover. This emphasizes divine authority, laying the foundation for liturgical practice."
    },
    {
      "pk": 2012002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 2,
      "text": "This month shall mark the beginning of months for you; it shall be the first month of the year for you.",
      "links": "<a href='/AIV/3/23/5'>Lev. 23:5</a>; <a href='/AIV/16/2/1'>Neh. 2:1</a>",
      "comment": "God institutes a new calendar, aligning their identity with this redemptive event. The liturgical calendar begins with deliverance—a hint towards the importance of sacred time."
    },
    {
      "pk": 2012003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 3,
      "text": "Speak to all the congregation of Israel, saying, 'On the tenth day of this month, every man shall take a lamb for himself, according to his father's house, a lamb for each household.'",
      "links": "<a href='/AIV/4/9/3'>Num. 9:3'</a>; <a href='/AIV/43/1/29'>John 1:29</a>",
      "comment": "The lamb becomes the central symbol of Passover, prefiguring Christ as the Lamb of God (see John 1:29). The focus on 'household' highlights communal and familial participation—a key feature in worship through history."
    },
    {
      "pk": 2012004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 4,
      "text": "'If the household is too small for a lamb, then he and his nearest neighbor shall take one according to the number of persons; each shall make his count for the lamb according to what he eats.'",
      "links": "<a href='/AIV/4/9/6'>Num. 9:6-7</a>",
      "comment": "Emphasizing unity and sharing among households, this verse reflects the importance of community in worship—a theme carried forward into New Testament believers."
    },
    {
      "pk": 2012005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 5,
      "text": "'Your lamb must be without blemish, a male, one year old. You may take it from the sheep or from the goats.'",
      "links": "<a href='/AIV/3/22/19-20'>Lev. 22:19-20</a>; <a href='/AIV/60/1/19'>1 Pet. 1:19</a>",
      "comment": "A spotless lamb points to the sinlessness of Christ, echoed in 1 Peter 1:19. The requirement for unblemished offerings sets a precedent for later sacrificial practices."
    },
    {
      "pk": 2012006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 6,
      "text": "'You must keep it until the fourteenth day of this month, when the whole assembly of the congregation of Israel shall slaughter their lambs at twilight.'",
      "links": "<a href='/AIV/4/9/5'>Num. 9:5</a>; <a href='/AIV/41/15/33-34'>Mark 15:33-34</a>",
      "comment": "The communal slaughter underlines unity and obedience. Twilight timing foreshadows Christ's death as the true Passover Lamb."
    },
    {
      "pk": 2012007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 7,
      "text": "'They must take some of the blood and put it on the two doorposts and the lintel of the houses where they eat it.'",
      "links": "<a href='/AIV/58/11/28'>Heb. 11:28</a>; <a href='/AIV/40/26/28'>Matt. 26:28</a>",
      "comment": "Blood marking signals protection through sacrifice; it is both a literal deliverance and a prophetic sign of new covenant sacrifice (Matt. 26:28)."
    },
    {
      "pk": 2012008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 8,
      "text": "'They shall eat the flesh that night, roasted over fire, with unleavened bread and bitter herbs.'",
      "links": "<a href='/AIV/3/23/6'>Lev. 23:6</a>; <a href='/AIV/46/5/7-8'>1 Cor. 5:7-8</a>",
      "comment": "Eating the lamb with unleavened bread links to later festival observances; the bitter herbs recall suffering, alluding spiritually to Christ's passion."
    },
    {
      "pk": 2012009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 9,
      "text": "'Do not eat any of it raw or boiled in water but only roasted over fire—head, legs, and inner organs together.'",
      "links": "<a href='/AIV/3/8/31'>Lev. 8:31</a>",
      "comment": "Full consumption of the lamb signifies total offering; roasting by fire is symbolic of purification and judgment."
    },
    {
      "pk": 2012010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 10,
      "text": "'You shall let none of it remain until morning. Whatever is left until morning you must burn.'",
      "links": "<a href='/AIV/3/7/17'>Lev. 7:17</a>; <a href='/AIV/40/26/26'>Matt. 26:26</a>",
      "comment": "The mandate for swift consumption and burning leftovers signifies reverence in handling what is sacred—a theme in later Eucharistic theology."
    },
    {
      "pk": 2012011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 11,
      "text": "'This is how you shall eat it: with your belt fastened, your sandals on your feet, and your staff in your hand. You shall eat it in haste—it is the LORD's Passover.'",
      "links": "<a href='/AIV/4/9/11'>Num. 9:11</a>; <a href='/AIV/46/11/26'>1 Cor. 11:26</a>",
      "comment": "Readiness and haste signify the urgency of deliverance; the meal is both sacred ritual and preparation for pilgrimage, connecting to eucharistic themes of participation."
    },
    {
      "pk": 2012012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 12,
      "text": "'For I will pass through the land of Egypt that night, and I will strike down all the firstborn in the land of Egypt, both man and beast; and I will execute judgment against all the gods of Egypt. I am the LORD.'",
      "links": "<a href='/AIV/19/135/8'>Ps. 135:8</a>; <a href='/AIV/26/30/13'>Ezek. 30:13</a>",
      "comment": "This act demonstrates God's sovereignty over false gods and creation, foreshadowing final judgment and liberation."
    },
    {
      "pk": 2012013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 13,
      "text": "'The blood shall be a sign for you on the houses where you are. When I see the blood, I will pass over you, and no plague will come upon you to destroy you when I strike Egypt.'",
      "links": "<a href='/AIV/58/11/28'>Heb. 11:28</a>; <a href='/AIV/62/1/7'>1 John 1:7</a>",
      "comment": "The blood as a sign prefigures redemption through the blood of Christ, revealing the connection between sacrifice and salvation."
    },
    {
      "pk": 2012014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 14,
      "text": "'This day shall be for you a memorial, and you shall keep it as a feast to the LORD throughout your generations; as a perpetual statute, you shall observe it.'",
      "links": "<a href='/AIV/3/23/14'>Lev. 23:14</a>; <a href='/AIV/42/22/19'>Luke 22:19</a>",
      "comment": "Establishing memorial worship, this verse links to New Testament institution of spiritual remembrance (Luke 22:19)."
    },
    {
      "pk": 2012015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 15,
      "text": "'For seven days you shall eat unleavened bread. On the first day, remove leaven out of your houses. Whoever eats what is leavened from the first day until the seventh day shall be cut off from Israel.'",
      "links": "<a href='/AIV/3/23/6'>Lev. 23:6</a>; <a href='/AIV/46/5/7'>1 Cor. 5:7</a>",
      "comment": "Unleavened bread symbolizes purity and removal of sin; the command for exclusion of the disobedient foreshadows church discipline concepts."
    },
    {
      "pk": 2012016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 16,
      "text": "'On the first day you shall hold a holy assembly, and also on the seventh day a holy assembly. No work shall be done on those days, except what must be prepared for each person, which alone may be done by you.'",
      "links": "<a href='/AIV/3/23/7-8'>Lev. 23:7-8</a>",
      "comment": "The concept of sacred gatherings and rest, along with ritual preparation for food, sets the model for liturgical worship and Christian assemblies."
    },
    {
      "pk": 2012017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 17,
      "text": "'You shall observe the Feast of Unleavened Bread, for on this very day I brought your armies out of the land of Egypt. Therefore, you shall keep this day throughout your generations as a perpetual ordinance.'",
      "links": "<a href='/AIV/2/13/3-10'>Exod. 13:3-10</a>",
      "comment": "The perpetual celebration confirms the need for continual remembrance, embedded in the worship practice of God's people."
    },
    {
      "pk": 2012018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 18,
      "text": "'In the first month, from the evening of the fourteenth day until the evening of the twenty-first day, you shall eat unleavened bread.'",
      "links": "<a href='/AIV/3/23/6-8'>Lev. 23:6-8</a>",
      "comment": "The strict timeframe for unleavened bread reinforces ritual exactness—a precedent for later prescribed liturgical practice."
    },
    {
      "pk": 2012019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 19,
      "text": "'For seven days no leaven shall be found in your houses. Whoever eats what is leavened—that person shall be cut off from the congregation of Israel, whether a stranger or a native of the land.'",
      "links": "<a href='/AIV/46/5/7-8'>1 Cor. 5:7-8</a>",
      "comment": "Leaven repeatedly serves as a symbol for corruption and sin, and the strict removal points to a call for internal purity among all worshipers."
    },
    {
      "pk": 2012020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 20,
      "text": "'You shall eat nothing leavened. In all your dwellings you shall eat unleavened bread.'",
      "links": "<a href='/AIV/3/10/12'>Lev. 10:12</a>",
      "comment": "The repetition reinforces the importance of ritual practice, shaping the habits and spirituality of God's people."
    },
    {
      "pk": 2012021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 21,
      "text": "Then Moses called all the elders of Israel and said to them, 'Go, select lambs according to your families, and kill the Passover lamb.'",
      "links": "<a href='/AIV/40/26/17'>Matt. 26:17</a>; <a href='/AIV/2/12/3'>Exod. 12:3</a>",
      "comment": "The authority of Moses among elders reflects hierarchical leadership and the preservation of tradition, hinting at a structured community."
    },
    {
      "pk": 2012022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 22,
      "text": "'Take a bundle of hyssop, dip it in the blood that is in the basin, and strike the lintel and the two doorposts with the blood in the basin. None of you shall go out of the door of his house until morning.'",
      "links": "<a href='/AIV/19/51/7'>Ps. 51:7</a>; <a href='/AIV/43/19/29'>John 19:29</a>",
      "comment": "Hyssop becomes a symbol of purification later in Scripture (Ps. 51:7), and its connection to blood points directly to Christ's passion (John 19:29)."
    },
    {
      "pk": 2012023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 23,
      "text": "'For the LORD will pass through to strike the Egyptians; and when he sees the blood on the lintel and on the two doorposts, the LORD will pass over the door and will not allow the destroyer to enter your houses to strike you.'",
      "links": "<a href='/AIV/58/11/28'>Heb. 11:28</a>; <a href='/AIV/19/91/10'>Ps. 91:10</a>",
      "comment": "Divine protection through sacrificial offering again emphasizes salvation by blood—a central idea fulfilled in Christ."
    },
    {
      "pk": 2012024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 24,
      "text": "'You shall observe this rite as a statute for you and for your sons forever.'",
      "links": "<a href='/AIV/40/26/26-28'>Matt. 26:26-28</a>; <a href='/AIV/2/12/14'>Exod. 12:14</a>",
      "comment": "Perpetual observance foreshadows the establishment of continual worship and remembrance, later echoed in Christ's lasting ordinances for His followers."
    },
    {
      "pk": 2012025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 25,
      "text": "'And when you come to the land which the LORD will give you, as He has promised, you shall keep this service.'",
      "links": "<a href='/AIV/2/13/5'>Exod. 13:5</a>; <a href='/AIV/7/21/1-25'>Judg. 21:1-25</a>",
      "comment": "The command to continue the ritual in the Promised Land points to maintaining covenant relationship even after deliverance."
    },
    {
      "pk": 2012026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 26,
      "text": "'And when your children ask you, \"What do you mean by this service?\"'",
      "links": "<a href='/AIV/2/13/14'>Exod. 13:14</a>; <a href='/AIV/5/6/20'>Deut. 6:20'</a>",
      "comment": "Teaching future generations about worship and ritual practice is underlined, reflecting the enduring tradition of faith through instruction."
    },
    {
      "pk": 2012027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 27,
      "text": "'You shall say, \"It is the sacrifice of the LORD's Passover, for He passed over the houses of the people of Israel in Egypt, when He struck the Egyptians but spared our houses.\"' And the people bowed their heads and worshiped.",
      "links": "<a href='/AIV/2/13/15'>Exod. 13:15</a>; <a href='/AIV/41/10/45'>Mark 10:45</a>",
      "comment": "'Sacrifice' language here centralizes atonement and divine mercy, echoed in Christ's sacrificial death. Bowing in worship indicates reverence before God's gracious act."
    },
    {
      "pk": 2012028,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 28,
      "text": "Then the people of Israel went and did so; as the LORD commanded Moses and Aaron, so they did.",
      "links": "<a href='/AIV/2/7/6'>Exod. 7:6</a>",
      "comment": "Corporate obedience reveals faithfulness to God's commands—an essential principle in the life of the community."
    },
    {
      "pk": 2012029,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 29,
      "text": "At midnight the LORD struck down all the firstborn in the land of Egypt, from the firstborn of Pharaoh who sat on his throne to the firstborn of the captive who was in the dungeon, and all the firstborn of livestock.",
      "links": "<a href='/AIV/19/78/51'>Ps. 78:51</a>; <a href='/AIV/19/135/8'>Ps. 135:8</a>",
      "comment": "The judgment at midnight marks the climactic act of deliverance and divine justice, underscoring the power and impartiality of God's will."
    },
    {
      "pk": 2012030,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 30,
      "text": "Pharaoh rose up in the night, he and all his servants and all the Egyptians; and there was a great cry in Egypt, for there was not a house where someone was not dead.",
      "links": "<a href='/AIV/19/105/38'>Ps. 105:38</a>",
      "comment": "The widespread grief of Egypt highlights both the severity of sin and the magnitude of God's deliverance for His people."
    },
    {
      "pk": 2012031,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 31,
      "text": "Then Pharaoh summoned Moses and Aaron by night and said, 'Rise up, go out from among my people, both you and the people of Israel; and go, serve the LORD, as you have said.'",
      "links": "<a href='/AIV/2/3/18'>Exod. 3:18</a>; <a href='/AIV/2/5/1'>Exod. 5:1</a>",
      "comment": "Pharaoh's surrender underlines the triumph of divine purpose over earthly opposition, echoing ultimate victory themes found in Acts."
    },
    {
      "pk": 2012032,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 32,
      "text": "'Take your flocks and your herds, as you have said, and be gone; and bless me also!'",
      "links": "<a href='/AIV/2/10/24'>Exod. 10:24'</a>",
      "comment": "Pharaoh's request for blessing acknowledges the unique relationship between Israel and God—recognition of spiritual authority."
    },
    {
      "pk": 2012033,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 33,
      "text": "The Egyptians urged the people to hasten their departure from the land, for they said, 'We shall all be dead.'",
      "links": "<a href='/AIV/2/11/1'>Exod. 11:1</a>",
      "comment": "Israel's deliverance is finalized through the desperation of the Egyptians, symbolizing liberation from bondage to sin."
    },
    {
      "pk": 2012034,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 34,
      "text": "So the people took their dough before it was leavened, their kneading bowls wrapped up in their cloaks on their shoulders.",
      "links": "<a href='/AIV/2/12/39'>Exod. 12:39</a>",
      "comment": "The unleavened dough continues the theme of haste and purity, concretely tying ritual observance to lived experience."
    },
    {
      "pk": 2012035,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 35,
      "text": "The people of Israel had also done as Moses told them, for they had asked the Egyptians for silver and gold jewelry and for clothing.",
      "links": "<a href='/AIV/2/3/22'>Exod. 3:22</a>; <a href='/AIV/2/11/2'>Exod. 11:2</a>",
      "comment": "God fulfills His promise through the plundering of Egypt, demonstrating providence and faithfulness in rewarding His people."
    },
    {
      "pk": 2012036,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 36,
      "text": "The LORD had given the people favor in the sight of the Egyptians, so they let them have what they asked. Thus they plundered the Egyptians.",
      "links": "<a href='/AIV/2/3/21-22'>Exod. 3:21-22</a>; <a href='/AIV/19/105/37'>Ps. 105:37</a>",
      "comment": "Divine favor leads to material blessing; this points to God's ability to provide for His people even through unlikely means."
    },
    {
      "pk": 2012037,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 37,
      "text": "The Israelites journeyed from Rameses to Succoth, about six hundred thousand men on foot, besides women and children.",
      "links": "<a href='/AIV/4/1/45-46'>Num. 1:45-46</a>; <a href='/AIV/2/1/7'>Exod. 1:7</a>",
      "comment": "The vast numbers demonstrate the fulfillment of God's promise to multiply Abraham's descendants (Gen. 15:5)."
    },
    {
      "pk": 2012038,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 38,
      "text": "A mixed multitude also went up with them, and very much livestock, both flocks and herds.",
      "links": "<a href='/AIV/4/11/4'>Num. 11:4</a>",
      "comment": "The presence of non-Israelites foreshadows the inclusion of Gentiles in God's redemptive plan, connecting with themes in Acts 10."
    },
    {
      "pk": 2012039,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 39,
      "text": "They baked unleavened cakes of the dough they had brought out of Egypt, for it was not leavened because they were driven out of Egypt and could not wait, nor had they prepared any provisions for themselves.",
      "links": "<a href='/AIV/2/12/34'>Exod. 12:34</a>; <a href='/AIV/5/16/3'>Deut. 16:3</a>",
      "comment": "Unleavened bread again serves as a sign of haste and faith, as well as the foundation for ongoing ritual observance."
    },
    {
      "pk": 2012040,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 40,
      "text": "The time that the people of Israel lived in Egypt was four hundred and thirty years.",
      "links": "<a href='/AIV/1/15/13-16'>Gen. 15:13-16</a>; <a href='/AIV/48/3/17'>Gal. 3:17</a>",
      "comment": "The duration fulfills prophecy (Gen. 15:13); its specificity highlights God’s sovereign timing in deliverance."
    },
    {
      "pk": 2012041,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 41,
      "text": "At the end of four hundred and thirty years, on that very day, all the hosts of the LORD went out from the land of Egypt.",
      "links": "<a href='/AIV/1/15/14'>Gen. 15:14</a>; <a href='/AIV/19/105/43'>Ps. 105:43</a>",
      "comment": "Precise fulfillment of prophecy underscores God’s faithfulness and authority; ‘hosts of the LORD’ evokes the theme of spiritual army."
    },
    {
      "pk": 2012042,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 42,
      "text": "It was a night of watching by the LORD to bring them out of Egypt. So this same night is to be kept by all the people of Israel throughout their generations as a night of watching to the LORD.",
      "links": "<a href='/AIV/2/12/14'>Exod. 12:14</a>; <a href='/AIV/42/22/19'>Luke 22:19</a>",
      "comment": "Vigil follows redemption, establishing the precedent for holy nights dedicated to God in later tradition."
    },
    {
      "pk": 2012043,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 43,
      "text": "The LORD said to Moses and Aaron, 'This is the ordinance of the Passover: no foreigner shall eat of it.'",
      "links": "<a href='/AIV/3/22/10'>Lev. 22:10</a>",
      "comment": "There is an exclusivity to sacred rites, emphasizing the necessity of belonging to the covenant community for participation in sacred meals."
    },
    {
      "pk": 2012044,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 44,
      "text": "'But every slave who is bought for money may eat of it after you have circumcised him.'",
      "links": "<a href='/AIV/1/17/12'>Gen. 17:12'</a>; <a href='/AIV/46/11/28'>1 Cor. 11:28</a>",
      "comment": "Entry into the covenant by circumcision is required for participation, showing the centrality of spiritual preparation and acceptance."
    },
    {
      "pk": 2012045,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 45,
      "text": "'No temporary resident or hired worker may eat of it.'",
      "links": "<a href='/AIV/3/22/10'>Lev. 22:10</a>",
      "comment": "Further distinction is maintained, ensuring the Passover meal remains an intimate rite of the covenant family."
    },
    {
      "pk": 2012046,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 46,
      "text": "'It must be eaten in one house; you shall not take any of the flesh outside the house, nor shall you break any of its bones.'",
      "links": "<a href='/AIV/19/34/20'>Ps. 34:20</a>; <a href='/AIV/43/19/36'>John 19:36</a>",
      "comment": "Unity and wholeness are reflected here; not breaking bones prefigures Christ’s unbroken bones on the cross (John 19:36), emphasizing the sacrificial integrity."
    },
    {
      "pk": 2012047,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 47,
      "text": "'All the congregation of Israel shall keep it.'",
      "links": "<a href='/AIV/2/12/3'>Exod. 12:3</a>",
      "comment": "The entire community’s participation is stressed, pointing to the importance of corporate worship and unity."
    },
    {
      "pk": 2012048,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 48,
      "text": "'If a stranger sojourns with you and wants to keep the Passover to the LORD, he must be circumcised; then he may come near and keep it. He shall be as a native of the land. But no uncircumcised person shall eat of it.'",
      "links": "<a href='/AIV/45/2/28-29'>Rom. 2:28-29</a>",
      "comment": "Inclusion through ritual initiation foreshadows later sacramental theology; visible signs of membership mark participation in sacred rites."
    },
    {
      "pk": 2012049,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 49,
      "text": "'There shall be one law for the native and for the stranger who sojourns among you.'",
      "links": "<a href='/AIV/4/15/16'>Num. 15:16</a>; <a href='/AIV/48/3/28'>Gal. 3:28</a>",
      "comment": "Universal law for all participants points to the eventual unity of spiritual Israel—one people under one covenant."
    },
    {
      "pk": 2012050,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 50,
      "text": "All the people of Israel did just as the LORD had commanded Moses and Aaron.",
      "links": "<a href='/AIV/2/12/28'>Exod. 12:28</a>",
      "comment": "Again, communal obedience is emphasized; it sets a model for faithful adherence to divine instruction."
    },
    {
      "pk": 2012051,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 12,
      "verse": 51,
      "text": "And on that very day the LORD brought the people of Israel out of the land of Egypt by their armies.",
      "links": "<a href='/AIV/2/12/41'>Exod. 12:41</a>; <a href='/AIV/19/105/43'>Ps. 105:43</a>",
      "comment": "The final act of deliverance affirms God’s faithfulness, resulting in a new, unified nation redeemed through sacrifice—a type and foreshadow of fuller redemption through Christ."
    }
  ],
  "translatedAt": "2025-12-24T00:52:57.568Z"
}