{
  "book": 40,
  "bookName": "Micah",
  "bookAbbreviation": "Mic",
  "chapter": 5,
  "verses": [
    {
      "pk": 40005001,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 1,
      "text": "Now gather together in troops, daughter of troops; a siege is set against us. With a rod they strike the judge of Israel on the cheek.",
      "links": "<a href='/AIV/19/2/2'>Psalm 2:2</a>; <a href='/AIV/23/50/6'>Isaiah 50:6</a>; <a href='/AIV/40/26/67'>Matt. 26:67</a>",
      "comment": "This opening presents Israel under attack and humiliation, with the 'judge' struck—a foreshadowing of the Messiah's suffering (see Isaiah 50:6 and Matthew 26:67). The term 'daughter of troops' stresses Jerusalem's vulnerability."
    },
    {
      "pk": 40005002,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 2,
      "text": "But you, Bethlehem Ephrathah, though you are least among the clans of Judah, from you will come for Me one who will rule over Israel, whose origins are from ancient days.",
      "links": "<a href='/AIV/40/2/6'>Matt. 2:6</a>; <a href='/AIV/19/132/11'>Psalm 132:11</a>; <a href='/AIV/23/9/6'>Isaiah 9:6</a>",
      "comment": "Here is one of the most direct prophecies of the Messiah's birthplace, fulfilled in Jesus Christ (Matthew 2:6). 'Ancient days' hints at preexistence and divinity (see John 1:1), establishing messianic authority beyond temporal kingship."
    },
    {
      "pk": 40005003,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 3,
      "text": "Therefore He shall give them up until the time when she who is in labor has given birth; then the rest of His brothers will return to the children of Israel.",
      "links": "<a href='/AIV/23/66/7-8'>Isaiah 66:7-8</a>; <a href='/AIV/42/2/7'>Luke 2:7</a>",
      "comment": "The prophet describes a period of waiting, symbolic of expectation before the Messiah’s arrival. The 'she who is in labor' can point to Mary (Luke 2:7), and the 'return' of the brothers evokes gathering God's people, both Jews and Gentiles."
    },
    {
      "pk": 40005004,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 4,
      "text": "He will stand and shepherd His flock in the strength of the LORD, in the majesty of the name of the LORD His God. And they will dwell secure, for now He shall be great to the ends of the earth.",
      "links": "<a href='/AIV/19/23/1'>Psalm 23:1</a>; <a href='/AIV/43/10/11'>John 10:11</a>; <a href='/AIV/23/11/10'>Isaiah 11:10</a>",
      "comment": "This verse expands on the Messiah as shepherd (Psalm 23, John 10:11). His reign is both protective and universal, reaching 'to the ends of the earth.' The shepherd imagery suggests intimate, sustaining care for God’s people, continuing through the ages."
    },
    {
      "pk": 40005005,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 5,
      "text": "And this one will be peace. When Assyria invades our land and treads our palaces, then we will raise against him seven shepherds and eight princes among men.",
      "links": "<a href='/AIV/23/9/6'>Isaiah 9:6</a>; <a href='/AIV/45/5/1'>Romans 5:1</a>",
      "comment": "Christ is described as 'peace' (Isaiah 9:6), the source of reconciliation. The 'seven shepherds, eight princes' symbolize abundance and completeness of leadership. His peace overcomes external threats—hinting at the Church united under firm governance."
    },
    {
      "pk": 40005006,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 6,
      "text": "They will shepherd Assyria with the sword, and the land of Nimrod with drawn blades. He will deliver us from Assyria when it invades our land and treads on our territory.",
      "links": "<a href='/AIV/01/10/9-11'>Genesis 10:9-11</a>; <a href='/AIV/23/14/25'>Isaiah 14:25</a>",
      "comment": "Here, Israel's enemies are depicted symbolically. The Messiah brings victory, protecting God’s people and establishing secure boundaries. The spiritual interpretation connects to Christ's triumph over sin and evil."
    },
    {
      "pk": 40005007,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 7,
      "text": "Then the remnant of Jacob shall be in the midst of many peoples, like dew from the LORD, like showers on the grass that do not wait for man nor depend on mankind.",
      "links": "<a href='/AIV/28/14/5'>Hosea 14:5</a>; <a href='/AIV/40/13/38'>Matthew 13:38</a>",
      "comment": "Micah describes the scattered faithful as a blessing among the nations, symbolized by dew—a gift from above. This supports the idea that God’s people become a spiritual influence worldwide, not dependent on human power but God’s providence."
    },
    {
      "pk": 40005008,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 8,
      "text": "And the remnant of Jacob will be among the nations, in the midst of many peoples, like a lion among the beasts of the forest, like a young lion among flocks of sheep, who, when he passes through, tramples and tears as he goes, and there is none to deliver.",
      "links": "<a href='/AIV/04/24/9'>Numbers 24:9</a>; <a href='/AIV/19/22/21'>Psalm 22:21</a>",
      "comment": "The remnant is both gentle (dew, v.7) and powerful (lion, v.8), highlighting dual aspects of God’s work through His people: blessing and authority. The Church’s spiritual mission has both humility and strength."
    },
    {
      "pk": 40005009,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 9,
      "text": "Your hand will be lifted up against your adversaries, and all your enemies will be cut off.",
      "links": "<a href='/AIV/19/18/37'>Psalm 18:37</a>; <a href='/AIV/23/54/17'>Isaiah 54:17</a>",
      "comment": "Ultimate victory is promised over enemies. While literal in historical context, spiritually it foreshadows triumphant defense against all spiritual adversaries (see Ephesians 6:12 for spiritual warfare)."
    },
    {
      "pk": 40005010,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 10,
      "text": "In that day, declares the LORD: I will remove your horses from your midst and destroy your chariots.",
      "links": "<a href='/AIV/23/2/7'>Isaiah 2:7</a>; <a href='/AIV/19/20/7'>Psalm 20:7</a>",
      "comment": "God removes worldly power—horses and chariots—so His people rely on Him, not human strength. This aligns with Christian teaching on abandoning reliance on earthly means for spiritual victory."
    },
    {
      "pk": 40005011,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 11,
      "text": "And I will destroy the cities of your land and throw down all your strongholds.",
      "links": "<a href='/AIV/20/21/22'>Proverbs 21:22</a>; <a href='/AIV/46/10/4'>2 Corinthians 10:4</a>",
      "comment": "Here, God purifies His people, removing their self-made defenses. The spiritual application reminds Christians to depend entirely on divine grace and protection."
    },
    {
      "pk": 40005012,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 12,
      "text": "And I will cut off witchcrafts from your hand, and you shall have no more soothsayers.",
      "links": "<a href='/AIV/05/18/10-12'>Deuteronomy 18:10-12</a>; <a href='/AIV/44/8/9'>Acts 8:9</a>",
      "comment": "This verse bans all forms of divination, reinforcing that spiritual guidance comes solely from God. It connects with biblical calls to reject occult practices and seek authentic revelation."
    },
    {
      "pk": 40005013,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 13,
      "text": "I will also cut off your carved images and your pillars from among you; you shall no longer worship the work of your hands.",
      "links": "<a href='/AIV/02/20/3-4'>Exodus 20:3-4</a>; <a href='/AIV/45/1/23'>Romans 1:23</a>",
      "comment": "False worship is thoroughly abolished here. The passage calls believers to put away all idolatry and to worship God alone. This supports the tradition of icons and sacred art as veneration, not idolatry—a historic point of Christian practice."
    },
    {
      "pk": 40005014,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 14,
      "text": "I will uproot your Asherah poles from among you and destroy your cities.",
      "links": "<a href='/AIV/05/12/3'>Deuteronomy 12:3</a>; <a href='/AIV/07/6/25'>Judges 6:25</a>",
      "comment": "The removal of Asherah poles (symbols of pagan worship) continues the purification theme from the previous verses, aligning with the call to pure, undivided worship."
    },
    {
      "pk": 40005015,
      "translation": "AIV",
      "book": 40,
      "bookName": "Micah",
      "bookAbbreviation": "Mic",
      "chapter": 5,
      "verse": 15,
      "text": "And I will take vengeance in anger and wrath on the nations that have not listened.",
      "links": "<a href='/AIV/19/2/12'>Psalm 2:12</a>; <a href='/AIV/66/19/15'>Revelation 19:15</a>",
      "comment": "The justice of God is emphasized as final for those who refuse His call. Spiritual meaning includes the ultimate restoration and protection of those who faithfully heed God’s Word, as seen in the unity and perseverance of the one apostolic Church."
    }
  ],
  "translatedAt": "2025-12-24T09:48:52.985Z"
}