{
  "book": "Ezra",
  "bookAbbreviation": "Ezra",
  "chapter": 1,
  "verses": [
    {
      "pk": 1273001,
      "translation": "AIV",
      "book": 15,
      "chapter": 1,
      "verse": 1,
      "text": "In the first year of Cyrus king of Persia, so that the word of the LORD by the mouth of Jeremiah might be fulfilled, the LORD stirred up the spirit of Cyrus king of Persia, so that he made a proclamation throughout all his kingdom and also put it in writing:",
      "links": "<a href='/AIV/24/29/10'>Jer. 29:10</a>; <a href='/AIV/23/44/28'>Isa. 44:28</a>",
      "comment": "This verse emphasizes the sovereignty of God over pagan kings and the fulfillment of prophecy. The stirring of Cyrus shows that God can use anyone for His redemptive purposes, foreshadowing salvation for all nations. The literal fulfillment of Jeremiah's prophecy affirms the trustworthiness of God's promises. The written decree highlights the importance of written tradition, a foundation for the continuing revelation of God's plan."
    },
    {
      "pk": 1273002,
      "translation": "AIV",
      "book": 15,
      "chapter": 1,
      "verse": 2,
      "text": "Thus says Cyrus king of Persia: The LORD, the God of heaven, has given me all the kingdoms of the earth, and he has charged me to build him a house at Jerusalem, which is in Judah.",
      "links": "<a href='/AIV/23/45/1'>Isa. 45:1</a>; <a href='/AIV/2/25/8'>Ex. 25:8</a>",
      "comment": "Cyrus acknowledges God's authority and instruction to rebuild the temple. This reflects the recognition of the one true God by a foreign king. Building a house for God in Jerusalem points toward the central role of temple worship, which later finds its fulfillment in Christ as the true Temple (see <a href='/AIV/43/2/19-21'>John 2:19-21</a>)."
    },
    {
      "pk": 1273003,
      "translation": "AIV",
      "book": 15,
      "chapter": 1,
      "verse": 3,
      "text": "Whoever among you is of all his people, may his God be with him, and let him go up to Jerusalem, which is in Judah, and rebuild the house of the LORD, the God of Israel—he is the God who is in Jerusalem.",
      "links": "<a href='/AIV/16/2/20'>Neh. 2:20</a>; <a href='/AIV/19/122/1-2'>Ps. 122:1-2</a>",
      "comment": "The invitation includes all of God's people, calling them to return and restore true worship, a theme fulfilled in the gathering of God's people in unity and worship of God as the one true Lord. This anticipates the spiritual gathering of believers in the new covenant. The physical rebuilding hints at the eventual spiritual temple built through Christ and his Church."
    },
    {
      "pk": 1273004,
      "translation": "AIV",
      "book": 15,
      "chapter": 1,
      "verse": 4,
      "text": "And let every survivor, in whatever place he resides, be helped by the men of his place with silver and gold, with goods and animals, besides freewill offerings for the house of God that is in Jerusalem.",
      "links": "<a href='/AIV/2/35/5'>Ex. 35:5</a>; <a href='/AIV/15/7/15-16'>Ezra 7:15-16</a>",
      "comment": "Here, the community supports those returning both materially and spiritually. The language reflects the Exodus, encouraging freewill offerings and participation in the rebuilding effort. This foreshadows both material generosity and the sacrificial life of the faithful in the New Testament."
    },
    {
      "pk": 1273005,
      "translation": "AIV",
      "book": 15,
      "chapter": 1,
      "verse": 5,
      "text": "Then the family heads of Judah and Benjamin, and the priests and the Levites, everyone whose spirit God had stirred, arose to go up and rebuild the house of the LORD that is in Jerusalem.",
      "links": "<a href='/AIV/16/11/3'>Neh. 11:3</a>; <a href='/AIV/2/35/21-22'>Ex. 35:21-22</a>",
      "comment": "God's initiative moves the leaders and spiritual authorities, indicating the essential role of divinely appointed leadership and ordained ministers in faithful worship and restoration. The active participation of priests and Levites prefigures the continuity of ordained service in leading God's people."
    },
    {
      "pk": 1273006,
      "translation": "AIV",
      "book": 15,
      "chapter": 1,
      "verse": 6,
      "text": "All who were around them strengthened their hands with vessels of silver, with gold, with goods, and with animals, and with precious things, besides all that was freely offered.",
      "links": "<a href='/AIV/2/12/35-36'>Ex. 12:35-36</a>",
      "comment": "This verse mirrors the Exodus, when the Israelites left Egypt with gifts from their neighbors. It also points toward the unity and mutual support expected among believers, showing that service to God often involves the generous contribution of the entire community."
    },
    {
      "pk": 1273007,
      "translation": "AIV",
      "book": 15,
      "chapter": 1,
      "verse": 7,
      "text": "Cyrus the king also brought out the vessels of the house of the LORD that Nebuchadnezzar had carried away from Jerusalem and had placed in the house of his gods.",
      "links": "<a href='/AIV/27/1/2'>Dan. 1:2</a>; <a href='/AIV/14/36/7'>2 Chr. 36:7</a>",
      "comment": "The restoration of the temple vessels, once lost in exile, symbolizes restoration and continuity of sacred tradition. These items were dedicated for divine worship, an anticipation of the return to proper liturgical practice."
    },
    {
      "pk": 1273008,
      "translation": "AIV",
      "book": 15,
      "chapter": 1,
      "verse": 8,
      "text": "Cyrus king of Persia brought these out in the charge of Mithredath the treasurer, who counted them out to Sheshbazzar the prince of Judah.",
      "links": "<a href='/AIV/15/5/14'>Ezra 5:14</a>",
      "comment": "Cyrus entrusts the sacred vessels to responsible stewards, reflecting the necessity for trustworthy stewardship of God's treasures and the proper transmission of sacred things. Sheshbazzar, as a leader, points to the importance of recognized leadership in restoring worship."
    },
    {
      "pk": 1273009,
      "translation": "AIV",
      "book": 15,
      "chapter": 1,
      "verse": 9,
      "text": "And this was their number: thirty gold basins, one thousand silver basins, twenty-nine knives,",
      "links": "<a href='/AIV/27/5/2'>Dan. 5:2</a>",
      "comment": "The careful tally shows reverence for sacred vessels and the necessity of order and accountability in worship. Attention to details of worship becomes a model for reverent service to God."
    },
    {
      "pk": 1273010,
      "translation": "AIV",
      "book": 15,
      "chapter": 1,
      "verse": 10,
      "text": "thirty gold bowls, four hundred ten silver bowls of a second kind, and one thousand other vessels.",
      "links": "",
      "comment": "The listing continues, emphasizing the variety and abundance of items set apart for God's worship. This dedication of material resources points also to the spiritual truth that all aspects of life are to be offered to God."
    },
    {
      "pk": 1273011,
      "translation": "AIV",
      "book": 15,
      "chapter": 1,
      "verse": 11,
      "text": "All the vessels of gold and silver were five thousand four hundred. All these did Sheshbazzar bring up when the exiles were brought up from Babylon to Jerusalem.",
      "links": "<a href='/AIV/14/36/18'>2 Chr. 36:18</a>",
      "comment": "The return of the exiles along with the sacred vessels completes the restoration, a sign of God’s faithfulness and fulfillment of His promises. This marks an important new beginning, anticipating Christ’s ultimate gathering of God’s people for true worship and a new covenant."
    }
  ],
  "translatedAt": "2025-12-23T09:02:00.979Z"
}