{
  "book": "Ezra",
  "bookAbbreviation": "Ezra",
  "chapter": 5,
  "verses": [
    {
      "pk": 1505001,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 1,
      "text": "Now the prophets Haggai and Zechariah son of Iddo prophesied to the Jews in Judah and Jerusalem in the name of the God of Israel who was over them.",
      "links": "<a href='/AIV/37/1/1'>Hag. 1:1</a>; <a href='/AIV/38/1/1'>Zech. 1:1</a>",
      "comment": "Haggai and Zechariah are raised at a critical moment to speak God’s will, emphasizing the guiding role of the prophetic office when Israel rebuilds after exile. God’s care and involvement in the restoration parallels His continued leadership over His people (see 2 Chr. 36:22-23)."
    },
    {
      "pk": 1505002,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 2,
      "text": "Then Zerubbabel the son of Shealtiel and Jeshua the son of Jozadak arose and began to rebuild the house of God that is in Jerusalem. And the prophets of God were with them, supporting them.",
      "links": "<a href='/AIV/15/3/8'>Ezra 3:8</a>; <a href='/AIV/37/1/12-14'>Hag. 1:12-14</a>",
      "comment": "Leadership and support from prophets and priests are essential for true worship and temple restoration. The involvement of a high priest and a Davidic descendant illustrates a united priestly-kingly leadership foreshadowing Christ, who is both High Priest and King (Heb. 4:14-16; Acts 2:30)."
    },
    {
      "pk": 1505003,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 3,
      "text": "At the same time, Tattenai, governor of the province Beyond the River, and Shethar-bozenai and their associates came to them and said, 'Who gave you a decree to build this house and finish this structure?'",
      "links": "<a href='/AIV/15/4/12'>Ezra 4:12</a>; <a href='/AIV/16/2/19'>Neh. 2:19</a>",
      "comment": "Foreign officials challenge the authority of God's people, showing external resistance to God's work. Defending the legitimacy of the true worship and temple is a major scriptural theme, reminiscent of opposition to Christ's authority (Mark 11:28)."
    },
    {
      "pk": 1505004,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 4,
      "text": "Then they asked them as follows: 'What are the names of the men who are building this building?'",
      "links": "",
      "comment": "Request for names demonstrates accountability in the community and among leadership. God’s chosen representatives often face scrutiny and must answer before worldly authorities, paralleling the apostles in Acts 4:7."
    },
    {
      "pk": 1505005,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 5,
      "text": "But the eye of their God was upon the elders of the Jews, so they did not stop them until a report should reach Darius and a written reply be received concerning it.",
      "links": "<a href='/AIV/15/7/6'>Ezra 7:6</a>; <a href='/AIV/19/34/15'>Ps. 34:15</a>",
      "comment": "God’s providence protects the faithful, ensuring the work continues. The concept of God's watchful eye is frequent (see Psalm 33:18), reinforcing trust in divine oversight even amidst trials— a spiritual truth mirrored in the Church’s perseverance through history."
    },
    {
      "pk": 1505006,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 6,
      "text": "This is the copy of the letter that Tattenai, the governor of the province Beyond the River, and Shethar-bozenai and their associates who were in the province Beyond the River sent to King Darius.",
      "links": "",
      "comment": "The inclusion of an official letter reflects the historical accuracy of Ezra’s account and the concern for records and legitimacy, paralleling the Church’s careful preservation and transmission of sacred tradition for authoritative reference."
    },
    {
      "pk": 1505007,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 7,
      "text": "They sent him a report, in which was written as follows: 'To King Darius, all peace.'",
      "links": "",
      "comment": "The respectful approach to the king highlights the importance of lawful appeal when religious freedom is threatened. The structure of the letter conveys the importance of order, hierarchy, and respectful communication with civil authorities (see Rom. 13:1-7)."
    },
    {
      "pk": 1505008,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 8,
      "text": "'Let it be known to the king that we went to the province of Judah, to the house of the great God; it is being built with large stones, and timber is being set in the walls. This work goes on diligently and prospers in their hands.'",
      "links": "<a href='/AIV/10/7/27'>2 Sam. 7:27</a>; <a href='/AIV/16/4/6'>Neh. 4:6</a>",
      "comment": "Acknowledgment of diligent and skillful labor in building God’s house. The 'great God' is a public recognition of the God of Israel’s supremacy, with undertones preparing for the universal worship modeled in the Church (Acts 17:23-24)."
    },
    {
      "pk": 1505009,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 9,
      "text": "'Then we asked those elders, \"Who gave you a decree to build this house and to finish this structure?\"'",
      "links": "",
      "comment": "The repetition of the authority question underscores proper authorization in God’s work. Order, authority, and legitimate succession are recurring themes— later fulfilled and maintained through the physical and spiritual building up of the Church (Eph. 2:20)."
    },
    {
      "pk": 1505010,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 10,
      "text": "'We also asked them their names for your information, so that we might write down the names of their leaders for your records.'",
      "links": "",
      "comment": "Written records and identifying leaders reveal the early pattern for visible structure and accountability in the people of God— a principle continued in apostolic succession and the formal listing of those tasked with sacred ministry (see Acts 1:23, 6:5-6)."
    },
    {
      "pk": 1505011,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 11,
      "text": "'And this was their reply to us: \"We are the servants of the God of heaven and earth, and we are rebuilding the house that was built many years ago, which a great king of Israel built and finished.\"'",
      "links": "<a href='/AIV/11/6/1'>1 Kgs. 6:1</a>; <a href='/AIV/14/2/12'>2 Chr. 2:12</a>",
      "comment": "The builders’ humility ('servants of the God of heaven and earth') and mention of the original temple link their present action to the faith of their ancestors— a continuity central to salvation history and the Church’s visible unity through time."
    },
    {
      "pk": 1505012,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 12,
      "text": "'But because our fathers angered the God of heaven, He gave them into the hand of Nebuchadnezzar, king of Babylon, the Chaldean, who destroyed this house and carried the people away to Babylon.'",
      "links": "<a href='/AIV/14/36/16-20'>2 Chr. 36:16-20</a>",
      "comment": "Frank confession of past sins recalls God’s justice and mercy. Recognition of God’s chastisement and discipline for Israel’s unfaithfulness is a recurring theme, paralleled by the call to repentance and the need for reconciliation seen in the new covenant (see Luke 15:11-32; 1 John 1:9)."
    },
    {
      "pk": 1505013,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 13,
      "text": "'However, in the first year of Cyrus king of Babylon, King Cyrus issued a decree to rebuild this house of God.'",
      "links": "<a href='/AIV/15/1/1-2'>Ezra 1:1-2</a>; <a href='/AIV/23/44/28'>Isa. 44:28</a>",
      "comment": "Restoration is made possible through Cyrus, a foreign king, whom God calls 'His shepherd' in Isaiah—a prophecy and type of Christ’s universal kingship (Isa. 45:1). The role of a king in issuing the decree echoes the authority to guide God’s people and initiate restoration."
    },
    {
      "pk": 1505014,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 14,
      "text": "'Also the gold and silver vessels of the house of God, which Nebuchadnezzar had taken out of the temple in Jerusalem and brought into the temple of Babylon, these King Cyrus took out from the temple of Babylon, and they were delivered to one named Sheshbazzar, whom he had made governor.'",
      "links": "<a href='/AIV/15/1/7-8'>Ezra 1:7-8</a>",
      "comment": "The restoration of sacred vessels mirrors the continuity of true worship, showing the importance of liturgical continuity, set-apart objects, and their rightful place—analogous to tradition and sacred practice preserved through the life of the Church."
    },
    {
      "pk": 1505015,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 15,
      "text": "'He said to him, \"Take these vessels. Go, put them in the temple that is in Jerusalem, and let the house of God be rebuilt on its site.\"'",
      "links": "<a href='/AIV/15/6/5'>Ezra 6:5</a>",
      "comment": "Direct command to restore the temple and place the vessels back highlights faithfulness to God’s instructions—pointing to the necessity of both valid worship and proper sacred space, foreshadowing Christ’s reference to His own body as a new temple (John 2:19-21)."
    },
    {
      "pk": 1505016,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 16,
      "text": "'Then Sheshbazzar came and laid the foundations of the house of God that is in Jerusalem. From that time until now it has been in building, and it is not yet finished.'",
      "links": "<a href='/AIV/15/3/8-10'>Ezra 3:8-10</a>",
      "comment": "Laying the foundation is symbolic not only for this building, but of the foundation of the faith—illustrative that God’s plan unfolds over time. This foundation-finish motif recurs in the New Testament, with Christ and the apostles as the true foundation (Eph. 2:20; 1 Cor. 3:11)."
    },
    {
      "pk": 1505017,
      "translation": "AIV",
      "book": 15,
      "chapter": 5,
      "verse": 17,
      "text": "'So now, if it seems good to the king, let search be made in the royal archives in Babylon to see whether a decree was indeed issued by King Cyrus for the rebuilding of this house of God in Jerusalem. And let the king send us his pleasure in this matter.'",
      "links": "<a href='/AIV/15/6/1-2'>Ezra 6:1-2</a>",
      "comment": "Requesting a search of authoritative records illustrates careful discernment and respect for true authority. It models how God's people appeal to tradition and written record to confirm right practice and legitimacy, pointing toward divine guidance through preserved truth (see John 16:13)."
    }
  ],
  "translatedAt": "2025-12-23T09:04:16.979Z"
}