{
  "book": "Ezra",
  "bookAbbreviation": "Ezra",
  "chapter": 6,
  "verses": [
    {
      "pk": 2000601,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 1,
      "text": "Then King Darius gave an order, and a search was made in the archives where documents were stored in Babylon.",
      "links": "<a href='/AIV/15/5/17'>Ezra 5:17</a>; <a href='/AIV/17/2/23'>Esth. 2:23</a>",
      "comment": "King Darius' respect for records shows the importance of remembering God's works. The search for the decree parallels the church’s careful preservation of doctrine and Scripture."
    },
    {
      "pk": 2000602,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 2,
      "text": "A scroll was found in the fortress of Ecbatana, in the province of Media, and this was written on it: A memorandum.",
      "links": "<a href='/AIV/15/6/1'>Ezra 6:1</a>; <a href='/AIV/05/17/18'>Deut. 17:18</a>",
      "comment": "The discovery of Cyrus’ decree in a distant place highlights God’s providence in preserving His promises throughout generations and nations."
    },
    {
      "pk": 2000603,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 3,
      "text": "In the first year of King Cyrus, King Cyrus issued a decree: Concerning the house of God in Jerusalem, let the house be rebuilt, the place where they offer sacrifices, and let its foundations be strongly laid. Its height shall be sixty cubits, its width sixty cubits,",
      "links": "<a href='/AIV/15/1/1-4'>Ezra 1:1-4</a>; <a href='/AIV/27/6/26'>Dan. 6:26</a>",
      "comment": "The explicit command for the Temple’s restoration prefigures the centrality of worship and sacrifice in salvation history, with the Temple foreshadowing Christ’s Body and the liturgy."
    },
    {
      "pk": 2000604,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 4,
      "text": "with three layers of large stones and one layer of new timber. Let the cost be paid from the king’s treasury.",
      "links": "<a href='/AIV/16/2/8'>Neh. 2:8</a>; <a href='/AIV/01/12/36'>Exod. 12:36</a>",
      "comment": "The pagans’ resources being used to rebuild the Temple illustrates God’s sovereignty and the principle that all material goods are ultimately at His disposal for holy purposes."
    },
    {
      "pk": 2000605,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 5,
      "text": "Also let the gold and silver vessels of the house of God, which Nebuchadnezzar took from the temple in Jerusalem and brought to Babylon, be restored and brought back to the temple in Jerusalem, each to its place. Put them in the house of God.",
      "links": "<a href='/AIV/15/1/7-11'>Ezra 1:7–11</a>; <a href='/AIV/27/5/2'>Dan. 5:2</a>",
      "comment": "The restoration of sacred vessels shows reverence for holy things and underlines the necessity of proper worship using consecrated elements."
    },
    {
      "pk": 2000606,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 6,
      "text": "Now therefore, Tattenai, governor of the province Beyond the River, Shethar-bozenai, and your associates, the officials who are in the province Beyond the River, keep far away from there.",
      "links": "<a href='/AIV/15/5/3-6'>Ezra 5:3-6</a>",
      "comment": "Darius commands the local officials not to hinder God’s work, reflecting divine authority overriding human opposition, as seen throughout the history of redemption."
    },
    {
      "pk": 2000607,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 7,
      "text": "Let the work of this house of God alone; let the governor of the Jews and the elders of the Jews rebuild this house of God on its site.",
      "links": "<a href='/AIV/15/5/10-11'>Ezra 5:10-11</a>",
      "comment": "The right of the Jewish leaders to govern divine worship reveals the principle of apostolic authority guiding the Church’s teaching and worship."
    },
    {
      "pk": 2000608,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 8,
      "text": "Moreover, I make a decree regarding what you shall do for these elders of the Jews for the rebuilding of this house of God: The cost is to be paid immediately and in full from the royal revenue, from the tribute of the province Beyond the River, that the work be not hindered.",
      "links": "<a href='/AIV/15/7/20-22'>Ezra 7:20-22</a>; <a href='/AIV/16/2/7-8'>Neh. 2:7-8</a>",
      "comment": "The king ensures nothing impedes God’s work, reflecting God’s power even over secular rulers, and a foreshadowing of the principle that the state should serve, not rule, the spiritual good."
    },
    {
      "pk": 2000609,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 9,
      "text": "And whatever is needed—young bulls, rams, lambs for burnt offerings to the God of heaven, wheat, salt, wine, or oil, as the priests in Jerusalem require—let that be given to them day by day without fail,",
      "links": "<a href='/AIV/03/1/1-3'>Lev. 1:1-3</a>; <a href='/AIV/04/28/3-8'>Num. 28:3-8</a>",
      "comment": "The provision for continual offering anticipates the importance of sacrificial worship, which reached its fulfillment in the perpetual Sacrifice of Christ (see Hebrews 10:12)."
    },
    {
      "pk": 2000610,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 10,
      "text": "so that they may offer pleasing sacrifices to the God of heaven and pray for the life of the king and his sons.",
      "links": "<a href='/AIV/01/20/17'>Gen. 20:17</a>; <a href='/AIV/54/2/2'>1 Tim. 2:2</a>",
      "comment": "Intercessory prayer for secular leaders is an ancient and continuing practice (cf. 1 Tim. 2:1–2), rooted in the worship of God, which benefits all people."
    },
    {
      "pk": 2000611,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 11,
      "text": "I also make a decree that if anyone alters this decree, a beam shall be pulled out from his house and he shall be impaled on it, and his house made a dunghill.",
      "links": "<a href='/AIV/17/7/9-10'>Esth. 7:9-10</a>; <a href='/AIV/27/6/24'>Dan. 6:24</a>",
      "comment": "The severe penalty for opposing the sacred decree underscores the seriousness of tampering with divine worship and the necessity of obedience to God’s commands."
    },
    {
      "pk": 2000612,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 12,
      "text": "May the God who has caused his Name to dwell there overthrow any king or people who shall put out a hand to alter this, or to destroy this house of God in Jerusalem. I, Darius, make this decree. Let it be done with all diligence.",
      "links": "<a href='/AIV/05/12/5'>Deut. 12:5</a>; <a href='/AIV/12/19/35'>2 Kgs. 19:35</a>",
      "comment": "God’s Name dwelling in the Temple foreshadows the dwelling of God with humanity in Christ and in the communion of believers."
    },
    {
      "pk": 2000613,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 13,
      "text": "Then, according to the word sent by King Darius, Tattenai, governor of the province Beyond the River, Shethar-bozenai, and their associates did with all diligence what King Darius had ordered.",
      "links": "<a href='/AIV/15/6/6-7'>Ezra 6:6-7</a>",
      "comment": "The obedience of the officials demonstrates the effect of the king’s command and the importance of faithful implementation of divine directives."
    },
    {
      "pk": 2000614,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 14,
      "text": "And the elders of the Jews built and prospered, through the prophesying of Haggai the prophet and Zechariah the son of Iddo. They finished the building by the command of the God of Israel and by the decree of Cyrus, Darius, and Artaxerxes king of Persia.",
      "links": "<a href='/AIV/37/1/1'>Hag. 1:1</a>; <a href='/AIV/15/5/1-2'>Ezra 5:1-2</a>",
      "comment": "The prophetic word works alongside authority: tradition and prophetic guidance combined, which prefigures how Scripture and tradition work together in guiding God’s people."
    },
    {
      "pk": 2000615,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 15,
      "text": "And this house was finished on the third day of the month of Adar, in the sixth year of the reign of King Darius.",
      "links": "<a href='/AIV/37/2/18'>Hag. 2:18</a>",
      "comment": "The date marks fulfillment of prophecy and the completion of a period of restoration, foreshadowing the ultimate restoration in the New Covenant."
    },
    {
      "pk": 2000616,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 16,
      "text": "And the children of Israel, the priests, the Levites, and the rest of the exiles celebrated the dedication of this house of God with joy.",
      "links": "<a href='/AIV/12/23/21-23'>2 Kgs. 23:21-23</a>; <a href='/AIV/16/12/27'>Neh. 12:27</a>",
      "comment": "The unity of all classes in worship and the joyful dedication highlight the communal nature of worship, echoing the unity of believers gathered for sacred mysteries."
    },
    {
      "pk": 2000617,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 17,
      "text": "They offered at the dedication of this house of God one hundred bulls, two hundred rams, four hundred lambs; and as a sin offering for all Israel, twelve male goats, according to the number of the tribes of Israel.",
      "links": "<a href='/AIV/04/7/87'>Num. 7:87</a>; <a href='/AIV/03/16/15-17'>Lev. 16:15-17</a>",
      "comment": "The sacrifices symbolize both thanksgiving and atonement. The sin offering for all Israel points to Christ’s single sacrifice ‘for all’ (Hebrews 10:10), fulfilling and surpassing the Old Covenant offerings."
    },
    {
      "pk": 2000618,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 18,
      "text": "And they set the priests in their divisions and the Levites in their orders, for the service of God at Jerusalem, as it is written in the Book of Moses.",
      "links": "<a href='/AIV/04/3/6-10'>Num. 3:6-10</a>; <a href='/AIV/04/8/15-22'>Num. 8:15-22</a>",
      "comment": "Apostolic order and tradition continue in the arrangement of ministry according to divine instruction—a foundation for structure in worship."
    },
    {
      "pk": 2000619,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 19,
      "text": "On the fourteenth day of the first month, the returned exiles kept the Passover.",
      "links": "<a href='/AIV/02/12/6-11'>Exod. 12:6-11</a>; <a href='/AIV/40/26/17-19'>Matt. 26:17-19</a>",
      "comment": "Passover, the central sacred meal, is key to Israel's identity and finds its fulfillment in the Lord’s Supper, where the true Lamb is offered (see 1 Cor. 5:7)."
    },
    {
      "pk": 2000620,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 20,
      "text": "For the priests and the Levites had purified themselves together; all of them were clean. So they slaughtered the Passover lamb for all the returned exiles, for their brothers the priests, and for themselves.",
      "links": "<a href='/AIV/14/30/15-16'>2 Chr. 30:15-16</a>; <a href='/AIV/02/12/21-22'>Exod. 12:21-22</a>",
      "comment": "Purity and preparation for the sacred meal illustrate the need for worthily participating in holy mysteries (see 1 Cor. 11:27-29). The Passover points to the Eucharist as the new and eternal Passover."
    },
    {
      "pk": 2000621,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 21,
      "text": "It was eaten by the people of Israel who had returned from exile, and also by everyone who had separated himself from the uncleanness of the peoples of the land to seek the LORD, the God of Israel.",
      "links": "<a href='/AIV/15/9/1'>Ezra 9:1</a>; <a href='/AIV/02/12/48-49'>Exod. 12:48-49</a>",
      "comment": "Even converts who seek the Lord wholeheartedly are welcomed—echoing the inclusiveness of Christ’s redemption for all who believe and are initiated into the sacred mysteries."
    },
    {
      "pk": 2000622,
      "translation": "AIV",
      "book": 15,
      "chapter": 6,
      "verse": 22,
      "text": "And they kept the Feast of Unleavened Bread seven days with joy, for the LORD had made them joyful and had turned the heart of the king of Assyria to them, so that he aided them in the work of the house of God, the God of Israel.",
      "links": "<a href='/AIV/02/12/15-20'>Exod. 12:15-20</a>; <a href='/AIV/20/21/1'>Prov. 21:1</a>",
      "comment": "The Feast’s joy reflects God’s intervention in history and the ongoing support of faithful worship. God turning rulers’ hearts evokes Romans 13:1, underlining that earthly powers are subject to His purpose. The festival prefigures the lasting joy of the new covenant celebration."
    }
  ],
  "translatedAt": "2025-12-23T09:04:45.763Z"
}