{
  "book": "Ezra",
  "bookAbbreviation": "Ezra",
  "chapter": 7,
  "verses": [
    {
      "pk": 820710,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 1,
      "text": "After these events, during the reign of Artaxerxes king of Persia, Ezra son of Seraiah, son of Azariah, son of Hilkiah,",
      "links": "<a href='/AIV/15/2/2'>Ezra 2:2</a>; <a href='/AIV/16/12/1'>Neh. 12:1-7</a>",
      "comment": "Begins a new section introduced by the genealogy of Ezra, emphasizing his priestly lineage, which points to continuity with the Mosaic tradition."
    },
    {
      "pk": 820711,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 2,
      "text": "son of Shallum, son of Zadok, son of Ahitub,",
      "links": "<a href='/AIV/1/6/8'>1 Chr. 6:8-12</a>",
      "comment": "Ezra’s ancestry traces him to Zadok, a high priest, underscoring his authority for religious reforms in Jerusalem."
    },
    {
      "pk": 820712,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 3,
      "text": "son of Amariah, son of Azariah, son of Meraioth,",
      "links": "<a href='/AIV/1/6/10'>1 Chr. 6:10</a>",
      "comment": "The detailed genealogy connects Ezra to priestly tradition, granting his mission divine legitimacy and continuity."
    },
    {
      "pk": 820713,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 4,
      "text": "son of Zerahiah, son of Uzzi, son of Bukki,",
      "links": "<a href='/AIV/1/6/5'>1 Chr. 6:5-6</a>",
      "comment": "Lists further priestly ancestors, showing the deep roots of Ezra’s vocation and authority among the people."
    },
    {
      "pk": 820714,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 5,
      "text": "son of Abishua, son of Phinehas, son of Eleazar, son of Aaron the chief priest—",
      "links": "<a href='/AIV/2/6/50'>Lev. 10:16; 1 Chr. 6:3-4</a>",
      "comment": "Ezra’s lineage directly reaches back to Aaron, showing a succession of priesthood much prized for unity and tradition."
    },
    {
      "pk": 820715,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 6,
      "text": "this Ezra came up from Babylon. He was a scribe skilled in the law of Moses, which the LORD, the God of Israel, had given. The king granted him all his requests, because the hand of the LORD his God was upon him.",
      "links": "<a href='/AIV/15/5/12'>Ezra 5:12</a>; <a href='/AIV/16/2/8'>Neh. 2:8</a>",
      "comment": "Ezra’s expertise in the Law embodies both teaching and interpretation, foreshadowing the spiritual authority given to leaders for guiding the people."
    },
    {
      "pk": 820716,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 7,
      "text": "Some of the people of Israel, and of the priests, the Levites, the singers, the gatekeepers, and the temple servants traveled up to Jerusalem in the seventh year of King Artaxerxes.",
      "links": "<a href='/AIV/15/2/43-58'>Ezra 2:43-58</a>",
      "comment": "The company of returnees included key temple personnel, crucial for re-establishing proper worship, hinting at the necessity of structured liturgy."
    },
    {
      "pk": 820717,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 8,
      "text": "Ezra arrived in Jerusalem in the fifth month, in the seventh year of the king.",
      "links": "<a href='/AIV/15/7/7'>Ezra 7:7</a>",
      "comment": "God’s providence is noted in the timing and safe journey, alluding to theme of pilgrimage in faith."
    },
    {
      "pk": 820718,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 9,
      "text": "He began the journey from Babylon on the first day of the first month, and he arrived in Jerusalem on the first day of the fifth month, because the good hand of his God was upon him.",
      "links": "<a href='/AIV/15/8/31'>Ezra 8:31</a>",
      "comment": "Repeated affirmation of God’s providence accentuates trust in divine protection, linking Old Testament journey themes to spiritual pilgrimage."
    },
    {
      "pk": 820719,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 10,
      "text": "For Ezra had set his heart to study the law of the LORD and to do it, and to teach His statutes and ordinances in Israel.",
      "links": "<a href='/AIV/15/6/18'>Ezra 6:18</a>; <a href='/AIV/19/119/11'>Ps. 119:11</a>; <a href='/AIV/40/28/19-20'>Matt. 28:19-20</a>",
      "comment": "Ezra’s triple mission—study, practice, and teach—prefigures later apostolic transmission of faith, especially the teaching authority that safeguards doctrine."
    },
    {
      "pk": 820720,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 11,
      "text": "This is a copy of the letter that King Artaxerxes gave to Ezra the priest, the scribe, who is expert in the words of the commands of the LORD and His statutes for Israel:",
      "links": "<a href='/AIV/15/4/11-16'>Ezra 4:11-16</a>",
      "comment": "Presentation of royal authority invested in Ezra, demonstrating God’s use of earthly rulers in redemptive history."
    },
    {
      "pk": 820721,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 12,
      "text": "Artaxerxes, king of kings, to Ezra the priest, the scribe of the law of the God of heaven: Peace.",
      "links": "<a href='/AIV/15/4/17'>Ezra 4:17</a>",
      "comment": "The greeting 'king of kings' recalls biblical language about God's ultimate sovereignty (cf. Dan. 2:37; Rev. 19:16), connecting temporal and divine kingship."
    },
    {
      "pk": 820722,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 13,
      "text": "I issue a decree that any of the people of Israel in my kingdom, including their priests and Levites, who wish to go to Jerusalem, may go with you.",
      "links": "<a href='/AIV/15/1/3'>Ezra 1:3</a>",
      "comment": "The king’s permissive decree echoes Cyrus’s original edict for the return, further aligning secular authority with God’s saving purposes."
    },
    {
      "pk": 820723,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 14,
      "text": "You are sent by the king and his seven counselors to inquire about Judah and Jerusalem according to the law of your God, which is in your hand.",
      "links": "<a href='/AIV/17/1/14'>Esther 1:14</a>",
      "comment": "The inclusion of 'seven counselors' connects to imagery of divine perfection (see Zech. 4:10), and demonstrates collaborative governance."
    },
    {
      "pk": 820724,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 15,
      "text": "Moreover, you are to carry the silver and gold that the king and his counselors have freely given to the God of Israel, whose dwelling is in Jerusalem,",
      "links": "<a href='/AIV/15/6/8'>Ezra 6:8</a>",
      "comment": "Material gifts for sacred service affirm the importance of sacrificial giving and the centrality of the sanctuary."
    },
    {
      "pk": 820725,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 16,
      "text": "and all the silver and gold that you will find throughout the province of Babylon, together with the voluntary offerings of the people and the priests, given willingly for the house of their God in Jerusalem.",
      "links": "<a href='/AIV/15/1/4'>Ezra 1:4</a>",
      "comment": "Highlights unity in worship through collective contributions, mirroring principles of stewardship and maintenance of sacred space."
    },
    {
      "pk": 820726,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 17,
      "text": "With this money, be sure to buy bulls, rams, and lambs, and their grain offerings and drink offerings, and offer them on the altar of the house of your God in Jerusalem.",
      "links": "<a href='/AIV/3/1/3'>Lev. 1:3</a>; <a href='/AIV/4/15/8-10'>Num. 15:8-10</a>",
      "comment": "The prescribed offerings connect to Levitical worship, reflecting the enduring nature of sacramental rites as a means of communion with God."
    },
    {
      "pk": 820727,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 18,
      "text": "And whatever seems right to you and your fellow priests to do with the rest of the silver and gold, you may do according to the will of your God.",
      "links": "<a href='/AIV/15/7/16'>Ezra 7:16</a>",
      "comment": "Discretion given to priests signifies trust in spiritual authority for governing worship, hinting at dynamic living tradition."
    },
    {
      "pk": 820728,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 19,
      "text": "The vessels that have been given to you for the service of the house of your God, deliver them before the God of Jerusalem.",
      "links": "<a href='/AIV/15/1/7'>Ezra 1:7</a>",
      "comment": "Restoration of sacred vessels has deep typological resonance, prefiguring themes of restoration and reconciliation found in the New Testament (see Heb. 9:21)."
    },
    {
      "pk": 820729,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 20,
      "text": "And whatever else may be required for the house of your God, that you have occasion to supply, provide it from the royal treasury.",
      "links": "<a href='/AIV/15/6/4'>Ezra 6:4</a>",
      "comment": "Support from secular authority for religious practice symbolizes the harmony possible between legitimate earthly rule and divine guidance."
    },
    {
      "pk": 820730,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 21,
      "text": "I, Artaxerxes the king, issue a decree to all the treasurers beyond the River: Whatever Ezra the priest, the scribe of the law of the God of heaven, may require of you, let it be done exactly and without delay—",
      "links": "<a href='/AIV/15/6/8'>Ezra 6:8</a>",
      "comment": "Shows the power of written decree, ensuring the uninterrupted practice of true worship; see also Divine Law’s transcending force."
    },
    {
      "pk": 820731,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 22,
      "text": "up to one hundred talents of silver, one hundred cors of wheat, one hundred baths of wine, one hundred baths of oil, and salt without limit.",
      "links": "<a href='/AIV/15/6/9'>Ezra 6:9</a>",
      "comment": "Details of provision mirror careful statutes for worship found in the Torah; salt’s mention alludes to the covenant (see Lev. 2:13)."
    },
    {
      "pk": 820732,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 23,
      "text": "Whatever is commanded by the God of heaven, let it be done in full for the house of the God of heaven. Why should there be wrath against the realm of the king and his sons?",
      "links": "<a href='/AIV/15/6/10'>Ezra 6:10</a>",
      "comment": "Recognition that obedience to God brings blessings and averts wrath; points to universal kingship of God and spiritual consequences of worship."
    },
    {
      "pk": 820733,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 24,
      "text": "And you are also to know that no tribute, tax, or toll shall be imposed upon any of the priests, Levites, singers, gatekeepers, temple servants, or other servants of this house of God.",
      "links": "<a href='/AIV/15/7/7'>Ezra 7:7</a>",
      "comment": "Sets apart sacred ministers for God’s service, supporting their vocational dedication and practical needs, anticipating ‘set-apart’ lives for spiritual service."
    },
    {
      "pk": 820734,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 25,
      "text": "And you, Ezra, according to the wisdom of your God that is in your hand, appoint magistrates and judges to administer justice to all the people beyond the River, all who know the laws of your God. You shall teach them to those who do not know them.",
      "links": "<a href='/AIV/15/7/10'>Ezra 7:10</a>; <a href='/AIV/2/18/25'>Ex. 18:25-26</a>",
      "comment": "Ezra’s charge to appoint and teach links law, education, and authority, foreshadowing the importance of sacred teaching offices guided by divine wisdom."
    },
    {
      "pk": 820735,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 26,
      "text": "Whoever does not obey the law of your God and the law of the king, let judgment be executed promptly upon him, whether for death or banishment, confiscation of goods or imprisonment.",
      "links": "<a href='/AIV/15/10/8'>Ezra 10:8</a>",
      "comment": "The intertwining of divine and royal law shows the high standards for faithfulness, echoing the consequences of disobedience and the necessity for discipline."
    },
    {
      "pk": 820736,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 27,
      "text": "Blessed be the LORD, the God of our ancestors, who put such a thing as this in the heart of the king, to beautify the house of the LORD in Jerusalem,",
      "links": "<a href='/AIV/15/6/22'>Ezra 6:22</a>; <a href='/AIV/20/21/1'>Prov. 21:1</a>",
      "comment": "Ezra’s thanksgiving recognizes divine direction of rulers for the good of the faith community; prayer for beauty and restoration anticipates themes fulfilled in Christ."
    },
    {
      "pk": 820737,
      "translation": "AIV",
      "book": 15,
      "chapter": 7,
      "verse": 28,
      "text": "and has extended His steadfast love to me before the king and his counselors, and before all the king’s mighty officers. So I took courage, because the hand of the LORD my God was upon me, and I gathered leading men from Israel to go up with me.",
      "links": "<a href='/AIV/15/8/15'>Ezra 8:15</a>; <a href='/AIV/19/89/1'>Ps. 89:1</a>",
      "comment": "Ezra is emboldened by God’s favor, gathering leaders to embark on the mission, a model for spiritual leadership and trust, pointing ultimately to Christ as the perfect leader (cf. Heb. 2:10)."
    }
  ],
  "translatedAt": "2025-12-23T09:05:10.639Z"
}