{
  "book": 15,
  "bookName": "Ezra",
  "bookAbbreviation": "Ezra",
  "chapter": 1,
  "verses": [
    {
      "pk": 15001001,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 1,
      "verse": 1,
      "text": "In the first year of Cyrus king of Persia, so that the word of the LORD by the mouth of Jeremiah might be fulfilled, the LORD stirred up the spirit of Cyrus king of Persia, so that he made a proclamation throughout all his kingdom and also put it in writing:",
      "links": "<a href='/AIV/24/29/10'>Jer. 29:10</a>; <a href='/AIV/14/36/22-23'>2 Chron. 36:22-23</a>; <a href='/AIV/23/44/28'>Isa. 44:28</a>",
      "comment": "This introductory verse sets the fulfillment of Jeremiah's prophecy as the driving force behind the events. The emphasis is on God's sovereign power over pagan rulers for His people. See the strong parallel to 2 Chronicles 36:22-23. There is both a literal and a spiritual sense: literal fulfillment in the return, and spiritual foreshadowing of God's continual restoration of His people through obedience and leadership."
    },
    {
      "pk": 15001002,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 1,
      "verse": 2,
      "text": "“Thus says Cyrus king of Persia: The LORD, the God of heaven, has given me all the kingdoms of the earth, and he has charged me to build him a house at Jerusalem, which is in Judah.",
      "links": "<a href='/AIV/23/44/28'>Isa. 44:28</a>; <a href='/AIV/36/1/1'>Hag. 1:1</a>",
      "comment": "Cyrus recognizes the authority of the God of heaven, suggesting God's action is known even to Gentile kings. This shows the mysterious ways God can use secular authorities for His plans. Compare also Isaiah 44:28, noting the prophetic connection. In a spiritual sense, the call to build a 'house of the LORD' hints at both the continuity and sacredness of worship established in Jerusalem, patterned after divine command."
    },
    {
      "pk": 15001003,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 1,
      "verse": 3,
      "text": "Whoever among you of all his people—may his God be with him—let him go up to Jerusalem, which is in Judah, and rebuild the house of the LORD, the God of Israel—he is the God who is in Jerusalem.",
      "links": "<a href='/AIV/19/122/1-2'>Ps. 122:1-2</a>; <a href='/AIV/43/4/22'>John 4:22</a>",
      "comment": "Here the proclamation is given to 'all His people,' inviting the faithful to participate in restoring right worship. In the spiritual sense, there is a call to faithfulness and gathering for worship. Jerusalem is closely identified as the locus of God's presence, which foreshadows later New Testament themes linking the Temple and Christ as the new Temple (see John 2:19-21)."
    },
    {
      "pk": 15001004,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 1,
      "verse": 4,
      "text": "And let every survivor, in whatever place he sojourns, be helped by the men of his place with silver and gold, with goods and with livestock, besides freewill offerings for the house of God that is in Jerusalem.”",
      "links": "<a href='/AIV/02/12/35-36'>Exod. 12:35–36</a>; <a href='/AIV/16/2/8'>Neh. 2:8</a>",
      "comment": "The command for assistance recalls the Exodus, where Israelites received gifts from neighbors (Exod. 12:35-36). This generosity points to the cooperation of the wider community, and the emphasis on 'freewill offerings' highlights the need for sacrificial giving in worship, a theme found throughout Scripture."
    },
    {
      "pk": 15001005,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 1,
      "verse": 5,
      "text": "Then rose up the heads of the fathers’ houses of Judah and Benjamin, and the priests and the Levites, everyone whose spirit God had stirred to go up to rebuild the house of the LORD that is in Jerusalem.",
      "links": "<a href='/AIV/16/2/17'>Neh. 2:17</a>; <a href='/AIV/44/13/2'>Acts 13:2</a>",
      "comment": "Notice the action begins with community leaders and those involved in worship—priests and Levites—showing the importance of hierarchical structure and order in the restoration of true worship. God moves hearts, and His call often works through proper channels. This also connects with the concept of vocations and divine calling."
    },
    {
      "pk": 15001006,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 1,
      "verse": 6,
      "text": "And all those who were around them strengthened their hands with vessels of silver, with gold, with goods, with livestock, and with precious gifts, besides all that was freely offered.",
      "links": "<a href='/AIV/02/12/36'>Exod. 12:36</a>; <a href='/AIV/19/68/29'>Ps. 68:29</a>",
      "comment": "The community's generous support for the returnees and the worship of God echoes themes of unity and mutual responsibility. It demonstrates how material resources are dedicated to spiritual purposes, paralleling later Christian practices of almsgiving and support for sacred spaces."
    },
    {
      "pk": 15001007,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 1,
      "verse": 7,
      "text": "Cyrus the king also brought out the vessels of the house of the LORD, which Nebuchadnezzar had carried away from Jerusalem and placed in the house of his gods.",
      "links": "<a href='/AIV/14/36/18'>2 Chron. 36:18</a>; <a href='/AIV/27/5/2-3'>Dan. 5:2-3</a>",
      "comment": "The return of the sacred vessels taken by Nebuchadnezzar marks a tangible restoration of what was lost in the exile. The mention of the 'house of his gods' also contrasts the one true God with the false pagan deities. The re-sanctification of these items foreshadows themes of purification and restoration."
    },
    {
      "pk": 15001008,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 1,
      "verse": 8,
      "text": "Cyrus king of Persia brought these out in charge of Mithredath the treasurer, who counted them out to Sheshbazzar the prince of Judah.",
      "links": "<a href='/AIV/14/36/23'>2 Chron. 36:23</a>; <a href='/AIV/15/5/14'>Ezra 5:14</a>",
      "comment": "Precise accounting of sacred objects reinstates a sense of order and reverence toward God's worship. The mention of Sheshbazzar as 'prince of Judah' shows recognition of legitimate authority in leading God’s people, emphasizing both continuity and right leadership."
    },
    {
      "pk": 15001009,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 1,
      "verse": 9,
      "text": "And this was the number of them: thirty gold basins, one thousand silver basins, twenty-nine censers,",
      "links": "<a href='/AIV/02/25/29'>Exod. 25:29</a>",
      "comment": "Careful listing of these items mirrors the instructions for tabernacle vessels in Exodus. The specificity and reverence toward these vessels show the importance of tradition and continuity in worship practices."
    },
    {
      "pk": 15001010,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 1,
      "verse": 10,
      "text": "thirty gold bowls, four hundred ten silver bowls of a second kind, and one thousand other vessels.",
      "links": "<a href='/AIV/04/7/84-88'>Num. 7:84–88</a>",
      "comment": "The continued list reflects the respect for liturgical specifications, highlighting tradition, order, and proper use in the service of the LORD."
    },
    {
      "pk": 15001011,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 1,
      "verse": 11,
      "text": "All the vessels of gold and of silver were five thousand four hundred. Sheshbazzar brought all these up when the exiles were brought up from Babylon to Jerusalem.",
      "links": "<a href='/AIV/15/8/25-30'>Ezra 8:25-30</a>; <a href='/AIV/24/27/21-22'>Jer. 27:21-22</a>",
      "comment": "The large number of returned vessels underlines the completeness of restoration for worship, the reverence for sacred tradition, and the continuity from before the exile. Theologically, this anticipates the later emphasis on physical continuity in worship and leadership, which holds significance for the unity and historic faith of God's people."
    }
  ],
  "translatedAt": "2025-12-24T04:40:22.595Z"
}