{
  "book": "Ezra",
  "bookAbbreviation": "Ezra",
  "chapter": 4,
  "verses": [
    {
      "pk": 400401,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 1,
      "text": "When the enemies of Judah and Benjamin heard that the returned exiles were building a temple for the LORD, the God of Israel,",
      "links": "<a href='/AIV/16/2/19'>Neh. 2:19</a>; <a href='/AIV/15/3/8'>Ezra 3:8</a>",
      "comment": "The text highlights opposition from local people as the Jews begin restoring true worship. The theme of enmity parallels spiritual battles throughout salvation history."
    },
    {
      "pk": 400402,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 2,
      "text": "They came to Zerubbabel, Jeshua, and the leaders, and said, 'Let us build with you, for we seek your God as you do, and we have been sacrificing to Him since the days of Esarhaddon king of Assyria, who brought us here.'",
      "links": "<a href='/AIV/12/17/24'>2 Kings 17:24</a>; <a href='/AIV/15/2/2'>Ezra 2:2</a>",
      "comment": "These outsiders claimed worship of the same God, but their mixed practices implied syncretism. This echoes the importance of purity in worship and right doctrine."
    },
    {
      "pk": 400403,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 3,
      "text": "But Zerubbabel, Jeshua, and the rest of the leaders of Israel said to them, 'You have no part with us in building a temple for our God. We alone will build it for the LORD, the God of Israel, as King Cyrus, the king of Persia, has commanded us.'",
      "links": "<a href='/AIV/15/1/2'>Ezra 1:2</a>",
      "comment": "Separation is maintained for doctrinal integrity, showing the importance of apostolic authority in guiding worship and safeguarding tradition."
    },
    {
      "pk": 400404,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 4,
      "text": "Then the people of the land discouraged the people of Judah and made them afraid to build.",
      "links": "<a href='/AIV/16/4/8'>Neh. 4:8</a>",
      "comment": "Opposition arises when God's people pursue His will. This reflects spiritual trials believers face when committed to obedience."
    },
    {
      "pk": 400405,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 5,
      "text": "They bribed officials against them to frustrate their purpose all through the reign of Cyrus king of Persia, even until the reign of Darius the king of Persia.",
      "links": "<a href='/AIV/16/4/11'>Neh. 4:11</a>",
      "comment": "Political interference and corruption further hinder God's work, a recurring motif in salvation history."
    },
    {
      "pk": 400406,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 6,
      "text": "In the reign of Ahasuerus, at the beginning of his rule, they wrote an accusation against the inhabitants of Judah and Jerusalem.",
      "links": "<a href='/AIV/17/1/1'>Esth. 1:1</a>",
      "comment": "False accusations continue as a means to obstruct God's people. Allusion to Esther demonstrates the ongoing challenges of exile and restoration."
    },
    {
      "pk": 400407,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 7,
      "text": "In the days of Artaxerxes, Bishlam, Mithredath, Tabeel, and the rest of their associates wrote to Artaxerxes king of Persia. The letter was written in Aramaic and translated.",
      "links": "<a href='/AIV/15/7/12'>Ezra 7:12</a>",
      "comment": "The mention of Aramaic marks a change in language, reflecting official correspondence and royal bureaucracy slowing progress."
    },
    {
      "pk": 400408,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 8,
      "text": "Rehum the commander and Shimshai the scribe wrote a letter against Jerusalem to King Artaxerxes as follows:",
      "links": "<a href='/AIV/15/4/17'>Ezra 4:17</a>",
      "comment": "Rehum and Shimshai represent governmental opposition, which will persistently challenge true worship and communal faith."
    },
    {
      "pk": 400409,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 9,
      "text": "Then Rehum the commander, Shimshai the scribe, and their associates—judges, officials, Persians, Erechites, Babylonians, Suzanites, Elamites, and others—",
      "links": "<a href='/AIV/15/4/17'>Ezra 4:17</a>",
      "comment": "A diverse group opposes God's people, indicating worldly powers often unite against those seeking holiness and covenant fidelity."
    },
    {
      "pk": 400410,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 10,
      "text": "and the rest of the nations whom the great and noble Osnappar deported and settled in the cities of Samaria and throughout the province west of the Euphrates—now",
      "links": "<a href='/AIV/12/17/24'>2 Kings 17:24</a>",
      "comment": "The text references the Assyrian exile, showing displacement and foreign settlement as sources of tension and threat."
    },
    {
      "pk": 400411,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 11,
      "text": "(This is the copy of the letter they sent to King Artaxerxes): 'Your servants, the people beyond the river, send greetings.'",
      "links": "<a href='/AIV/15/4/8'>Ezra 4:8</a>",
      "comment": "The formal tone marks diplomatic attempts to block restoration, showing secular authority's potential opposition to divine mission."
    },
    {
      "pk": 400412,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 12,
      "text": "'Be it known to the king, that the Jews who came up from you to us have arrived at Jerusalem. They are rebuilding the rebellious and wicked city, and are finishing its walls and repairing the foundations.'",
      "links": "<a href='/AIV/16/2/17'>Neh. 2:17</a>",
      "comment": "The opposition labels faithful service as rebellion, reflecting how true devotion is sometimes misunderstood or opposed by the world."
    },
    {
      "pk": 400413,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 13,
      "text": "'Let it be known to the king that if this city is rebuilt and its walls finished, they will not pay tribute, tax, or custom, and the royal revenues will suffer.'",
      "links": "<a href='/AIV/16/4/13'>Neh. 4:13</a>",
      "comment": "Appeals to economic self-interest often drive political action, reminding us of the challenges spiritual communities face responding to secular priorities."
    },
    {
      "pk": 400414,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 14,
      "text": "'Because we receive support from the king's palace, and it is not right for us to see the king dishonored, we are sending this message to inform the king,'",
      "links": "<a href='/AIV/16/2/3'>Neh. 2:3</a>",
      "comment": "The accusers profess loyalty to the ruler, but with underlying motives. Their approach reminds us of challenges the faith faces in balancing loyalty to earthly authorities."
    },
    {
      "pk": 400415,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 15,
      "text": "'so that a search may be made in the archives of your fathers. You will discover in the records that this city is a rebellious city, harmful to kings and provinces, and that revolt has taken place in it from ancient times. That is why this city was destroyed.'",
      "links": "<a href='/AIV/19/137/7'>Ps. 137:7</a>",
      "comment": "Historical precedent is used as evidence against restoration, invoking memory of past destructions—echoes of cycles of sin, judgment, and mercy."
    },
    {
      "pk": 400416,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 16,
      "text": "'We inform the king that if this city is rebuilt and its walls are finished, you will have no control over the province beyond the river.'",
      "links": "<a href='/AIV/15/4/13'>Ezra 4:13</a>",
      "comment": "Secular authority is threatened by spiritual restoration, emphasizing how the sovereignty of God over His people can cause tension with worldly powers."
    },
    {
      "pk": 400417,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 17,
      "text": "The king sent an answer: 'To Rehum the commander, Shimshai the scribe, and to their associates who live in Samaria and throughout the rest of the province beyond the river: Greetings.'",
      "links": "<a href='/AIV/15/4/8'>Ezra 4:8</a>",
      "comment": "The king's reply follows formal protocol, underscoring the theme of order and authority in human affairs."
    },
    {
      "pk": 400418,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 18,
      "text": "'The letter you sent has been read to me in full.'",
      "links": "<a href='/AIV/15/4/8'>Ezra 4:8</a>",
      "comment": "The king shows diligence—an example of justice in governance, even if applied wrongly here."
    },
    {
      "pk": 400419,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 19,
      "text": "'I gave orders and a search was made, and it was found that this city from ancient times has risen against kings, and rebellion and revolt have happened there.'",
      "links": "<a href='/AIV/15/4/15'>Ezra 4:15</a>",
      "comment": "Worldly record-keeping is contrasted with God's eternal purposes. Rebellion recorded here foreshadows the spiritual conflict between the kingdoms of this world and the Kingdom of God—fulfilled ultimately in Christ."
    },
    {
      "pk": 400420,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 20,
      "text": "'Powerful kings have ruled over Jerusalem, and have governed the whole province beyond the river, and tribute, tax, and custom were paid to them.'",
      "links": "<a href='/AIV/19/72/10'>Ps. 72:10</a>",
      "comment": "References to former glory and order hint at the city’s lasting legacy—Jerusalem will always hold a place in God’s salvation plan."
    },
    {
      "pk": 400421,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 21,
      "text": "'Therefore, make an order for these men to stop, so that this city will not be rebuilt until further notice from me.'",
      "links": "<a href='/AIV/15/4/23'>Ezra 4:23</a>",
      "comment": "Earthly orders cannot permanently impede God's redemptive work, which continues through patient perseverance and faithfulness."
    },
    {
      "pk": 400422,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 22,
      "text": "'Be careful not to neglect this matter. Why should damage grow to the hurt of the kings?'",
      "links": "<a href='/AIV/16/4/3'>Neh. 4:3</a>",
      "comment": "Political caution is often at odds with spiritual boldness; wise discernment is needed to navigate these tensions."
    },
    {
      "pk": 400423,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 23,
      "text": "When the copy of King Artaxerxes’ letter was read before Rehum, Shimshai the scribe, and their associates, they hurried to Jerusalem and, by force and power, stopped the work.",
      "links": "<a href='/AIV/16/6/8'>Neh. 6:8</a>; <a href='/AIV/16/4/17'>Neh. 4:17</a>",
      "comment": "Physical opposition interrupts the sacred work, echoing the many hardships endured by the faithful throughout history. Perseverance is a mark of true faith."
    },
    {
      "pk": 400424,
      "translation": "AIV",
      "book": 15,
      "chapter": 4,
      "verse": 24,
      "text": "Then the work on the house of God which is in Jerusalem stopped, and remained at a standstill until the second year of the reign of Darius king of Persia.",
      "links": "<a href='/AIV/15/5/1'>Ezra 5:1</a>",
      "comment": "A pause in sacred construction—yet we know God’s promises are not thwarted. Faithful leadership, communal obedience, and perseverance will ultimately see restoration. Physical structures serve to unite God’s people in worship, anticipate Christ’s ministry and the final establishment of God’s dwelling with mankind (<a href='/AIV/43/2/19-21'>John 2:19–21</a>)."
    }
  ],
  "translatedAt": "2025-12-23T09:03:50.616Z"
}