{
  "book": 15,
  "bookName": "Ezra",
  "bookAbbreviation": "Ezra",
  "chapter": 3,
  "verses": [
    {
      "pk": 15003001,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 1,
      "text": "When the seventh month came, and the Israelites had settled in their towns, all the people gathered as one in Jerusalem.",
      "links": "<a href='/AIV/16/8/1'>Neh. 8:1</a>; <a href='/AIV/03/23/24-27'>Lev. 23:24-27</a>",
      "comment": "The unity of the people at Jerusalem foreshadows the gathering of believers as a single worshipping body. This unity is foundational for the communal aspects of worship later developed in Christian liturgy."
    },
    {
      "pk": 15003002,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 2,
      "text": "Then Jeshua son of Jozadak and his fellow priests, along with Zerubbabel son of Shealtiel and his associates, rose up to build the altar of the God of Israel, to offer burnt offerings on it as written in the law of Moses, the man of God.",
      "links": "<a href='/AIV/02/40/6'>Exod. 40:6</a>; <a href='/AIV/03/01/03'>Lev. 1:3</a>",
      "comment": "The leadership of priests and the Davidic heir in restoring worship points to divinely appointed leaders maintaining the continuity of covenant worship—seen later in the distinct roles of clergy and laity in Christian tradition."
    },
    {
      "pk": 15003003,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 3,
      "text": "Despite their fear of the peoples around them, they set the altar on its foundation and offered burnt offerings on it to Yahweh, mornings and evenings.",
      "links": "<a href='/AIV/11/18/36'>1 Kgs. 18:36</a>; <a href='/AIV/03/06/09'>Lev. 6:9</a>",
      "comment": "Perseverance in worship under threat highlights the centrality of sacrifice, which points toward Christ’s ultimate sacrifice offered daily. The morning and evening offerings prefigure continual prayer and devotion."
    },
    {
      "pk": 15003004,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 4,
      "text": "They celebrated the Feast of Booths as prescribed, offering daily burnt offerings in the proper numbers according to the ordinance for each day.",
      "links": "<a href='/AIV/03/23/34'>Lev. 23:34</a>; <a href='/AIV/04/29/12-38'>Num. 29:12-38</a>",
      "comment": "Observance of sacred festivals according to divine command reflects liturgical fidelity. The continuity with Mosaic ordinances is suggestive of maintaining tradition and sacramental practices established by God."
    },
    {
      "pk": 15003005,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 5,
      "text": "After that, the regular burnt offerings, the offerings for New Moons, and all the appointed sacred feasts of Yahweh were presented, as well as freewill offerings from each individual.",
      "links": "<a href='/AIV/04/28/11-15'>Num. 28:11-15</a>; <a href='/AIV/03/22/18'>Lev. 22:18</a>",
      "comment": "This verse upholds both communal and personal devotion, blending ritual and voluntary worship. It demonstrates the importance of both ordered worship and personal sacrifice—analogous to ordinances and acts of personal piety."
    },
    {
      "pk": 15003006,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 6,
      "text": "On the first day of the seventh month, they began to offer burnt offerings to Yahweh, though the foundation of Yahweh’s temple had not yet been laid.",
      "links": "<a href='/AIV/03/23/24'>Lev. 23:24</a>; <a href='/AIV/37/2/18'>Hag. 2:18</a>",
      "comment": "Worship commenced even before the temple structure, showing that God’s presence and worship do not depend strictly on physical buildings. However, the longing for a consecrated temple foreshadows the desire for sacred spaces set apart for worship."
    },
    {
      "pk": 15003007,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 7,
      "text": "So they gave money to masons and carpenters; and food, drink, and oil to the people of Sidon and Tyre, so they would bring cedar logs from Lebanon by sea to Joppa, authorized by the decree of Cyrus king of Persia.",
      "links": "<a href='/AIV/11/05/06'>1 Kgs. 5:6</a>; <a href='/AIV/15/1/2'>Ezra 1:2</a>",
      "comment": "The use of resources and skilled labor for temple construction recalls Solomon’s temple. The cooperation between different peoples implies universality in worship and foreshadows the inclusion of all nations in God’s plan."
    },
    {
      "pk": 15003008,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 8,
      "text": "In the second month of the second year after arriving at God’s house in Jerusalem, Zerubbabel son of Shealtiel, Jeshua son of Jozadak, and their brothers—the priests and the Levites, and all who had returned from captivity—began the work, appointing Levites twenty years old and older to oversee the building of Yahweh’s temple.",
      "links": "<a href='/AIV/04/08/24-26'>Num. 8:24-26</a>",
      "comment": "The role of priests and Levites in oversight affirms hierarchical structure in worship, laying groundwork for continuity of apostolic succession and proper authority in the leadership of God’s people."
    },
    {
      "pk": 15003009,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 9,
      "text": "Jeshua and his sons and brothers, Kadmiel and his sons, and the sons of Hodaviah, along with their fellow Levites, joined together to oversee those working on the house of God.",
      "links": "<a href='/AIV/13/23/04'>1 Chr. 23:4</a>",
      "comment": "Shared oversight by Levite families ties back to the division of labor among the priests and Levites as established by David, invoking continuity and corporate responsibility in worship leadership."
    },
    {
      "pk": 15003010,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 10,
      "text": "When the builders laid the foundation of Yahweh’s temple, the priests stood in their apparel with trumpets, and the Levites, sons of Asaph, with cymbals, to praise Yahweh according to the directions given by David king of Israel.",
      "links": "<a href='/AIV/13/15/16'>1 Chr. 15:16</a>; <a href='/AIV/19/150/3-6'>Ps. 150:3-6</a>",
      "comment": "Priestly garments and ritual instruments emphasize the importance of liturgical beauty and tradition. Praise modeled after David’s instructions roots worship in historical continuity and elevates the role of sacred music."
    },
    {
      "pk": 15003011,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 11,
      "text": "And they sang responsively, giving praise and thanks to Yahweh: 'For he is good, for his steadfast love endures forever toward Israel.' And all the people shouted aloud with praise to Yahweh because the foundation of Yahweh’s house was laid.",
      "links": "<a href='/AIV/19/106/1'>Ps. 106:1</a>; <a href='/AIV/19/136/1'>Ps. 136:1</a>",
      "comment": "Responsive singing and acclamations of God’s enduring love echo Israel’s liturgical tradition. The people’s loud joy celebrates the dwelling place of God among His people, anticipating the spiritual fulfillment in Christ, “God with us.”"
    },
    {
      "pk": 15003012,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 12,
      "text": "But many of the priests and Levites and chiefs of the families, old enough to have seen the first temple, wept loudly when they saw the foundation of this house being laid, though many others shouted for joy.",
      "links": "<a href='/AIV/37/2/3'>Haggai 2:3</a>; <a href='/AIV/25/2/7'>Lam. 2:7</a>",
      "comment": "The mix of sorrow and joy upon laying the new foundation reflects the continuity and renewal of worship. This tension prefigures the sense of loss and anticipation fulfilled in Christ, whose own body becomes the new temple (cf. John 2:19-21)."
    },
    {
      "pk": 15003013,
      "translation": "AIV",
      "book": 15,
      "bookName": "Ezra",
      "bookAbbreviation": "Ezra",
      "chapter": 3,
      "verse": 13,
      "text": "No one could distinguish the sound of joyful shouting from the sound of people weeping, for the people made a loud noise; and the sound was heard far away.",
      "links": "<a href='/AIV/16/12/43'>Neh. 12:43</a>",
      "comment": "The intermingling of joy and sorrow expresses the profound emotion tied to worship and restoration. The loud communal response signified a renewal of presence and blessing, pointing to the fulfillment of God's promise and the hope for an enduring spiritual temple."
    }
  ],
  "translatedAt": "2025-12-24T04:41:39.178Z"
}