{
  "book": "1 John",
  "bookAbbreviation": "1John",
  "chapter": 3,
  "verses": [
    {
      "pk": 20010301,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 1,
      "text": "See what kind of love the Father has given to us, that we should be called children of God—and that is what we are! The reason the world does not know us is that it did not know Him.",
      "links": "<a href='/AIV/43/1/12'>John 1:12</a>; <a href='/AIV/42/6/35'>Luke 6:35</a>",
      "comment": "This verse emphasizes the profound love God gives, making us His children. This adoption is both a legal status and a spiritual transformation. The world's ignorance of believers parallels its rejection of Christ."
    },
    {
      "pk": 20010302,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 2,
      "text": "Beloved, we are now children of God, but what we will be has not yet been revealed. We know that when He appears, we shall be like Him, because we will see Him as He is.",
      "links": "<a href='/AIV/50/3/21'>Phil. 3:21</a>; <a href='/AIV/46/13/12'>1 Cor. 13:12</a>",
      "comment": "This refers to the future glorification of believers. The term \"we shall be like Him\" points to the theological truth of eventual transformation by God’s grace, foreshadowing the promise of the Beatific Vision."
    },
    {
      "pk": 20010303,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 3,
      "text": "And everyone who has this hope set on Him purifies himself, just as He is pure.",
      "links": "<a href='/AIV/40/5/8'>Matt. 5:8</a>; <a href='/AIV/58/12/14'>Heb. 12:14</a>",
      "comment": "Hope in Christ leads to striving toward holiness, implying personal effort in cooperation with divine grace. Moral transformation is expected from the true follower."
    },
    {
      "pk": 20010304,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 4,
      "text": "Everyone who practices sin also practices lawlessness; for sin is lawlessness.",
      "links": "<a href='/AIV/45/4/15'>Rom. 4:15</a>; <a href='/AIV/45/6/19'>Rom. 6:19</a>",
      "comment": "Sin is equated with lawlessness here; this stresses the seriousness of sin as rebellion against God's law, echoing both Old and New Testament standards."
    },
    {
      "pk": 20010305,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 5,
      "text": "You know that He appeared to take away sins, and in Him there is no sin.",
      "links": "<a href='/AIV/43/1/29'>John 1:29</a>; <a href='/AIV/60/2/22'>1 Pet. 2:22</a>",
      "comment": "Christ’s sinlessness is essential here—He alone can remove sin. This echoes Isaiah’s prophecy (Isa. 53:9)."
    },
    {
      "pk": 20010306,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 6,
      "text": "No one who abides in Him keeps on sinning; no one who keeps on sinning has seen Him or known Him.",
      "links": "<a href='/AIV/43/15/4'>John 15:4</a>; <a href='/AIV/58/10/26'>Heb. 10:26</a>",
      "comment": "Abiding in Christ leads to moral transformation. Habitual sin is incompatible with true knowledge of Christ, pointing toward the need for ongoing grace and repentance."
    },
    {
      "pk": 20010307,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 7,
      "text": "Little children, let no one deceive you. Whoever practices righteousness is righteous, just as He is righteous.",
      "links": "<a href='/AIV/40/7/16-20'>Matt. 7:16-20</a>; <a href='/AIV/43/8/34'>John 8:34</a>",
      "comment": "The fruit of actions reveals the reality of righteousness. The call to not be deceived echoes warnings against false teachers and the importance of visible deeds of righteousness."
    },
    {
      "pk": 20010308,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 8,
      "text": "Whoever commits sin is of the devil, for the devil has sinned from the beginning. The reason the Son of God appeared was to destroy the works of the devil.",
      "links": "<a href='/AIV/43/8/44'>John 8:44</a>; <a href='/AIV/1/3/15'>Gen. 3:15</a>",
      "comment": "Christ’s coming fulfills the ancient promise to destroy the devil’s works (see Gen. 3:15, the protoevangelium). The ongoing struggle with sin is cosmic in scope."
    },
    {
      "pk": 20010309,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 9,
      "text": "No one born of God practices sin, because God's seed remains in him; and he cannot keep on sinning, because he has been born of God.",
      "links": "<a href='/AIV/43/3/3-7'>John 3:3-7</a>; <a href='/AIV/60/1/23'>1 Pet. 1:23</a>",
      "comment": "The new birth or regeneration produces inward transformation. This does not imply sinless perfection, but the power and principle of grace at work within."
    },
    {
      "pk": 20010310,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 10,
      "text": "By this it is clear who are the children of God and who are the children of the devil: whoever does not practice righteousness is not of God, nor is the one who does not love his brother.",
      "links": "<a href='/AIV/40/25/45'>Matt. 25:45</a>; <a href='/AIV/43/13/35'>John 13:35</a>",
      "comment": "Life in God is manifested by right living and love for others. Love is a defining mark that distinguishes true faith."
    },
    {
      "pk": 20010311,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 11,
      "text": "For this is the message you have heard from the beginning: that we should love one another.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/3/19/18'>Lev. 19:18</a>",
      "comment": "The command to love is not new but foundational, revealed in both Old and New Testaments. Love lies at the heart of God’s revealed will."
    },
    {
      "pk": 20010312,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 12,
      "text": "Not like Cain, who was of the evil one and murdered his brother. And why did he murder him? Because his own deeds were evil and his brother's were righteous.",
      "links": "<a href='/AIV/1/4/8'>Gen. 4:8</a>; <a href='/AIV/58/11/4'>Heb. 11:4</a>",
      "comment": "Genesis provides a narrative archetype of hatred opposing love and righteousness. The spiritual meaning is rooted in the contrast between good and evil."
    },
    {
      "pk": 20010313,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 13,
      "text": "Do not be surprised, brothers, that the world hates you.",
      "links": "<a href='/AIV/43/15/18-19'>John 15:18-19</a>",
      "comment": "Hostility from the world should not shock believers. Christ forewarned this as a consequence of true discipleship."
    },
    {
      "pk": 20010314,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 14,
      "text": "We know that we have passed from death to life because we love the brothers. Whoever does not love remains in death.",
      "links": "<a href='/AIV/43/5/24'>John 5:24</a>; <a href='/AIV/45/6/13'>Rom. 6:13</a>",
      "comment": "Love for others is the evidence of transformation by grace—an essential fruit that testifies to internal change."
    },
    {
      "pk": 20010315,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 15,
      "text": "Everyone who hates his brother is a murderer, and you know that no murderer has eternal life remaining in him.",
      "links": "<a href='/AIV/40/5/21-22'>Matt. 5:21-22</a>",
      "comment": "Hatred is equated with murder in Christ’s teachings. This underscores the seriousness of inward disposition, not just outward acts."
    },
    {
      "pk": 20010316,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 16,
      "text": "By this we have known love, that He laid down His life for us; and we ought to lay down our lives for the brothers.",
      "links": "<a href='/AIV/43/10/11'>John 10:11</a>; <a href='/AIV/50/2/5-8'>Phil. 2:5-8</a>",
      "comment": "Christ’s sacrificial death is both the model and source of true love. Disciples are called to imitate this sacrificial self-giving."
    },
    {
      "pk": 20010317,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 17,
      "text": "But if anyone has this world’s goods and sees his brother in need, yet closes his heart against him, how does God’s love dwell in him?",
      "links": "<a href='/AIV/40/25/40'>Matt. 25:40</a>; <a href='/AIV/59/2/15-16'>Jas. 2:15-16</a>",
      "comment": "Love must be expressed in deeds; sharing with those in need is necessary evidence of God’s love working through us."
    },
    {
      "pk": 20010318,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 18,
      "text": "Little children, let us not love in word or talk but in deed and in truth.",
      "links": "<a href='/AIV/59/1/22'>Jas. 1:22</a>; <a href='/AIV/45/12/9'>Rom. 12:9</a>",
      "comment": "Genuine love is active and truthful, not merely verbal. This points toward the necessity of works along with faith."
    },
    {
      "pk": 20010319,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 19,
      "text": "By this we shall know that we are of the truth and reassure our hearts before Him,",
      "links": "<a href='/AIV/58/10/22'>Heb. 10:22</a>",
      "comment": "Real love for others gives us confidence that we belong to God, strengthening our assurance before Him."
    },
    {
      "pk": 20010320,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 20,
      "text": "for whenever our heart condemns us, God is greater than our heart, and He knows everything.",
      "links": "<a href='/AIV/19/139/1-2'>Ps. 139:1-2</a>",
      "comment": "When conscience accuses, God’s knowledge and mercy are greater. True assurance comes from trusting God’s perfect judgment and forgiveness."
    },
    {
      "pk": 20010321,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 21,
      "text": "Beloved, if our heart does not condemn us, we have confidence before God;",
      "links": "<a href='/AIV/58/4/16'>Heb. 4:16</a>",
      "comment": "A clear conscience leads to boldness in approaching God—a state believers are encouraged to seek through continual repentance and faith."
    },
    {
      "pk": 20010322,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 22,
      "text": "and whatever we ask we receive from Him, because we keep His commandments and do what is pleasing in His sight.",
      "links": "<a href='/AIV/43/15/7'>John 15:7</a>; <a href='/AIV/40/7/7-8'>Matt. 7:7-8</a>",
      "comment": "Effective prayer is connected to obedience to God’s commands. This highlights the necessity of faith working through love and obedience."
    },
    {
      "pk": 20010323,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 23,
      "text": "And this is His commandment: that we believe in the name of His Son Jesus Christ, and love one another, just as He has commanded us.",
      "links": "<a href='/AIV/43/6/29'>John 6:29</a>; <a href='/AIV/43/15/12'>John 15:12</a>",
      "comment": "Faith and love are united in God’s command. True religion is found in both right belief and right practice—the inseparability of doctrine and charity."
    },
    {
      "pk": 20010324,
      "translation": "AIV",
      "book": 62,
      "chapter": 3,
      "verse": 24,
      "text": "Whoever keeps His commandments abides in Him, and He in them. And by this we know that He dwells in us: by the Spirit whom He has given us.",
      "links": "<a href='/AIV/43/14/23'>John 14:23</a>; <a href='/AIV/45/8/9'>Rom. 8:9</a>",
      "comment": "The gift of the Holy Spirit is evidence of abiding in God. Obedience is the fruit of this mutual indwelling, showing the necessity of living faith."
    }
  ],
  "translatedAt": "2025-12-23T04:18:51.485Z"
}