{
  "book": 69,
  "bookName": "1 John",
  "bookAbbreviation": "1John",
  "chapter": 4,
  "verses": [
    {
      "pk": 69004001,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 1,
      "text": "Beloved, do not believe every spirit, but test the spirits to see whether they are from God, for many false prophets have gone out into the world.",
      "links": "<a href='/AIV/40/7/15'>Matt. 7:15</a>; <a href='/AIV/52/5/21'>1 Thess. 5:21</a>",
      "comment": "John urges discernment about spiritual influences, since mistaken ideas about Christ threaten the true faith. Testing spirits echoes Jesus’ warning of false prophets."
    },
    {
      "pk": 69004002,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 2,
      "text": "By this you know the Spirit of God: every spirit that confesses Jesus Christ has come in the flesh is from God,",
      "links": "<a href='/AIV/43/1/14'>John 1:14</a>; <a href='/AIV/45/10/9'>Rom. 10:9</a>",
      "comment": "Confessing Jesus' incarnation—God truly becoming man—is a central doctrine (see John 1:14). This is both literal and mystical reality, pivotal for true faith."
    },
    {
      "pk": 69004003,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 3,
      "text": "and every spirit that does not confess Jesus is not from God. This is the spirit of the antichrist, which you heard was coming and now is already in the world.",
      "links": "<a href='/AIV/62/2/18'>1 John 2:18</a>; <a href='/AIV/53/2/7'>2 Thess. 2:7</a>",
      "comment": "Denying Christ’s incarnation is antichrist. These attacks have existed since the apostolic age, and resisting them preserves the apostolic faith handed down."
    },
    {
      "pk": 69004004,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 4,
      "text": "Little children, you are from God and have overcome them, because He who is in you is greater than he who is in the world.",
      "links": "<a href='/AIV/43/16/33'>John 16:33</a>; <a href='/AIV/45/8/31'>Rom. 8:31</a>",
      "comment": "Faithful believers are victorious through God’s indwelling Spirit. The emphasis is on the supernatural power that comes from remaining united with Christ."
    },
    {
      "pk": 69004005,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 5,
      "text": "They are from the world, therefore they speak from the world, and the world listens to them.",
      "links": "<a href='/AIV/43/17/14'>John 17:14</a>",
      "comment": "False teachers align with worldly thinking. Acceptance by the world is not a sign of truth. Authentic doctrine often stands opposed to popular opinion."
    },
    {
      "pk": 69004006,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 6,
      "text": "We are from God. Whoever knows God listens to us; whoever is not from God does not listen to us. By this we know the Spirit of truth and the spirit of error.",
      "links": "<a href='/AIV/62/2/19'>1 John 2:19</a>; <a href='/AIV/43/8/47'>John 8:47</a>",
      "comment": "John asserts apostolic authority as the authentic channel for Christian teaching. Listening to them means faithfulness to God’s revealed truth, safeguarded by the Church’s leaders."
    },
    {
      "pk": 69004007,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 7,
      "text": "Beloved, let us love one another, for love is from God, and whoever loves has been born of God and knows God.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/62/2/29'>1 John 2:29</a>",
      "comment": "Christian love marks true spiritual rebirth. Charity is the essence of God’s nature and is imparted through the new birth and participation in the life of Christ."
    },
    {
      "pk": 69004008,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 8,
      "text": "Anyone who does not love does not know God, because God is love.",
      "links": "<a href='/AIV/62/4/16'>1 John 4:16</a>",
      "comment": "Knowing God cannot be separated from loving others; love is God’s defining attribute. There is a spiritual dimension connecting true doctrine with a life of charity."
    },
    {
      "pk": 69004009,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 9,
      "text": "In this the love of God was made clear among us: God sent His only-begotten Son into the world, that we might live through Him.",
      "links": "<a href='/AIV/43/3/16'>John 3:16</a>; <a href='/AIV/45/5/8'>Rom. 5:8</a>",
      "comment": "\"Only-begotten Son\" highlights the uniqueness of Christ (see John 3:16). Our life comes through union and participation in Him."
    },
    {
      "pk": 69004010,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 10,
      "text": "In this is love, not that we have loved God but that He loved us and sent His Son as an atoning sacrifice for and concerning our sins.",
      "links": "<a href='/AIV/45/3/25'>Rom. 3:25</a>; <a href='/AIV/23/53/10'>Isa. 53:10</a>",
      "comment": "God initiates love and redemption. Christ’s sacrificial death fulfills Old Testament atonement (see Isaiah 53:10). His offering reconciles us to God, a truth lived out in the Church’s sacramental life."
    },
    {
      "pk": 69004011,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 11,
      "text": "Beloved, if God so loved us, we also ought to love one another.",
      "links": "<a href='/AIV/62/3/16'>1 John 3:16</a>",
      "comment": "The divine example of love obliges believers to imitate this self-giving charity. Christian morality arises from the pattern given by Christ."
    },
    {
      "pk": 69004012,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 12,
      "text": "No one has ever seen God; if we love one another, God remains in us and His love is perfected in us.",
      "links": "<a href='/AIV/43/1/18'>John 1:18</a>; <a href='/AIV/43/14/21-23'>John 14:21-23</a>",
      "comment": "Though unseen, God abides in believers through love. This indwelling presence leads to the perfection of love, anticipating fullness in eternal life and continuing sanctification."
    },
    {
      "pk": 69004013,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 13,
      "text": "By this we know that we remain in Him and He in us, because He has given us of His Spirit.",
      "links": "<a href='/AIV/46/12/3'>1 Cor. 12:3</a>; <a href='/AIV/43/14/17'>John 14:17</a>",
      "comment": "The gift of the Holy Spirit is evidence of true union with God. The Spirit’s indwelling is experienced most fully in the life of Christian community and worship."
    },
    {
      "pk": 69004014,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 14,
      "text": "And we have seen and testify that the Father has sent the Son to be the Savior of the world.",
      "links": "<a href='/AIV/43/4/42'>John 4:42</a>; <a href='/AIV/62/1/1-3'>1 John 1:1-3</a>",
      "comment": "The apostolic testimony is eye-witnessed and universal—Christ is sent as Savior, not just for some, but for the world, fulfilling God’s promises to Abraham (see Gen. 12:3)."
    },
    {
      "pk": 69004015,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 15,
      "text": "Whoever confesses that Jesus is the Son of God, God dwells in him and he in God.",
      "links": "<a href='/AIV/40/16/16'>Matt. 16:16</a>; <a href='/AIV/43/20/31'>John 20:31</a>",
      "comment": "Open confession of Christ’s divinity is essential for saving faith. There is also a mystical reality: God's indwelling comes by both faith and continued living in His grace."
    },
    {
      "pk": 69004016,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 16,
      "text": "So we have come to know and believe the love that God has for us. God is love, and whoever remains in love remains in God, and God remains in him.",
      "links": "<a href='/AIV/62/4/8'>1 John 4:8</a>; <a href='/AIV/43/15/4-10'>John 15:4-10</a>",
      "comment": "Remaining (abiding) in love is presented as the ongoing way to abide in God. This points to the necessity of perseverance and active engagement in the life of the faith community."
    },
    {
      "pk": 69004017,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 17,
      "text": "By this, love is perfected with us, so that we may have boldness on the day of judgment, because as He is, so also are we in this world.",
      "links": "<a href='/AIV/45/8/29'>Rom. 8:29</a>; <a href='/AIV/43/17/22-23'>John 17:22-23</a>",
      "comment": "Perfected love flows from conformity to Christ. Assurance on judgment day depends on living in this union, being transformed to reflect Christ’s own image."
    },
    {
      "pk": 69004018,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 18,
      "text": "There is no fear in love, but perfect love casts out fear. For fear has to do with punishment, and whoever fears has not been perfected in love.",
      "links": "<a href='/AIV/45/8/15'>Rom. 8:15</a>",
      "comment": "When love is complete, fear is dispelled. True relationship with God replaces worry about punishment with confidence as beloved children, reflecting sanctification's effects."
    },
    {
      "pk": 69004019,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 19,
      "text": "We love because He first loved us.",
      "links": "<a href='/AIV/45/5/5'>Rom. 5:5</a>",
      "comment": "Our love is a response to God’s prior initiative. This foundational principle governs Christian action—divine love pours into our hearts and enables us to love others."
    },
    {
      "pk": 69004020,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 20,
      "text": "If anyone says, ‘I love God,’ and hates his brother, he is a liar. For he who does not love his brother whom he has seen cannot love God whom he has not seen.",
      "links": "<a href='/AIV/40/5/23-24'>Matt. 5:23-24</a>; <a href='/AIV/59/2/15-16'>James 2:15-16</a>",
      "comment": "Authentic love for God must result in real love for others. Visible charity is the visible sign of invisible faith, a key concept in how faith and works are united."
    },
    {
      "pk": 69004021,
      "translation": "AIV",
      "book": 69,
      "bookName": "1 John",
      "bookAbbreviation": "1John",
      "chapter": 4,
      "verse": 21,
      "text": "And this commandment we have from Him: whoever loves God must also love his brother.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/40/22/37-39'>Matt. 22:37-39</a>",
      "comment": "Jesus' commandment sums up the Law—love of God and neighbor are inseparable. Fullness of faith is lived out within a community shaped by obedient love."
    }
  ],
  "translatedAt": "2025-12-24T12:31:33.829Z"
}