{
  "book": "1 John",
  "bookAbbreviation": "1John",
  "chapter": 4,
  "verses": [
    {
      "pk": 438001,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 1,
      "text": "Beloved, do not believe every spirit, but test the spirits to see whether they are from God, for many false prophets have gone out into the world.",
      "links": "<a href='/AIV/40/7/15'>Matt. 7:15</a>; <a href='/AIV/52/5/21'>1 Thess. 5:21</a>",
      "comment": "John warns Christians to discern spiritual truth, not blindly accepting all teachings. This emphasizes the need for sound doctrine, and shows the early Church already had to guard against false prophecy and heresy (see also Acts 20:29-30)."
    },
    {
      "pk": 438002,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 2,
      "text": "By this you know the Spirit of God: every spirit that confesses Jesus Christ has come in the flesh is from God,",
      "links": "<a href='/AIV/43/1/14'>John 1:14</a>; <a href='/AIV/45/10/9'>Rom. 10:9</a>",
      "comment": "Confessing Jesus has come in the flesh directly addresses early heresies. True faith recognizes the incarnation, affirming both Christ's divinity and real humanity (see Phil. 2:6-8)."
    },
    {
      "pk": 438003,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 3,
      "text": "And every spirit that does not confess Jesus is not from God. This is the spirit of the antichrist, which you have heard is coming, and now is already in the world.",
      "links": "<a href='/AIV/43/8/24'>John 8:24</a>; <a href='/AIV/53/2/7'>2 Thess. 2:7</a>",
      "comment": "The denial of Christ's identity is equated with the spirit opposed to God's plan. The term 'antichrist' references both coming future opposition and the present false teachers."
    },
    {
      "pk": 438004,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 4,
      "text": "You are from God, little children, and have overcome them. For He who is in you is greater than he who is in the world.",
      "links": "<a href='/AIV/43/16/33'>John 16:33</a>; <a href='/AIV/45/8/37-39'>Rom. 8:37-39</a>",
      "comment": "'He who is in you' refers to the Holy Spirit's indwelling presence, comforting believers, and giving victory over evil. The spiritual battle is won by God working in the faithful (see 1 Cor. 6:19)."
    },
    {
      "pk": 438005,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 5,
      "text": "They are from the world; therefore they speak from the world, and the world listens to them.",
      "links": "<a href='/AIV/43/15/19'>John 15:19</a>; <a href='/AIV/62/2/15'>1 John 2:15</a>",
      "comment": "Worldly teachers and ideas are received by those aligned with the world, not with Christ. Believers are called to a higher standard of truth."
    },
    {
      "pk": 438006,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 6,
      "text": "We are from God. Whoever knows God listens to us; whoever is not from God does not listen to us. By this we know the Spirit of truth and the spirit of error.",
      "links": "<a href='/AIV/40/10/40'>Matt. 10:40</a>; <a href='/AIV/43/13/20'>John 13:20</a>",
      "comment": "Apostolic teaching is the standard for truth. Unity in faith is a sign of true knowledge of God, and those who submit to apostolic authority display the Spirit of truth (cf. Acts 2:42; see also the lasting role of visible leadership and teaching authority in the Church)."
    },
    {
      "pk": 438007,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 7,
      "text": "Beloved, let us love one another, for love is from God, and everyone who loves has been born of God and knows God.",
      "links": "<a href='/AIV/43/13/34-35'>John 13:34-35</a>; <a href='/AIV/45/5/5'>Rom. 5:5</a>",
      "comment": "True Christian love comes directly from God's own essence. Mutual love among believers is a mark of having received new spiritual birth through God's grace."
    },
    {
      "pk": 438008,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 8,
      "text": "He who does not love does not know God, because God is love.",
      "links": "<a href='/AIV/19/86/15'>Ps. 86:15</a>; <a href='/AIV/43/3/16'>John 3:16</a>",
      "comment": "Love is not just an attribute but the very nature of God. Genuine knowledge of God must be expressed in self-giving love for others."
    },
    {
      "pk": 438009,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 9,
      "text": "In this the love of God was revealed among us, that God sent His only-begotten Son into the world so that we might live through Him.",
      "links": "<a href='/AIV/43/1/18'>John 1:18</a>; <a href='/AIV/43/3/16'>John 3:16</a>",
      "comment": "The sending of the Son demonstrates divine love in action and fulfills Old Testament prophecy about the Messiah (see Isa. 9:6). The word 'only-begotten' emphasizes Christ's unique relationship with the Father."
    },
    {
      "pk": 438010,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 10,
      "text": "In this is love, not that we have loved God, but that He loved us and sent His Son as the atoning sacrifice for our sins.",
      "links": "<a href='/AIV/45/5/8'>Rom. 5:8</a>; <a href='/AIV/62/2/2'>1 John 2:2</a>",
      "comment": "God takes the initiative in salvation. The Greek word for 'atoning sacrifice' (hilasmos) denotes a propitiatory offering; Jesus’ death reconciles us with God, echoing the temple sacrifices of the Old Testament (see Lev. 16)."
    },
    {
      "pk": 438011,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 11,
      "text": "Beloved, if God so loved us, we also ought to love one another.",
      "links": "<a href='/AIV/40/22/39'>Matt. 22:39</a>; <a href='/AIV/62/3/16'>1 John 3:16</a>",
      "comment": "Our love for others flows from God’s prior love for us. The commandment to love is thus not simply ethical, but deeply theological, rooted in the new life given in Christ."
    },
    {
      "pk": 438012,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 12,
      "text": "No one has ever seen God; if we love one another, God remains in us and His love is perfected in us.",
      "links": "<a href='/AIV/43/1/18'>John 1:18</a>; <a href='/AIV/62/3/24'>1 John 3:24</a>",
      "comment": "Though the Father is unseen, His presence is manifest when Christians abide in love. God’s indwelling (remaining) anticipates the idea of union with God through the Spirit and participation in His life."
    },
    {
      "pk": 438013,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 13,
      "text": "By this we know that we remain in Him and He in us, because He has given us of His Spirit.",
      "links": "<a href='/AIV/45/8/16'>Rom. 8:16</a>; <a href='/AIV/43/14/17'>John 14:17</a>",
      "comment": "The indwelling Holy Spirit is the mark of real communion with God. Participation in the life of the Spirit is evidence of belonging to Christ’s body (see Eph. 1:13-14 for the Spirit as a seal of salvation)."
    },
    {
      "pk": 438014,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 14,
      "text": "And we have seen and testify that the Father has sent His Son to be the Savior of the world.",
      "links": "<a href='/AIV/43/4/42'>John 4:42</a>; <a href='/AIV/45/10/9-10'>Rom. 10:9-10</a>",
      "comment": "John’s eyewitness testimony underlines the reality of the Incarnation and universal scope of Christ’s saving work, touching all nations (cf. Isa. 49:6)."
    },
    {
      "pk": 438015,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 15,
      "text": "Whoever confesses that Jesus is the Son of God, God remains in him, and he in God.",
      "links": "<a href='/AIV/43/11/27'>John 11:27</a>; <a href='/AIV/62/3/24'>1 John 3:24</a>",
      "comment": "Openly professing Jesus as the Son of God is essential to true union with God, reflecting both faith and public acknowledgment. Confession is not only inward but meant to be outward and communal."
    },
    {
      "pk": 438016,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 16,
      "text": "And we have come to know and have believed the love that God has for us. God is love, and whoever remains in love remains in God, and God remains in him.",
      "links": "<a href='/AIV/43/15/9-10'>John 15:9-10</a>; <a href='/AIV/62/2/24'>1 John 2:24</a>",
      "comment": "Abiding in love is the way believers abide in God. The transformative power of divine love grows as one matures in faith—linking faith, love, and communion with God."
    },
    {
      "pk": 438017,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 17,
      "text": "By this, love has been perfected among us, so that we may have confidence in the day of judgment, because as He is, so also are we in this world.",
      "links": "<a href='/AIV/45/8/29'>Rom. 8:29</a>; <a href='/AIV/46/1/8'>1 Cor. 1:8</a>",
      "comment": "Fullness of love gives Christians assurance before God’s final judgment. The likeness of believers to Christ (see also 2 Pet. 1:4) suggests transformation through union with Him, not just legal standing."
    },
    {
      "pk": 438018,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 18,
      "text": "There is no fear in love, but perfect love casts out fear. For fear has to do with punishment, and the one who fears has not been perfected in love.",
      "links": "<a href='/AIV/45/8/15'>Rom. 8:15</a>; <a href='/AIV/62/3/20'>1 John 3:20</a>",
      "comment": "Mature love for God frees the soul from anxious fear of judgment. This growth in love and holiness is a process, pointing to assurance born from an authentic relationship and transformation in Christ."
    },
    {
      "pk": 438019,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 19,
      "text": "We love because He first loved us.",
      "links": "<a href='/AIV/45/5/5-8'>Rom. 5:5-8</a>",
      "comment": "God’s initiative in love empowers believers to love in return. The primacy of grace is central—God’s love is the cause, our love is the effect."
    },
    {
      "pk": 438020,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 20,
      "text": "If anyone says, 'I love God,' and hates his brother, he is a liar; for the one who does not love his brother whom he has seen cannot love God whom he has not seen.",
      "links": "<a href='/AIV/40/5/23-24'>Matt. 5:23-24</a>; <a href='/AIV/62/2/9-11'>1 John 2:9-11</a>",
      "comment": "Love for others is the visible proof of love for God. The emphasis on reconciliation, forgiveness, and unity echoes the early Church’s call for true fellowship."
    },
    {
      "pk": 438021,
      "translation": "AIV",
      "book": 62,
      "chapter": 4,
      "verse": 21,
      "text": "And we have this commandment from Him: whoever loves God must also love his brother.",
      "links": "<a href='/AIV/40/22/37-39'>Matt. 22:37-39</a>; <a href='/AIV/43/15/12'>John 15:12</a>",
      "comment": "Christian faith is inseparable from obedience to God’s commandments, particularly the command to love. Genuine spiritual life shows itself in action, not only in belief—a unity of faith and works."
    }
  ],
  "translatedAt": "2025-12-23T04:19:23.775Z"
}