{
  "book": "1 John",
  "bookAbbreviation": "1John",
  "chapter": 1,
  "verses": [
    {
      "pk": 3101001,
      "translation": "AIV",
      "book": 62,
      "chapter": 1,
      "verse": 1,
      "text": "That which was from the beginning, which we have heard, which we have seen with our eyes, which we looked upon and touched with our hands, concerning the Word of life—",
      "links": "<a href='/AIV/43/1/1'>John 1:1</a>; <a href='/AIV/40/13/16'>Matt. 13:16</a>; <a href='/AIV/45/10/17'>Rom. 10:17</a>",
      "comment": "John affirms the eyewitness testimony of the Apostles about Jesus, the 'Word of life.' The term 'from the beginning' connects to Genesis 1:1 and John 1:1, highlighting the divinity and pre-existence of Christ. The physicality (heard, seen, touched) emphasizes the reality of the Incarnation, a key doctrine for a tangible faith."
    },
    {
      "pk": 3101002,
      "translation": "AIV",
      "book": 62,
      "chapter": 1,
      "verse": 2,
      "text": "The life was made manifest, and we have seen it and testify to it, and proclaim to you the eternal life, which was with the Father and was made manifest to us—",
      "links": "<a href='/AIV/43/1/4'>John 1:4</a>; <a href='/AIV/51/1/26'>Col. 1:26</a>",
      "comment": "Eternal life is not just a concept, but a Person: Jesus Christ. The eternal Son who was with the Father has been revealed to humanity, reinforcing both His divinity and the tangible reality of His coming. This aligns with the understanding of salvation as participation in divine life."
    },
    {
      "pk": 3101003,
      "translation": "AIV",
      "book": 62,
      "chapter": 1,
      "verse": 3,
      "text": "That which we have seen and heard we also proclaim to you, so that you too may have fellowship with us; and truly our fellowship is with the Father and with his Son, Jesus Christ.",
      "links": "<a href='/AIV/43/17/21-23'>John 17:21–23</a>; <a href='/AIV/46/1/9'>1 Cor. 1:9</a>",
      "comment": "The Apostles' proclamation invites all believers into communion, not just with each other but with the Father and the Son. This hints at the communal and unified nature of the Church. Full fellowship with God is made possible through unity with the apostolic witness."
    },
    {
      "pk": 3101004,
      "translation": "AIV",
      "book": 62,
      "chapter": 1,
      "verse": 4,
      "text": "And we are writing these things so that our joy may be complete.",
      "links": "<a href='/AIV/43/15/11'>John 15:11</a>; <a href='/AIV/50/2/2'>Phil. 2:2</a>",
      "comment": "Joy is found in sharing the truth and bringing others into the fullness of faith. True joy is a result of unity and communion with God and believers, reflecting the satisfaction found in apostolic teaching."
    },
    {
      "pk": 3101005,
      "translation": "AIV",
      "book": 62,
      "chapter": 1,
      "verse": 5,
      "text": "This is the message we have heard from him and announce to you: God is light, and in him there is no darkness at all.",
      "links": "<a href='/AIV/43/8/12'>John 8:12</a>; <a href='/AIV/19/27/1'>Ps. 27:1</a>",
      "comment": "God's utter holiness is described as 'light.' Jesus called Himself 'the light of the world,' fulfilling Old Testament imagery and revealing His divine nature."
    },
    {
      "pk": 3101006,
      "translation": "AIV",
      "book": 62,
      "chapter": 1,
      "verse": 6,
      "text": "If we say we have fellowship with him but walk in darkness, we lie and do not practice the truth.",
      "links": "<a href='/AIV/45/13/12-13'>Rom. 13:12–13</a>; <a href='/AIV/50/3/17-18'>Phil. 3:17–18</a>",
      "comment": "Authentic fellowship with God must be lived out; mere words are not enough. This points to the necessity of both faith and works, manifesting truth in action, a theme consistent throughout the New Testament."
    },
    {
      "pk": 3101007,
      "translation": "AIV",
      "book": 62,
      "chapter": 1,
      "verse": 7,
      "text": "But if we walk in the light, as he is in the light, we have fellowship with one another, and the blood of Jesus his Son cleanses us from all sin.",
      "links": "<a href='/AIV/58/9/14'>Heb. 9:14</a>; <a href='/AIV/66/7/14'>Rev. 7:14</a>",
      "comment": "Cleansing from sin is tied to Jesus’ sacrificial blood. Walking in the light (living uprightly) brings unity with the Church and purification—a process available to believers, and not simply a one-time event. The necessity of continually living in the light for ongoing cleansing is implied here."
    },
    {
      "pk": 3101008,
      "translation": "AIV",
      "book": 62,
      "chapter": 1,
      "verse": 8,
      "text": "If we say we have no sin, we deceive ourselves, and the truth is not in us.",
      "links": "<a href='/AIV/19/143/2'>Ps. 143:2</a>; <a href='/AIV/45/3/23'>Rom. 3:23</a>",
      "comment": "Honest acknowledgment of sin is vital for spiritual health. This verse undergirds the spiritual discipline of confession, and recognizes that even believers need ongoing repentance."
    },
    {
      "pk": 3101009,
      "translation": "AIV",
      "book": 62,
      "chapter": 1,
      "verse": 9,
      "text": "If we confess our sins, he is faithful and just to forgive us our sins and to cleanse us from all unrighteousness.",
      "links": "<a href='/AIV/19/32/5'>Ps. 32:5</a>; <a href='/AIV/59/5/16'>James 5:16</a>",
      "comment": "Forgiveness is granted through confessing sins; God provides both pardon and purification. This has long inspired the practice of regular confession and reception of grace through God’s appointed means."
    },
    {
      "pk": 3101010,
      "translation": "AIV",
      "book": 62,
      "chapter": 1,
      "verse": 10,
      "text": "If we say we have not sinned, we make him a liar, and his word is not in us.",
      "links": "<a href='/AIV/19/51/4'>Ps. 51:4</a>; <a href='/AIV/45/3/4'>Rom. 3:4</a>",
      "comment": "To deny having sinned is to reject God's truth, and to separate oneself from His word. The text emphasizes humility and ongoing receptivity to God's transforming word."
    }
  ],
  "translatedAt": "2025-12-23T04:17:47.946Z"
}