{
  "book": "1 John",
  "bookAbbreviation": "1John",
  "chapter": 5,
  "verses": [
    {
      "pk": 2105101,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 1,
      "text": "Everyone who believes that Jesus is the Christ has been born of God, and everyone who loves the Father also loves whoever is born of Him.",
      "links": "<a href='/AIV/43/1/12-13'>John 1:12–13</a>; <a href='/AIV/62/4/7'>1 John 4:7</a>",
      "comment": "This verse makes clear that faith in Jesus as Messiah is evidence of spiritual rebirth. The linkage of love for God and love for His children highlights how unity and love within the Church is essential. Note that 'born of God' is both literal (spiritual rebirth) and points to the mystical unity of believers."
    },
    {
      "pk": 2105102,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 2,
      "text": "By this we know that we love the children of God: when we love God and obey His commands.",
      "links": "<a href='/AIV/62/2/3'>1 John 2:3</a>; <a href='/AIV/62/3/24'>1 John 3:24</a>",
      "comment": "Loving God and obeying His commandments is inseparable from loving fellow believers. There is no true love apart from obedience, suggesting that faith must express itself in works, an idea which is deeply scriptural (<a href='/AIV/59/2/17-18'>James 2:17-18</a>)."
    },
    {
      "pk": 2105103,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 3,
      "text": "For this is the love of God, that we keep His commandments. And His commandments are not burdensome.",
      "links": "<a href='/AIV/43/14/15'>John 14:15</a>; <a href='/AIV/62/3/22'>1 John 3:22</a>",
      "comment": "Authentic love for God manifests in obedience. The phrase 'not burdensome' reinforces that God gives us grace to fulfill His commands, underscoring the necessity of grace working within the believer."
    },
    {
      "pk": 2105104,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 4,
      "text": "For everyone who has been born of God overcomes the world. And this is the victory that has overcome the world—our faith.",
      "links": "<a href='/AIV/43/16/33'>John 16:33</a>; <a href='/AIV/62/2/13-14'>1 John 2:13–14</a>",
      "comment": "Faith is triumphant over the world's temptations. This verse echoes Jesus's assurance of victory through faith and hints at the power of sacramental life drawing grace for the struggle."
    },
    {
      "pk": 2105105,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 5,
      "text": "Who is it that overcomes the world except the one who believes that Jesus is the Son of God?",
      "links": "<a href='/AIV/43/11/27'>John 11:27</a>; <a href='/AIV/62/4/15'>1 John 4:15</a>",
      "comment": "The basis for victory is faith in Jesus's divine Sonship—affirming core Christology. Belief is not mere assent, but transformative, drawing us into God's own family."
    },
    {
      "pk": 2105106,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 6,
      "text": "This is He who came by water and blood—Jesus Christ; not by water only, but by water and blood. And the Spirit is the one who testifies, because the Spirit is truth.",
      "links": "<a href='/AIV/43/19/34'>John 19:34</a>; <a href='/AIV/62/4/13'>1 John 4:13</a>",
      "comment": "The reference to water and blood points both to Jesus’s baptism and crucifixion, and some understand it to refer sacramentally to Baptism and Eucharist. The Spirit’s testimony reinforces the reliability of the truth—notice the triple witness structure."
    },
    {
      "pk": 2105107,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 7,
      "text": "For there are three who bear witness:",
      "links": "<a href='/AIV/43/8/17-18'>John 8:17–18</a>",
      "comment": "Textual evidence: The earliest manuscripts do not contain the explicit reference to 'Father, Word, and Holy Spirit' here; those words were added in later tradition. The sense remains: witnesses confirm truth."
    },
    {
      "pk": 2105108,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 8,
      "text": "the Spirit, the water, and the blood; and these three agree.",
      "links": "<a href='/AIV/62/5/6'>1 John 5:6</a>; <a href='/AIV/43/3/5'>John 3:5</a>",
      "comment": "Water and blood may mystically signify the sacraments, especially rebirth and sacrificial communion. The Spirit unites and authenticates the witness inwardly."
    },
    {
      "pk": 2105109,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 9,
      "text": "If we receive the testimony of men, the testimony of God is greater, for this is the testimony of God that He has given concerning His Son.",
      "links": "<a href='/AIV/40/3/17'>Matthew 3:17</a>; <a href='/AIV/62/1/5'>1 John 1:5</a>",
      "comment": "God has attested to Jesus’s divine Sonship. Direct revelation surpasses any human witness (<a href='/AIV/40/17/5'>Matt. 17:5</a>)."
    },
    {
      "pk": 2105110,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 10,
      "text": "Whoever believes in the Son of God has the testimony inside himself. Whoever does not believe God has made Him a liar, because he has not believed in the testimony that God has given about His Son.",
      "links": "<a href='/AIV/43/3/33'>John 3:33</a>; <a href='/AIV/45/8/16'>Romans 8:16</a>",
      "comment": "Faith ensures inward witness—an assurance by the indwelling Spirit. Rejection is tantamount to denying God’s truthfulness."
    },
    {
      "pk": 2105111,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 11,
      "text": "And this is the testimony: that God has given us eternal life, and this life is in His Son.",
      "links": "<a href='/AIV/43/17/3'>John 17:3</a>; <a href='/AIV/62/1/2'>1 John 1:2</a>",
      "comment": "Eternal life is a present gift, not merely future. Its source is the Son—including mystical union with Him, which the action of the Church’s sacramental life deepens."
    },
    {
      "pk": 2105112,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 12,
      "text": "Whoever has the Son has life; whoever does not have the Son of God does not have life.",
      "links": "<a href='/AIV/43/3/36'>John 3:36</a>; <a href='/AIV/62/2/23'>1 John 2:23</a>",
      "comment": "Life in Christ alone is true life, echoing Jesus’ own words (<a href='/AIV/43/14/6'>John 14:6</a>). The text implies a real, transformative union—not mere external profession."
    },
    {
      "pk": 2105113,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 13,
      "text": "I write these things to you who believe in the name of the Son of God, so that you may know you have eternal life.",
      "links": "<a href='/AIV/43/20/31'>John 20:31</a>; <a href='/AIV/62/2/25'>1 John 2:25</a>",
      "comment": "Assurance of eternal life derives from living, persevering faith. The implication is that believers can have certainty when they remain in Christ and in His Church."
    },
    {
      "pk": 2105114,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 14,
      "text": "And this is the confidence we have before Him: that if we ask anything according to His will, He hears us.",
      "links": "<a href='/AIV/40/7/7'>Matthew 7:7</a>; <a href='/AIV/62/3/22'>1 John 3:22</a>",
      "comment": "Prayer in alignment with God's will is always efficacious. The context shows confidence in communal prayer and intercession, especially as lived in the liturgical worship of the Church."
    },
    {
      "pk": 2105115,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 15,
      "text": "And if we know that He hears us in whatever we ask, we know that we have whatever we have asked from Him.",
      "links": "<a href='/AIV/40/21/22'>Matthew 21:22</a>; <a href='/AIV/43/14/13'>John 14:13</a>",
      "comment": "Confidence in prayer arises from faith and obedience. Requests made in unity with the Church are especially effective, reflecting communal participation in Christ’s intercession."
    },
    {
      "pk": 2105116,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 16,
      "text": "If anyone sees his brother committing a sin not leading to death, he shall ask, and God will give him life—to those who do not sin unto death. There is a sin leading to death; I do not say one should pray about that.",
      "links": "<a href='/AIV/40/12/31'>Matthew 12:31</a>; <a href='/AIV/62/1/9'>1 John 1:9</a>",
      "comment": "The distinction between sin not leading to death and sin leading to death is significant. The Church has always recognized degrees of sin—some that wound, others that sever communion with God. This presumes a communal authority to discern and forgive, and gestures towards sacramental reconciliation."
    },
    {
      "pk": 2105117,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 17,
      "text": "All wrongdoing is sin, but there is sin that does not lead to death.",
      "links": "<a href='/AIV/62/3/4'>1 John 3:4</a>; <a href='/AIV/59/1/14-15'>James 1:14–15</a>",
      "comment": "The concept of mortal and non-mortal sins has early roots. Not every sin is fatal to spiritual life; some require conversion, some require deeper restoration—see <a href='/AIV/43/20/23'>John 20:23</a> for apostolic authority to forgive."
    },
    {
      "pk": 2105118,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 18,
      "text": "We know that everyone born of God does not continue in sin, but He who was born of God protects him, and the evil one does not touch him.",
      "links": "<a href='/AIV/43/17/12'>John 17:12</a>; <a href='/AIV/62/3/9'>1 John 3:9</a>",
      "comment": "Spiritual rebirth empowers resistance to sin, and Christ Himself protects those within His body. Note the spiritual interpretation: continuing in grace depends on living connection to Christ and His Church."
    },
    {
      "pk": 2105119,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 19,
      "text": "We know that we are from God, and the whole world lies in the power of the evil one.",
      "links": "<a href='/AIV/43/17/14-16'>John 17:14–16</a>; <a href='/AIV/62/2/15-16'>1 John 2:15–16</a>",
      "comment": "The distinction between those 'of God' and of 'the world' recurs throughout John. To remain 'from God' requires abiding in grace and truth."
    },
    {
      "pk": 2105120,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 20,
      "text": "And we know that the Son of God has come and has given us understanding, so that we may know Him who is true; and we are in Him who is true, in His Son Jesus Christ. He is the true God and eternal life.",
      "links": "<a href='/AIV/43/1/1'>John 1:1</a>; <a href='/AIV/43/10/30'>John 10:30</a>; <a href='/AIV/43/14/6-9'>John 14:6–9</a>",
      "comment": "Explicit Christological affirmation: Jesus Christ is 'the true God.' High Christology is central—His divinity and our communion in Him is foundational. The phrase 'we are in Him who is true' connects spiritual and sacramental union."
    },
    {
      "pk": 2105121,
      "translation": "AIV",
      "book": 62,
      "chapter": 5,
      "verse": 21,
      "text": "Little children, keep yourselves from idols.",
      "links": "<a href='/AIV/2/20/4'>Exodus 20:4</a>; <a href='/AIV/45/1/23'>Romans 1:23</a>",
      "comment": "Final admonition against idolatry shows the enduring challenge of fidelity. Only the true worship founded on Christ keeps us from error—pointing to right worship and unified faith as the safeguard."
    }
  ],
  "translatedAt": "2025-12-23T04:19:44.483Z"
}