{
  "book": "1 John",
  "bookAbbreviation": "1John",
  "chapter": 2,
  "verses": [
    {
      "pk": 2001001,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 1,
      "text": "My little children, I am writing these things to you so that you may not sin. But if anyone does sin, we have an Advocate with the Father, Jesus Christ the righteous one.",
      "links": "<a href='/AIV/45/8/34'>Rom. 8:34</a>; <a href='/AIV/58/7/25'>Heb. 7:25</a>",
      "comment": "Jesus as our Advocate points to His mediatory role (cf. 1 Tim 2:5), continually interceding for believers with the Father. The term 'righteous one' implies His sinless nature, echoing Isaiah 53:11."
    },
    {
      "pk": 2001002,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 2,
      "text": "He is the atoning sacrifice for our sins—and not for ours only, but also for those of the whole world.",
      "links": "<a href='/AIV/45/3/25'>Rom. 3:25</a>; <a href='/AIV/43/1/29'>John 1:29</a>",
      "comment": "The phrase 'atoning sacrifice' translates 'hilasmos,' signifying a sacrificial offering that removes guilt. Christ’s universal atonement links to Isaiah 53:6—the Lord lays on Him the sin of all."
    },
    {
      "pk": 2001003,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 3,
      "text": "By this we know that we have come to know Him: if we keep His commandments.",
      "links": "<a href='/AIV/43/14/15'>John 14:15</a>; <a href='/AIV/43/15/10'>John 15:10</a>",
      "comment": "Obedience is presented as the true evidence of knowing Christ, not simply professing faith. This is an ongoing, lived-out relationship with God (cf. Matt 7:21)."
    },
    {
      "pk": 2001004,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 4,
      "text": "Whoever says, 'I know Him,' but does not keep His commandments is a liar, and the truth is not in him.",
      "links": "<a href='/AIV/43/8/44'>John 8:44</a>; <a href='/AIV/60/1/22'>1 Pet. 1:22</a>",
      "comment": "A direct challenge to hypocrisy. Claiming fellowship with Christ must be matched by obedience to His words (see Matt 7:21-23)."
    },
    {
      "pk": 2001005,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 5,
      "text": "But whoever keeps His word, in him the love of God has truly been perfected. By this we know that we are in Him:",
      "links": "<a href='/AIV/43/14/23'>John 14:23</a>; <a href='/AIV/50/1/6'>Phil. 1:6</a>",
      "comment": "'Perfected' here means brought to fulfillment or maturity. True spiritual life is shown by both internal change and outward action."
    },
    {
      "pk": 2001006,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 6,
      "text": "Whoever says he abides in Him ought to walk in the same way in which He walked.",
      "links": "<a href='/AIV/47/5/17'>2 Cor. 5:17</a>; <a href='/AIV/60/2/21'>1 Pet. 2:21</a>",
      "comment": "To 'abide' is to remain intimately connected with Christ. To 'walk as He walked' means imitating Christ's life—echoing callings to holiness and imitation."
    },
    {
      "pk": 2001007,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 7,
      "text": "Beloved, I am not writing you a new commandment, but an old commandment that you had from the beginning; the old commandment is the word that you have already heard.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/51/3/14'>Col. 3:14</a>",
      "comment": "The 'old commandment' is understood as the command to love, present from the earliest teachings (Lev 19:18), yet made new in Christ (see next verse)."
    },
    {
      "pk": 2001008,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 8,
      "text": "Yet again, I am writing you a new commandment, which is true in Him and in you, because the darkness is passing away, and the true light is already shining.",
      "links": "<a href='/AIV/43/8/12'>John 8:12</a>; <a href='/AIV/43/1/9'>John 1:9</a>",
      "comment": "The love commandment is 'new' because it is fully revealed and enabled in Christ. The metaphor of light refers to the new age breaking in through Jesus."
    },
    {
      "pk": 2001009,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 9,
      "text": "Whoever says he is in the light but hates his brother is still in the darkness.",
      "links": "<a href='/AIV/40/5/43-45'>Matt. 5:43-45</a>; <a href='/AIV/62/3/14-15'>1 John 3:14-15</a>",
      "comment": "Genuine spiritual transformation results in love for others. Spiritual 'light' is not just correct belief, but the practice of charity."
    },
    {
      "pk": 2001010,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 10,
      "text": "Whoever loves his brother abides in the light, and in him there is no cause for stumbling.",
      "links": "<a href='/AIV/19/119/165'>Ps. 119:165</a>; <a href='/AIV/62/4/12'>1 John 4:12</a>",
      "comment": "Charity towards others is both a sign and source of walking in God’s light, producing peace and moral stability."
    },
    {
      "pk": 2001011,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 11,
      "text": "But whoever hates his brother is in the darkness and walks in the darkness, and does not know where he is going, because the darkness has blinded his eyes.",
      "links": "<a href='/AIV/40/15/14'>Matt 15:14</a>; <a href='/AIV/43/12/35'>John 12:35</a>",
      "comment": "Darkness is both a moral and spiritual state. Persistent hatred blinds a person’s heart, confirming their separation from God."
    },
    {
      "pk": 2001012,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 12,
      "text": "I am writing to you, little children, because your sins are forgiven for His name’s sake.",
      "links": "<a href='/AIV/40/9/2'>Matt. 9:2</a>; <a href='/AIV/43/20/31'>John 20:31</a>",
      "comment": "The focus here is on the foundational forgiveness given through the authority of Jesus’ name, underscoring the importance of the work of Christ in justification."
    },
    {
      "pk": 2001013,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 13,
      "text": "I am writing to you, fathers, because you have known Him who is from the beginning. I am writing to you, young men, because you have overcome the evil one. I write to you, children, because you have known the Father.",
      "links": "<a href='/AIV/43/17/3'>John 17:3</a>; <a href='/AIV/62/5/4-5'>1 John 5:4-5</a>",
      "comment": "The repetition emphasizes both spiritual progress and the collective nature of the Church: elders for their wisdom, youth for victory, and all for their knowledge of God."
    },
    {
      "pk": 2001014,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 14,
      "text": "I have written to you, fathers, because you have known Him who is from the beginning. I have written to you, young men, because you are strong, and the word of God remains in you, and you have overcome the evil one.",
      "links": "<a href='/AIV/43/1/1-2'>John 1:1-2</a>; <a href='/AIV/10/119/11'>Ps. 119:11</a>",
      "comment": "True spiritual strength comes from the indwelling Word. Perseverance and victory come by clinging to Divine revelation."
    },
    {
      "pk": 2001015,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 15,
      "text": "Do not love the world or the things in the world. If anyone loves the world, the love of the Father is not in him.",
      "links": "<a href='/AIV/40/6/24'>Matt. 6:24</a>; <a href='/AIV/59/4/4'>James 4:4</a>",
      "comment": "Here, 'the world' means the fallen, sinful system opposed to God. True love for God crowds out inordinate love for worldly desires."
    },
    {
      "pk": 2001016,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 16,
      "text": "For all that is in the world—the desires of the flesh, the desires of the eyes, and the pride of life—is not from the Father, but from the world.",
      "links": "<a href='/AIV/01/3/6'>Gen. 3:6</a>; <a href='/AIV/40/4/1-11'>Matt. 4:1-11</a>",
      "comment": "This echoes Eve's temptation (Gen 3:6) and Jesus’ temptations (Matt 4); these three categories summarize all forms of human temptation."
    },
    {
      "pk": 2001017,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 17,
      "text": "And the world is passing away along with its desires, but whoever does the will of God remains forever.",
      "links": "<a href='/AIV/19/102/26'>Ps. 102:26</a>; <a href='/AIV/43/6/27'>John 6:27</a>",
      "comment": "All worldly pursuits are fleeting, in contrast to the permanence of those who persevere in doing God’s will—pointing to eternal life."
    },
    {
      "pk": 2001018,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 18,
      "text": "Children, it is the last hour. And as you have heard that antichrist is coming, so now many antichrists have come. Therefore we know that it is the last hour.",
      "links": "<a href='/AIV/53/2/3-4'>2 Thess. 2:3-4</a>; <a href='/AIV/62/4/3'>1 John 4:3</a>",
      "comment": "'Last hour' indicates the final stage of redemptive history between Christ’s first and second coming, and the presence of 'antichrists' points to present dangers of false teaching and apostasy."
    },
    {
      "pk": 2001019,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 19,
      "text": "They went out from us, but they were not truly of us; for if they had been of us, they would have continued with us. But they went out so that it might be made clear that all of them are not of us.",
      "links": "<a href='/AIV/44/20/30'>Acts 20:30</a>; <a href='/AIV/40/24/24'>Matt. 24:24</a>",
      "comment": "Departure from the apostolic community is a mark of false teachers. True faith perseveres within the one Church established by Christ."
    },
    {
      "pk": 2001020,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 20,
      "text": "But you have an anointing from the Holy One, and all of you know the truth.",
      "links": "<a href='/AIV/46/1/21-22'>2 Cor. 1:21-22</a>; <a href='/AIV/43/14/26'>John 14:26</a>",
      "comment": "The 'anointing' refers to the Holy Spirit given at initiation into the Church, granting divine knowledge and guidance."
    },
    {
      "pk": 2001021,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 21,
      "text": "I write to you not because you do not know the truth, but because you know it, and because no lie comes from the truth.",
      "links": "<a href='/AIV/43/17/17'>John 17:17</a>; <a href='/AIV/60/1/22'>1 Pet. 1:22</a>",
      "comment": "Truth is self-consistent and rooted in Jesus’ revelation. The Spirit keeps the community in truth."
    },
    {
      "pk": 2001022,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 22,
      "text": "Who is the liar but the one who denies that Jesus is the Christ? This is the antichrist—the one who denies the Father and the Son.",
      "links": "<a href='/AIV/40/10/33'>Matt. 10:33</a>; <a href='/AIV/62/4/3'>1 John 4:3</a>",
      "comment": "To deny Jesus’ identity as Messiah and Son of God is to oppose the Gospel and to sever oneself from the Church’s faith."
    },
    {
      "pk": 2001023,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 23,
      "text": "No one who denies the Son has the Father. Whoever confesses the Son has the Father also.",
      "links": "<a href='/AIV/43/5/23'>John 5:23</a>; <a href='/AIV/45/10/9'>Rom. 10:9</a>",
      "comment": "The inseparable unity of Father and Son is emphasized. Full relationship with God depends on fidelity to the proclamation that Jesus is Lord."
    },
    {
      "pk": 2001024,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 24,
      "text": "Let what you have heard from the beginning remain in you. If what you heard from the beginning remains in you, then you also will remain in the Son and in the Father.",
      "links": "<a href='/AIV/48/1/8-9'>Gal. 1:8-9</a>; <a href='/AIV/43/15/4'>John 15:4</a>",
      "comment": "Holding fast to the apostolic Gospel is the means of remaining united to God. Faithfulness to original teaching preserves communion."
    },
    {
      "pk": 2001025,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 25,
      "text": "And this is the promise that He made to us—eternal life.",
      "links": "<a href='/AIV/43/3/16'>John 3:16</a>; <a href='/AIV/43/17/3'>John 17:3</a>",
      "comment": "Eternal life is not only a future hope but present participation—communion with Christ and the Father begun through faith and maintained by perseverance."
    },
    {
      "pk": 2001026,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 26,
      "text": "I have written these things to you about those who are trying to deceive you.",
      "links": "<a href='/AIV/40/24/4'>Matt. 24:4</a>; <a href='/AIV/44/20/29-31'>Acts 20:29-31</a>",
      "comment": "Vigilance against false teaching is necessary to preserve the truth handed down by the apostles."
    },
    {
      "pk": 2001027,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 27,
      "text": "As for you, the anointing that you received from Him remains in you, and you have no need for anyone to teach you. But just as His anointing teaches you about everything, and is true and is not a lie, so remain in Him, just as it has taught you.",
      "links": "<a href='/AIV/24/31/33-34'>Jer. 31:33-34</a>; <a href='/AIV/43/16/13'>John 16:13</a>",
      "comment": "'No need for anyone to teach' refers to the Spirit-led understanding present in the whole Church—not an encouragement for private interpretation but corporate fidelity to apostolic teaching (cf. Acts 2:42)."
    },
    {
      "pk": 2001028,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 28,
      "text": "And now, little children, remain in Him, so that when He appears, we may have confidence and not shrink away from Him in shame at His coming.",
      "links": "<a href='/AIV/43/14/3'>John 14:3</a>; <a href='/AIV/66/22/12'>Rev. 22:12</a>",
      "comment": "Ongoing faithfulness yields confidence at Christ’s return, highlighting the necessity of perseverance in grace."
    },
    {
      "pk": 2001029,
      "translation": "AIV",
      "book": 62,
      "chapter": 2,
      "verse": 29,
      "text": "If you know that He is righteous, you know that everyone who practices righteousness has been born of Him.",
      "links": "<a href='/AIV/40/7/16-20'>Matt. 7:16-20</a>; <a href='/AIV/43/3/3-8'>John 3:3-8</a>",
      "comment": "The evidence of genuine rebirth is ongoing righteous living. This spiritual rebirth is effected by grace through abiding in Christ—a theme linking new birth to both faith and a changed way of life."
    }
  ],
  "translatedAt": "2025-12-23T04:18:19.959Z"
}