{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 11,
  "verses": [
    {
      "pk": 7011001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 1,
      "text": "Now Jephthah the Gileadite was a mighty warrior, but he was the son of a prostitute. Gilead was his father.",
      "links": "<a href='/AIV/7/13/2'>Judg. 13:2</a>; <a href='/AIV/1/38/24'>Gen. 38:24</a>",
      "comment": "Jephthah's humble origins prefigure God raising up unlikely individuals for great missions. Compare with God's choosing of shepherds like David (1 Sam. 16:11-13), and see the theme of unexpected leaders in salvation history."
    },
    {
      "pk": 7011002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 2,
      "text": "Gilead’s wife also bore him sons, and when his wife’s sons grew up, they drove Jephthah out and said to him, 'You will not inherit anything in our father’s house, for you are the son of another woman.'",
      "links": "<a href='/AIV/1/21/10'>Gen. 21:10</a>; <a href='/AIV/48/4/30'>Gal. 4:30</a>",
      "comment": "This rejection echoes the expulsion of Ishmael and Joseph, yet God continually shows favor to the rejected, symbolizing spiritual adoption and redemption."
    },
    {
      "pk": 7011003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 3,
      "text": "So Jephthah fled from his brothers and lived in the land of Tob. Worthless men gathered around Jephthah and went out with him.",
      "links": "<a href='/AIV/9/22/1-2'>1 Sam. 22:1-2</a>",
      "comment": "Like David in exile, Jephthah attracted those discontented, hinting at leadership emerging from suffering and rejection—an image fulfilled in Christ's gathering of the marginalized."
    },
    {
      "pk": 7011004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 4,
      "text": "Some time passed, and the Ammonites made war against Israel.",
      "links": "<a href='/AIV/7/10/7'>Judg. 10:7</a>",
      "comment": "Conflict arises after a period of peace, a recurring pattern in Judges that illustrates the cycles of sin, repentance, and deliverance."
    },
    {
      "pk": 7011005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 5,
      "text": "When the Ammonites attacked Israel, the elders of Gilead went to fetch Jephthah from the land of Tob.",
      "links": "<a href='/AIV/7/3/9'>Judg. 3:9</a>",
      "comment": "The rejected one is sought in time of crisis, highlighting how God can turn rejection into restoration and leadership—see Christ's stone the builders rejected (Ps. 118:22; Matt. 21:42)."
    },
    {
      "pk": 7011006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 6,
      "text": "They said to Jephthah, 'Come and be our leader so we can fight the Ammonites.'",
      "links": "<a href='/AIV/7/4/6'>Judg. 4:6</a>",
      "comment": "Jephthah is called to leadership during need, a familiar biblical motif of God's providence in choosing instruments for deliverance from oppression."
    },
    {
      "pk": 7011007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 7,
      "text": "Jephthah answered the elders of Gilead, 'Didn’t you hate me and drive me from my father’s house? Why do you come to me now when you’re in trouble?'",
      "links": "<a href='/AIV/1/50/20'>Gen. 50:20</a>",
      "comment": "This recalls Joseph’s forgiveness and standing before his brothers, showing that reconciliation is a theme tied to God's justice and mercy."
    },
    {
      "pk": 7011008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 8,
      "text": "The elders of Gilead said to Jephthah, 'That is why we have turned to you now, so that you may go with us and fight the Ammonites and be our head over all the people of Gilead.'",
      "links": "<a href='/AIV/7/10/18'>Judg. 10:18</a>",
      "comment": "Leadership is conferred as a result of necessity; the role of 'head' signifies both ruler and deliverer. This duality echoes the spiritual headship in later theology."
    },
    {
      "pk": 7011009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 9,
      "text": "Jephthah said to them, 'If you bring me back to fight the Ammonites, and the Lord gives them to me, I will be your head.'",
      "links": "<a href='/AIV/7/4/9'>Judg. 4:9</a>",
      "comment": "Jephthah's leadership is conditional on divine deliverance, stressing reliance on God's will rather than human strength—a key biblical principle."
    },
    {
      "pk": 7011010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 10,
      "text": "The elders of Gilead said to Jephthah, 'The Lord will be a witness between us, if we do not do as you say.'",
      "links": "<a href='/AIV/1/31/50'>Gen. 31:50</a>",
      "comment": "Sworn promise before the Lord as witness signifies the seriousness of vows, a motif picked up in biblical teaching about oaths (Matt. 5:34-37)."
    },
    {
      "pk": 7011011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 11,
      "text": "So Jephthah went with the elders of Gilead, and the people made him head and commander over them. Jephthah repeated all his words before the Lord in Mizpah.",
      "links": "<a href='/AIV/1/35/7'>Gen. 35:7</a>; <a href='/AIV/7/10/17'>Judg. 10:17</a>",
      "comment": "The solemn commitment at Mizpah signals the sanctity of leadership established with public declaration before God, a precursor to formalized religious leadership."
    },
    {
      "pk": 7011012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 12,
      "text": "Jephthah sent messengers to the king of the Ammonites, asking, 'What do you have against me that you have come to attack my land?'",
      "links": "<a href='/AIV/4/32/20'>Num. 32:20-22</a>",
      "comment": "Diplomacy precedes warfare, showing God's people seeking peace before resorting to conflict—a recurring biblical ethic (Deut. 20:10-12)."
    },
    {
      "pk": 7011013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 13,
      "text": "The king of the Ammonites said to Jephthah’s messengers, 'Israel took away my land when they came up from Egypt, from the Arnon to the Jabbok and the Jordan. Now return those territories peacefully.'",
      "links": "<a href='/AIV/4/21/24'>Num. 21:24-26</a>; <a href='/AIV/5/2/9'>Deut. 2:9'>",
      "comment": "Land disputes recall earlier conquest narratives, placing Israel within the context of fulfillment of divine promises about the land (Gen. 15:18-21)."
    },
    {
      "pk": 7011014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 14,
      "text": "Jephthah again sent messengers to the king of the Ammonites,",
      "links": "<a href='/AIV/7/11/12'>Judg. 11:12</a>",
      "comment": "Persistent diplomacy echoes the patience and reasonableness expected from the people of God before military action."
    },
    {
      "pk": 7011015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 15,
      "text": "and told him, 'This is what Jephthah says: Israel did not take away the land of Moab nor the land of the Ammonites.'",
      "links": "<a href='/AIV/5/2/9'>Deut. 2:9</a>; <a href='/AIV/5/2/19'>Deut. 2:19</a>",
      "comment": "Historical clarification, stressing truthfulness, is a key aspect of biblical dispute resolution."
    },
    {
      "pk": 7011016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 16,
      "text": "'When Israel came up from Egypt, they went through the wilderness as far as the Red Sea and came to Kadesh.'",
      "links": "<a href='/AIV/4/14/25'>Num. 14:25</a>; <a href='/AIV/4/20/1'>Num. 20:1</a>",
      "comment": "Jephthah retells Israel's history of wandering—a reminder of divine guidance and protection, important for understanding God's providence."
    },
    {
      "pk": 7011017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 17,
      "text": "'Israel sent messengers to the king of Edom, saying, \"Please let us pass through your land.\" But the king of Edom would not listen. They also sent to the king of Moab, but he refused. So Israel stayed at Kadesh.'",
      "links": "<a href='/AIV/4/20/14'>Num. 20:14'</a>; <a href='/AIV/4/20/17'>Num. 20:17</a>",
      "comment": "Neighboring nations' refusal sets up the context for Israel’s later conflicts; demonstrates patience and nonaggression until necessary."
    },
    {
      "pk": 7011018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 18,
      "text": "'Then they traveled through the wilderness, went around the land of Edom and Moab, came to the east side of the land of Moab, and camped on the other side of Arnon. They did not enter the territory of Moab, for Arnon was its border.'",
      "links": "<a href='/AIV/5/2/18'>Deut. 2:18-19</a>",
      "comment": "Israel respects boundaries, again highlighting covenant observance and faithfulness to divine direction."
    },
    {
      "pk": 7011019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 19,
      "text": "'Israel then sent messengers to Sihon king of the Amorites, who ruled in Heshbon, and said, \"Let us pass through your land to our own place.\"'",
      "links": "<a href='/AIV/4/21/21'>Num. 21:21</a>",
      "comment": "Israel's request for passage remains consistent with their peaceful approach, underlining the importance of dialogue before conflict."
    },
    {
      "pk": 7011020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 20,
      "text": "'But Sihon did not trust Israel to pass through his territory. He gathered all his people and camped at Jahaz and fought against Israel.'",
      "links": "<a href='/AIV/4/21/23'>Num. 21:23</a>",
      "comment": "Hostility from Sihon led to battle—a reminder of the consequences of refusing peaceful overtures."
    },
    {
      "pk": 7011021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 21,
      "text": "'The Lord God of Israel delivered Sihon and all his people into Israel’s hand, and Israel defeated them and took possession of all the land of the Amorites who lived in that region.'",
      "links": "<a href='/AIV/4/21/24'>Num. 21:24</a>; <a href='/AIV/5/2/33'>Deut. 2:33'</a>",
      "comment": "Victory is ascribed to God alone, emphasizing divine action and the theological motif of the Lord as the true Deliverer."
    },
    {
      "pk": 7011022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 22,
      "text": "'They took possession of all the territory of the Amorites, from the Arnon to the Jabbok, and from the wilderness to the Jordan.'",
      "links": "<a href='/AIV/4/21/24'>Num. 21:24</a>",
      "comment": "The completeness of the conquest signifies fulfillment of divine promise and prefigures God's sovereignty over all things."
    },
    {
      "pk": 7011023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 23,
      "text": "'Now since the Lord God of Israel has driven out the Amorites from before His people Israel, should you now possess their land?'",
      "links": "<a href='/AIV/5/2/34'>Deut. 2:34</a>",
      "comment": "Jephthah appeals to divine authority for land ownership—echoes the concept of stewardship under God, which has spiritual connotations for all believers."
    },
    {
      "pk": 7011024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 24,
      "text": "'Will you not possess what your god Chemosh gives you? So we will possess the land that the Lord our God has given us.'",
      "links": "<a href='/AIV/5/4/7'>Deut. 4:7</a>",
      "comment": "Recognition of religious differences foreshadows later debates on true worship and Biblical monotheism, implicitly supporting the idea of one true faith."
    },
    {
      "pk": 7011025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 25,
      "text": "'Are you better than Balak son of Zippor, king of Moab? Did he ever contend with Israel or fight against them?'",
      "links": "<a href='/AIV/4/22/4'>Num. 22:4</a>",
      "comment": "Jephthah references earlier history to show consistency in Israel's dealings; the comparison with Balak points to the wisdom in seeking peaceful resolutions."
    },
    {
      "pk": 7011026,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 26,
      "text": "'For three hundred years Israel has lived in Heshbon, Aroer, and all the towns along the Arnon. Why haven't you tried to retake them before now?'",
      "links": "<a href='/AIV/4/21/25'>Num. 21:25</a>",
      "comment": "Three centuries of occupation support Israel's legitimacy. The lengthy period adds historical gravity to the claim, which echoes the biblical sense of inherited promise."
    },
    {
      "pk": 7011027,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 27,
      "text": "'I have not wronged you, but you are doing me wrong by making war against me. May the Lord, the Judge, decide today between the Israelites and the Ammonites.'",
      "links": "<a href='/AIV/1/18/25'>Gen. 18:25</a>; <a href='/AIV/19/7/11'>Ps. 7:11</a>",
      "comment": "God is invoked as the ultimate Judge, prefiguring Christ’s role as final Judge (John 5:22). A spiritual reading sees Christ as the one who sets true justice."
    },
    {
      "pk": 7011028,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 28,
      "text": "But the king of the Ammonites paid no attention to the message Jephthah sent him.",
      "links": "<a href='/AIV/9/10/27'>1 Sam. 10:27</a>",
      "comment": "The rejection of peace and truth results in conflict, showing the consequences of rejecting God’s overtures of grace."
    },
    {
      "pk": 7011029,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 29,
      "text": "Then the Spirit of the Lord came upon Jephthah, and he passed through Gilead and Manasseh, then to Mizpah of Gilead, and from there advanced against the Ammonites.",
      "links": "<a href='/AIV/2/24/2'>Exod. 24:2</a>; <a href='/AIV/7/3/10'>Judg. 3:10</a>",
      "comment": "Jephthah is empowered by the Spirit—a sign of charismatic leadership. Such empowerment typifies the Spirit's role in New Testament Church leaders and saints."
    },
    {
      "pk": 7011030,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 30,
      "text": "Jephthah made a vow to the Lord and said, 'If you give the Ammonites into my hand,",
      "links": "<a href='/AIV/1/28/20'>Gen. 28:20'</a>; <a href='/AIV/19/22/25'>Ps. 22:25</a>",
      "comment": "Vows in Scripture are a deeply serious matter, reflecting the need for reverence and caution regarding promises made to God."
    },
    {
      "pk": 7011031,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 31,
      "text": "'then whatever comes out from the doors of my house to meet me when I return in peace from the Ammonites shall be the Lord’s, and I will offer it up as a burnt offering.'",
      "links": "<a href='/AIV/3/27/2'>Lev. 27:2'</a>; <a href='/AIV/19/76/11'>Ps. 76:11</a>",
      "comment": "This rash vow has later tragic consequences. Is a warning on the discernment required in making sacred promises. Also illustrates the gravity of devotion to God."
    },
    {
      "pk": 7011032,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 32,
      "text": "So Jephthah crossed over to the Ammonites to fight against them, and the Lord gave them into his hand.",
      "links": "<a href='/AIV/7/3/10'>Judg. 3:10</a>; <a href='/AIV/19/44/3'>Ps. 44:3</a>",
      "comment": "Victory is attributed to the Lord’s intervention rather than to human strategy, a theme central to biblical salvation history."
    },
    {
      "pk": 7011033,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 33,
      "text": "He struck them from Aroer to the area near Minnith, twenty cities, as far as Abel-keramim. Thus, the Ammonites were greatly subdued before the Israelites.",
      "links": "<a href='/AIV/7/4/23'>Judg. 4:23</a>",
      "comment": "A decisive victory reveals God’s saving power and mirrors the total defeat of evil by Christ."
    },
    {
      "pk": 7011034,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 34,
      "text": "When Jephthah came to his house at Mizpah, behold, his daughter came out to meet him with tambourines and dances. She was his only child; he had no other son or daughter.",
      "links": "<a href='/AIV/2/15/20'>Exod. 15:20</a>; <a href='/AIV/10/6/14'>2 Sam. 6:14</a>",
      "comment": "The joyful greeting recalls Miriam’s celebration; yet the narrative turns tragically, hinting at the cost of rash vows."
    },
    {
      "pk": 7011035,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 35,
      "text": "When he saw her, he tore his clothes and said, 'Alas, my daughter! You have devastated me! You have brought me misery—for I have made a vow to the Lord that I cannot take back.'",
      "links": "<a href='/AIV/3/10/6'>Lev. 10:6</a>; <a href='/AIV/4/30/2'>Num. 30:2</a>",
      "comment": "The irrevocability of vows to God is highlighted, showing the gravity with which promises to the Divine should be approached."
    },
    {
      "pk": 7011036,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 36,
      "text": "She replied, 'My father, you have given your word to the Lord; do to me just as you promised, since the Lord has avenged you of your enemies, the Ammonites.'",
      "links": "<a href='/AIV/19/15/4'>Ps. 15:4</a>",
      "comment": "Jephthah’s daughter’s submission is reminiscent of the sacrifice of Isaac and prefigures Christ’s obedience to His Father, whose will He accepts even unto death."
    },
    {
      "pk": 7011037,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 37,
      "text": "She also said to her father, 'Let me do this one thing: Allow me two months to wander the hills and weep with my friends because I will never marry.'",
      "links": "<a href='/AIV/19/55/6'>Ps. 55:6</a>",
      "comment": "Her focus is on the loss of marriage and family, showing the depth of her sacrifice. This passage is often interpreted as emphasizing the virtue of self-giving and purity."
    },
    {
      "pk": 7011038,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 38,
      "text": "'Go,' he said. So he sent her away for two months, and she and her friends went and mourned her virginity in the hills.",
      "links": "<a href='/AIV/19/45/14'>Ps. 45:14</a>",
      "comment": "The mourning of her virginity, rather than her life, further supports theological readings of her fate as perpetual dedication to God rather than literal sacrifice."
    },
    {
      "pk": 7011039,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 39,
      "text": "After two months, she returned to her father, and he did to her as he had vowed. She had never known a man. So it became a custom in Israel",
      "links": "<a href='/AIV/1/22/2'>Gen. 22:2</a>; <a href='/AIV/19/45/10'>Ps. 45:10</a>",
      "comment": "Some see Jephthah’s fulfillment of the vow as literal, others as dedicating his daughter to lifelong consecration and virginity—the text allows for both interpretations. This mirrors themes of total devotion found later in apostolic history."
    },
    {
      "pk": 7011040,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 11,
      "verse": 40,
      "text": "that each year the daughters of Israel would go out for four days to commemorate the daughter of Jephthah the Gileadite.",
      "links": "<a href='/AIV/19/78/4'>Ps. 78:4</a>",
      "comment": "The annual remembrance points toward the communal nature of spiritual memory and honor of the faithful, hinting at future patterns of honoring exemplary devotion within the community of believers."
    }
  ],
  "translatedAt": "2025-12-24T02:37:07.242Z"
}