{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 7,
  "verses": [
    {
      "pk": 7007001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 1,
      "text": "Then Jerubbaal (that is, Gideon) and all the people who were with him rose early and camped beside the spring of Harod. The camp of Midian was north of them, by the hill of Moreh, in the valley.",
      "links": "<a href='/AIV/7/6/32'>Judg. 6:32</a>; <a href='/AIV/7/6/33'>Judg. 6:33</a>",
      "comment": "Jerubbaal is another name for Gideon, given after he broke down the altar of Baal (Judg. 6:32). This sets the stage for God's impending deliverance through a small faithful remnant."
    },
    {
      "pk": 7007002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 2,
      "text": "The LORD said to Gideon, 'The people with you are too many for me to hand over Midian to them, or Israel would boast against me, saying, \"My own hand has saved me.\"'",
      "links": "<a href='/AIV/5/8/17'>Deut. 8:17</a>; <a href='/AIV/1/32/7'>Gen. 32:7</a>",
      "comment": "God desires Israel to know that salvation comes from Him, not by human strength. This foreshadows the New Testament themes of grace and humility (cf. Eph. 2:8-9)."
    },
    {
      "pk": 7007003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 3,
      "text": "Now therefore announce in the hearing of the people, ‘Whoever is fearful and trembling, let him return home and depart from Mount Gilead.’' So twenty-two thousand of the people returned, and ten thousand remained.",
      "links": "<a href='/AIV/5/20/8'>Deut. 20:8</a>",
      "comment": "God purifies His people by allowing the fearful to depart first, much like how God refines His followers to rely on Him alone."
    },
    {
      "pk": 7007004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 4,
      "text": "Then the LORD said to Gideon, 'The people are still too many; bring them down to the water, and I will test them for you there. Anyone of whom I say, \"This one shall go with you,\" shall go with you; and anyone of whom I say to you, \"This one shall not go with you,\" shall not go.'",
      "links": "<a href='/AIV/1/22/1'>Gen. 22:1</a>",
      "comment": "God tests and selects, demonstrating His sovereignty to choose whom He will use for His purposes. This is often seen as a prefiguration of God’s choosing of the faithful remnant."
    },
    {
      "pk": 7007005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 5,
      "text": "So he brought the people down to the water. And the LORD said to Gideon, 'Everyone who laps the water with his tongue like a dog, set him by himself. Likewise, everyone who kneels down to drink.'",
      "links": "<a href='/AIV/7/7/6'>Judg. 7:6</a>",
      "comment": "The odd selection by water lapping or kneeling is a way God narrows the force further, showing His victory does not depend on outward means."
    },
    {
      "pk": 7007006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 6,
      "text": "And the number of those who lapped, putting their hand to their mouth, was three hundred men; all the rest knelt down to drink water.",
      "links": "<a href='/AIV/7/7/7'>Judg. 7:7</a>",
      "comment": "God reduces Gideon's army to a mere 300, emphasizing His saving power through a faithful, chosen remnant, a theme later reflected in Christ choosing the Twelve (Luke 6:13)."
    },
    {
      "pk": 7007007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 7,
      "text": "Then the LORD said to Gideon, 'With the three hundred men who lapped I will save you and give the Midianites into your hand. Let all the others go, each to his own place.'",
      "links": "<a href='/AIV/1/18/32'>Gen. 18:32</a>; <a href='/AIV/2/14/14'>Ex. 14:14</a>",
      "comment": "Victory will be by God's power alone, not numbers. God regularly works through small groups to accomplish His will, anticipating Christ building his Church from a handful of faithful apostles."
    },
    {
      "pk": 7007008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 8,
      "text": "So the people took provisions in their hands, and their trumpets. And Gideon sent all the rest of Israel, every man to his tent, but retained the three hundred men. Now the camp of Midian was below him in the valley.",
      "links": "<a href='/AIV/7/7/16'>Judg. 7:16</a>",
      "comment": "The chosen remain with simple provisions and trumpets—God’s methods are sometimes unexpected. The trumpet parallels the use of ordinary elements for God’s extraordinary work."
    },
    {
      "pk": 7007009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 9,
      "text": "That same night the LORD said to him, 'Arise, go down against the camp, for I have given it into your hand.'",
      "links": "<a href='/AIV/5/31/8'>Deut. 31:8</a>",
      "comment": "God’s assurance foreshadows His promise of victory over spiritual enemies for those who trust Him."
    },
    {
      "pk": 7007010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 10,
      "text": "But if you are afraid to go down, go down to the camp with Purah your servant.",
      "links": "<a href='/AIV/2/4/10'>Ex. 4:10-16</a>",
      "comment": "God shows His understanding of human fear and provides encouragement through a companion (cf. Ex. 4:10-16, God sending Aaron with Moses)."
    },
    {
      "pk": 7007011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 11,
      "text": "And you shall hear what they say, and afterward your hands will be strengthened to go down against the camp.' Then he went down with Purah his servant to the outposts of the armed men who were in the camp.",
      "links": "<a href='/AIV/1/26/24'>Gen. 26:24</a>",
      "comment": "God graciously provides signs to strengthen faith, paralleling how Christ strengthened His disciples before sending them out (Matt. 28:20)."
    },
    {
      "pk": 7007012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 12,
      "text": "Now Midian and Amalek and all the people of the east lay along the valley as numerous as locusts. And their camels were without number, as the sand on the seashore in multitude.",
      "links": "<a href='/AIV/1/22/17'>Gen. 22:17</a>",
      "comment": "The enemy’s vast number highlights the miraculous nature of God’s victory—His people overcome overwhelming odds not by might, but by His Spirit (compare Zech. 4:6)."
    },
    {
      "pk": 7007013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 13,
      "text": "When Gideon came, behold, a man was telling a dream to his friend. He said, 'Behold, I dreamed a dream, and behold, a cake of barley bread tumbled into the camp of Midian and came to the tent and struck it so that it fell and turned it upside down, so that the tent lay flat.'",
      "links": "<a href='/AIV/1/40/8'>Gen. 40:8</a>",
      "comment": "Dreams are often used in Scripture for God’s revelation (e.g., Joseph in Genesis), here pointing to God’s plan and sovereignty."
    },
    {
      "pk": 7007014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 14,
      "text": "And his friend answered, 'This is no other than the sword of Gideon the son of Joash, a man of Israel! God has given Midian and all the camp into his hand.'",
      "links": "<a href='/AIV/7/6/14'>Judg. 6:14</a>",
      "comment": "God’s enemies themselves testify to His sovereignty, an example of the truth being declared even outside the chosen people."
    },
    {
      "pk": 7007015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 15,
      "text": "As soon as Gideon heard the telling of the dream and its interpretation, he worshiped. He returned to the camp of Israel and said, 'Arise, for the LORD has given the army of Midian into your hand.'",
      "links": "<a href='/AIV/4/15/14'>Josh. 15:14</a>",
      "comment": "True faith leads to worship and obedience. Gideon’s worship before victory shows trust in God’s word."
    },
    {
      "pk": 7007016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 16,
      "text": "He divided the three hundred men into three companies and put trumpets into the hands of all of them and empty jars, with torches inside the jars.",
      "links": "<a href='/AIV/7/7/8'>Judg. 7:8</a>",
      "comment": "Symbols of God’s power: trumpets for announcement, jars for weakness, torches for light. Light concealed and then revealed echoes Christ as the Light of the world (John 8:12)."
    },
    {
      "pk": 7007017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 17,
      "text": "And he said to them, 'Look at me, and do likewise. When I come to the outskirts of the camp, do as I do.'",
      "links": "<a href='/AIV/1/22/16'>Gen. 22:16</a>",
      "comment": "Leadership by example is a biblical principle; Gideon’s model points to the call for leaders to imitate Christ (1 Cor. 11:1)."
    },
    {
      "pk": 7007018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 18,
      "text": "'When I blow the trumpet, I and all who are with me, then you blow the trumpets also on every side of all the camp and shout, “For the LORD and for Gideon!”'",
      "links": "<a href='/AIV/6/1/20'>Josh. 6:20</a>",
      "comment": "Like the fall of Jericho, the use of trumpets and a shout points to God’s ways overturning human expectations (compare Josh. 6:20)."
    },
    {
      "pk": 7007019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 19,
      "text": "So Gideon and the hundred men who were with him came to the outskirts of the camp at the beginning of the middle watch, just after they had posted the watch. And they blew the trumpets and broke the jars that were in their hands.",
      "links": "<a href='/AIV/7/7/16'>Judg. 7:16</a>",
      "comment": "The breaking of jars and shining forth of light can symbolize the breaking of the old self to let God’s light shine (cf. 2 Cor. 4:7)."
    },
    {
      "pk": 7007020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 20,
      "text": "Then the three companies blew the trumpets and broke the jars. They held the torches in their left hands and the trumpets in their right hands for blowing, and they cried out, 'A sword for the LORD and for Gideon!'",
      "links": "<a href='/AIV/7/7/18'>Judg. 7:18</a>",
      "comment": "The shout emphasizes that victory belongs to God, and the sword symbolizes His power and judgment."
    },
    {
      "pk": 7007021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 21,
      "text": "They stood every man in his place around the camp, and all the army ran; they cried out and fled.",
      "links": "<a href='/AIV/1/19/19'>Gen. 19:19</a>",
      "comment": "God fights the battle for His people; standing firm and trusting God brings victory."
    },
    {
      "pk": 7007022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 22,
      "text": "When they blew the three hundred trumpets, the LORD set every man’s sword against his comrade and against all the army. And the army fled as far as Beth-shittah toward Zererah, as far as the border of Abel-meholah, by Tabbath.",
      "links": "<a href='/AIV/2/14/24'>Ex. 14:24</a>",
      "comment": "God causes confusion among His enemies—Israel’s victory is by divine intervention, not human might, prefiguring the spiritual warfare of Christians (Eph. 6:12)."
    },
    {
      "pk": 7007023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 23,
      "text": "And the men of Israel were called out from Naphtali, and from Asher, and from all Manasseh, and they pursued Midian.",
      "links": "<a href='/AIV/7/6/35'>Judg. 6:35</a>",
      "comment": "The tribes are united under one leader, a sign of the importance of visible unity among God’s people, which echoes the call for unity in Christ (John 17:21)."
    },
    {
      "pk": 7007024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 24,
      "text": "And Gideon sent messengers throughout all the hill country of Ephraim, saying, 'Come down against the Midianites and seize the waters ahead of them, as far as Beth-barah and also the Jordan.' So all the men of Ephraim were called out and they seized the waters as far as Beth-barah and the Jordan.",
      "links": "<a href='/AIV/7/12/1'>Judg. 12:1</a>",
      "comment": "Securing the waters prevents the enemy’s escape—God’s wisdom is enacted through human response to His guidance. The involvement of other tribes is a reminder of the call to cooperate in God’s work."
    },
    {
      "pk": 7007025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 7,
      "verse": 25,
      "text": "They captured the two princes of Midian, Oreb and Zeeb. They killed Oreb at the rock of Oreb, and Zeeb they killed at the winepress of Zeeb. Then they pursued Midian, and they brought the heads of Oreb and Zeeb to Gideon across the Jordan.",
      "links": "<a href='/AIV/7/8/3'>Judg. 8:3</a>",
      "comment": "Ultimate victory is brought to completion through unity and obedience. The leaders are brought to Gideon, highlighting the role of the appointed leader in God’s saving work—just as Christ is the chief shepherd who ensures the final victory over evil (1 Pet. 5:4)."
    }
  ],
  "translatedAt": "2025-12-24T02:34:35.303Z"
}