{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 17,
  "verses": [
    {
      "pk": 7017001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 1,
      "text": "There was a man from the hill country of Ephraim named Micah.",
      "links": "<a href='/AIV/6/24/33'>Josh. 24:33</a>",
      "comment": "Micah's origin in Ephraim is notable, given Ephraim's spiritual significance in Israel's history. This foreshadows important religious themes, especially regarding true worship, which become pivotal in the chapter."
    },
    {
      "pk": 7017002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 2,
      "text": "He said to his mother, 'The eleven hundred pieces of silver that were taken from you, about which you uttered a curse, and spoke in my hearing—look, the silver is with me. I took it.' His mother said, 'May you be blessed by the LORD, my son.'",
      "links": "<a href='/AIV/1/27/36'>Gen. 27:36</a>; <a href='/AIV/18/42/10'>Job 42:10</a>",
      "comment": "Micah confesses the theft, prompting his mother's blessing to counter the curse, showing the role of spoken blessing and curse in biblical life. The family context emphasizes repentance and restoration, echoing themes of reconciliation and forgiveness."
    },
    {
      "pk": 7017003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 3,
      "text": "He returned the eleven hundred pieces of silver to his mother. Then his mother said, 'I solemnly consecrate this silver to the LORD from my hand for my son, to make a carved image and a cast metal image. Now I will return it to you.'",
      "links": "<a href='/AIV/2/20/4'>Ex. 20:4</a>; <a href='/AIV/5/27/15'>Deut. 27:15</a>",
      "comment": "Despite consecrating the silver to God, the creation of images directly contradicts the command against idolatry (Ex. 20:4). This reveals the confusion and syncretism in Israel during the time, stressing the need for proper worship ordered as instructed by God."
    },
    {
      "pk": 7017004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 4,
      "text": "So he returned the silver to his mother, and she took two hundred pieces and gave them to a silversmith, who made them into a carved image and a cast metal image. These were placed in Micah’s house.",
      "links": "<a href='/AIV/1/35/2'>Gen. 35:2</a>; <a href='/AIV/12/10/18'>1 Kgs. 10:18</a>",
      "comment": "Micah's home becomes a center for personal religion, showing the fragmentation of Israelite worship without central guidance. The act reflects human attempts to approach God without full obedience, echoing humanity's tendency toward self-directed spirituality."
    },
    {
      "pk": 7017005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 5,
      "text": "Micah had a shrine. He made an ephod and household gods, and ordained one of his sons, who became his priest.",
      "links": "<a href='/AIV/9/6/14'>1 Sam. 6:14</a>; <a href='/AIV/2/28/4'>Ex. 28:4</a>",
      "comment": "Micah's establishment of a private shrine and priesthood shows a deviation from God's prescribed order, where priesthood was limited to those set apart by divine election. This underscores the need for a unified, apostolic order for worship."
    },
    {
      "pk": 7017006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 6,
      "text": "In those days there was no king in Israel; everyone did what was right in his own eyes.",
      "links": "<a href='/AIV/7/21/25'>Judg. 21:25</a>; <a href='/AIV/20/14/12'>Prov. 14:12</a>",
      "comment": "This refrain highlights the period's moral and spiritual disorder, paving the way for the later establishment of divinely guided kingship and centralized authority, which foreshadows the coming of Christ as the ultimate head and shepherd of the faithful."
    },
    {
      "pk": 7017007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 7,
      "text": "Now there was a young man from Bethlehem in Judah, of the family of Judah, who was a Levite; and he was staying there.",
      "links": "<a href='/AIV/4/13/33'>Num. 13:33</a>; <a href='/AIV/5/10/8'>Deut. 10:8</a>",
      "comment": "Bethlehem is noteworthy as the future birthplace of Christ, and the appearance of a wandering Levite underscores Israel’s spiritual disorder, where Levites—meant for religious service—are displaced, setting up the narrative for the restoration of proper worship."
    },
    {
      "pk": 7017008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 8,
      "text": "The man departed from the town of Bethlehem in Judah to seek a place to live. As he journeyed, he came to the hill country of Ephraim, to the house of Micah.",
      "links": "<a href='/AIV/1/12/8'>Gen. 12:8</a>; <a href='/AIV/6/21/20'>Josh. 21:20</a>",
      "comment": "The Levite's journey signifies a search for purpose and spiritual home, which mirrors humanity’s longing for true worship and belonging. It also emphasizes the need for legitimate spiritual leadership and a sacred dwelling."
    },
    {
      "pk": 7017009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 9,
      "text": "Micah said to him, 'Where do you come from?' He replied, 'I am a Levite from Bethlehem in Judah, and I am seeking a place to stay.'",
      "links": "<a href='/AIV/11/13/2'>1 Chr. 13:2</a>; <a href='/AIV/5/18/6'>Deut. 18:6</a>",
      "comment": "Micah's encounter with the Levite presents an opportunity for restored sacred service, though it is sought outside the prescribed order. It calls attention to the importance of authentic ordination and spiritual authority."
    },
    {
      "pk": 7017010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 10,
      "text": "Micah said to him, 'Stay with me and be a father and priest to me. I will give you ten pieces of silver a year, a set of clothes, and your provision.' So the Levite agreed to stay.",
      "links": "<a href='/AIV/2/28/1'>Ex. 28:1</a>; <a href='/AIV/3/7/9'>Lev. 7:9</a>",
      "comment": "Micah’s offer invokes the term 'father,' implying spiritual guidance and authority, reminiscent of later ideas of priestly fatherhood. Yet, it illustrates human attempts to define spiritual leadership apart from God’s established means."
    },
    {
      "pk": 7017011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 11,
      "text": "The Levite was content to stay with the man, and the young man became like one of his sons.",
      "links": "<a href='/AIV/12/2/26'>1 Kgs. 2:26</a>; <a href='/AIV/9/10/6'>1 Sam. 10:6</a>",
      "comment": "This relationship blurs sacred boundaries, with the Levite treated as both priest and family. It highlights the confusion between familial and spiritual roles, calling for clarity and proper distinction established by God."
    },
    {
      "pk": 7017012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 12,
      "text": "Micah ordained the Levite, and the young man became his priest, and lived in Micah’s house.",
      "links": "<a href='/AIV/5/21/5'>Deut. 21:5</a>; <a href='/AIV/9/2/28'>1 Sam. 2:28</a>",
      "comment": "Micah appoints the Levite without proper authority, illustrating dangers of unauthorized ministry and the importance of apostolic succession and legitimate priestly office."
    },
    {
      "pk": 7017013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 17,
      "verse": 13,
      "text": "Then Micah said, 'Now I know that the LORD will do good to me, since I have a Levite as priest.'",
      "links": "<a href='/AIV/2/28/41'>Ex. 28:41</a>; <a href='/AIV/9/2/35'>1 Sam. 2:35</a>",
      "comment": "Micah’s confidence stems from outward religious conformity, mistaking mere ritual for true worship. This sets up the foundational lesson that genuine blessing and grace flow from divinely instituted order, ultimately fulfilled in Christ, the true priest and king."
    }
  ],
  "translatedAt": "2025-12-24T02:40:25.587Z"
}