{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 1,
  "verses": [
    {
      "pk": 7001001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 1,
      "text": "After the death of Joshua, the Israelites asked the LORD, \"Who among us should go up first against the Canaanites to fight for us?\"",
      "links": "<a href='/AIV/6/24/29'>Josh. 24:29</a>; <a href='/AIV/9/23/2'>1 Sam. 23:2</a>",
      "comment": "The transition after Joshua's death calls to mind the need for continued divine guidance in the absence of a single leader. The Israelites' seeking of God's will foreshadows later moments where guidance is sought through established leaders and traditions."
    },
    {
      "pk": 7001002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 2,
      "text": "The LORD replied, \"Judah shall go up. Look, I have delivered the land into his hand.\"",
      "links": "<a href='/AIV/1/49/8'>Gen. 49:8</a>; <a href='/AIV/6/15/1'>Josh. 15:1</a>",
      "comment": "God appoints Judah, fulfilling the earlier prophecy regarding the tribe's prominence (Gen. 49:8), and showing His sovereignty in both choosing leaders and granting victory. Christ would later descend from this tribe, making this passage significant for understanding salvation history."
    },
    {
      "pk": 7001003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 3,
      "text": "Judah said to Simeon his brother, \"Come up with me into the territory allotted to me, so that we may fight against the Canaanites together. Then I will go with you into your allotted land.\" So Simeon went with him.",
      "links": "<a href='/AIV/6/19/1'>Josh. 19:1</a>",
      "comment": "Judah and Simeon cooperate as brothers to conquer the promised land, reflecting the value of unity among the tribes. This foreshadows the need for unity within God's people under established authority."
    },
    {
      "pk": 7001004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 4,
      "text": "When Judah went up, the LORD delivered the Canaanites and the Perizzites into their hands, and they struck down ten thousand men at Bezek.",
      "links": "<a href='/AIV/6/10/8'>Josh. 10:8</a>",
      "comment": "God's faithfulness is displayed as He grants victory. The number ten thousand indicates a vast triumph—victory comes from God's hand."
    },
    {
      "pk": 7001005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 5,
      "text": "They found Adoni-bezek at Bezek and fought against him. They struck down the Canaanites and the Perizzites.",
      "links": "<a href='/AIV/7/4/2'>Judg. 4:2</a>",
      "comment": "Adoni-bezek's defeat signals both the justice and mercy that God brings: the defeat of the oppressor and the beginning of a new order in the land."
    },
    {
      "pk": 7001006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 6,
      "text": "Adoni-bezek fled, but they pursued him, captured him, and cut off his thumbs and big toes.",
      "links": "<a href='/AIV/1/29/20-21'>Gen. 29:20-21</a>",
      "comment": "The cutting off of thumbs and big toes is symbolic: it renders a king unable to fight or run, demonstrating the severity of judgment against wickedness."
    },
    {
      "pk": 7001007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 7,
      "text": "Adoni-bezek said, \"Seventy kings with their thumbs and big toes cut off used to pick up scraps under my table. As I have done, so God has repaid me.\" And they brought him to Jerusalem, and he died there.",
      "links": "<a href='/AIV/19/18/25-26'>Ps. 18:25-26</a>; <a href='/AIV/40/7/2'>Matt. 7:2</a>",
      "comment": "Adoni-bezek acknowledges divine justice. The principle of measure-for-measure judgment (Matt. 7:2) is illustrated here, anticipating Christ’s later teaching on mercy and justice."
    },
    {
      "pk": 7001008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 8,
      "text": "The men of Judah fought against Jerusalem, captured it, struck it with the sword, and set the city on fire.",
      "links": "<a href='/AIV/6/15/63'>Josh. 15:63</a>",
      "comment": "The capture of Jerusalem at this early stage prepares its later significance as the holy city uniting the tribes. Eventually, it becomes the center for worship, foreshadowing a higher spiritual reality."
    },
    {
      "pk": 7001009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 9,
      "text": "Afterward, the men of Judah went down to fight against the Canaanites living in the hill country, the Negev, and the lowlands.",
      "links": "<a href='/AIV/6/10/40'>Josh. 10:40</a>",
      "comment": "The three regions represent the fullness of the land. The gradual taking of territory is typical of spiritual maturation—growth does not occur at once, but through perseverance and cooperation with God."
    },
    {
      "pk": 7001010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 10,
      "text": "Judah went against the Canaanites living in Hebron (formerly called Kiriath-arba) and struck down Sheshai, Ahiman, and Talmai.",
      "links": "<a href='/AIV/6/15/13-14'>Josh. 15:13-14</a>",
      "comment": "The mention of the city’s former name reminds the reader of the continuity between the patriarchs (Abraham dwelt in Hebron) and the conquest."
    },
    {
      "pk": 7001011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 11,
      "text": "From there, they marched against the people living in Debir (previously called Kiriath-sepher).",
      "links": "<a href='/AIV/6/15/15'>Josh. 15:15</a>",
      "comment": "Place names are preserved to link the new Hebrew order to the existing geography, demonstrating the transformation of the land into a place dedicated to God."
    },
    {
      "pk": 7001012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 12,
      "text": "Caleb said, \"I will give my daughter Achsah in marriage to whoever attacks and captures Kiriath-sepher.\"",
      "links": "<a href='/AIV/6/15/16'>Josh. 15:16</a>",
      "comment": "Caleb’s challenge and promise illustrate the importance of faithfulness and reward. Marriage as a reward links family, inheritance, and the sanctification of the people."
    },
    {
      "pk": 7001013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 13,
      "text": "Othniel son of Kenaz, Caleb’s younger brother, captured it. So Caleb gave him his daughter Achsah as his wife.",
      "links": "<a href='/AIV/6/15/17'>Josh. 15:17</a>",
      "comment": "Othniel becomes the first deliverer (judge) later in the book, prefiguring Christ as deliverer. Marriage again binds together faithful obedience and blessing."
    },
    {
      "pk": 7001014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 14,
      "text": "When Achsah came to Othniel, she urged him to ask her father for a field. When she got off her donkey, Caleb asked her, \"What do you want?\"",
      "links": "<a href='/AIV/6/15/18'>Josh. 15:18</a>",
      "comment": "Achsah shows initiative, a model of intercessory petition. Seeking blessing from the father can also be read in spiritual terms regarding prayer and seeking graces."
    },
    {
      "pk": 7001015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 15,
      "text": "She answered, \"Give me a blessing. Since you have given me land in the Negev, give me also springs of water.\" So Caleb gave her the upper and lower springs.",
      "links": "<a href='/AIV/6/15/19'>Josh. 15:19</a>; <a href='/AIV/43/4/10'>John 4:10</a>",
      "comment": "Springs of water represent life and blessing. Christ later promises living water to those who ask (John 4:10), reflecting the abundance of spiritual grace."
    },
    {
      "pk": 7001016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 16,
      "text": "The descendants of the Kenite, Moses’ father-in-law, went up with the people of Judah from the city of palms into the wilderness of Judah, which is in the Negev near Arad. They went and lived among the people there.",
      "links": "<a href='/AIV/2/3/1'>Exod. 3:1</a>; <a href='/AIV/6/1/16'>Josh. 1:16</a>",
      "comment": "The presence of non-Israelites (Kenites) within Israel's inheritance reflects how God’s covenant family extends beyond mere physical lineage—a foreshadowing of inclusivity to come."
    },
    {
      "pk": 7001017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 17,
      "text": "Then Judah went with his brother Simeon, and they struck down the Canaanites living in Zephath and completely destroyed the city. So it was called Hormah.",
      "links": "<a href='/AIV/4/21/2-3'>Num. 21:2-3</a>",
      "comment": "Total destruction, or herem, is both judgment and consecration to God, showing that not all things may remain but all must be offered to God."
    },
    {
      "pk": 7001018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 18,
      "text": "Judah also captured Gaza, Ashkelon, and Ekron—each with its territory.",
      "links": "<a href='/AIV/6/13/3'>Josh. 13:3</a>",
      "comment": "These important Philistine cities, later significant in Israel’s history, are brought under Judah’s dominion, highlighting their role as guardians of God’s people."
    },
    {
      "pk": 7001019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 19,
      "text": "The LORD was with Judah, and he took possession of the hill country, but they could not drive out the people living in the valley because they had iron chariots.",
      "links": "<a href='/AIV/6/17/16-18'>Josh. 17:16-18</a>",
      "comment": "Though God is with Judah, their partial failure shows the need for continued reliance and perseverance. Obstacles require trust, not discouragement—a lesson for spiritual perseverance."
    },
    {
      "pk": 7001020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 20,
      "text": "Hebron was given to Caleb, as Moses had said, and he drove out from there the three sons of Anak.",
      "links": "<a href='/AIV/6/14/13-15'>Josh. 14:13-15</a>",
      "comment": "Faithful obedience to God’s promise results in Caleb’s reward. The defeat of the Anakim, giants, is a victory of faith and prefigures the conquest of spiritual evils."
    },
    {
      "pk": 7001021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 21,
      "text": "But the Benjaminites did not drive out the Jebusites living in Jerusalem; so to this day, the Jebusites live there with the Benjaminites.",
      "links": "<a href='/AIV/6/15/63'>Josh. 15:63</a>",
      "comment": "Incomplete obedience has lasting consequences. The enduring presence of the Jebusites in Jerusalem hints at partial faithfulness and the slow progress of sanctification."
    },
    {
      "pk": 7001022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 22,
      "text": "The house of Joseph also went up against Bethel, and the LORD was with them.",
      "links": "<a href='/AIV/6/18/13'>Josh. 18:13</a>",
      "comment": "Again, divine presence guarantees success, but only in partnership with faithful action. Bethel's significance as a site of God’s appearance to Jacob (Gen. 28:19) underlines its spiritual importance."
    },
    {
      "pk": 7001023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 23,
      "text": "The house of Joseph sent men to spy out Bethel (the city’s name used to be Luz).",
      "links": "<a href='/AIV/1/28/19'>Gen. 28:19</a>",
      "comment": "The renaming from Luz to Bethel, meaning 'House of God,' signals the transformation of places through God’s presence and worship."
    },
    {
      "pk": 7001024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 24,
      "text": "The spies saw a man coming out of the city and said to him, \"Please show us the way into the city, and we will deal kindly with you.\"",
      "links": "<a href='/AIV/6/2/12-14'>Josh. 2:12-14</a>",
      "comment": "This is reminiscent of Rahab’s actions in Jericho, reiterating the importance of mercy shown even to those outside Israel in exchange for cooperation and kindness."
    },
    {
      "pk": 7001025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 25,
      "text": "He showed them the entrance to the city, and they struck the city with the sword, but they let the man and his whole family go.",
      "links": "<a href='/AIV/6/6/22-23'>Josh. 6:22-23</a>",
      "comment": "Faithfulness to promises, even to outsiders, is an important biblical theme. God’s justice is always balanced by mercy."
    },
    {
      "pk": 7001026,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 26,
      "text": "The man went to the land of the Hittites and built a city, which he named Luz, and that was its name to this day.",
      "links": "<a href='/AIV/1/28/19'>Gen. 28:19</a>",
      "comment": "The story's cyclical nature (renewed Luz) points to the enduring influence of God’s people, but also the persistence of the old order outside the promised land."
    },
    {
      "pk": 7001027,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 27,
      "text": "Manasseh did not drive out the people of Beth-shean, Taanach, Dor, Ibleam, or Megiddo and their surrounding towns. The Canaanites were determined to live in that land.",
      "links": "<a href='/AIV/6/17/11-12'>Josh. 17:11-12</a>",
      "comment": "Partial obedience leads to persistent struggles. Spiritually, unrooted sin or compromise often resists removal, showing the need for ongoing conversion."
    },
    {
      "pk": 7001028,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 28,
      "text": "When Israel became strong, they made the Canaanites serve as forced labor, but they did not drive them out completely.",
      "links": "<a href='/AIV/1/15/13-15'>Gen. 15:13-15</a>",
      "comment": "Rather than full obedience, they opt for convenience, which shapes the nation’s spiritual trajectory and lays the groundwork for future challenges."
    },
    {
      "pk": 7001029,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 29,
      "text": "Ephraim did not drive out the Canaanites living in Gezer; so the Canaanites lived among them in Gezer.",
      "links": "<a href='/AIV/6/16/10'>Josh. 16:10</a>",
      "comment": "The theme continues: ongoing compromises with worldly influences make for spiritual struggles among God’s people."
    },
    {
      "pk": 7001030,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 30,
      "text": "Zebulun did not drive out the inhabitants of Kitron or Nahalol, so the Canaanites lived among them but served as forced labor.",
      "links": "<a href='/AIV/6/19/15'>Josh. 19:15</a>",
      "comment": "Partial subjugation without total transformation mirrors the temptation to compromise in the spiritual life, rather than total dedication."
    },
    {
      "pk": 7001031,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 31,
      "text": "Asher did not drive out the inhabitants of Acco, Sidon, Ahlab, Achzib, Helbah, Aphik, or Rehob.",
      "links": "<a href='/AIV/6/19/29-30'>Josh. 19:29-30</a>",
      "comment": "Despite receiving their portion, some tribes do not fully claim their inheritance, paralleling believers who do not fully live out their faith."
    },
    {
      "pk": 7001032,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 32,
      "text": "Asher lived among the Canaanite inhabitants of the land, for they did not drive them out.",
      "links": "<a href='/AIV/6/19/29-30'>Josh. 19:29-30</a>",
      "comment": "Coexistence with persistent pagan cultures foreshadows syncretism and future spiritual struggles."
    },
    {
      "pk": 7001033,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 33,
      "text": "Naphtali did not drive out the inhabitants of Beth-shemesh or Beth-anath, but lived among the Canaanites. Yet the inhabitants of Beth-shemesh and Beth-anath became forced labor for them.",
      "links": "<a href='/AIV/6/19/38'>Josh. 19:38</a>",
      "comment": "Forced subjugation without conversion or removal leads to internal divisions, foreshadowing the later fracturing of Israel."
    },
    {
      "pk": 7001034,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 34,
      "text": "The Amorites pressed the people of Dan back into the hill country, for they did not allow them to come down into the plain.",
      "links": "<a href='/AIV/6/19/40-48'>Josh. 19:40-48</a>",
      "comment": "Dan’s weakness leads to displacement. Perseverance in the faith and reliance on God's power is necessary to overcome worldly opposition."
    },
    {
      "pk": 7001035,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 35,
      "text": "The Amorites were determined to stay in Mount Heres, in Aijalon, and Shaalbim, but the hand of the house of Joseph grew strong, and they became subject to forced labor.",
      "links": "<a href='/AIV/6/10/12'>Josh. 10:12</a>",
      "comment": "Victory is gradual and requires sustained effort. The strength of the house of Joseph is a fruit of both faith and action."
    },
    {
      "pk": 7001036,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 1,
      "verse": 36,
      "text": "The border of the Amorites ran from the ascent of Akrabbim, from Sela and upward.",
      "links": "<a href='/AIV/6/15/3'>Josh. 15:3</a>",
      "comment": "The mention of borders situates the narrative historically and geographically. The clear distinctions between territories symbolize boundaries between God's people and the world, reinforcing the call to holiness and separation from sinful influence."
    }
  ],
  "translatedAt": "2025-12-24T02:30:51.942Z"
}