{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 20,
  "verses": [
    {
      "pk": 7020001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 1,
      "text": "Then all the children of Israel went out, and the congregation assembled as one man, from Dan to Beersheba, and from the land of Gilead, to the LORD at Mizpah.",
      "links": "<a href='/AIV/9/7/5'>1 Sam. 7:5</a>; <a href='/AIV/7/11/11'>Judg. 11:11</a>",
      "comment": "The unity of Israel here, 'as one man,' shows sacred assembly in which all tribes are meant to act together before God, prefiguring later understanding of Church unity."
    },
    {
      "pk": 7020002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 2,
      "text": "And the chiefs of all the tribes of Israel took their places in the assembly of the people of God, four hundred thousand men on foot who carried swords.",
      "links": "<a href='/AIV/7/20/17'>Judg. 20:17</a>; <a href='/AIV/2/12/37'>Num. 12:37</a>",
      "comment": "The organizing of the assembly emphasizes ordered leadership, foreshadowing later structured authority among God's people."
    },
    {
      "pk": 7020003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 3,
      "text": "Now the tribe of Benjamin heard that the people of Israel had gone up to Mizpah. And the people of Israel said, 'Tell us, how did this evil happen?'",
      "links": "<a href='/AIV/7/19/22-30'>Judg. 19:22-30</a>",
      "comment": "Benjamin is addressed as a distinct tribe; the fact evil within Israel must be investigated by the assembly signifies communal responsibility for sin among God's people."
    },
    {
      "pk": 7020004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 4,
      "text": "The Levite, the husband of the murdered woman, answered and said, 'My concubine and I came to Gibeah in Benjamin to spend the night.'",
      "links": "<a href='/AIV/7/19/15-28'>Judg. 19:15-28</a>",
      "comment": "The Levite, representing priestly class, explains the wrong. Relates to the seriousness of defilement and shows Israel's duty to uphold justice."
    },
    {
      "pk": 7020005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 5,
      "text": "'And the leaders of Gibeah rose against me and surrounded the house at night, intending to kill me; and they abused my concubine so that she died.'",
      "links": "<a href='/AIV/7/19/22-25'>Judg. 19:22-25</a>",
      "comment": "The sin is explained as not just sexual immorality, but hospitality violated and murder, drawing connections to similar sins in Sodom (Gen. 19:4-7)."
    },
    {
      "pk": 7020006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 6,
      "text": "'So I took my concubine, cut her into pieces, and sent her throughout all the territory of Israel, because they committed outrageous lewdness and folly in Israel.'",
      "links": "<a href='/AIV/7/19/29-30'>Judg. 19:29-30</a>",
      "comment": "This graphic act, though shocking, was meant to call all Israel together to deal with sin in their midst; an extreme call for justice reminiscent of ritual covenant discipline."
    },
    {
      "pk": 7020007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 7,
      "text": "'Behold, all you people of Israel, give your advice and counsel here.'",
      "links": "<a href='/AIV/7/20/18'>Judg. 20:18</a>; <a href='/AIV/4/9/20'>Deut. 9:20</a>",
      "comment": "All Israel is urged to discern and decide together; precedent for a council or assembly discerning right action, symbolism for discernment in Church councils."
    },
    {
      "pk": 7020008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 8,
      "text": "Then all the people arose as one man, saying, 'None of us will go to his tent, and none of us will return to his house.'",
      "links": "<a href='/AIV/2/32/26'>Ex. 32:26</a>",
      "comment": "Total unity is demanded for justice; strong imagery of national solidarity, which hints at undivided devotion to God's work together."
    },
    {
      "pk": 7020009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 9,
      "text": "'But now, this is what we shall do to Gibeah: we will go up against it by lot.'",
      "links": "<a href='/AIV/6/7/14'>Josh. 7:14</a>; <a href='/AIV/9/14/41-42'>1 Sam. 14:41-42</a>",
      "comment": "Consulting by lot would be seeking God's judgment; Israel is resolved to find the right path, reminiscent of how God's will was discerned in Apostolic times (Acts 1:26)."
    },
    {
      "pk": 7020010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 10,
      "text": "'And we will take ten men out of a hundred from all the tribes of Israel, and a hundred out of a thousand, and a thousand out of ten thousand, to get supplies for the people, so that when they come to Gibeah of Benjamin, they may repay all the outrage that has been committed in Israel.'",
      "links": "<a href='/AIV/7/5/8'>Judg. 5:8</a>",
      "comment": "The planned selection and organization highlights the importance of participation and provision in God’s work—reflecting how each believer shares in the work of the community."
    },
    {
      "pk": 7020011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 11,
      "text": "So all the men of Israel were gathered together against the city, united as one man.",
      "links": "<a href='/AIV/7/20/1'>Judg. 20:1</a>",
      "comment": "This repetition stresses Israel’s unity of purpose. Such unity anticipates later calls to communal faithfulness."
    },
    {
      "pk": 7020012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 12,
      "text": "And the tribes of Israel sent men throughout all the tribe of Benjamin, saying, 'What is this evil that has happened among you?'",
      "links": "<a href='/AIV/7/19/22-30'>Judg. 19:22-30</a>",
      "comment": "The approach is just: Israel seeks an explanation first, not rushing immediately to violence—order reflects a concern for both justice and opportunity for repentance."
    },
    {
      "pk": 7020013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 13,
      "text": "'Now therefore, hand over the wicked men in Gibeah, so that we may put them to death and remove evil from Israel.' But the Benjaminites would not listen to the voice of their brothers, the Israelites.",
      "links": "<a href='/AIV/5/13/5'>Deut. 13:5</a>; <a href='/AIV/7/21/6'>Judg. 21:6</a>",
      "comment": "Justice requires separation from grave sin. This foreshadows the later necessity of Church discipline for unrepentant sinners (cf. 1 Cor. 5:13)."
    },
    {
      "pk": 7020014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 14,
      "text": "But the Benjaminites gathered together out of the cities to Gibeah, to go out to battle against the people of Israel.",
      "links": "<a href='/AIV/7/20/20'>Judg. 20:20</a>",
      "comment": "Benjamin’s stubbornness leads to division and conflict; this warns against prideful defense of evil, rather than submitting to communal correction."
    },
    {
      "pk": 7020015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 15,
      "text": "And on that day the Benjaminites mustered out of their cities twenty-six thousand men who drew the sword, besides the inhabitants of Gibeah, who mustered seven hundred chosen men.",
      "links": "<a href='/AIV/7/20/2'>Judg. 20:2</a>",
      "comment": "Specific numbers highlight the seriousness of this conflict among brothers, setting the stage for an internal struggle among God's people."
    },
    {
      "pk": 7020016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 16,
      "text": "Among all these were seven hundred chosen men who were left-handed; each one could sling a stone at a hair and not miss.",
      "links": "<a href='/AIV/1/20/16'>1 Chron. 12:2</a>",
      "comment": "Left-handed warriors echo Ehud (Judg. 3:15) and show God sometimes uses unexpected means; skilled fighters fight for the wrong cause when misled."
    },
    {
      "pk": 7020017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 17,
      "text": "And the men of Israel, apart from Benjamin, mustered four hundred thousand men who drew the sword—all of them men of war.",
      "links": "<a href='/AIV/7/20/2'>Judg. 20:2</a>",
      "comment": "The sheer numbers contrast with the relatively small Benjamin, intensifying the gravity of division in the community."
    },
    {
      "pk": 7020018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 18,
      "text": "The children of Israel arose and went up to Bethel and inquired of God, 'Who shall go up first to battle against the Benjaminites?' And the LORD said, 'Judah shall go up first.'",
      "links": "<a href='/AIV/7/1/1-2'>Judg. 1:1-2</a>",
      "comment": "Judah is chosen, as in earlier passages, foreshadowing the messianic line and primacy among the tribes (Gen. 49:10; cf. Matt. 2:6)."
    },
    {
      "pk": 7020019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 19,
      "text": "So the people of Israel rose in the morning and camped against Gibeah.",
      "links": "<a href='/AIV/6/7/14'>Josh. 7:14</a>",
      "comment": "Israel’s advance shows their obedience to the divine guidance received at Bethel, a place associated with God's presence."
    },
    {
      "pk": 7020020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 20,
      "text": "And the men of Israel went out to battle against Benjamin, and the men of Israel lined up for battle against them at Gibeah.",
      "links": "<a href='/AIV/7/20/14'>Judg. 20:14</a>",
      "comment": "The battle is not just against outsiders but among God’s people—a lesson on the destructive nature of internal strife."
    },
    {
      "pk": 7020021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 21,
      "text": "The Benjaminites came out of Gibeah and destroyed on that day twenty-two thousand men of Israel.",
      "links": "<a href='/AIV/7/20/25'>Judg. 20:25</a>",
      "comment": "Surprisingly, the larger force suffers defeat, showing God does not always grant victory without discipline, even to the majority."
    },
    {
      "pk": 7020022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 22,
      "text": "But the people, the men of Israel, took courage and formed the battle line again in the same place where they had formed it on the first day.",
      "links": "<a href='/AIV/7/20/39'>Judg. 20:39</a>",
      "comment": "Despite loss, Israel perseveres—reflecting the call to steadfastness and ongoing repentance despite failures."
    },
    {
      "pk": 7020023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 23,
      "text": "Then the children of Israel went up and wept before the LORD until evening, and inquired of the LORD, saying, 'Shall we again draw near to battle against our brothers, the Benjaminites?' And the LORD said, 'Go up against them.'",
      "links": "<a href='/AIV/7/20/28'>Judg. 20:28</a>",
      "comment": "Their appeal to God through prayer and tears suggests that even rightful zeal must be refined by humility and submission to God."
    },
    {
      "pk": 7020024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 24,
      "text": "So the children of Israel drew near against the children of Benjamin on the second day.",
      "links": "",
      "comment": "Persistence in just action, even after suffering loss, conveys trust in God's justice."
    },
    {
      "pk": 7020025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 25,
      "text": "And Benjamin came out against them out of Gibeah the second day, and again destroyed eighteen thousand men of the children of Israel—all these drew the sword.",
      "links": "<a href='/AIV/7/20/21'>Judg. 20:21</a>",
      "comment": "This repeated defeat further humbles Israel, recalling the need for true contrition before action."
    },
    {
      "pk": 7020026,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 26,
      "text": "Then all the children of Israel, and all the people, went up and came to Bethel and wept; they sat there before the LORD, and fasted that day until evening, and offered burnt offerings and peace offerings before the LORD.",
      "links": "<a href='/AIV/9/7/6'>1 Sam. 7:6</a>",
      "comment": "Fasting and sacrificial worship before battle shows reliance on God, foreshadowing the importance of spiritual preparation and the sacrificial elements in worship."
    },
    {
      "pk": 7020027,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 27,
      "text": "And the children of Israel inquired of the LORD (for the ark of the covenant of God was there in those days),",
      "links": "<a href='/AIV/7/20/18'>Judg. 20:18</a>; <a href='/AIV/6/18/1'>Josh. 18:1</a>",
      "comment": "Reference to the ark emphasizes God's real, visible presence among His people—reminding us of how God uses tangible things to mediate His presence."
    },
    {
      "pk": 7020028,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 28,
      "text": "and Phinehas the son of Eleazar, son of Aaron, stood before it in those days, saying, 'Shall I yet again go out to battle against the sons of Benjamin my brother, or shall I cease?' And the LORD said, 'Go up, for tomorrow I will give them into your hand.'",
      "links": "<a href='/AIV/4/25/11-13'>Num. 25:11-13</a>",
      "comment": "Aaronic priesthood mediates between God and people, showing the continuing need for priestly intercession and ritual leadership among God's people."
    },
    {
      "pk": 7020029,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 29,
      "text": "So Israel set men in ambush all around Gibeah.",
      "links": "<a href='/AIV/6/8/2'>Josh. 8:2</a>",
      "comment": "Israel adopts a wise strategy; tactics and reason are not opposed to faith, but can be part of fulfilling God’s will."
    },
    {
      "pk": 7020030,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 30,
      "text": "And the children of Israel went up against the children of Benjamin on the third day, and lined up in battle order against Gibeah, as before.",
      "links": "<a href='/AIV/7/20/20'>Judg. 20:20</a>",
      "comment": "The mention of 'third day' parallels resurrection themes, which in later Christian understanding is a pattern of trial followed by victory (cf. Luke 24:7)."
    },
    {
      "pk": 7020031,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 31,
      "text": "The Benjaminites went out against the people, and were drawn away from the city; and, as at other times, they began to strike and kill some of the people in the highways, one of which goes up to Bethel and the other to Gibeah, and in the field about thirty men of Israel.",
      "links": "<a href='/AIV/7/20/39'>Judg. 20:39</a>",
      "comment": "Benjamin’s overconfidence repeats prior errors; God's judgment can allow initial success for the purpose of exposing pride."
    },
    {
      "pk": 7020032,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 32,
      "text": "The Benjaminites said, 'They are defeated before us, as at the first.' But the children of Israel said, 'Let us flee, and draw them away from the city to the highways.'",
      "links": "",
      "comment": "The wise retreat is part of the ambush plan; the narrative shows that discernment and strategy cooperate with faith."
    },
    {
      "pk": 7020033,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 33,
      "text": "And all the men of Israel rose up out of their place, and put themselves in battle order at Baal-tamar; and the men of Israel who were in ambush broke out of their place, even out of Maareh-geba.",
      "links": "",
      "comment": "The ambush at Baal-tamar underlines the value of unity in obeying a common plan, suggesting the importance of collaboration among God's people."
    },
    {
      "pk": 7020034,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 34,
      "text": "And there came against Gibeah ten thousand chosen men out of all Israel, and the battle was hard; but the Benjaminites did not know that disaster was close upon them.",
      "links": "<a href='/AIV/6/8/10-22'>Josh. 8:10-22</a>",
      "comment": "Stubbornness sometimes blinds one to imminent judgment--like the fate that overtakes those who resist God's truth."
    },
    {
      "pk": 7020035,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 35,
      "text": "And the LORD struck Benjamin before Israel, and the children of Israel destroyed that day twenty-five thousand one hundred men of Benjamin, all of whom drew the sword.",
      "links": "",
      "comment": "The victory belongs to the LORD, not merely human might—highlighting the principle that ultimate justice rests with God."
    },
    {
      "pk": 7020036,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 36,
      "text": "So the Benjaminites saw that they were defeated. And the men of Israel gave ground to Benjamin, because they relied on the ambush which they had set against Gibeah.",
      "links": "<a href='/AIV/7/20/29'>Judg. 20:29</a>",
      "comment": "Uses both natural strategy and divine guidance, reminding us that God’s people are to use reason as well as faith."
    },
    {
      "pk": 7020037,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 37,
      "text": "The men in ambush hurried and rushed upon Gibeah; the ambush drew forward and struck all the city with the edge of the sword.",
      "links": "<a href='/AIV/7/1/8'>Judg. 1:8</a>",
      "comment": "The judgment is thorough; it bears the character of total purification for the sake of justice—anticipating the call to be 'holy as God is holy.'"
    },
    {
      "pk": 7020038,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 38,
      "text": "Now the prearranged signal between the men of Israel and the ambush was that when they made a great cloud of smoke rise up from the city,",
      "links": "",
      "comment": "The coordinated signal mirrors ritual actions with symbolic meaning; visible markers help unite the people in purpose."
    },
    {
      "pk": 7020039,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 39,
      "text": "Then the men of Israel turned back, and the men of Benjamin were terrified, for they saw that disaster had come upon them.",
      "links": "",
      "comment": "Anxiety at the foe’s success demonstrates how overreliance on human strength fails in the face of God’s justice."
    },
    {
      "pk": 7020040,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 40,
      "text": "But when the cloud began to rise up out of the city in a pillar of smoke, the Benjaminites looked behind them, and behold, the whole city went up in smoke to heaven.",
      "links": "<a href='/AIV/1/19/28'>Gen. 19:28</a>",
      "comment": "The pillar of smoke recalls Sodom, linking the judgment for grave sin—pointing to the seriousness God gives to moral corruption within the people."
    },
    {
      "pk": 7020041,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 41,
      "text": "And when the men of Israel turned back, the men of Benjamin were dismayed, for they saw that disaster had come upon them.",
      "links": "",
      "comment": "God’s justice brings clarity; the Benjaminites could not escape the consequences of failing to repent."
    },
    {
      "pk": 7020042,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 42,
      "text": "Therefore they turned before the men of Israel into the way of the wilderness, but the battle overtook them; and those who came out of the cities destroyed them in the midst of them.",
      "links": "",
      "comment": "There is no escaping the consequences of moral rebellion; just as in the wilderness, those who rebel sometimes face divine judgment."
    },
    {
      "pk": 7020043,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 43,
      "text": "They surrounded the Benjaminites, pursued them, trampled them down as far as Gidreh opposite Gibeah toward the east.",
      "links": "",
      "comment": "Total defeat shows the result of persistent unrepentance within the community of God's people."
    },
    {
      "pk": 7020044,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 44,
      "text": "And eighteen thousand men of Benjamin fell, all these were men of valor.",
      "links": "",
      "comment": "The mention of the fallen men as 'men of valor' is a tragic note, showing even the brave are lost when they persist in error."
    },
    {
      "pk": 7020045,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 45,
      "text": "They turned and fled toward the wilderness to the rock of Rimmon, but five thousand of them were cut down on the highways. Then Israel pursued them to Gidom and struck down two thousand of them.",
      "links": "<a href='/AIV/7/21/13'>Judg. 21:13</a>",
      "comment": "Even in retreat, judgment follows them. The 'rock of Rimmon' would become a place for remnant survival—a theme picked up often in later salvation history."
    },
    {
      "pk": 7020046,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 46,
      "text": "So all who fell that day of Benjamin were twenty-five thousand men who drew the sword, all of them men of valor.",
      "links": "",
      "comment": "Restates the completeness of the loss—a record of how sin’s destructive power threatens even the strong."
    },
    {
      "pk": 7020047,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 47,
      "text": "But six hundred men turned and fled toward the wilderness to the rock of Rimmon, and they stayed at the rock of Rimmon for four months.",
      "links": "<a href='/AIV/7/21/13'>Judg. 21:13</a>",
      "comment": "The survival of a remnant hints at God’s mercy even after severe judgment—a recurring biblical theme (cf. Rom. 11:5)."
    },
    {
      "pk": 7020048,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 20,
      "verse": 48,
      "text": "And the men of Israel turned back against the children of Benjamin and struck them with the edge of the sword, both the entire city, the cattle, and all that they found. Every city they found, they set on fire.",
      "links": "<a href='/AIV/5/13/12-16'>Deut. 13:15-16</a>",
      "comment": "The utter destruction fulfills command for the removal of evil from the land—later interpreted spiritually as cutting off sin completely (cf. Matt. 5:29-30). Nevertheless, the earlier preservation of a remnant maintains the hope for restoration."
    }
  ],
  "translatedAt": "2025-12-24T02:42:50.625Z"
}