{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 9,
  "verses": [
    {
      "pk": 7009001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 1,
      "text": "Abimelech, son of Jerubbaal, went to Shechem, to his mother's brothers, and spoke to them and to all the clan of his mother's family.",
      "links": "<a href='/AIV/7/8/31'>Judg. 8:31</a>; <a href='/AIV/7/6/32'>Judg. 6:32</a>",
      "comment": "Abimelech initiates his campaign for power among his maternal kin, indicating the influence of family ties in ancient Israelite society. Jerubbaal refers to Gideon, underscoring continuity of leadership after the judges."
    },
    {
      "pk": 7009002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 2,
      "text": "\"Say in the ears of all the men of Shechem, 'Which is better for you, that all seventy sons of Jerubbaal rule over you, or that one man rules over you?' Remember, I am your own bone and flesh.\"",
      "links": "<a href='/AIV/1/29/14'>Gen. 29:14</a>; <a href='/AIV/7/8/30'>Judg. 8:30</a>",
      "comment": "Abimelech appeals to family loyalty, reflecting themes of unity and singular leadership found elsewhere in Scripture (Gen. 29:14). The question of one ruler prefigures later desires for a monarchy in Israel."
    },
    {
      "pk": 7009003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 3,
      "text": "His mother's brothers spoke all these words on his behalf in the ears of all the men of Shechem, and their hearts inclined after Abimelech, for they said, \"He is our brother.\"",
      "links": "<a href='/AIV/7/8/31'>Judg. 8:31</a>",
      "comment": "Family bond influences the political situation. Throughout the Old Testament, kinship often drives political alliances, highlighting the strength of familial unity in God’s plan."
    },
    {
      "pk": 7009004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 4,
      "text": "They gave him seventy pieces of silver out of the house of Baal-berith, with which Abimelech hired worthless and reckless men, and they followed him.",
      "links": "<a href='/AIV/7/8/33'>Judg. 8:33</a>; <a href='/AIV/7/9/46'>Judg. 9:46</a>",
      "comment": "Funds from a pagan sanctuary underscore Israel’s spiritual compromise. Abimelech’s hiring of mercenaries echoes patterns of distrust in divine providence and foreshadows tragic consequences instigated by forsaking God."
    },
    {
      "pk": 7009005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 5,
      "text": "And he went to his father's house in Ophrah and killed his brothers, the sons of Jerubbaal, seventy men, upon one stone. But Jotham, the youngest son of Jerubbaal, escaped and hid himself.",
      "links": "<a href='/AIV/7/8/30'>Judg. 8:30</a>; <a href='/AIV/7/21/6'>Judg. 21:6</a>",
      "comment": "Abimelech’s ruthless act of fratricide represents the destructive power of unchecked ambition. Jotham’s escape preserves a remnant, a recurring theme of deliverance in Scripture."
    },
    {
      "pk": 7009006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 6,
      "text": "All the men of Shechem and Beth-millo gathered together, and they went and made Abimelech king, by the oak of the pillar at Shechem.",
      "links": "<a href='/AIV/1/12/6'>Gen. 12:6</a>; <a href='/AIV/7/9/37'>Judg. 9:37</a>",
      "comment": "The coronation occurs at a significant location connected to earlier covenants (Gen. 12:6). The assertion of kingship diverges from the divine pattern of leadership established through the judges."
    },
    {
      "pk": 7009007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 7,
      "text": "When Jotham was told of it, he went and stood on top of Mount Gerizim, and called out in a loud voice, saying, \"Listen to me, men of Shechem, that God may listen to you!\"",
      "links": "<a href='/AIV/5/27/12'>Deut. 27:12</a>; <a href='/AIV/7/9/37'>Judg. 9:37</a>",
      "comment": "Gerizim was a site of blessing in Israel's history (Deut. 27:12). Jotham functions as prophet, warning of consequences. His appeal for the people to listen is echoed in Christ’s teachings (Mark 4:9)."
    },
    {
      "pk": 7009008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 8,
      "text": "The trees once went out to anoint a king over themselves, and they said to the olive tree, 'Reign over us.'",
      "links": "<a href='/AIV/7/9/15'>Judg. 9:15</a>",
      "comment": "Jotham’s parable uses the olive tree, a symbol of peace and prosperity, often representing Israel in Scripture (Ps. 52:8). The desire for a king over the trees allegorizes Abimelech’s claim to rule."
    },
    {
      "pk": 7009009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 9,
      "text": "But the olive tree said to them, 'Should I give up my fatness, by which gods and men are honored, to go and sway over the trees?'",
      "links": "<a href='/AIV/19/133/2'>Ps. 133:2</a>; <a href='/AIV/2/28/42'>Exod. 28:42</a>",
      "comment": "The olive tree refuses, valuing its divinely ordained purpose. Raises implication that true leaders serve with humility, not seek selfish rule—mirroring the servant leadership Christ exemplifies (<a href='/AIV/41/10/45'>Mark 10:45</a>)."
    },
    {
      "pk": 7009010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 10,
      "text": "Then the trees said to the fig tree, 'Come, reign over us.'",
      "links": "<a href='/AIV/24/24/7'>Jer. 24:7</a>; <a href='/AIV/40/21/19'>Matt. 21:19</a>",
      "comment": "Fig tree imagery is commonly associated with fruitfulness in Scripture. Fruits of faith and good works are parallels seen in both Testaments (Matt. 21:19)."
    },
    {
      "pk": 7009011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 11,
      "text": "But the fig tree said to them, 'Should I give up my sweetness and my good fruit, and go to sway over the trees?'",
      "links": "<a href='/AIV/19/34/8'>Ps. 34:8</a>",
      "comment": "Just as fig tree prefers to fulfill its original purpose, believers are likewise called to faithfully serve in their unique callings. Fruitfulness is spiritual as well as literal."
    },
    {
      "pk": 7009012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 12,
      "text": "Then the trees said to the vine, 'Come, reign over us.'",
      "links": "<a href='/AIV/43/15/1-5'>John 15:1-5</a>",
      "comment": "Vine imagery directly prefigures Christ, who identifies Himself as the true vine (John 15:1). The metaphor highlights the relationship between nourishment, growth, and spiritual leadership."
    },
    {
      "pk": 7009013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 13,
      "text": "But the vine said to them, 'Should I give up my wine, which cheers gods and men, and go to sway over the trees?'",
      "links": "<a href='/AIV/19/104/15'>Ps. 104:15</a>; <a href='/AIV/40/26/27-29'>Matt. 26:27-29</a>",
      "comment": "Wine is symbolic of joy and covenant blessing (Matt. 26:27-29). The vine focusing on its sacramental purpose foreshadows the deeper spiritual significance later fulfilled."
    },
    {
      "pk": 7009014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 14,
      "text": "Then all the trees said to the bramble, 'Come, reign over us.'",
      "links": "<a href='/AIV/2/3/18'>Exod. 3:18</a>",
      "comment": "The bramble, not fruitful, represents dangerous and worthless leadership. Symbolizes those who seek authority for themselves rather than for service—a foil to God’s ideal for His people."
    },
    {
      "pk": 7009015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 15,
      "text": "And the bramble said to the trees, 'If you truly anoint me as king over you, then come and take shelter in my shade. But if not, let fire come out of the bramble and devour the cedars of Lebanon!'",
      "links": "<a href='/AIV/19/29/5'>Ps. 29:5</a>; <a href='/AIV/23/2/13'>Isa. 2:13</a>",
      "comment": "Bramble’s threat of fire foreshadows the destructive consequences of appointing wicked leadership. The cedars of Lebanon signify strength, showing that poor leaders can destroy even the mighty."
    },
    {
      "pk": 7009016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 16,
      "text": "\"Now therefore, if you acted in good faith and integrity when you made Abimelech king, and if you have dealt well with Jerubbaal and his house and have done to him as his deeds deserved—\"",
      "links": "<a href='/AIV/9/1/3-7'>1 Sam. 12:3-7</a>",
      "comment": "Jotham’s warning is about honest dealings in leadership, a theme echoed in later prophets. God’s blessing often follows justice and righteousness."
    },
    {
      "pk": 7009017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 17,
      "text": "\"—for my father fought for you, risked his life, and delivered you out of the hand of Midian—\"",
      "links": "<a href='/AIV/7/8/28'>Judg. 8:28</a>",
      "comment": "Highlights Gideon’s selflessness. True spiritual leadership demands sacrifice, a principle fulfilled most perfectly in Christ’s own life for the sake of His people."
    },
    {
      "pk": 7009018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 18,
      "text": "\"But you have risen up against my father's house today and killed his sons—seventy men—on one stone, and made Abimelech, son of his female servant, king over the men of Shechem, because he is your brother.\"",
      "links": "<a href='/AIV/7/9/5'>Judg. 9:5</a>",
      "comment": "Jotham laments betrayal and injustice. The reference to Abimelech’s maternal lineage reflects Israel’s internal divisions, paralleling recurring themes of humility versus pride."
    },
    {
      "pk": 7009019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 19,
      "text": "\"If you then have acted in truth and integrity with Jerubbaal and his house today, rejoice in Abimelech, and let him also rejoice in you.\"",
      "links": "<a href='/AIV/19/32/11'>Ps. 32:11</a>",
      "comment": "Jotham’s conditional blessing displays the biblical concept of covenantal blessing dependent on righteousness—affirmed repeatedly through Old and New Covenant theology."
    },
    {
      "pk": 7009020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 20,
      "text": "\"But if not, let fire come out from Abimelech and devour the men of Shechem and Beth-millo; and let fire come out from the men of Shechem and from Beth-millo and devour Abimelech!\"",
      "links": "<a href='/AIV/7/20/48'>Judg. 20:48</a>",
      "comment": "Prophetic pronouncement—fire often symbolizes judgment in Scripture. This mirrors God’s ultimate justice displayed throughout the biblical narrative."
    },
    {
      "pk": 7009021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 21,
      "text": "Jotham fled and escaped to Beer, and lived there, because of Abimelech, his brother.",
      "links": "<a href='/AIV/1/16/14'>Gen. 16:14</a>; <a href='/AIV/19/55/6'>Ps. 55:6</a>",
      "comment": "The hiding of Jotham parallels other biblical figures who escape persecution, reminding readers of God’s providence for His chosen ones."
    },
    {
      "pk": 7009022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 22,
      "text": "Abimelech ruled over Israel for three years.",
      "links": "<a href='/AIV/7/10/2'>Judg. 10:2</a>",
      "comment": "Abimelech’s brief reign marks instability when leadership does not follow divine guidance. The number three has symbolic resonance with completeness in Scripture (Matt. 12:40)."
    },
    {
      "pk": 7009023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 23,
      "text": "Then God sent an evil spirit between Abimelech and the men of Shechem, and the men of Shechem dealt treacherously with Abimelech.",
      "links": "<a href='/AIV/9/16/14'>1 Sam. 16:14</a>; <a href='/AIV/19/78/49'>Ps. 78:49</a>",
      "comment": "Divine intervention serves as judgment against wickedness. God’s sovereignty is acknowledged, even amid evil, a principle shown in similar passages (1 Sam. 16:14)."
    },
    {
      "pk": 7009024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 24,
      "text": "This happened so that the violence against the seventy sons of Jerubbaal might be avenged, and their blood be laid on Abimelech their brother, who killed them, and on the men of Shechem, who aided him.",
      "links": "<a href='/AIV/1/4/10'>Gen. 4:10</a>; <a href='/AIV/7/9/5'>Judg. 9:5</a>",
      "comment": "The principle that innocent blood cries out for justice is fundamental in Scripture (Gen. 4:10). God’s justice ultimately prevails."
    },
    {
      "pk": 7009025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 25,
      "text": "The men of Shechem set ambushes for him on the mountain tops, and they robbed all who passed by. Abimelech was told of it.",
      "links": "<a href='/AIV/7/5/6'>Judg. 5:6</a>",
      "comment": "Shechem’s lawlessness reflects broader instability. The cycle of violence is a warning about abandonment of God’s order."
    },
    {
      "pk": 7009026,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 26,
      "text": "Gaal son of Ebed came with his brothers and went over to Shechem, and the men of Shechem put their trust in him.",
      "links": "<a href='/AIV/7/9/28'>Judg. 9:28</a>",
      "comment": "New challenger emerges, continuing the pattern of rebellion and contested leadership among God’s people."
    },
    {
      "pk": 7009027,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 27,
      "text": "They went out into the fields, gathered their grapes, trod them, and held a festival. They ate, drank, and cursed Abimelech.",
      "links": "<a href='/AIV/19/104/15'>Ps. 104:15</a>; <a href='/AIV/20/23/20'>Prov. 23:20</a>",
      "comment": "Harvest imagery recalls times of blessing and temptation. Their festival turns into open rebellion, highlighting misuse of God’s gifts for selfish purposes."
    },
    {
      "pk": 7009028,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 28,
      "text": "Gaal son of Ebed said, 'Who is Abimelech, and who are we of Shechem, that we should serve him? Is he not the son of Jerubbaal, and is not Zebul his officer? Serve the men of Hamor, the father of Shechem. But why should we serve him?'",
      "links": "<a href='/AIV/1/34/2'>Gen. 34:2</a>",
      "comment": "Gaal’s challenge appeals to heritage and legitimacy. The reference to Hamor harks back to Shechem’s founding (Gen. 34:2), showing the interplay of national identity and leadership."
    },
    {
      "pk": 7009029,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 29,
      "text": "Would that this people were under my hand! Then I would remove Abimelech.' He said to Abimelech, 'Increase your army and come out.'",
      "links": "<a href='/AIV/9/17/50'>1 Sam. 17:50</a>",
      "comment": "Gaal’s boast reveals reliance on human strength. This challenges God-centered leadership and foreshadows the downfall of man-centered rule."
    },
    {
      "pk": 7009030,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 30,
      "text": "When Zebul, ruler of the city, heard the words of Gaal son of Ebed, his anger was kindled.",
      "links": "<a href='/AIV/6/19/29'>Num. 19:29</a>",
      "comment": "Shechem’s internal conflict intensifies, reflecting division that comes from turning away from God’s unity and order."
    },
    {
      "pk": 7009031,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 31,
      "text": "He sent messengers to Abimelech secretly, saying, 'Gaal son of Ebed and his brothers have come to Shechem, and are stirring up the city against you.'",
      "links": "<a href='/AIV/12/7/10'>2 Kings 7:10</a>",
      "comment": "Secret communication echoes intrigue found in stories of monarchs and prophets, highlighting the dangers of disunity."
    },
    {
      "pk": 7009032,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 32,
      "text": "\"So now, go by night, you and the people who are with you, and lie in wait in the field.\"",
      "links": "<a href='/AIV/6/8/3'>Josh. 8:3</a>",
      "comment": "Tactics of ambush and warfare are common throughout Israel’s history, showing both wisdom and the peril of reliance on military might alone."
    },
    {
      "pk": 7009033,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 33,
      "text": "\"In the morning, as soon as the sun is up, rise early and rush upon the city. When he and the people with him come out against you, do whatever your hand finds to do.\"",
      "links": "<a href='/AIV/1/27/3'>Gen. 27:3</a>",
      "comment": "Initiative and action in battle is stressed. The phrase 'do what your hand finds to do' echoes idioms later applied to faithful service (Eccl. 9:10)."
    },
    {
      "pk": 7009034,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 34,
      "text": "So Abimelech and all the people with him rose up by night and lay in wait against Shechem in four companies.",
      "links": "<a href='/AIV/7/7/16'>Judg. 7:16</a>",
      "comment": "The four companies recall strategic divisions in prior biblical battles. Strategy is important, but ultimate victory belongs to those who align with God’s will."
    },
    {
      "pk": 7009035,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 35,
      "text": "Gaal son of Ebed went out and stood at the entrance of the city gate, and Abimelech and the people with him rose from the ambush.",
      "links": "<a href='/AIV/7/16/2'>Judg. 16:2</a>",
      "comment": "City gates are recurring places of judgment and decision (Gen. 19:1). The ambush marks the fulfillment of intrigue initiated earlier."
    },
    {
      "pk": 7009036,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 36,
      "text": "When Gaal saw the people, he said to Zebul, 'Look, people are coming down from the mountaintops.' But Zebul said to him, 'You mistake the shadow of the mountains for men.'",
      "links": "<a href='/AIV/19/121/1'>Ps. 121:1</a>",
      "comment": "Perception and reality contrast, as seen elsewhere in Scripture. Spiritual discernment is needed to avoid deception."
    },
    {
      "pk": 7009037,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 37,
      "text": "Gaal spoke again and said, 'Look, people are coming down from the center of the land, and one company is coming from the direction of the diviners' oak.'",
      "links": "<a href='/AIV/1/12/6'>Gen. 12:6</a>",
      "comment": "Reference to diviners' oak echoes places of worship and decision-making. Oak trees held significant meaning for ancient Israel."
    },
    {
      "pk": 7009038,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 38,
      "text": "Zebul said to him, 'Where is your mouth now, you who said, \"Who is Abimelech, that we should serve him?\" Are not these the people you despised? Go out now and fight with them.'",
      "links": "<a href='/AIV/7/9/28'>Judg. 9:28</a>",
      "comment": "Public challenge exposes Gaal’s pride and the folly of empty boasting—an enduring biblical warning against arrogance."
    },
    {
      "pk": 7009039,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 39,
      "text": "Gaal went out before the men of Shechem and fought Abimelech.",
      "links": "<a href='/AIV/7/9/28-29'>Judg. 9:28-29</a>",
      "comment": "Gaal’s conflict continues the pattern of futile resistance against divinely allowed authority—pointing towards God’s right ordering of leadership."
    },
    {
      "pk": 7009040,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 40,
      "text": "Abimelech chased him, and he fled before him, and many fell wounded, up to the entrance of the gate.",
      "links": "<a href='/AIV/7/20/48'>Judg. 20:48</a>",
      "comment": "Defeat follows opposition to God’s permitted ruler, a theme recurring in Israel’s history whenever the people rebel."
    },
    {
      "pk": 7009041,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 41,
      "text": "Abimelech stayed at Arumah, and Zebul drove out Gaal and his brothers from Shechem.",
      "links": "<a href='/AIV/7/9/30'>Judg. 9:30</a>",
      "comment": "Removal of rival parties establishes order but does not guarantee justice or peace—reflecting the imperfection of human governments compared to God’s kingdom."
    },
    {
      "pk": 7009042,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 42,
      "text": "On the next day, the people went out into the fields, and Abimelech was told.",
      "links": "<a href='/AIV/7/9/25'>Judg. 9:25</a>",
      "comment": "The cycle of violence resumes, paralleling persistent unrest without true spiritual order."
    },
    {
      "pk": 7009043,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 43,
      "text": "He took his people and divided them into three companies and laid in wait in the fields. He looked, and behold, the people were coming out of the city, and he rose against them and struck them down.",
      "links": "<a href='/AIV/7/7/16'>Judg. 7:16</a>",
      "comment": "Repeated use of tactical divisions echoes patterns seen in God-directed battles, although here the purpose is vengeance."
    },
    {
      "pk": 7009044,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 44,
      "text": "Abimelech and the companies with him rushed forward and stood at the entrance of the city gate. The two other companies attacked all those in the fields and struck them down.",
      "links": "<a href='/AIV/7/9/35'>Judg. 9:35</a>",
      "comment": "The entrance of the city gate marks a place of authority and control in Israelite society (Deut. 21:19)."
    },
    {
      "pk": 7009045,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 45,
      "text": "Abimelech fought against the city all that day. He captured the city, killed the people in it, and razed the city, sowing it with salt.",
      "links": "<a href='/AIV/5/29/23'>Deut. 29:23</a>",
      "comment": "Sowing with salt was a symbol of total destruction, reflecting both judgment and cleansing motifs found elsewhere in Scripture."
    },
    {
      "pk": 7009046,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 46,
      "text": "When all the leaders of the Tower of Shechem heard of it, they entered the stronghold of the house of Baal-berith.",
      "links": "<a href='/AIV/7/9/4'>Judg. 9:4</a>; <a href='/AIV/7/8/33'>Judg. 8:33</a>",
      "comment": "Turning to a pagan sanctuary for refuge underscores continued spiritual confusion and misplaced trust."
    },
    {
      "pk": 7009047,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 47,
      "text": "Abimelech was told that all the leaders of the Tower of Shechem were gathered together.",
      "links": "<a href='/AIV/7/9/46'>Judg. 9:46</a>",
      "comment": "Abimelech’s campaign continues with pursuit of those hiding in idolatrous places—reminding of God’s continual call to seek refuge in Him alone."
    },
    {
      "pk": 7009048,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 48,
      "text": "He went up to Mount Zalmon, he and all the people with him, and Abimelech took an axe in his hand and cut down a branch from the trees. He lifted it, put it on his shoulder, and said to the people with him, 'What you have seen me do, hurry and do as I have done.'",
      "links": "<a href='/AIV/11/19/21'>1 Kings 19:21</a>",
      "comment": "Leadership by example is central here. However, the context is destructive, not constructive—pointing towards the need for righteous leaders."
    },
    {
      "pk": 7009049,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 49,
      "text": "So all the people cut down branches, followed Abimelech, and put them at the stronghold, and set the stronghold on fire over them, so that all the people of the Tower of Shechem died, about a thousand men and women.",
      "links": "<a href='/AIV/7/20/48'>Judg. 20:48</a>; <a href='/AIV/1/19/8'>Gen. 19:8</a>",
      "comment": "Fiery judgment consumes both men and women, reminiscent of divine judgments in other passages (Gen. 19:8; Judg. 20:48)."
    },
    {
      "pk": 7009050,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 50,
      "text": "Then Abimelech went to Thebez and encamped against Thebez, and captured it.",
      "links": "<a href='/AIV/7/1/5'>Judg. 1:5</a>",
      "comment": "His campaign extends, but underlying instability persists where leaders are not centered on God's covenant and guidance."
    },
    {
      "pk": 7009051,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 51,
      "text": "But inside the city was a strong tower, and all the men and women, and all the leaders of the city fled there and shut themselves in, and went up to the roof of the tower.",
      "links": "<a href='/AIV/7/9/46'>Judg. 9:46</a>",
      "comment": "Towers symbolize both defense and isolation, echoing themes of security misplaced in human structures rather than in God."
    },
    {
      "pk": 7009052,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 52,
      "text": "Abimelech came to the tower, fought against it, and drew near to the door of the tower to burn it with fire.",
      "links": "<a href='/AIV/7/9/49'>Judg. 9:49</a>",
      "comment": "His pattern repeats—abuse of power results in violence, contrasting with Christ’s call to peace and sacrificial love."
    },
    {
      "pk": 7009053,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 53,
      "text": "But a certain woman threw an upper millstone down on Abimelech’s head and crushed his skull.",
      "links": "<a href='/AIV/7/4/21'>Judg. 4:21</a>; <a href='/AIV/1/3/15'>Gen. 3:15</a>",
      "comment": "The woman’s action evokes deliverance through unlikely instruments (Judg. 4:21). The crushing of the head is a motif that foreshadows the ultimate defeat of evil (Gen. 3:15)."
    },
    {
      "pk": 7009054,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 54,
      "text": "He quickly called to the young man, his armor-bearer, and said to him, 'Draw your sword and kill me, so people will not say of me, \"A woman killed him.\"' So his young man thrust him through, and he died.",
      "links": "<a href='/AIV/9/31/4'>1 Sam. 31:4</a>",
      "comment": "Abimelech’s concern for his legacy reveals pride, echoing Saul’s desperation (1 Sam. 31:4). True honor is found in obedience to God, not in self-preservation."
    },
    {
      "pk": 7009055,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 55,
      "text": "When the men of Israel saw that Abimelech was dead, they returned each to his own home.",
      "links": "<a href='/AIV/7/8/32'>Judg. 8:32</a>",
      "comment": "The end of Abimelech’s reign brings resolution and dispersal, reflecting that peace follows removal of unjust leaders."
    },
    {
      "pk": 7009056,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 56,
      "text": "Thus God repaid the wickedness of Abimelech, which he did to his father by killing his seventy brothers.",
      "links": "<a href='/AIV/19/94/1-3'>Ps. 94:1-3</a>; <a href='/AIV/7/9/5'>Judg. 9:5</a>",
      "comment": "Divine justice is enacted. God’s recompense is a central biblical principle—His sovereignty ensures justice ultimately prevails."
    },
    {
      "pk": 7009057,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 9,
      "verse": 57,
      "text": "And God also repaid all the wickedness of the men of Shechem on their heads. So upon them came the curse of Jotham son of Jerubbaal.",
      "links": "<a href='/AIV/7/9/20'>Judg. 9:20</a>; <a href='/AIV/5/28/15'>Deut. 28:15</a>",
      "comment": "Jotham’s curse is fulfilled, illustrating the certainty of God’s word and the seriousness of covenant faithfulness. This emphasizes blessing and curse dynamics foundational to Israel’s relationship with God."
    }
  ],
  "translatedAt": "2025-12-24T02:36:06.046Z"
}