{
  "book": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 16,
  "verses": [
    {
      "pk": 301061,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 1,
      "text": "Samson went to Gaza, and there he saw a prostitute, and he went in to her.",
      "links": "<a href='/AIV/7/15/20'>Judg. 15:20</a>",
      "comment": "This reflects the literal Hebrew; 'went in to her' means Samson had relations with her."
    },
    {
      "pk": 301062,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 2,
      "text": "The Gazites were told, 'Samson has come here.' So they surrounded the place and lay in wait for him all night at the gate of the city. They kept quiet all night, saying, 'In the morning, when he comes out, we will kill him.'",
      "links": "<a href='/AIV/7/15/10'>Judg. 15:10</a>",
      "comment": "Samson was trapped but unaware at this point of the plot against him."
    },
    {
      "pk": 301063,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 3,
      "text": "But Samson lay until midnight. At midnight he arose and took hold of the doors of the city gate and the two posts. He pulled them up, bar and all. He put them on his shoulders and carried them up to the top of the hill that is in front of Hebron.",
      "links": "<a href='/AIV/7/15/14'>Judg. 15:14</a>",
      "comment": "The word 'in front of Hebron' is a literal rendering. The feat demonstrates Samson's supernatural strength."
    },
    {
      "pk": 301064,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 4,
      "text": "After this he loved a woman in the Valley of Sorek, whose name was Delilah.",
      "links": "<a href='/AIV/7/16/6'>Judg. 16:6</a>",
      "comment": "Delilah may not have been a Philistine, strictly speaking; the text does not specify."
    },
    {
      "pk": 301065,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 5,
      "text": "The lords of the Philistines came up to her and said, 'Entice him, and find out what makes his strength so great, and how we can overpower him so that we may bind him to humble him. Each of us will give you eleven hundred pieces of silver.'",
      "links": "<a href='/AIV/7/14/15'>Judg. 14:15</a>",
      "comment": "The bribe offered is significant, showing the value placed on capturing Samson."
    },
    {
      "pk": 301066,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 6,
      "text": "So Delilah said to Samson, 'Please tell me what makes your strength so great, and how you can be bound so that you can be subdued.'",
      "links": "<a href='/AIV/7/16/15'>Judg. 16:15</a>",
      "comment": "Delilah openly asks about Samson's secret, foreshadowing subsequent attempts."
    },
    {
      "pk": 301067,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 7,
      "text": "Samson said to her, 'If they bind me with seven fresh bowstrings that have not been dried, then I shall become weak and be like any other man.'",
      "links": "<a href='/AIV/7/16/11'>Judg. 16:11</a>",
      "comment": "'Bowstrings' is literally 'cords' made from animal intestines."
    },
    {
      "pk": 301068,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 8,
      "text": "So the lords of the Philistines brought up to her seven fresh bowstrings that had not been dried, and she bound him with them.",
      "links": "<a href='/AIV/7/16/19'>Judg. 16:19</a>",
      "comment": "Delilah immediately acts on Samson's words to test him."
    },
    {
      "pk": 301069,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 9,
      "text": "Now she had men lying in ambush in an inner room. And she said to him, 'The Philistines are upon you, Samson!' But he snapped the bowstrings as a string of flax snaps when it touches fire. So the secret of his strength was not known.",
      "links": "<a href='/AIV/7/15/14'>Judg. 15:14</a>",
      "comment": "Breaking bowstrings like burned flax shows Samson's power is undiminished."
    },
    {
      "pk": 301070,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 10,
      "text": "Then Delilah said to Samson, 'You have mocked me and told me lies. Now please tell me how you can be bound.'",
      "links": "<a href='/AIV/7/16/13'>Judg. 16:13</a>",
      "comment": "Delilah accuses Samson of deceiving her, seeking to lure him with words."
    },
    {
      "pk": 301071,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 11,
      "text": "And he said to her, 'If they bind me with new ropes that have not been used, then I shall become weak and be like any other man.'",
      "links": "<a href='/AIV/7/15/13'>Judg. 15:13</a>",
      "comment": "Samson gives another misleading answer."
    },
    {
      "pk": 301072,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 12,
      "text": "So Delilah took new ropes and bound him with them and said to him, 'The Philistines are upon you, Samson!' And the men lying in ambush were in the inner room. But he broke them off his arms like a thread.",
      "links": "<a href='/AIV/7/15/14'>Judg. 15:14</a>",
      "comment": "'Like a thread' is a literal expression."
    },
    {
      "pk": 301073,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 13,
      "text": "Then Delilah said to Samson, 'Until now you have mocked me and told me lies. Tell me how you can be bound.' And he said to her, 'If you weave the seven locks of my head into the fabric of a loom.'",
      "links": "<a href='/AIV/7/16/19'>Judg. 16:19</a>",
      "comment": "Samson’s answer now references his hair, closer to his true source of strength."
    },
    {
      "pk": 301074,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 14,
      "text": "So while he slept, Delilah took the seven locks of his head and wove them into the fabric. Then she fastened it with the pin and said to him, 'The Philistines are upon you, Samson!' But he awoke from his sleep and pulled out the pin, the loom, and the fabric.",
      "links": "<a href='/AIV/7/16/19'>Judg. 16:19</a>",
      "comment": "'Pin, loom, and fabric' are all literal terms for parts of an ancient loom."
    },
    {
      "pk": 301075,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 15,
      "text": "And she said to him, 'How can you say, “I love you,” when your heart is not with me? You have mocked me these three times, and you have not told me what makes your strength so great.'",
      "links": "<a href='/AIV/7/14/16'>Judg. 14:16</a>",
      "comment": "Delilah appeals emotionally, similar to Samson’s wife earlier in Judges."
    },
    {
      "pk": 301076,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 16,
      "text": "And when she pressed him day after day with her words and urged him, his soul was troubled to death.",
      "links": "<a href='/AIV/7/14/17'>Judg. 14:17</a>",
      "comment": "'Troubled to death' is a literal translation of the Hebrew idiom."
    },
    {
      "pk": 301077,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 17,
      "text": "So he told her all his heart and said to her, 'A razor has never come upon my head, for I have been a Nazirite to God from my mother's womb. If I am shaved, then my strength will leave me, and I shall become weak and be like any other man.'",
      "links": "<a href='/AIV/4/6/2-5'>Num. 6:2–5</a>",
      "comment": "'Nazirite' is a transliteration of the Hebrew nazir, someone set apart to God."
    },
    {
      "pk": 301078,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 18,
      "text": "When Delilah saw that he had told her all his heart, she sent and called for the lords of the Philistines, saying, 'Come up again, for he has told me all his heart.' Then the lords of the Philistines came up to her and brought the money in their hands.",
      "links": "<a href='/AIV/7/16/5'>Judg. 16:5</a>",
      "comment": "Delilah knows she has discovered the true secret."
    },
    {
      "pk": 301079,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 19,
      "text": "She made him sleep on her knees, and she called a man and had him shave off the seven locks of his head. Then she began to humble him, and his strength left him.",
      "links": "<a href='/AIV/7/16/13-14'>Judg. 16:13–14</a>",
      "comment": "Delilah (not Samson) initiates the act of binding and shaving."
    },
    {
      "pk": 301080,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 20,
      "text": "And she said, 'The Philistines are upon you, Samson!' And he awoke from his sleep and said, 'I will go out as at other times and shake myself free.' But he did not know that the Lord had left him.",
      "links": "<a href='/AIV/7/13/25'>Judg. 13:25</a>",
      "comment": "'The Lord had left him' refers to the Spirit of the Lord, who gave Samson his strength."
    },
    {
      "pk": 301081,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 21,
      "text": "So the Philistines seized him and gouged out his eyes. They brought him down to Gaza and bound him with bronze shackles. And he ground at the mill in the prison.",
      "links": "<a href='/AIV/1/40/5'>Gen. 40:5</a>",
      "comment": "'Gouged out his eyes' is literal and describes the standard ancient punishment."
    },
    {
      "pk": 301082,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 22,
      "text": "But the hair of his head began to grow again after it had been shaved.",
      "links": "<a href='/AIV/7/13/5'>Judg. 13:5</a>",
      "comment": "This verse foreshadows the return of his strength."
    },
    {
      "pk": 301083,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 23,
      "text": "Now the lords of the Philistines gathered to offer a great sacrifice to Dagon their god and to rejoice. And they said, 'Our god has given Samson our enemy into our hand.'",
      "links": "<a href='/AIV/1/41/8'>1 Sam. 5:2–4</a>",
      "comment": "'Dagon' is left untranslated; he was a major Philistine deity."
    },
    {
      "pk": 301084,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 24,
      "text": "And when the people saw him, they praised their god. For they said, 'Our god has given our enemy into our hand, the destroyer of our land, who has killed many of us.'",
      "links": "<a href='/AIV/7/15/8'>Judg. 15:8</a>",
      "comment": "'The destroyer of our land' recalls previous incidents of Samson’s violence."
    },
    {
      "pk": 301085,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 25,
      "text": "When their hearts were merry, they said, 'Call Samson, so that he may entertain us.' So they called Samson out of the prison, and he entertained them. They made him stand between the pillars.",
      "links": "<a href='/AIV/7/16/29'>Judg. 16:29</a>",
      "comment": "'Entertain' here implies mocking and humiliating Samson."
    },
    {
      "pk": 301086,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 26,
      "text": "And Samson said to the young man who held him by the hand, 'Let me feel the pillars on which the house rests, so that I may lean against them.'",
      "links": "<a href='/AIV/7/16/29'>Judg. 16:29</a>",
      "comment": "Samson's blindness required a helper to guide him."
    },
    {
      "pk": 301087,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 27,
      "text": "Now the house was full of men and women. All the lords of the Philistines were there, and on the roof there were about three thousand men and women, who looked on while Samson entertained.",
      "links": "<a href='/AIV/7/16/24'>Judg. 16:24</a>",
      "comment": "'Three thousand' is the literal number given in Hebrew."
    },
    {
      "pk": 301088,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 28,
      "text": "And Samson called to the Lord and said, 'O Lord God, remember me and strengthen me just this once, O God, that I may be avenged on the Philistines for my two eyes.'",
      "links": "<a href='/AIV/7/15/18'>Judg. 15:18</a>",
      "comment": "'Lord God' translates the Hebrew 'Yahweh God.'"
    },
    {
      "pk": 301089,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 29,
      "text": "And Samson grasped the two middle pillars on which the house rested, and he leaned his weight against them, his right hand on the one, and his left hand on the other.",
      "links": "<a href='/AIV/7/16/26'>Judg. 16:26</a>",
      "comment": "Samson’s action is deliberate physical effort."
    },
    {
      "pk": 301090,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 30,
      "text": "And Samson said, 'Let me die with the Philistines.' Then he pushed with all his might, and the house fell on the lords and all the people who were in it. So the dead whom he killed at his death were more than those whom he had killed in his life.",
      "links": "<a href='/AIV/7/16/24-27'>Judg. 16:24–27</a>",
      "comment": "'Let me die with the Philistines' is literal and shows Samson's intent."
    },
    {
      "pk": 301091,
      "translation": "AIV",
      "book": 7,
      "chapter": 16,
      "verse": 31,
      "text": "Then his brothers and all his family came down and took him and brought him up and buried him between Zorah and Eshtaol in the tomb of Manoah his father. He had judged Israel twenty years.",
      "links": "<a href='/AIV/7/2/16'>Judg. 2:16</a>; <a href='/AIV/7/13/2'>Judg. 13:2</a>",
      "comment": "'He had judged Israel twenty years' is a standard formula for the judges in the book."
    }
  ],
  "translatedAt": "2025-12-22T07:10:44.680Z"
}