{
  "book": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 8,
  "verses": [
    {
      "pk": 380801,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 1,
      "text": "Then the men of Ephraim said to him, \"What is this that you have done to us, not calling us when you went to fight against Midian?\" And they argued fiercely with him.",
      "links": "<a href='/AIV/7/12/1'>Judg. 12:1</a>; <a href='/AIV/7/7/24'>Judg. 7:24</a>",
      "comment": "Ephraim's tribe confronts Gideon for not involving them; 'argued fiercely' is a faithful rendering of 'reproached him sharply.'"
    },
    {
      "pk": 380802,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 2,
      "text": "He said to them, \"What have I done now in comparison with you? Is not the gleaning of the grapes of Ephraim better than the harvest of Abiezer?",
      "links": "<a href='/AIV/7/6/11'>Judg. 6:11</a>",
      "comment": "\"Gleaning\" means what remains after the initial harvest, here used as a metaphor for Ephraim's greater role."
    },
    {
      "pk": 380803,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 3,
      "text": "God has given into your hands the princes of Midian, Oreb and Zeeb. What was I able to do in comparison with you?\" Then their anger toward him subsided after he said this.",
      "links": "<a href='/AIV/7/7/25'>Judg. 7:25</a>",
      "comment": "References the defeat of Oreb and Zeeb, princes of Midian by Ephraim."
    },
    {
      "pk": 380804,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 4,
      "text": "Gideon came to the Jordan and crossed over, he and the three hundred men who were with him, exhausted but still pursuing.",
      "links": "<a href='/AIV/7/7/7'>Judg. 7:7</a>",
      "comment": "Gideon's men are described as 'exhausted but pursuing'."
    },
    {
      "pk": 380805,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 5,
      "text": "So he said to the men of Succoth, \"Please give loaves of bread to the people who are following me, for they are exhausted, and I am pursuing Zebah and Zalmunna, the kings of Midian.\"",
      "links": "<a href='/AIV/7/8/21'>Judg. 8:21</a>",
      "comment": "Succoth, a city east of the Jordan, asked to give bread to Gideon's men."
    },
    {
      "pk": 380806,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 6,
      "text": "But the leaders of Succoth said, \"Are the hands of Zebah and Zalmunna now in your possession, that we should give bread to your army?\"",
      "links": "<a href='/AIV/7/8/15'>Judg. 8:15</a>",
      "comment": "Succoth leaders refuse to help, skeptical of Gideon's victory."
    },
    {
      "pk": 380807,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 7,
      "text": "So Gideon said, \"Therefore, when the LORD has given Zebah and Zalmunna into my hand, I will tear your flesh with the thorns of the wilderness and with briers.\"",
      "links": "<a href='/AIV/7/8/16'>Judg. 8:16</a>",
      "comment": "'Tear your flesh' is a literal rendering; punishment threatened for their refusal."
    },
    {
      "pk": 380808,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 8,
      "text": "From there he went up to Penuel and spoke to them in the same way, and the men of Penuel answered him as the men of Succoth had answered.",
      "links": "<a href='/AIV/1/32/30'>Gen. 32:30</a>",
      "comment": "Penuel, also east of the Jordan, refuses help as Succoth did."
    },
    {
      "pk": 380809,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 9,
      "text": "So he said also to the men of Penuel, \"When I come back safely, I will tear down this tower.\"",
      "links": "<a href='/AIV/7/8/17'>Judg. 8:17</a>",
      "comment": "Gideon promises to punish Penuel by destroying their defensive tower."
    },
    {
      "pk": 380810,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 10,
      "text": "Now Zebah and Zalmunna were in Karkor, and their armies with them, about fifteen thousand men, all who remained of the entire army of the people of the east, for one hundred and twenty thousand men who drew the sword had fallen.",
      "links": "<a href='/AIV/7/7/22'>Judg. 7:22</a>",
      "comment": "'People of the east' refers to Midianite allies; the numbers reflect heavy casualties."
    },
    {
      "pk": 380811,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 11,
      "text": "Gideon went up by the way of those living in tents east of Nobah and Jogbehah, and attacked the camp when it was unwary.",
      "links": "<a href='/AIV/4/32/42'>Num. 32:42</a>; <a href='/AIV/7/8/21'>Judg. 8:21</a>",
      "comment": "'Those living in tents' refers to nomads; Gideon's attack is a surprise."
    },
    {
      "pk": 380812,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 12,
      "text": "And Zebah and Zalmunna fled, but he pursued them and captured the two kings of Midian. He threw all their army into panic.",
      "links": "<a href='/AIV/7/8/21'>Judg. 8:21</a>",
      "comment": "'Threw all their army into panic' is a literal translation; Gideon's victory detailed."
    },
    {
      "pk": 380813,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 13,
      "text": "Gideon son of Joash returned from the battle by the ascent of Heres.",
      "links": "<a href='/AIV/7/6/11'>Judg. 6:11</a>",
      "comment": "'Ascent of Heres' is transliterated; location is uncertain."
    },
    {
      "pk": 380814,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 14,
      "text": "He captured a young man of Succoth and questioned him, and he wrote down for him the names of the seventy-seven officials and elders of Succoth.",
      "links": "<a href='/AIV/7/8/6'>Judg. 8:6</a>",
      "comment": "Gideon uses intelligence from a local boy to identify Succoth's leaders."
    },
    {
      "pk": 380815,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 15,
      "text": "He came to the men of Succoth and said, \"Here are Zebah and Zalmunna, about whom you taunted me, saying, ‘Are the hands of Zebah and Zalmunna now in your possession, that we should give bread to your men who are exhausted?’\"",
      "links": "<a href='/AIV/7/8/6'>Judg. 8:6</a>",
      "comment": "Gideon confronts Succoth for their refusal, quoting their earlier words."
    },
    {
      "pk": 380816,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 16,
      "text": "He took the elders of the city, and with thorns of the wilderness and briers he taught the men of Succoth a lesson.",
      "links": "<a href='/AIV/7/8/7'>Judg. 8:7</a>",
      "comment": "Punishment described as 'taught a lesson,' literal from 'disciplined.'"
    },
    {
      "pk": 380817,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 17,
      "text": "He also tore down the tower of Penuel and killed the men of the city.",
      "links": "<a href='/AIV/7/8/9'>Judg. 8:9</a>",
      "comment": "Gideon carries out his threats against Penuel."
    },
    {
      "pk": 380818,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 18,
      "text": "Then he said to Zebah and Zalmunna, \"What kind of men did you kill at Tabor?\" They answered, \"They were like you, each one of them looking like a king’s son.\"",
      "links": "<a href='/AIV/7/4/6'>Judg. 4:6</a>; <a href='/AIV/1/35/19'>Gen. 35:19</a>",
      "comment": "'King’s son' is a literal rendering; Tabor incident referenced."
    },
    {
      "pk": 380819,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 19,
      "text": "He said, \"They were my brothers, the sons of my mother. As the LORD lives, if you had spared them, I would not kill you.\"",
      "links": "<a href='/AIV/7/8/21'>Judg. 8:21</a>",
      "comment": "Gideon's personal motivation clarified."
    },
    {
      "pk": 380820,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 20,
      "text": "He said to Jether, his firstborn, \"Get up, and kill them.\" But the boy did not draw his sword, because he was afraid, for he was still a young man.",
      "links": "<a href='/AIV/7/8/21'>Judg. 8:21</a>",
      "comment": "Jether's hesitation shown; 'young man' is literal."
    },
    {
      "pk": 380821,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 21,
      "text": "Then Zebah and Zalmunna said, \"Rise up yourself and strike us; for as the man is, so is his strength.\" So Gideon arose and killed Zebah and Zalmunna, and took the ornaments that were on their camels’ necks.",
      "links": "<a href='/AIV/1/49/9'>Gen. 49:9</a>; <a href='/AIV/7/8/26'>Judg. 8:26</a>",
      "comment": "The phrase 'as the man is, so is his strength' is left literal."
    },
    {
      "pk": 380822,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 22,
      "text": "Then the men of Israel said to Gideon, \"Rule over us, you and your son and your grandson, for you have rescued us from the hand of Midian.\"",
      "links": "<a href='/AIV/9/8/5'>1 Sam. 8:5</a>",
      "comment": "Israel requests Gideon's dynasty; parallels with Israel’s later wish for a king."
    },
    {
      "pk": 380823,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 23,
      "text": "But Gideon said to them, \"I will not rule over you, nor will my son rule over you; the LORD will rule over you.\"",
      "links": "<a href='/AIV/7/2/18'>Judg. 2:18</a>; <a href='/AIV/9/8/7'>1 Sam. 8:7</a>",
      "comment": "'The LORD will rule over you' emphasizes Israel’s theocracy."
    },
    {
      "pk": 380824,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 24,
      "text": "And Gideon said to them, \"Let me make a request of you: that each of you give me the earrings from your spoil.\" (For they had golden earrings, because they were Ishmaelites.)",
      "links": "<a href='/AIV/1/37/25'>Gen. 37:25</a>",
      "comment": "'Ishmaelites' used of Midianites here; reflects ancient connections."
    },
    {
      "pk": 380825,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 25,
      "text": "They answered, \"We will willingly give them.\" And they spread out a cloak, and each man threw in the earrings from his spoil.",
      "links": "<a href='/AIV/2/12/35'>Exod. 12:35</a>",
      "comment": "Israelites provide gold from war spoils, as in Exodus."
    },
    {
      "pk": 380826,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 26,
      "text": "The weight of the golden earrings he requested was seventeen hundred shekels of gold, besides the crescent ornaments, pendants, and purple garments worn by the kings of Midian, and the chains on their camels’ necks.",
      "links": "<a href='/AIV/7/8/21'>Judg. 8:21</a>",
      "comment": "Seventeen hundred shekels about 43 pounds; details spoil from Midian."
    },
    {
      "pk": 380827,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 27,
      "text": "Gideon made an ephod from it and set it up in his city, Ophrah, and all Israel prostituted themselves after it there, and it became a snare to Gideon and his family.",
      "links": "<a href='/AIV/2/28/6'>Exod. 28:6</a>; <a href='/AIV/7/2/17'>Judg. 2:17</a>",
      "comment": "'Prostituted themselves' is literal for idolatry; the ephod becomes an idol."
    },
    {
      "pk": 380828,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 28,
      "text": "So Midian was subdued before the Israelites, and did not lift its head again. And the land had peace for forty years in the days of Gideon.",
      "links": "<a href='/AIV/7/3/11'>Judg. 3:11</a>; <a href='/AIV/7/5/31'>Judg. 5:31</a>",
      "comment": "Peace for forty years, a recurring theme in Judges."
    },
    {
      "pk": 380829,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 29,
      "text": "Jerubbaal the son of Joash went and lived in his own house.",
      "links": "<a href='/AIV/7/6/32'>Judg. 6:32</a>",
      "comment": "Jerubbaal is Gideon's alternate name."
    },
    {
      "pk": 380830,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 30,
      "text": "Gideon had seventy sons, his own offspring, for he had many wives.",
      "links": "<a href='/AIV/7/9/2'>Judg. 9:2</a>",
      "comment": "Polygamy common among leaders; 'own offspring' literal."
    },
    {
      "pk": 380831,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 31,
      "text": "And his concubine who was in Shechem also bore him a son, and he named him Abimelech.",
      "links": "<a href='/AIV/7/9/1'>Judg. 9:1</a>",
      "comment": "Abimelech’s birth foreshadows upcoming conflict."
    },
    {
      "pk": 380832,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 32,
      "text": "Gideon son of Joash died at a good old age and was buried in the tomb of Joash his father at Ophrah of the Abiezrites.",
      "links": "<a href='/AIV/1/15/15'>Gen. 15:15</a>; <a href='/AIV/7/6/11'>Judg. 6:11</a>",
      "comment": "'Good old age' is a standard phrase for peaceful death."
    },
    {
      "pk": 380833,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 33,
      "text": "After Gideon died, the Israelites turned again and prostituted themselves after the Baals, and made Baal-berith their god.",
      "links": "<a href='/AIV/7/2/19'>Judg. 2:19</a>; <a href='/AIV/7/9/4'>Judg. 9:4</a>",
      "comment": "Repeated falling into idolatry after the judge dies."
    },
    {
      "pk": 380834,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 34,
      "text": "The Israelites did not remember the LORD their God, who had delivered them from the hand of all their enemies on every side.",
      "links": "<a href='/AIV/7/2/12'>Judg. 2:12</a>",
      "comment": "'Did not remember,' a key theme in Judges."
    },
    {
      "pk": 380835,
      "translation": "AIV",
      "book": 7,
      "chapter": 8,
      "verse": 35,
      "text": "Nor did they show loyalty to the house of Jerubbaal, that is Gideon, according to all the good that he had done for Israel.",
      "links": "<a href='/AIV/7/9/16'>Judg. 9:16</a>",
      "comment": "Israel's ingratitude sets up the story of Abimelech in Judges 9."
    }
  ],
  "translatedAt": "2025-12-22T07:06:31.381Z"
}