{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 19,
  "verses": [
    {
      "pk": 7019001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 1,
      "text": "In those days, when there was no king in Israel, a certain Levite was living as a foreigner in the remote hill country of Ephraim. He took for himself a concubine from Bethlehem in Judah.",
      "links": "<a href='/AIV/7/17/6'>Judg. 17:6</a>; <a href='/AIV/7/18/1'>Judg. 18:1</a>",
      "comment": "The repeated note 'there was no king in Israel' establishes the spiritual and social chaos of this era and anticipates Israel’s later longing for godly leadership. The Levite, a man set apart for holiness (Num. 3:6-13), lives away from the tabernacle and takes a concubine—a secondary wife—showing spiritual shortcomings among God’s chosen leaders."
    },
    {
      "pk": 7019002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 2,
      "text": "But his concubine was unfaithful to him. She left him and returned to her father's house at Bethlehem in Judah, and stayed there for four months.",
      "links": "",
      "comment": "The meaning of 'unfaithful' (Hebrew: zanah) can refer to marital unfaithfulness or simply leaving him. The narrative captures both brokenness in personal relationships and hints of Israel’s own spiritual unfaithfulness—see <a href='/AIV/28/1/2'>Hosea 1:2</a>."
    },
    {
      "pk": 7019003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 3,
      "text": "Her husband got up and went after her, to speak kindly to her and bring her back. He took with him his servant and a pair of donkeys. When he arrived at her father's house, the young woman's father saw him and welcomed him gladly.",
      "links": "<a href='/AIV/1/34/3'>Gen. 34:3</a>",
      "comment": "'To speak kindly to her' echoes Gen. 34:3, and expresses a desire for reconciliation. Note the theme of persistent, patient love, which prefigures God's pursuit of His unfaithful people."
    },
    {
      "pk": 7019004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 4,
      "text": "His father-in-law, the woman's father, made him stay. He remained with him three days, eating and drinking and spending the nights there.",
      "links": "",
      "comment": "The pattern of hospitality and shared meals expresses both social courtesy and a slow, ritualized process of reconciliation. Sharing food together signifies restoration of relationship."
    },
    {
      "pk": 7019005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 5,
      "text": "On the fourth day, they got up early in the morning, and he prepared to leave. But the young woman's father said to his son-in-law, 'Refresh yourself with a piece of bread, and after that you may go.'",
      "links": "<a href='/AIV/1/18/5'>Gen. 18:5</a>",
      "comment": "Repetition of invitations for food and lingering further delays the journey. Hospitality is virtuous, but the delay ultimately sets in motion later tragedy."
    },
    {
      "pk": 7019006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 6,
      "text": "So the two of them sat down and ate and drank together. Then the woman's father said to the man, 'Please, agree to stay the night and let your heart be merry.'",
      "links": "",
      "comment": "'Let your heart be merry' sometimes implies more than just eating—a reference to deeper fellowship or rest. Note that the father presses for lingering instead of restoring justice."
    },
    {
      "pk": 7019007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 7,
      "text": "So the man got up to go, but his father-in-law urged him, so he stayed and spent another night there.",
      "links": "",
      "comment": "The repeated delay heightens the suspense and reflects the ancient importance of hospitality (see also <a href='/AIV/1/19/1-3'>Gen. 19:1-3</a>)."
    },
    {
      "pk": 7019008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 8,
      "text": "On the fifth day, he got up early in the morning to leave, but the woman's father said, 'Please, refresh yourself and wait until afternoon!' So they ate together.",
      "links": "",
      "comment": "The hospitality of the father-in-law, while well-intentioned, causes delay; it places the travelers at risk by sending them out late in the day."
    },
    {
      "pk": 7019009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 9,
      "text": "When the man got up to go, with his concubine and servant, his father-in-law, the woman's father, said, 'Look, the day is now drawing to a close. Please stay another night. See, the day is ending. Stay and let your heart be merry. Tomorrow you can get up early for your journey and go home.'",
      "links": "",
      "comment": "Departure late in the day foreshadows danger, as ancient travel by night was risky and strongly discouraged (cf. <a href='/AIV/1/19/2'>Gen. 19:2</a>)."
    },
    {
      "pk": 7019010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 10,
      "text": "But the man was unwilling to stay another night. He got up and left, and came to a place opposite Jebus (that is, Jerusalem) with his pair of saddled donkeys and his concubine.",
      "links": "<a href='/AIV/6/10/3'>Josh. 10:3</a>; <a href='/AIV/7/1/21'>Judg. 1:21</a>",
      "comment": "'Jebus' is the ancient name for Jerusalem, still under foreign control at this time, reminding the reader that the conquest was incomplete (see Judg. 1:21)."
    },
    {
      "pk": 7019011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 11,
      "text": "When they were near Jebus, and the day was nearly gone, the servant said to his master, 'Come, let us turn aside into this city of the Jebusites and spend the night there.'",
      "links": "",
      "comment": "The servant's proposal emphasizes the lack of safe, welcoming cities among Israel herself at this point, recalling Abraham’s hospitality to strangers (Gen. 18:1-8)."
    },
    {
      "pk": 7019012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 12,
      "text": "But his master replied, 'We will not turn aside into a city of foreigners, who are not of the people of Israel. We will continue on to Gibeah.'",
      "links": "",
      "comment": "The Levite wants to trust his own kinsmen rather than dwell among 'foreigners', an implicit expectation that God’s people are expected to show higher moral standards and hospitality."
    },
    {
      "pk": 7019013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 13,
      "text": "'Come,' he said to his servant, 'let us go on to one of these places; we will spend the night in Gibeah or in Ramah.'",
      "links": "<a href='/AIV/9/21/19'>1 Sam. 21:19</a>",
      "comment": "Both Gibeah and Ramah are towns of Benjamin. The expectation is one of safety and kinship among the covenant community."
    },
    {
      "pk": 7019014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 14,
      "text": "So they went on, and as the sun went down, they reached Gibeah belonging to Benjamin.",
      "links": "",
      "comment": "The narrative heightens tension: as night falls, travelers are most vulnerable. The text expects the Benjaminites to offer refuge."
    },
    {
      "pk": 7019015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 15,
      "text": "They turned aside there to go in and spend the night in Gibeah. The Levite entered and sat down in the town square, but no one took them in for the night.",
      "links": "<a href='/AIV/1/19/2-3'>Gen. 19:2-3</a>",
      "comment": "This is a marked violation of hospitality. Compare with the positive example in Gen. 19:2-3 and Jesus’ teaching on welcoming the stranger (<a href='/AIV/40/25/35'>Matt. 25:35</a>)."
    },
    {
      "pk": 7019016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 16,
      "text": "In the evening, an old man came in from his work in the fields. He was from the hill country of Ephraim, but was staying in Gibeah. The people of the place were Benjaminites.",
      "links": "",
      "comment": "The old man is himself an outsider, as the Levite is, highlighting that compassion is not found among Benjaminites but only in a sojourner."
    },
    {
      "pk": 7019017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 17,
      "text": "When the old man looked up and saw the traveler in the city square, he said, 'Where are you going, and where do you come from?'",
      "links": "",
      "comment": "The question is one of hospitality and care, parallel to similar inquiries by Abraham in Gen. 18."
    },
    {
      "pk": 7019018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 18,
      "text": "The Levite replied, 'We are traveling from Bethlehem in Judah to the remote hill country of Ephraim, where I am from. I went to Bethlehem in Judah, and now I am going to the House of the Lord, but no one has taken us in for the night.'",
      "links": "<a href='/AIV/9/1/3'>1 Sam. 1:3</a>",
      "comment": "'The House of the Lord' could refer to Shiloh, the site of the tabernacle at the time (1 Sam. 1:3). The man points out the shameful failure of hospitality among God’s people."
    },
    {
      "pk": 7019019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 19,
      "text": "'We have straw and feed for our donkeys, and bread and wine for myself, your servant, the young woman, and the young man with your servants. We have no lack of anything.'",
      "links": "",
      "comment": "The Levite is not seeking charity, just shelter—further highlighting the inhospitality of the town."
    },
    {
      "pk": 7019020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 20,
      "text": "The old man said, 'You are welcome to stay with me; I will take care of all your needs. Just do not spend the night in the square.'",
      "links": "",
      "comment": "The warning implies the square is dangerous at night, portending the evil about to unfold."
    },
    {
      "pk": 7019021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 21,
      "text": "So he brought him into his house and fed the donkeys. They washed their feet, ate, and drank.",
      "links": "<a href='/AIV/1/18/4'>Gen. 18:4</a>; <a href='/AIV/1/19/2'>Gen. 19:2</a>",
      "comment": "Washing feet and eating together are ritual signs of welcome and peace. These gestures foreshadow Christ’s own acts of humble hospitality (Jn. 13:5)."
    },
    {
      "pk": 7019022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 22,
      "text": "While they were enjoying themselves, some wicked men of the city surrounded the house, pounding on the door. They said to the old man, the owner of the house, 'Bring out the man who came to your house, so we can have relations with him.'",
      "links": "<a href='/AIV/1/19/5'>Gen. 19:5</a>",
      "comment": "This verse closely parallels the atrocity in Sodom (Gen. 19:5). The spiritual decay of 'God’s people' is equated with the Gentile rebellion in Gen. 19. It is a warning against presuming innate holiness simply from belonging to God's nation or church."
    },
    {
      "pk": 7019023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 23,
      "text": "The owner of the house went outside and said to them, 'No, my brothers, do not do this evil thing, since this man has come into my house. Do not do this disgraceful act.'",
      "links": "",
      "comment": "Hospitality in the ancient world demanded protection even at great personal cost. The owner’s protest underlines the sanctity of hospitality and the unnaturalness of the intended act."
    },
    {
      "pk": 7019024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 24,
      "text": "'Look, here is my virgin daughter and his concubine. Let me bring them out to you now; you can abuse them and do to them whatever you wish. But as for this man, do not commit this outrageous thing.'",
      "links": "<a href='/AIV/1/19/8'>Gen. 19:8</a>",
      "comment": "The old man’s plea is tragic, showing a world warped by sin. The narrative is not condoning such actions, but exposing the chaos and horror that result when God’s law is abandoned."
    },
    {
      "pk": 7019025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 25,
      "text": "But the men would not listen to him. So the Levite seized his concubine and sent her outside to them. They raped her and abused her all night until morning. At dawn, they let her go.",
      "links": "",
      "comment": "This horrific event is a direct result of Israel’s moral collapse, reinforcing the book’s theme that 'everyone did what was right in his own eyes.' (Judg. 21:25)"
    },
    {
      "pk": 7019026,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 26,
      "text": "At daybreak the woman came and fell down at the door of the house where her master was, until it was light.",
      "links": "",
      "comment": "This verse powerfully broadcasts the devastation and abandonment sin brings. It calls us to intercede for the defenseless and to pursue justice for the afflicted, foreshadowing Christ’s concern for the least (Matt. 25:40)."
    },
    {
      "pk": 7019027,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 27,
      "text": "Her master got up in the morning, opened the doors of the house, and went out to continue his journey. There lay his concubine, collapsed at the entrance of the house, with her hands on the threshold.",
      "links": "",
      "comment": "The indifference of the Levite stands in contrast to what God requires of shepherds—to care for the vulnerable. The woman's hands on the threshold accentuate tragedy and the sacred trust broken."
    },
    {
      "pk": 7019028,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 28,
      "text": "He said to her, 'Get up, let us go.' But there was no answer. So he put her on the donkey, and set out for home.",
      "links": "",
      "comment": "The silence of the concubine is deafening—her death brings judgment on Benjamin, just as Abel’s blood cried out to God (Genesis 4:10)."
    },
    {
      "pk": 7019029,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 29,
      "text": "When he reached his house, he took a knife and, taking hold of his concubine, cut her corpse limb by limb into twelve parts, and sent them throughout the territory of Israel.",
      "links": "<a href='/AIV/1/49/28'>Gen. 49:28</a>; <a href='/AIV/9/11/7'>1 Sam. 11:7</a>",
      "comment": "Dismembering the body and sending it to the tribes is a call for national repentance, paralleling covenant symbolism (twelve tribes, Gen. 49:28; cf. 1 Sam. 11:7). From a spiritual perspective, this also anticipates the need for a unified shepherd who will gather and heal the scattered body."
    },
    {
      "pk": 7019030,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 19,
      "verse": 30,
      "text": "Everyone who saw it said, 'Nothing like this has ever happened or been seen from the day the Israelites came up out of the land of Egypt until today. Consider it, take counsel, and speak up!'",
      "links": "<a href='/AIV/2/24/14'>Joshua 24:14</a>; <a href='/AIV/7/21/25'>Judg. 21:25</a>",
      "comment": "The horror and outrage demands a national response, insisting that all Israel is corporately responsible for justice and holiness (see Deut. 13:12-18). This text can prompt reflection on the necessity of a unified, rightly-ordered leadership, and foreshadows God's future plan to provide a shepherd-king for His people who will both rule and heal (see Ezek. 34:23-24; John 10:11)."
    }
  ],
  "translatedAt": "2025-12-24T02:41:46.032Z"
}