{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 16,
  "verses": [
    {
      "pk": 7016001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 1,
      "text": "Samson went to Gaza, and there he saw a prostitute and went in to her.",
      "links": "<a href='/AIV/6/2/1'>Josh. 2:1</a>; <a href='/AIV/7/14/1'>Judg. 14:1</a>",
      "comment": "Samson's visit to Gaza demonstrates his ongoing struggle with his vocation and temptations. The city of Gaza was a major Philistine city, indicating that Samson continued to risk himself among Israel’s enemies."
    },
    {
      "pk": 7016002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 2,
      "text": "When the Gazites were told, 'Samson has come here,' they surrounded the place and lay in wait for him all night at the city gate. They kept quiet all night, saying, 'Let us wait until the morning light; then we will kill him.'",
      "links": "<a href='/AIV/7/15/10'>Judg. 15:10</a>",
      "comment": "The Philistines’ plan to trap Samson shows their fear of him and their persistence. The city gate being closed symbolized both physical and spiritual barriers intended to imprison God's chosen deliverer."
    },
    {
      "pk": 7016003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 3,
      "text": "But Samson lay until midnight, and at midnight he rose up, took hold of the doors of the city gate and the two gateposts, pulled them up, bar and all, and put them on his shoulders. Then he carried them to the top of the hill that is in front of Hebron.",
      "links": "<a href='/AIV/7/15/14-16'>Judg. 15:14-16</a>; <a href='/AIV/19/24/7'>Ps. 24:7</a>",
      "comment": "Samson’s incredible strength is once again attributed to the Spirit of the Lord. Symbolically, carrying the gate up the hill is reminiscent of Christ bearing the cross (cf. John 19:17), physically overcoming barriers intended to bind the people."
    },
    {
      "pk": 7016004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 4,
      "text": "After this he loved a woman in the Valley of Sorek, whose name was Delilah.",
      "links": "<a href='/AIV/7/14/2'>Judg. 14:2</a>",
      "comment": "Delilah, whom Samson loves, will lead to his downfall. The Valley of Sorek symbolized a border between Israel and the Philistines, highlighting the theme of crossing boundaries set by God for holiness."
    },
    {
      "pk": 7016005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 5,
      "text": "The lords of the Philistines came to her and said, 'Entice him, and find out what makes his strength so great and how we may overpower him so we may bind him to humble him. We will each give you eleven hundred pieces of silver.'",
      "links": "<a href='/AIV/7/14/15'>Judg. 14:15</a>; <a href='/AIV/40/26/14-16'>Matt. 26:14-16</a>",
      "comment": "Delilah is bribed for silver, drawing a parallel to Judas’s betrayal of Jesus for silver (see Matthew 26:14-16). Both betrayals are intimately linked to the loss and restoration of deliverance for God’s people."
    },
    {
      "pk": 7016006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 6,
      "text": "So Delilah said to Samson, 'Please tell me where your great strength lies, and how you could be bound so as to subdue you.'",
      "links": "",
      "comment": "Delilah's deception is subtle—she appeals to Samson’s trust while intending betrayal. The recurring motif of trust betrayed echoes throughout salvation history."
    },
    {
      "pk": 7016007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 7,
      "text": "Samson said to her, 'If they bind me with seven fresh bowstrings that have not been dried, then I shall become weak and be like any other man.'",
      "links": "",
      "comment": "Samson intentionally deceives Delilah, testing her loyalty. Seven is a number of completeness in Scripture, but here ironically refers to incomplete truth."
    },
    {
      "pk": 7016008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 8,
      "text": "Then the lords of the Philistines brought up to her seven fresh bowstrings that had not been dried, and she bound him with them.",
      "links": "",
      "comment": "This verse shows Delilah’s cooperation with Israel’s enemies. The number seven hints again at a false sense of completeness or security."
    },
    {
      "pk": 7016009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 9,
      "text": "Now she had men lying in wait in an inner room. And she said to him, 'The Philistines are upon you, Samson!' But he snapped the bowstrings, as a thread of flax snaps when it touches fire. So the secret of his strength was not discovered.",
      "links": "<a href='/AIV/3/26/16'>Lev. 26:16</a>",
      "comment": "Samson’s strength is again shown to be supernatural. The inner room, or ‘chamber’, often symbolizes secrecy or being set apart—here subverted for evil."
    },
    {
      "pk": 7016010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 10,
      "text": "Then Delilah said to Samson, 'Look, you have mocked me and told me lies. Now please tell me how you can be tied.'",
      "links": "",
      "comment": "Delilah’s insistence grows. There is irony as the betrayer claims to be betrayed."
    },
    {
      "pk": 7016011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 11,
      "text": "He said to her, 'If they bind me tightly with new ropes that have not been used, then I shall become weak and be like any other man.'",
      "links": "<a href='/AIV/7/15/13'>Judg. 15:13</a>",
      "comment": "Samson escapes again by deception. The ropes echo previous failed attempts to capture him (see Judges 15:13)."
    },
    {
      "pk": 7016012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 12,
      "text": "So Delilah took new ropes and bound him with them and said to him, 'The Philistines are upon you, Samson!' Now the men were lying in wait in the inner room. But he broke them off his arms like a thread.",
      "links": "",
      "comment": "Samson’s superhuman abilities once more thwart a literal attempt at his capture, only heightening Delilah’s resolve."
    },
    {
      "pk": 7016013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 13,
      "text": "Delilah said to Samson, 'Until now you have mocked me and told me lies. Tell me how you may be bound.' And he said to her, 'If you weave the seven locks of my head with the loom and tighten it with the pin, then I shall become weak and be like any other man.'",
      "links": "",
      "comment": "This time, Samson’s answer refers to his hair, coming close to the source of his strength. The mention of the seven locks hints at the importance of his Nazirite vow."
    },
    {
      "pk": 7016014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 14,
      "text": "So while he slept, Delilah took the seven locks of his head, wove them into the loom, and tightened it with the pin. Then she said, 'The Philistines are upon you, Samson!' But he awoke from his sleep and pulled away the loom and the pin from the web.",
      "links": "",
      "comment": "Samson’s vow remains intact, and God’s imparted strength has not yet left him. His hair continually points to his set-apart status before God."
    },
    {
      "pk": 7016015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 15,
      "text": "She said to him, 'How can you say, “I love you,” when your heart is not with me? You have mocked me these three times, and have not told me where your great strength lies.'",
      "links": "<a href='/AIV/1/3/12'>Gen. 3:12</a>",
      "comment": "Delilah plays upon emotion, mirroring Eve’s persuasion of Adam (cf. Genesis 3:12). Notice the oft-repeated biblical connection between disobedience and seduction."
    },
    {
      "pk": 7016016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 16,
      "text": "And when she pressed him day after day with her words and urged him, his soul was vexed to death.",
      "links": "<a href='/AIV/7/14/17'>Judg. 14:17</a>",
      "comment": "Samson’s resolve breaks under repeated pressure, recalling similar stories of temptation and eventual collapse in scripture."
    },
    {
      "pk": 7016017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 17,
      "text": "So he told her all his heart, and said to her, 'No razor has ever come upon my head, for I have been a Nazirite to God from my mother’s womb. If I am shaved, then my strength will leave me, and I shall become weak, and be like any other man.'",
      "links": "<a href='/AIV/4/6/2-5'>Num. 6:2-5</a>; <a href='/AIV/7/13/5'>Judg. 13:5</a>",
      "comment": "Samson’s Nazirite consecration reveals that his strength is not his own, but comes from God’s choice and set-apart calling. That theme will be fulfilled in Christ, the ultimate set-apart one. See Numbers 6:2-5."
    },
    {
      "pk": 7016018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 18,
      "text": "When Delilah saw that he had told her all his heart, she sent and called the lords of the Philistines, saying, 'Come up again, for he has told me all his heart.' So the lords of the Philistines came up to her and brought the money in their hands.",
      "links": "<a href='/AIV/7/16/5'>Judg. 16:5</a>",
      "comment": "Ultimate betrayal: silver paid out after trusted secrets are revealed—again prefiguring Christ’s betrayal by one close to him."
    },
    {
      "pk": 7016019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 19,
      "text": "She made him sleep on her knees. Then she called a man and had him shave off the seven locks of his head. Then she began to afflict him, and his strength left him.",
      "links": "<a href='/AIV/19/40/14'>Ps. 40:14</a>",
      "comment": "Samson’s loss of strength follows deliberately breaking his consecration. Affliction follows apostasy, a powerful lesson in faithfulness and sacramental dedication."
    },
    {
      "pk": 7016020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 20,
      "text": "And she said, 'The Philistines are upon you, Samson!' He woke from his sleep and said, 'I will go out as at other times and shake myself free.' But he did not know that the Lord had left him.",
      "links": "<a href='/AIV/9/15/28'>1 Sam. 15:28</a>; <a href='/AIV/19/51/11'>Ps. 51:11</a>",
      "comment": "Without God’s presence, even past blessings are emptied of power. Sin leads to spiritual abandonment, echoing what happens to Saul in 1 Samuel 15:28."
    },
    {
      "pk": 7016021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 21,
      "text": "Then the Philistines seized him, gouged out his eyes, and took him down to Gaza. Binding him with bronze shackles, they made him grind grain in the prison.",
      "links": "<a href='/AIV/2/11/7'>Exod. 11:7</a>",
      "comment": "Physical blindness represents Samson’s previous spiritual blindness. Grinding grain symbolizes utter humiliation and defeat."
    },
    {
      "pk": 7016022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 22,
      "text": "But the hair of his head began to grow again after it had been shaved.",
      "links": "<a href='/AIV/7/13/5'>Judg. 13:5</a>",
      "comment": "Despite his humiliation, hope is reborn. God’s mercy allows for restoration, even after grave sin, a spiritual principle fulfilled in repentance and perseverance."
    },
    {
      "pk": 7016023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 23,
      "text": "Now the lords of the Philistines gathered to offer a great sacrifice to Dagon their god, and to rejoice. They said, 'Our god has given Samson our enemy into our hand.'",
      "links": "<a href='/AIV/9/5/2-4'>1 Sam. 5:2-4</a>",
      "comment": "The Philistines' idolatry is clear. Dagon, a false god, is briefly credited, but will soon be shown powerless. Compare the future account in 1 Samuel 5."
    },
    {
      "pk": 7016024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 24,
      "text": "When the people saw him, they praised their god, saying, 'Our god has delivered our enemy, the destroyer of our land, who killed many of us, into our hand.'",
      "links": "",
      "comment": "The crowd’s triumph mirrors later scenes of crowds mocking God's messengers. But true victory comes not through mockery but divine deliverance."
    },
    {
      "pk": 7016025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 25,
      "text": "And as their hearts were merry, they said, 'Call Samson, that he may entertain us.' So they called Samson out of the prison, and he entertained them. They made him stand between the pillars.",
      "links": "",
      "comment": "Samson, like Christ, becomes the object of public spectacle and humiliation before his final act of victory."
    },
    {
      "pk": 7016026,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 26,
      "text": "Samson said to the young man who held him by the hand, 'Let me feel the pillars on which the house rests, that I may lean against them.'",
      "links": "",
      "comment": "Samson’s reliance on others, for the first time, shows both humility and a prelude to the sacrificial act he is about to perform."
    },
    {
      "pk": 7016027,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 27,
      "text": "Now the house was full of men and women. All the lords of the Philistines were there, and on the roof there were about three thousand men and women, who looked on while Samson entertained.",
      "links": "",
      "comment": "The gathering of Philistine rulers sets the stage for their judgment. The number 3,000 recalls moments of great spiritual reversal in Israel’s history."
    },
    {
      "pk": 7016028,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 28,
      "text": "Then Samson called to the Lord and said, 'O Lord God, remember me, I pray, and strengthen me only this once, O God, that I may be avenged on the Philistines for my two eyes.'",
      "links": "<a href='/AIV/19/38/21'>Ps. 38:21</a>; <a href='/AIV/42/23/42'>Luke 23:42</a>",
      "comment": "Samson's prayer is a moment of repentance and faith, seeking restoration and justice. Compare to the thief’s plea on the cross (Luke 23:42). True strength comes only from God."
    },
    {
      "pk": 7016029,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 29,
      "text": "And Samson grasped the two middle pillars on which the house rested, and he leaned his weight against them, one with his right hand and the other with his left.",
      "links": "",
      "comment": "Samson stretches out his arms, offering himself as a sacrifice to deliver Israel. This prefigures Christ’s crucifixion, the ultimate self-offering for God's people."
    },
    {
      "pk": 7016030,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 30,
      "text": "And Samson said, 'Let me die with the Philistines.' Then he pushed with all his might, and the house fell upon the lords and upon all the people who were in it. So the dead whom he killed at his death were more than those whom he had killed in his life.",
      "links": "<a href='/AIV/43/10/18'>John 10:18</a>",
      "comment": "Samson's final victory comes through his own death—a pattern ultimately fulfilled in Christ's Passion, where victory over evil comes through self-offering (John 10:18)."
    },
    {
      "pk": 7016031,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 16,
      "verse": 31,
      "text": "Then his brothers and all his family came down and took him, and brought him up, and buried him between Zorah and Eshtaol in the tomb of Manoah his father. He had judged Israel twenty years.",
      "links": "<a href='/AIV/7/2/16'>Judg. 2:16</a>; <a href='/AIV/7/13/2'>Judg. 13:2</a>",
      "comment": "Samson's burial by his family marks the completion of his vocation as judge and deliverer. The people's remembrance and proper honor given to him foreshadow the Christian practice of honoring those who have finished the race faithfully."
    }
  ],
  "translatedAt": "2025-12-24T02:40:05.384Z"
}