{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 12,
  "verses": [
    {
      "pk": 7012001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 1,
      "text": "The men of Ephraim were summoned and crossed over to Zaphon, and they said to Jephthah, 'Why did you cross over to fight against the Ammonites without calling us to go with you? We will burn your house upon you with fire.'",
      "links": "<a href='/AIV/7/8/1'>Judg. 8:1</a>; <a href='/AIV/7/11/12'>Judg. 11:12</a>",
      "comment": "Similar to Judg. 8:1, the tribe of Ephraim expresses anger at not being included in battle, emphasizing tribal rivalries in Israel. Their threat also shows the seriousness of division among God's people—a theme that will later be resolved through a united and ordered community."
    },
    {
      "pk": 7012002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 2,
      "text": "Jephthah said to them, 'I and my people were engaged in a great conflict with the Ammonites, and when I called you, you did not save me from their hand.'",
      "links": "<a href='/AIV/7/10/9'>Judg. 10:9</a>; <a href='/AIV/7/11/12'>Judg. 11:12</a>",
      "comment": "Jephthah defends his leadership by saying he requested help but received none. This issue of calling and authority will later resonate with the need for recognized leadership and unity in following God’s chosen deliverers."
    },
    {
      "pk": 7012003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 3,
      "text": "'When I saw that you would not rescue me, I took my life in my hands and crossed over against the Ammonites, and the Lord gave them into my hand. Why then have you come up to me this day to fight against me?'",
      "links": "<a href='/AIV/7/4/14-15'>Judg. 4:14-15</a>; <a href='/AIV/7/11/32'>Judg. 11:32</a>",
      "comment": "Jephthah credits the Lord with victory, aligning with the recurring biblical theme that God delivers His people through chosen leaders. Taking 'my life in my hands' highlights trust in God above human strength—a foreshadowing of later faithful acts (cf. Matt. 16:24)."
    },
    {
      "pk": 7012004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 4,
      "text": "Then Jephthah gathered all the men of Gilead and fought with Ephraim. The men of Gilead struck Ephraim, because they said, 'You Gileadites are fugitives of Ephraim among the Ephraimites and the Manassites.'",
      "links": "<a href='/AIV/7/8/1'>Judg. 8:1</a>; <a href='/AIV/7/11/29'>Judg. 11:29</a>",
      "comment": "Civil war erupts, showing the dangers of division. Such disunity will ultimately only be healed by God’s work through mediators and the establishment of unity under His governance."
    },
    {
      "pk": 7012005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 5,
      "text": "The Gileadites captured the fords of the Jordan against the Ephraimites. And when any of the fugitives of Ephraim said, 'Let me cross over,' the men of Gilead said to him, 'Are you an Ephraimite?' If he said, 'No,'",
      "links": "<a href='/AIV/2/14/15'>Ex. 14:15</a>; <a href='/AIV/6/3/28'>Josh. 3:28</a>",
      "comment": "Controlling the crossing points of the Jordan is a repeating motif (cf. Josh. 3). It highlights the seriousness of distinction and the cost of broken unity among God’s people."
    },
    {
      "pk": 7012006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 6,
      "text": "then they said to him, 'Say, Shibboleth.' And he said, 'Sibboleth,' for he could not pronounce it correctly. Then they seized him and killed him at the fords of the Jordan. At that time forty-two thousand of Ephraim fell.",
      "links": "<a href='/AIV/7/3/28'>Judg. 3:28</a>; <a href='/AIV/12/50/26'>Gen. 50:26</a>",
      "comment": "This test relied on a dialect difference, showing how language can signal deeper divisions. The tragic outcome points to a spiritual danger when God's people are divided, and underlines the importance of right confession of faith and unity."
    },
    {
      "pk": 7012007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 7,
      "text": "Jephthah judged Israel for six years. Then Jephthah the Gileadite died and was buried in one of the cities of Gilead.",
      "links": "<a href='/AIV/7/10/2'>Judg. 10:2</a>; <a href='/AIV/7/2/18'>Judg. 2:18</a>",
      "comment": "Jephthah’s judgeship is brief, underlining the need for lasting, divinely ordained leadership. He is buried among his people, a theme that will echo in later accounts of faithful rulers and saints."
    },
    {
      "pk": 7012008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 8,
      "text": "After him, Ibzan of Bethlehem judged Israel.",
      "links": "<a href='/AIV/7/17/7'>Judg. 17:7</a>; <a href='/AIV/8/1/1'>Ruth 1:1</a>",
      "comment": "Bethlehem was the hometown of Ibzan. Bethlehem will later become significant as the birthplace of David and, ultimately, Jesus (Matt. 2:1), hinting toward God’s ongoing work of raising up leaders for His people."
    },
    {
      "pk": 7012009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 9,
      "text": "He had thirty sons. He gave away thirty daughters in marriage outside his clan, and brought in thirty daughters from outside for his sons. He judged Israel for seven years.",
      "links": "<a href='/AIV/7/10/4'>Judg. 10:4</a>; <a href='/AIV/1/21/1-4'>Gen. 21:1-4</a>",
      "comment": "Ibzan’s many children and the arranged marriages show the importance of family and building alliances, a theme that points to the need for the broader, ordered family of God and the spiritual unity of believers."
    },
    {
      "pk": 7012010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 10,
      "text": "Then Ibzan died and was buried at Bethlehem.",
      "links": "<a href='/AIV/7/8/32'>Judg. 8:32</a>; <a href='/AIV/8/1/1'>Ruth 1:1</a>",
      "comment": "The judge is again buried in his native land. The repeated pattern of judges passing away points to the need for a lasting deliverer—a foreshadowing of the eternal kingship of Christ."
    },
    {
      "pk": 7012011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 11,
      "text": "After him, Elon the Zebulunite judged Israel. He judged Israel for ten years.",
      "links": "<a href='/AIV/7/10/3'>Judg. 10:3</a>; <a href='/AIV/49/4/4'>Eph. 4:4</a>",
      "comment": "Another brief judgeship, reminding us that each deliverer was temporary. This points forward to unity and continuation in the ultimate plan for God's people."
    },
    {
      "pk": 7012012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 12,
      "text": "Then Elon the Zebulunite died and was buried at Aijalon in the land of Zebulun.",
      "links": "<a href='/AIV/7/10/5'>Judg. 10:5</a>; <a href='/AIV/6/19/40'>Josh. 19:40-42</a>",
      "comment": "Elon’s burial, like others, emphasizes continuity within the people of God. The mention of specific locations roots the story in history, but also hints at a spiritual legacy."
    },
    {
      "pk": 7012013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 13,
      "text": "After him, Abdon the son of Hillel the Pirathonite judged Israel.",
      "links": "<a href='/AIV/7/10/1'>Judg. 10:1</a>; <a href='/AIV/6/12/15'>Josh. 12:15-16</a>",
      "comment": "A succession of judges underlines how no single leader could finally fulfill God’s promise; this points forward to the establishment of a unified rule and the spiritual unity found in Christ."
    },
    {
      "pk": 7012014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 14,
      "text": "He had forty sons and thirty grandsons, who rode on seventy donkeys. He judged Israel for eight years.",
      "links": "<a href='/AIV/7/10/4'>Judg. 10:4</a>; <a href='/AIV/1/49/11'>Gen. 49:11</a>",
      "comment": "Numerous offspring and symbolic numbers may reflect order and prosperity, preparing the way for the coming kingdom. Riding donkeys hints at peace and humble authority (cf. Zech. 9:9, fulfilled by Christ)."
    },
    {
      "pk": 7012015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 12,
      "verse": 15,
      "text": "Then Abdon son of Hillel the Pirathonite died and was buried at Pirathon in the land of Ephraim, in the hill country of the Amalekites.",
      "links": "<a href='/AIV/6/24/30'>Josh. 24:30</a>; <a href='/AIV/7/2/18'>Judg. 2:18</a>",
      "comment": "Even faithful judges die—reminding readers that only God’s final Deliverer brings eternal leadership and unity. The mention of the hill country foreshadows important spiritual mountains in later revelation."
    }
  ],
  "translatedAt": "2025-12-24T02:37:33.059Z"
}