{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 21,
  "verses": [
    {
      "pk": 7021001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 1,
      "text": "The men of Israel had sworn at Mizpah, saying, 'None of us shall give his daughter to Benjamin as a wife.'",
      "links": "<a href='/AIV/7/20/1'>Judg. 20:1</a>; <a href='/AIV/4/30/2'>Num. 30:2</a>",
      "comment": "The Israelites bind themselves with a serious oath, reminiscent of other vows in Scripture (Num. 30:2). These communal commitments shape later events and underline the gravity of vows before God."
    },
    {
      "pk": 7021002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 2,
      "text": "So the people came to Bethel and sat there before God until evening, raising their voices and weeping bitterly.",
      "links": "<a href='/AIV/7/20/26'>Judg. 20:26</a>; <a href='/AIV/1/35/14'>Gen. 35:14</a>",
      "comment": "Bethel, a sacred place, features throughout Israel's history as a center for seeking God. The people's mourning displays the seriousness of their predicament and echoes times of national grief and repentance."
    },
    {
      "pk": 7021003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 3,
      "text": "They said, 'LORD, God of Israel, why has this happened in Israel, that today one tribe is missing from Israel?'",
      "links": "<a href='/AIV/7/20/48'>Judg. 20:48</a>; <a href='/AIV/16/9/32'>Neh. 9:32</a>",
      "comment": "This reflects lament over the division and near extinction of a tribe, emphasizing communal unity. The appeal to the LORD also shows Israel's awareness of divine sovereignty over national identity."
    },
    {
      "pk": 7021004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 4,
      "text": "The next day the people rose early and built an altar there, and offered burnt offerings and fellowship offerings.",
      "links": "<a href='/AIV/2/20/24'>Ex. 20:24</a>; <a href='/AIV/3/3/6'>Lev. 3:6</a>",
      "comment": "Their sacrifices are a gesture of repentance and re-consecration, reminiscent of Israel’s practice of worship and atonement. Altars signify attempts at restoring communion with God."
    },
    {
      "pk": 7021005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 5,
      "text": "Then the Israelites asked, 'Who among all the tribes of Israel did not come up to the LORD at Mizpah?' For they had made a solemn oath that anyone who did not come up to the LORD at Mizpah would surely be put to death.",
      "links": "<a href='/AIV/7/20/1-2'>Judg. 20:1-2</a>; <a href='/AIV/4/30/10'>Num. 30:10</a>",
      "comment": "The enforcement of their oath highlights the seriousness of public vows and communal discipline in Israel, themes echoed in later church life and discipline (cf. Matt. 18:17)."
    },
    {
      "pk": 7021006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 6,
      "text": "And the people of Israel had compassion for Benjamin their brother, and said, 'Today one tribe is cut off from Israel.'",
      "links": "<a href='/AIV/7/20/48'>Judg. 20:48</a>; <a href='/AIV/1/45/1'>Gen. 45:1</a>",
      "comment": "This moment of compassion shows Israel’s understanding of kinship despite grave offenses. The unity of the people of God is a recurring theme, teaching the importance of reconciliation within the community."
    },
    {
      "pk": 7021007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 7,
      "text": "'What shall we do for wives for those who remain, since we have sworn by the LORD that we will not give them any of our daughters as wives?'",
      "links": "<a href='/AIV/7/21/1'>Judg. 21:1</a>",
      "comment": "Their dilemma reveals the unintended consequences of rash vows. Faithfulness to oath and the challenge to restore the tribe point to God's concern for both justice and mercy."
    },
    {
      "pk": 7021008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 8,
      "text": "They asked, 'Is there anyone from the tribes of Israel who did not come up to the LORD at Mizpah?' They found that no one from Jabesh-gilead had come to the assembly.",
      "links": "<a href='/AIV/9/11/1'>1 Sam. 11:1</a>; <a href='/AIV/7/21/5'>Judg. 21:5</a>",
      "comment": "Jabesh-gilead's absence becomes significant as they search for a solution, showing how one group's neglect can impact the larger community."
    },
    {
      "pk": 7021009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 9,
      "text": "For when the people were mustered, behold, not one of the inhabitants of Jabesh-gilead was there.",
      "links": "<a href='/AIV/7/21/8'>Judg. 21:8</a>",
      "comment": "Absence from critical moments of national importance is highlighted as a serious deficiency, reminding us of the importance of participation in the assembly of God's people."
    },
    {
      "pk": 7021010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 10,
      "text": "So the congregation sent twelve thousand of the bravest men and commanded them, saying, 'Go and strike the inhabitants of Jabesh-gilead with the edge of the sword, including women and children.'",
      "links": "<a href='/AIV/7/20/48'>Judg. 20:48</a>; <a href='/AIV/5/13/15'>Deut. 13:15</a>",
      "comment": "This severe action against Jabesh-gilead demonstrates both the seriousness of their absence and the radical measures for communal purity in ancient Israel. It also reflects on the limits and tragic consequences of oath-driven zeal."
    },
    {
      "pk": 7021011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 11,
      "text": "This is what you shall do: every male and every woman who has lain with a man you shall devote to destruction.",
      "links": "<a href='/AIV/4/31/17'>Num. 31:17</a>; <a href='/AIV/6/6/21'>Josh. 6:21</a>",
      "comment": "The application of ban (herem) language recalls earlier events (Josh. 6:21). Purification and total devotion in judgment often foreshadow the New Testament call to spiritual purity."
    },
    {
      "pk": 7021012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 12,
      "text": "And they found among the inhabitants of Jabesh-gilead four hundred young virgins who had not known a man by lying with him, and they brought them to the camp at Shiloh, which is in the land of Canaan.",
      "links": "<a href='/AIV/7/18/31'>Judg. 18:31</a>; <a href='/AIV/6/18/1'>Josh. 18:1</a>",
      "comment": "Delivering the virgins to Shiloh, a central sanctuary, aligns with offering the first and best to God’s service. Purity motifs here reflect the later importance of consecrated life."
    },
    {
      "pk": 7021013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 13,
      "text": "Then the whole congregation sent word to the Benjaminites who were at the rock of Rimmon, and offered them peace.",
      "links": "<a href='/AIV/7/20/47'>Judg. 20:47</a>",
      "comment": "An act of reconciliation. Peace offerings after conflict highlight God’s greater plan for unity and restoration after deserved judgment."
    },
    {
      "pk": 7021014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 14,
      "text": "And Benjamin returned at that time. They gave them the women whom they had saved alive of the women of Jabesh-gilead, but they were not enough for them.",
      "links": "<a href='/AIV/7/21/12'>Judg. 21:12</a>",
      "comment": "Partial restoration begins, yet the insufficiency foretells that human solutions often remain incomplete without greater divine intervention—linking to the hope for fuller redemption in Christ."
    },
    {
      "pk": 7021015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 15,
      "text": "And the people had compassion on Benjamin, because the LORD had made a breach in the tribes of Israel.",
      "links": "<a href='/AIV/7/21/6'>Judg. 21:6</a>",
      "comment": "Expressing the LORD’s sovereignty, the text acknowledges that every loss and restoration is ultimately under God’s providence—key for Orthodox and apostolic interpretations of history."
    },
    {
      "pk": 7021016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 16,
      "text": "Then the elders of the congregation said, 'What shall we do for wives for those who are left, since the women of Benjamin were destroyed?'",
      "links": "<a href='/AIV/7/21/7'>Judg. 21:7</a>",
      "comment": "The elders’ leadership recognizes communal responsibility and the need for continuity in God’s people, a theme extending to later church offices and leadership."
    },
    {
      "pk": 7021017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 17,
      "text": "And they said, 'There must be an inheritance for the survivors of Benjamin, so that a tribe may not be blotted out from Israel.'",
      "links": "<a href='/AIV/5/25/6'>Deut. 25:6</a>; <a href='/AIV/19/16/5'>Ps. 16:5</a>",
      "comment": "The importance of each tribe’s continuation prepares for the New Testament image of the Church as a body where no member is dispensable (1 Cor. 12:21-26)."
    },
    {
      "pk": 7021018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 18,
      "text": "Yet we cannot give them our daughters as wives.' For the people of Israel had sworn, 'Cursed be he who gives a wife to Benjamin.'",
      "links": "<a href='/AIV/7/21/1'>Judg. 21:1</a>",
      "comment": "The binding nature of oaths continues to present difficulty, highlighting the tension between law and mercy—a theme fulfilled in Christ, who brings the New Covenant."
    },
    {
      "pk": 7021019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 19,
      "text": "They said, 'Look, there is a yearly feast of the LORD at Shiloh, which is north of Bethel, east of the highway that goes up from Bethel to Shechem, and south of Lebonah.'",
      "links": "<a href='/AIV/9/1/3'>1 Sam. 1:3</a>; <a href='/AIV/7/18/31'>Judg. 18:31</a>",
      "comment": "Reference to a pilgrimage feast at the central sanctuary of Shiloh hints at the importance of liturgical worship and maintaining sacred traditions."
    },
    {
      "pk": 7021020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 20,
      "text": "They commanded the Benjaminites, saying, 'Go and lie in wait in the vineyards,",
      "links": "<a href='/AIV/1/34/25'>Gen. 34:25</a>",
      "comment": "The plan employs unconventional means, reflecting the improvisation sometimes necessary in times of crisis, yet showing human limitations compared to God’s greater providence."
    },
    {
      "pk": 7021021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 21,
      "text": "and watch. If the daughters of Shiloh come out to dance in the dances, then come out of the vineyards and each of you seize his wife from the daughters of Shiloh and go to the land of Benjamin.",
      "links": "<a href='/AIV/2/15/20'>Ex. 15:20</a>",
      "comment": "This orchestrated abduction, though troubling, demonstrates the complexity of human solutions for the sake of preserving the community. It also points forward by contrast to God’s plan for holy matrimony and order in communal life."
    },
    {
      "pk": 7021022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 22,
      "text": "When their fathers or brothers come to complain to us, we will say to them, 'Grant them graciously to us, because we did not get wives for each of them in battle, nor did you give them to them, or else you would now be guilty.'",
      "links": "<a href='/AIV/7/21/18'>Judg. 21:18</a>",
      "comment": "Their appeal to mercy balances justice with compassion, which finds ultimate fulfillment in Christ’s teaching about forgiveness and the demands of love that transcend strict rule."
    },
    {
      "pk": 7021023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 23,
      "text": "So the Benjaminites did so and carried away wives according to their number from the dancers they caught. Then they went and returned to their inheritance and rebuilt the towns and lived in them.",
      "links": "<a href='/AIV/7/20/48'>Judg. 20:48</a>",
      "comment": "The restoration of Benjamin and their towns prefigures the way God brings new life and hope after destruction, foreshadowing the restoration offered through the New Covenant."
    },
    {
      "pk": 7021024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 24,
      "text": "The people of Israel then departed from there at that time, each to his tribe and family. And every man returned to his inheritance.",
      "links": "<a href='/AIV/6/24/28'>Josh. 24:28</a>",
      "comment": "A new period of peace is established as each returns to his inheritance. Restoration of order and inheritance is a recurring motif, reflecting that God intends his people to dwell in unity and security."
    },
    {
      "pk": 7021025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 21,
      "verse": 25,
      "text": "In those days there was no king in Israel; everyone did what was right in his own eyes.",
      "links": "<a href='/AIV/7/17/6'>Judg. 17:6</a>; <a href='/AIV/9/17/6'>1 Sam. 17:6</a>",
      "comment": "The book concludes with this refrain, emphasizing Israel’s need for godly leadership—foreshadowing the coming of the true King, Jesus Christ, who guides the Church into truth and unity. The importance of leadership, order, and unity in the people of God is clear."
    }
  ],
  "translatedAt": "2025-12-24T02:43:22.050Z"
}