{
  "book": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 7,
  "verses": [
    {
      "pk": 1977001,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 1,
      "text": "Then Jerubbaal (that is, Gideon) and all the people who were with him rose early and camped beside the spring of Harod. The camp of Midian was north of them, by the hill of Moreh, in the valley.",
      "links": "<a href='/ESV/7/6/32'>Judg. 6:32</a>; <a href='/ESV/7/6/33'>Judg. 6:33</a>",
      "comment": "Uses both names for Gideon, as in original Hebrew. Geographical markers maintained."
    },
    {
      "pk": 1977002,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 2,
      "text": "The LORD said to Gideon, 'The people with you are too many for Me to give Midian into their hand, lest Israel boast against Me, saying, 'My own hand has saved me.'",
      "links": "<a href='/ESV/5/8/17'>Deut. 8:17</a>; <a href='/ESV/7/8/6'>Judg. 8:6</a>",
      "comment": "God's reasoning explained directly. 'Boast against Me' is literal to the Hebrew."
    },
    {
      "pk": 1977003,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 3,
      "text": "Now therefore proclaim in the ears of the people, saying, 'Whoever is fearful and trembling, let him return home and depart from Mount Gilead.' So twenty-two thousand of the people returned, and ten thousand remained.",
      "links": "<a href='/ESV/5/20/8'>Deut. 20:8</a>",
      "comment": "Phrase 'in the ears' kept as literal expression."
    },
    {
      "pk": 1977004,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 4,
      "text": "And the LORD said to Gideon, 'The people are still too many. Bring them down to the water, and I will test them for you there. Any one whom I say to you, 'This one shall go with you,' he shall go; and any one whom I say to you, 'This one shall not go with you,' he shall not go.'",
      "links": "<a href='/ESV/7/7/5'>Judg. 7:5</a>",
      "comment": "Maintains God's detailed directions."
    },
    {
      "pk": 1977005,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 5,
      "text": "So he brought the people down to the water. And the LORD said to Gideon, 'Everyone who laps the water with his tongue, as a dog laps, you shall set by himself; likewise, everyone who kneels down to drink.'",
      "links": "<a href='/ESV/7/7/6'>Judg. 7:6</a>",
      "comment": "Divides two drinking methods according to Hebrew idiom."
    },
    {
      "pk": 1977006,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 6,
      "text": "Now the number of those who lapped, putting their hand to their mouth, was three hundred men; but all the rest of the people knelt down to drink water.",
      "links": "<a href='/ESV/7/7/7'>Judg. 7:7</a>",
      "comment": "Clarifies drinking position for modern reader."
    },
    {
      "pk": 1977007,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 7,
      "text": "And the LORD said to Gideon, 'With the three hundred men who lapped, I will save you and give the Midianites into your hand. Let all the others return, each to his home.'",
      "links": "<a href='/ESV/1/14/14'>Gen. 14:14</a>; <a href='/ESV/2/14/13'>Ex. 14:13</a>",
      "comment": "Emphasizes the 'three hundred' as in Hebrew word order."
    },
    {
      "pk": 1977008,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 8,
      "text": "So the people took provisions in their hands, and their trumpets. And he sent all the rest of Israel each to his tent, but he retained the three hundred men. And the camp of Midian was below him in the valley.",
      "links": "<a href='/ESV/2/14/19'>Ex. 14:19</a>",
      "comment": "Literal rendering of 'provisions in their hands.'"
    },
    {
      "pk": 1977009,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 9,
      "text": "That same night the LORD said to him, 'Arise, go down against the camp, for I have given it into your hand.'",
      "links": "<a href='/ESV/6/8/1'>Josh. 8:1</a>",
      "comment": "Maintains order and immediacy of command."
    },
    {
      "pk": 1977010,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 10,
      "text": "'But if you are afraid to go down, go down to the camp with Purah your servant.'",
      "links": "<a href='/ESV/2/4/10'>Ex. 4:10</a>",
      "comment": "Conditional command given as in Hebrew."
    },
    {
      "pk": 1977011,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 11,
      "text": "'And you shall hear what they say, and afterward your hands will be strengthened to go down against the camp.' Then he went down with Purah his servant to the outposts of the armed men who were in the camp.",
      "links": "<a href='/ESV/7/6/14'>Judg. 6:14</a>",
      "comment": "Hebrew phrase 'strengthened hands' rendered in contemporary form."
    },
    {
      "pk": 1977012,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 12,
      "text": "Now Midian and Amalek and all the people of the east lay along the valley as numerous as locusts, and their camels were without number, as the sand on the seashore for multitude.",
      "links": "<a href='/ESV/1/22/17'>Gen. 22:17</a>; <a href='/ESV/7/6/5'>Judg. 6:5</a>",
      "comment": "'As locusts' and 'as the sand on the seashore' retain original simile."
    },
    {
      "pk": 1977013,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 13,
      "text": "When Gideon came, behold, a man was telling his dream to his neighbor. And he said, 'Behold, I dreamed a dream, and behold, a loaf of barley bread tumbled into the camp of Midian, and came to the tent and struck it so that it fell, and turned it upside down, so that the tent lay flat.'",
      "links": "<a href='/ESV/7/7/14'>Judg. 7:14</a>",
      "comment": "Retains 'loaf of barley bread' and dream imagery as described."
    },
    {
      "pk": 1977014,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 14,
      "text": "And his neighbor answered, 'This is nothing but the sword of Gideon the son of Joash, a man of Israel. God has given Midian and all the camp into his hand.'",
      "links": "<a href='/ESV/7/6/14'>Judg. 6:14</a>; <a href='/ESV/6/1/9'>Josh. 1:9</a>",
      "comment": "Dream interpreted as sign of Gideon's victory."
    },
    {
      "pk": 1977015,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 15,
      "text": "When Gideon heard the telling of the dream and its interpretation, he worshiped. And he returned to the camp of Israel and said, 'Arise, for the LORD has given the camp of Midian into your hand.'",
      "links": "<a href='/ESV/1/24/26'>Gen. 24:26</a>; <a href='/ESV/2/34/8'>Ex. 34:8</a>",
      "comment": "'Worshiped' interpreted as bowing down in reverence, per Hebrew root."
    },
    {
      "pk": 1977016,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 16,
      "text": "And he divided the three hundred men into three companies and put trumpets into the hands of all of them, and empty jars, with torches inside the jars.",
      "links": "<a href='/ESV/6/6/20'>Josh. 6:20</a>; <a href='/ESV/7/7/20'>Judg. 7:20</a>",
      "comment": "Military organization and equipment described as in original."
    },
    {
      "pk": 1977017,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 17,
      "text": "And he said to them, 'Look at me, and do likewise. When I come to the edge of the camp, do as I do.'",
      "links": "<a href='/ESV/7/7/18'>Judg. 7:18</a>",
      "comment": "Instructions to imitate Gideon's actions are direct."
    },
    {
      "pk": 1977018,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 18,
      "text": "'When I blow the trumpet, I and all who are with me, then you also blow the trumpets on every side of all the camp and shout, 'For the LORD and for Gideon!''",
      "links": "<a href='/ESV/7/7/20'>Judg. 7:20</a>",
      "comment": "'For the LORD and for Gideon!' retained as battle cry."
    },
    {
      "pk": 1977019,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 19,
      "text": "So Gideon and the one hundred men who were with him came to the edge of the camp at the beginning of the middle watch, just after they had set the watch. And they blew the trumpets and broke the jars that were in their hands.",
      "links": "<a href='/ESV/7/7/22'>Judg. 7:22</a>",
      "comment": "'Middle watch' kept, referring to standard night division in ancient Israel."
    },
    {
      "pk": 1977020,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 20,
      "text": "And the three companies blew the trumpets and broke the jars. They held the torches in their left hands and the trumpets in their right hands to blow, and they shouted, 'A sword for the LORD and for Gideon!'",
      "links": "<a href='/ESV/7/7/18'>Judg. 7:18</a>",
      "comment": "Order of action carefully preserved."
    },
    {
      "pk": 1977021,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 21,
      "text": "Every man stood in his place around the camp, and all the army ran. They cried out and fled.",
      "links": "<a href='/ESV/2/14/25'>Ex. 14:25</a>; <a href='/ESV/7/7/22'>Judg. 7:22</a>",
      "comment": "'Stood in his place' is literal to Hebrew. 'Army ran' is collective for Midianite army."
    },
    {
      "pk": 1977022,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 22,
      "text": "When they blew the three hundred trumpets, the LORD set every man's sword against his comrade and against all the army. And the army fled as far as Beth-shittah toward Zererah, as far as the border of Abel-meholah, near Tabbath.",
      "links": "<a href='/ESV/7/7/23'>Judg. 7:23</a>; <a href='/ESV/9/4/12'>1 Sam. 4:12</a>",
      "comment": "Geographical names retained. 'Set sword against his comrade' is literal."
    },
    {
      "pk": 1977023,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 23,
      "text": "And the men of Israel were called from Naphtali and from Asher and from all Manasseh, and they pursued the Midianites.",
      "links": "<a href='/ESV/7/6/35'>Judg. 6:35</a>",
      "comment": "Israelite tribes explicitly named as in original."
    },
    {
      "pk": 1977024,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 24,
      "text": "And Gideon sent messengers throughout all the hill country of Ephraim, saying, 'Come down against the Midianites and seize ahead of them the waters as far as Beth-barah, and also the Jordan.' So all the men of Ephraim were called out, and they seized the waters as far as Beth-barah and the Jordan.",
      "links": "<a href='/ESV/7/8/1'>Judg. 8:1</a>",
      "comment": "'Seize ahead of them the waters' follows Hebrew word order, meaning strategic control of crossing points."
    },
    {
      "pk": 1977025,
      "translation": "AIV",
      "book": 7,
      "chapter": 7,
      "verse": 25,
      "text": "And they captured the two princes of Midian, Oreb and Zeeb. They killed Oreb at the rock of Oreb, and Zeeb they killed at the winepress of Zeeb. Then they pursued Midian, and they brought the heads of Oreb and Zeeb to Gideon beyond the Jordan.",
      "links": "<a href='/ESV/7/8/3'>Judg. 8:3</a>; <a href='/ESV/9/17/51'>1 Sam. 17:51</a>",
      "comment": "'Rock of Oreb' and 'winepress of Zeeb' are proper place names built from their deaths, as in the original Hebrew."
    }
  ],
  "translatedAt": "2025-12-22T07:06:02.603Z"
}