{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 3,
  "verses": [
    {
      "pk": 7003001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 1,
      "text": "These are the nations the LORD left to test Israel, all who had not experienced any of the wars in Canaan:",
      "links": "<a href='/AIV/2/23/29-33'>Exod. 23:29-33</a>; <a href='/AIV/7/2/21-22'>Judg. 2:21-22</a>",
      "comment": "God allowed some nations to remain in Canaan to test Israel's faithfulness and to teach future generations the art of spiritual and physical battle, showing God's providence over the growth of His people."
    },
    {
      "pk": 7003002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 2,
      "text": "He did this only to teach warfare to the descendants of Israel who had not known it before.",
      "links": "<a href='/AIV/5/8/2-3'>Deut. 8:2-3</a>",
      "comment": "God uses adversity for training and formation. This echoes how trials purify faith (see <a href='/AIV/59/1/2-4'>Jas. 1:2-4</a>)."
    },
    {
      "pk": 7003003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 3,
      "text": "The five lords of the Philistines, all the Canaanites, the Sidonians, and the Hivites who lived in Mount Lebanon, from Mount Baal-Hermon as far as Lebo-hamath.",
      "links": "<a href='/AIV/6/13/2-6'>Josh. 13:2-6</a>",
      "comment": "This details the specific nations left as Israel’s trial. Their persistent presence recalls the ongoing battle against sin in the believer’s life."
    },
    {
      "pk": 7003004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 4,
      "text": "They were left to test the Israelites, to know if they would obey the commandments of the LORD, as He had commanded their ancestors through Moses.",
      "links": "<a href='/AIV/5/8/2'>Deut. 8:2</a>; <a href='/AIV/2/15/25-26'>Exod. 15:25-26</a>",
      "comment": "God’s commands delivered through Moses are enduring. This underscores the perpetual necessity of obedience and sacred tradition."
    },
    {
      "pk": 7003005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 5,
      "text": "The Israelites lived among the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites.",
      "links": "<a href='/AIV/6/3/5'>Josh. 3:10</a>",
      "comment": "Coexistence with pagan peoples becomes a temptation; Israel’s call to separation was spiritual rather than mere geography."
    },
    {
      "pk": 7003006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 6,
      "text": "And they took their daughters for themselves as wives, gave their own daughters to their sons, and served their gods.",
      "links": "<a href='/AIV/2/34/16'>Exod. 34:16</a>; <a href='/AIV/5/7/3'>Deut. 7:3</a>",
      "comment": "Israel’s disobedience led to syncretism and idolatry, a pattern reflected whenever the faith is diluted by worldliness (cf. <a href='/AIV/59/4/4'>Jas. 4:4</a>)."
    },
    {
      "pk": 7003007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 7,
      "text": "And the Israelites did what was evil in the eyes of the LORD. They forgot the LORD their God and served the Baals and the Asheroth.",
      "links": "<a href='/AIV/7/2/11-13'>Judg. 2:11-13</a>",
      "comment": "Forgetting God leads to idolatry. The repetitive phrase marks the beginning of the 'judges cycle.' See the connection between disobedience and spiritual bondage (cf. <a href='/AIV/43/8/34'>John 8:34</a>)."
    },
    {
      "pk": 7003008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 8,
      "text": "So the anger of the LORD was kindled against Israel, and He sold them into the hand of Cushan-Rishathaim king of Aram-Naharaim. And the Israelites served Cushan-Rishathaim for eight years.",
      "links": "<a href='/AIV/7/2/14'>Judg. 2:14</a>",
      "comment": "Divine anger brings chastisement, not out of cruelty, but to draw His people to repentance. Deliverance often follows penance and prayer."
    },
    {
      "pk": 7003009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 9,
      "text": "But when the Israelites cried out to the LORD, the LORD raised up a deliverer for them—Othniel the son of Kenaz, Caleb’s younger brother—who saved them.",
      "links": "<a href='/AIV/6/15/17'>Josh. 15:17</a>; <a href='/AIV/7/1/13'>Judg. 1:13</a>",
      "comment": "God’s mercy is ready for the repentant. The pattern of raising up a judge prefigures the ultimate Deliverer (see <a href='/AIV/40/1/21'>Matt. 1:21</a>), showing how God works through human mediators."
    },
    {
      "pk": 7003010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 10,
      "text": "The Spirit of the LORD came upon him, and he judged Israel. He went out to war, and the LORD gave Cushan-Rishathaim king of Aram-Naharaim into his hand. Othniel’s hand prevailed over Cushan-Rishathaim.",
      "links": "<a href='/AIV/4/27/18'>Num. 27:18</a>; <a href='/AIV/7/6/34'>Judg. 6:34</a>",
      "comment": "The Spirit equips the judge. Spiritual authority and victory are from God’s initiative, not human strength. Note the pattern of the Spirit resting on chosen individuals, a type fulfilled in the definitive sending of the Spirit at Pentecost (see <a href='/AIV/44/2/4'>Acts 2:4</a>)."
    },
    {
      "pk": 7003011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 11,
      "text": "Then the land had rest forty years. And Othniel the son of Kenaz died.",
      "links": "<a href='/AIV/7/2/18-19'>Judg. 2:18-19</a>",
      "comment": "A period of peace follows righteous leadership, but it is limited and temporary—pointing to the need for a lasting, divinely established order."
    },
    {
      "pk": 7003012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 12,
      "text": "And the Israelites again did what was evil in the eyes of the LORD. And the LORD gave Eglon king of Moab power over Israel because they did what was evil in the eyes of the LORD.",
      "links": "<a href='/AIV/7/2/19-20'>Judg. 2:19-20</a>",
      "comment": "Israel's repeated sin triggers another loss of freedom. This demonstrates the importance of remaining steady in faith and fidelity to divine covenant."
    },
    {
      "pk": 7003013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 13,
      "text": "He gathered to himself the Ammonites and the Amalekites, and went and defeated Israel, and they took possession of the City of Palms.",
      "links": "<a href='/AIV/5/34/3'>Deut. 34:3</a>; <a href='/AIV/6/1/16'>Josh. 16:1</a>",
      "comment": "‘The City of Palms’ refers to Jericho. The alliances of Israel’s enemies emphasize the cost of unfaithfulness."
    },
    {
      "pk": 7003014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 14,
      "text": "So the Israelites served Eglon king of Moab for eighteen years.",
      "links": "<a href='/AIV/7/3/8'>Judg. 3:8</a>",
      "comment": "Bondage is allowed to discipline God’s people, as a father disciplines a wayward child. See <a href='/AIV/58/12/6'>Heb. 12:6</a>."
    },
    {
      "pk": 7003015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 15,
      "text": "But when the Israelites cried out to the LORD, the LORD raised up a deliverer for them, Ehud the son of Gera, the Benjamite, a left-handed man. The Israelites sent tribute by him to Eglon king of Moab.",
      "links": "<a href='/AIV/7/2/16'>Judg. 2:16</a>",
      "comment": "Ehud’s selection—left-handed and from Benjamin—shows God raises unlikely deliverers, prefiguring later surprising choices throughout salvation history."
    },
    {
      "pk": 7003016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 16,
      "text": "Ehud made himself a double-edged sword, a cubit long, and strapped it under his clothing on his right thigh.",
      "links": "<a href='/AIV/58/4/12'>Heb. 4:12</a>",
      "comment": "The ‘double-edged sword’ carries symbolic meaning; Hebrews later uses it to depict the Word of God, dividing soul and spirit."
    },
    {
      "pk": 7003017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 17,
      "text": "He presented the tribute to Eglon king of Moab—who was a very fat man.",
      "links": "<a href='/AIV/7/3/15'>Judg. 3:15</a>",
      "comment": "The tribute is a sign of Israel’s servitude. Describing Eglon as 'very fat' foreshadows his vulnerability."
    },
    {
      "pk": 7003018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 18,
      "text": "When Ehud had finished presenting the tribute, he sent away the people who had carried it.",
      "links": "<a href='/AIV/7/3/15-17'>Judg. 3:15-17</a>",
      "comment": "Ehud operates alone from this point, showing individual initiative under divine guidance."
    },
    {
      "pk": 7003019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 19,
      "text": "But he turned back at the carved idols near Gilgal and said, 'I have a secret message for you, O king.' And the king said, 'Silence!' and all his attendants went out from his presence.",
      "links": "<a href='/AIV/6/4/19'>Josh. 4:19'>; <a href='/AIV/7/6/25'>Judg. 6:25</a>",
      "comment": "Mention of ‘carved idols’ near Gilgal underlines the spiritual decline. The secrecy echoes the motif of mystery in divine deliverance."
    },
    {
      "pk": 7003020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 20,
      "text": "Ehud came to him as he was sitting alone in his cool upper room. And Ehud said, 'I have a message from God for you.' And as the king rose from his seat,",
      "links": "<a href='/AIV/7/4/17-21'>Judg. 4:17-21</a>",
      "comment": "The phrase 'message from God' is loaded—God uses the weak to shame the strong (cf. <a href='/AIV/46/1/27'>1 Cor. 1:27</a>)."
    },
    {
      "pk": 7003021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 21,
      "text": "Ehud reached with his left hand, drew the sword from his right thigh, and thrust it into his belly.",
      "links": "<a href='/AIV/7/3/16'>Judg. 3:16</a>",
      "comment": "Ehud’s unexpected action exploited the king’s vulnerability—divine deliverance sometimes comes through unconventional means."
    },
    {
      "pk": 7003022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 22,
      "text": "Even the handle went in after the blade, and the fat closed over the blade, for he did not pull the sword out of his belly; and the filth came out.",
      "links": "<a href='/AIV/7/3/16'>Judg. 3:16</a>",
      "comment": "This vivid description shows the completeness of the act. The narrative is unembellished, underscoring the finality of the judgment."
    },
    {
      "pk": 7003023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 23,
      "text": "Ehud went out to the porch, closed the doors of the upper room behind him, and locked them.",
      "links": "<a href='/AIV/7/3/24'>Judg. 3:24</a>",
      "comment": "Ehud’s escape is enabled by the confusion of Eglon’s attendants; the situation unfolds as if providence itself was guiding events."
    },
    {
      "pk": 7003024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 24,
      "text": "After he had gone, the servants came and saw that the doors of the upper room were locked. They said, 'He must be relieving himself in the cool room.'",
      "links": "<a href='/AIV/7/3/20'>Judg. 3:20</a>",
      "comment": "God’s providence frustrates the mighty through simple misunderstandings, echoing the theme that God exalts the humble."
    },
    {
      "pk": 7003025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 25,
      "text": "They waited to the point of embarrassment, but when he still did not open the doors, they took the key and opened them. There they saw their lord fallen to the floor, dead.",
      "links": "<a href='/AIV/7/3/24'>Judg. 3:24</a>",
      "comment": "The timing of the servants’ discovery ensures Ehud’s escape and shows God’s perfect timing in deliverance."
    },
    {
      "pk": 7003026,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 26,
      "text": "While they delayed, Ehud escaped, passed beyond the idols, and escaped to Seirah.",
      "links": "<a href='/AIV/7/3/19'>Judg. 3:19</a>",
      "comment": "‘Passed beyond the idols’ implicitly contrasts the powerlessness of idols with the true God’s living power."
    },
    {
      "pk": 7003027,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 27,
      "text": "When he arrived, he blew the horn in the hill country of Ephraim, and the Israelites went down with him from the hill country, and he led them.",
      "links": "<a href='/AIV/6/6/5'>Josh. 6:5</a>; <a href='/AIV/7/6/34'>Judg. 6:34</a>",
      "comment": "The horn signals victory and gathering, reminiscent of other redemptive moments in Scripture and foreshadowing the eschatological trumpet (see <a href='/AIV/52/4/16'>1 Thess. 4:16</a>)."
    },
    {
      "pk": 7003028,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 28,
      "text": "He said to them, 'Follow me, for the LORD has given your enemies the Moabites into your hand.' So they went down after him, seized the fords of the Jordan against the Moabites, and did not allow anyone to cross over.",
      "links": "<a href='/AIV/6/2/7'>Josh. 2:7</a>",
      "comment": "Ehud’s command, 'follow me,' illustrates appointed leadership in God’s plan. The motif of following a divinely chosen leader prefigures the invitation of Christ."
    },
    {
      "pk": 7003029,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 29,
      "text": "At that time they struck down about ten thousand Moabites, all strong and able men; not a man escaped.",
      "links": "<a href='/AIV/3/26/11'>Lev. 26:7-8</a>",
      "comment": "God’s deliverance is complete. The motif of total victory over the enemy foreshadows the ultimate triumph over sin and death."
    },
    {
      "pk": 7003030,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 30,
      "text": "So Moab was subdued that day under the hand of Israel, and the land had rest for eighty years.",
      "links": "<a href='/AIV/7/3/11'>Judg. 3:11</a>",
      "comment": "Divinely ordered peace follows faithful deliverance. Note the longer peace, hinting at the blessings of unity under true faith and order."
    },
    {
      "pk": 7003031,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 3,
      "verse": 31,
      "text": "After him was Shamgar the son of Anath, who struck down six hundred Philistines with an oxgoad, and he too delivered Israel.",
      "links": "<a href='/AIV/7/5/6'>Judg. 5:6</a>; <a href='/AIV/9/13/5'>1 Sam. 13:5</a>",
      "comment": "Shamgar’s deliverance by humble means (an oxgoad) highlights that God uses unexpected instruments. Every period of crisis calls for a divinely prepared leader, echoing the perpetual need for faithful shepherds over God’s people."
    }
  ],
  "translatedAt": "2025-12-24T02:32:08.148Z"
}