{
  "book": 58,
  "bookName": "Colossians",
  "bookAbbreviation": "Col",
  "chapter": 2,
  "verses": [
    {
      "pk": 58002001,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 1,
      "text": "For I want you to know how great a struggle I have for you, for those in Laodicea, and for all who have not seen me face to face.",
      "links": "<a href='/AIV/57/4/15-16'>Phil. 4:15-16</a>; <a href='/AIV/58/4/13'>Col. 4:13</a>",
      "comment": "Paul's concern extends beyond Colossae, showing the unity and universal mission of the Church. He suffers and strives for believers even those he has never met, demonstrating apostolic care."
    },
    {
      "pk": 58002002,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 2,
      "text": "That their hearts might be comforted, being knit together in love, and attaining to all riches of full assurance of understanding, to the knowledge of God’s mystery—Christ,",
      "links": "<a href='/AIV/46/1/10'>1 Cor. 1:10</a>; <a href='/AIV/58/1/27'>Col. 1:27</a>",
      "comment": "Paul sees comfort and deep unity in love as key marks of fellowship. The mystery of God is Christ Himself; full assurance comes from knowing Him in the context of communal unity."
    },
    {
      "pk": 58002003,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 3,
      "text": "In whom are hidden all the treasures of wisdom and knowledge.",
      "links": "<a href='/AIV/20/8/11-14'>Prov. 8:11-14</a>; <a href='/AIV/51/3/20'>Rom. 11:33</a>",
      "comment": "Christ is the source and fullness of divine wisdom, echoing Old Testament wisdom tradition (see Prov. 8). True knowledge is not scattered but centered in Christ—an argument for the centrality of Christ in all spiritual matters."
    },
    {
      "pk": 58002004,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 4,
      "text": "I am saying this so that no one may deceive you with persuasive arguments.",
      "links": "<a href='/AIV/40/24/4'>Matt. 24:4</a>; <a href='/AIV/47/11/3'>2 Cor. 11:3</a>",
      "comment": "Paul warns the believers against false teaching and persuasive rhetoric. The apostolic office acts as a safeguard for sound doctrine—a subtle nod toward the need for spiritual authority and tradition."
    },
    {
      "pk": 58002005,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 5,
      "text": "For though I am absent in body, yet I am with you in spirit, rejoicing to see your good order and the steadfastness of your faith in Christ.",
      "links": "<a href='/AIV/46/5/3'>1 Cor. 5:3</a>; <a href='/AIV/58/1/4'>Col. 1:4</a>",
      "comment": "Paul’s spiritual presence among the Colossians points to a mystical unity in the Church. 'Good order' and 'steadfastness' suggest communal discipline, not just individual faith."
    },
    {
      "pk": 58002006,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 6,
      "text": "Therefore, just as you received Christ Jesus the Lord, so walk in him,",
      "links": "<a href='/AIV/50/4/1'>Eph. 4:1</a>; <a href='/AIV/56/1/16'>Titus 1:16</a>",
      "comment": "Receiving Christ is more than an isolated act—it is the beginning of a continual journey. Walking in Him means living out the sacramental and moral demands of Christian life."
    },
    {
      "pk": 58002007,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 7,
      "text": "Rooted and built up in him, established in the faith as you were taught, abounding in thanksgiving.",
      "links": "<a href='/AIV/19/1/3'>Ps. 1:3</a>; <a href='/AIV/46/3/10'>1 Cor. 3:10</a>",
      "comment": "Paul emphasizes being ‘rooted’ and ‘built up’—suggesting ongoing growth by reliable teaching and tradition. Thanksgiving is a spiritual practice that accompanies deep faith."
    },
    {
      "pk": 58002008,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 8,
      "text": "See to it that no one takes you captive by philosophy and empty deceit, according to human tradition, according to the elemental spirits of the world, and not according to Christ.",
      "links": "<a href='/AIV/46/1/20'>1 Cor. 1:20</a>; <a href='/AIV/51/1/21'>Rom. 1:21-22</a>",
      "comment": "Paul cautions against teachings outside the apostolic tradition. True doctrine flows from Christ and those He appoints, not simply human reasoning or worldly philosophies."
    },
    {
      "pk": 58002009,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 9,
      "text": "For in him the whole fullness of Deity dwells bodily,",
      "links": "<a href='/AIV/43/1/14'>John 1:14</a>; <a href='/AIV/50/2/9'>Eph. 3:19</a>; <a href='/AIV/58/1/19'>Col. 1:19</a>",
      "comment": "This verse affirms Christ's divinity and incarnation. He is fully God and fully man—rejecting all ideas that treat Jesus as less than truly divine."
    },
    {
      "pk": 58002010,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 10,
      "text": "And you are complete in him, who is the head over every ruler and authority.",
      "links": "<a href='/AIV/46/15/27'>1 Cor. 15:27</a>; <a href='/AIV/50/1/21'>Eph. 1:21-22</a>",
      "comment": "Christ's supremacy over all spiritual and earthly powers means believers share in His fullness. This underlines the importance of remaining united in Him, especially through the life of the Church."
    },
    {
      "pk": 58002011,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 11,
      "text": "In him you were also circumcised with a circumcision not done by human hands, by the removal of the body of flesh, by the circumcision of Christ.",
      "links": "<a href='/AIV/45/2/28-29'>Rom. 2:28-29</a>; <a href='/AIV/51/2/29'>Rom. 6:6</a>",
      "comment": "Paul presents baptism as a spiritual circumcision, marking entrance into the people of God. The image emphasizes sacramental initiation as the new spiritual birth."
    },
    {
      "pk": 58002012,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 12,
      "text": "Having been buried with him in baptism, in which you were also raised with him through faith in the working of God, who raised him from the dead.",
      "links": "<a href='/AIV/45/6/4'>Rom. 6:4</a>; <a href='/AIV/46/15/20'>1 Cor. 15:20</a>",
      "comment": "The sacramental imagery here shows that believers truly participate in Christ’s death and resurrection—not just symbolically, but mystically, through baptism."
    },
    {
      "pk": 58002013,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 13,
      "text": "And you, who were dead in your trespasses and in the uncircumcision of your flesh, God made alive together with him, having forgiven us all our trespasses,",
      "links": "<a href='/AIV/50/2/1-5'>Eph. 2:1-5</a>; <a href='/AIV/19/103/3'>Ps. 103:3</a>",
      "comment": "God's action restores life and forgives sins through union with Christ. The 'togetherness' highlights the communal nature of salvation, not merely an individual experience."
    },
    {
      "pk": 58002014,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 14,
      "text": "Having canceled the record of debt that stood against us with its legal demands, he has taken it away, nailing it to the cross.",
      "links": "<a href='/AIV/45/7/6'>Rom. 7:6</a>; <a href='/AIV/23/53/6'>Isa. 53:6</a>",
      "comment": "Through Christ’s sacrifice, the Law's demands are fulfilled and our debts erased. This fulfillment is accomplished by an act that joins divine mercy with justice."
    },
    {
      "pk": 58002015,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 15,
      "text": "He disarmed the rulers and authorities and made a public spectacle of them, triumphing over them by the cross.",
      "links": "<a href='/AIV/19/2/2-4'>Ps. 2:2-4</a>; <a href='/AIV/50/6/12'>Eph. 6:12</a>",
      "comment": "Christ’s victory is cosmic—He defeats not only human powers but spiritual ones. The cross is the means of victory, underscoring God's plan foretold in the Old Testament."
    },
    {
      "pk": 58002016,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 16,
      "text": "So let no one judge you in food or in drink, or regarding a festival, or a new moon, or sabbaths.",
      "links": "<a href='/AIV/45/14/5'>Rom. 14:5</a>; <a href='/AIV/03/23/2-4'>Lev. 23:2-4</a>",
      "comment": "Ritual regulations are fulfilled in Christ. The Church now calls believers beyond old ceremonial law to a deeper spiritual reality centered in Christ."
    },
    {
      "pk": 58002017,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 17,
      "text": "These are a shadow of things to come, but the reality is found in Christ.",
      "links": "<a href='/AIV/58/3/1'>Col. 3:1</a>; <a href='/AIV/58/1/26-27'>Col. 1:26-27</a>",
      "comment": "Old Testament rituals pointed ahead to Christ. He brings the fullness and substance to what those things foreshadowed. Spiritual worship now supersedes mere external observances."
    },
    {
      "pk": 58002018,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 18,
      "text": "Let no one disqualify you, insisting on self-abasement and worship of angels, going on in detail about visions, puffed up without reason by fleshly mind.",
      "links": "<a href='/AIV/45/1/25'>Rom. 1:25</a>; <a href='/AIV/50/2/8'>Eph. 2:8-9</a>",
      "comment": "Paul condemns false spirituality not rooted in the Church's tradition. True faith avoids mystical experiences or private revelations that are divorced from the apostolic fullness."
    },
    {
      "pk": 58002019,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 19,
      "text": "And not holding fast to the Head, from whom the whole body, nourished and knit together through its joints and ligaments, grows with a growth that is from God.",
      "links": "<a href='/AIV/50/4/15-16'>Eph. 4:15-16</a>; <a href='/AIV/46/12/12-27'>1 Cor. 12:12-27</a>",
      "comment": "Christ as the Head means spiritual life flows into the whole Church, united and nourished by Him. Growth comes through unity, not isolated individualism."
    },
    {
      "pk": 58002020,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 20,
      "text": "If with Christ you died to the elemental spirits of the world, why, as though living in the world, do you submit to its regulations—",
      "links": "<a href='/AIV/45/6/2-3'>Rom. 6:2-3</a>",
      "comment": "Through union with Christ believers die to old, worldly spiritual powers. Paul warns against returning to rules that no longer apply in the new life of faith."
    },
    {
      "pk": 58002021,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 21,
      "text": "\"Do not handle, do not taste, do not touch\"—",
      "links": "<a href='/AIV/41/7/18-19'>Mark 7:18-19</a>; <a href='/AIV/45/14/17'>Rom. 14:17</a>",
      "comment": "Paul lists old ritual commands, now surpassed in the new covenant. Emphasis is shifted from ritual purity to inner sanctification and holiness brought about by grace."
    },
    {
      "pk": 58002022,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 22,
      "text": "All these are destined to perish with use, according to human precepts and teachings.",
      "links": "<a href='/AIV/23/29/13'>Isa. 29:13</a>; <a href='/AIV/40/15/9'>Matt. 15:9</a>",
      "comment": "Human regulations cannot lead to lasting spiritual life. True growth requires faithfulness to the apostolic tradition and the supernatural means of grace provided by God."
    },
    {
      "pk": 58002023,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 2,
      "verse": 23,
      "text": "These indeed have an appearance of wisdom in self-made religion, humility, and severity to the body, but they are of no value in restraining fleshly indulgence.",
      "links": "<a href='/AIV/45/8/13'>Rom. 8:13</a>; <a href='/AIV/40/23/27-28'>Matt. 23:27-28</a>",
      "comment": "Outward religious acts may look wise but lack power without the inner transformation given by grace. The spiritual life is not achieved through mere discipline, but by living in union with Christ through the mysteries He left His Church."
    }
  ],
  "translatedAt": "2025-12-24T12:06:47.192Z"
}