{
  "book": "Colossians",
  "bookAbbreviation": "Col",
  "chapter": 1,
  "verses": [
    {
      "pk": 2801001,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 1,
      "text": "Paul, an apostle of Christ Jesus by the will of God, and Timothy our brother,",
      "links": "<a href='/AIV/46/1/1'>1 Cor. 1:1</a>; <a href='/AIV/50/1/1'>Phil. 1:1</a>",
      "comment": "Paul begins by asserting his apostleship is by God's will, a standard greeting, establishing his authority."
    },
    {
      "pk": 2801002,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 2,
      "text": "To the holy ones and faithful brothers in Christ at Colossae: Grace to you and peace from God our Father.",
      "links": "<a href='/AIV/45/1/7'>Rom. 1:7</a>",
      "comment": "'Holy ones' can mean those set apart; Paul greets the church with spiritual kinship and blessing."
    },
    {
      "pk": 2801003,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 3,
      "text": "We always thank God, the Father of our Lord Jesus Christ, when we pray for you,",
      "links": "<a href='/AIV/52/1/2'>1 Thess. 1:2</a>",
      "comment": "Thankfulness in prayer underscores the community’s spiritual unity, rooted in Jesus’ divine relationship with the Father."
    },
    {
      "pk": 2801004,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 4,
      "text": "Because we have heard of your faith in Christ Jesus and the love that you have for all the holy ones,",
      "links": "<a href='/AIV/49/1/15'>Eph. 1:15</a>",
      "comment": "Faith and love are central signs of genuine Christianity—a theme in nearly every epistle."
    },
    {
      "pk": 2801005,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 5,
      "text": "Because of the hope laid up for you in heaven, of which you previously heard in the word of truth, the gospel,",
      "links": "<a href='/AIV/60/1/4'>1 Pet. 1:4</a>",
      "comment": "Paul traces Christian virtues to the ultimate hope stored up in heaven, linking the gospel to eternal reward."
    },
    {
      "pk": 2801006,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 6,
      "text": "Which has come to you, as indeed in the entire world it is bearing fruit and growing, just as it also does among you, since the day you heard it and recognized God’s grace in truth.",
      "links": "<a href='/AIV/40/13/23'>Matt. 13:23</a>; <a href='/AIV/45/16/26'>Rom. 16:26</a>",
      "comment": "The gospel’s universality and fruitfulness is emphasized; hearing and truly knowing grace is transformative."
    },
    {
      "pk": 2801007,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 7,
      "text": "You learned this from Epaphras, our beloved fellow servant. He is a faithful minister of Christ on your behalf,",
      "links": "<a href='/AIV/51/4/12'>Col. 4:12</a>",
      "comment": "Epaphras played a key role in founding the Colossian church, showing apostolic succession and authority in teaching."
    },
    {
      "pk": 2801008,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 8,
      "text": "And has made known to us your love in the Spirit.",
      "links": "<a href='/AIV/45/5/5'>Rom. 5:5</a>",
      "comment": "Love manifested by the Spirit unifies believers, highlighting the centrality of the Spirit’s work in the Church."
    },
    {
      "pk": 2801009,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 9,
      "text": "So, from the day we heard, we have not ceased praying for you and asking that you may be filled with knowledge of His will in all spiritual wisdom and understanding,",
      "links": "<a href='/AIV/49/1/17'>Eph. 1:17</a>; <a href='/AIV/20/2/6'>Prov. 2:6</a>",
      "comment": "Paul prays for fullness of spiritual wisdom—a sign of maturity in faith, holding out spiritual knowledge as a goal."
    },
    {
      "pk": 2801010,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 10,
      "text": "So that you may walk in a manner worthy of the Lord, pleasing Him in every way, bearing fruit in every good work and increasing in the knowledge of God.",
      "links": "<a href='/AIV/49/4/1'>Eph. 4:1</a>; <a href='/AIV/40/7/16-20'>Matt. 7:16–20</a>",
      "comment": "Works and knowledge are intertwined with faith, showing how salvation inevitably results in spiritual fruit and growth."
    },
    {
      "pk": 2801011,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 11,
      "text": "Being strengthened with all power according to His glorious might, for all perseverance and patience with joy.",
      "links": "<a href='/AIV/49/3/16'>Eph. 3:16</a>",
      "comment": "Growth requires God's power—a supernatural work producing endurance and joy amid trials."
    },
    {
      "pk": 2801012,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 12,
      "text": "Giving thanks to the Father, who has made you qualified to share in the inheritance of the holy ones in light.",
      "links": "<a href='/AIV/44/20/32'>Acts 20:32</a>; <a href='/AIV/19/16/6'>Ps. 16:6</a>",
      "comment": "The Church’s inheritance echoes Israel’s, but now spiritual and universal; it is by the Father’s initiative we are made fit."
    },
    {
      "pk": 2801013,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 13,
      "text": "He has delivered us from the authority of darkness and transferred us to the kingdom of His beloved Son,",
      "links": "<a href='/AIV/40/4/16'>Matt. 4:16</a>; <a href='/AIV/43/3/5'>John 3:5</a>",
      "comment": "A spiritual migration from bondage to true freedom in Christ’s kingdom; note baptismal language of 'transfer.'"
    },
    {
      "pk": 2801014,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 14,
      "text": "In whom we have redemption, the forgiveness of sins.",
      "links": "<a href='/AIV/49/1/7'>Eph. 1:7</a>; <a href='/AIV/40/26/28'>Matt. 26:28</a>",
      "comment": "Redemption and forgiveness are found in Christ; reference to sacrificial atonement and new covenant promise."
    },
    {
      "pk": 2801015,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 15,
      "text": "He is the image of the invisible God, the firstborn over all creation.",
      "links": "<a href='/AIV/43/1/18'>John 1:18</a>; <a href='/AIV/19/89/27'>Ps. 89:27</a>",
      "comment": "'Image' means Jesus perfectly reveals God—affirming His divinity. Firstborn signifies preeminence, not createdness."
    },
    {
      "pk": 2801016,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 16,
      "text": "For by Him all things were created—in heaven and on earth, visible and invisible; whether thrones, rulers, powers, or authorities—all things were created through Him and for Him.",
      "links": "<a href='/AIV/43/1/3'>John 1:3</a>; <a href='/AIV/41/16/15'>Mark 16:15</a>",
      "comment": "Jesus is Creator, not created—He is the source of all existence, including angelic beings; high Christology."
    },
    {
      "pk": 2801017,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 17,
      "text": "And He is before all things, and in Him all things hold together.",
      "links": "<a href='/AIV/58/1/3'>Heb. 1:3</a>",
      "comment": "Jesus’ pre-existence and sustaining power; foundational for understanding the eternal Word."
    },
    {
      "pk": 2801018,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 18,
      "text": "He is also the head of the body, the Church. He is the beginning, the firstborn from the dead, so that in everything He might hold supremacy.",
      "links": "<a href='/AIV/46/12/27'>1 Cor. 12:27</a>; <a href='/AIV/66/1/5'>Rev. 1:5</a>",
      "comment": "Jesus’ primacy as head and source ties together church unity and resurrection; a singular, visible church with spiritual authority."
    },
    {
      "pk": 2801019,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 19,
      "text": "For God was pleased to have all fullness dwell in Him,",
      "links": "<a href='/AIV/43/1/14'>John 1:14</a>; <a href='/AIV/51/2/9'>Col. 2:9</a>",
      "comment": "Fullness means the entire divine nature; Christ alone perfectly reveals and mediates God’s presence."
    },
    {
      "pk": 2801020,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 20,
      "text": "And through Him to reconcile all things to Himself, making peace by the blood of His cross—whether things on earth or things in heaven.",
      "links": "<a href='/AIV/49/2/16'>Eph. 2:16</a>; <a href='/AIV/40/26/28'>Matt. 26:28</a>",
      "comment": "Reconciliation is cosmic and achieved through the cross; Christ’s sacrifice restores harmony."
    },
    {
      "pk": 2801021,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 21,
      "text": "And you, who once were alienated and hostile in mind, doing evil deeds,",
      "links": "<a href='/AIV/49/2/1-2'>Eph. 2:1–2</a>",
      "comment": "A reminder of our former state—sin separates, but Christ brings reconciliation."
    },
    {
      "pk": 2801022,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 22,
      "text": "He has now reconciled in His body of flesh through death, to present you holy, blameless, and above reproach before Him—",
      "links": "<a href='/AIV/58/10/10'>Heb. 10:10</a>; <a href='/AIV/45/8/1'>Rom. 8:1</a>",
      "comment": "Christ’s physical death is the means for our sanctification; the language of 'presenting' is liturgical and sacramental."
    },
    {
      "pk": 2801023,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 23,
      "text": "If indeed you remain established and steadfast in the faith, not moving away from the hope of the gospel that you heard, which has been proclaimed in all creation under heaven, and of which I, Paul, became a minister.",
      "links": "<a href='/AIV/46/15/1'>1 Cor. 15:1</a>; <a href='/AIV/45/1/5'>Rom. 1:5</a>",
      "comment": "Perseverance in faith is necessary; Paul’s role as minister underlines apostolic authority and church structure."
    },
    {
      "pk": 2801024,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 24,
      "text": "Now I rejoice in my sufferings for your sake, and in my flesh I am filling up what is lacking in Christ’s afflictions for the sake of His body, that is, the Church.",
      "links": "<a href='/AIV/47/4/10-12'>2 Cor. 4:10–12</a>; <a href='/AIV/51/1/18'>Col. 1:18</a>",
      "comment": "Paul participates in Christ’s work through his sufferings; believers are mystically united to Christ’s passion. The phrase 'what is lacking' underscores the ongoing redemptive role of the Church and her ministers."
    },
    {
      "pk": 2801025,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 25,
      "text": "Of which I became a minister according to the stewardship from God that was given to me for you, to make the word of God fully known,",
      "links": "<a href='/AIV/45/15/16'>Rom. 15:16</a>",
      "comment": "Paul’s role is divinely appointed and involves dispensing spiritual mysteries—a concept of sacred stewardship in teaching."
    },
    {
      "pk": 2801026,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 26,
      "text": "The mystery that was hidden for ages and generations but is now revealed to His holy ones.",
      "links": "<a href='/AIV/49/3/9'>Eph. 3:9</a>; <a href='/AIV/45/16/25-26'>Rom. 16:25–26</a>",
      "comment": "The mystery refers to Christ and His work, now revealed; this refers to divine revelation guarded and dispensed through the Church’s ministry."
    },
    {
      "pk": 2801027,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 27,
      "text": "To them God chose to make known how great among the nations are the riches of the glory of this mystery—which is Christ in you, the hope of glory.",
      "links": "<a href='/AIV/45/8/10'>Rom. 8:10</a>",
      "comment": "Salvation extends to all nations; the indwelling Christ is the guarantee of future glory—an implicit doctrine of grace and ongoing sanctification."
    },
    {
      "pk": 2801028,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 28,
      "text": "Him we proclaim, warning everyone and teaching everyone in all wisdom, so that we may present everyone mature in Christ.",
      "links": "<a href='/AIV/51/1/22'>Col. 1:22</a>; <a href='/AIV/58/5/14'>Heb. 5:14</a>",
      "comment": "Proclamation and teaching are duties of the Church; the goal is maturity, pointing to the process of sanctification over time."
    },
    {
      "pk": 2801029,
      "translation": "AIV",
      "book": 51,
      "chapter": 1,
      "verse": 29,
      "text": "For this I labor, struggling with all His energy that powerfully works within me.",
      "links": "<a href='/AIV/46/15/10'>1 Cor. 15:10</a>",
      "comment": "Paul’s ministry is energized by divine grace—emphasizing that all spiritual fruit comes through God's power acting in and through the believer."
    }
  ],
  "translatedAt": "2025-12-23T03:57:43.365Z"
}