{
  "book": 58,
  "bookName": "Colossians",
  "bookAbbreviation": "Col",
  "chapter": 3,
  "verses": [
    {
      "pk": 58003001,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 1,
      "text": "So if you have been raised with Christ, seek the things that are above, where Christ is, seated at the right hand of God.",
      "links": "<a href='/AIV/51/1/20'>Eph. 1:20</a>; <a href='/AIV/19/110/1'>Ps. 110:1</a>",
      "comment": "Paul begins by connecting the believer's resurrection with Christ to seeking heavenly realities. The imagery of Christ 'seated at the right hand of God' echoes Old Testament prophecy (Ps. 110:1) and shows Christ's divine authority, affirming His divinity. It also hints at our union with Christ being both spiritual and mystical through sharing in His resurrection."
    },
    {
      "pk": 58003002,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 2,
      "text": "Set your minds on the things above, not on the things that are on earth.",
      "links": "<a href='/AIV/40/6/33'>Matt. 6:33</a>; <a href='/AIV/45/8/5'>Rom. 8:5</a>",
      "comment": "Believers are called not to be distracted by earthly concerns, but to focus on heavenly values. This spiritual direction reinforces the priority of seeking the eternal over the temporal, in line with Jesus' own teaching (Matt. 6:33)."
    },
    {
      "pk": 58003003,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 3,
      "text": "For you died, and your life is hidden with Christ in God.",
      "links": "<a href='/AIV/45/6/11'>Rom. 6:11</a>; <a href='/AIV/62/1/2'>1 John 2:2</a>",
      "comment": "Paul affirms the mystery that believers, through baptism, participate in Christ's death and now have their true life hidden with Him. This portrays a real spiritual union—a deep sacramental reality—between believer and Christ, made present through faith, and also through the graces we receive in participating in the rites of the church."
    },
    {
      "pk": 58003004,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 4,
      "text": "When Christ, who is your life, appears, then you also will appear with him in glory.",
      "links": "<a href='/AIV/54/4/8'>2 Tim. 4:8</a>; <a href='/AIV/46/15/51-52'>1 Cor. 15:51-52</a>",
      "comment": "This looks forward to Christ’s Second Coming, where believers will be glorified with Him. Provides a strong hope and reminds us of the ultimate destiny: sharing in Christ’s life and glory."
    },
    {
      "pk": 58003005,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 5,
      "text": "Therefore, put to death what is earthly in you: sexual immorality, impurity, passion, evil desire, and greed—which is idolatry.",
      "links": "<a href='/AIV/49/4/19'>Eph. 4:19</a>; <a href='/AIV/45/1/29'>Rom. 1:29</a>",
      "comment": "Paul commands a decisive break with sin, likening these sinful tendencies (especially greed) to idolatry. The implication is that true conversion leads to real moral transformation, made possible by God's grace."
    },
    {
      "pk": 58003006,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 6,
      "text": "Because of these, the wrath of God is coming on the sons of disobedience.",
      "links": "<a href='/AIV/49/5/6'>Eph. 5:6</a>; <a href='/AIV/50/3/6'>Phil. 3:6</a>",
      "comment": "Moral accountability remains central in Paul’s teaching; God’s wrath is a just response to persistent sin. 'Sons of disobedience' suggests a state of rebellion against God's order, underscoring the need for repentance."
    },
    {
      "pk": 58003007,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 7,
      "text": "You once walked in these things, when you lived in them.",
      "links": "<a href='/AIV/49/2/2'>Eph. 2:2</a>",
      "comment": "Paul reminds believers of their past, emphasizing the transformation from old life to new. This is a classic pattern of conversion: a clear distinction between old self (under sin) and new self (in Christ)."
    },
    {
      "pk": 58003008,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 8,
      "text": "But now you must put away all of these: anger, wrath, malice, slander, and filthy language from your mouth.",
      "links": "<a href='/AIV/49/4/31'>Eph. 4:31</a>; <a href='/AIV/40/15/11'>Matt. 15:11</a>",
      "comment": "Christian transformation is both inward and outward—it must affect speech and attitude. Eliminating these vices is necessary for living in the new life given through Christ, and fosters true unity within the body."
    },
    {
      "pk": 58003009,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 9,
      "text": "Do not lie to one another, seeing that you have put off the old self with its practices",
      "links": "<a href='/AIV/49/4/25'>Eph. 4:25</a>; <a href='/AIV/56/3/3'>Titus 3:3</a>",
      "comment": "Deceit is incompatible with Christian life. The putting off of the 'old self' signals a definitive break, tied to the transformative power of grace received through being joined to Christ."
    },
    {
      "pk": 58003010,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 10,
      "text": "and have put on the new self, which is being renewed in knowledge after the image of its Creator.",
      "links": "<a href='/AIV/49/4/24'>Eph. 4:24</a>; <a href='/AIV/01/1/27'>Gen. 1:27</a>",
      "comment": "Paul refers to ongoing renewal—being continuously transformed into Christ’s image (cf. Gen. 1:27). Renewal comes through knowledge, linking faith and reason, and highlights the steady growth in holiness within a communal context."
    },
    {
      "pk": 58003011,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 11,
      "text": "Here there is not Greek and Jew, circumcised and uncircumcised, barbarian, Scythian, slave, or free; but Christ is all, and in all.",
      "links": "<a href='/AIV/48/3/28'>Gal. 3:28</a>; <a href='/AIV/49/2/14'>Eph. 2:14</a>",
      "comment": "Paul stresses the radical unity of believers in Christ, removing all social, ethnic, and cultural barriers. This unity is expressed not merely spiritually, but visibly in the life of the whole church as a universal communion."
    },
    {
      "pk": 58003012,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 12,
      "text": "Therefore, as God’s chosen ones, holy and dearly loved, clothe yourselves with compassion, kindness, humility, gentleness, and patience.",
      "links": "<a href='/AIV/45/12/10'>Rom. 12:10</a>; <a href='/AIV/49/4/2'>Eph. 4:2</a>",
      "comment": "Paul’s list of virtues echoes the fruit of the Spirit and describes what believers, as God's chosen people, should manifest. ‘Holy and dearly loved’ implies both a status and vocation to live faithfully, nurtured in the life of grace."
    },
    {
      "pk": 58003013,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 13,
      "text": "Bear with one another and, if anyone has a complaint against another, forgive each other; just as the Lord has forgiven you, so you must also forgive.",
      "links": "<a href='/AIV/40/6/14-15'>Matt. 6:14-15</a>; <a href='/AIV/49/4/32'>Eph. 4:32</a>",
      "comment": "Forgiveness is essential for Christian community. Paul links our call to forgive directly with Christ’s forgiveness, which was perfectly embodied in His sacrificial death. This also connects to the ongoing sacramental practice of reconciliation."
    },
    {
      "pk": 58003014,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 14,
      "text": "And above all these, put on love, which binds everything together in perfect unity.",
      "links": "<a href='/AIV/46/13/13'>1 Cor. 13:13</a>; <a href='/AIV/48/5/6'>Gal. 5:6</a>",
      "comment": "Love is described as the highest virtue, binding all other virtues. This unity in love is not only an interior reality but should be expressed actively in the communal life, showing the church as a visible sign of Christ’s presence."
    },
    {
      "pk": 58003015,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 15,
      "text": "Let the peace of Christ rule in your hearts, to which indeed you were called in one body; and be thankful.",
      "links": "<a href='/AIV/49/4/3'>Eph. 4:3</a>; <a href='/AIV/50/4/7'>Phil. 4:7</a>",
      "comment": "The 'one body' refers to the unified community of believers, held together in Christ’s peace. Thanksgiving is continually encouraged, highlighting the importance of a grateful response to God’s gifts, often expressed in communal worship."
    },
    {
      "pk": 58003016,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 16,
      "text": "Let the word of Christ dwell among you richly, teaching and admonishing one another in all wisdom, singing psalms and hymns and spiritual songs, with thankfulness in your hearts to God.",
      "links": "<a href='/AIV/49/5/19'>Eph. 5:19</a>; <a href='/AIV/19/95/1'>Ps. 95:1</a>",
      "comment": "Emphasizes the power of communal praise and instruction. The use of 'psalms, hymns, and spiritual songs' suggests a rich liturgical life and the importance of tradition in worship and teaching, deepening the community’s faith."
    },
    {
      "pk": 58003017,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 17,
      "text": "And whatever you do, in word or deed, do everything in the name of the Lord Jesus, giving thanks to God the Father through him.",
      "links": "<a href='/AIV/46/10/31'>1 Cor. 10:31</a>; <a href='/AIV/43/14/13'>John 14:13</a>",
      "comment": "All actions are to be done in union with Christ and in His authority, highlighting the mediatory role of Christ before the Father. Thanksgiving 'through him' subtly points to Christ's central role in every aspect of faith practice."
    },
    {
      "pk": 58003018,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 18,
      "text": "Wives, submit to your husbands, as is fitting in the Lord.",
      "links": "<a href='/AIV/49/5/22'>Eph. 5:22</a>; <a href='/AIV/60/3/1'>1 Pet. 3:1</a>",
      "comment": "Paul gives household instructions here; 'as is fitting in the Lord' shows that this submission is part of Christian discipleship, not servility, mirroring the self-giving love found in Christ."
    },
    {
      "pk": 58003019,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 19,
      "text": "Husbands, love your wives, and do not be harsh with them.",
      "links": "<a href='/AIV/49/5/25'>Eph. 5:25</a>",
      "comment": "The call for husbands to love with gentleness reflects Christ’s sacrificial love. Christian marriage is meant to be a sign of Christ’s love for His people, making it a transformative vocation of self-giving."
    },
    {
      "pk": 58003020,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 20,
      "text": "Children, obey your parents in everything, for this pleases the Lord.",
      "links": "<a href='/AIV/02/20/12'>Ex. 20:12</a>; <a href='/AIV/49/6/1'>Eph. 6:1</a>",
      "comment": "Honoring parents is part of God’s command (Ex. 20:12) and pleases Him. Family order reflects God’s design for society, ensuring growth in virtue and responsibility."
    },
    {
      "pk": 58003021,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 21,
      "text": "Fathers, do not provoke your children, so they do not become discouraged.",
      "links": "<a href='/AIV/49/6/4'>Eph. 6:4</a>",
      "comment": "Wise parental authority raises children to maturity in faith and virtue, avoiding discouragement. It emphasizes the pastoral responsibility of parents in forming children in the faith community."
    },
    {
      "pk": 58003022,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 22,
      "text": "Servants, obey in everything those who are your earthly masters, not only when they are watching, as people-pleasers, but with sincerity of heart, fearing the Lord.",
      "links": "<a href='/AIV/49/6/5'>Eph. 6:5</a>; <a href='/AIV/60/2/18'>1 Pet. 2:18</a>",
      "comment": "Work should be offered sincerely, as service to God himself. This teaching instills both dignity and spiritual value in all labor, a concept developed by the early teachers of the apostolic faith."
    },
    {
      "pk": 58003023,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 23,
      "text": "Whatever you do, work at it wholeheartedly, as for the Lord and not for men,",
      "links": "<a href='/AIV/49/6/7'>Eph. 6:7</a>",
      "comment": "Paul encourages believers to see all work as service to the Lord, imbuing everyday life with sacramental meaning—transforming ordinary work into worship."
    },
    {
      "pk": 58003024,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 24,
      "text": "Knowing that from the Lord you will receive the inheritance as your reward. You serve the Lord Christ.",
      "links": "<a href='/AIV/46/7/22'>1 Cor. 7:22</a>; <a href='/AIV/60/1/4'>1 Pet. 1:4</a>",
      "comment": "'Inheritance' points to the promise given to all believers—a heavenly reward. Serving Christ is central to all vocations; participation in His kingdom is the ultimate goal and purpose for every Christian."
    },
    {
      "pk": 58003025,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 3,
      "verse": 25,
      "text": "For the wrongdoer will be paid back for what he has done, and there is no partiality.",
      "links": "<a href='/AIV/49/6/8'>Eph. 6:8-9</a>; <a href='/AIV/60/1/17'>1 Pet. 1:17</a>",
      "comment": "Paul closes by affirming the impartial justice of God. Every action has consequences, highlighting God’s fairness and encouraging accountability and moral responsibility within the life of faith."
    }
  ],
  "translatedAt": "2025-12-24T12:07:12.063Z"
}