{
  "book": "Colossians",
  "bookAbbreviation": "Col",
  "chapter": 3,
  "verses": [
    {
      "pk": 3100301,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 1,
      "text": "So if you have been raised with Christ, seek the things that are above, where Christ is, seated at the right hand of God.",
      "links": "<a href='/AIV/49/2/6'>Eph. 2:6</a>; <a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/58/8/1'>Heb. 8:1</a>",
      "comment": "Paul urges believers to focus on heavenly realities, not earthly ones. The phrase 'seated at the right hand of God' is a fulfillment of Psalm 110:1 and underlines the exalted, divine status of Christ."
    },
    {
      "pk": 3100302,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 2,
      "text": "Set your minds on things above, not on things that are on earth.",
      "links": "<a href='/AIV/40/6/33'>Matt. 6:33</a>; <a href='/AIV/50/3/20'>Phil. 3:20</a>",
      "comment": "This calls for a continual orientation towards God's priorities, echoing Jesus' teaching about seeking first the kingdom."
    },
    {
      "pk": 3100303,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 3,
      "text": "For you died, and your life is hidden with Christ in God.",
      "links": "<a href='/AIV/45/6/2'>Rom. 6:2</a>; <a href='/AIV/62/5/13'>1 John 5:13</a>",
      "comment": "Believers participate in Christ’s death and resurrection. This 'hidden' life points to both a spiritual reality and a promise of future revelation."
    },
    {
      "pk": 3100304,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 4,
      "text": "When Christ, who is your life, appears, then you also will appear with him in glory.",
      "links": "<a href='/AIV/43/14/3'>John 14:3</a>; <a href='/AIV/50/3/21'>Phil. 3:21</a>",
      "comment": "Refers to the Second Coming when believers will be glorified with Christ. Connects to the future hope found throughout the New Testament."
    },
    {
      "pk": 3100305,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 5,
      "text": "Put to death, therefore, what is earthly in you: sexual immorality, impurity, passion, evil desire, and greed, which is idolatry.",
      "links": "<a href='/AIV/49/5/3'>Eph. 5:3</a>; <a href='/AIV/40/5/29'>Matt. 5:29</a>",
      "comment": "Paul calls believers to radical moral transformation, not just avoidance of sin but the mortification of sinful tendencies."
    },
    {
      "pk": 3100306,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 6,
      "text": "Because of these, the wrath of God is coming upon the sons of disobedience.",
      "links": "<a href='/AIV/49/5/6'>Eph. 5:6</a>; <a href='/AIV/45/1/18'>Rom. 1:18</a>",
      "comment": "Moral failure leads to divine judgment. The phrase echoes warnings throughout both Old and New Testaments."
    },
    {
      "pk": 3100307,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 7,
      "text": "In these you too once walked, when you were living in them.",
      "links": "<a href='/AIV/49/2/2-3'>Eph. 2:2–3</a>",
      "comment": "Reminds believers of their former life, now to be abandoned for the new life in Christ."
    },
    {
      "pk": 3100308,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 8,
      "text": "But now you must also put away all these: anger, wrath, malice, slander, and obscene talk from your mouth.",
      "links": "<a href='/AIV/49/4/31'>Eph. 4:31</a>",
      "comment": "True conversion leads to ethical speech and self-control, not just avoidance of outward immorality."
    },
    {
      "pk": 3100309,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 9,
      "text": "Do not lie to one another, since you have put off the old self with its practices",
      "links": "<a href='/AIV/49/4/25'>Eph. 4:25</a>",
      "comment": "Honesty is part of the transformation from the old nature to the new humanity in Christ."
    },
    {
      "pk": 3100310,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 10,
      "text": "and have put on the new self, which is being renewed in knowledge after the image of its Creator.",
      "links": "<a href='/AIV/47/3/18'>2 Cor. 3:18</a>; <a href='/AIV/01/1/27'>Gen. 1:27</a>",
      "comment": "This echoes creation: believers are being remade into God’s image through continual renewal, linking sanctification to both knowledge and the restoration of what was lost in the fall."
    },
    {
      "pk": 3100311,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 11,
      "text": "Here there is no Greek and Jew, circumcised and uncircumcised, barbarian, Scythian, slave, free; but Christ is all, and in all.",
      "links": "<a href='/AIV/48/3/28'>Gal. 3:28</a>; <a href='/AIV/49/2/14-16'>Eph. 2:14-16</a>",
      "comment": "Paul affirms the essential unity of the Church in Christ, who transcends all social and ethnic divisions—a foretaste of the unity of all believers."
    },
    {
      "pk": 3100312,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 12,
      "text": "Therefore, as God’s chosen, holy and beloved, clothe yourselves with compassion, kindness, humility, gentleness, and patience.",
      "links": "<a href='/AIV/65/1/1'>Jude 1:1</a>; <a href='/AIV/49/4/2'>Eph. 4:2</a>",
      "comment": "Calls the Church 'chosen, holy, and beloved,' echoing language used for Israel but now applied to the community of believers. These virtues form the foundation for authentic Christian living."
    },
    {
      "pk": 3100313,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 13,
      "text": "Bear with one another and, if anyone has a complaint against another, forgive each other; as the Lord has forgiven you, so you also must forgive.",
      "links": "<a href='/AIV/40/6/14-15'>Matt. 6:14-15</a>; <a href='/AIV/49/4/32'>Eph. 4:32</a>",
      "comment": "Forgiveness, given and received, reflects the Gospel’s heart. The Lord’s forgiveness is both model and motivation."
    },
    {
      "pk": 3100314,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 14,
      "text": "And above all these, put on love, which binds everything together in perfect unity.",
      "links": "<a href='/AIV/46/13/1-13'>1 Cor. 13:1-13</a>; <a href='/AIV/45/13/10'>Rom. 13:10</a>",
      "comment": "Love is supreme and unifying; it is the greatest virtue and the true mark of the mature Christian community."
    },
    {
      "pk": 3100315,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 15,
      "text": "Let the peace of Christ rule in your hearts, to which you were also called in one body. And be thankful.",
      "links": "<a href='/AIV/49/4/3'>Eph. 4:3</a>; <a href='/AIV/43/14/27'>John 14:27</a>",
      "comment": "Christ’s peace is to rule within the community—the 'one body' refers to the gathered Church, living out gratitude and unity."
    },
    {
      "pk": 3100316,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 16,
      "text": "Let the word of Christ dwell in you richly, teaching and admonishing one another with all wisdom, singing psalms, hymns, and spiritual songs, with thankfulness in your hearts to God.",
      "links": "<a href='/AIV/49/5/19'>Eph. 5:19</a>; <a href='/AIV/19/119/11'>Ps. 119:11</a>",
      "comment": "Corporate worship, Scripture, and teaching all serve to fill the Church with God's presence. The practice of singing and teaching was already part of early Christian life."
    },
    {
      "pk": 3100317,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 17,
      "text": "And whatever you do, in word or deed, do everything in the name of the Lord Jesus, giving thanks to God the Father through him.",
      "links": "<a href='/AIV/46/10/31'>1 Cor. 10:31</a>; <a href='/AIV/43/15/16'>John 15:16</a>",
      "comment": "'In the name of the Lord Jesus' signifies doing all with Christ's authority and for his glory. Thanksgiving is the constant posture."
    },
    {
      "pk": 3100318,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 18,
      "text": "Wives, submit to your husbands, as is fitting in the Lord.",
      "links": "<a href='/AIV/49/5/22'>Eph. 5:22</a>; <a href='/AIV/60/3/1'>1 Pet. 3:1</a>",
      "comment": "Household codes are rooted in reciprocal love and respect, with the wife's submission described as 'in the Lord'—implying Christ-centeredness, not servility."
    },
    {
      "pk": 3100319,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 19,
      "text": "Husbands, love your wives and do not be harsh with them.",
      "links": "<a href='/AIV/49/5/25'>Eph. 5:25</a>",
      "comment": "Husbands' duty is not authority but sacrificial love, as Christ loves the Church."
    },
    {
      "pk": 3100320,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 20,
      "text": "Children, obey your parents in everything, for this pleases the Lord.",
      "links": "<a href='/AIV/02/20/12'>Ex. 20:12</a>; <a href='/AIV/49/6/1'>Eph. 6:1</a>",
      "comment": "Obedience honors God and echoes the commandment to honor one’s parents."
    },
    {
      "pk": 3100321,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 21,
      "text": "Fathers, do not provoke your children, so they will not become discouraged.",
      "links": "<a href='/AIV/49/6/4'>Eph. 6:4</a>",
      "comment": "Parental authority is meant to nurture, not crush, the spirit of children."
    },
    {
      "pk": 3100322,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 22,
      "text": "Slaves, obey your earthly masters in everything, not just when being watched, as people-pleasers, but with sincerity of heart, fearing the Lord.",
      "links": "<a href='/AIV/49/6/5-8'>Eph. 6:5-8</a>; <a href='/AIV/60/2/18'>1 Pet. 2:18</a>",
      "comment": "Even under social structures like slavery, believers are to serve wholeheartedly as service to Christ."
    },
    {
      "pk": 3100323,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 23,
      "text": "Whatever you do, work at it wholeheartedly, as for the Lord and not for people,",
      "links": "<a href='/AIV/46/15/58'>1 Cor. 15:58</a>",
      "comment": "Christian work ethic flows from knowing one is ultimately serving Christ."
    },
    {
      "pk": 3100324,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 24,
      "text": "knowing that from the Lord you will receive the inheritance as your reward. You are serving the Lord Christ.",
      "links": "<a href='/AIV/40/25/34'>Matt. 25:34</a>; <a href='/AIV/60/1/4'>1 Pet. 1:4</a>",
      "comment": "Believers are promised an eternal inheritance—an encouragement to endure earthly hardship, as our true master is Christ."
    },
    {
      "pk": 3100325,
      "translation": "AIV",
      "book": 51,
      "chapter": 3,
      "verse": 25,
      "text": "For the one who does wrong will be paid back for what he has done, and there is no partiality.",
      "links": "<a href='/AIV/45/2/11'>Rom. 2:11</a>; <a href='/AIV/40/16/27'>Matt. 16:27</a>",
      "comment": "God judges impartially—all are accountable. Justice will be administered perfectly by Christ."
    }
  ],
  "translatedAt": "2025-12-23T03:58:39.920Z"
}