{
  "book": 58,
  "bookName": "Colossians",
  "bookAbbreviation": "Col",
  "chapter": 1,
  "verses": [
    {
      "pk": 58001001,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 1,
      "text": "Paul, an apostle of Christ Jesus by the will of God, and Timothy our brother,",
      "links": "<a href='/AIV/46/1/1'>1 Cor. 1:1</a>; <a href='/AIV/47/1/1'>2 Cor. 1:1</a>; <a href='/AIV/50/1/1'>Phil. 1:1</a>",
      "comment": "Paul begins this epistle affirming his apostleship by God’s will, indicating authority and divine appointment. Timothy is mentioned as a co-worker, emphasizing the communal aspect of ministry."
    },
    {
      "pk": 58001002,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 2,
      "text": "to the holy ones and faithful brothers in Christ at Colossae: Grace to you and peace from God our Father.",
      "links": "<a href='/AIV/45/1/7'>Rom. 1:7</a>; <a href='/AIV/49/1/2'>Eph. 1:2</a>",
      "comment": "The term 'holy ones' refers to believers set apart in Christ. Paul’s greeting invokes grace and peace, linking the community’s unity to the Father’s continual blessing—a theme central in apostolic tradition."
    },
    {
      "pk": 58001003,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 3,
      "text": "We always thank God, the Father of our Lord Jesus Christ, when we pray for you,",
      "links": "<a href='/AIV/49/1/16'>Eph. 1:16</a>; <a href='/AIV/50/1/3'>Phil. 1:3</a>",
      "comment": "Paul’s prayerful thanksgiving models intercession for the community. The specific address to the Father and Jesus points to the distinct persons of the Trinity, underlining Christ’s divine sonship."
    },
    {
      "pk": 58001004,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 4,
      "text": "since we heard of your faith in Christ Jesus and the love you have for all the holy ones,",
      "links": "<a href='/AIV/49/1/15'>Eph. 1:15</a>; <a href='/AIV/62/4/21'>1 John 4:21</a>",
      "comment": "Faith and love are presented as inseparable marks of authentic Christians. The love for all suggests an interconnectedness, reminiscent of the unity of the Body of Christ and the importance of mutual charity."
    },
    {
      "pk": 58001005,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 5,
      "text": "because of the hope that is stored up for you in heaven, of which you heard before through the message of truth, the gospel,",
      "links": "<a href='/AIV/60/1/4'>1 Pet. 1:4</a>; <a href='/AIV/45/10/17'>Rom. 10:17</a>",
      "comment": "Paul connects hope, faith, and love, echoing 1 Cor. 13:13. The concept of heavenly hope points to the eternal destiny promised in the gospel, transmitted through apostolic preaching."
    },
    {
      "pk": 58001006,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 6,
      "text": "which has come to you, just as in the whole world it is bearing fruit and increasing, among you, since the day you heard it and understood the grace of God in truth.",
      "links": "<a href='/AIV/40/13/23'>Matt. 13:23</a>; <a href='/AIV/45/16/26'>Rom. 16:26</a>",
      "comment": "Paul illustrates the universal spread and fruitfulness of the gospel, emphasizing both its global mission and its transformative power within the community as evidence of genuine grace."
    },
    {
      "pk": 58001007,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 7,
      "text": "You learned it from Epaphras, our beloved fellow servant. He is a faithful minister of Christ on your behalf,",
      "links": "<a href='/AIV/51/1/7'>Phil. 2:25</a>; <a href='/AIV/58/4/12'>Col. 4:12</a>",
      "comment": "Epaphras is singled out as a trustworthy servant, a minister entrusted with apostolic teaching. This reveals the role of ordained ministers faithfully transmitting the gospel and fostering unity."
    },
    {
      "pk": 58001008,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 8,
      "text": "and he has made known to us your love in the Spirit.",
      "links": "<a href='/AIV/45/5/5'>Rom. 5:5</a>; <a href='/AIV/48/5/22'>Gal. 5:22</a>",
      "comment": "The mention of 'love in the Spirit' underscores the supernatural source of Christian charity, a fruit and gift of the Holy Spirit binding believers together in unity."
    },
    {
      "pk": 58001009,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 9,
      "text": "For this reason also, since the day we heard, we have not stopped praying for you, asking that you may be filled with the knowledge of His will in all wisdom and spiritual understanding,",
      "links": "<a href='/AIV/49/1/17'>Eph. 1:17</a>; <a href='/AIV/20/2/6'>Prov. 2:6</a>",
      "comment": "Paul petitions for divine wisdom and understanding—gifts that go beyond mere human knowledge. This passage highlights the need for continual prayer and spiritual growth in the Christian life."
    },
    {
      "pk": 58001010,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 10,
      "text": "so that you may walk in a manner worthy of the Lord, pleasing Him in every way, bearing fruit in every good work and growing in the knowledge of God;",
      "links": "<a href='/AIV/40/5/16'>Matt. 5:16</a>; <a href='/AIV/46/15/58'>1 Cor. 15:58</a>",
      "comment": "Christian conduct is not static; believers are to bear fruit and mature in God’s knowledge. The phrase 'worthy of the Lord' suggests sanctity, obedience, and visible transformation in life."
    },
    {
      "pk": 58001011,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 11,
      "text": "being strengthened with all power, according to His glorious might, for all endurance and patience with joy;",
      "links": "<a href='/AIV/49/3/16'>Eph. 3:16</a>; <a href='/AIV/58/1/29'>Col. 1:29</a>",
      "comment": "God’s power enables endurance and joy amid trials. This alludes to grace as an actual divine influence, not merely forgiveness. Spiritual strength is vital for perseverance in faith."
    },
    {
      "pk": 58001012,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 12,
      "text": "giving thanks to the Father, who has made you fit to share in the inheritance of the holy ones in light.",
      "links": "<a href='/AIV/44/26/18'>Acts 26:18</a>; <a href='/AIV/19/16/6'>Ps. 16:6</a>",
      "comment": "Paul speaks of a divine inheritance in the light, echoing Old Testament motifs and the promise of the saints’ communion. Sharing this inheritance recalls a visible unity among God’s people."
    },
    {
      "pk": 58001013,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 13,
      "text": "He has delivered us from the domain of darkness and transferred us into the kingdom of the Son whom He loves,",
      "links": "<a href='/AIV/40/4/16'>Matt. 4:16</a>; <a href='/AIV/62/3/14'>1 John 3:14</a>",
      "comment": "God’s decisive act rescues believers from darkness, relocating them to Christ’s kingdom. The passage implies an actual movement and participation in Christ’s rule, not just a metaphorical change."
    },
    {
      "pk": 58001014,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 14,
      "text": "in whom we have redemption, the forgiveness of sins.",
      "links": "<a href='/AIV/49/1/7'>Eph. 1:7</a>; <a href='/AIV/40/26/28'>Matt. 26:28</a>",
      "comment": "Redemption in Christ includes the actual forgiveness of sins. The reality of redemption ties directly to Christ himself, prefigured in Old Testament sacrifices now fulfilled in the new covenant."
    },
    {
      "pk": 58001015,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 15,
      "text": "He is the image of the invisible God, the firstborn of all creation;",
      "links": "<a href='/AIV/43/1/18'>John 1:18</a>; <a href='/AIV/19/89/27'>Ps. 89:27</a>; <a href='/AIV/58/3/10'>Col. 3:10</a>",
      "comment": "Christ as 'image of God' proclaims his divinity (cf. Heb. 1:3). 'Firstborn' here refers to Christ’s unique status and authority over creation, not his coming into existence, aligning with the eternal generation of the Son."
    },
    {
      "pk": 58001016,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 16,
      "text": "For by Him all things were created, things in heaven and on earth, visible and invisible, whether thrones or dominions or rulers or authorities; all things were created through Him and for Him.",
      "links": "<a href='/AIV/43/1/3'>John 1:3</a>; <a href='/AIV/20/8/27'>Prov. 8:27</a>; <a href='/AIV/58/2/10'>Col. 2:10</a>",
      "comment": "All created things owe their existence to Christ, establishing his supremacy. The mention of spiritual powers highlights his total dominion. This is a foundational high christology."
    },
    {
      "pk": 58001017,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 17,
      "text": "He is before all things, and in Him all things hold together.",
      "links": "<a href='/AIV/43/8/58'>John 8:58</a>; <a href='/AIV/58/3/11'>Col. 3:11</a>",
      "comment": "Eternal preexistence and sustaining power are ascribed to Christ. He is not only at creation but continually upholds the universe, reinforcing his divine attribute."
    },
    {
      "pk": 58001018,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 18,
      "text": "He is the head of the body, the church. He is the beginning, the firstborn from the dead, so that in all things He might be preeminent.",
      "links": "<a href='/AIV/46/12/27'>1 Cor. 12:27</a>; <a href='/AIV/66/1/5'>Rev. 1:5</a>",
      "comment": "Christ’s leadership of the church is singular. 'Firstborn from the dead' points to his resurrection, granting him unique authority. The church as his body implies visible unity under one head."
    },
    {
      "pk": 58001019,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 19,
      "text": "For in Him all the fullness was pleased to dwell,",
      "links": "<a href='/AIV/62/1/1'>1 John 1:1</a>; <a href='/AIV/43/1/14'>John 1:14</a>; <a href='/AIV/58/2/9'>Col. 2:9</a>",
      "comment": "'Fullness' refers to God’s complete presence in Christ, a key claim to his divinity and the mystery of the incarnation."
    },
    {
      "pk": 58001020,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 20,
      "text": "and through Him to reconcile all things to Himself, having made peace by the blood of His cross—through Him, whether things on earth or things in heaven.",
      "links": "<a href='/AIV/45/5/10'>Rom. 5:10</a>; <a href='/AIV/49/2/14-16'>Eph. 2:14-16</a>",
      "comment": "The cross restores both earthly and heavenly realities, reconciling creation to God. The phrase 'blood of His cross' points to the necessity and efficacy of a real, sacrificial act for atonement."
    },
    {
      "pk": 58001021,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 21,
      "text": "And you, who once were alienated and hostile in mind, doing evil deeds,",
      "links": "<a href='/AIV/45/5/8'>Rom. 5:8</a>; <a href='/AIV/49/2/12'>Eph. 2:12</a>",
      "comment": "Paul reminds them of their former estrangement, emphasizing the transformation possible through Christ—a radical change from alienation to union with God."
    },
    {
      "pk": 58001022,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 22,
      "text": "He has now reconciled in His body of flesh through death, to present you holy and blameless and above reproach before Him,",
      "links": "<a href='/AIV/49/2/13-16'>Eph. 2:13-16</a>; <a href='/AIV/58/1/28'>Col. 1:28</a>",
      "comment": "'Body of flesh' stresses the reality of Christ’s humanity in the work of redemption, a key claim against spiritualizing Christ’s death. The aim is to be sanctified and blameless in God’s presence."
    },
    {
      "pk": 58001023,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 23,
      "text": "if indeed you continue in the faith, rooted and steadfast, not shifting from the hope of the gospel which you heard, which has been proclaimed to every creature under heaven, of which I, Paul, became a minister.",
      "links": "<a href='/AIV/45/1/5'>Rom. 1:5</a>; <a href='/AIV/49/3/7'>Eph. 3:7</a>",
      "comment": "Endurance in the faith is required; apostolic succession is hinted by Paul’s 'minister' role. The expansiveness of the gospel’s proclamation highlights its universality."
    },
    {
      "pk": 58001024,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 24,
      "text": "Now I rejoice in my sufferings for your sake, and in my flesh I fill up what is lacking in the afflictions of Christ for the sake of His body, which is the church.",
      "links": "<a href='/AIV/47/1/5'>2 Cor. 1:5</a>; <a href='/AIV/45/8/17'>Rom. 8:17</a>",
      "comment": "Paul’s sufferings have a participatory redemptive value, linked to Christ’s own afflictions. This verse points to the mystery of suffering and its power to build up the church, revealing a deeper spiritual communion."
    },
    {
      "pk": 58001025,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 25,
      "text": "Of this church I became a servant according to the stewardship from God given to me for you, to fulfill the word of God,",
      "links": "<a href='/AIV/46/4/1'>1 Cor. 4:1</a>; <a href='/AIV/49/3/2'>Eph. 3:2</a>",
      "comment": "Paul’s divinely-entrusted stewardship stresses the importance of apostolic office and ongoing authority in transmitting scripture and doctrine."
    },
    {
      "pk": 58001026,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 26,
      "text": "the mystery hidden for ages and generations, but now revealed to His holy ones.",
      "links": "<a href='/AIV/27/12/9'>Dan. 12:9</a>; <a href='/AIV/45/16/25'>Rom. 16:25</a>",
      "comment": "'Mystery' refers to the fullness of salvation now manifested, connecting the Old Testament prophetic anticipation to the New Testament fulfillment among the saints."
    },
    {
      "pk": 58001027,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 27,
      "text": "To them God chose to make known how great among the nations are the riches of the glory of this mystery, which is Christ in you, the hope of glory.",
      "links": "<a href='/AIV/45/8/10'>Rom. 8:10</a>; <a href='/AIV/62/3/24'>1 John 3:24</a>",
      "comment": "God’s mystery is universal, transcending ethnic boundaries. The indwelling of Christ foreshadows not only personal salvation, but also his real presence within the communion of believers."
    },
    {
      "pk": 58001028,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 28,
      "text": "Him we proclaim, warning everyone and teaching everyone in all wisdom, so that we may present everyone mature in Christ.",
      "links": "<a href='/AIV/45/15/14'>Rom. 15:14</a>; <a href='/AIV/58/4/12'>Col. 4:12</a>",
      "comment": "Teaching and admonition are not merely for initial conversion but for ongoing growth. The goal is maturity and fullness in Christ, indicating both individual and communal sanctification."
    },
    {
      "pk": 58001029,
      "translation": "AIV",
      "book": 58,
      "bookName": "Colossians",
      "bookAbbreviation": "Col",
      "chapter": 1,
      "verse": 29,
      "text": "For this I labor, striving with all His energy that powerfully works within me.",
      "links": "<a href='/AIV/49/3/20'>Eph. 3:20</a>; <a href='/AIV/50/2/13'>Phil. 2:13</a>",
      "comment": "Paul attributes his efforts to divine energy, not merely human strength. This reflects reliance on grace—a supernatural participation in Christ’s mission that is continued in the ongoing work of the church."
    }
  ],
  "translatedAt": "2025-12-24T12:06:24.094Z"
}