{
  "book": "James",
  "bookAbbreviation": "Jas",
  "chapter": 4,
  "verses": [
    {
      "pk": 4110401,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 1,
      "text": "Where do wars and fights among you come from? Do they not come from your passions that are at war within you?",
      "links": "<a href='/AIV/45/7/23'>Rom. 7:23</a>; <a href='/AIV/48/5/17'>Gal. 5:17</a>",
      "comment": "James points out that outward conflicts stem from inward desires. The idea of internal passions leading to strife echoes Paul's teaching in Romans and Galatians about the flesh warring against the spirit."
    },
    {
      "pk": 4110402,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 2,
      "text": "You desire and do not have, so you murder. You covet and cannot obtain, so you fight and wage war. You do not have because you do not ask.",
      "links": "<a href='/AIV/19/10/3'>Ps. 10:3</a>; <a href='/AIV/40/7/7'>Matt. 7:7</a>",
      "comment": "A parallel between unchecked desires and sinful actions. Notice the spiritual problem addressed is both internal (desiring) and the failure to seek God in prayer—emphasizing the necessity of direct supplication to God."
    },
    {
      "pk": 4110403,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 3,
      "text": "You ask and do not receive, because you ask with wrong motives, that you may spend it on your pleasures.",
      "links": "<a href='/AIV/19/66/18'>Ps. 66:18</a>; <a href='/AIV/43/16/24'>John 16:24</a>",
      "comment": "Prayer must be oriented toward God's will, not selfish gain. James emphasizes interior conversion and purity of heart—a common biblical theme about aligning one's desires with God's purpose (see also John 14:13-14)."
    },
    {
      "pk": 4110404,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 4,
      "text": "You adulterers! Do you not know that friendship with the world is hostility toward God? Therefore whoever chooses to be a friend of the world becomes an enemy of God.",
      "links": "<a href='/AIV/40/6/24'>Matt. 6:24</a>; <a href='/AIV/62/2/15'>1 John 2:15</a>",
      "comment": "James uses the word adulterers symbolically, echoing the prophetic tradition (see Hosea) where unfaithfulness to God is spiritual adultery. True faith requires exclusive loyalty; divided hearts are unacceptable. Compare Jesus’ teaching in Matthew 6:24 about serving two masters."
    },
    {
      "pk": 4110405,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 5,
      "text": "Or do you suppose it is for nothing that the Scripture says: ‘He yearns jealously for the Spirit that he has made to dwell in us’?",
      "links": "<a href='/AIV/2/20/5'>Exod. 20:5</a>; <a href='/AIV/26/36/27'>Ezek. 36:27</a>",
      "comment": "This expresses that God deeply desires a faithful people. The Spirit given to believers is meant for wholehearted devotion. Some manuscripts and traditions have varied renderings, but the idea aligns with God’s covenant jealousy found throughout Scripture."
    },
    {
      "pk": 4110406,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 6,
      "text": "But he gives more grace. Therefore it says, ‘God opposes the proud but gives grace to the humble.’",
      "links": "<a href='/AIV/20/3/34'>Prov. 3:34</a>; <a href='/AIV/60/5/5'>1 Pet. 5:5</a>",
      "comment": "Humility is stressed as the avenue for receiving God’s grace. James uses Proverbs to make this point, a truth acknowledged by both Old and New Testament writers."
    },
    {
      "pk": 4110407,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 7,
      "text": "Submit yourselves, therefore, to God. Resist the devil, and he will flee from you.",
      "links": "<a href='/AIV/60/5/9'>1 Pet. 5:9</a>; <a href='/AIV/40/4/10-11'>Matt. 4:10-11</a>",
      "comment": "The call to submit flows from reliance on God’s grace. Spiritual warfare requires both humility before God and active resistance to the devil—a cooperative aspect of the Christian life, empowered by God."
    },
    {
      "pk": 4110408,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 8,
      "text": "Draw near to God, and he will draw near to you. Cleanse your hands, you sinners, and purify your hearts, you double-minded.",
      "links": "<a href='/AIV/19/24/3-4'>Ps. 24:3-4</a>; <a href='/AIV/23/1/16'>Isa. 1:16</a>",
      "comment": "This verse invites repentance and interior purification, evoking Old Testament temple imagery (see Psalm 24). There’s an active responsibility for believers to seek purity in both actions and intentions."
    },
    {
      "pk": 4110409,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 9,
      "text": "Grieve, mourn, and weep. Let your laughter be turned to mourning and your joy to gloom.",
      "links": "<a href='/AIV/40/5/4'>Matt. 5:4</a>; <a href='/AIV/32/3/5-8'>Jonah 3:5-8</a>",
      "comment": "True repentance is marked by sorrow for sin. James’s language is intentionally severe, calling for heartfelt contrition like that found in Jesus’ beatitudes and Israel’s prophets, who emphasize the need for genuine penitence."
    },
    {
      "pk": 4110410,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 10,
      "text": "Humble yourselves before the Lord, and he will lift you up.",
      "links": "<a href='/AIV/62/1/9'>1 John 1:9</a>; <a href='/AIV/42/18/14'>Luke 18:14</a>",
      "comment": "God exalts those who humble themselves, a continuation of the theme from verse 6. Note how humility before God is paired with his promise to raise up the lowly, a key theme in both Testaments."
    },
    {
      "pk": 4110411,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 11,
      "text": "Do not speak evil against one another, brothers and sisters. The one who speaks against a fellow believer or judges his brother speaks against the law and judges the law. But if you judge the law, you are not a doer of the law but a judge.",
      "links": "<a href='/AIV/40/7/1'>Matt. 7:1</a>; <a href='/AIV/3/19/16'>Lev. 19:16-17</a>",
      "comment": "Speaking against others usurps God’s role as judge. Mutual charity and correction is stressed, but without uncharitable judgment, reflecting Jesus’ own teaching in the Gospels."
    },
    {
      "pk": 4110412,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 12,
      "text": "There is only one Lawgiver and Judge, the one who is able to save and destroy. But who are you to judge your neighbor?",
      "links": "<a href='/AIV/23/33/22'>Isa. 33:22</a>; <a href='/AIV/40/10/28'>Matt. 10:28</a>",
      "comment": "James asserts God's sole authority to judge, reinforcing the theme of humility and charity. The reference to saving and destroying reflects God’s ultimate power over both life and salvation."
    },
    {
      "pk": 4110413,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 13,
      "text": "Come now, you who say, 'Today or tomorrow we will go into such and such a town and spend a year there and trade and make a profit,'",
      "links": "<a href='/AIV/20/27/1'>Prov. 27:1</a>; <a href='/AIV/42/12/18-20'>Luke 12:18-20</a>",
      "comment": "James warns against presumption and self-sufficiency, reflecting Jesus' teaching about the uncertainty of life (see Luke 12:20). The wise acknowledge their dependence on God."
    },
    {
      "pk": 4110414,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 14,
      "text": "Yet you do not know what tomorrow will bring. What is your life? For you are a vapor that appears for a little time and then vanishes.",
      "links": "<a href='/AIV/19/39/5'>Ps. 39:5</a>; <a href='/AIV/18/14/2'>Job 14:2</a>",
      "comment": "This fleeting nature of life humbles human pride and plans. Humanity's dependence on God is a constant biblical theme, as seen in Psalms and Job."
    },
    {
      "pk": 4110415,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 15,
      "text": "Instead you ought to say, 'If the Lord wills, we will live and do this or that.'",
      "links": "<a href='/AIV/44/18/21'>Acts 18:21</a>; <a href='/AIV/19/37/5'>Ps. 37:5</a>",
      "comment": "Consistent dependence upon the Lord’s will is encouraged. Early Christians often used this phrase as an everyday reminder of God’s sovereignty."
    },
    {
      "pk": 4110416,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 16,
      "text": "But as it is, you boast in your arrogance. All such boasting is evil.",
      "links": "<a href='/AIV/24/9/23'>Jer. 9:23</a>; <a href='/AIV/46/1/29-31'>1 Cor. 1:29-31</a>",
      "comment": "Boasting in one's plans without reference to God is condemned as evil. True wisdom recognizes the futility of pride and trusts in the Lord alone."
    },
    {
      "pk": 4110417,
      "translation": "AIV",
      "book": 59,
      "chapter": 4,
      "verse": 17,
      "text": "So then, whoever knows the right thing to do and does not do it, to him it is sin.",
      "links": "<a href='/AIV/45/14/23'>Rom. 14:23</a>; <a href='/AIV/40/23/23'>Matt. 23:23</a>",
      "comment": "James closes the chapter with an emphasis on responsible knowledge and action—a ‘sin of omission.’ The call to do what is right involves both private morality and obedience to all Christ taught."
    }
  ],
  "translatedAt": "2025-12-23T04:13:30.570Z"
}