{
  "book": "James",
  "bookAbbreviation": "Jas",
  "chapter": 2,
  "verses": [
    {
      "pk": 2143201,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 1,
      "text": "My brothers, as you hold to the faith of our Lord Jesus Christ, the Lord of glory, do not show favoritism.",
      "links": "<a href='/AIV/49/6/9'>Eph. 6:9</a>; <a href='/AIV/40/22/16'>Matt. 22:16</a>",
      "comment": "James begins with a charge to treat all believers equally, highlighting the unity of the church under Christ. 'Lord of glory' affirms Jesus' divinity."
    },
    {
      "pk": 2143202,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 2,
      "text": "For if a man enters your assembly wearing gold rings and fine clothes, and a poor man in shabby clothing also comes in,",
      "links": "<a href='/AIV/42/16/19'>Luke 16:19</a>",
      "comment": "The contrast of wealth and poverty is a frequent biblical theme; James calls out the temptation to honor the rich over the poor."
    },
    {
      "pk": 2143203,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 3,
      "text": "and you pay attention to the one in fine clothing and say, 'Sit here in this good place,' while you say to the poor man, 'Stand there,' or, 'Sit at my feet,'",
      "links": "<a href='/AIV/20/14/31'>Prov. 14:31</a>",
      "comment": "James condemns partiality, reminding that God honors the humble and lowly (see Proverbs)."
    },
    {
      "pk": 2143204,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 4,
      "text": "have you not made distinctions among yourselves and become judges with evil motives?",
      "links": "<a href='/AIV/40/7/1'>Matt. 7:1</a>",
      "comment": "James denounces unjust judgment within the assembly, tying inner attitudes to external actions."
    },
    {
      "pk": 2143205,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 5,
      "text": "Listen, my beloved brothers: Has not God chosen the poor in the world to be rich in faith and heirs of the kingdom he promised to those who love him?",
      "links": "<a href='/AIV/40/5/3'>Matt. 5:3</a>; <a href='/AIV/1/15/6'>Gen. 15:6</a>",
      "comment": "Echoing the Beatitudes, James reminds that faith and love, not status, make us heirs of God's promise."
    },
    {
      "pk": 2143206,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 6,
      "text": "But you have dishonored the poor. Are not the rich the ones who oppress you, and drag you into court?",
      "links": "<a href='/AIV/35/2/9'>Hab. 2:9</a>",
      "comment": "James criticizes alliances with the powerful at the expense of the needy, a common prophetic theme."
    },
    {
      "pk": 2143207,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 7,
      "text": "Are they not the ones who blaspheme the honorable name by which you are called?",
      "links": "<a href='/AIV/44/11/26'>Acts 11:26</a>",
      "comment": "'Name by which you are called' points to the Christian identity marked by Jesus—worthy of respect and reverence."
    },
    {
      "pk": 2143208,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 8,
      "text": "If you really fulfill the royal law according to the Scripture, 'You shall love your neighbor as yourself,' you are doing well.",
      "links": "<a href='/AIV/3/19/18'>Lev. 19:18</a>; <a href='/AIV/40/22/39'>Matt. 22:39</a>",
      "comment": "'Royal law' is a reference to the primacy of love, as Jesus taught, echoing Leviticus and affirmed in the Gospels."
    },
    {
      "pk": 2143209,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 9,
      "text": "But if you show partiality, you commit sin and are convicted by the law as transgressors.",
      "links": "<a href='/AIV/2/23/9'>Ex. 23:9</a>",
      "comment": "Impartiality is tied to the core of biblical justice; showing favoritism violates God's law."
    },
    {
      "pk": 2143210,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 10,
      "text": "For whoever keeps the whole law but fails in one point is guilty of breaking all of it.",
      "links": "<a href='/AIV/5/27/26'>Deut. 27:26</a>; <a href='/AIV/48/3/10'>Gal. 3:10</a>",
      "comment": "James stresses the unity of the law; even the smallest infraction breaks fellowship with God."
    },
    {
      "pk": 2143211,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 11,
      "text": "For he who said, 'Do not commit adultery,' also said, 'Do not murder.' If you do not commit adultery but do murder, you have become a transgressor of the law.",
      "links": "<a href='/AIV/2/20/13-14'>Ex. 20:13–14</a>",
      "comment": "Direct citation of the Ten Commandments builds on the previous point—God's law is indivisible."
    },
    {
      "pk": 2143212,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 12,
      "text": "So speak and act as those who are to be judged by the law of liberty.",
      "links": "<a href='/AIV/59/1/25'>James 1:25</a>",
      "comment": "'Law of liberty' echoes earlier in James and points to the gospel's freeing power when united with good works."
    },
    {
      "pk": 2143213,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 13,
      "text": "For judgment without mercy will be shown to anyone who has not shown mercy. Mercy triumphs over judgment.",
      "links": "<a href='/AIV/40/5/7'>Matt. 5:7</a>",
      "comment": "Connecting Jesus' teaching, James emphasizes mercy as a defining mark of the Christian life."
    },
    {
      "pk": 2143214,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 14,
      "text": "What good is it, my brothers, if someone says he has faith but does not have works? Can such faith save him?",
      "links": "<a href='/AIV/40/7/21'>Matt. 7:21</a>; <a href='/AIV/46/13/2'>1 Cor. 13:2</a>",
      "comment": "James challenges a merely intellectual faith, arguing true faith must produce tangible fruit."
    },
    {
      "pk": 2143215,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 15,
      "text": "If a brother or sister is poorly clothed and lacks daily food,",
      "links": "<a href='/AIV/40/25/35'>Matt. 25:35</a>",
      "comment": "James gives a practical example; aid for the needy is an essential Christian duty."
    },
    {
      "pk": 2143216,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 16,
      "text": "and one of you says to them, 'Go in peace; be warmed and filled,' without giving them what is needed for the body, what good is that?",
      "links": "<a href='/AIV/62/3/17'>1 John 3:17</a>",
      "comment": "Similar to John's teaching, James scorns empty words without compassionate action."
    },
    {
      "pk": 2143217,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 17,
      "text": "So also faith by itself, if it does not have works, is dead.",
      "links": "<a href='/AIV/40/7/17-20'>Matt. 7:17–20</a>; <a href='/AIV/62/2/6'>1 John 2:6</a>",
      "comment": "James introduces perhaps his most famous teaching: living faith is evidenced by charity and action."
    },
    {
      "pk": 2143218,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 18,
      "text": "But someone will say, 'You have faith and I have works.' Show me your faith apart from your works, and I will show you my faith by my works.",
      "links": "<a href='/AIV/40/5/16'>Matt. 5:16</a>",
      "comment": "The intimate relationship between inner belief and outward life is central in James' teaching."
    },
    {
      "pk": 2143219,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 19,
      "text": "You believe that God is one; you do well. Even demons believe—and shudder!",
      "links": "<a href='/AIV/5/6/4'>Deut. 6:4</a>; <a href='/AIV/41/1/24'>Mark 1:24</a>",
      "comment": "James references the Shema, but warns that mere assent is insufficient; life must align with faith."
    },
    {
      "pk": 2143220,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 20,
      "text": "Do you want to be shown, you foolish person, that faith apart from works is useless?",
      "links": "<a href='/AIV/20/13/4'>Prov. 13:4</a>",
      "comment": "James underscores the necessity of a living faith, addressing complacency and self-deception."
    },
    {
      "pk": 2143221,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 21,
      "text": "Was not Abraham our father justified by works when he offered up his son Isaac on the altar?",
      "links": "<a href='/AIV/1/22/9'>Gen. 22:9</a>; <a href='/AIV/45/4/2'>Rom. 4:2</a>",
      "comment": "James refers to Genesis, showing that Abraham's faith was made complete by his obedient action. Both faith and works are united in justification."
    },
    {
      "pk": 2143222,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 22,
      "text": "Do you see that faith was active together with his works, and by works faith was made complete?",
      "links": "<a href='/AIV/58/11/17'>Heb. 11:17</a>",
      "comment": "This underscores that true faith expresses itself in works—a sacramental union of belief and deed."
    },
    {
      "pk": 2143223,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 23,
      "text": "And the Scripture was fulfilled that says, 'Abraham believed God, and it was counted to him as righteousness'—and he was called a friend of God.",
      "links": "<a href='/AIV/1/15/6'>Gen. 15:6</a>; <a href='/AIV/23/41/8'>Isa. 41:8</a>",
      "comment": "'Friend of God' connects faith and intimate relationship. James aligns Genesis and Isaiah to show the fullness of righteousness goes beyond mere profession."
    },
    {
      "pk": 2143224,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 24,
      "text": "You see that a person is justified by works and not by faith alone.",
      "links": "<a href='/AIV/59/2/17'>James 2:17</a>; <a href='/AIV/40/7/21'>Matt. 7:21</a>",
      "comment": "James is explicit that justification is not by faith alone—a crucial affirmation of the need for faith to be lived out, which shapes the traditional Christian understanding of salvation."
    },
    {
      "pk": 2143225,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 25,
      "text": "And in the same way, was not Rahab the prostitute also justified by works when she received the messengers and sent them out by another way?",
      "links": "<a href='/AIV/6/2/1-21'>Josh. 2:1–21</a>; <a href='/AIV/58/11/31'>Heb. 11:31</a>",
      "comment": "Rahab's story demonstrates that transformative faith is available to all, and must lead to obedience, restoring dignity and covenant with God."
    },
    {
      "pk": 2143226,
      "translation": "AIV",
      "book": 59,
      "chapter": 2,
      "verse": 26,
      "text": "For just as the body apart from the spirit is dead, so also faith apart from works is dead.",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/40/7/24-27'>Matt. 7:24–27</a>",
      "comment": "James compares works as the animating breath of faith, showing a sacramental view: faith and works are inseparable in a living relationship with Christ."
    }
  ],
  "translatedAt": "2025-12-23T04:12:45.533Z"
}