{
  "book": "James",
  "bookAbbreviation": "Jas",
  "chapter": 5,
  "verses": [
    {
      "pk": 2130501,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 1,
      "text": "Come now, you rich, weep and howl for the miseries that are coming upon you.",
      "links": "<a href='/AIV/23/13/6'>Isa. 13:6</a>; <a href='/AIV/26/7/19'>Ezek. 7:19</a>; <a href='/AIV/42/6/24'>Luke 6:24</a>",
      "comment": "James warns the wealthy of impending judgment, echoing Old Testament prophets and Jesus' own teachings against the misuse of riches. The spiritual implication is a call to repentance and detachment from earthly wealth."
    },
    {
      "pk": 2130502,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 2,
      "text": "Your riches have rotted, and your garments are moth-eaten.",
      "links": "<a href='/AIV/23/50/9'>Isa. 50:9</a>; <a href='/AIV/40/6/19'>Matt. 6:19</a>",
      "comment": "A literal warning against storing up treasures on earth, echoing Jesus' teaching in the Sermon on the Mount. The spiritual reading emphasizes trusting in heavenly treasures."
    },
    {
      "pk": 2130503,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 3,
      "text": "Your gold and silver have rusted, and their corrosion will be evidence against you and will eat your flesh like fire. You have laid up treasure in the last days.",
      "links": "<a href='/AIV/40/6/20'>Matt. 6:20</a>; <a href='/AIV/45/2/5'>Rom. 2:5</a>",
      "comment": "Here, the accumulating of wealth in 'the last days' indicates misplaced trust. The imagery mirrors future judgment and spiritual accountability."
    },
    {
      "pk": 2130504,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 4,
      "text": "Behold, the wages of the laborers who mowed your fields, which you kept back by fraud, are crying out against you, and the cries of the harvesters have reached the ears of the Lord of Hosts.",
      "links": "<a href='/AIV/05/24/15'>Deut. 24:15</a>; <a href='/AIV/24/22/13'>Jer. 22:13</a>; <a href='/AIV/02/03/7'>Exod. 3:7</a>",
      "comment": "James draws from Mosaic Law, which commands just treatment of workers. The 'Lord of Hosts' shows God's concern for social justice and echoes the Old Testament image of God as defender of the oppressed."
    },
    {
      "pk": 2130505,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 5,
      "text": "You have lived on the earth in luxury and self-indulgence. You have fattened your hearts in a day of slaughter.",
      "links": "<a href='/AIV/19/73/7'>Ps. 73:7</a>; <a href='/AIV/24/12/3'>Jer. 12:3</a>",
      "comment": "A warning similar to those given to Israel for injustice and self-indulgence. The phrase ‘day of slaughter’ points towards final judgment, encouraging spiritual vigilance."
    },
    {
      "pk": 2130506,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 6,
      "text": "You have condemned and murdered the righteous person; he does not resist you.",
      "links": "<a href='/AIV/40/27/4'>Matt. 27:4</a>; <a href='/AIV/44/7/52'>Acts 7:52</a>",
      "comment": "Possibly an allusion to Christ as the innocent righteous one who did not resist his accusers (see Isaiah 53:7). This verse reflects both literal injustice and its fulfillment in Jesus."
    },
    {
      "pk": 2130507,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 7,
      "text": "Be patient, therefore, brothers, until the coming of the Lord. See how the farmer waits for the precious fruit of the earth, being patient about it, until it receives the early and the late rains.",
      "links": "<a href='/AIV/45/8/25'>Rom. 8:25</a>; <a href='/AIV/05/11/14'>Deut. 11:14</a>",
      "comment": "Patience is emphasized as a virtue, especially as believers await Christ's return. The farming imagery demonstrates God's providential timing. Early Christians saw patience as essential to spiritual maturity."
    },
    {
      "pk": 2130508,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 8,
      "text": "You also, be patient. Establish your hearts, for the coming of the Lord is near.",
      "links": "<a href='/AIV/50/4/5'>Phil. 4:5</a>; <a href='/AIV/60/4/7'>1 Pet. 4:7</a>",
      "comment": "The nearness of the Lord’s coming urges readiness, not complacency. ‘Establish your hearts’ calls for perseverance in faith and moral living."
    },
    {
      "pk": 2130509,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 9,
      "text": "Do not grumble against one another, brothers, so that you may not be judged; behold, the Judge is standing at the door.",
      "links": "<a href='/AIV/40/7/1'>Matt. 7:1</a>; <a href='/AIV/60/4/17'>1 Pet. 4:17</a>",
      "comment": "An exhortation to unity and mutual patience, consistent with Christ’s teaching. Spiritual unity is a sign of true discipleship."
    },
    {
      "pk": 2130510,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 10,
      "text": "As an example of suffering and patience, brothers, take the prophets who spoke in the name of the Lord.",
      "links": "<a href='/AIV/40/5/12'>Matt. 5:12</a>; <a href='/AIV/24/20/2'>Jer. 20:2</a>",
      "comment": "The holiness and endurance of the prophets serves as encouragement to persevere in faith and witness, even in the face of suffering."
    },
    {
      "pk": 2130511,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 11,
      "text": "Behold, we consider those blessed who have endured. You have heard of the endurance of Job, and you have seen the purpose of the Lord, how the Lord is compassionate and merciful.",
      "links": "<a href='/AIV/18/1/21-22'>Job 1:21–22</a>; <a href='/AIV/19/103/8'>Ps. 103:8</a>",
      "comment": "Job is highlighted as the model of steadfastness under trial. God’s compassion is stressed, inviting trust in divine providence even during suffering."
    },
    {
      "pk": 2130512,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 12,
      "text": "But above all, my brothers, do not swear, either by heaven or by earth or by any other oath, but let your 'Yes' be yes and your 'No,' no, so that you may not fall under judgment.",
      "links": "<a href='/AIV/40/5/34-37'>Matt. 5:34–37</a>",
      "comment": "James repeats Jesus’ teaching on the integrity of speech. The spiritual meaning is authenticity and truthfulness as marks of a faithful believer."
    },
    {
      "pk": 2130513,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 13,
      "text": "Is anyone among you suffering? Let him pray. Is anyone cheerful? Let him sing praise.",
      "links": "<a href='/AIV/19/50/15'>Ps. 50:15</a>; <a href='/AIV/51/3/16'>Col. 3:16</a>",
      "comment": "The life of the Christian involves both suffering and joy, and both are directed to God—through prayer and praise, expressing continual relationship with the Lord."
    },
    {
      "pk": 2130514,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 14,
      "text": "Is anyone among you sick? Let him call for the elders of the church, and let them pray over him, anointing him with oil in the name of the Lord.",
      "links": "<a href='/AIV/41/6/13'>Mark 6:13</a>; <a href='/AIV/44/28/8'>Acts 28:8</a>",
      "comment": "The command to call the elders and anoint with oil highlights a sacramental ministry—demonstrating the importance of visible actions (sacraments) and spiritual leaders in the healing ministry of the church."
    },
    {
      "pk": 2130515,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 15,
      "text": "And the prayer of faith will save the one who is sick, and the Lord will raise him up. And if he has committed sins, he will be forgiven.",
      "links": "<a href='/AIV/40/9/2'>Matt. 9:2</a>; <a href='/AIV/41/2/5'>Mark 2:5</a>",
      "comment": "Physical healing is linked with forgiveness of sins, showing the church’s ministry involves both body and soul. Spiritual authority is at work in prayer, healing, and forgiveness."
    },
    {
      "pk": 2130516,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 16,
      "text": "Therefore, confess your sins to one another and pray for one another, that you may be healed. The prayer of a righteous person has great power as it is working.",
      "links": "<a href='/AIV/43/20/23'>John 20:23</a>; <a href='/AIV/19/32/5'>Ps. 32:5</a>",
      "comment": "Mutual confession and intercession reveal the communal dimension of forgiveness. This points to the necessity of tangible confession and strengthens our understanding of the need for spiritual authority and discipline."
    },
    {
      "pk": 2130517,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 17,
      "text": "Elijah was a man with a nature like ours, and he prayed earnestly that it might not rain, and for three years and six months it did not rain on the earth.",
      "links": "<a href='/AIV/11/17/1'>1 Kgs. 17:1</a>; <a href='/AIV/42/4/25'>Luke 4:25</a>",
      "comment": "Elijah exemplifies the power of prayer by the righteous. The 'three years and six months' also foreshadow prophetic fulfillment in God’s timing."
    },
    {
      "pk": 2130518,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 18,
      "text": "Then he prayed again, and heaven gave rain, and the earth produced its fruit.",
      "links": "<a href='/AIV/11/18/42-45'>1 Kgs. 18:42–45</a>",
      "comment": "This underscores the effect of fervent prayer and God’s willingness to respond, aligning Old Testament miracles with New Testament faith."
    },
    {
      "pk": 2130519,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 19,
      "text": "My brothers, if anyone among you wanders from the truth and someone brings him back,",
      "links": "<a href='/AIV/42/15/4-7'>Luke 15:4–7</a>; <a href='/AIV/48/6/1'>Gal. 6:1</a>",
      "comment": "There’s a communal duty in restoring those who have strayed, reflecting the heart of the Good Shepherd and emphasizing reconciliation and visible unity."
    },
    {
      "pk": 2130520,
      "translation": "AIV",
      "book": 59,
      "chapter": 5,
      "verse": 20,
      "text": "let him know that whoever brings back a sinner from his wandering will save his soul from death and will cover a multitude of sins.",
      "links": "<a href='/AIV/20/10/12'>Prov. 10:12</a>; <a href='/AIV/60/4/8'>1 Pet. 4:8</a>",
      "comment": "Salvation involves actively restoring others; there is a promise of covering sins through acts of mercy. This points to the importance of good works and the role of community in salvation."
    }
  ],
  "translatedAt": "2025-12-23T04:13:58.793Z"
}