{
  "book": 66,
  "bookName": "James",
  "bookAbbreviation": "Jas",
  "chapter": 5,
  "verses": [
    {
      "pk": 66005001,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 1,
      "text": "Come now, you rich, weep and wail for the miseries that are coming upon you.",
      "links": "<a href='/AIV/20/11/28'>Prov. 11:28</a>; <a href='/AIV/40/19/23-24'>Matt. 19:23-24</a>",
      "comment": "James addresses the wealthy with a prophetic warning, emphasizing the dangers of trusting in riches. See Proverbs 11:28 and Jesus' teaching in Matthew 19:23-24. The tone mirrors Old Testament prophetic judgment."
    },
    {
      "pk": 66005002,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 2,
      "text": "Your wealth has rotted and your garments are moth-eaten.",
      "links": "<a href='/AIV/40/6/19'>Matt. 6:19</a>; <a href='/AIV/23/50/9'>Isa. 50:9</a>",
      "comment": "Echoing Jesus in the Sermon on the Mount, James highlights the perishability of earthly treasures, urging readers toward a life oriented to eternal values."
    },
    {
      "pk": 66005003,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 3,
      "text": "Your gold and silver have corroded; and their corrosion will be evidence against you and will eat your flesh like fire. You have stored up treasure in the last days.",
      "links": "<a href='/AIV/40/6/20'>Matt. 6:20</a>; <a href='/AIV/45/2/5'>Rom. 2:5</a>",
      "comment": "There is a strong warning about judgment for those who hoard wealth instead of using it for good. It recalls the biblical teaching on eternal reward and accountability."
    },
    {
      "pk": 66005004,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 4,
      "text": "Look, the wages you withheld from the laborers who mowed your fields, which you kept back by fraud, cry out; and the cries of the harvesters have reached the ears of the Lord of Hosts.",
      "links": "<a href='/AIV/05/24/14-15'>Deut. 24:14-15</a>; <a href='/AIV/02/03/7'>Ex. 3:7</a>",
      "comment": "James draws from Deuteronomy’s concern for the oppressed and echoes the justice of the Lord, who hears the cry of the poor and the exploited. The phrase 'Lord of Hosts' emphasizes God's power and sovereignty."
    },
    {
      "pk": 66005005,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 5,
      "text": "You have lived in luxury on the earth and indulged yourselves; you have fattened your hearts in a day of slaughter.",
      "links": "<a href='/AIV/19/73/7'>Ps. 73:7</a>; <a href='/AIV/42/16/19-25'>Luke 16:19-25</a>",
      "comment": "Similar to Psalm 73 and the parable of the rich man and Lazarus, James warns against self-indulgence and ignoring the call to share with those in need."
    },
    {
      "pk": 66005006,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 6,
      "text": "You have condemned and murdered the righteous person; he does not resist you.",
      "links": "<a href='/AIV/40/5/10'>Matt. 5:10</a>; <a href='/AIV/19/94/21'>Ps. 94:21</a>",
      "comment": "The righteous are oppressed and even killed without resistance, reminiscent of Christ’s own suffering (see Matt. 5:10). This verse hints at Christological parallels in the suffering of the just for the sake of righteousness."
    },
    {
      "pk": 66005007,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 7,
      "text": "Therefore be patient, brothers and sisters, until the coming of the Lord. See how the farmer waits for the precious fruit of the earth, being patient about it, until it receives the early and the late rains.",
      "links": "<a href='/AIV/05/11/14'>Deut. 11:14</a>; <a href='/AIV/59/8/19'>Heb. 10:36-37</a>",
      "comment": "James encourages patience in waiting for the Lord’s coming, drawing a comparison with the farmer. This reflects the value of perseverance and hope in God’s faithfulness, a theme woven throughout Scripture."
    },
    {
      "pk": 66005008,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 8,
      "text": "You also, be patient. Establish your hearts, for the coming of the Lord is near.",
      "links": "<a href='/AIV/50/4/5'>Phil. 4:5</a>; <a href='/AIV/66/22/20'>Rev. 22:20</a>",
      "comment": "The call to steadfastness comes with a reminder that Christ’s return is imminent. The early Church lived in expectation of Jesus’s coming, motivating righteous living."
    },
    {
      "pk": 66005009,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 9,
      "text": "Do not grumble against one another, brothers and sisters, so that you may not be judged; behold, the Judge is standing at the door.",
      "links": "<a href='/AIV/40/7/1'>Matt. 7:1</a>; <a href='/AIV/45/14/10'>Rom. 14:10-13</a>",
      "comment": "Mutual forbearance is required in the community of believers, knowing Christ will judge all. This reflects the need for unity and charity, essential marks of the one Church."
    },
    {
      "pk": 66005010,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 10,
      "text": "As an example of suffering and patience, brothers and sisters, take the prophets who spoke in the name of the Lord.",
      "links": "<a href='/AIV/24/20/11'>Jer. 20:11</a>; <a href='/AIV/40/5/12'>Matt. 5:12</a>",
      "comment": "James encourages believers to endure trials like the prophets. This stresses the continuity between the New Testament community and the Old Testament people of God."
    },
    {
      "pk": 66005011,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 11,
      "text": "Look, we consider those blessed who have persevered. You have heard of the perseverance of Job, and you have seen the outcome from the Lord, how the Lord is full of compassion and mercy.",
      "links": "<a href='/AIV/18/42/10-17'>Job 42:10-17</a>; <a href='/AIV/19/103/8'>Ps. 103:8</a>",
      "comment": "With Job as an example, James demonstrates God’s faithfulness to the steadfast. The emphasis on perseverance and God’s mercy aligns with traditional interpretations highlighting works flowing from faith."
    },
    {
      "pk": 66005012,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 12,
      "text": "But above all, my brothers and sisters, do not swear, either by heaven or by earth or by any other oath; but let your 'Yes' be yes, and your 'No' be no, so that you may not fall under judgment.",
      "links": "<a href='/AIV/40/5/34-37'>Matt. 5:34-37</a>; <a href='/AIV/03/19/12'>Lev. 19:12</a>",
      "comment": "James echoes Jesus’s teaching from the Sermon on the Mount, elevating honesty and integrity. This call to truthfulness is foundational for fostering a trustworthy, sacramental community."
    },
    {
      "pk": 66005013,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 13,
      "text": "Is anyone among you suffering? Let him pray. Is anyone cheerful? Let him sing praises.",
      "links": "<a href='/AIV/19/34/2'>Ps. 34:2</a>; <a href='/AIV/52/5/16-18'>1 Thess. 5:16-18</a>",
      "comment": "In all circumstances—suffering or joy—believers are called to turn to God in prayer and praise. This instruction points to spiritual unity and the importance of communal worship."
    },
    {
      "pk": 66005014,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 14,
      "text": "Is anyone among you sick? Let him call for the elders of the church, and let them pray over him, anointing him with oil in the name of the Lord.",
      "links": "<a href='/AIV/41/6/13'>Mark 6:13</a>; <a href='/AIV/03/14/18'>Lev. 14:18'</a>",
      "comment": "Here James refers to the sacramental practice of anointing with oil by the elders (‘presbyters’). This ritual is an early evidence of apostolic authority and the means by which grace is communicated through the Church."
    },
    {
      "pk": 66005015,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 15,
      "text": "And the prayer of faith will save the sick one, and the Lord will raise him up; and if he has committed sins, he will be forgiven.",
      "links": "<a href='/AIV/40/9/2-7'>Matt. 9:2-7</a>; <a href='/AIV/41/2/5'>Mark 2:5</a>",
      "comment": "James links physical healing to spiritual healing, including the forgiveness of sins through the prayer of the elders. Christ uniquely authorizes the Church to mediate forgiveness (see Matt. 9:2-8)."
    },
    {
      "pk": 66005016,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 16,
      "text": "Therefore, confess your sins to one another and pray for one another, that you may be healed. The effective prayer of a righteous person has great power.",
      "links": "<a href='/AIV/43/20/22-23'>John 20:22-23</a>; <a href='/AIV/19/32/5'>Ps. 32:5</a>",
      "comment": "The apostolic community is exhorted to mutual confession and intercessory prayer. This hints at continued apostolic ministry of reconciliation and underscores the communal aspect of salvation."
    },
    {
      "pk": 66005017,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 17,
      "text": "Elijah was a man with a nature like ours, and he prayed fervently that it might not rain, and for three years and six months it did not rain on the earth.",
      "links": "<a href='/AIV/11/17/1'>1 Kings 17:1</a>; <a href='/AIV/42/4/25'>Luke 4:25</a>",
      "comment": "Elijah’s example demonstrates that righteous prayer is powerful and effective. The story serves as an inspiration for believers to pray boldly in faith."
    },
    {
      "pk": 66005018,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 18,
      "text": "Then he prayed again, and the sky gave rain, and the earth produced its fruit.",
      "links": "<a href='/AIV/11/18/42-45'>1 Kings 18:42-45</a>",
      "comment": "God responds to the prayers of the righteous, reaffirming believers’ confidence in God’s providence and encouraging trust in His care."
    },
    {
      "pk": 66005019,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 19,
      "text": "My brothers and sisters, if anyone among you wanders from the truth and someone brings him back,",
      "links": "<a href='/AIV/48/6/1'>Gal. 6:1</a>; <a href='/AIV/42/15/4-7'>Luke 15:4-7</a>",
      "comment": "The community is responsible for restoring those who go astray. This reflects Jesus’s teaching on seeking the lost (Luke 15). Restoration is communal and connected to apostolic authority."
    },
    {
      "pk": 66005020,
      "translation": "AIV",
      "book": 66,
      "bookName": "James",
      "bookAbbreviation": "Jas",
      "chapter": 5,
      "verse": 20,
      "text": "let him know that whoever turns a sinner from the error of his way will save a soul from death, and will cover a multitude of sins.",
      "links": "<a href='/AIV/19/32/1'>Ps. 32:1</a>; <a href='/AIV/60/4/8'>1 Pet. 4:8</a>",
      "comment": "To lead another to repentance is a great spiritual work with eternal consequences. This echoes the theme of forgiveness and the call to be instruments of reconciliation, emphasizing the power of grace conveyed through the life of the Church."
    }
  ],
  "translatedAt": "2025-12-24T12:26:06.896Z"
}