{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 37,
  "verses": [
    {
      "pk": 39037001,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 1,
      "text": "The hand of the LORD was upon me, and He brought me out by the Spirit of the LORD and set me down in the middle of the valley; it was full of bones.",
      "links": "<a href='/AIV/1/41/38'>Gen. 41:38</a>; <a href='/AIV/26/3/14'>Ezek. 3:14</a>",
      "comment": "The Spirit of the LORD is an active, personal force; notice the prophetic inspiration here (cf. Gen. 41:38, the Spirit in Joseph; Ezekiel’s prophetic commission)."
    },
    {
      "pk": 39037002,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 2,
      "text": "He led me around among them, and behold, there were very many on the surface of the valley, and behold, they were very dry.",
      "links": "<a href='/AIV/26/6/5'>Ezek. 6:5</a>",
      "comment": "Dry bones symbolize utter death and hopelessness—Israel’s spiritual and physical state in exile."
    },
    {
      "pk": 39037003,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 3,
      "text": "And He said to me, 'Son of man, can these bones live?' I answered, 'O LORD God, You know.'",
      "links": "<a href='/AIV/24/32/27'>Jer. 32:27</a>; <a href='/AIV/1/18/14'>Gen. 18:14</a>",
      "comment": "A rhetorical question, asserting that only the Lord has power over life and death (cf. Jer. 32:27, Gen. 18:14). The humility in the prophet’s response is noteworthy."
    },
    {
      "pk": 39037004,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 4,
      "text": "Then He said to me, 'Prophesy over these bones and say to them, O dry bones, hear the word of the LORD.'",
      "links": "<a href='/AIV/26/6/3'>Ezek. 6:3</a>",
      "comment": "God’s word is creative and effectual—even lifeless bones must respond (note connection to Genesis 1, God’s creative speech)."
    },
    {
      "pk": 39037005,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 5,
      "text": "Thus says the Lord GOD to these bones: Behold, I will cause breath to enter you, and you shall live.",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>",
      "comment": "A deliberate echo of Genesis 2:7—‘breath’ (Hebrew: ruach) means both wind and spirit, alluding to God’s life-giving power."
    },
    {
      "pk": 39037006,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 6,
      "text": "I will put sinews upon you, and will bring flesh upon you, and cover you with skin, and put breath in you, and you shall live. Then you shall know that I am the LORD.",
      "links": "<a href='/AIV/26/36/11'>Ezek. 36:11</a>; <a href='/AIV/26/6/7'>Ezek. 6:7</a>",
      "comment": "Restoration is both physical and spiritual; knowing the LORD is the ultimate goal—intimate, covenant knowledge."
    },
    {
      "pk": 39037007,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 7,
      "text": "So I prophesied as I was commanded. And as I prophesied, there was a sound, and behold, a rattling, and the bones came together, bone to its bone.",
      "links": "<a href='/AIV/26/12/25'>Ezek. 12:25</a>",
      "comment": "The prophet’s obedience is key: God’s power works through human agency, a recurring biblical theme."
    },
    {
      "pk": 39037008,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 8,
      "text": "I looked, and behold, there were sinews on them, and flesh had come upon them, and skin had covered them. But there was no breath in them.",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>",
      "comment": "Without the divine breath, the bodies are lifeless—parallel to Adam before God breathed into him."
    },
    {
      "pk": 39037009,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 9,
      "text": "Then He said to me, 'Prophesy to the breath; prophesy, son of man, and say to the breath, Thus says the Lord GOD: Come from the four winds, O breath, and breathe on these slain, that they may live.'",
      "links": "<a href='/AIV/1/2/7'>Gen. 2:7</a>; <a href='/AIV/43/20/22'>John 20:22</a>",
      "comment": "‘Four winds’ suggests universality. Compare with Christ breathing on the apostles (John 20:22) instituting a new creation and transformative life."
    },
    {
      "pk": 39037010,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 10,
      "text": "So I prophesied as He commanded me, and the breath came into them, and they lived and stood on their feet, a very great army.",
      "links": "<a href='/AIV/2/14/30'>Ex. 14:30</a>",
      "comment": "The restored people become a living army—pointing to the powerful effect of God’s Spirit and echoing Israel’s deliverance."
    },
    {
      "pk": 39037011,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 11,
      "text": "Then He said to me, 'Son of man, these bones are the whole house of Israel. Behold, they say, “Our bones are dried up, and our hope is lost; we are completely cut off.”'",
      "links": "<a href='/AIV/19/141/7'>Ps. 141:7</a>; <a href='/AIV/25/3/54'>Lam. 3:54</a>",
      "comment": "God clarifies the vision’s symbolism: the despair of exile is addressed by resurrection hope."
    },
    {
      "pk": 39037012,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 12,
      "text": "Therefore prophesy and say to them, Thus says the Lord GOD: Behold, I will open your graves and raise you from your graves, O My people. And I will bring you into the land of Israel.",
      "links": "<a href='/AIV/26/36/24'>Ezek. 36:24</a>; <a href='/AIV/27/12/2'>Dan. 12:2</a>",
      "comment": "The language of resurrection has both a national (return from exile) and eschatological (end-times resurrection, cf. Dan. 12:2) meaning."
    },
    {
      "pk": 39037013,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 13,
      "text": "And you shall know that I am the LORD, when I open your graves, and raise you from your graves, O My people.",
      "links": "<a href='/AIV/43/11/43-44'>John 11:43-44</a>",
      "comment": "‘Opening graves’ foreshadows later resurrection miracles (John 11:44, Lazarus) and ultimately Christ’s own resurrection."
    },
    {
      "pk": 39037014,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 14,
      "text": "And I will put My Spirit within you, and you shall live, and I will place you in your own land. Then you shall know that I, the LORD, have spoken, and I have done it, declares the LORD.",
      "links": "<a href='/AIV/26/36/27'>Ezek. 36:27</a>; <a href='/AIV/44/2/4'>Acts 2:4</a>",
      "comment": "Restoration is by the outpouring of God’s Spirit (see also Acts 2), pointing to spiritual regeneration through the Spirit."
    },
    {
      "pk": 39037015,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 15,
      "text": "The word of the LORD came to me, saying:",
      "links": "",
      "comment": "A new oracle begins; the unity of God’s people is in focus."
    },
    {
      "pk": 39037016,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 16,
      "text": "'Son of man, take a stick and write on it, “For Judah and the people of Israel associated with him.” Then take another stick and write on it, “For Joseph (the stick of Ephraim) and all the house of Israel associated with him.”'",
      "links": "<a href='/AIV/1/49/10'>Gen. 49:10</a>",
      "comment": "Judah (the royal line) and Ephraim (the leading northern tribe) represent the two divided kingdoms."
    },
    {
      "pk": 39037017,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 17,
      "text": "Then join them one to another into one stick, so that they may become one in your hand.",
      "links": "<a href='/AIV/26/37/22'>Ezek. 37:22</a>",
      "comment": "Symbolic unification—echoes the restoration of God’s one covenant people."
    },
    {
      "pk": 39037018,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 18,
      "text": "And when your people say to you, “Will you not tell us what you mean by these?”",
      "links": "",
      "comment": "Prophetic symbols invite questions—God clarifies His message about unity."
    },
    {
      "pk": 39037019,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 19,
      "text": "Say to them, Thus says the Lord GOD: Behold, I am about to take the stick of Joseph (which is in the hand of Ephraim) and the tribes of Israel associated with him. And I will join with it the stick of Judah, and make them one stick, that they may be one in My hand.",
      "links": "<a href='/AIV/26/37/16'>Ezek. 37:16</a>",
      "comment": "The Lord unites what was divided—a prophecy with both immediate and ultimate fulfillment, including New Testament unity in Christ (see Eph. 2:14, implied)."
    },
    {
      "pk": 39037020,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 20,
      "text": "The sticks on which you write shall be in your hand before their eyes.",
      "links": "",
      "comment": "The sign is public, just as the Church is a visible sign of unity."
    },
    {
      "pk": 39037021,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 21,
      "text": "Then say to them, Thus says the Lord GOD: Behold, I will take the people of Israel from among the nations where they have gone, and will gather them from all around, and bring them into their own land.",
      "links": "<a href='/AIV/26/11/17'>Ezek. 11:17</a>",
      "comment": "The return from exile is also a type of God’s gathering of all nations into His one people."
    },
    {
      "pk": 39037022,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 22,
      "text": "And I will make them one nation in the land, on the mountains of Israel. One king shall be king over them all, and they shall no longer be two nations, and never again be divided into two kingdoms.",
      "links": "<a href='/AIV/26/37/24'>Ezek. 37:24</a>; <a href='/AIV/1/49/10'>Gen. 49:10</a>",
      "comment": "The ‘one king’ foreshadows the Messianic King; traditional interpretation links this to Christ as the true Shepherd-King."
    },
    {
      "pk": 39037023,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 23,
      "text": "They shall not defile themselves any more with their idols and their detestable things, or with any of their transgressions. But I will save them from all their backslidings in which they have sinned, and will cleanse them. And they shall be My people, and I will be their God.",
      "links": "<a href='/AIV/26/36/25'>Ezek. 36:25</a>; <a href='/AIV/58/10/22'>Heb. 10:22</a>",
      "comment": "Notice the elements of moral cleansing and restoration—anticipates New Testament themes of purifying the people through a sacramental washing."
    },
    {
      "pk": 39037024,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 24,
      "text": "My servant David shall be king over them, and they shall all have one shepherd. They shall walk in My ordinances and be careful to observe My statutes.",
      "links": "<a href='/AIV/40/2/6'>Matt. 2:6</a>; <a href='/AIV/43/10/16'>John 10:16</a>",
      "comment": "‘David’ here refers to the Messiah—a prophecy of the Good Shepherd (cf. John 10:16), who brings unity and leads the faithful."
    },
    {
      "pk": 39037025,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 25,
      "text": "They shall dwell in the land that I gave to My servant Jacob, where your fathers lived. They and their children’s children shall dwell there forever, and David My servant shall be their prince forever.",
      "links": "<a href='/AIV/1/35/12'>Gen. 35:12</a>; <a href='/AIV/42/1/32-33'>Luke 1:32-33</a>",
      "comment": "The Messiah’s eternal reign is rooted in God’s promise to Jacob, and fulfilled in Christ (see Luke 1:32-33)."
    },
    {
      "pk": 39037026,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 26,
      "text": "I will make a covenant of peace with them. It shall be an everlasting covenant with them. And I will set them in their land and multiply them, and will set My sanctuary in their midst forevermore.",
      "links": "<a href='/AIV/26/34/25'>Ezek. 34:25</a>; <a href='/AIV/42/22/20'>Luke 22:20</a>",
      "comment": "This ‘everlasting covenant’ points to the new and everlasting covenant established by Christ (see Luke 22:20); the sanctuary foreshadows God’s abiding presence among His people."
    },
    {
      "pk": 39037027,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 27,
      "text": "My dwelling place will be with them, and I will be their God, and they shall be My people.",
      "links": "<a href='/AIV/3/26/12'>Lev. 26:12</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "This promise is echoed at the very end of Scripture (Rev. 21:3); God’s dwelling among His people is both spiritual and real, fulfilled in Christ and the ongoing presence of God’s temple people."
    },
    {
      "pk": 39037028,
      "translation": "AIV",
      "book": 26,
      "chapter": 37,
      "verse": 28,
      "text": "Then the nations will know that I am the LORD who sanctifies Israel, when My sanctuary is in their midst forevermore.",
      "links": "<a href='/AIV/43/2/19-21'>John 2:19-21</a>",
      "comment": "Sanctuary here anticipates the true Temple, Jesus Christ, and through Him, the sanctified people (cf. John 2:19-21). God’s glory is revealed to all nations through the reality of His presence."
    }
  ],
  "translatedAt": "2025-12-23T07:06:19.464Z"
}