{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 6,
  "verses": [
    {
      "pk": 2260630,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "",
      "comment": "Ezekiel often introduces a new divine message with this phrase, highlighting the direct inspiration from God. See also <a href='/AIV/26/1/3'>Ezek. 1:3</a>; <a href='/AIV/26/3/16'>3:16</a>."
    },
    {
      "pk": 2260631,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 2,
      "text": "\"Son of man, face the mountains of Israel, and prophesy against them.",
      "links": "<a href='/AIV/26/36/1'>Ezek. 36:1</a>",
      "comment": "The address to 'Son of man' is unique to Ezekiel, emphasizing his humanity as a messenger. The mountains signify the high places where Israel committed idolatry."
    },
    {
      "pk": 2260632,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 3,
      "text": "Say: Mountains of Israel, hear the word of the Lord GOD. This is what the Lord GOD says to the mountains and the hills, to the ravines and the valleys: 'I, yes I, am bringing a sword against you, and I will destroy your high places.'",
      "links": "<a href='/AIV/26/20/29'>Ezek. 20:29</a>; <a href='/AIV/12/23/19-20'>2 Kings 23:19-20</a>",
      "comment": "The repeated naming of landscape features emphasizes the totality of the coming judgment. The 'high places' were often sites of forbidden worship. God's jealousy for pure worship is a recurring theme (see <a href='/AIV/3/17/7'>Lev. 17:7</a>)."
    },
    {
      "pk": 2260633,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 4,
      "text": "'Your altars will be demolished, your incense altars broken. I will throw down your slain before your idols.'",
      "links": "<a href='/AIV/26/5/11'>Ezek. 5:11</a>; <a href='/AIV/14/34/3-4'>2 Chr. 34:3–4</a>",
      "comment": "Judgment specifically targets objects and places of idolatry; the destruction includes violence that will serve as a visible sign to all of Israel."
    },
    {
      "pk": 2260634,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 5,
      "text": "'I will lay the dead bodies of the people of Israel in front of their idols, and scatter your bones around your altars.'",
      "links": "<a href='/AIV/26/43/7'>Ezek. 43:7</a>",
      "comment": "Displaying corpses before idols is an act displaying the powerlessness and emptiness of false gods. This also calls to mind the seriousness with which God deals with spiritual adultery."
    },
    {
      "pk": 2260635,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 6,
      "text": "'Wherever you live, cities will be made desolate and high places laid waste, so that your altars will be destroyed and ruined, your idols shattered and blotted out, your incense altars cut down, and your works wiped out.'",
      "links": "<a href='/AIV/3/26/31'>Lev. 26:31</a>; <a href='/AIV/26/36/4'>Ezek. 36:4</a>",
      "comment": "The totality of desolation shows God’s judgment is just and comprehensive. Note that both corporate and individual guilt are diagnosed here, pointing to a need for restoration beyond human works."
    },
    {
      "pk": 2260636,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 7,
      "text": "'The slain will fall among you, and you will know that I am the LORD.'",
      "links": "<a href='/AIV/26/6/10'>Ezek. 6:10</a>; <a href='/AIV/2/7/5'>Exodus 7:5</a>",
      "comment": "The repeated phrase “you will know that I am the LORD” is a motif in Ezekiel and underscores that God’s ultimate goal is repentance and acknowledgment of His lordship. (See <a href='/AIV/26/11/12'>Ezek. 11:12</a>)"
    },
    {
      "pk": 2260637,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 8,
      "text": "'But I will leave a remnant, for some of you will escape the sword among the nations, when you are scattered throughout the lands.'",
      "links": "<a href='/AIV/26/12/16'>Ezek. 12:16</a>; <a href='/AIV/23/10/20-22'>Isa. 10:20-22</a>",
      "comment": "The promise of a remnant persists as a thin thread of hope. Theologically, God never utterly abandons His people; this foreshadows the restoration motif that is fulfilled in Christ, the true remnant and the gathering point for all nations."
    },
    {
      "pk": 2260638,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 9,
      "text": "'Then those of you who escape will remember me among the nations where they are taken captive, when I have broken their hearts that turned away from me, and their eyes that commit adultery after their idols. They will loathe themselves for the evils they have done and for all their abominations.'",
      "links": "<a href='/AIV/26/16/61'>Ezek. 16:61</a>; <a href='/AIV/24/31/18-19'>Jer. 31:18–19</a>; <a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "Repentance is described as God’s own work in their hearts, a significant moment showing the need for God’s initiative in returning to Him. Compare to the prodigal son in <a href='/AIV/42/15/17-20'>Luke 15:17-20</a> and the promise of a new heart in <a href='/AIV/26/36/26'>Ezekiel 36:26</a>."
    },
    {
      "pk": 2260639,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 10,
      "text": "'Then they will know that I am the LORD. I did not speak in vain to bring this disaster upon them.'",
      "links": "<a href='/AIV/26/6/7'>Ezek. 6:7</a>; <a href='/AIV/4/23/19'>Numbers 23:19</a>",
      "comment": "God’s faithfulness to His word, both in judgment and future restoration, is unwavering; this points ultimately to the trustworthiness of His promises—those fulfilled in both the Cross and the Resurrection."
    },
    {
      "pk": 2260640,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 11,
      "text": "This is what the Lord GOD says: 'Clap your hands, stamp your feet, and say, “Alas!” for all the evil abominations of the house of Israel. For by sword, famine, and plague they will fall.'",
      "links": "<a href='/AIV/26/5/12'>Ezek. 5:12</a>; <a href='/AIV/26/21/14'>Ezek. 21:14</a>",
      "comment": "The bodily gestures command Ezekiel to demonstrate mourning and lament, signaling the seriousness of sin. These judgments echo Deuteronomic curses (<a href='/AIV/5/28/21-22'>Deut. 28:21-22</a>)."
    },
    {
      "pk": 2260641,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 12,
      "text": "'He who is far away will die by the plague; he who is near will fall by the sword; and he who survives and is spared will die of famine. Thus I will spend my fury upon them.'",
      "links": "<a href='/AIV/26/5/13'>Ezek. 5:13</a>",
      "comment": "The completeness of God’s judgment is repeated. The language of 'my fury' reminds us both of divine justice and the ultimate need for atonement—themes taken up in the suffering of Christ, who alone turns aside wrath."
    },
    {
      "pk": 2260642,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 13,
      "text": "'You will know that I am the LORD, when their slain lie among their idols, on every side of their altars, on every high hill, on all the mountaintops, under every green tree, and under every leafy oak—the places where they offered pleasing aromas to all their idols.'",
      "links": "<a href='/AIV/11/14/23'>1 Kings 14:23</a>; <a href='/AIV/2/34/13'>Exodus 34:13</a>",
      "comment": "The locations named were all places of idolatrous worship. The emphasis is on God revealing Himself—even in judgment, His purpose is to call His people back to true worship. Note the spiritual sense: only in faithful worship do people truly find life."
    },
    {
      "pk": 2260643,
      "translation": "AIV",
      "book": 26,
      "chapter": 6,
      "verse": 14,
      "text": "'I will stretch out my hand against them and make the land a desolation and a waste, from the wilderness to Riblah, wherever they dwell. Then they will know that I am the LORD.'\"",
      "links": "<a href='/AIV/26/7/27'>Ezek. 7:27</a>; <a href='/AIV/4/34/21'>Numbers 34:21</a>",
      "comment": "God’s outstretched hand signifies decisive sovereign action. The entire land is included, showing the need for renewal on a large scale—anticipating the New Covenant, where hearts and creation itself will be restored in Christ."
    }
  ],
  "translatedAt": "2025-12-23T06:48:49.973Z"
}