{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 48,
  "verses": [
    {
      "pk": 1948301,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 1,
      "text": "Now these are the names of the tribes: From the north end, along the way of Hethlon, to Lebo Hamath, as far as Hazor Enan at the northern border of Damascus, next to Hamath, running east to west, Dan—one portion.",
      "links": "<a href='/AIV/04/34/7-9'>Num. 34:7–9</a>",
      "comment": "This marks the beginning of the division of the land among the twelve tribes, reminiscent of earlier allotments in Numbers. Despite the exile, God restores order and inheritance to Israel."
    },
    {
      "pk": 1948302,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 2,
      "text": "Next to the border of Dan, from the east side to the west, Asher—one portion.",
      "links": "<a href='/AIV/06/19/24'>Josh. 19:24</a>",
      "comment": "The methodical listing reinforces the order and unity God desires for His people."
    },
    {
      "pk": 1948303,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 3,
      "text": "Next to the border of Asher, from the east side to the west, Naphtali—one portion.",
      "links": "<a href='/AIV/06/19/32'>Josh. 19:32</a>",
      "comment": "Continuing the established tribal boundaries, echoing the promise of restoration and belonging."
    },
    {
      "pk": 1948304,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 4,
      "text": "Next to the border of Naphtali, from the east side to the west, Manasseh—one portion.",
      "links": "<a href='/AIV/06/17/1'>Josh. 17:1</a>",
      "comment": "Manasseh represents both heritage and division, connecting back to Jacob's blessings in Genesis."
    },
    {
      "pk": 1948305,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 5,
      "text": "Next to the border of Manasseh, from the east side to the west, Ephraim—one portion.",
      "links": "<a href='/AIV/06/16/5'>Josh. 16:5</a>",
      "comment": "Ephraim's placement recalls its central importance in Israel's history."
    },
    {
      "pk": 1948306,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 6,
      "text": "Next to the border of Ephraim, from the east side to the west, Reuben—one portion.",
      "links": "<a href='/AIV/06/13/15'>Josh. 13:15</a>",
      "comment": "Reuben, the firstborn, though he forfeited privilege, is given an allotment, underscoring God's mercy."
    },
    {
      "pk": 1948307,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 7,
      "text": "Next to the border of Reuben, from the east side to the west, Judah—one portion.",
      "links": "<a href='/AIV/06/15/1'>Josh. 15:1</a>; <a href='/AIV/01/49/8-10'>Gen. 49:8–10</a>",
      "comment": "Judah’s placement is significant, laying the groundwork for messianic prophecies."
    },
    {
      "pk": 1948308,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 8,
      "text": "Next to the border of Judah, from the east side to the west, shall be the portion you shall set apart as a holy offering, twenty-five thousand cubits wide and as long as one of the tribal portions, from east to west, and the sanctuary shall be in its midst.",
      "links": "<a href='/AIV/26/45/1-6'>Ezek. 45:1–6</a>",
      "comment": "The centrality of the sanctuary foreshadows the gathering of all nations and the unity of worship."
    },
    {
      "pk": 1948309,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 9,
      "text": "The offering that you shall set apart to the LORD shall be twenty-five thousand cubits in length, and ten thousand in width.",
      "links": "<a href='/AIV/26/45/3'>Ezek. 45:3</a>",
      "comment": "God’s portion set in the midst of the land hints at the spiritual priority of divine worship."
    },
    {
      "pk": 1948310,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 10,
      "text": "For the priests, this holy portion will be: twenty-five thousand cubits toward the north, ten thousand toward the west, ten thousand toward the east, twenty-five thousand toward the south, with the sanctuary of the LORD in the center.",
      "links": "<a href='/AIV/26/44/15-16'>Ezek. 44:15–16</a>",
      "comment": "A unique focus on priesthood and central sanctuary, prefiguring a gathered and set-apart ministerial order."
    },
    {
      "pk": 1948311,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 11,
      "text": "It shall be for the priests, the sons of Zadok, who kept the charge of my sanctuary when the sons of Israel went astray; it shall be a special portion for them, a most holy place, next to the border of the Levites.",
      "links": "<a href='/AIV/26/44/15'>Ezek. 44:15</a>",
      "comment": "The faithful priestly line is rewarded, reminiscent of continuity and fidelity in spiritual leadership."
    },
    {
      "pk": 1948312,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 12,
      "text": "Beside the territory of the priests, the Levites shall have a portion, twenty-five thousand cubits long and ten thousand wide. Its total length will be twenty-five thousand and its width ten thousand.",
      "links": "<a href='/AIV/26/45/5'>Ezek. 45:5</a>",
      "comment": "Levites, as assistants, have a distinct but related role, reminiscent of hierarchical and ordered ministry."
    },
    {
      "pk": 1948313,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 13,
      "text": "And they shall not sell any of it or exchange it, nor transfer this choice portion, for it is holy to the LORD.",
      "links": "",
      "comment": "Sacred things are not to be treated as common, preserving the sanctity of worship and ministry."
    },
    {
      "pk": 1948314,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 14,
      "text": "The remaining area, five thousand cubits wide and twenty-five thousand long, is for the city, for general use and for dwellings, as well as open land for the city.",
      "links": "",
      "comment": "Provision for the common people alongside the sacred spaces, upholding stewardship and community."
    },
    {
      "pk": 1948315,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 15,
      "text": "The city portion that remains, two thousand five hundred cubits wide and ten thousand long, will be for common use by the city, for dwellings and open space. The city shall be in its midst.",
      "links": "",
      "comment": "The city as a center of life and community reflects both literal and spiritual meanings—God dwelling among His people."
    },
    {
      "pk": 1948316,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 16,
      "text": "The measurements of the city are: four thousand five hundred cubits on the north side, four thousand five hundred on the south, four thousand five hundred on the east, and four thousand five hundred on the west.",
      "links": "",
      "comment": "A perfectly square city hints at completion and perfection, reinforcing biblical symbolism of order (Rev. 21:16)."
    },
    {
      "pk": 1948317,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 17,
      "text": "The city shall have open land: two hundred fifty cubits on the north, two hundred fifty cubits on the south, two hundred fifty cubits on the east, and two hundred fifty cubits on the west.",
      "links": "",
      "comment": "Open space signifies provision and boundaries, a vision of God's care for His people."
    },
    {
      "pk": 1948318,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 18,
      "text": "What is left over, to the east ten thousand and to the west ten thousand, adjacent to the holy offering, will be for the workers of the city, as pasture land for them.",
      "links": "",
      "comment": "Ensures that all people, including workers, are provided for—a biblical ethic of charity and equity."
    },
    {
      "pk": 1948319,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 19,
      "text": "Those who work in the city, from all the tribes of Israel, shall cultivate this land.",
      "links": "",
      "comment": "Unity among all tribes, expressing the gathering and cooperation of God’s people as a single body."
    },
    {
      "pk": 1948320,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 20,
      "text": "All the holy offering, together with the property of the city, shall be a square, twenty-five thousand cubits by twenty-five thousand. You shall set apart the holy offering together with the property of the city.",
      "links": "",
      "comment": "Sacred and communal portions together, foreshadowing the integration of spiritual and earthly life."
    },
    {
      "pk": 1948321,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 21,
      "text": "From the remaining areas on both sides of the holy offering, running along the border of the holy offering and the city property, toward the west and east, correspond with the tribal portions. These are for the prince, and shall be set apart as holy offerings, and the sanctuary of the LORD shall be in its midst.",
      "links": "<a href='/AIV/26/45/7'>Ezek. 45:7</a>",
      "comment": "A distinct inheritance for the prince echoes both royal and priestly leadership, as seen fulfilled in Christ."
    },
    {
      "pk": 1948322,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 22,
      "text": "So the property of the Levites and the property of the city are in the midst of the prince’s land. The portion between Judah’s and Benjamin’s boundaries shall belong to the prince.",
      "links": "<a href='/AIV/26/45/7'>Ezek. 45:7</a>",
      "comment": "Land for the prince places leadership at the intersection of worship and civil life."
    },
    {
      "pk": 1948323,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 23,
      "text": "As for the rest of the tribes: From the east side to the west, Benjamin—one portion.",
      "links": "<a href='/AIV/06/18/11'>Josh. 18:11</a>",
      "comment": "Benjamin is placed near the sanctuary, reminding us of Jerusalem’s spiritual center."
    },
    {
      "pk": 1948324,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 24,
      "text": "Next to Benjamin’s border, from the east side to the west, Simeon—one portion.",
      "links": "<a href='/AIV/06/19/1'>Josh. 19:1</a>",
      "comment": "Simeon, once scattered, is now unified—an image of restoration."
    },
    {
      "pk": 1948325,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 25,
      "text": "Next to Simeon's border, from the east side to the west, Issachar—one portion.",
      "links": "<a href='/AIV/06/19/17'>Josh. 19:17</a>",
      "comment": "Every tribe has its place—an ordered inheritance foreshadowing spiritual equality."
    },
    {
      "pk": 1948326,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 26,
      "text": "Next to Issachar's border, from the east side to the west, Zebulun—one portion.",
      "links": "<a href='/AIV/06/19/10'>Josh. 19:10</a>",
      "comment": "Zebulun’s location further highlights the thoroughness of the restoration."
    },
    {
      "pk": 1948327,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 27,
      "text": "Next to Zebulun’s border, from the east side to the west, Gad—one portion.",
      "links": "<a href='/AIV/06/13/24'>Josh. 13:24</a>",
      "comment": "Gad finishes the list; every tribe, once disparate, now brought together under divine order."
    },
    {
      "pk": 1948328,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 28,
      "text": "Next to Gad's border, east to the border southward, shall be at Tamar, up to the waters of Meribah Kadesh, to the Brook of Egypt, and as far as the Mediterranean Sea.",
      "links": "<a href='/AIV/04/20/13'>Num. 20:13</a>",
      "comment": "Boundary details demonstrate fulfillment of ancient promises and inheritance."
    },
    {
      "pk": 1948329,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 29,
      "text": "This is the land you shall divide as an inheritance among the tribes of Israel, and these are their allotted portions, declares the Lord GOD.",
      "links": "<a href='/AIV/04/34/13'>Num. 34:13</a>",
      "comment": "A final listing—the land is given by God, a perpetual inheritance and promise of unity."
    },
    {
      "pk": 1948330,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 30,
      "text": "These are the exits of the city. On the north side, measuring four thousand five hundred cubits,",
      "links": "",
      "comment": "Focus shifts to the city’s gates, a symbol of openness and welcome."
    },
    {
      "pk": 1948331,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 31,
      "text": "The gates of the city shall be named after the tribes of Israel, three gates facing north: the gate of Reuben, the gate of Judah, and the gate of Levi.",
      "links": "<a href='/AIV/66/21/12'>Rev. 21:12</a>",
      "comment": "The naming of gates aligns with the vision of New Jerusalem—God’s people gathered under a single name."
    },
    {
      "pk": 1948332,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 32,
      "text": "On the east side, four thousand five hundred cubits, with three gates: the gate of Joseph, the gate of Benjamin, and the gate of Dan.",
      "links": "<a href='/AIV/66/21/13'>Rev. 21:13</a>",
      "comment": "Even tribes with complex histories receive honor and place—the fullness of redemption."
    },
    {
      "pk": 1948333,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 33,
      "text": "On the south side, four thousand five hundred cubits, three gates: the gate of Simeon, the gate of Issachar, and the gate of Zebulun.",
      "links": "",
      "comment": "South-side gates retain the theme of complete inclusion."
    },
    {
      "pk": 1948334,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 34,
      "text": "On the west side, four thousand five hundred cubits, three gates: the gate of Gad, the gate of Asher, and the gate of Naphtali.",
      "links": "",
      "comment": "West-side gates complete the vision of wholeness and historic memory."
    },
    {
      "pk": 1948335,
      "translation": "AIV",
      "book": 26,
      "chapter": 48,
      "verse": 35,
      "text": "The circumference of the city shall be eighteen thousand cubits. And the name of the city from that day shall be, 'The LORD is there.'",
      "links": "<a href='/AIV/26/43/7'>Ezek. 43:7</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "The divine presence is the crowning feature—a literal and spiritual fulfilment in Christ (‘God with us’), anticipated in the future heavenly Jerusalem (see Rev. 21). The unity of worship and dwelling is highlighted as the ultimate hope."
    }
  ],
  "translatedAt": "2025-12-23T07:12:09.809Z"
}