{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 42,
  "verses": [
    {
      "pk": 428420,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 1,
      "text": "Then he brought me out to the outer court, toward the north, and he led me to the chamber which was opposite the separate area and which was opposite the building to the north.",
      "links": "<a href='/AIV/26/41/12'>Ezek. 41:12</a>",
      "comment": "This verse continues Ezekiel’s guided tour through the visionary temple, showing the importance of consecrated spaces."
    },
    {
      "pk": 428421,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 2,
      "text": "The length of the chamber to the north was one hundred cubits, and the width fifty cubits, facing the courtyard. On the east, there was an entrance, leading into the inner court.",
      "links": "<a href='/AIV/26/41/13'>Ezek. 41:13</a>",
      "comment": "The dimensions stress the careful order and design of God’s sanctuary, implying divine intention behind worship structure."
    },
    {
      "pk": 428422,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 3,
      "text": "Opposite the twenty cubits of the inner court, and opposite the pavement of the outer court, was gallery facing gallery in three stories.",
      "links": "<a href='/AIV/26/41/10'>Ezek. 41:10</a>",
      "comment": "Architectural details emphasize holy order and multipurpose functionality for priestly activity."
    },
    {
      "pk": 428423,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 4,
      "text": "Before the chambers was a passage, ten cubits wide inward, a way of one hundred cubits long. Their doors faced north.",
      "links": "<a href='/AIV/1/6/16'>Gen. 6:16</a>",
      "comment": "The focus on access for priests further stresses separation and sacredness in ritual spaces."
    },
    {
      "pk": 428424,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 5,
      "text": "Now the upper chambers were narrower, because the galleries took more space from them than from the lower and middle levels of the building.",
      "links": "",
      "comment": "The design shows thoughtful use of space to accommodate various needs—practicality for priestly service."
    },
    {
      "pk": 428425,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 6,
      "text": "For they were in three stories and had no pillars like the pillars of the courts; so the upper levels were set back compared to the lower and middle ones.",
      "links": "<a href='/AIV/11/6/6'>1 Kings 6:6</a>",
      "comment": "The architectural retreat of upper stories visually distinguishes them, underscoring sacred hierarchy."
    },
    {
      "pk": 428426,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 7,
      "text": "The wall that was outside, beside the chambers, toward the outer court, facing the chambers, was fifty cubits long.",
      "links": "",
      "comment": "Structural walls provide physical and symbolic separation essential to ritual purity."
    },
    {
      "pk": 428427,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 8,
      "text": "For the chambers along the outer court were fifty cubits long, while those facing the temple were one hundred cubits long.",
      "links": "",
      "comment": "The difference in length hints at deeper significance—approaching the temple brings one closer to holiness."
    },
    {
      "pk": 428428,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 9,
      "text": "Below these chambers was an entrance on the east side, as one enters them from the outer court.",
      "links": "",
      "comment": "Carefully assigned entrances show intentional movement toward sacred space."
    },
    {
      "pk": 428429,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 10,
      "text": "In the width of the wall of the court toward the east, facing the separate area and facing the building, there were chambers.",
      "links": "<a href='/AIV/26/41/12'>Ezek. 41:12</a>",
      "comment": "The specific location of chambers indicates readiness and support for ongoing worship."
    },
    {
      "pk": 428430,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 11,
      "text": "A passage was before them, just like the chambers which were on the north; as long and as wide as the others, with the same exits, arrangements, and doors.",
      "links": "",
      "comment": "These consistent layouts mirror the order and harmony God requires in worship."
    },
    {
      "pk": 428431,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 12,
      "text": "Like the doors of the chambers which were toward the south, one door was at the head of the passage, in front of the wall, the way one enters from the east.",
      "links": "",
      "comment": "Uniformity in design signals unity and equality among the priests using these chambers."
    },
    {
      "pk": 428432,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 13,
      "text": "Then he said to me, \"The north and south chambers which face the separate area are holy chambers, where the priests who approach the LORD shall eat the most holy offerings. There they shall place the most holy offerings—the grain offering, the sin offering, and the guilt offering—for the place is holy.\"",
      "links": "<a href='/AIV/3/6/16'>Lev. 6:16</a>; <a href='/AIV/4/18/10'>Num. 18:10</a>",
      "comment": "This verse describes set-apart spaces for priestly communion with God, reflecting the importance of sacred tradition and ordained mediation. Compare also with <a href='/AIV/5/18/1-8'>Deut. 18:1–8</a> for the priestly role."
    },
    {
      "pk": 428433,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 14,
      "text": "\"When the priests enter, they shall not go out of the Holy Place into the outer court without laying aside the garments in which they minister, for these are holy. They shall put on other garments before they approach what concerns the people.\"",
      "links": "<a href='/AIV/2/28/43'>Ex. 28:43</a>; <a href='/AIV/4/20/26'>Num. 20:26</a>",
      "comment": "Special garments highlight the priest’s consecration and reverence; note the separation between sacred duties and the people."
    },
    {
      "pk": 428434,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 15,
      "text": "Now when he had finished measuring the inner house, he brought me out by way of the east gate and measured it all around.",
      "links": "",
      "comment": "The east gate is a symbol of new beginnings and divine encounter, see also <a href='/AIV/40/24/27'>Matt. 24:27</a>."
    },
    {
      "pk": 428435,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 16,
      "text": "He measured the east side with the measuring reed—five hundred cubits by the measuring reed all around.",
      "links": "",
      "comment": "The number five hundred (see also <a href='/AIV/26/40/5'>Ezek. 40:5</a>) represents fullness and completeness in biblical numerology."
    },
    {
      "pk": 428436,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 17,
      "text": "He measured the north side—five hundred cubits by the measuring reed all around.",
      "links": "",
      "comment": "Repetition of the measurements underscores precision and meaning in God's design."
    },
    {
      "pk": 428437,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 18,
      "text": "He measured the south side—five hundred cubits by the measuring reed.",
      "links": "",
      "comment": "All sides are equal, symbolizing balance and the universal reach of holiness."
    },
    {
      "pk": 428438,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 19,
      "text": "He turned and measured the west side—five hundred cubits by the measuring reed.",
      "links": "",
      "comment": "The complete circuit around the temple alludes to the wholeness and protection God provides for His people."
    },
    {
      "pk": 428439,
      "translation": "AIV",
      "book": 26,
      "chapter": 42,
      "verse": 20,
      "text": "He measured it on all four sides. It had a wall all around, five hundred cubits long and five hundred cubits wide, to make a separation between the holy and the common.",
      "links": "<a href='/AIV/3/10/10'>Lev. 10:10</a>; <a href='/AIV/58/9/24'>Heb. 9:24</a>",
      "comment": "The wall represents the necessary distinction between what is sacred and what is not. In the New Testament, the Holy of Holies is fulfilled in the offering of Christ, whose sacrifice grants true access to God (<a href='/AIV/40/27/51'>Matt. 27:51</a>)."
    }
  ],
  "translatedAt": "2025-12-23T07:08:57.646Z"
}