{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 36,
  "verses": [
    {
      "pk": 3636001,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 1,
      "text": "You, son of man, prophesy to the mountains of Israel and say, ‘Mountains of Israel, hear the word of the Lord!’",
      "links": "<a href='/AIV/26/6/2'>Ezek. 6:2</a>",
      "comment": "God addresses the land itself as a witness to His coming actions. Throughout Ezekiel and the prophets, the land itself symbolizes the blessings and judgments upon the people."
    },
    {
      "pk": 3636002,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 2,
      "text": "The Lord God says: Because the enemy has said concerning you, 'Aha! Even the ancient heights have become our possession',",
      "links": "<a href='/AIV/25/2/16'>Lam. 2:16</a>; <a href='/AIV/26/35/10'>Ezek. 35:10</a>",
      "comment": "The 'ancient heights' may refer to Israel's high places, but also to the historical and spiritual significance of the land, claimed by enemies."
    },
    {
      "pk": 3636003,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 3,
      "text": "Therefore prophesy and say, 'This is what the Lord God says: Because they have made you desolate and trampled you from every side, so that you became a possession of the rest of the nations, and you have been talked about and mocked by the people.'",
      "links": "<a href='/AIV/26/25/3'>Ezek. 25:3</a>",
      "comment": "God recognizes Israel's suffering and loss of dignity among the nations, a situation He will soon reverse."
    },
    {
      "pk": 3636004,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 4,
      "text": "Therefore, mountains of Israel, hear the word of the Lord God: This is what the Lord God says to the mountains, the hills, the streams, and valleys, the desolate ruins and the abandoned cities, which have become plunder and ridicule to the rest of the nations around;",
      "links": "<a href='/AIV/26/6/3'>Ezek. 6:3</a>",
      "comment": "Emphasizing the totality of the land's devastation, but also foreshadowing coming restoration."
    },
    {
      "pk": 3636005,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 5,
      "text": "Therefore this is what the Lord God says: In my burning zeal I have spoken against the rest of the nations and against all Edom, who seized my land with joyful hearts and utter contempt, driving its people out to plunder it.",
      "links": "<a href='/AIV/36/2/9-10'>Zeph. 2:9–10</a>; <a href='/AIV/26/25/12'>Ezek. 25:12</a>",
      "comment": "God’s ‘zeal’ shows His personal investment in the fate of His people and land, responding with justice to the wrongs done by enemies."
    },
    {
      "pk": 3636006,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 6,
      "text": "Therefore prophesy concerning the land of Israel and say to the mountains and hills, the streams and valleys, ‘This is what the Lord God says: I have spoken in my jealousy and anger because you have suffered the disgrace of the nations.’",
      "links": "<a href='/AIV/26/34/29'>Ezek. 34:29</a>",
      "comment": "The theme of God’s jealousy here demonstrates His covenantal love. Jealousy implies a union and faithfulness, prefiguring the deep relationship between God and His people."
    },
    {
      "pk": 3636007,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 7,
      "text": "Therefore this is what the Lord God says: I promise with uplifted hand that the nations around you will themselves suffer disgrace.",
      "links": "<a href='/AIV/26/34/28-29'>Ezek. 34:28–29</a>",
      "comment": "The ‘uplifted hand’ is a solemn oath; God is pictured as swearing to act—underscoring the trustworthiness of His word."
    },
    {
      "pk": 3636008,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 8,
      "text": "But you, mountains of Israel, will grow branches and yield your fruit for my people Israel, for they will soon come home.",
      "links": "<a href='/AIV/26/34/27'>Ezek. 34:27</a>; <a href='/AIV/3/26/4'>Lev. 26:4</a>",
      "comment": "Fruitfulness of the land is an outward sign of God’s blessing and the people’s restoration. This mirrors the promised land’s role throughout scripture as a sign of God’s faithfulness."
    },
    {
      "pk": 3636009,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 9,
      "text": "For indeed, I am with you; I will turn to you, and you will be tilled and sown.",
      "links": "<a href='/AIV/26/34/11'>Ezek. 34:11</a>",
      "comment": "God’s presence is restored, another sign of redemption. Note the parallel to Eden’s restoration themes and God's initiative in the process."
    },
    {
      "pk": 3636010,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 10,
      "text": "I will multiply people upon you, all the house of Israel, all of it. The cities shall be inhabited and the ruins rebuilt.",
      "links": "<a href='/AIV/26/36/33-36'>Ezek. 36:33–36</a>",
      "comment": "This restoration includes both people and places. God's restoration is both communal and individual—mirrored in the later restoration of the people spiritually and corporately."
    },
    {
      "pk": 3636011,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 11,
      "text": "I will multiply people and animals upon you, and they will increase and be fruitful. I will cause you to be inhabited as you were before, and I will do better for you than at your beginnings. Then you will know that I am the Lord.",
      "links": "<a href='/AIV/3/26/9'>Lev. 26:9</a>; <a href='/AIV/26/34/27-31'>Ezek. 34:27–31</a>",
      "comment": "There is a promise of greater future glory. The fulfillment goes beyond mere return, indicating a spiritual renewal, connected thematically with John 10:10 where Christ promises abundant life."
    },
    {
      "pk": 3636012,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 12,
      "text": "I will cause people—my people Israel—to walk upon you; they will possess you, and you will be their inheritance. You will never again deprive them of children.",
      "links": "<a href='/AIV/5/11/9'>Deut. 11:9</a>",
      "comment": "Return to inheritance language—a strong theme of God’s promises to Abraham and his descendants, fulfilled in the unity and faithfulness of God’s people."
    },
    {
      "pk": 3636013,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 13,
      "text": "This is what the Lord God says: Because people say to you, 'You devour men and deprive your nation of children,'",
      "links": "<a href='/AIV/4/13/32'>Num. 13:32</a>",
      "comment": "A direct reference to the language of the Israelite spies, who described Canaan as a land that ‘devours its inhabitants.’ God is about to reverse this reputation."
    },
    {
      "pk": 3636014,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 14,
      "text": "Therefore, you will no longer devour men or deprive your nation of children, says the Lord God.",
      "links": "<a href='/AIV/26/36/12'>Ezek. 36:12</a>",
      "comment": "A promise of blessing and fertility—God is undoing the curse brought about by Israel’s unfaithfulness."
    },
    {
      "pk": 3636015,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 15,
      "text": "I will no longer let you hear the insults of the nations, nor shall you bear reproach from the peoples anymore, and you will no longer cause your nation to stumble, says the Lord God.",
      "links": "<a href='/AIV/26/34/29'>Ezek. 34:29</a>",
      "comment": "God’s restoration removes shame and restores dignity, establishing the people on firm ground—themes that resonate with Christ’s saving work."
    },
    {
      "pk": 3636016,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 16,
      "text": "The word of the Lord came to me, saying:",
      "links": "",
      "comment": "A formulaic statement introducing a new message and reinforcing Ezekiel’s prophetic authority."
    },
    {
      "pk": 3636017,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 17,
      "text": "Son of man, when the house of Israel lived in their own land, they defiled it by their ways and deeds. Their conduct before me was as the impurity of a woman in her uncleanness.",
      "links": "<a href='/AIV/3/15/19'>Lev. 15:19</a>",
      "comment": "The analogy is purposely strong: unfaithfulness pollutes the land, pointing to the seriousness of sin in God’s eyes."
    },
    {
      "pk": 3636018,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 18,
      "text": "So I poured out my wrath upon them for the blood they had shed on the land and for the idols with which they had polluted it.",
      "links": "<a href='/AIV/2/20/13'>Ex. 20:13</a>; <a href='/AIV/5/32/16'>Deut. 32:16</a>",
      "comment": "The cause of exile is explicitly stated: violence and idolatry. God’s justice reacts to both moral and spiritual infidelity."
    },
    {
      "pk": 3636019,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 19,
      "text": "I scattered them among the nations, and they were dispersed through the countries. I judged them according to their ways and deeds.",
      "links": "<a href='/AIV/3/26/33'>Lev. 26:33</a>",
      "comment": "Exile is God’s righteous judgment—sovereign discipline upon a disobedient people."
    },
    {
      "pk": 3636020,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 20,
      "text": "Wherever they went among the nations, they profaned my holy name, because it was said of them, 'These are the people of the Lord, but they had to leave his land.'",
      "links": "<a href='/AIV/26/36/23'>Ezek. 36:23</a>",
      "comment": "The exile brought dishonor to God’s name among the nations. This shows the corporate relationship between God and His people: their sin affects His name."
    },
    {
      "pk": 3636021,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 21,
      "text": "But I had concern for my holy name, which the house of Israel had profaned among the nations where they went.",
      "links": "<a href='/AIV/26/20/9'>Ezek. 20:9</a>",
      "comment": "God acts for His holy name—a key concept showing His kindness is not only for people’s sake but for His glory. Later, Christ’s name is glorified in the Church."
    },
    {
      "pk": 3636022,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 22,
      "text": "Therefore say to the house of Israel, This is what the Lord God says: It is not for your sake, O house of Israel, that I am about to act, but for the sake of my holy name, which you have profaned among the nations where you went.",
      "links": "<a href='/AIV/26/36/32'>Ezek. 36:32</a>; <a href='/AIV/26/20/44'>Ezek. 20:44</a>",
      "comment": "Salvation is ultimately for God’s glory. See Romans 11:36 for the New Testament echo. Restoration is by grace, not merit—a central Christian doctrine."
    },
    {
      "pk": 3636023,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 23,
      "text": "I will sanctify my great name, which has been profaned among the nations, and the nations will know that I am the Lord, says the Lord God, when through you I show myself holy before their eyes.",
      "links": "<a href='/AIV/19/46/10'>Ps. 46:10</a>; <a href='/AIV/26/20/41-42'>Ezek. 20:41–42</a>",
      "comment": "Sanctifying God’s name is a key theme, echoed in the Lord’s Prayer (“hallowed be thy name,” Matt. 6:9). God’s holiness is revealed through His redemptive action."
    },
    {
      "pk": 3636024,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 24,
      "text": "For I will take you from among the nations, and gather you out of all the countries, and bring you back to your own land.",
      "links": "<a href='/AIV/26/11/17'>Ezek. 11:17</a>; <a href='/AIV/23/43/5'>Isa. 43:5</a>",
      "comment": "The promise of gathering from the nations prefigures a global restoration—a pattern that the New Testament recognizes as being fulfilled in Christ bringing together people from every nation (cf. John 11:52)."
    },
    {
      "pk": 3636025,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 25,
      "text": "I will sprinkle clean water on you, and you shall be clean from all your uncleanness and from all your idols I will cleanse you.",
      "links": "<a href='/AIV/3/16/4'>Lev. 16:4</a>; <a href='/AIV/43/3/5'>John 3:5</a>",
      "comment": "Verse 25 is widely recognized as foreshadowing the sacrament of baptism—cleansing by water and the Spirit (see John 3:5, Titus 3:5). This spiritual renewal is foundational to Christian initiation and the life of grace."
    },
    {
      "pk": 3636026,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 26,
      "text": "And I will give you a new heart, and a new spirit I will put within you. I will remove the heart of stone from your flesh and give you a heart of flesh.",
      "links": "<a href='/AIV/24/31/33'>Jer. 31:33</a>; <a href='/AIV/19/51/10'>Ps. 51:10</a>",
      "comment": "God’s action transforms people inwardly—a new heart and spirit are necessary for true faith. See Hebrews 8:10 for similar language about God's law written on hearts."
    },
    {
      "pk": 3636027,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 27,
      "text": "And I will put my Spirit within you, and cause you to walk in my statutes and be careful to obey my rules.",
      "links": "<a href='/AIV/29/2/28'>Joel 2:28</a>; <a href='/AIV/43/14/17'>John 14:17</a>",
      "comment": "The indwelling Spirit empowers believers to fulfill God’s will. This indwelling is foundational to the Church, which is the temple of the Holy Spirit (see 1 Cor. 6:19)."
    },
    {
      "pk": 3636028,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 28,
      "text": "You will dwell in the land that I gave to your fathers, and you will be my people, and I will be your God.",
      "links": "<a href='/AIV/3/26/12'>Lev. 26:12</a>; <a href='/AIV/24/30/22'>Jer. 30:22</a>",
      "comment": "'You will be my people, and I will be your God' is a central promise in biblical covenants, brought to fulfillment in the unity of God’s one people in Christ."
    },
    {
      "pk": 3636029,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 29,
      "text": "And I will deliver you from all your uncleanness. I will summon grain and make it abundant, and I will not bring famine upon you.",
      "links": "<a href='/AIV/3/26/4-5'>Lev. 26:4–5</a>",
      "comment": "Material blessing follows spiritual renewal, anticipating the abundant life that Christ would bring (cf. John 10:10)."
    },
    {
      "pk": 3636030,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 30,
      "text": "I will multiply the fruit of the trees and the produce of the fields, so that you will never again suffer the reproach of famine among the nations.",
      "links": "<a href='/AIV/26/34/27-29'>Ezek. 34:27–29</a>",
      "comment": "God removes sources of shame, both physical and spiritual. This points to the restoration of dignity in Christ."
    },
    {
      "pk": 3636031,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 31,
      "text": "Then you will remember your evil ways and your deeds that were not good, and you will loathe yourselves for your sins and detestable practices.",
      "links": "<a href='/AIV/19/51/3'>Ps. 51:3</a>",
      "comment": "True repentance follows God’s grace, leading to humility and conversion of heart."
    },
    {
      "pk": 3636032,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 32,
      "text": "It is not for your sake that I am doing this, declares the Lord God; let that be known to you. Be ashamed and confounded for your ways, O house of Israel.",
      "links": "<a href='/AIV/26/36/22'>Ezek. 36:22</a>",
      "comment": "Grace is undeserved, highlighting God’s mercy over human merit—a principle associated with the necessity of repentance and forgiveness."
    },
    {
      "pk": 3636033,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 33,
      "text": "Thus says the Lord God: On the day that I cleanse you from all your sins, I will cause the cities to be inhabited, and the ruins shall be rebuilt.",
      "links": "<a href='/AIV/26/36/10'>Ezek. 36:10</a>",
      "comment": "Spiritual cleansing precedes visible restoration. This foreshadows the ‘new creation’ in Christ (2 Cor. 5:17)."
    },
    {
      "pk": 3636034,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 34,
      "text": "The desolate land shall be tilled, instead of lying desolate in the sight of all who passed by.",
      "links": "<a href='/AIV/26/36/9'>Ezek. 36:9</a>",
      "comment": "A sign both to Israel and the nations: God’s restoration is visible and tangible."
    },
    {
      "pk": 3636035,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 35,
      "text": "And they will say, ‘This land that was desolate has become like the garden of Eden. And the cities that were ruined, desolate, and destroyed are now fortified and inhabited.’",
      "links": "<a href='/AIV/1/2/8'>Gen. 2:8</a>; <a href='/AIV/23/51/3'>Isa. 51:3</a>",
      "comment": "The allusion to Eden recalls the fullness and harmony intended for creation. The Church Fathers often interpret such restoration as typological of the renewed creation in Christ."
    },
    {
      "pk": 3636036,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 36,
      "text": "Then the nations that remain around you shall know that I, the Lord, have rebuilt what was ruined and planted what was desolate. I, the Lord, have spoken, and I will do it.",
      "links": "<a href='/AIV/26/36/23'>Ezek. 36:23</a>",
      "comment": "God’s faithfulness is a witness to the world. His spoken word is creative and effective, paralleling the authority Christ demonstrates in the Gospels."
    },
    {
      "pk": 3636037,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 37,
      "text": "Thus says the Lord God: I will also let the house of Israel ask me to do this for them: to multiply them like a flock of people.",
      "links": "<a href='/AIV/19/50/15'>Ps. 50:15</a>",
      "comment": "God invites prayerful cooperation with His will—the participation of the people in His work is foundational to biblical faith, hinting at communal intercession."
    },
    {
      "pk": 3636038,
      "translation": "AIV",
      "book": 26,
      "chapter": 36,
      "verse": 38,
      "text": "Like the flock for sacrifices, like the flock at Jerusalem during her appointed feasts, so shall the ruined cities be filled with flocks of people. Then they will know that I am the Lord.",
      "links": "<a href='/AIV/2/12/3-6'>Ex. 12:3–6</a>; <a href='/AIV/24/33/11'>Jer. 33:11</a>",
      "comment": "The image of sacrificial flocks and festival gatherings points to both worship and joyful assembly. This prophetic vision is fulfilled partly in restored Israel, and ultimately in the multitude redeemed to worship in unity under God's shepherd."
    }
  ],
  "translatedAt": "2025-12-23T07:05:50.187Z"
}