{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 19,
  "verses": [
    {
      "pk": 2041901,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 1,
      "text": "As for you, raise a lamentation for the princes of Israel;",
      "links": "<a href='/AIV/25/2/15'>Lamentations 2:15</a>; <a href='/AIV/26/27/2'>Ezekiel 27:2</a>",
      "comment": "Ezekiel is instructed to mourn for Israel's rulers, which sets the tone of prophecy as both warning and sorrow. Lamentation is a liturgical action, signaling communal grief similar to that found in other biblical laments."
    },
    {
      "pk": 2041902,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 2,
      "text": "and say, ‘What was your mother? A lioness among lions! She lay down among the young lions; she raised her cubs.",
      "links": "<a href='/AIV/01/49/9'>Genesis 49:9</a>; <a href='/AIV/07/14/5'>Judges 14:5</a>",
      "comment": "Here, the mother symbolizes Israel or specifically the royal line, referencing early Genesis imagery. The lion motif highlights strength and kingship."
    },
    {
      "pk": 2041903,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 3,
      "text": "She brought up one of her cubs, and he became a strong lion. He learned to tear prey; he devoured people.",
      "links": "<a href='/AIV/26/17/4'>Ezekiel 17:4</a>; <a href='/AIV/12/23/37'>2 Kings 23:37</a>",
      "comment": "This likely refers to Jehoahaz, a king whose reign was marked by violence and who was ultimately weak in the face of foreign powers. The lion eating people points to ruling harshly over Israel."
    },
    {
      "pk": 2041904,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 4,
      "text": "Then the nations heard about him; he was captured in their pit, and they brought him with hooks to the land of Egypt.",
      "links": "<a href='/AIV/12/23/33'>2 Kings 23:33</a>; <a href='/AIV/26/32/2'>Ezekiel 32:2</a>",
      "comment": "This is an historical account of Jehoahaz being taken captive by Pharaoh Neco. The imagery of hooks emphasizes humiliation and defeat, drawing liturgical parallels to being removed from God's presence."
    },
    {
      "pk": 2041905,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 5,
      "text": "When she saw that her hope was lost, her expectation gone, she took another of her cubs and made him a strong lion.",
      "links": "<a href='/AIV/12/23/34'>2 Kings 23:34</a>; <a href='/AIV/26/17/15'>Ezekiel 17:15</a>",
      "comment": "This refers to the next king, Jehoiakim, who was raised in the shadow of previous failure. The succession continues, highlighting dynastic hopes even amidst despair."
    },
    {
      "pk": 2041906,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 6,
      "text": "He walked among lions; he became a strong lion, learned to tear the prey, and devoured people.",
      "links": "<a href='/AIV/26/17/6'>Ezekiel 17:6</a>; <a href='/AIV/19/7/2'>Psalm 7:2</a>",
      "comment": "Jehoiakim, like his predecessor, sought strength through violence, indicating persistent unrighteous kingship, showcasing a repeated failure in leadership."
    },
    {
      "pk": 2041907,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 7,
      "text": "He destroyed their strongholds and laid waste their cities; the land and all who were in it were appalled at the sound of his roaring.",
      "links": "<a href='/AIV/12/24/2'>2 Kings 24:2</a>; <a href='/AIV/24/22/17'>Jeremiah 22:17</a>",
      "comment": "Jehoiakim's reign was marked by destruction not only of physical cities but also of the moral and spiritual fiber of Israel, echoing the warnings of Jeremiah."
    },
    {
      "pk": 2041908,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 8,
      "text": "Then the nations gathered together against him; he was surrounded in their pit. They spread their net over him. He was captured in their trap.",
      "links": "<a href='/AIV/12/24/6'>2 Kings 24:6</a>; <a href='/AIV/26/12/13'>Ezekiel 12:13</a>",
      "comment": "A direct reference to Babylon's attack and the captivity of the king. This language reflects predestination and the inevitable consequences of rebellion against God's order—a theme with spiritual resonance regarding submission to God's plan."
    },
    {
      "pk": 2041909,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 9,
      "text": "With hooks they put him in a cage and brought him to the king of Babylon. They brought him into the strongholds, so his roar was no longer heard on the mountains of Israel.",
      "links": "<a href='/AIV/12/24/15'>2 Kings 24:15</a>; <a href='/AIV/26/17/20'>Ezekiel 17:20</a>",
      "comment": "The captivity of Jehoiachin to Babylon fulfilled prophecy and symbolizes the silencing of unrighteous leadership, opening prophetic hope for the righteous king to come—one who would restore true worship and order."
    },
    {
      "pk": 2041910,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 10,
      "text": "Your mother was like a vine in your vineyard, planted by the waters; fruitful and full of branches because of abundant water.",
      "links": "<a href='/AIV/19/80/8'>Psalm 80:8</a>; <a href='/AIV/23/5/1-7'>Isaiah 5:1-7</a>",
      "comment": "Shifting metaphors, Israel is now seen as a fruitful vine, an image of spiritual vitality used throughout the Old Testament, foreshadowing Christ as the true vine (John 15:1) and the importance of remaining in God's grace through visible means of communion."
    },
    {
      "pk": 2041911,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 11,
      "text": "She had strong branches, fit for scepters of rulers. Her height was exalted among the tangled branches; she stood out because of her height and many branches.",
      "links": "<a href='/AIV/19/92/12'>Psalm 92:12</a>; <a href='/AIV/26/17/6'>Ezekiel 17:6</a>",
      "comment": "Royal imagery continues, emphasizing the splendor intended for Israel’s kingly line. Yet such prominence brings responsibility to uphold spiritual truth and maintain unity."
    },
    {
      "pk": 2041912,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 12,
      "text": "But she was uprooted in fury, cast down to the ground. The east wind dried up her fruit; her strong branches were torn off and withered. Fire consumed them.",
      "links": "<a href='/AIV/26/17/10'>Ezekiel 17:10</a>; <a href='/AIV/28/13/15'>Hosea 13:15</a>",
      "comment": "God's judgment led to the destruction of the royal line, with the east wind symbolizing Babylonian conquest. Fire as judgment recalls the purification themes, paralleling God's refining work in the church."
    },
    {
      "pk": 2041913,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 13,
      "text": "Now she is planted in the wilderness, in a dry and thirsty land.",
      "links": "<a href='/AIV/05/28/65'>Deuteronomy 28:65</a>; <a href='/AIV/19/63/1'>Psalm 63:1</a>",
      "comment": "Exile imagery is used here, Israel’s spiritual desolation due to separation—recalling the need for restoration and spiritual nourishment delivered through liturgical worship and sacramental life."
    },
    {
      "pk": 2041914,
      "translation": "AIV",
      "book": 26,
      "chapter": 19,
      "verse": 14,
      "text": "Fire has gone out from the branch of her stems, devouring her fruit, so that there is no strong branch left to be a ruler’s scepter. This is a lamentation and has become a lamentation.",
      "links": "<a href='/AIV/26/17/19'>Ezekiel 17:19</a>; <a href='/AIV/24/22/24-30'>Jeremiah 22:24-30</a>",
      "comment": "The final destruction points to the end of the Davidic kings in exile, setting the stage for longing for the true King—fulfilled in the Messiah. The lament frames the expectation of God's restoration through a singular, divinely appointed ruler who unites God's people in faith and worship."
    }
  ],
  "translatedAt": "2025-12-23T06:55:29.787Z"
}