{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 7,
  "verses": [
    {
      "pk": 3407001,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 1,
      "text": "The word of the LORD came to me, saying,",
      "links": "<a href='/AIV/26/6/1'>Ezek. 6:1</a>",
      "comment": "Ezekiel frequently repeats this phrase to emphasize the authority of his prophetic message as coming directly from God."
    },
    {
      "pk": 3407002,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 2,
      "text": "Son of man, this is what the Lord GOD says to the land of Israel: An end! The end has come upon the four corners of the land.",
      "links": "<a href='/AIV/26/21/2'>Ezek. 21:2</a>; <a href='/AIV/31/1/15'>Obad. 1:15</a>",
      "comment": "The 'four corners' refers to the totality of the land, signaling completeness in judgment. The theme of 'the end' here anticipates apocalyptic motifs later seen in New Testament prophecy (<a href='/AIV/66/6/12-17'>Rev. 6:12-17</a>)."
    },
    {
      "pk": 3407003,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 3,
      "text": "Now the end is upon you, and I will send my anger upon you and judge you according to your ways; I will bring upon you all your abominations.",
      "links": "<a href='/AIV/26/5/11'>Ezek. 5:11</a>; <a href='/AIV/19/62/12'>Ps. 62:12</a>",
      "comment": "God’s judgment is based on the people's actions. The focus on 'ways' and 'abominations' links to the need for repentance and the reality of divine justice."
    },
    {
      "pk": 3407004,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 4,
      "text": "My eye will not spare you, nor will I have pity, but I will bring your ways upon you, and your abominations will be among you. Then you will know that I am the LORD.",
      "links": "<a href='/AIV/26/5/11'>Ezek. 5:11</a>; <a href='/AIV/26/6/7'>Ezek. 6:7</a>",
      "comment": "The refrain 'you will know that I am the LORD' is a central theme in Ezekiel, underscoring both judgment and future restoration. It subtly hints at a more sacramental understanding of knowing God."
    },
    {
      "pk": 3407005,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 5,
      "text": "This is what the Lord GOD says: Disaster after disaster! Behold, it comes.",
      "links": "<a href='/AIV/23/28/19'>Isa. 28:19</a>",
      "comment": "A powerful statement of compounding judgment meant to bring about repentance among God’s people."
    },
    {
      "pk": 3407006,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 6,
      "text": "An end has come; the end has come! It has awakened against you. Behold, it has come!",
      "links": "<a href='/AIV/26/7/2'>Ezek. 7:2</a>",
      "comment": "Reiteration for emphasis. The finality of judgment presses the listener to consider the need for spiritual vigilance and readiness."
    },
    {
      "pk": 3407007,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 7,
      "text": "Doom has come upon you, O inhabitants of the land. The time has come; the day is near, a day of panic, not of rejoicing on the mountains.",
      "links": "<a href='/AIV/26/30/3'>Ezek. 30:3</a>",
      "comment": "The phrase 'day is near' has echoes in New Testament warnings about the coming Day of the Lord (see <a href='/AIV/52/5/2'>1 Thess. 5:2</a>), showing consistency in God’s justice."
    },
    {
      "pk": 3407008,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 8,
      "text": "Now I will soon pour out my wrath upon you, and spend my anger against you, and judge you according to your ways; I will bring upon you all your abominations.",
      "links": "<a href='/AIV/33/1/7'>Mic. 1:7</a>",
      "comment": "This repetition emphasizes both the certainty and the righteousness of divine judgment. Historically, such language points to the exile as God’s corrective discipline."
    },
    {
      "pk": 3407009,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 9,
      "text": "My eye will not spare, nor will I have pity. I will repay you according to your ways, and your abominations will be among you. Then you will know that I am the LORD who strikes.",
      "links": "<a href='/AIV/19/89/32'>Ps. 89:32</a>",
      "comment": "A reminder of God's personal involvement in judgment. Spiritual meaning: all discipline aims at restoring His people to Himself."
    },
    {
      "pk": 3407010,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 10,
      "text": "Behold, the day! Behold, it comes! Doom has burst forth; the rod has blossomed, pride has budded.",
      "links": "<a href='/AIV/19/110/2'>Ps. 110:2</a>",
      "comment": "The 'rod' symbolizes authority and judgment. In Christian thought, the flowering rod can also point typologically to the just Rule who is to come (<a href='/AIV/04/17/8'>Num. 17:8</a>)."
    },
    {
      "pk": 3407011,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 11,
      "text": "Violence has grown up into a rod of wickedness. None of them shall remain, none of their people, none of their wealth, nor any eminent among them.",
      "links": "<a href='/AIV/19/37/35-36'>Ps. 37:35-36</a>",
      "comment": "The consequences of sin reach all classes—showing the equalizing effect of God’s judgment."
    },
    {
      "pk": 3407012,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 12,
      "text": "The time has come, the day draws near. Let not the buyer rejoice, nor the seller mourn, for wrath is upon all their wealth.",
      "links": "<a href='/AIV/23/24/2'>Isa. 24:2</a>",
      "comment": "The collapse of economic structures signals the futility of relying on material security—a theme Christ also addresses (<a href='/AIV/40/6/19-21'>Matt. 6:19-21</a>)."
    },
    {
      "pk": 3407013,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 13,
      "text": "For the seller shall not return to what he has sold, while they are still alive. For the vision concerns all their crowd; it shall not turn back. Because of his guilt, none will preserve his life.",
      "links": "<a href='/AIV/03/25/24-28'>Lev. 25:24-28</a>",
      "comment": "Normally family land was redeemed, but now God overturns all ordinary hope. The severity of judgment here points to the reality of divine justice. In Christian reflection, such reversals anticipate the spiritual renewal brought by Christ."
    },
    {
      "pk": 3407014,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 14,
      "text": "They have blown the trumpet and made everything ready, but no one goes to battle, for my wrath is upon all their crowd.",
      "links": "<a href='/AIV/24/6/1'>Jer. 6:1</a>",
      "comment": "The trumpet signified preparation, but in vain—raising the theme that human strength cannot avert divine judgment (<a href='/AIV/19/127/1'>Ps. 127:1</a>)."
    },
    {
      "pk": 3407015,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 15,
      "text": "The sword is outside; pestilence and famine are within. Whoever is in the field will die by the sword, and whoever is in the city, famine and pestilence will consume him.",
      "links": "<a href='/AIV/26/5/12'>Ezek. 5:12</a>",
      "comment": "This verse echoes covenant curses for unfaithfulness (<a href='/AIV/03/26/25'>Lev. 26:25</a>), demonstrating God's fidelity to His covenant promises, both for blessing and curse."
    },
    {
      "pk": 3407016,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 16,
      "text": "And if any survive and escape, they will be on the mountains, like doves of the valleys, all of them mourning, each for his own iniquity.",
      "links": "<a href='/AIV/19/55/6'>Ps. 55:6</a>",
      "comment": "Mourning for sin signals true repentance, which is repeatedly called for throughout Scripture (<a href='/AIV/19/51/17'>Ps. 51:17</a>). Genuine contrition is required for restoration—foundational for reconciliation with God."
    },
    {
      "pk": 3407017,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 17,
      "text": "All hands will be weak, and all knees will be like water.",
      "links": "<a href='/AIV/23/13/7'>Isa. 13:7</a>; <a href='/AIV/27/5/6'>Dan. 5:6</a>",
      "comment": "This vivid image conveys utter terror and helplessness—the proper human posture before God’s might."
    },
    {
      "pk": 3407018,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 18,
      "text": "They will put on sackcloth, and horror will cover them. Shame will be on every face, and all their heads will be shaved.",
      "links": "<a href='/AIV/23/15/2'>Isa. 15:2</a>",
      "comment": "Mourning rituals are depicted. The external signs reflect the deep interior horror at separation from God—underlining the value of outward acts to manifest repentance."
    },
    {
      "pk": 3407019,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 19,
      "text": "They will cast their silver into the streets, and their gold will be as an unclean thing. Their silver and gold will not save them in the day of the LORD's wrath. They cannot satisfy their hunger or fill their stomachs with it, for it was the stumbling block of their iniquity.",
      "links": "<a href='/AIV/19/52/7'>Ps. 52:7</a>; <a href='/AIV/36/1/18'>Zeph. 1:18</a>",
      "comment": "Treasure is useless before God's judgment. Jesus later teaches that only treasures in heaven endure (<a href='/AIV/40/6/21'>Matt. 6:21</a>)."
    },
    {
      "pk": 3407020,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 20,
      "text": "They made their beautiful ornaments into pride and used them to make their detestable idols. Therefore I will make it as an unclean thing to them.",
      "links": "<a href='/AIV/26/16/17'>Ezek. 16:17</a>",
      "comment": "Misuse of God’s gifts leads to idolatry. The spiritual meaning is the call to dedicate all we receive back to God—an offering that anticipates later Christian emphasis on sacrificial worship."
    },
    {
      "pk": 3407021,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 21,
      "text": "I will give it into the hands of foreigners to be plundered, and to the wicked of the earth for spoil, and they shall profane it.",
      "links": "<a href='/AIV/26/36/19'>Ezek. 36:19</a>",
      "comment": "The loss of Temple wealth to pagans fulfills God’s warning for national sin (see <a href='/AIV/05/28/49'>Deut. 28:49</a>)."
    },
    {
      "pk": 3407022,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 22,
      "text": "I will turn my face away from them, and they shall profane my treasured place. Robbers shall enter and profane it.",
      "links": "<a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "The withdrawal of God’s presence from His house is the climax of judgment. Theologically, this prefigures Christ's cleansing of the temple and His promise of a greater, spiritual temple (<a href='/AIV/43/2/19-21'>John 2:19-21</a>)."
    },
    {
      "pk": 3407023,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 23,
      "text": "Make a chain, for the land is full of violent crime and the city is full of bloodshed.",
      "links": "<a href='/AIV/26/9/9'>Ezek. 9:9</a>",
      "comment": "The 'chain' likely signifies coming captivity. Chains and bloodshed become symbols of judgment but also of the ultimate need for redemption."
    },
    {
      "pk": 3407024,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 24,
      "text": "So I will bring the worst of the nations to take possession of their houses. I will put an end to the pride of the mighty, and their holy places shall be desecrated.",
      "links": "<a href='/AIV/03/26/31'>Lev. 26:31</a>",
      "comment": "God uses foreign nations as instruments of discipline. This pattern recurs in Scripture and calls to humility and submission to God’s ultimate authority."
    },
    {
      "pk": 3407025,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 25,
      "text": "Destruction comes; they will seek peace, but there shall be none.",
      "links": "<a href='/AIV/24/8/15'>Jer. 8:15</a>",
      "comment": "The futility of seeking peace apart from God, reminiscent of Christ’s teaching: 'Peace I leave with you; my peace I give to you' (<a href='/AIV/43/14/27'>John 14:27</a>), showing the need for reconciliation with God."
    },
    {
      "pk": 3407026,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 26,
      "text": "Disaster upon disaster will come, and rumor will follow rumor. They will seek a vision from the prophet, but the law will perish from the priest and counsel from the elders.",
      "links": "<a href='/AIV/25/2/9'>Lam. 2:9</a>",
      "comment": "When God’s judgment falls, even spiritual leaders are left without guidance, pointing to the necessity of a faithful and unbroken line of teaching authority through which God shepherds His people (<a href='/AIV/40/16/18-19'>Matt. 16:18-19</a>)."
    },
    {
      "pk": 3407027,
      "translation": "AIV",
      "book": 26,
      "chapter": 7,
      "verse": 27,
      "text": "The king will mourn, the prince will be clothed with despair, and the hands of the people in the land will tremble. According to their conduct I will deal with them, and by their judgments I will judge them. Then they will know that I am the LORD.",
      "links": "<a href='/AIV/26/6/7'>Ezek. 6:7</a>; <a href='/AIV/26/7/4'>Ezek. 7:4</a>",
      "comment": "God’s justice is impartial: leaders and people alike are judged. The refrain ‘then they will know that I am the LORD’ points forward to the ultimate revelation of God in Christ, who is the true fulfillment of knowing the LORD face to face (<a href='/AIV/43/14/9'>John 14:9</a>)."
    }
  ],
  "translatedAt": "2025-12-23T06:49:38.548Z"
}