{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 8,
  "verses": [
    {
      "pk": 2048001,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 1,
      "text": "In the sixth year, in the sixth month, on the fifth day of the month, as I sat in my house with the elders of Judah sitting before me, the hand of the Lord GOD fell upon me there.",
      "links": "<a href='/AIV/26/1/3'>Ezek. 1:3</a>; <a href='/AIV/26/3/22'>Ezek. 3:22</a>",
      "comment": "Ezekiel precisely dates his vision, anchoring it in Israel's exile history. The presence of the elders hints at his spiritual leadership among the exiles, foreshadowing the significance of apostolic succession in leading God's people in times of trial."
    },
    {
      "pk": 2048002,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 2,
      "text": "Then I looked, and saw a form that had the appearance of fire. Below what seemed to be his waist was fire, and above his waist was something shining, like gleaming metal.",
      "links": "<a href='/AIV/26/1/27'>Ezek. 1:27</a>; <a href='/AIV/66/1/15'>Rev. 1:15</a>",
      "comment": "The fiery figure recalls Ezekiel's earlier encounters with God's glory. The radiant appearance has parallels to Christ’s transfiguration and appearances in Revelation, supporting both literal and mystical interpretations of God’s majesty."
    },
    {
      "pk": 2048003,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 3,
      "text": "He stretched out what seemed to be a hand and took me by the hair of my head. The Spirit lifted me up between earth and heaven, and brought me in visions of God to Jerusalem, to the entrance of the inner gate that faces north, where the image of jealousy that provokes jealousy was set up.",
      "links": "<a href='/AIV/26/1/28'>Ezek. 1:28</a>; <a href='/AIV/26/11/1'>Ezek. 11:1</a>; <a href='/AIV/5/4/24'>Deut. 4:24</a>",
      "comment": "This dramatic transportation highlights the divine initiative and power in prophetic revelation. The 'image of jealousy' signals idolatrous worship violating God's covenant, paralleling themes of spiritual adultery discussed elsewhere."
    },
    {
      "pk": 2048004,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 4,
      "text": "And there, the glory of the God of Israel was present, just as I had seen in the valley.",
      "links": "<a href='/AIV/26/3/22'>Ezek. 3:22-23</a>; <a href='/AIV/26/1/28'>Ezek. 1:28</a>",
      "comment": "The recurring vision of divine glory underlines God's constant presence, drawing connections to earlier manifestations and reinforcing the real, rather than purely metaphorical, nature of God's involvement with His people."
    },
    {
      "pk": 2048005,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 5,
      "text": "Then he said to me, 'Son of man, lift up your eyes now toward the north.' So I lifted my eyes toward the north, and there, north of the altar gate, was this image of jealousy at the entrance.",
      "links": "<a href='/AIV/26/6/4'>Ezek. 6:4-6</a>; <a href='/AIV/11/21/26'>1 Kings 21:26</a>",
      "comment": "God instructs Ezekiel to confront the center of apostasy. The gate’s location hints at the infiltration of impurity even within the heart of worship, a warning about the dangers of corruption within the gathered assembly."
    },
    {
      "pk": 2048006,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 6,
      "text": "And he said to me, 'Son of man, do you see what they are doing? The great abominations the house of Israel is committing here, driving me far from my sanctuary. But you will see even greater abominations.'",
      "links": "<a href='/AIV/26/5/11'>Ezek. 5:11</a>; <a href='/AIV/19/79/1'>Ps. 79:1</a>",
      "comment": "God’s lament over His sanctuary points to the seriousness of sacrilege. The sanctuary represents both the physical and spiritual center of faith, connecting to Christ’s declaration of Himself as the true temple (<a href='/AIV/43/2/19'>John 2:19</a>)."
    },
    {
      "pk": 2048007,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 7,
      "text": "Then he brought me to the entrance of the court, and when I looked, I saw a hole in the wall.",
      "links": "<a href='/AIV/26/8/8'>Ezek. 8:8</a>; <a href='/AIV/26/40/5'>Ezek. 40:5</a>",
      "comment": "The imagery of a hole in the wall prepares Ezekiel to witness secret acts of impurity, evoking themes of revelation and the exposing of hidden sin."
    },
    {
      "pk": 2048008,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 8,
      "text": "He said to me, 'Son of man, dig through the wall.' So I dug through the wall, and there was a door.",
      "links": "<a href='/AIV/26/8/7'>Ezek. 8:7</a>; <a href='/AIV/26/8/9'>Ezek. 8:9</a>",
      "comment": "Ezekiel’s digging signifies uncovering spiritual realities beneath outward appearances, echoing Christ’s call to true inward conversion (<a href='/AIV/40/23/27'>Matt. 23:27</a>)."
    },
    {
      "pk": 2048009,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 9,
      "text": "And he said to me, 'Go in, and see the wicked abominations they are committing here.'",
      "links": "<a href='/AIV/26/8/6'>Ezek. 8:6</a>",
      "comment": "Ezekiel is invited to witness these hidden defilements personally, reinforcing the prophetic role of bearing witness to sin for the purpose of restoration."
    },
    {
      "pk": 2048010,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 10,
      "text": "So I went in and saw. There, engraved all around the walls, were images of every kind of creeping thing and unclean beast, and all the idols of the house of Israel.",
      "links": "<a href='/AIV/3/11/44'>Lev. 11:44</a>; <a href='/AIV/2/20/4'>Ex. 20:4</a>",
      "comment": "The images echo forbidden forms (Lev. 11), contrasting with the purity demanded of God’s people. Idolatry depicted in the sanctuary is a grave violation, spiritually separating the people from God."
    },
    {
      "pk": 2048011,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 11,
      "text": "Seventy elders of the house of Israel stood before these images, with Jaazaniah the son of Shaphan standing among them. Each held a censer in his hand, and the smoke of the incense went up.",
      "links": "<a href='/AIV/2/24/1'>Ex. 24:1</a>; <a href='/AIV/4/16/17'>Num. 16:17</a>",
      "comment": "Seventy elders recall the leaders appointed by Moses (Num. 11:16), but here they are corrupted. This highlights the need for authentic, divinely-appointed leadership capable of safeguarding sacred worship from error."
    },
    {
      "pk": 2048012,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 12,
      "text": "Then he said to me, 'Son of man, have you seen what the elders of Israel are doing in the darkness, each in his private room of images? For they say, “The LORD does not see us; the LORD has abandoned the land.”'",
      "links": "<a href='/AIV/19/94/7'>Ps. 94:7</a>; <a href='/AIV/26/9/9'>Ezek. 9:9</a>",
      "comment": "The rationalization of sin shown here—assuming God’s absence—repeats the errors of Israel’s wilderness grumbling, and stands as a warning against presumption or private interpretations of faith contrary to what has been handed on."
    },
    {
      "pk": 2048013,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 13,
      "text": "He said, 'You will see even greater abominations that they are committing.'",
      "links": "<a href='/AIV/26/8/6'>Ezek. 8:6</a>; <a href='/AIV/26/8/15'>Ezek. 8:15</a>",
      "comment": "God progressively reveals the depths of Israel's apostasy, underscoring the seriousness of communal sin and the necessity for ongoing reform and repentance."
    },
    {
      "pk": 2048014,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 14,
      "text": "Then he brought me to the entrance of the gate of the LORD’s house that is toward the north, and I saw women sitting there, weeping for Tammuz.",
      "links": "<a href='/AIV/24/7/17-18'>Jer. 7:17-18</a>",
      "comment": "The mourning for the pagan god Tammuz represents syncretism and the distortion of true worship. This passage highlights the dangers of integrating foreign practices into divinely-ordained worship."
    },
    {
      "pk": 2048015,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 15,
      "text": "He said to me, 'Have you seen this, son of man? You will see even greater abominations than these.'",
      "links": "<a href='/AIV/26/8/13'>Ezek. 8:13</a>",
      "comment": "The gradual revelation of Israel’s misdeeds spotlights the ever-present struggle against temptation and the corruption of worship, themes perennial to the life of the faithful."
    },
    {
      "pk": 2048016,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 16,
      "text": "He brought me into the inner court of the house of the LORD; and there, at the entrance of the temple of the LORD, between the porch and the altar, were about twenty-five men, with their backs to the temple of the LORD and their faces toward the east, worshiping the sun toward the east.",
      "links": "<a href='/AIV/5/4/19'>Deut. 4:19</a>",
      "comment": "Worshiping the sun with backs turned to the temple reverses the orientation of worship prescribed by God, undermining the sanctity of God’s house. The reference to ‘porch and altar’ recalls the special, sacred space for intercession, later echoed in liturgical practice in Christian worship."
    },
    {
      "pk": 2048017,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 17,
      "text": "Then he said to me, 'Have you seen this, son of man? Is it too slight a thing for the house of Judah to commit the abominations they have done here, that they have filled the land with violence and turned again to provoke me to anger? They put the branch to their nose.",
      "links": "<a href='/AIV/24/2/13'>Jer. 2:13</a>; <a href='/AIV/19/106/34-40'>Ps. 106:34-40</a>",
      "comment": "Of note is the cryptic act of ‘putting the branch to their nose,’ possibly a ritual gesture in pagan worship. The connection between liturgical transgression and social violence is made explicit, reinforcing the integral link between right worship and just living."
    },
    {
      "pk": 2048018,
      "translation": "AIV",
      "book": 26,
      "chapter": 8,
      "verse": 18,
      "text": "Therefore I will act in wrath. My eye will not pity, nor will I spare. Even though they cry out in my ears with a loud voice, I will not listen to them.'",
      "links": "<a href='/AIV/20/1/28'>Prov. 1:28</a>; <a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "Judgment is pronounced for unrepentant sin, embodying the principle that mercy is not accessible apart from repentance and restoration to true worship. This passage finds echo in the New Testament’s teaching on intercessory prayer and the necessity of sincerity before God (<a href='/AIV/59/5/16'>James 5:16</a>)."
    }
  ],
  "translatedAt": "2025-12-23T06:50:00.483Z"
}