{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 12,
  "verses": [
    {
      "pk": 33012001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/24/1'>Ezek. 24:1</a>; <a href='/AIV/24/1/11'>Jer. 1:11</a>",
      "comment": "God continues directly addressing Ezekiel, emphasizing the divine origin of the message. This formula is frequent in prophetic books and underscores Ezekiel’s role as a true prophet (cf. Amos 3:7)."
    },
    {
      "pk": 33012002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 2,
      "text": "Son of man, you dwell in the midst of a rebellious house. They have eyes to see but do not see, ears to hear but do not hear; for they are a rebellious house.",
      "links": "<a href='/AIV/23/6/9'>Isa. 6:9-10</a>; <a href='/AIV/40/13/13-15'>Matt. 13:13-15</a>; <a href='/AIV/26/2/3-7'>Ezek. 2:3-7</a>",
      "comment": "The use of 'eyes to see but do not see' connects to Isaiah’s calling in Isa. 6:9 and Jesus' use of parables (Matt. 13:13-15), showing the people’s persistent spiritual blindness. This sets the stage for prophetic sign-actions."
    },
    {
      "pk": 33012003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 3,
      "text": "Therefore, son of man, prepare your belongings for exile, and go into exile by day in their sight. You shall go from your place to another place in their sight. Perhaps they will see, though they are a rebellious house.",
      "links": "<a href='/AIV/24/13/19'>Jer. 13:19</a>; <a href='/AIV/26/4/1-3'>Ezek. 4:1-3</a>",
      "comment": "God commands a public sign-act. Ezekiel’s enacted parable visibly demonstrates Judah’s coming exile. The visible performance of prophecy would later echo Christ's use of parables and symbolic actions."
    },
    {
      "pk": 33012004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 4,
      "text": "Bring out your belongings by day in their sight, as belongings for exile. Then you shall go out at evening in their sight, as those who go into exile.",
      "links": "<a href='/AIV/26/12/7'>Ezek. 12:7</a>",
      "comment": "The actions are to be done openly, offering every opportunity for the people to grasp the warning. Ezekiel’s life itself becomes a prophetic message."
    },
    {
      "pk": 33012005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 5,
      "text": "In their sight, dig through the wall and carry your belongings out through it.",
      "links": "<a href='/AIV/26/8/7-8'>Ezek. 8:7-8</a>; <a href='/AIV/4/32/26'>Num. 32:26'</a>",
      "comment": "Digging through the wall symbolizes desperate flight, picturing the city’s coming fall. Such dramatic signs recall the importance of visible ritual in divine pedagogy."
    },
    {
      "pk": 33012006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 6,
      "text": "In their sight, bear your belongings on your shoulder, and carry them out in the dark. You shall cover your face so that you cannot see the land, for I have made you a sign to the house of Israel.",
      "links": "<a href='/AIV/26/24/24'>Ezek. 24:24</a>; <a href='/AIV/19/38/10-11'>Ps. 38:10-11</a>",
      "comment": "Covering his face reflects shame and impending judgment. Ezekiel is set as a sign—his life as a prophetic sacrament, an outward sign of deeper realities."
    },
    {
      "pk": 33012007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 7,
      "text": "So I did as I was commanded. I brought out my belongings by day, as belongings for exile. In the evening, I dug through the wall with my hand. Under the cover of darkness, I carried my belongings on my shoulder in their sight.",
      "links": "<a href='/AIV/26/3/22-23'>Ezek. 3:22-23</a>",
      "comment": "Ezekiel’s obedience prefigures Christ’s perfect obedience (cf. John 8:29). His public sign demonstrates how faith must be lived out, not merely spoken."
    },
    {
      "pk": 33012008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 8,
      "text": "In the morning the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/12/1'>Ezek. 12:1</a>",
      "comment": "God explains the significance of Ezekiel’s enacted prophecy. True worship always involves both God's initiative and human response."
    },
    {
      "pk": 33012009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 9,
      "text": "Son of man, has not the house of Israel, that rebellious house, asked you, 'What are you doing?'",
      "links": "<a href='/AIV/26/17/12'>Ezek. 17:12</a>",
      "comment": "The people's confusion testifies to their hardness of heart. The prophet’s actions are designed to provoke reflection and repentance."
    },
    {
      "pk": 33012010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 10,
      "text": "Say to them, Thus says the Lord GOD: This burden concerns the prince in Jerusalem and all the house of Israel who are in it.",
      "links": "<a href='/AIV/26/21/25'>Ezek. 21:25</a>; <a href='/AIV/24/22/24'>Jer. 22:24</a>",
      "comment": "‘Prince’ refers specifically to King Zedekiah (cf. 2 Kings 25:1-7). God’s word thus judges both leaders and people."
    },
    {
      "pk": 33012011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 11,
      "text": "Say, ‘I am a sign for you. As I have done, so shall it be done to them; they shall go into exile, into captivity.’",
      "links": "<a href='/AIV/26/24/24'>Ezek. 24:24</a>",
      "comment": "Ezekiel’s actions foreshadow the people’s coming judgment. Prophetic symbolism here is parallel to sacramental realities—outward signs of God's inward activity."
    },
    {
      "pk": 33012012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 12,
      "text": "And the prince who is among them shall bear his belongings on his shoulder at dusk, and go out. He shall dig through the wall to bring them out. He shall cover his face so that he cannot see the land with his eyes.",
      "links": "<a href='/AIV/12/25/4-7'>2 Kings 25:4-7</a>; <a href='/AIV/26/12/6'>Ezek. 12:6</a>",
      "comment": "This prophecy is fulfilled in Zedekiah's desperate night escape from Jerusalem (2 Kings 25:4-7). Covering his face symbolizes shame, reminiscent of Adam and Eve after the Fall."
    },
    {
      "pk": 33012013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 13,
      "text": "I will spread My net over him, and he shall be caught in My snare. I will bring him to Babylon, the land of the Chaldeans, yet he shall not see it; and there he shall die.",
      "links": "<a href='/AIV/12/25/6-7'>2 Kings 25:6-7</a>; <a href='/AIV/19/35/7-8'>Ps. 35:7-8</a>",
      "comment": "Zedekiah was blinded and taken to Babylon—he entered but did not see it (2 Kings 25:7). God's dominion is total, His judgment inescapable."
    },
    {
      "pk": 33012014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 14,
      "text": "I will scatter toward every wind all who are around him to help him, and all his troops, and I will draw out the sword after them.",
      "links": "<a href='/AIV/26/5/2'>Ezek. 5:2</a>; <a href='/AIV/24/49/32'>Jer. 49:32</a>",
      "comment": "Complete scattering signifies not only political but spiritual judgment; unity and order in God’s people are always gifts to be guarded."
    },
    {
      "pk": 33012015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 15,
      "text": "They shall know that I am the LORD, when I scatter them among the nations and spread them throughout the countries.",
      "links": "<a href='/AIV/26/6/7'>Ezek. 6:7</a>; <a href='/AIV/24/9/16'>Jer. 9:16</a>",
      "comment": "Judgment leads to knowledge of the LORD—a repeated theme. Even exile has a redemptive aim: to restore faith in the one true God."
    },
    {
      "pk": 33012016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 16,
      "text": "But I will spare a few of them from the sword, from famine, and from pestilence, so that they may declare all their abominations among the nations where they go, and they shall know that I am the LORD.",
      "links": "<a href='/AIV/26/6/8-10'>Ezek. 6:8-10</a>; <a href='/AIV/26/14/22-23'>Ezek. 14:22-23</a>",
      "comment": "The survival of a remnant is a constant theme (see Isa. 10:20-22). God always preserves a faithful core—prefiguring the holy community that Christ would call together."
    },
    {
      "pk": 33012017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 17,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/12/1'>Ezek. 12:1</a>",
      "comment": "A new symbolic action is introduced in this section. Each action reinforces the prophet’s authority."
    },
    {
      "pk": 33012018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 18,
      "text": "Son of man, eat your bread with quaking, and drink your water with trembling and with anxiety.",
      "links": "<a href='/AIV/26/4/16'>Ezek. 4:16</a>",
      "comment": "Food and water taken in fear vividly portray the terror and deprivation of Jerusalem’s siege. Physical acts symbolize inward realities."
    },
    {
      "pk": 33012019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 19,
      "text": "Say to the people of the land, ‘Thus says the Lord GOD concerning the inhabitants of Jerusalem in the land of Israel: They shall eat their bread with anxiety and drink their water with horror, so that her land will be stripped of all it contains because of the violence of all who dwell in it.’",
      "links": "<a href='/AIV/26/4/16-17'>Ezek. 4:16-17</a>; <a href='/AIV/24/25/18'>Jer. 25:18</a>",
      "comment": "The devastations in Jerusalem fulfill earlier prophecies of the physical and spiritual consequences of turning from the LORD."
    },
    {
      "pk": 33012020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 20,
      "text": "The inhabited cities shall be laid waste, and the land shall become a desert. Then you will know that I am the LORD.",
      "links": "<a href='/AIV/26/6/6-7'>Ezek. 6:6-7</a>",
      "comment": "Repeated recognition formula: God’s acts in history—both judgment and restoration—reveal His identity. Judgment leads to true knowledge of God. See Romans 11:22 for the balance of severity and mercy."
    },
    {
      "pk": 33012021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 21,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/12/1'>Ezek. 12:1</a>",
      "comment": "New oracles are introduced, showing God's dynamic relation with His people. Prophecy is shown to respond to the spiritual state of the community."
    },
    {
      "pk": 33012022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 22,
      "text": "Son of man, what is this proverb you have in the land of Israel, saying, ‘The days are prolonged, and every vision fails’?",
      "links": "<a href='/AIV/2/32/32'>Deut. 32:32'>; <a href='/AIV/24/17/15'>Jer. 17:15</a>",
      "comment": "The people mock the prophetic word, echoing scoffers in every age (2 Pet. 3:3-4). God's message endures beyond the skepticism of the moment."
    },
    {
      "pk": 33012023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 23,
      "text": "Therefore say to them, ‘Thus says the Lord GOD: I will put an end to this proverb, and they shall no longer use it in Israel.’ But say to them, ‘The days are at hand, and the fulfillment of every vision.’",
      "links": "<a href='/AIV/24/16/14-15'>Jer. 16:14-15</a>; <a href='/AIV/36/1/7'>Zeph. 1:7</a>",
      "comment": "God confronts and reverses the false narrative. His promises and warnings are always fulfilled in their time."
    },
    {
      "pk": 33012024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 24,
      "text": "For there shall no longer be any false vision or flattering divination within the house of Israel.",
      "links": "<a href='/AIV/26/13/6-9'>Ezek. 13:6-9</a>",
      "comment": "God refuses to tolerate falsehood among His people. His true Church is marked by truth and authentic prophecy (cf. 1 John 4:1-6)."
    },
    {
      "pk": 33012025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 25,
      "text": "But I, the LORD, will speak whatever word I speak, and it will come to pass. It will not be delayed any longer. For in your days, O rebellious house, I will speak the word and perform it, declares the Lord GOD.",
      "links": "<a href='/AIV/26/12/28'>Ezek. 12:28</a>; <a href='/AIV/23/55/11'>Isa. 55:11</a>",
      "comment": "The infallibility of God's word is asserted. Ultimately, Christ is the living fulfillment of the Word (John 1:1-14)."
    },
    {
      "pk": 33012026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 26,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/12/1'>Ezek. 12:1</a>",
      "comment": "God's continuing revelation through Ezekiel reflects His ongoing care and guidance for His chosen people in the midst of trial."
    },
    {
      "pk": 33012027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 27,
      "text": "Son of man, the house of Israel says, ‘The vision that he sees is for many days from now; he prophesies about the distant future.’",
      "links": "<a href='/AIV/24/17/15'>Jer. 17:15</a>",
      "comment": "The people's claim that the prophecy is far off is a classic resistance to conversion and repentance. There is danger in procrastination regarding God’s call."
    },
    {
      "pk": 33012028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 12,
      "verse": 28,
      "text": "Therefore say to them, 'Thus says the Lord GOD: None of my words will be delayed any longer, but the word that I speak will be fulfilled, declares the Lord GOD.'",
      "links": "<a href='/AIV/23/55/11'>Isa. 55:11</a>; <a href='/AIV/40/24/35'>Matt. 24:35</a>",
      "comment": "God’s word is powerful and effectual—it accomplishes His will (Isa. 55:11). This applies to all God's promises both of judgment and restoration, including the final fulfillment in Christ and the Church’s enduring foundation."
    }
  ],
  "translatedAt": "2025-12-24T09:04:17.367Z"
}