{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 5,
  "verses": [
    {
      "pk": 33005001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 1,
      "text": "As for you, son of man, take a sharp sword and use it like a barber’s razor. Pass it over your head and beard. Then take scales to weigh and divide the hair.",
      "links": "<a href='/AIV/3/21/10'>Lev. 21:10</a>; <a href='/AIV/23/7/20'>Isa. 7:20</a>",
      "comment": "God commands Ezekiel to act out a symbolic act, using a sword as a razor—a sign of judgment and disgrace (cf. Isa. 7:20). The scales represent God's precise justice. This image also foreshadows acts of purification."
    },
    {
      "pk": 33005002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 2,
      "text": "A third of the hair you shall burn in the midst of the city when the days of the siege are finished. Then, you shall take a third and strike it with the sword all around the city. And a third you shall scatter to the wind. For I will unsheath a sword after them.",
      "links": "<a href='/AIV/3/26/33'>Lev. 26:33</a>; <a href='/AIV/24/9/16'>Jer. 9:16</a>",
      "comment": "The division of the hair represents the fate of Jerusalem's inhabitants: destruction by fire (siege and famine), by sword, and by exile. The scattering to the wind prefigures Israel's dispersion—a motif later repeated in Christian thought regarding the universality of God's people."
    },
    {
      "pk": 33005003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 3,
      "text": "But take a small number of hairs and bind them in the fold of your robe.",
      "links": "<a href='/AIV/10/8/14-15'>2 Sam. 8:14-15</a>; <a href='/AIV/16/1/8'>Neh. 1:8</a>",
      "comment": "The small remnant preserved in Ezekiel’s garment foreshadows God’s mercy in preserving a faithful remnant amid judgment (see Rom. 11:5). This remnant theme is important for later biblical theology and the concept of restoration."
    },
    {
      "pk": 33005004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 4,
      "text": "And again, take some of those and throw them into the fire and burn them in the fire. From there, a fire will spread to all the house of Israel.",
      "links": "<a href='/AIV/32/2/3-6'>Jonah 2:3-6</a>; <a href='/AIV/23/10/16-17'>Isa. 10:16-17</a>",
      "comment": "Even among the faithful remnant, some will still suffer judgment—highlighting the seriousness of sin. This teaching parallels the New Testament’s call for purity within the Church (cf. Matt. 13:41-42)."
    },
    {
      "pk": 33005005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 5,
      "text": "This is what the Lord GOD says: This is Jerusalem. I have set her in the center of the nations, with countries all around her.",
      "links": "<a href='/AIV/05/4/7'>Deut. 4:7</a>; <a href='/AIV/19/48/2'>Ps. 48:2</a>",
      "comment": "Jerusalem’s unique position reflects its calling as the focal point of God’s presence among humanity. This foreshadows the city’s spiritual fulfillment in the New Testament as the locus of Christ’s redemptive work (cf. Heb. 12:22)."
    },
    {
      "pk": 33005006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 6,
      "text": "But she has rebelled against my ordinances more than the nations, and against my statutes more than the countries around her. For they have rejected my laws and have not walked in my statutes.",
      "links": "<a href='/AIV/23/1/4'>Isa. 1:4</a>; <a href='/AIV/28/8/12'>Hos. 8:12</a>",
      "comment": "Jerusalem's greater privilege brings greater responsibility—and consequently, greater guilt in rejecting God’s covenant. This echoes Jesus’ words in Luke 12:48 about judgment proportional to knowledge granted."
    },
    {
      "pk": 33005007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 7,
      "text": "Therefore, says the Lord GOD, because you are more rebellious than the nations around you and have not walked in my statutes or kept my ordinances—indeed, you have not even acted according to the ordinances of the nations around you—",
      "links": "<a href='/AIV/24/2/10-13'>Jer. 2:10-13</a>",
      "comment": "God makes clear that His people’s unfaithfulness surpasses even that of pagan nations. This passage warns against complacency, highlighting the need for faithfulness to God’s truth entrusted to the whole covenant people."
    },
    {
      "pk": 33005008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 8,
      "text": "therefore thus says the Lord GOD: Behold, even I am against you, Jerusalem, and I will execute judgments in your midst in the sight of the nations.",
      "links": "<a href='/AIV/24/39/16'>Jer. 39:16</a>; <a href='/AIV/36/3/8'>Zeph. 3:8</a>",
      "comment": "Divine judgment will be public and severe. Jerusalem, meant to be a witness to the nations, now serves as a warning—prefiguring how God’s people can act as either light or cautionary example to the world (cf. 1 Cor. 10:11)."
    },
    {
      "pk": 33005009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 9,
      "text": "Because of all your abominations, I will do among you what I have never done, and the like of which I will never do again.",
      "links": "<a href='/AIV/25/4/6'>Lam. 4:6</a>; <a href='/AIV/27/9/12'>Dan. 9:12</a>",
      "comment": "The severity of the judgment is unprecedented, emphasizing both the gravity of sin and the holiness of God. Prefigurations of such punishment remind us of the seriousness of unfaithfulness, seen ultimately in Christ bearing judgment for our sins."
    },
    {
      "pk": 33005010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 10,
      "text": "Therefore, fathers will eat their sons in your midst, and sons will eat their fathers. I will execute judgments against you, and scatter any survivors to every wind.",
      "links": "<a href='/AIV/03/26/29'>Lev. 26:29</a>; <a href='/AIV/25/4/10'>Lam. 4:10</a>",
      "comment": "The gruesome imagery recalls covenant curses (Lev. 26:29) and is fulfilled in later sieges (Lam. 4:10). It signifies a complete breakdown of natural and spiritual order, highlighting the need for restoration and reconciliation within God's people."
    },
    {
      "pk": 33005011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 11,
      "text": "Therefore, as I live, declares the Lord GOD, surely, because you have defiled my sanctuary with all your detestable things and with all your abominations, I will also withdraw. My eye will not spare, and I will not have pity.",
      "links": "<a href='/AIV/03/15/31'>Lev. 15:31</a>; <a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "Defiling God's sanctuary brings about His withdrawal—the loss of His presence. This theme is echoed in New Testament calls for reverence for God's dwelling among His people, especially seen in the sacraments and the call to holiness (see 1 Cor. 3:16-17)."
    },
    {
      "pk": 33005012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 12,
      "text": "A third part of you shall die by plague and be consumed with famine within you. A third shall fall by the sword all around you. And a third I will scatter to every wind and unsheath a sword after them.",
      "links": "<a href='/AIV/07/6/2'>Judg. 6:2</a>; <a href='/AIV/24/15/2'>Jer. 15:2-3</a>",
      "comment": "This division recaps verse 2 and highlights the totality of the upcoming judgment. Yet the pattern of scattering always hints at God’s eventual gathering. The remnant, though purged, remains significant for God's plan."
    },
    {
      "pk": 33005013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 13,
      "text": "Thus shall my anger be finished, and I will satisfy my wrath upon them. And when I have spent my wrath upon them, they shall know that I, the LORD, have spoken in my zeal, when I have expended my anger upon them.",
      "links": "<a href='/AIV/26/30/19'>Ezek. 30:19</a>; <a href='/AIV/19/79/5'>Ps. 79:5</a>",
      "comment": "The aim of God’s judgment is ultimately restoration—a recognition of His sovereignty. 'They shall know that I am the LORD' is a repeated refrain, highlighting both justice and the hope of reconciliation (cf. Heb. 12:11)."
    },
    {
      "pk": 33005014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 14,
      "text": "Moreover, I will make you a desolation and a reproach among the nations around you, in the sight of everyone who passes by.",
      "links": "<a href='/AIV/19/44/13'>Ps. 44:13</a>; <a href='/AIV/25/2/15'>Lam. 2:15</a>",
      "comment": "Jerusalem, once esteemed, becomes a visible example of judgment and shame. Compare with the experience of Christ, who bore reproach on behalf of His people (Heb. 13:13)."
    },
    {
      "pk": 33005015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 15,
      "text": "So it will be a reproach, a taunt, a warning, and a horror to the nations around you, when I execute judgments on you in anger and in wrath, and with furious rebukes. I, the LORD, have spoken.",
      "links": "<a href='/AIV/05/28/37'>Deut. 28:37</a>; <a href='/AIV/19/79/4'>Ps. 79:4</a>",
      "comment": "This verse echoes Deuteronomy’s warnings of covenant curse. God’s justice teaches all nations the consequences of unfaithfulness, reinforcing the seriousness of belonging to God’s covenant community."
    },
    {
      "pk": 33005016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 16,
      "text": "When I send against you the deadly arrows of famine, which are for destruction, which I will send to destroy you, I will increase the famine upon you and break your staff of bread.",
      "links": "<a href='/AIV/03/26/26'>Lev. 26:26</a>; <a href='/AIV/19/105/16'>Ps. 105:16</a>",
      "comment": "'Staff of bread' refers to the support of daily food, echoing earlier covenant curses and the Lord’s Prayer 'give us this day our daily bread.' The breaking of bread here prefigures the restoration of bread in messianic banquets."
    },
    {
      "pk": 33005017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 5,
      "verse": 17,
      "text": "I will send against you famine and wild beasts, and they will bereave you. Pestilence and bloodshed will pass through you, and I will bring the sword against you. I, the LORD, have spoken.",
      "links": "<a href='/AIV/03/26/22-25'>Lev. 26:22-25</a>; <a href='/AIV/26/14/21'>Ezek. 14:21</a>",
      "comment": "The fourfold judgments (famine, wild beasts, pestilence, sword) recur throughout Scripture as signs of comprehensive divine judgment (see Ezek. 14:21; Rev. 6:8). Yet God’s spoken word always contains the implicit hope of turning back to Him and restoration."
    }
  ],
  "translatedAt": "2025-12-24T09:00:40.259Z"
}