{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 28,
  "verses": [
    {
      "pk": 2282801,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 1,
      "text": "The word of the LORD came to me, saying,",
      "links": "",
      "comment": "Ezekiel often introduces his oracles this way, marking divine authority behind the prophetic message. See <a href='/AIV/26/6/1'>Ezek. 6:1</a>."
    },
    {
      "pk": 2282802,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 2,
      "text": "“Son of man, say to the prince of Tyre, ‘This is what the Lord GOD says: Because your heart is proud and you have said, “I am a god, I sit in the seat of gods, in the heart of the seas,” though you are a man and not a god, yet you make your heart like the heart of a god—",
      "links": "<a href='/AIV/26/27/3'>Ezek. 27:3</a>; <a href='/AIV/23/14/13'>Isa. 14:13-14</a>",
      "comment": "The prince of Tyre claims divinity, echoing the pride of other ancient rulers. Proud self-exaltation against God is a common biblical theme, see Isaiah's oracle against Babylon's king (<a href='/AIV/23/14/12-14'>Isa. 14:12-14</a>)."
    },
    {
      "pk": 2282803,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 3,
      "text": "you are wiser than Daniel; no secret is hidden from you;",
      "links": "<a href='/AIV/27/2/19-23'>Dan. 2:19-23</a>",
      "comment": "Daniel is referenced here for his legendary wisdom, showing the prince's arrogance. This comparison subtly foreshadows the true source of wisdom in God’s faithful."
    },
    {
      "pk": 2282804,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 4,
      "text": "by your wisdom and understanding you have gained wealth for yourself, and gathered gold and silver into your treasuries;",
      "links": "<a href='/AIV/26/27/33'>Ezek. 27:33</a>",
      "comment": "The accumulation of wealth by seeming wisdom echoes the dangers of trusting in riches instead of God (cf. <a href='/AIV/19/49/6-7'>Ps. 49:6-7</a>)."
    },
    {
      "pk": 2282805,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 5,
      "text": "by your great skill in trading you have increased your wealth, and your heart has become proud in your wealth—",
      "links": "<a href='/AIV/26/27/12'>Ezek. 27:12</a>",
      "comment": "Pride connected to material gain is condemned throughout Scripture, often leading to downfall (<a href='/AIV/20/16/18'>Prov. 16:18</a>)."
    },
    {
      "pk": 2282806,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 6,
      "text": "therefore thus says the Lord GOD: Because you make your heart like the heart of a god,",
      "links": "",
      "comment": "Repetition stresses the seriousness of elevating oneself above one's station. Such pride separates one from God’s order and law."
    },
    {
      "pk": 2282807,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 7,
      "text": "therefore, I will bring foreigners against you, the most ruthless of nations; they shall draw their swords against the beauty of your wisdom, and defile your splendor.",
      "links": "<a href='/AIV/26/30/11'>Ezek. 30:11</a>; <a href='/AIV/24/51/45'>Jer. 51:45</a>",
      "comment": "Foreign invaders are God’s instrument of judgment. The theme recurs in prophetic writings, as in the fall of Jerusalem and other proud cities."
    },
    {
      "pk": 2282808,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 8,
      "text": "They shall bring you down to the pit, and you shall die the death of the slain in the heart of the seas.",
      "links": "<a href='/AIV/19/9/17'>Ps. 9:17</a>; <a href='/AIV/26/31/14'>Ezek. 31:14</a>",
      "comment": "The 'pit' references Sheol, a realm for the dead, associated with judgment and separation from God, alluded in Psalms and later interpreted as symbolic of final separation from divine presence."
    },
    {
      "pk": 2282809,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 9,
      "text": "Will you still say, ‘I am a god,’ in the presence of those who kill you, though you are a man and not a god, in the hands of those who slay you?",
      "links": "",
      "comment": "The futility of pride confronts mortality. Echoes in New Testament teaching on humility and mortality (<a href='/AIV/42/12/20'>Luke 12:20</a>)."
    },
    {
      "pk": 2282810,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 10,
      "text": "You shall die the death of the uncircumcised by the hand of foreigners, for I have spoken, declares the Lord GOD.”",
      "links": "<a href='/AIV/26/31/18'>Ezek. 31:18</a>",
      "comment": "‘Uncircumcised’ here means the prince will die shamefully, like a pagan. Circumcision symbolizes membership in God’s covenant—a motif fulfilled in spiritual belonging to God through Christ’s sacrifice (<a href='/AIV/51/2/11'>Col. 2:11</a>)."
    },
    {
      "pk": 2282811,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 11,
      "text": "The word of the LORD came to me:",
      "links": "",
      "comment": "A new oracle begins; Ezekiel often separates prophecies by repetition for emphasis."
    },
    {
      "pk": 2282812,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 12,
      "text": "“Son of man, raise a lamentation over the king of Tyre, and say to him, ‘This is what the Lord GOD says: You were the seal of perfection, full of wisdom and perfect in beauty.",
      "links": "",
      "comment": "This lament shifts from the 'prince' to the 'king' of Tyre, with language reminiscent of Eden. Some interpreters see a spiritual parallel to the fall of Satan, drawing on tradition and typology (see <a href='/AIV/23/14/12-15'>Isa. 14:12-15</a>)."
    },
    {
      "pk": 2282813,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 13,
      "text": "You were in Eden, the garden of God; every precious stone was your covering: sardius, topaz, and diamond, beryl, onyx, and jasper, sapphire, turquoise, and emerald; all crafted with gold. Your tambourines and pipes were prepared for you on the day you were created.",
      "links": "<a href='/AIV/01/2/8'>Gen. 2:8</a>",
      "comment": "References to Eden evoke the image of a primordial beauty and blessing. The precious stones recall those worn by priests in worship (see <a href='/AIV/02/28/17-20'>Ex. 28:17-20</a>), linking kingly and priestly symbolism."
    },
    {
      "pk": 2282814,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 14,
      "text": "You were an anointed guardian cherub; I placed you on the holy mountain of God; you walked among the stones of fire.",
      "links": "<a href='/AIV/01/3/24'>Gen. 3:24</a>; <a href='/AIV/66/4/6'>Rev. 4:6</a>",
      "comment": "Imagery of a cherub reflects closeness to the divine, paralleling angels who once guarded Eden. The 'holy mountain' and 'stones of fire' suggest heavenly access, as in God’s throne room."
    },
    {
      "pk": 2282815,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 15,
      "text": "You were blameless in your ways from the day you were created, until unrighteousness was found in you.",
      "links": "<a href='/AIV/21/7/29'>Eccl. 7:29</a>",
      "comment": "The transition from blamelessness to corruption mirrors the fall narrative in Genesis. Theological tradition sees here a dual meaning: an earthly king, but also as symbolic of angelic rebellion and the universality of sin."
    },
    {
      "pk": 2282816,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 16,
      "text": "By the abundance of your trade you were filled with violence, and you sinned; so I cast you as a profane thing from the mountain of God, and I destroyed you, O guardian cherub, from among the stones of fire.",
      "links": "",
      "comment": "Removal from God’s mountain mirrors the expulsion from Eden and implies loss of direct communion with God. The 'trade' motif connects economic sin to spiritual rebellion, highlighting dangers of materialism."
    },
    {
      "pk": 2282817,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 17,
      "text": "Your heart was proud because of your beauty; you corrupted your wisdom for the sake of your splendor. I cast you to the ground; I exposed you before kings, to be seen by them.",
      "links": "",
      "comment": "Exaltation followed by humiliation is a theme fulfilled in Christ’s teaching, where the meek are exalted and the proud humbled (<a href='/AIV/40/23/12'>Matt. 23:12</a>)."
    },
    {
      "pk": 2282818,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 18,
      "text": "By the many sins in your unjust trade, you have profaned your sanctuaries; so I brought out fire from within you, it consumed you, and I turned you to ashes on the earth before the eyes of all who saw you.",
      "links": "<a href='/AIV/01/19/24'>Gen. 19:24</a>",
      "comment": "‘Profaned your sanctuaries’ alludes to corrupt worship. Fire as judgment echoes destruction of Sodom. This foreshadows divine purging, a motif reinterpreted in later traditions regarding purification."
    },
    {
      "pk": 2282819,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 19,
      "text": "All who know you among the peoples are appalled at you; you have come to a dreadful end and will be no more forever.”",
      "links": "",
      "comment": "The judgment is final, showing that pride and sin result in utter destruction—a warning applicable universally."
    },
    {
      "pk": 2282820,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 20,
      "text": "The word of the LORD came to me:",
      "links": "",
      "comment": "Introduction of another oracle, marking divine initiation."
    },
    {
      "pk": 2282821,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 21,
      "text": "“Son of man, set your face toward Sidon, and prophesy against her",
      "links": "<a href='/AIV/26/27/8'>Ezek. 27:8</a>",
      "comment": "Sidon, a neighboring city of Tyre, is likewise subject to divine warning, displaying God’s concern for all nations."
    },
    {
      "pk": 2282822,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 22,
      "text": "and say, ‘This is what the Lord GOD says: Look, I am against you, Sidon, and I will display my glory in your midst. They shall know that I am the LORD when I execute judgments in her and show myself holy in her.",
      "links": "",
      "comment": "Judgment brings the revelation of God’s holiness—His justice ultimately reveals His glory. Compare with how God’s holiness brings both judgment and redemption (<a href='/AIV/26/36/23'>Ezek. 36:23</a>)."
    },
    {
      "pk": 2282823,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 23,
      "text": "For I will send pestilence into her, and blood into her streets; the slain shall fall within her, by sword attacking her from every side; and they shall know that I am the LORD.",
      "links": "<a href='/AIV/26/6/7'>Ezek. 6:7</a>",
      "comment": "Typical prophetic imagery of judgment—pestilence, violence, and recognition of God’s sovereignty. These events instruct both the city and nations about the reality and supremacy of God."
    },
    {
      "pk": 2282824,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 24,
      "text": "No longer shall there be a prickling brier or painful thorn among the house of Israel from any of their neighbors who despise them. Then they will know that I am the Lord GOD.”",
      "links": "<a href='/AIV/26/2/6'>Ezek. 2:6</a>",
      "comment": "Imagery of thorns symbolizes oppressive neighbors. God’s promise to remove such affliction recalls restoration expectations pointing to messianic hope."
    },
    {
      "pk": 2282825,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 25,
      "text": "This is what the Lord GOD says: When I gather the house of Israel from the peoples among whom they are scattered, and show myself holy among them in the sight of the nations, then they shall dwell in their own land that I gave to my servant Jacob.",
      "links": "<a href='/AIV/26/36/24'>Ezek. 36:24</a>; <a href='/AIV/01/35/12'>Gen. 35:12</a>",
      "comment": "Restoration of Israel is linked to God's holiness. Gathering the people echoes covenant faithfulness. Ultimately, this anticipates the kingdom promised not only to Israel but to all nations through Christ’s work."
    },
    {
      "pk": 2282826,
      "translation": "AIV",
      "book": 26,
      "chapter": 28,
      "verse": 26,
      "text": "And they shall dwell securely in it, and shall build houses and plant vineyards. They shall dwell securely when I execute judgments on all their neighbors who have treated them with contempt. And they shall know that I am the LORD their God.”",
      "links": "<a href='/AIV/03/26/5'>Lev. 26:5</a>; <a href='/AIV/26/34/25'>Ezek. 34:25</a>",
      "comment": "This final verse of the chapter promises peace, prosperity, and security—hallmarks of God's ultimate restoration. Spiritual fulfillment is found in the Church as God’s gathered people living under His protection and provision."
    }
  ],
  "translatedAt": "2025-12-23T07:01:22.843Z"
}