{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 33,
  "verses": [
    {
      "pk": 33001,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/3/16'>Ezek. 3:16</a>",
      "comment": "This marks a renewed commission from God to Ezekiel, echoing his calling as a watchman earlier in the book."
    },
    {
      "pk": 33002,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 2,
      "text": "Son of man, speak to the people of your nation and say to them, 'When I bring the sword upon a land, and the people of that land choose one of their men and set him as their watchman,",
      "links": "<a href='/AIV/26/3/17'>Ezek. 3:17</a>",
      "comment": "Watchmen symbolize spiritual leaders responsible for warning of coming judgment. This foreshadows the New Testament call for shepherds over the flock (<a href='/AIV/44/20/28'>Acts 20:28</a>)."
    },
    {
      "pk": 33003,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 3,
      "text": "and when he sees the sword coming upon the land and blows the trumpet and warns the people,",
      "links": "<a href='/AIV/26/33/6'>Ezek. 33:6</a>; <a href='/AIV/16/4/18'>Neh. 4:18</a>",
      "comment": "The trumpet is a symbol of warning in the biblical narrative, signifying decisive moments of judgment or deliverance."
    },
    {
      "pk": 33004,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 4,
      "text": "then if anyone hears the sound of the trumpet but does not heed the warning, and the sword comes and takes him away, his blood will be upon his own head.",
      "links": "<a href='/AIV/26/18/13'>Ezek. 18:13</a>",
      "comment": "This verse reinforces individual responsibility. In spiritual terms, ignoring God's call can lead to separation from Him."
    },
    {
      "pk": 33005,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 5,
      "text": "He heard the sound of the trumpet but did not take warning; his blood will be upon himself. If he had taken warning, he would have saved his life.",
      "links": "<a href='/AIV/26/18/31'>Ezek. 18:31</a>",
      "comment": "The interplay between warning and response highlights the importance of heeding divine instruction, a principle echoed in <a href='/AIV/40/7/26'>Matthew 7:26</a>."
    },
    {
      "pk": 33006,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 6,
      "text": "But if the watchman sees the sword coming and does not blow the trumpet, so that the people are not warned, and the sword comes and takes one of them, that person is taken away in his iniquity, but I will hold the watchman accountable for his blood.",
      "links": "<a href='/AIV/26/3/18'>Ezek. 3:18</a>; <a href='/AIV/58/13/17'>Hebrews 13:17</a>",
      "comment": "There's a deep spiritual responsibility upon leaders—a theme recognized later in the oversight of spiritual shepherds."
    },
    {
      "pk": 33007,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 7,
      "text": "So you, son of man, I have set you as a watchman for the house of Israel. Therefore, whenever you hear a word from My mouth, you shall give them warning from Me.",
      "links": "<a href='/AIV/26/3/17'>Ezek. 3:17</a>; <a href='/AIV/43/17/8'>John 17:8</a>",
      "comment": "Ezekiel's prophetic ministry prefigures the role of apostles and those entrusted with divine revelation."
    },
    {
      "pk": 33008,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 8,
      "text": "If I say to the wicked, 'Wicked man, you shall surely die,' and you do not speak to warn the wicked from his way, that wicked person will die in his iniquity, but I will require his blood from your hand.",
      "links": "<a href='/AIV/26/3/18'>Ezek. 3:18</a>; <a href='/AIV/40/18/15'>Matt. 18:15</a>",
      "comment": "This reiterates the communal responsibility for warning others, a concept echoing the necessity of fraternal correction."
    },
    {
      "pk": 33009,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 9,
      "text": "But if you warn the wicked to turn from his way, and he does not turn from his way, he shall die for his iniquity, but you will have delivered your soul.",
      "links": "<a href='/AIV/26/3/19'>Ezek. 3:19</a>",
      "comment": "Freedom from guilt is given to the faithful servant, reminiscent of Paul's teaching on freeing oneself by declaring the truth (<a href='/AIV/44/20/26'>Acts 20:26</a>)."
    },
    {
      "pk": 33010,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 10,
      "text": "And you, son of man, say to the house of Israel, 'Thus you say: Surely our transgressions and our sins are upon us, and we waste away because of them. How then can we live?'",
      "links": "<a href='/AIV/26/24/23'>Ezek. 24:23</a>; <a href='/AIV/19/130/3'>Ps. 130:3</a>",
      "comment": "Israel's despair echoes universal cries for salvation; see the longing for redemption in <a href='/AIV/19/130/3'>Psalm 130:3</a>."
    },
    {
      "pk": 33011,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 11,
      "text": "Say to them, 'As I live, declares the Lord GOD, I take no pleasure in the death of the wicked, but rather that the wicked turn from his way and live. Turn back, turn from your evil ways! For why should you die, house of Israel?'",
      "links": "<a href='/AIV/26/18/23'>Ezek. 18:23</a>; <a href='/AIV/55/2/4'>1 Tim. 2:4</a>",
      "comment": "God's mercy and desire for repentance is a key biblical theme. The call to conversion anticipates the message of grace in <a href='/AIV/55/2/4'>1 Timothy 2:4</a>."
    },
    {
      "pk": 33012,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 12,
      "text": "And you, son of man, say to your people, 'The righteousness of the righteous shall not deliver him when he transgresses, and as for the wickedness of the wicked, he shall not fall by it when he turns from his wickedness; nor shall the righteous be able to live by his righteousness when he sins.'",
      "links": "<a href='/AIV/26/18/24'>Ezek. 18:24</a>",
      "comment": "Spiritual perseverance is necessary; past righteousness is not enough if one turns away, introducing the idea of ongoing fidelity."
    },
    {
      "pk": 33013,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 13,
      "text": "When I say to the righteous that he shall surely live, yet if he trusts in his own righteousness and commits iniquity, none of his righteous deeds will be remembered; but in his sin that he has committed, he shall die.",
      "links": "<a href='/AIV/26/18/24'>Ezek. 18:24</a>; <a href='/AIV/45/3/10'>Romans 3:10</a>",
      "comment": "This warns against complacency and self-righteousness, seen also in <a href='/AIV/45/3/10'>Romans 3:10</a>: 'None is righteous, no, not one.'"
    },
    {
      "pk": 33014,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 14,
      "text": "Again, though I say to the wicked, 'You shall surely die,' yet if he turns from his sin and does what is just and right,",
      "links": "<a href='/AIV/26/18/27'>Ezek. 18:27</a>; <a href='/AIV/42/15/7'>Luke 15:7</a>",
      "comment": "Repentance leads to life, prefiguring Jesus’ teaching on joy over one sinner who repents (<a href='/AIV/42/15/7'>Luke 15:7</a>)."
    },
    {
      "pk": 33015,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 15,
      "text": "if that person returns what he stole, restores what he owes, walks in the statutes of life, committing no iniquity, he shall surely live; he shall not die.",
      "links": "<a href='/AIV/26/18/21'>Ezek. 18:21</a>; <a href='/AIV/40/5/23-24'>Matt. 5:23-24</a>",
      "comment": "Reconciliation and restitution as evidence of true repentance tie in with Jesus’ teaching on reconciliation before worship (<a href='/AIV/40/5/23-24'>Matt. 5:23-24</a>)."
    },
    {
      "pk": 33016,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 16,
      "text": "None of the sins that person has committed will be remembered against him. He has done what is just and right; surely he shall live.",
      "links": "<a href='/AIV/26/18/22'>Ezek. 18:22</a>; <a href='/AIV/58/10/17'>Heb. 10:17</a>",
      "comment": "Complete forgiveness is highlighted, foreshadowing the New Covenant promise: 'I will remember their sins no more.' (<a href='/AIV/58/10/17'>Heb. 10:17</a>)"
    },
    {
      "pk": 33017,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 17,
      "text": "Yet your people say, 'The way of the Lord is not just.' But it is their own way that is not just.",
      "links": "<a href='/AIV/26/18/25'>Ezek. 18:25</a>; <a href='/AIV/23/55/8'>Isa. 55:8</a>",
      "comment": "God’s justice surpasses human understanding; see also <a href='/AIV/23/55/8'>Isaiah 55:8</a>."
    },
    {
      "pk": 33018,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 18,
      "text": "When the righteous turns from his righteousness and commits iniquity, he shall die because of it.",
      "links": "<a href='/AIV/26/18/26'>Ezek. 18:26</a>",
      "comment": "Again, this stresses the need for perseverance in the faith and moral living."
    },
    {
      "pk": 33019,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 19,
      "text": "But when the wicked turns from his wickedness and does what is just and right, he shall live by doing so.",
      "links": "<a href='/AIV/26/18/27'>Ezek. 18:27</a>",
      "comment": "Repentance brings new life—a principle reflected in Jesus’ ministry to sinners."
    },
    {
      "pk": 33020,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 20,
      "text": "Yet you say, 'The way of the Lord is not just.' But I will judge every one of you according to his ways, house of Israel.",
      "links": "<a href='/AIV/26/18/30'>Ezek. 18:30</a>; <a href='/AIV/40/25/31-46'>Matt. 25:31-46</a>",
      "comment": "Final judgment is universal and impartial, echoing Christ's teaching about separation of sheep and goats."
    },
    {
      "pk": 33021,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 21,
      "text": "In the twelfth year of our exile, in the tenth month, on the fifth day of the month, a refugee from Jerusalem came to me and said, 'The city has been struck down.'",
      "links": "<a href='/AIV/26/24/2'>Ezek. 24:2</a>",
      "comment": "This verse confirms the destruction of Jerusalem, a turning point in Israel's history and prophetic fulfillment."
    },
    {
      "pk": 33022,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 22,
      "text": "The hand of the LORD had been upon me the evening before the refugee arrived, and He opened my mouth by the time he came to me in the morning, so my mouth was opened and I was no longer silent.",
      "links": "<a href='/AIV/26/3/26-27'>Ezek. 3:26-27</a>; <a href='/AIV/26/24/27'>Ezek. 24:27</a>",
      "comment": "Ezekiel regains his ability to speak, symbolizing the end of judgment silence and the beginning of restoration messages."
    },
    {
      "pk": 33023,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 23,
      "text": "Then the word of the LORD came to me, saying:",
      "links": "",
      "comment": "A new prophetic oracle begins, marking a shift of focus after Jerusalem's fall."
    },
    {
      "pk": 33024,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 24,
      "text": "Son of man, the people living among those ruins in the land of Israel keep saying, 'Abraham was only one man, yet he inherited the land. But we are many; surely the land has been given to us as a possession.'",
      "links": "<a href='/AIV/1/13/15'>Gen. 13:15</a>; <a href='/AIV/1/17/8'>Gen. 17:8</a>",
      "comment": "Israel misinterprets the Abrahamic promise, relying only on numbers, rather than on faithful obedience."
    },
    {
      "pk": 33025,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 25,
      "text": "Therefore say to them, 'This is what the Lord GOD says: You eat meat with the blood still in it, raise your eyes to your idols, and shed blood. Will you really inherit the land?'",
      "links": "<a href='/AIV/3/17/10-14'>Lev. 17:10-14</a>; <a href='/AIV/2/20/3-5'>Exod. 20:3-5</a>",
      "comment": "Disobedience regarding ritual purity and idolatry blocks blessing, as seen throughout the Law."
    },
    {
      "pk": 33026,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 26,
      "text": "You rely on your swords, commit abominations, and defile one another’s wives. Should you possess the land?",
      "links": "<a href='/AIV/26/8/17'>Ezek. 8:17</a>; <a href='/AIV/2/20/14'>Exod. 20:14</a>",
      "comment": "Israel’s moral failures are cited as reasons for their loss, contrasting earthly possession with covenant faithfulness."
    },
    {
      "pk": 33027,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 27,
      "text": "Say this to them: 'This is what the Lord GOD says: As surely as I live, those who are living among the ruins shall fall by the sword; and whoever is in the open field I will give to the beasts to devour; and those in strongholds and caves shall die by pestilence.'",
      "links": "<a href='/AIV/26/5/17'>Ezek. 5:17</a>; <a href='/AIV/26/14/21'>Ezek. 14:21</a>",
      "comment": "The judgment affects all classes, showing the outcome of rejecting God’s law."
    },
    {
      "pk": 33028,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 28,
      "text": "I will make the land a desolation and a waste, and her proud strength will come to an end, and the mountains of Israel shall be so desolate that no one will pass through.",
      "links": "<a href='/AIV/26/5/14'>Ezek. 5:14</a>; <a href='/AIV/24/9/12'>Jer. 9:12</a>",
      "comment": "Desolation is God's response to persistent sin, drawing on language from earlier prophets."
    },
    {
      "pk": 33029,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 29,
      "text": "Then they will know that I am the LORD when I have made the land a desolation and a waste because of all their abominations they have committed.",
      "links": "<a href='/AIV/26/6/7'>Ezek. 6:7</a>",
      "comment": "The theme 'then they will know that I am the LORD' recurs, emphasizing that God’s acts reveal His holiness and sovereignty."
    },
    {
      "pk": 33030,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 30,
      "text": "As for you, son of man, your people are talking about you by the walls and at the doors of the houses. They speak to one another, each to his brother, saying, 'Come now, and hear what the word is that comes from the LORD.'",
      "links": "<a href='/AIV/26/14/1'>Ezek. 14:1</a>",
      "comment": "There is an interest in hearing God's word, but not in obeying it—a recurring spiritual danger."
    },
    {
      "pk": 33031,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 31,
      "text": "They come to you as people come, and they sit before you as My people; they listen to your words, but do not put them into practice. With their mouths they show much love, but their hearts are set only on selfish gain.",
      "links": "<a href='/AIV/23/29/13'>Isa. 29:13</a>; <a href='/AIV/40/15/8'>Matt. 15:8</a>",
      "comment": "This verse warns against mere external religiosity, a theme Jesus rebukes in <a href='/AIV/40/15/8'>Matt. 15:8</a>."
    },
    {
      "pk": 33032,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 32,
      "text": "Look, you are to them like one who sings love songs with a beautiful voice and plays skillfully on an instrument—they hear your words, but they do not do them.",
      "links": "<a href='/AIV/26/33/31'>Ezek. 33:31</a>; <a href='/AIV/40/7/26'>Matt. 7:26</a>",
      "comment": "Ezekiel’s message is enjoyed aesthetically but not obeyed, mirroring Jesus’ parable of the foolish builder."
    },
    {
      "pk": 33033,
      "translation": "AIV",
      "book": 26,
      "chapter": 33,
      "verse": 33,
      "text": "Yet when all this comes to pass—and it surely will—they will know that a prophet has been among them.",
      "links": "<a href='/AIV/26/2/5'>Ezek. 2:5</a>; <a href='/AIV/40/24/35'>Matt. 24:35</a>",
      "comment": "Fulfillment confirms the legitimacy of true prophecy, foreshadowing the ultimate validation of Christ’s words and deeds."
    }
  ],
  "translatedAt": "2025-12-23T07:04:05.516Z"
}