{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 22,
  "verses": [
    {
      "pk": 2024001,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 1,
      "text": "The word of the Lord came to me, saying:",
      "links": "<a href='/AIV/26/20/45'>Ezekiel 20:45</a>",
      "comment": "A standard prophetic introduction, affirming the authority and divine source of Ezekiel's message."
    },
    {
      "pk": 2024002,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 2,
      "text": "Son of man, will you judge, will you judge the city of blood? Then declare to her all her abominations.",
      "links": "<a href='/AIV/26/20/4'>Ezekiel 20:4</a>, <a href='/AIV/26/24/6'>Ezekiel 24:6</a>",
      "comment": "\"City of blood\" refers to Jerusalem, notorious for violence and injustice. The repetition stresses the seriousness of the accusation."
    },
    {
      "pk": 2024003,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 3,
      "text": "You shall say, Thus says the Lord GOD: O city that sheds blood in her midst, causing her time to come, and makes idols to defile herself!",
      "links": "<a href='/AIV/26/7/23'>Ezekiel 7:23</a>, <a href='/AIV/26/6/4'>Ezekiel 6:4</a>",
      "comment": "Bloodshed brings judgment, and idolatry is shown as self-defilement, laying grounds for both literal punishment and spiritual corruption."
    },
    {
      "pk": 2024004,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 4,
      "text": "By your blood that you have shed, you are guilty, and by the idols you have made, you have defiled yourself. You have brought your days near, and have come to your years. Therefore I have made you a reproach to the nations and a mockery to all lands.",
      "links": "<a href='/AIV/19/79/4'>Psalm 79:4</a>, <a href='/AIV/25/2/15'>Lamentations 2:15</a>",
      "comment": "The city's suffering is described as deserved and inevitable. Notice the statement of guilt and defilement – pointing toward the need for cleansing and reconciliation with God."
    },
    {
      "pk": 2024005,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 5,
      "text": "Those who are near and those who are far from you will mock you, you infamous one, full of turmoil.",
      "links": "<a href='/AIV/19/44/14'>Psalm 44:14</a>, <a href='/AIV/18/30/1'>Job 30:1</a>",
      "comment": "Sin brings public shame; both neighbors and distant peoples recognize Israel’s fall. Spiritual isolation follows moral decline."
    },
    {
      "pk": 2024006,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 6,
      "text": "See, the princes of Israel, each according to his power, have been in you to shed blood.",
      "links": "<a href='/AIV/26/22/27'>Ezekiel 22:27</a>, <a href='/AIV/19/82/2'>Psalm 82:2-4</a>",
      "comment": "Leadership is corrupt—political and religious leaders are complicit in injustice. This recalls later New Testament warnings about corrupt leadership (John 10:12-13)."
    },
    {
      "pk": 2024007,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 7,
      "text": "Father and mother have been treated with contempt in you; the foreigner has been oppressed in your midst; the orphan and widow have been wronged in you.",
      "links": "<a href='/AIV/2/22/21-22'>Exodus 22:21-22</a>, <a href='/AIV/19/94/6'>Psalm 94:6</a>",
      "comment": "Breakdown of family and social justice is a sign of spiritual sickness (James 1:27). Honor and compassion are absent."
    },
    {
      "pk": 2024008,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 8,
      "text": "You have despised my holy things and have profaned my Sabbaths.",
      "links": "<a href='/AIV/26/20/13'>Ezekiel 20:13</a>, <a href='/AIV/3/19/30'>Leviticus 19:30</a>",
      "comment": "Sacred times and objects are rejected—this foreshadows New Testament emphasis on the holiness of the worship of God (Hebrews 10:25)."
    },
    {
      "pk": 2024009,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 9,
      "text": "In you are men who slander to shed blood, and in you are those who eat on the mountains; in your midst they commit lewdness.",
      "links": "<a href='/AIV/19/15/3'>Psalm 15:3</a>, <a href='/AIV/26/18/6'>Ezekiel 18:6</a>",
      "comment": "Mountains reference idol feasts (see Ezekiel 18:6). Slander and immorality are listed together—sin corrupts society and worship alike."
    },
    {
      "pk": 2024010,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 10,
      "text": "In you, a father's nakedness has been uncovered; in you, women are violated during their uncleanness.",
      "links": "<a href='/AIV/3/18/7'>Leviticus 18:7</a>, <a href='/AIV/3/20/18'>Leviticus 20:18</a>",
      "comment": "Sexual sins break Mosaic law and cause spiritual pollution. This points to the need for deep moral renewal."
    },
    {
      "pk": 2024011,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 11,
      "text": "One has committed abomination with his neighbor's wife; another has lewdly defiled his daughter-in-law; another in you has violated his sister, his father's daughter.",
      "links": "<a href='/AIV/3/18/20'>Leviticus 18:20</a>, <a href='/AIV/3/18/15'>Leviticus 18:15</a>",
      "comment": "Catalog of sexual sins. The breaking of these laws later is spiritualized in the prophets as typifying spiritual unfaithfulness (e.g., Hosea, Jeremiah 3:8-9)."
    },
    {
      "pk": 2024012,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 12,
      "text": "In you, people take bribes to shed blood; you take interest and profit; you have extorted your neighbor by oppression, and you have forgotten me, says the Lord GOD.",
      "links": "<a href='/AIV/2/23/7-8'>Exodus 23:7-8</a>, <a href='/AIV/3/25/36'>Leviticus 25:36</a>",
      "comment": "Economic injustice and oppression are equated with forgetting God Himself—a warning found again in Jesus’ condemnation of the Pharisees (Luke 11:42)."
    },
    {
      "pk": 2024013,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 13,
      "text": "See, I strike my hand at the dishonest gain that you have made and at the blood that has been shed in your midst.",
      "links": "<a href='/AIV/26/21/17'>Ezekiel 21:17</a>, <a href='/AIV/19/106/40'>Psalm 106:40</a>",
      "comment": "God’s judgment here is both personal and judicial—‘striking the hand’ is an emphatic gesture of condemnation. Divine anger is revealed."
    },
    {
      "pk": 2024014,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 14,
      "text": "Can your heart endure, or can your hands be strong, in the days that I will deal with you? I, the Lord, have spoken, and I will act.",
      "links": "<a href='/AIV/26/6/7'>Ezekiel 6:7</a>, <a href='/AIV/26/5/8'>Ezekiel 5:8</a>",
      "comment": "Human strength is futile against divine judgment; God both declares and executes the sentence."
    },
    {
      "pk": 2024015,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 15,
      "text": "I will scatter you among the nations and disperse you throughout the lands, and I will purify you of your uncleanness.",
      "links": "<a href='/AIV/3/26/33'>Leviticus 26:33</a>, <a href='/AIV/26/36/25'>Ezekiel 36:25</a>",
      "comment": "Exile leads to purification—a theme that points to the Christian understanding of suffering as purifying (Malachi 3:3, Hebrews 12:6-11)."
    },
    {
      "pk": 2024016,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 16,
      "text": "And you will be profaned in yourself before the eyes of the nations, and you shall know that I am the LORD.",
      "links": "<a href='/AIV/26/20/44'>Ezekiel 20:44</a>, <a href='/AIV/26/6/7'>Ezekiel 6:7</a>",
      "comment": "Humiliation will lead to recognition of God’s authority. This anticipates the motif of metanoia—conversion and return to true worship."
    },
    {
      "pk": 2024017,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 17,
      "text": "And the word of the LORD came to me, saying:",
      "links": "",
      "comment": "Transition; indicates a new section of prophetic speech. Repeated formula emphasizes divine initiative."
    },
    {
      "pk": 2024018,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 18,
      "text": "Son of man, the house of Israel has become dross to me; all of them are bronze and tin and iron and lead in the midst of the furnace. They are dross of silver.",
      "links": "<a href='/AIV/19/119/119'>Psalm 119:119</a>, <a href='/AIV/24/6/27-30'>Jeremiah 6:27-30</a>",
      "comment": "\"Dross\" symbolizes impurity; God's people lack the purity needed for true worship. This concept is foundational for the spiritual cleansing described later in the prophets and in the New Testament."
    },
    {
      "pk": 2024019,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 19,
      "text": "Therefore thus says the Lord GOD: Because you have all become dross, therefore, I will gather you into Jerusalem.",
      "links": "<a href='/AIV/26/22/20'>Ezekiel 22:20</a>",
      "comment": "Gathering for judgment, reminiscent of the way ‘chaff’ is separated from wheat (Matthew 3:12)."
    },
    {
      "pk": 2024020,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 20,
      "text": "As one gathers silver and bronze and iron and lead and tin into a furnace, to blow fire on it, to melt it, so I will gather you in my anger and in my wrath, and I will put you there and melt you.",
      "links": "<a href='/AIV/19/66/10'>Isaiah 66:10</a>, <a href='/AIV/19/12/6'>Psalm 12:6</a>",
      "comment": "The image of smelting points to purification by trials—anticipating Christian imagery of sanctification through suffering (1 Peter 1:6-7)."
    },
    {
      "pk": 2024021,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 21,
      "text": "I will gather you and blow on you with the fire of my wrath, and you shall be melted in Jerusalem.",
      "links": "<a href='/AIV/3/17/4'>Genesis 17:4</a>, <a href='/AIV/26/22/22'>Ezekiel 22:22</a>",
      "comment": "Judgment is intense but purposed for transformation—Jerusalem itself becomes the furnace."
    },
    {
      "pk": 2024022,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 22,
      "text": "As silver is melted in a furnace, so you shall be melted in it, and you shall know that I, the LORD, have poured out my wrath upon you.",
      "links": "<a href='/AIV/26/20/38'>Ezekiel 20:38</a>, <a href='/AIV/19/106/43'>Psalm 106:43</a>",
      "comment": "Divine wrath seeks to restore knowledge of God’s lordship. The purification motif connects with sacramental theology regarding cleansing and renewal."
    },
    {
      "pk": 2024023,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 23,
      "text": "And the word of the LORD came to me, saying:",
      "links": "",
      "comment": "A new oracle begins, emphasizing the prophet’s obedience and relationship to the word."
    },
    {
      "pk": 2024024,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 24,
      "text": "Son of man, say to her: You are a land that is not cleansed, nor rained upon in the day of indignation.",
      "links": "<a href='/AIV/11/8/35'>1 Kings 8:35</a>, <a href='/AIV/13/21/27'>1 Chronicles 21:27</a>",
      "comment": "Absence of rain symbolizes God withholding blessing, a sign of spiritual drought and impurity."
    },
    {
      "pk": 2024025,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 25,
      "text": "The conspiracy of her prophets in her midst is like a roaring lion tearing the prey; they devour lives, take treasure and precious things, and make many widows in her midst.",
      "links": "<a href='/AIV/26/13/10'>Ezekiel 13:10</a>, <a href='/AIV/19/22/13'>Psalm 22:13</a>",
      "comment": "Prophets misuse spiritual authority for personal gain, which highlights the need for authentic spiritual leadership (John 10:11-15)."
    },
    {
      "pk": 2024026,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 26,
      "text": "Her priests have done violence to my law and have profaned my holy things; they have made no distinction between the holy and the common, nor have they taught the difference between the unclean and the clean, and they have hidden their eyes from my Sabbaths, so that I am profaned among them.",
      "links": "<a href='/AIV/3/10/10'>Leviticus 10:10</a>, <a href='/AIV/26/44/23'>Ezekiel 44:23</a>",
      "comment": "Priests' failure to teach and maintain sacred distinctions points to the value of careful tradition and sacramental practice (see Matthew 16:19, John 20:23)."
    },
    {
      "pk": 2024027,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 27,
      "text": "Her officials in her midst are like wolves tearing the prey, shedding blood, destroying lives to get dishonest gain.",
      "links": "<a href='/AIV/26/22/6'>Ezekiel 22:6</a>, <a href='/AIV/36/3/3'>Zephaniah 3:3</a>",
      "comment": "Political leaders act as predators, as foretold in other prophecies. This connects with Jesus’ warnings of false shepherds (John 10:12-13)."
    },
    {
      "pk": 2024028,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 28,
      "text": "Her prophets have smeared whitewash for them, seeing false visions and giving lying divinations, saying, 'This is what the Lord GOD says,' when the LORD has not spoken.",
      "links": "<a href='/AIV/26/13/10'>Ezekiel 13:10</a>, <a href='/AIV/24/23/16'>Jeremiah 23:16</a>",
      "comment": "'Whitewash' symbolizes superficiality in teaching; true prophecy is essential for spiritual health. See Matthew 23:27-28 for Christ’s condemnation of hypocrisy."
    },
    {
      "pk": 2024029,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 29,
      "text": "The people of the land have practiced extortion and committed robbery. They have oppressed the poor and needy, and have extorted the foreigner without justice.",
      "links": "<a href='/AIV/2/22/21-22'>Exodus 22:21-22</a>, <a href='/AIV/26/18/7'>Ezekiel 18:7</a>",
      "comment": "Social injustice is condemned by the law (see also James 2:1-7). Justice and charity are central for the Christian life."
    },
    {
      "pk": 2024030,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 30,
      "text": "I sought for a man among them who would build up a wall and stand in the breach before me for the land, that I should not destroy it, but I found none.",
      "links": "<a href='/AIV/19/106/23'>Psalm 106:23</a>, <a href='/AIV/26/13/5'>Ezekiel 13:5</a>",
      "comment": "This intercessory role is later fulfilled perfectly by Christ, who stands as mediator (1 Timothy 2:5, Hebrews 7:25). Spiritual leadership is vital."
    },
    {
      "pk": 2024031,
      "translation": "AIV",
      "book": 26,
      "chapter": 22,
      "verse": 31,
      "text": "Therefore I have poured out my wrath on them; I have consumed them with the fire of my anger. Their own actions I have returned upon their heads, says the Lord GOD.",
      "links": "<a href='/AIV/19/7/16'>Psalm 7:16</a>, <a href='/AIV/19/79/12'>Psalm 79:12</a>",
      "comment": "Divine justice involves both punishment and purification; note, God's justice returns evil upon itself but ultimate aim is restoration—a theme fulfilled in Christ’s redemptive work."
    }
  ],
  "translatedAt": "2025-12-23T06:57:34.652Z"
}