{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 36,
  "verses": [
    {
      "pk": 33036001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 1,
      "text": "You, son of man, prophesy to the mountains of Israel and say: ‘Mountains of Israel, hear the word of the LORD!’",
      "links": "<a href='/AIV/26/6/2'>Ezek. 6:2</a>;<a href='/AIV/26/36/4'>v.4</a>",
      "comment": "Here, Ezekiel is instructed to address the mountains, representing the whole land and people of Israel. This passage foreshadows the idea of restoration for God’s chosen people and prefigures spiritual renewal."
    },
    {
      "pk": 33036002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 2,
      "text": "The Lord GOD says: Because the enemy has said against you, ‘Aha! Even the ancient heights have become our possession,’",
      "links": "<a href='/AIV/25/2/16'>Lam. 2:16</a>;<a href='/AIV/26/25/3'>Ezek. 25:3</a>",
      "comment": "The ‘ancient heights’ refers to the territories formerly belonging to Israel, now mocked and claimed by enemies. God’s response emphasizes His authority over the land."
    },
    {
      "pk": 33036003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 3,
      "text": "therefore, prophesy and say: ‘This is what the Lord GOD says: Because people have laid you waste and trampled you from every side, so you have become a possession for the rest of the nations and have been spoken about by the lips of gossipers and slanderers among the people,’",
      "links": "<a href='/AIV/26/34/28'>Ezek. 34:28</a>; <a href='/AIV/19/44/13'>Ps. 44:13-14</a>",
      "comment": "Israel’s humiliation among the nations highlights God’s justice in discipline but also prepares the way for His mercy and restoration."
    },
    {
      "pk": 33036004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 4,
      "text": "therefore, you mountains of Israel, hear the word of the Lord GOD: ‘Mountains and hills, rivers and valleys, desolate ruins and deserted towns, which have become prey and derision to the rest of the nations all around—’",
      "links": "<a href='/AIV/26/6/3-5'>Ezek. 6:3-5</a>",
      "comment": "The scope of the address broadens to all geographical features, signifying God’s concern for the entirety of His people and land."
    },
    {
      "pk": 33036005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 5,
      "text": "Therefore, this is what the Lord GOD says: ‘Surely in my burning jealousy I have spoken against the rest of the nations and against all Edom, who appropriated my land with all joy and contempt in their hearts, to plunder its pastureland.’",
      "links": "<a href='/AIV/26/25/12-14'>Ezek. 25:12-14</a>",
      "comment": "God's 'jealousy' shows His zealous love and protection for His chosen people and their inheritance, foreshadowing future restoration and the importance of divine right."
    },
    {
      "pk": 33036006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 6,
      "text": "Prophesy concerning the land of Israel and say to the mountains and hills, to the rivers and valleys: ‘This is what the Lord GOD says: Behold, I have spoken in my jealous anger, because you have borne the shame of the nations.’",
      "links": "<a href='/AIV/19/74/10'>Ps. 74:10</a>;<a href='/AIV/26/34/29'>Ezek. 34:29</a>",
      "comment": "The repeated mention of shame recalls the theme of exile. Restoration will come from God's initiative, anticipating the New Covenant where God acts unilaterally to save."
    },
    {
      "pk": 33036007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 7,
      "text": "Therefore thus says the Lord GOD: I have raised my hand in oath that the nations around you will themselves bear their shame.",
      "links": "<a href='/AIV/26/5/15'>Ezek. 5:15</a>; <a href='/AIV/26/21/5'>Ezek. 21:5</a>",
      "comment": "God makes an oath (literally, lifts His hand), highlighting the certainty of judgment on the nations and the reversal of fortunes for Israel."
    },
    {
      "pk": 33036008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 8,
      "text": "But you, mountains of Israel, will produce your branches and bear fruit for my people Israel, for they will soon return.",
      "links": "<a href='/AIV/26/34/27'>Ezek. 34:27</a>; <a href='/AIV/25/3/23'>Lam. 3:23</a>",
      "comment": "The land’s renewal is a sign that God’s people will be restored. This physical restoration prefigures spiritual renewal in God’s plan."
    },
    {
      "pk": 33036009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 9,
      "text": "For behold, I am for you, and I will turn toward you, and you will be tilled and sown.",
      "links": "<a href='/AIV/28/14/7'>Hos. 14:7</a>",
      "comment": "God’s personal commitment reverses earlier judgment and shows His intimate involvement in the new life of His people and their land."
    },
    {
      "pk": 33036010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 10,
      "text": "I will multiply people upon you—the whole house of Israel, all of it. The cities will be inhabited, and the ruins rebuilt.",
      "links": "<a href='/AIV/26/17/23'>Ezek. 17:23</a>; <a href='/AIV/23/58/12'>Isa. 58:12</a>",
      "comment": "The use of ‘whole house of Israel’ points ahead to the unification of God’s people. The promise of rebuilding has both a literal and spiritual dimension."
    },
    {
      "pk": 33036011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 11,
      "text": "I will multiply people and animals upon you, and they will increase and be fruitful. I will resettle you as in the beginning and do better for you than at your first. Then you will know that I am the LORD.",
      "links": "<a href='/AIV/26/36/37-38'>v.37-38</a>; <a href='/AIV/02/01/7'>Exod. 1:7</a>",
      "comment": "'Be fruitful' echoes Genesis, emphasizing new creation. The superior blessings promised here allude to a future era of even greater grace."
    },
    {
      "pk": 33036012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 12,
      "text": "I will cause people—my own people Israel—to walk upon you. They will possess you, and you will be their inheritance, and you will never again deprive them of children.",
      "links": "<a href='/AIV/04/13/2'>Num. 13:2</a>",
      "comment": "The land is closely tied to inheritance, covenant, and family—a foretaste of eternal inheritance promised to the faithful."
    },
    {
      "pk": 33036013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 13,
      "text": "This is what the Lord GOD says: Because people say to you, ‘You devour people and deprive your nation of children,’",
      "links": "<a href='/AIV/04/13/32'>Num. 13:32</a>",
      "comment": "Reflects accusations that the land brought suffering; God will reverse this curse for His people—a pattern continued in salvation history."
    },
    {
      "pk": 33036014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 14,
      "text": "therefore you will no longer devour people or deprive your nation of children, declares the Lord GOD.",
      "links": "<a href='/AIV/26/37/23'>Ezek. 37:23</a>",
      "comment": "'No longer devour people' shows God’s ownership and power to bring blessing out of former judgment—anticipating spiritual fruitfulness."
    },
    {
      "pk": 33036015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 15,
      "text": "I will no longer let you hear the taunts of the nations, nor will you bear the reproach of the peoples anymore, nor will you cause your nation to stumble, declares the Lord GOD.",
      "links": "<a href='/AIV/22/54/4'>Isa. 54:4</a>; <a href='/AIV/24/31/19'>Jer. 31:19</a>",
      "comment": "Promises of deliverance and honor speak to God’s ultimate plan to glorify His people—fulfilled in Christ’s body, the Church."
    },
    {
      "pk": 33036016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 16,
      "text": "The word of the LORD came to me:",
      "links": "<a href='/AIV/26/35/1'>Ezek. 35:1</a>",
      "comment": "A recurring formula in Ezekiel introducing a new divine message."
    },
    {
      "pk": 33036017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 17,
      "text": "Son of man, when the house of Israel lived in their own land, they defiled it by their ways and actions; their conduct was unclean before me like a woman’s impurity.",
      "links": "<a href='/AIV/03/12/2'>Lev. 12:2</a>; <a href='/AIV/19/106/39'>Ps. 106:39</a>",
      "comment": "Sin is compared to ritual impurity, emphasizing both individual and corporate responsibility for holiness—a central concept in divine worship."
    },
    {
      "pk": 33036018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 18,
      "text": "So I poured out my wrath upon them because of the blood they had shed in the land and because they defiled it with their idols.",
      "links": "<a href='/AIV/19/106/38'>Ps. 106:38</a>; <a href='/AIV/26/7/20'>Ezek. 7:20</a>",
      "comment": "Idolatry and bloodshed bring about exile and punishment; God’s justice paves the way for acts of mercy."
    },
    {
      "pk": 33036019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 19,
      "text": "I scattered them among the nations, and they were dispersed among the countries. I judged them according to their ways and deeds.",
      "links": "<a href='/AIV/03/26/33'>Lev. 26:33</a>; <a href='/AIV/26/5/10'>Ezek. 5:10</a>",
      "comment": "The exile is a consequence of covenant unfaithfulness (see also Deut. 28)."
    },
    {
      "pk": 33036020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 20,
      "text": "Wherever they went among the nations, they profaned my holy name, for people said of them, ‘These are the LORD’s people, yet they had to leave his land.’",
      "links": "<a href='/AIV/23/52/5'>Isa. 52:5</a>",
      "comment": "Israel’s failure brought dishonor to God’s name, a theme later addressed by Christ who sanctifies the Father’s name (see <a href='/AIV/40/06/9'>Matt. 6:9</a>)."
    },
    {
      "pk": 33036021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 21,
      "text": "But I was concerned for my holy name, which the house of Israel had profaned among the nations to which they had gone.",
      "links": "<a href='/AIV/26/20/9'>Ezek. 20:9</a>",
      "comment": "God’s motivation to restore Israel arises from His concern for His own holiness—a foundational principle of God’s covenant actions."
    },
    {
      "pk": 33036022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 22,
      "text": "Therefore say to the house of Israel, ‘This is what the Lord GOD says: It is not for your sake, house of Israel, that I am acting, but for my holy name, which you have profaned among the nations where you have gone.’",
      "links": "<a href='/AIV/05/09/5'>Deut. 9:5</a>; <a href='/AIV/26/39/25'>Ezek. 39:25</a>",
      "comment": "God’s restoration is grounded in His own faithfulness, not Israel’s merit—a key element in the doctrine of grace."
    },
    {
      "pk": 33036023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 23,
      "text": "I will sanctify my great name, which was profaned among the nations—the name you have profaned among them. Then the nations will know that I am the LORD, declares the Lord GOD, when I show myself holy through you before their eyes.",
      "links": "<a href='/AIV/02/09/16'>Exod. 9:16</a>; <a href='/AIV/26/28/22'>Ezek. 28:22</a>",
      "comment": "Through Israel, God’s holiness will be revealed to all nations—a foreshadowing of how the Church displays God's holiness to the world."
    },
    {
      "pk": 33036024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 24,
      "text": "For I will take you from the nations and gather you out of all the countries and bring you back into your own land.",
      "links": "<a href='/AIV/24/23/3'>Jer. 23:3</a>; <a href='/AIV/26/11/17'>Ezek. 11:17</a>",
      "comment": "An act of divine gathering, prefiguring future spiritual gatherings of God’s people into a united community."
    },
    {
      "pk": 33036025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 25,
      "text": "Then I will sprinkle clean water on you, and you will be clean; I will cleanse you from all your impurity and from all your idols.",
      "links": "<a href='/AIV/03/14/7-8'>Lev. 14:7-8</a>; <a href='/AIV/43/3/5'>John 3:5</a>",
      "comment": "Here, 'sprinkle clean water' is a clear Old Testament basis for the symbolism of water cleansing, fulfilled in the sacrament of baptism (see also Titus 3:5)."
    },
    {
      "pk": 33036026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 26,
      "text": "I will give you a new heart and put a new spirit within you. I will remove from you your heart of stone and give you a heart of flesh.",
      "links": "<a href='/AIV/24/24/7'>Jer. 24:7</a>; <a href='/AIV/26/11/19'>Ezek. 11:19</a>",
      "comment": "The promise of a new heart and new spirit foreshadows regeneration and sanctification, accomplished by the Holy Spirit in the New Covenant."
    },
    {
      "pk": 33036027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 27,
      "text": "I will put my Spirit within you and move you to follow my statutes and be careful to keep my judgments.",
      "links": "<a href='/AIV/29/2/28'>Joel 2:28</a>; <a href='/AIV/43/14/16-17'>John 14:16-17</a>",
      "comment": "The indwelling Spirit enables faithful obedience. In Christian interpretation, this promise comes to fulfillment at Pentecost and in the life of the Church."
    },
    {
      "pk": 33036028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 28,
      "text": "You will live in the land that I gave to your forefathers; you will be my people, and I will be your God.",
      "links": "<a href='/AIV/01/17/8'>Gen. 17:8</a>; <a href='/AIV/26/37/27'>Ezek. 37:27</a>",
      "comment": "Restoration to the land reiterates God’s everlasting covenant and presence among His people (see Rev. 21:3 for an ultimate fulfillment)."
    },
    {
      "pk": 33036029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 29,
      "text": "I will deliver you from all your defilements. I will call for the grain and multiply it and will not bring famine upon you.",
      "links": "<a href='/AIV/26/34/29'>Ezek. 34:29</a>",
      "comment": "Physical and spiritual prosperity are intertwined. Restoration is comprehensive—removing sin and providing blessing."
    },
    {
      "pk": 33036030,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 30,
      "text": "I will increase the fruit of the trees and the crops of the field, so that you will never again suffer the reproach of famine among the nations.",
      "links": "<a href='/AIV/03/26/4'>Lev. 26:4</a>",
      "comment": "Material blessing is presented as a sign of God’s favor and care, but ultimately spiritual fulfillment is found in the new creation."
    },
    {
      "pk": 33036031,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 31,
      "text": "Then you will remember your evil ways and your deeds that were not good, and you will loathe yourselves for your iniquities and your abominations.",
      "links": "<a href='/AIV/26/20/43'>Ezek. 20:43</a>",
      "comment": "True repentance and contrition flow from God’s mercy and grace, leading to a changed heart and true transformation."
    },
    {
      "pk": 33036032,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 32,
      "text": "I am not doing this for your sake, declares the Lord GOD. Let it be known to you! Be ashamed and confounded for your ways, O house of Israel.",
      "links": "<a href='/AIV/26/36/22'>v.22</a>",
      "comment": "God's grace is unmerited, stirring humility and remorse. This foreshadows the New Testament emphasis on grace."
    },
    {
      "pk": 33036033,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 33,
      "text": "Thus says the Lord GOD: On the day that I cleanse you from all your iniquities, I will cause the cities to be inhabited, and the ruins shall be rebuilt.",
      "links": "<a href='/AIV/23/44/26'>Isa. 44:26</a>",
      "comment": "The transformation of the land mirrors the cleansing and sanctification of God’s people."
    },
    {
      "pk": 33036034,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 34,
      "text": "The desolate land will be tilled, instead of lying desolate in the sight of all who passed by.",
      "links": "<a href='/AIV/23/60/15'>Isa. 60:15</a>",
      "comment": "Restoration is visible testimony to outsiders of God’s power and faithfulness."
    },
    {
      "pk": 33036035,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 35,
      "text": "They will say, ‘This land that was desolate has become like the garden of Eden; and the cities once ruined and desolate are now inhabited and fortified.’",
      "links": "<a href='/AIV/01/02/8'>Gen. 2:8</a>; <a href='/AIV/29/2/3'>Joel 2:3</a>",
      "comment": "Garden of Eden imagery recalls God’s original creation—a sign of complete restoration and peace."
    },
    {
      "pk": 33036036,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 36,
      "text": "Then the nations left around you will know that I, the LORD, have rebuilt what was demolished and have replanted what was desolate. I, the LORD, have spoken, and I will do it.",
      "links": "<a href='/AIV/26/17/24'>Ezek. 17:24</a>",
      "comment": "God’s restoration is definitive and public. This fulfills God’s purpose in glorifying Himself among all peoples."
    },
    {
      "pk": 33036037,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 37,
      "text": "Thus says the Lord GOD: I will also let the house of Israel ask me to do this for them: to multiply their people like a flock.",
      "links": "<a href='/AIV/26/36/11'>v.11</a>; <a href='/AIV/19/65/9-13'>Ps. 65:9-13</a>",
      "comment": "God’s promises involve the response of prayer; He invites His people’s petition, showing the importance of communal intercession and supplication."
    },
    {
      "pk": 33036038,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 36,
      "verse": 38,
      "text": "Like the flock for sacrifices, like the flock at Jerusalem during her appointed feasts, so will the ruined cities be filled with flocks of people. Then they will know that I am the LORD.",
      "links": "<a href='/AIV/02/12/3-6'>Exod. 12:3-6</a>; <a href='/AIV/19/100/3'>Ps. 100:3</a>",
      "comment": "The abundance of people is compared to the multitudes at Jerusalem’s worship feasts, prefiguring the fullness of redemption and worship in the city of God."
    }
  ],
  "translatedAt": "2025-12-24T09:18:36.800Z"
}