{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 3,
  "verses": [
    {
      "pk": 33003001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 1,
      "text": "Then He said to me, 'Son of man, eat what you find here. Eat this scroll, and go, speak to the house of Israel.'",
      "links": "<a href='/AIV/26/2/8'>Ezek. 2:8</a>; <a href='/AIV/24/15/16'>Jer. 15:16</a>; <a href='/AIV/66/10/9'>Rev. 10:9</a>",
      "comment": "God commands Ezekiel to eat the scroll, symbolizing his total acceptance and interiorization of God's word, preparing him to speak with divine authority. This prefigures the prophet’s mission and also points towards the necessity of receiving and internalizing divine revelation for all those who proclaim God’s message. Compare Revelation 10:9, where John also eats a scroll; both passages show the close continuity of prophecy and divine mission through God’s messengers."
    },
    {
      "pk": 33003002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 2,
      "text": "So I opened my mouth, and He made me eat the scroll.",
      "links": "<a href='/AIV/26/2/9'>Ezek. 2:9</a>",
      "comment": "Ezekiel’s obedience to God is emphasized. The prophet’s submission is a model for all who serve God: accepting even difficult commands with humility. In spiritual interpretation, it calls for trusting God's provision even when it challenges us."
    },
    {
      "pk": 33003003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 3,
      "text": "And He said to me, 'Son of man, feed your belly and fill your stomach with this scroll that I give you.' So I ate, and it was in my mouth as sweet as honey.",
      "links": "<a href='/AIV/19/119/103'>Ps. 119:103</a>; <a href='/AIV/66/10/10'>Rev. 10:10</a>",
      "comment": "Though the scroll contains words of lamentation and woe, its taste is sweet, reflecting the sweetness of God’s Word to those who faithfully receive it. Compare Psalm 119:103, 'How sweet are your words to my taste!' This echoes the spiritual principle that obedience to God brings an inner joy despite outward hardship."
    },
    {
      "pk": 33003004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 4,
      "text": "And He said to me, 'Son of man, go to the house of Israel and speak My words to them.'",
      "links": "<a href='/AIV/26/2/3'>Ezek. 2:3</a>",
      "comment": "Ezekiel’s mission is divinely appointed—he is to speak only God’s words, not human wisdom. This underscores the prophetic office as a divine calling, not a self-appointed role."
    },
    {
      "pk": 33003005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 5,
      "text": "For you are not sent to a people of obscure speech or of a difficult language, but to the house of Israel—",
      "links": "<a href='/AIV/23/28/11'>Isa. 28:11</a>",
      "comment": "God emphasizes that Ezekiel’s audience is his own people, not foreigners. This highlights a recurring biblical theme: the prophet first addresses God's chosen people, emphasizing their responsibility. See also Romans 1:16—the gospel is 'first to the Jew.'"
    },
    {
      "pk": 33003006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 6,
      "text": "Not to many peoples of obscure speech or of a difficult language, whose words you cannot understand. If I sent you to them, surely they would listen to you.",
      "links": "<a href='/AIV/40/11/21-22'>Matt. 11:21-22</a>",
      "comment": "A rebuke: foreign nations would more readily respond than Israel. This anticipates Jesus’ own experience of rejection in his hometown (Luke 4:24) and the later mission to the Gentiles (Acts 28:28)."
    },
    {
      "pk": 33003007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 7,
      "text": "But the house of Israel will not be willing to listen to you, because they are not willing to listen to Me; for all the house of Israel are hard of forehead and stubborn of heart.",
      "links": "<a href='/AIV/26/2/4'>Ezek. 2:4</a>; <a href='/AIV/44/7/51'>Acts 7:51</a>",
      "comment": "Israel’s unwillingness is ultimately a rejection of God, not just Ezekiel. See Acts 7:51, where Stephen similarly accuses Israel of stubbornness. The imagery of 'hard forehead and stubborn heart' highlights spiritual resistance and sin."
    },
    {
      "pk": 33003008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 8,
      "text": "See, I have made your face as hard as their faces, and your forehead as hard as their foreheads.",
      "links": "<a href='/AIV/26/3/9'>Ezek. 3:9</a>",
      "comment": "God equips His servant with strength to match the people’s resistance. There’s an implicit trust that divine grace will make the prophet equal to his vocation, recalling St. Paul’s 'strength made perfect in weakness' (2 Cor. 12:9)."
    },
    {
      "pk": 33003009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 9,
      "text": "Like diamond harder than flint, I have made your forehead. Do not be afraid of them, nor dismayed at their looks, for they are a rebellious house.'",
      "links": "<a href='/AIV/26/2/6'>Ezek. 2:6</a>",
      "comment": "God’s assurance echoes His promises everywhere to His prophets—He will strengthen them to withstand persecution and pressure. The description of the prophet’s resilience is a model for the saints who also endured with courage (Hebrews 11)."
    },
    {
      "pk": 33003010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 10,
      "text": "Moreover, He said to me, 'Son of man, receive in your heart all My words that I speak to you, and hear them with your ears.'",
      "links": "<a href='/AIV/19/119/11'>Ps. 119:11</a>",
      "comment": "God invites Ezekiel to internalize the message—both hearing and keeping it in the heart. This inner reception of God’s word prepares the prophet for mission. Scripture often speaks of the heart as the center of spiritual understanding (see Psalm 119:11)."
    },
    {
      "pk": 33003011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 11,
      "text": "'And go to the exiles, to the children of your people, and speak to them—whether they listen or not—and say to them, \"Thus says the Lord GOD.\"'",
      "links": "<a href='/AIV/26/2/5'>Ezek. 2:5</a>",
      "comment": "Like the prophets before him, Ezekiel’s duty is to be a faithful messenger, irrespective of the people’s response. The phrase 'Thus says the Lord GOD' emphasizes the authority behind his message."
    },
    {
      "pk": 33003012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 12,
      "text": "Then the Spirit lifted me up, and I heard behind me the voice of a great earthquake saying, 'Blessed be the glory of the LORD from His place!'",
      "links": "<a href='/AIV/23/6/1-4'>Isa. 6:1-4</a>; <a href='/AIV/26/1/28'>Ezek. 1:28</a>",
      "comment": "The Spirit’s active role shows the divine initiative in prophetic mission. The voice praising God’s glory affirms His majesty and echoes Isaiah’s vision in the temple (Isaiah 6). The ‘great earthquake’ suggests the awe-inspiring presence of God."
    },
    {
      "pk": 33003013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 13,
      "text": "I also heard the sound of the wings of the living creatures brushing against one another, and the sound of the wheels beside them, and the sound of a great earthquake.",
      "links": "<a href='/AIV/26/1/15'>Ezek. 1:15</a>",
      "comment": "Repetition of imagery from Ezekiel’s initial vision (Ezek. 1). The living creatures and wheels reflect God’s sovereign movement and presence with His people, even in exile—He is not tied to one location."
    },
    {
      "pk": 33003014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 14,
      "text": "So the Spirit lifted me up and took me away, and I went in bitterness and in the anger of my spirit, and the hand of the LORD was strong upon me.",
      "links": "<a href='/AIV/26/1/3'>Ezek. 1:3</a>",
      "comment": "Ezekiel responds with inner turmoil—the prophet shares God’s sorrow and righteous indignation over Israel’s rebellion, yet is sustained by God’s hand. This recalls the experiences of others, like Jeremiah, whose hearts burned with God’s word (Jer. 20:9)."
    },
    {
      "pk": 33003015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 15,
      "text": "And I came to the exiles at Tel-abib, who lived by the river Chebar, and I stayed there for seven days, sitting among them, overwhelmed.",
      "links": "<a href='/AIV/26/1/1'>Ezek. 1:1</a>; <a href='/AIV/26/3/16'>Ezek. 3:16</a>",
      "comment": "Ezekiel’s seven days of silence mirrors mourning customs (Job 2:13). This period of contemplation prepares him for his prophetic ministry, a foreshadowing of times of spiritual retreat before major missions throughout salvation history."
    },
    {
      "pk": 33003016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 16,
      "text": "And at the end of seven days the word of the LORD came to me:",
      "links": "<a href='/AIV/26/1/3'>Ezek. 1:3</a>",
      "comment": "God initiates communication after a period of preparation. This pattern—divine call, prophetic preparation, and then commission—recurs in the calling of many prophets and apostles, showing the importance of readiness before ministry."
    },
    {
      "pk": 33003017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 17,
      "text": "'Son of man, I have made you a watchman for the house of Israel; whenever you hear a word from My mouth, give them warning from Me.'",
      "links": "<a href='/AIV/26/33/7'>Ezek. 33:7</a>",
      "comment": "The prophet’s role as watchman means he bears heavy responsibility. The idea of spiritual watchfulness reappears throughout Scripture—see Hebrews 13:17 and 1 Peter 5:2 for Christian leaders’ spiritual oversight. This points towards apostolic responsibility for guiding the faithful."
    },
    {
      "pk": 33003018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 18,
      "text": "'When I say to the wicked, \"You will surely die,\" and you do not warn him, or speak to warn the wicked from his wicked way, to save his life, that wicked person will die in his guilt, but I will require his blood at your hand.'",
      "links": "<a href='/AIV/26/33/8'>Ezek. 33:8</a>",
      "comment": "Ezekiel, as spiritual overseer, is accountable for faithfully proclaiming God’s warning. This emphasizes the gravity of responsibility for those called to spiritual leadership—echoed by Paul in Acts 20:26–27."
    },
    {
      "pk": 33003019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 19,
      "text": "'But if you warn the wicked, and he does not turn from his wickedness or from his wicked way, he will die in his guilt; but you will have delivered your soul.'",
      "links": "<a href='/AIV/26/33/9'>Ezek. 33:9</a>",
      "comment": "The prophet’s faithfulness absolves him, even if his message is rejected. True spiritual leaders are called to proclaim the truth, not to ensure results—a principle continued by Christ’s apostles (see 1 Cor 4:2)."
    },
    {
      "pk": 33003020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 20,
      "text": "'Again, if a righteous person turns from his righteousness and does evil, and I place a stumbling block before him, he will die. Since you have not warned him, he will die in his sin, and his righteous deeds that he has done will not be remembered, and I will require his blood at your hand.'",
      "links": "<a href='/AIV/26/18/24'>Ezek. 18:24</a>; <a href='/AIV/58/3/12-14'>Heb. 3:12-14</a>",
      "comment": "This verse affirms the reality that even the righteous can fall away—a clear teaching of personal responsibility and perseverance. It also speaks against any form of 'once saved, always saved.' The warning role highlights the importance of spiritual accountability within the Church."
    },
    {
      "pk": 33003021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 21,
      "text": "'But if you warn the righteous not to sin, and he does not sin, he will surely live because he took warning, and you will have delivered your soul.'",
      "links": "<a href='/AIV/26/18/9'>Ezek. 18:9</a>",
      "comment": "The true shepherd guides both sinner and righteous. Accepting correction is vital for spiritual life—a consistent scriptural thread (see Proverbs 9:8–9)."
    },
    {
      "pk": 33003022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 22,
      "text": "And the hand of the LORD was upon me there, and He said to me, 'Arise, go out into the plain, and I will speak with you there.'",
      "links": "<a href='/AIV/11/19/11'>1 Kings 19:11</a>",
      "comment": "A call to solitude: God often draws His servants apart for deeper instruction and encounter, a pattern seen in the lives of Jesus, Moses, and Elijah (see 1 Kings 19:11)."
    },
    {
      "pk": 33003023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 23,
      "text": "So I arose and went out into the plain, and there the glory of the LORD stood, like the glory that I had seen by the river Chebar. And I fell on my face.",
      "links": "<a href='/AIV/26/1/28'>Ezek. 1:28</a>",
      "comment": "Ezekiel again sees God's glory; his response—falling on his face—shows the proper reverence before the divine. Such encounters throughout Scripture prepare God's servants for mission."
    },
    {
      "pk": 33003024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 24,
      "text": "Then the Spirit entered into me and set me on my feet, and He spoke with me and said to me: 'Go, shut yourself inside your house.'",
      "links": "<a href='/AIV/26/2/2'>Ezek. 2:2</a>",
      "comment": "God’s Spirit empowers Ezekiel, continuing the recurring biblical theme that true service requires divine empowerment. God sometimes requires hiddenness, withdrawing His servants into solitude before public ministry."
    },
    {
      "pk": 33003025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 25,
      "text": "'But you, O son of man, behold, cords will be placed upon you, and you will be bound with them, so that you cannot go out among the people.'",
      "links": "<a href='/AIV/26/4/8'>Ezek. 4:8</a>",
      "comment": "The binding signifies limitations God will permit, perhaps external opposition or even symbolic actions. The spiritual meaning: some sufferings come through God’s mysterious providence for a vocation, echoing the apostle Paul's imprisonments for the sake of the Word."
    },
    {
      "pk": 33003026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 26,
      "text": "'And I will make your tongue stick to the roof of your mouth, so that you will be mute and unable to rebuke them, for they are a rebellious house.'",
      "links": "<a href='/AIV/26/24/27'>Ezek. 24:27</a>; <a href='/AIV/42/1/20'>Luke 1:20</a>",
      "comment": "Divine muteness as judgment: God sometimes withholds words when people persistently refuse correction. Compare Luke 1:20, where Zechariah is struck silent until God's timing unfolds. There is an implied reverence for God’s timing and the mysteries of His will."
    },
    {
      "pk": 33003027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 3,
      "verse": 27,
      "text": "'But when I speak with you, I will open your mouth, and you shall say to them, \"Thus says the Lord GOD.\" Whoever listens, let him listen; and whoever refuses, let him refuse, for they are a rebellious house.'",
      "links": "<a href='/AIV/26/2/7'>Ezek. 2:7</a>",
      "comment": "Ultimately, it is God who gives His servant utterance. The free response of the hearers shows God’s respect for human freedom, even while He patiently offers repeated invitations to repentance. This emphasizes the power and necessity of authoritative, Spirit-led proclamation."
    }
  ],
  "translatedAt": "2025-12-24T08:59:49.294Z"
}