{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 44,
  "verses": [
    {
      "pk": 2104401,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 1,
      "text": "Then he brought me back to the outer gate of the sanctuary that faces east, and it was shut.",
      "links": "<a href='/AIV/26/43/1-4'>Ezek. 43:1–4</a>",
      "comment": "Ezekiel returns to the eastern gate, previously mentioned as the entrance for God's glory. The closure emphasizes its holiness and separation for the divine."
    },
    {
      "pk": 2104402,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 2,
      "text": "The LORD said to me, 'This gate shall remain shut; it shall not be opened, and no one shall enter by it, for the LORD, the God of Israel, has entered by it. Therefore, it shall remain shut.'",
      "links": "<a href='/AIV/26/43/4'>Ezek. 43:4</a>",
      "comment": "The eastern gate is sealed because only the LORD's presence has entered through it. Many interpret this as a sign of God's exclusive holiness, fulfilled in Christ as the true temple."
    },
    {
      "pk": 2104403,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 3,
      "text": "Only the prince—because he is the prince—may sit in it to eat bread before the LORD. He shall enter by way of the porch of the gate and shall go out by the same way.",
      "links": "<a href='/AIV/26/45/7-8'>Ezek. 45:7-8</a>, <a href='/AIV/26/46/2'>Ezek. 46:2</a>",
      "comment": "The prince has special access, hinting at a royal priestly figure. There are spiritual parallels to Christ’s unique mediation and connection to the Father's presence."
    },
    {
      "pk": 2104404,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 4,
      "text": "Then he brought me by way of the north gate to the front of the temple. I looked, and behold, the glory of the LORD filled the temple of the LORD. I fell on my face.",
      "links": "<a href='/AIV/26/43/5'>Ezek. 43:5</a>, <a href='/AIV/2/40/34-35'>Ex. 40:34–35</a>",
      "comment": "Ezekiel witnesses God's glory filling the temple, reminiscent of the glory cloud in Exodus. Falling prostrate is a traditional response to divine presence, echoing worship practices in both Old and New Covenant communities."
    },
    {
      "pk": 2104405,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 5,
      "text": "The LORD said to me, 'Son of man, pay attention and see with your eyes, and listen with your ears to all that I tell you about all the statutes of the temple of the LORD and all its laws. Mark well those who may enter the temple and all who are to be excluded from the sanctuary.'",
      "links": "<a href='/AIV/26/40/4'>Ezek. 40:4</a>",
      "comment": "God calls Ezekiel to careful observation and transmission of sacred law, underlining the order and discipline required in divine worship."
    },
    {
      "pk": 2104406,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 6,
      "text": "You shall say to the rebellious house of Israel, 'Thus says the LORD God: O house of Israel, let there be an end to all your abominations.'",
      "links": "<a href='/AIV/26/2/3'>Ezek. 2:3</a>, <a href='/AIV/26/20/8'>Ezek. 20:8</a>",
      "comment": "A direct call to repentance. Abominations reference idolatry and impurity, crucial themes in both testament calls to holiness."
    },
    {
      "pk": 2104407,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 7,
      "text": "'In admitting foreigners, uncircumcised in heart and flesh, to be in my sanctuary, you have profaned it—my house—when you offer my food, the fat and the blood, and have broken my covenant—all your abominations.'",
      "links": "<a href='/AIV/26/7/21-22'>Ezek. 7:21–22</a>, <a href='/AIV/3/10/10'>Lev. 10:10</a>",
      "comment": "Desecration occurs when those unfit approach holy things, a theme echoed in Paul’s teachings on worthy reception of sacred mysteries (<a href='/AIV/46/11/27-30'>1 Cor. 11:27–30</a>). Also note the necessity of both inward and outward purity."
    },
    {
      "pk": 2104408,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 8,
      "text": "'You have not kept charge of my holy things, but you have set others to keep charge of my sanctuary for you.'",
      "links": "<a href='/AIV/3/22/2'>Lev. 22:2</a>",
      "comment": "Failure of spiritual stewardship is rebuked. This verse affirms the importance of proper guardianship and authorized ministry, with continuing application to orderly worship practices."
    },
    {
      "pk": 2104409,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 9,
      "text": "'Thus says the LORD God: No foreigner, uncircumcised in heart and flesh, of all the foreigners who are among the people of Israel, shall enter my sanctuary.'",
      "links": "<a href='/AIV/2/12/43-48'>Ex. 12:43–48</a>, <a href='/AIV/5/10/16'>Deut. 10:16</a>, <a href='/AIV/44/15/8-9'>Acts 15:8–9</a>",
      "comment": "Physical and spiritual purity are required; this anticipates New Testament discussions about circumcision of the heart and inclusion of Gentiles through grace."
    },
    {
      "pk": 2104410,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 10,
      "text": "'But the Levites who went far from me, when Israel went astray, who went astray from me after their idols, shall bear their punishment.'",
      "links": "<a href='/AIV/4/16/9-10'>Num. 16:9–10</a>, <a href='/AIV/26/8/16'>Ezek. 8:16</a>",
      "comment": "Levites, once dedicated, are held accountable for falling into idolatry. This underscores the seriousness of fidelity for those set apart for sacred service."
    },
    {
      "pk": 2104411,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 11,
      "text": "'They shall serve in my sanctuary, having oversight at the gates of the temple and serving in the temple. They shall slaughter the burnt offering and the sacrifice for the people, and they shall stand before the people to serve them.'",
      "links": "<a href='/AIV/3/1/5'>Lev. 1:5</a>, <a href='/AIV/4/3/6-10'>Num. 3:6–10</a>",
      "comment": "Though punished, the Levites continue in service, but their role is limited. This distinction in service prefigures gradations in ministry seen in later Christian worship."
    },
    {
      "pk": 2104412,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 12,
      "text": "'Because they served them before their idols and became a stumbling block of iniquity to the house of Israel, therefore I have raised my hand against them,' declares the LORD God, 'and they shall bear their punishment.'",
      "links": "<a href='/AIV/26/14/3-5'>Ezek. 14:3–5</a>",
      "comment": "Serving idols led others astray; even chosen ministers face judgment for scandal. Scripture repeatedly cautions against leading others into sin."
    },
    {
      "pk": 2104413,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 13,
      "text": "'They shall not come near to me, to serve me as priest, nor come near to any of my holy things, or the most holy things. But they shall bear their shame and the consequences of the abominations they have committed.'",
      "links": "<a href='/AIV/26/40/46'>Ezek. 40:46</a>, <a href='/AIV/3/16/2'>Lev. 16:2</a>",
      "comment": "A distinction is created between ordinary Levites and priests who have maintained fidelity. Holiness and discipline set apart those who approach the sacred mysteries."
    },
    {
      "pk": 2104414,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 14,
      "text": "'Yet I will make them keep charge of the temple, for all its service and for all that is to be done in it.'",
      "links": "<a href='/AIV/4/3/7-8'>Num. 3:7–8</a>",
      "comment": "Levites retain a role, though not the most direct. This arrangement highlights the principle of hierarchy and ordered ministry around sacred mysteries."
    },
    {
      "pk": 2104415,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 15,
      "text": "'But the priests, the sons of Zadok, who kept the charge of my sanctuary when the people of Israel went astray from me, shall come near to me to minister to me. They shall stand before me to offer me the fat and the blood,' declares the LORD God.",
      "links": "<a href='/AIV/26/43/19'>Ezek. 43:19</a>, <a href='/AIV/4/18/1'>Num. 18:1</a>",
      "comment": "The sons of Zadok are honored for faithfulness. Key for understanding the importance of apostolic succession and fidelity to divine tradition in ministry."
    },
    {
      "pk": 2104416,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 16,
      "text": "'They shall enter my sanctuary, and they shall come near my table to minister to me, and they shall keep my charge.'",
      "links": "<a href='/AIV/2/25/30'>Ex. 25:30</a>",
      "comment": "The phrase 'my table' points toward the sacred altar, a type prefiguring the Lord's Table in the New Covenant."
    },
    {
      "pk": 2104417,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 17,
      "text": "'When they enter the gates of the inner court, they shall wear linen garments. They shall wear no woolen garment while ministering at the gates of the inner court and within.'",
      "links": "<a href='/AIV/2/28/39-42'>Ex. 28:39–42</a>",
      "comment": "Priestly garments are strictly regulated. Linen signifies purity and separation, reinforcing the sacredness of ministry."
    },
    {
      "pk": 2104418,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 18,
      "text": "'They shall have linen turbans on their heads and linen trousers on their hips. They shall not gird themselves with anything that causes sweat.'",
      "links": "<a href='/AIV/3/16/4'>Lev. 16:4</a>",
      "comment": "Avoiding sweat points to purity and lack of human effort in divine service, emphasizing reliance on grace."
    },
    {
      "pk": 2104419,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 19,
      "text": "'When they go out into the outer court to the people, they shall remove the garments in which they minister and lay them in the holy chambers. They shall put on other garments, lest they transmit holiness to the people with their garments.'",
      "links": "<a href='/AIV/3/6/11'>Lev. 6:11</a>",
      "comment": "The priestly vestments are not to be worn among the people to prevent sacrilege. There is a clear delineation between the sacred and the ordinary, reflecting the sanctity of the priesthood."
    },
    {
      "pk": 2104420,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 20,
      "text": "'They shall not shave their heads, nor let their locks grow long. They shall only trim the hair on their heads.'",
      "links": "<a href='/AIV/3/21/5'>Lev. 21:5</a>",
      "comment": "Priestly appearance is regulated, signifying discipline and order, also seen in apostolic rules about outer appearance (<a href='/AIV/54/2/9'>1 Tim. 2:9</a>)."
    },
    {
      "pk": 2104421,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 21,
      "text": "'No priest shall drink wine when he enters the inner court.'",
      "links": "<a href='/AIV/3/10/9'>Lev. 10:9</a>",
      "comment": "Priestly sobriety is maintained while ministering. Ritual purity elevates the dignity of worship and priestly service."
    },
    {
      "pk": 2104422,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 22,
      "text": "'They shall not marry a widow or a divorced woman, but only a virgin from the house of Israel, or a widow who is the widow of a priest.'",
      "links": "<a href='/AIV/3/21/13-14'>Lev. 21:13–14</a>",
      "comment": "Marriage discipline for priests, emphasizing purity in both body and soul. These regulations prefigure spiritual purity and total dedication seen in later models of sanctity."
    },
    {
      "pk": 2104423,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 23,
      "text": "'They shall teach my people the difference between the holy and the common, and show them how to distinguish between the unclean and the clean.'",
      "links": "<a href='/AIV/3/10/10'>Lev. 10:10</a>, <a href='/AIV/43/17/17'>John 17:17</a>",
      "comment": "Priestly teaching is central to the spiritual life of the people, reflecting the ministry of the Word and the power of sacraments to sanctify."
    },
    {
      "pk": 2104424,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 24,
      "text": "'In lawsuits, they shall stand for judgment; according to my laws they shall judge it. They shall keep my instructions and my statutes concerning all my appointed feasts, and they shall sanctify my Sabbaths.'",
      "links": "<a href='/AIV/3/23/1-2'>Lev. 23:1–2</a>, <a href='/AIV/5/16/18'>Deut. 16:18</a>",
      "comment": "Priests hold authority in judicial matters and preserve liturgical observance. This merging of judicial and liturgical was later mirrored in the development of ecclesial authority and governance."
    },
    {
      "pk": 2104425,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 25,
      "text": "'They shall not defile themselves by coming near the dead. Only for father or mother, son or daughter, brother or unmarried sister may they make themselves unclean.'",
      "links": "<a href='/AIV/3/21/1-3'>Lev. 21:1–3</a>",
      "comment": "Restrictions highlight priestly sanctity and separation, also anticipating how Christ’s own purity was preserved."
    },
    {
      "pk": 2104426,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 26,
      "text": "'After he is cleansed, they shall count seven days for him.'",
      "links": "<a href='/AIV/4/19/11-12'>Num. 19:11–12</a>",
      "comment": "Seven days purification ties to fullness and spiritual completeness, echoing creation week and patterns in sacraments for cleansing."
    },
    {
      "pk": 2104427,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 27,
      "text": "'On the day he goes into the sanctuary, into the inner court to minister in the sanctuary, he shall offer his sin offering,' declares the LORD God.",
      "links": "<a href='/AIV/3/16/6'>Lev. 16:6</a>",
      "comment": "Priests offer sacrifice both for personal and communal atonement, foreshadowing Christ’s unique priestly sacrifice and the continuing practice in liturgy."
    },
    {
      "pk": 2104428,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 28,
      "text": "'This shall be their inheritance: I am their inheritance. You shall give them no possession in Israel; I am their possession.'",
      "links": "<a href='/AIV/4/18/20'>Num. 18:20</a>",
      "comment": "Priests receive God Himself as their inheritance, directly connecting to teachings on celibacy and undivided consecration to God among those appointed for sacred service."
    },
    {
      "pk": 2104429,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 29,
      "text": "'They shall eat the grain offering, the sin offering, and the guilt offering, and every devoted thing in Israel shall be theirs.'",
      "links": "<a href='/AIV/3/6/16'>Lev. 6:16</a>, <a href='/AIV/4/18/9-10'>Num. 18:9–10</a>",
      "comment": "Priests partake of sacrifices, a privilege linked to participation in sacred mysteries, spiritually foreshadowing the New Covenant meal."
    },
    {
      "pk": 2104430,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 30,
      "text": "'The first of all the firstfruits of every kind, and every offering of every sort, from all your offerings, shall be the priests’. You shall also give to the priests the first of your dough, that a blessing may rest on your house.'",
      "links": "<a href='/AIV/4/18/12'>Num. 18:12</a>, <a href='/AIV/4/15/19-21'>Num. 15:19–21</a>",
      "comment": "Offering firstfruits signifies putting God first and supporting the ministers, Old Testament roots underlying spiritual stewardship and blessing."
    },
    {
      "pk": 2104431,
      "translation": "AIV",
      "book": 26,
      "chapter": 44,
      "verse": 31,
      "text": "'The priests shall not eat any bird or animal that has died naturally or was torn by beasts.'",
      "links": "<a href='/AIV/3/22/8'>Lev. 22:8</a>",
      "comment": "Strict dietary laws reinforce priestly purity and separation. The theme of spiritual and physical holiness is a repeated motif carried forward into Christian teaching on living a set-apart life."
    }
  ],
  "translatedAt": "2025-12-23T07:10:15.486Z"
}