{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 41,
  "verses": [
    {
      "pk": 2041001,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 1,
      "text": "Then he brought me into the sanctuary and measured the pillars. The width of the pillar on one side was six cubits, and the width of the pillar on the other side was six cubits, both equal on each side of the doorway.",
      "links": "<a href='/AIV/26/40/48'>Ezek. 40:48</a>",
      "comment": "Ezekiel is taken to see the sanctuary; the specific measurements show the careful design and sacred purpose of the temple. The sanctuary suggests the place of God's presence, anticipating the fulfillment of true communion with God in Christ (cf. John 2:19-21)."
    },
    {
      "pk": 2041002,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 2,
      "text": "The width of the doorway was ten cubits, and the sides of the doorway were five cubits each on both sides. And he measured its length: forty cubits, and its width: twenty cubits.",
      "links": "<a href='/AIV/11/6/17'>1 Kings 6:17</a>",
      "comment": "The symmetry of the measurements recalls Solomon's temple, connecting continuity in worship. The numbers are significant for order and worship, foreshadowing the New Covenant's perfection (Heb. 9:11)."
    },
    {
      "pk": 2041003,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 3,
      "text": "Then he went into the inner sanctuary and measured the pillar at the entrance: two cubits. The entrance was six cubits high. And the width of the entrance was seven cubits.",
      "links": "<a href='/AIV/11/6/20'>1 Kings 6:20</a>",
      "comment": "Progression inward mirrors spiritual ascent. The inner sanctuary is the holiest place, symbolizing full access to God's presence, which Christ alone has (Heb. 9:24)."
    },
    {
      "pk": 2041004,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 4,
      "text": "And he measured its length: twenty cubits, and its width: twenty cubits, before the sanctuary; and he said to me, \"This is the Most Holy Place.\"",
      "links": "<a href='/AIV/11/6/20'>1 Kings 6:20</a>; <a href='/AIV/58/9/3'>Heb. 9:3</a>",
      "comment": "The perfect square (20 x 20) echoes the design of the Holy of Holies. The phrase 'Most Holy Place' alludes to the direct presence of God, fulfilled in Christ's intercession (Heb. 10:19-22)."
    },
    {
      "pk": 2041005,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 5,
      "text": "Then he measured the wall of the temple: six cubits thick. The width of the side rooms all around the temple was four cubits each.",
      "links": "<a href='/AIV/11/6/6'>1 Kings 6:6</a>",
      "comment": "The surrounding chambers were for the priests, suggesting set-apart service—a hint toward apostolic leadership and order in worship, see Acts 6:4."
    },
    {
      "pk": 2041006,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 6,
      "text": "And the side rooms were in three stories, one above another, thirty rooms in all. There were offsets in the wall all around to support the side rooms, so the supports were not attached to the wall of the temple.",
      "links": "<a href='/AIV/11/6/6'>1 Kings 6:6</a>",
      "comment": "Three stories reflect completeness, often a biblical symbol of fullness. The structure's stability alludes to the steadfastness of the church built for ongoing worship and sanctification."
    },
    {
      "pk": 2041007,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 7,
      "text": "The side rooms became wider as they went up higher, because the structure surrounding the temple went higher level by level all around the temple. Therefore the temple was larger inwardly as one went upward; and so one ascended from the lowest story to the highest by the middle story.",
      "links": "<a href='/AIV/11/6/8'>1 Kings 6:8</a>",
      "comment": "The ascent evokes spiritual growth in holiness and virtue, echoing the upward journey in Christian life (Phil. 3:14). The structure points to mystery and spiritual ascent toward God's fullness."
    },
    {
      "pk": 2041008,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 8,
      "text": "I saw that the temple had a raised platform all around; the foundations of the side rooms were a full rod of six long cubits.",
      "links": "",
      "comment": "The raised platform signifies elevation and separation for sacred use, a pattern followed by early Christian worship spaces set apart for the divine liturgy."
    },
    {
      "pk": 2041009,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 9,
      "text": "The outer wall of the side rooms was five cubits thick, and that left a space of twenty cubits between the temple and the side rooms.",
      "links": "",
      "comment": "The thick walls picture strong protection and security, reminiscent of how the church guards the deposit of faith (2 Tim. 1:13-14)."
    },
    {
      "pk": 2041010,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 10,
      "text": "And around the temple was a space, twenty cubits wide, all around.",
      "links": "",
      "comment": "The separation further marks the need for holiness and reverence—a principle for worship throughout history."
    },
    {
      "pk": 2041011,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 11,
      "text": "The doors of the side rooms opened onto the open space, one door toward the north and another toward the south, and the width of the open space was five cubits all around.",
      "links": "",
      "comment": "Multiple entrances reflect inclusivity in God's invitation, yet ordered, echoing Christ as the 'Door' (John 10:9) who provides the way into true worship."
    },
    {
      "pk": 2041012,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 12,
      "text": "The building that was facing the separate courtyard at the west side was seventy cubits wide; the wall of the building was five cubits thick all around, and its length was ninety cubits.",
      "links": "",
      "comment": "The western structure hints at completeness of worship, with spatial boundaries reinforcing mystery and reverence not fully accessible until Christ."
    },
    {
      "pk": 2041013,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 13,
      "text": "Then he measured the temple: one hundred cubits long; the separate courtyard together with the building and its walls was one hundred cubits long.",
      "links": "",
      "comment": "The unity of measurements between temple and courtyard suggests harmony and oneness, pointing toward the unity in true worship (John 17:21)."
    },
    {
      "pk": 2041014,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 14,
      "text": "The width of the temple, along with the separate courtyard to the east, was also one hundred cubits.",
      "links": "",
      "comment": "Completeness and symmetry again mark the perfection of God's plan for His people, from temple to new creation."
    },
    {
      "pk": 2041015,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 15,
      "text": "He measured the length of the building facing the courtyard at the west side, and its galleries on both sides: one hundred cubits.",
      "links": "",
      "comment": "Galleries may allude to places for participation and witness in worship; the fullness prefigures worldwide communion under Christ's kingship."
    },
    {
      "pk": 2041016,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 16,
      "text": "The interior and the openings and the galleries all around — the thresholds, the windows, and the galleries — were covered with wood, all around from the floor up to the windows; and the windows were covered.",
      "links": "",
      "comment": "Wood used in sanctuary echoes imagery of life and growth; covering the windows implies a sense of hiddenness and mystery in heavenly worship (cf. Rev. 8:1)."
    },
    {
      "pk": 2041017,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 17,
      "text": "From above the gates to the inner temple and on the outside, and on all the wall all around inside and outside, by measurement.",
      "links": "",
      "comment": "Every detail guarded and measured signals the care and diligence God expects in worship, paralleling Paul's teaching on 'all things done decently and in order' (1 Cor. 14:40)."
    },
    {
      "pk": 2041018,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 18,
      "text": "It was sculpted with cherubim and palm trees; palm trees between cherubim; every cherub had two faces:",
      "links": "<a href='/AIV/11/6/29'>1 Kings 6:29</a>",
      "comment": "Cherubim symbolize angels who guard holiness; palms signify victory and life, prefiguring Christ’s triumph (John 12:13); dual faces represent dual aspects of God’s judgment and mercy."
    },
    {
      "pk": 2041019,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 19,
      "text": "One face was that of a man toward a palm tree on one side, and the other face was that of a lion toward a palm tree on the other side. Thus it was throughout all the temple all around.",
      "links": "",
      "comment": "Man and lion faces highlight humanity and kingship—foreshadowing Christ the Son of Man and Lion of Judah (Rev. 5:5), present in the sanctuary."
    },
    {
      "pk": 2041020,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 20,
      "text": "From the floor up to the windows, cherubim and palm trees sculpted on the wall all around.",
      "links": "<a href='/AIV/11/6/29'>1 Kings 6:29</a>",
      "comment": "Wall decorations from floor to window reinforce the idea that all creation worships and gives glory—echoing the fullness of worship expected in God’s house."
    },
    {
      "pk": 2041021,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 21,
      "text": "The sanctuary had a doorpost shaped like a square. At the front of the Most Holy Place was something resembling the appearance of a wooden altar.",
      "links": "",
      "comment": "The square post and altar prefigure Christ, our true altar (Heb. 13:10); the sacrificial imagery anticipates the centrality of communion in the New Covenant."
    },
    {
      "pk": 2041022,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 22,
      "text": "The altar was three cubits high and two cubits long; its corners, its base, and its sides were made of wood. And he said to me, 'This is the table that is before the Lord.'",
      "links": "<a href='/AIV/11/7/48'>1 Kings 7:48</a>",
      "comment": "The table before the Lord represents both sacrifice and communion, foreshadowing the Lord’s Supper, which brings believers into direct fellowship with God."
    },
    {
      "pk": 2041023,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 23,
      "text": "The sanctuary and the Most Holy Place each had double doors.",
      "links": "",
      "comment": "Double doors symbolize openness to God’s presence and the dual access granted only in Christ—entry to communion and holiness."
    },
    {
      "pk": 2041024,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 24,
      "text": "Each of the doors had two panels, two folding panels; two panels for one door and two panels for the other.",
      "links": "",
      "comment": "The folding panels indicate careful division and unity. The design ensures proper access and separation for the sacred, consistent with God’s ordered worship."
    },
    {
      "pk": 2041025,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 25,
      "text": "And there were carved cherubim and palm trees on the doors of the sanctuary, just like those on the walls. And there was a wooden canopy outside, at the front of the porch.",
      "links": "<a href='/AIV/11/6/33'>1 Kings 6:33</a>",
      "comment": "Decorations extend to the doors, marking the boundary between sacred and secular, reinforcing the beauty and richness of traditions in worship."
    },
    {
      "pk": 2041026,
      "translation": "AIV",
      "book": 26,
      "chapter": 41,
      "verse": 26,
      "text": "There were narrow windows and palm trees, one on each side, on the sides of the porch; and the side rooms of the temple also had canopies.",
      "links": "",
      "comment": "Windows and palm trees again sign victory and spiritual illumination, while individual canopies point to the personalization of worship for each believer, yet always within the communal structure of the church."
    }
  ],
  "translatedAt": "2025-12-23T07:08:31.937Z"
}