{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 32,
  "verses": [
    {
      "pk": 32563201,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 1,
      "text": "In the twelfth year, in the twelfth month, on the first day, the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/30/20'>Ezek. 30:20</a>",
      "comment": "This begins a prophetic oracle against Egypt, marking a specific time, showing historical grounding of God’s messages."
    },
    {
      "pk": 32563202,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 2,
      "text": "Son of man, raise a lamentation over Pharaoh king of Egypt, and say to him: ‘You are like a lion among the nations, and are like a monster in the seas; you burst forth in your rivers, trouble the waters with your feet, and foul their rivers.’",
      "links": "<a href='/AIV/26/29/3'>Ezek. 29:3</a>; <a href='/AIV/23/27/1'>Isa. 27:1</a>",
      "comment": "Pharaoh is described with images of strength and chaos, connecting the king's pride with disorder, reminiscent of chaos monsters in ancient literature."
    },
    {
      "pk": 32563203,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 3,
      "text": "Thus says the Lord GOD: ‘I will cast my net over you with a great company of many peoples, and they will drag you up in my net.’",
      "links": "<a href='/AIV/26/12/13'>Ezek. 12:13</a>; <a href='/AIV/19/35/7-8'>Ps. 35:7–8</a>",
      "comment": "The imagery implies God’s judgment using nations as instruments, showing divine sovereignty over world events."
    },
    {
      "pk": 32563204,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 4,
      "text": "And I will leave you upon the land; I will cast you out on the open field, and I will cause all the birds of the heavens to settle on you, and the beasts of the whole earth to gorge themselves with you.",
      "links": "<a href='/AIV/26/29/5'>Ezek. 29:5</a>; <a href='/AIV/24/7/33'>Jer. 7:33</a>",
      "comment": "Pharaoh’s disgrace is total, akin to sacrificial imagery—reminiscent of judgment scenes in Revelation."
    },
    {
      "pk": 32563205,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 5,
      "text": "I will lay your flesh on the mountains and fill the valleys with your carcass.",
      "links": "<a href='/AIV/26/31/12'>Ezek. 31:12–13</a>",
      "comment": "The vivid depiction highlights the impact of God’s justice filling the land, reminiscent of sacrificial language throughout Scripture."
    },
    {
      "pk": 32563206,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 6,
      "text": "I will drench the land with your flowing blood up to the mountains, and the ravines will be filled with you.",
      "links": "<a href='/AIV/26/39/17-19'>Ezek. 39:17–19</a>",
      "comment": "Blood as judgment recalls Genesis 4:10 and Revelation 16:4. The land’s defilement invokes spiritual and ritual consequences, nodding to the need for purification and atonement."
    },
    {
      "pk": 32563207,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 7,
      "text": "When I extinguish you, I will cover the heavens and darken their stars; I will cover the sun with a cloud, and the moon will not give its light.",
      "links": "<a href='/AIV/23/13/10'>Isa. 13:10</a>; <a href='/AIV/41/13/24'>Mark 13:24</a>",
      "comment": "Apocalyptic imagery of cosmic darkness signaling divine judgment, pointing forward to similar language used of Christ’s return."
    },
    {
      "pk": 32563208,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 8,
      "text": "All the bright lights of the heavens I will darken over you and bring darkness upon your land, declares the Lord GOD.",
      "links": "<a href='/AIV/26/30/3'>Ezek. 30:3</a>; <a href='/AIV/29/2/31'>Joel 2:31</a>",
      "comment": "Echoes Joel’s prophecy of the day of the Lord, emphasizing the global scope of judgment."
    },
    {
      "pk": 32563209,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 9,
      "text": "I will trouble the hearts of many peoples when I bring about your downfall among the nations, in countries you have not known.",
      "links": "<a href='/AIV/26/27/35'>Ezek. 27:35</a>",
      "comment": "Egypt’s fall impacts other nations, illustrating interconnectedness of God’s justice. Note how it foreshadows Christ’s work as universal in scope (John 12:32)."
    },
    {
      "pk": 32563210,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 10,
      "text": "I will make many peoples appalled at you, and their kings shall shudder in horror because of you when I brandish my sword before them; and they shall tremble every moment, each for his own life, on the day of your fall.",
      "links": "<a href='/AIV/26/27/35'>Ezek. 27:35</a>; <a href='/AIV/26/30/16'>Ezek. 30:16</a>",
      "comment": "God’s sword recalls themes of divine authority and the power to judge, adapted spiritually in the NT to Christ as both judge and savior."
    },
    {
      "pk": 32563211,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 11,
      "text": "For thus says the Lord GOD: ‘The sword of the king of Babylon shall come against you.’",
      "links": "<a href='/AIV/26/29/17'>Ezek. 29:17</a>; <a href='/AIV/24/43/10'>Jer. 43:10'</a>",
      "comment": "Babylon as God's instrument of justice—a recurring OT theme. This concept frames human rulers as agents of divine will, hinting toward God’s use of worldly authority."
    },
    {
      "pk": 32563212,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 12,
      "text": "I will cause your multitude to fall by the swords of mighty men, all of them the most ruthless of nations; they shall devastate Egypt’s pride, and all its multitude shall perish.",
      "links": "<a href='/AIV/26/30/11'>Ezek. 30:11</a>",
      "comment": "Describes the thoroughness of the judgment—an echo of God’s justice against pride and self-exaltation."
    },
    {
      "pk": 32563213,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 13,
      "text": "I will destroy all its cattle from beside many waters, and no foot of man or beast shall trouble them anymore.",
      "links": "<a href='/AIV/26/29/11'>Ezek. 29:11</a>",
      "comment": "The desolation is total, affecting even creation—reminding of the seriousness of sin’s consequences."
    },
    {
      "pk": 32563214,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 14,
      "text": "Then I will make their waters clear, and their rivers will run like oil, declares the Lord GOD.",
      "links": "<a href='/AIV/29/3/18'>Joel 3:18</a>",
      "comment": "The restoration of the land after judgment gestures toward themes of purification—anticipates baptismal and sacramental imagery."
    },
    {
      "pk": 32563215,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 15,
      "text": "When I make the land of Egypt desolate, and when it is emptied of all that filled it, when I strike all who dwell in it, then they shall know that I am the LORD.",
      "links": "<a href='/AIV/26/30/19'>Ezek. 30:19</a>",
      "comment": "Judgment leads to deeper recognition of God’s sovereignty, reminiscent of the knowledge of the Lord imagery—fulfilled supremely in Christ's revelation."
    },
    {
      "pk": 32563216,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 16,
      "text": "This is a lamentation and will be chanted; the daughters of the nations shall chant it; over Egypt, and over all her multitude, they will chant it, declares the Lord GOD.",
      "links": "<a href='/AIV/24/9/17'>Jer. 9:17</a>",
      "comment": "Women’s role in mourning is significant, linking to themes of communal lament and liturgical remembrance."
    },
    {
      "pk": 32563217,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 17,
      "text": "In the twelfth year, in the fifteenth day of the month, the word of the LORD came to me:",
      "links": "<a href='/AIV/26/32/1'>Ezek. 32:1</a>",
      "comment": "Marks another oracle’s beginning, anchoring the prophecy in real history."
    },
    {
      "pk": 32563218,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 18,
      "text": "Son of man, mourn over the multitude of Egypt, and send them down to the world below, to those who go down to the pit.",
      "links": "<a href='/AIV/26/26/20'>Ezek. 26:20</a>",
      "comment": "Descent to the pit evokes judgment after death—shadows Christ's descent to the dead (1 Peter 3:19)."
    },
    {
      "pk": 32563219,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 19,
      "text": "Whom do you surpass in beauty? Go down and be laid with the uncircumcised.",
      "links": "<a href='/AIV/26/31/18'>Ezek. 31:18</a>",
      "comment": "Egypt’s pride is humbled; being laid with the uncircumcised references spiritual death and separation from God."
    },
    {
      "pk": 32563220,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 20,
      "text": "They shall fall among the slain by the sword. Egypt has been delivered to the sword; drag her and all her multitudes away.",
      "links": "<a href='/AIV/26/31/17'>Ezek. 31:17</a>",
      "comment": "Harkens to the universality of death as judgment, highlighting humanity's need for redemption from spiritual death."
    },
    {
      "pk": 32563221,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 21,
      "text": "The mighty chiefs shall speak to them from the midst of Sheol, with those who help them. ‘They have come down, they lie still, the uncircumcised, slain by the sword.’",
      "links": "<a href='/AIV/23/14/9'>Isa. 14:9</a>",
      "comment": "Communal judgment and solidarity in Sheol prefigures Christ's harrowing of the dead."
    },
    {
      "pk": 32563222,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 22,
      "text": "Assyria is there, and all her company; their graves are all around them, all of them slain, fallen by the sword.",
      "links": "<a href='/AIV/26/32/24'>Ezek. 32:24</a>",
      "comment": "Assyria, once a great power, suffers the same fate, echoing the biblical theme of worldly kingdoms’ fall."
    },
    {
      "pk": 32563223,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 23,
      "text": "Whose graves are set in the inner depths of the pit; her company is round about her grave, all of them slain, fallen by the sword, who spread terror in the land of the living.",
      "links": "<a href='/AIV/26/26/20'>Ezek. 26:20</a>",
      "comment": "The pit references ultimate separation; terror in life leads to shame in death. Points to the retributive justice that is ultimately fulfilled in Christ."
    },
    {
      "pk": 32563224,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 24,
      "text": "Elam is there, and all her multitude round about her grave, all of them slain, fallen by the sword—they went down uncircumcised into the world below, who spread terror in the land of the living; they bear their shame with those who go down to the pit.",
      "links": "<a href='/AIV/26/27/10'>Ezek. 27:10</a>",
      "comment": "Another great nation is judged; shame in Sheol highlights loss of glory outside God’s covenant."
    },
    {
      "pk": 32563225,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 25,
      "text": "They have made a bed for her among the slain with all her multitude, with their graves all around it; all of them uncircumcised, slain by the sword, for terror was spread by them in the land of the living; they bear their shame with those who go down to the pit; they are laid among the slain.",
      "links": "<a href='/AIV/26/32/27'>Ezek. 32:27</a>",
      "comment": "Emphasizes the shame of spiritual death—without covenant, lost in the pit. Foreshadows the hope of resurrection through Christ."
    },
    {
      "pk": 32563226,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 26,
      "text": "Meshech, Tubal, and all their multitude are there; their graves surround them, all of them uncircumcised, slain by the sword, for they spread terror in the land of the living.",
      "links": "<a href='/AIV/26/27/13'>Ezek. 27:13</a>",
      "comment": "Recalls nations listed in Genesis 10 and Ezekiel 38; broad application of judgment across all peoples."
    },
    {
      "pk": 32563227,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 27,
      "text": "And they do not lie with the mighty, the fallen from among the uncircumcised, who went down to Sheol with their weapons of war, and whose swords were laid under their heads, and whose guilt rests upon their bones, because the terror of their deeds was upon the land of the living.",
      "links": "<a href='/AIV/23/14/18'>Isa. 14:18–20</a>",
      "comment": "Weapons buried with them are a symbol of futile pride; guilt remains after death, hinting at the necessity of repentance and atonement."
    },
    {
      "pk": 32563228,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 28,
      "text": "But as for you, you shall be broken among the uncircumcised and lie with those who are slain by the sword.",
      "links": "<a href='/AIV/26/32/19'>Ezek. 32:19</a>",
      "comment": "Egypt shares the fate of other nations—no human greatness or ritual can avert divine judgment."
    },
    {
      "pk": 32563229,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 29,
      "text": "Edom is there, her kings and all her princes, who for all their might are laid beside those who were slain by the sword; they lie with the uncircumcised, with those who go down to the pit.",
      "links": "<a href='/AIV/26/25/12'>Ezek. 25:12–14</a>",
      "comment": "The repeated fate of rulers reminds us that all nations are subject to God’s judgment, yet also points towards the eventual restoration promised in Christ."
    },
    {
      "pk": 32563230,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 30,
      "text": "The princes of the north are there, all of them, and all the Sidonians, who have gone down in shame with the slain, for all their terror they caused in their might; they lie uncircumcised with those slain by the sword, and bear their shame with those who go down to the pit.",
      "links": "<a href='/AIV/26/27/8'>Ezek. 27:8'</a>",
      "comment": "North and Sidon—historically wealthy and proud—fall likewise; shame endures apart from God's mercy."
    },
    {
      "pk": 32563231,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 31,
      "text": "When Pharaoh sees them, he will be comforted for all his multitude, Pharaoh and all his army, slain by the sword, declares the Lord GOD.",
      "links": "<a href='/AIV/26/32/19'>Ezek. 32:19</a>",
      "comment": "Pharaoh finds consolation only in shared misery—tragic irony pointing to the emptiness of hope apart from divine redemption."
    },
    {
      "pk": 32563232,
      "translation": "AIV",
      "book": 26,
      "chapter": 32,
      "verse": 32,
      "text": "For I spread terror in the land of the living; and Pharaoh and all his multitude shall be laid among the uncircumcised with those slain by the sword, declares the Lord GOD.",
      "links": "<a href='/AIV/26/32/21'>Ezek. 32:21</a>",
      "comment": "The closing verse reiterates judgment. The concept of laying among the uncircumcised foreshadows the theological necessity of spiritual rebirth and union with the one true Church, found through sacrament and resurrection in Christ."
    }
  ],
  "translatedAt": "2025-12-23T07:03:31.029Z"
}