{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 26,
  "verses": [
    {
      "pk": 43010260,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 1,
      "text": "In the eleventh year, on the first day of the month, the word of the LORD came to me, saying,",
      "links": "<a href='/AIV/12/25/2'>2 Kings 25:2</a>; <a href='/AIV/26/24/1'>Ezek. 24:1</a>",
      "comment": "The date coincides with key events during the siege of Jerusalem. This links the prophecy to major disruptions in Israel's life, inviting reflection on God's sovereignty over history."
    },
    {
      "pk": 43010261,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 2,
      "text": "Son of man, because Tyre has said concerning Jerusalem, 'Aha! The gateway of the peoples is broken, it has opened to me; I shall be filled, now that she is destroyed,'",
      "links": "<a href='/AIV/19/83/4-8'>Ps. 83:4-8</a>; <a href='/AIV/23/23/1'>Isa. 23:1</a>",
      "comment": "Tyre rejoices over Jerusalem’s downfall, revealing a recurring biblical theme where God holds nations accountable for mocking or exploiting His chosen people. This is echoed throughout prophetic literature."
    },
    {
      "pk": 43010262,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 3,
      "text": "therefore, thus says the Lord GOD: Behold, I am against you, Tyre, and will bring up many nations against you, as the sea brings up its waves.",
      "links": "<a href='/AIV/26/25/8'>Ezek. 25:8</a>; <a href='/AIV/29/3/4'>Joel 3:4</a>",
      "comment": "God pronounces judgment, highlighting His authority over all nations. The metaphor of waves suggests relentless and repeated invasions, foreshadowing exhaustive judgment."
    },
    {
      "pk": 43010263,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 4,
      "text": "They shall destroy the walls of Tyre and break down her towers. I will scrape her dust from her and make her a bare rock.",
      "links": "<a href='/AIV/23/23/1'>Isa. 23:1</a>; <a href='/AIV/16/4/7'>Neh. 4:7</a>",
      "comment": "The imagery points to total devastation, a prophecy fulfilled in stages by Babylon and later, Alexander the Great. The complete erasure demonstrates Divine retribution."
    },
    {
      "pk": 43010264,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 5,
      "text": "She shall be in the midst of the sea a place for spreading nets; for I have spoken, declares the Lord GOD. She shall become plunder for the nations,",
      "links": "<a href='/AIV/26/47/10'>Ezek. 47:10</a>",
      "comment": "Once a great city, Tyre is destined to become nothing more than a place for fishermen. God’s verdict transforms worldly power into insignificance."
    },
    {
      "pk": 43010265,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 6,
      "text": "and her daughters on the mainland shall be slaughtered by the sword. Then they will know that I am the LORD.",
      "links": "<a href='/AIV/26/6/7'>Ezek. 6:7</a>",
      "comment": "This refrain, repeated throughout Ezekiel, underscores God's purpose in judgment: to reveal His sovereignty and identity to all peoples."
    },
    {
      "pk": 43010266,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 7,
      "text": "For thus says the Lord GOD: Behold, I will bring against Tyre from the north Nebuchadnezzar, king of Babylon, king of kings, with horses and chariots, with horsemen and a mighty host of many soldiers.",
      "links": "<a href='/AIV/27/2/37'>Dan. 2:37</a>; <a href='/AIV/26/29/18'>Ezek. 29:18</a>",
      "comment": "Refers specifically to Nebuchadnezzar, emphasizing God’s use of pagan rulers as instruments of His will, a key biblical theme. 'King of kings' also anticipates the title later attributed to Christ."
    },
    {
      "pk": 43010267,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 8,
      "text": "He will kill with the sword your daughters on the mainland. He will set up siege walls against you, build a ramp, and raise a large shield against you.",
      "links": "<a href='/AIV/24/39/1'>Jer. 39:1</a>",
      "comment": "Describes standard tactics of ancient siege warfare. The specificity of military terms reveals the prophecy’s grounding in real historical events."
    },
    {
      "pk": 43010268,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 9,
      "text": "He will direct the shock of his battering rams against your walls and break down your towers with his axes.",
      "links": "<a href='/AIV/23/37/24'>Isa. 37:24</a>",
      "comment": "Indicates the intensity and violence of the siege. As with Jerusalem, physical destruction is repeatedly connected to spiritual consequences."
    },
    {
      "pk": 43010269,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 10,
      "text": "Because of the abundance of his horses, their dust will cover you. Your walls will shake at the noise of horsemen, wheel, and chariot, when he enters your gates as men enter a breached city.",
      "links": "<a href='/AIV/24/4/13'>Jer. 4:13</a>",
      "comment": "Great armies are described metaphorically, highlighting both the terror and inevitability of God’s judgment."
    },
    {
      "pk": 43010270,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 11,
      "text": "With the hooves of his horses he will trample all your streets. He will kill your people with the sword, and your mighty pillars will fall to the ground.",
      "links": "<a href='/AIV/26/30/4'>Ezek. 30:4</a>",
      "comment": "The destruction of Tyre’s ‘mighty pillars’ signifies the toppling of what once seemed unshakeable, echoing biblical motifs of God’s humbling of the proud."
    },
    {
      "pk": 43010271,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 12,
      "text": "They will plunder your riches and loot your merchandise. They will break down your walls and demolish your fine houses. Your stones, timber, and debris they will throw into the water.",
      "links": "<a href='/AIV/23/23/18'>Isa. 23:18</a>; <a href='/AIV/38/9/3'>Zech. 9:3</a>",
      "comment": "The prophecy about Tyre’s ruins being thrown into the sea was later fulfilled by Alexander the Great. This foreshadows the complete and enduring nature of divine judgment."
    },
    {
      "pk": 43010272,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 13,
      "text": "So I will put an end to the noise of your songs, and the sound of your lyres shall be heard no more.",
      "links": "<a href='/AIV/24/7/34'>Jer. 7:34</a>; <a href='/AIV/66/18/22'>Rev. 18:22</a>",
      "comment": "The cessation of music symbolizes the silencing of pride and joy, paralleling similar judgments on other wicked cities. This theme echoes into the New Testament portrayal of final judgment."
    },
    {
      "pk": 43010273,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 14,
      "text": "I will make you a bare rock; you shall be a place for spreading nets. You shall never be rebuilt. For I, the LORD, have spoken, declares the Lord GOD.",
      "links": "<a href='/AIV/26/47/10'>Ezek. 47:10</a>; <a href='/AIV/36/2/15'>Zeph. 2:15</a>",
      "comment": "The prophecy’s finality stands in contrast to restoration promises elsewhere in the prophets. The absolute nature of the decree demonstrates God’s ultimate authority."
    },
    {
      "pk": 43010274,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 15,
      "text": "Thus says the Lord GOD to Tyre: Will not the coastlands shake at the sound of your downfall, when the wounded groan, when slaughter is made in your midst?",
      "links": "<a href='/AIV/23/23/5'>Isa. 23:5</a>",
      "comment": "Other nations trembling speaks to the far-reaching impact of God’s judgment and the seriousness with which the Lord regards justice among the nations."
    },
    {
      "pk": 43010275,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 16,
      "text": "Then all the princes of the sea will step down from their thrones, remove their robes, and take off their embroidered garments. They will clothe themselves with trembling; they will sit on the ground, tremble every moment, and be appalled at you.",
      "links": "<a href='/AIV/23/32/10-11'>Isa. 32:10-11</a>",
      "comment": "Earthly rulers are powerless in the face of God’s judgment, a key spiritual lesson. Symbolic humility here suggests true wisdom leads to reverence before God’s holiness."
    },
    {
      "pk": 43010276,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 17,
      "text": "They will raise a lament over you and say to you, 'How you have perished, you who were inhabited from the seas, famous city, who was strong on the sea, she and her inhabitants, who imposed your terror on all your neighbors!'",
      "links": "<a href='/AIV/24/50/23'>Jer. 50:23</a>",
      "comment": "The lament links to biblical traditions of prophecy as both warning and mourning. The fall of the mighty city is a call to all to recognize God’s hand in history."
    },
    {
      "pk": 43010277,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 18,
      "text": "Now the coastlands tremble on the day of your fall; the coastlands are dismayed at your end.",
      "links": "<a href='/AIV/23/23/5'>Isa. 23:5</a>",
      "comment": "Echoes the theme that God’s actions among nations serve as witness to His glory. The shaking of the nations prefigures the eschatological events spoken of in the Gospels and Revelation."
    },
    {
      "pk": 43010278,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 19,
      "text": "For thus says the Lord GOD: When I make you a desolate city, like cities that are not inhabited, when I bring up the deep over you, and the great waters cover you,",
      "links": "<a href='/AIV/18/26/5-6'>Job 26:5-6</a>",
      "comment": "The language recalls both the Flood and the Exodus, where water symbolizes both death and the potential for new beginnings in the biblical narrative."
    },
    {
      "pk": 43010279,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 20,
      "text": "then I will bring you down with those who go down to the pit, to the people of old, and I will make you dwell in the lower parts of the earth, like the ancient ruins, with those who go down to the pit, so that you will not be inhabited; but I will set glory in the land of the living.",
      "links": "<a href='/AIV/19/88/3-6'>Ps. 88:3-6</a>; <a href='/AIV/23/14/9'>Isa. 14:9</a>",
      "comment": "‘The pit’ is a frequent euphemism for death or Sheol. The hope for ‘glory in the land of the living’ points ahead to restoration and eternal life, paralleling Resurrection themes in Christ’s teaching."
    },
    {
      "pk": 43010280,
      "translation": "AIV",
      "book": 26,
      "chapter": 26,
      "verse": 21,
      "text": "I will bring you to a dreadful end, and you shall be no more. Though you be sought for, you will never again be found, declares the Lord GOD.",
      "links": "<a href='/AIV/24/25/10'>Jer. 25:10</a>; <a href='/AIV/66/18/21-23'>Rev. 18:21-23</a>",
      "comment": "The final extinction of Tyre in judgment hints at the ultimate triumph of God’s justice. In New Testament terms, this foreshadows the fate of the city of Babylon in Revelation, where God’s kingdom is established in lasting justice and peace."
    }
  ],
  "translatedAt": "2025-12-23T07:00:06.676Z"
}