{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 17,
  "verses": [
    {
      "pk": 4017001,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 1,
      "text": "The word of the LORD came to me, saying,",
      "links": "",
      "comment": "This is a common prophetic introduction, marking God as the true speaker. See <a href='/AIV/24/1/4'>Jer. 1:4</a>."
    },
    {
      "pk": 4017002,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 2,
      "text": "“Son of man, give a riddle and speak a parable to the house of Israel.",
      "links": "<a href='/AIV/26/20/49'>Ezek. 20:49</a>",
      "comment": "God often uses riddles and parables to reveal deeper truths to those willing to seek them out (cf. <a href='/AIV/40/13/34'>Matt. 13:34</a>)."
    },
    {
      "pk": 4017003,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 3,
      "text": "Say, ‘This is what the Lord GOD says: A great eagle, with great wings and long pinions, full of feathers of many colors, came to Lebanon, and took the top of the cedar.",
      "links": "<a href='/AIV/26/17/7'>Ezek. 17:7</a>; <a href='/AIV/27/4/22'>Dan. 4:22</a>",
      "comment": "The eagle represents a mighty king; historically, this points to Babylon. Lebanon often symbolizes Israel because of its famous cedars."
    },
    {
      "pk": 4017004,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 4,
      "text": "He plucked off the topmost shoot of its branches, and carried it to a land of trade. He set it in a city of merchants.",
      "links": "<a href='/AIV/12/24/15'>2 Kings 24:15</a>",
      "comment": "This refers to the deportation of King Jehoiachin to Babylon, reflecting God’s judgment through foreign powers."
    },
    {
      "pk": 4017005,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 5,
      "text": "Then he took some of the seed of the land and planted it in fertile soil. He placed it beside abundant waters; he set it like a willow twig.",
      "links": "<a href='/AIV/26/17/22'>Ezek. 17:22</a>",
      "comment": "The seed points to Zedekiah, who was made king by Babylon. Being ‘by abundant waters’ recalls God’s provision (cf. <a href='/AIV/19/1/3'>Ps. 1:3</a>)."
    },
    {
      "pk": 4017006,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 6,
      "text": "It sprouted and became a low, spreading vine. Its branches turned toward him, but its roots remained where it stood. So it became a vine and produced branches and sent out shoots.",
      "links": "",
      "comment": "The vine’s low state indicates humility and vassal status. The allusion to growth yet dependence foreshadows coming developments."
    },
    {
      "pk": 4017007,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 7,
      "text": "But another great eagle with great wings and many feathers looked on. Behold, the vine bent its roots toward this eagle, and stretched out its branches from the bed where it was planted, that he might water it.",
      "links": "",
      "comment": "The second eagle is Egypt. Judah sought help from Egypt rather than trusting the Lord’s work; this introduces a spiritual dimension of trust and faithfulness."
    },
    {
      "pk": 4017008,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 8,
      "text": "It had been planted in good soil by abundant waters, so it could produce branches, bear fruit, and become a splendid vine.",
      "links": "<a href='/AIV/19/80/8-11'>Ps. 80:8-11</a>",
      "comment": "Israel was established with every advantage—God’s grace has always preceded the people’s response."
    },
    {
      "pk": 4017009,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 9,
      "text": "Say, ‘This is what the Lord GOD says: Will it thrive? Will he not pull up its roots and cut off its fruit, so that it withers? All its new growth will wither. It will not take a strong arm or many people to pull it from its roots.",
      "links": "",
      "comment": "God’s question reveals Judah’s coming judgment. Even without impressive force, God can humble nations. This demonstrates divine sovereignty."
    },
    {
      "pk": 4017010,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 10,
      "text": "Though it is planted, will it thrive? Will it not completely wither when the east wind strikes it? Wither away in the bed where it grew?’”",
      "links": "<a href='/AIV/28/13/15'>Hos. 13:15</a>",
      "comment": "The 'east wind' symbolizes Babylonian conquest. God’s judgment remains effective even in apparently promising circumstances."
    },
    {
      "pk": 4017011,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 11,
      "text": "Then the word of the LORD came to me, saying,",
      "links": "<a href='/AIV/26/17/1'>Ezek. 17:1</a>",
      "comment": "Ezekiel receives further divine interpretation—prophets act as channels for God’s direct instruction."
    },
    {
      "pk": 4017012,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 12,
      "text": "“Say now to this rebellious house, ‘Do you not know what these things mean?’ Say, ‘Behold, the king of Babylon came to Jerusalem, and took its king and princes and brought them to him in Babylon.",
      "links": "<a href='/AIV/12/24/12-16'>2 Kings 24:12-16</a>",
      "comment": "This unveils the parable. God addresses the hearers’ stubbornness—true understanding requires humility."
    },
    {
      "pk": 4017013,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 13,
      "text": "He took one from the royal family, made a covenant with him, and put him under oath. He took away the mighty of the land,",
      "links": "",
      "comment": "Babylon appointed Zedekiah as king under an oath of allegiance. The covenant and oath relate to legitimate authority, underscoring the seriousness of sworn commitments (cf. <a href='/AIV/40/5/33-37'>Matt. 5:33-37</a>)."
    },
    {
      "pk": 4017014,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 14,
      "text": "so that the kingdom might be brought low, unable to lift itself up, keeping his covenant so that it might stand.",
      "links": "",
      "comment": "Judah’s stability depended on keeping the covenant. Obedience safeguards blessing—a recurring biblical principle."
    },
    {
      "pk": 4017015,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 15,
      "text": "But he rebelled against him by sending his ambassadors to Egypt, to obtain horses and a large army. Will he prosper? Will he who does such things escape? Can he break the covenant and still escape?",
      "links": "<a href='/AIV/24/37/5-7'>Jer. 37:5-7</a>",
      "comment": "Breaking an oath brings judgment; trust must be placed in God above alliances. This hints at the New Covenant’s importance, which brings an unbreakable relationship with God (cf. <a href='/AIV/42/22/20'>Luke 22:20</a>)."
    },
    {
      "pk": 4017016,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 16,
      "text": "As I live, declares the Lord GOD, surely in the place where the king dwells who made him king, whose oath he despised and whose covenant he broke, there he shall die—in Babylon.",
      "links": "<a href='/AIV/26/12/13'>Ezek. 12:13</a>",
      "comment": "Zedekiah’s faithlessness leads to exile and death. God holds all to account, king and commoner alike."
    },
    {
      "pk": 4017017,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 17,
      "text": "Pharaoh with his mighty army and great company will not help him in war, when mounds are cast up and siege walls built to cut off many lives.",
      "links": "",
      "comment": "Egypt’s promised aid fails; salvation cannot be found apart from God’s will and appointed means (cf. <a href='/AIV/19/146/3-5'>Ps. 146:3-5</a>)."
    },
    {
      "pk": 4017018,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 18,
      "text": "He despised the oath by breaking the covenant. Behold, he gave his hand in pledge, yet did all these things. He shall not escape.",
      "links": "",
      "comment": "Making a solemn vow—swearing with a hand—is binding before God."
    },
    {
      "pk": 4017019,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 19,
      "text": "Therefore thus says the Lord GOD: As surely as I live, surely My oath which he despised and My covenant which he broke, I will even repay on his own head.",
      "links": "",
      "comment": "Divine justice brings consequences, fulfilling God’s holiness and faithfulness to His own word."
    },
    {
      "pk": 4017020,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 20,
      "text": "I will spread My net upon him, and he will be caught in My snare. I will bring him to Babylon, and will enter into judgment with him there for the unfaithfulness he committed against Me.",
      "links": "",
      "comment": "God’s justice is inescapable; the motifs of snare and judgment are often used for divine retribution."
    },
    {
      "pk": 4017021,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 21,
      "text": "All his best troops among all his troops will fall by the sword, and those who remain will be scattered in every direction. Then you will know that I, the LORD, have spoken.”",
      "links": "<a href='/AIV/26/6/10'>Ezek. 6:10</a>",
      "comment": "The recognition formula here is crucial: God’s interventions are purposeful, drawing people to acknowledge His sovereignty and justice."
    },
    {
      "pk": 4017022,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 22,
      "text": "Thus says the Lord GOD: ‘I myself will take a sprig from the lofty top of the cedar and will plant it. I will break off from the topmost of its young twigs a tender one, and I myself will plant it on a high and lofty mountain.",
      "links": "<a href='/AIV/23/11/1'>Isa. 11:1</a>; <a href='/AIV/40/2/23'>Matt. 2:23</a>",
      "comment": "God promises restoration. The ‘sprig’ and ‘tender one’ are Messianic images—Jesus, son of David, is the shoot from Jesse (cf. <a href='/AIV/23/11/1'>Isa. 11:1</a>), hinting at the coming of the one true King."
    },
    {
      "pk": 4017023,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 23,
      "text": "On the high mountain of Israel I will plant it, that it may bear branches and produce fruit and become a stately cedar. And under it will dwell every kind of bird; in the shade of its branches will dwell birds of every sort.",
      "links": "<a href='/AIV/40/13/32'>Matt. 13:32</a>; <a href='/AIV/26/20/40'>Ezek. 20:40</a>",
      "comment": "The mountain symbolizes God’s holy dwelling and universal authority. The inclusive image of birds points to the nations gathering under the true King (see <a href='/AIV/40/13/32'>Matt. 13:32</a>). This hints at the unity found in Christ’s Church—a single, visible body gathering all nations under one faith and leadership."
    },
    {
      "pk": 4017024,
      "translation": "AIV",
      "book": 26,
      "chapter": 17,
      "verse": 24,
      "text": "And all the trees of the field will know that I, the LORD, have brought down the high tree, exalted the low tree, dried up the green tree, and made the dry tree flourish. I, the LORD, have spoken; I will do it.”",
      "links": "<a href='/AIV/42/1/52'>Luke 1:52</a>",
      "comment": "This summary underscores God’s sovereignty: He alone brings down the proud and lifts up the humble. The reversal promises are finally accomplished in Christ and His Church, where those who are ‘lowly’ are raised up (see <a href='/AIV/42/1/52'>Luke 1:52</a>). As always, trust in God’s faithfulness brings hope and new life."
    }
  ],
  "translatedAt": "2025-12-23T06:54:32.870Z"
}