{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 5,
  "verses": [
    {
      "pk": 3525001,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 1,
      "text": "And you, son of man, take a sharp sword. Use it as a barber's razor. Pass it over your head and your beard. Then take balances and divide the hair.",
      "links": "<a href='/AIV/3/13/45'>Lev. 13:45</a>; <a href='/AIV/16/9/1'>Neh. 9:1</a>",
      "comment": "The shaving of the hair is a symbol of humiliation and judgment, reflecting Israel's coming disgrace."
    },
    {
      "pk": 3525002,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 2,
      "text": "A third part you shall burn with fire inside the city when the days of the siege are completed. A third part you shall strike with the sword all around the city. And a third part you shall scatter to the wind, and I will unsheath the sword after them.",
      "links": "<a href='/AIV/3/26/33'>Lev. 26:33</a>; <a href='/AIV/24/15/2'>Jer. 15:2–3</a>",
      "comment": "This division shows the fate of Jerusalem: death by plague, sword, and exile. This prefigures later judgments on unfaithful Israel."
    },
    {
      "pk": 3525003,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 3,
      "text": "And you shall take a few of these hairs and bind them in the skirts of your robe.",
      "links": "<a href='/AIV/26/6/8'>Ezek. 6:8</a>; <a href='/AIV/24/40/6'>Jer. 40:6</a>",
      "comment": "The preserved hair represents a remnant kept safe. God always preserves a faithful remnant, a theme that continues into the New Testament church."
    },
    {
      "pk": 3525004,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 4,
      "text": "And from these, again, you shall take some and throw them into the fire and burn them in the fire. From there, a fire will come forth into all the house of Israel.",
      "links": "<a href='/AIV/24/21/14'>Jer. 21:14</a>",
      "comment": "Even among the remnant, judgment comes, showing that mere physical lineage isn't enough; true faithfulness is needed, foreshadowing New Testament teaching (<a href='/AIV/40/3/9'>Matt. 3:9</a>)."
    },
    {
      "pk": 3525005,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 5,
      "text": "Thus says the Lord God: This is Jerusalem. I have set her in the center of the nations, with countries all around her.",
      "links": "<a href='/AIV/19/48/2'>Ps. 48:2</a>; <a href='/AIV/26/38/12'>Ezek. 38:12</a>",
      "comment": "Jerusalem is depicted as the center of the world, meant to be a spiritual light and example for all nations (<a href='/AIV/23/2/3'>Isa. 2:3</a>)."
    },
    {
      "pk": 3525006,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 6,
      "text": "But she has rebelled against my rules more wickedly than the nations, and against my statutes more than the countries all around her. For they have rejected my rules and have not walked according to my statutes.",
      "links": "<a href='/AIV/19/147/19-20'>Ps. 147:19–20</a>; <a href='/AIV/45/2/24'>Rom. 2:24</a>",
      "comment": "Israel had unique revelation and Law, yet broke it more blatantly, foreshadowing God’s plan to invite all peoples to His covenant people."
    },
    {
      "pk": 3525007,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 7,
      "text": "Therefore, thus says the Lord God: Because you are more turbulent than the nations that are all around you, and have not walked in my statutes nor kept my rules, nor even acted according to the rules of the nations around you,",
      "links": "<a href='/AIV/26/16/47'>Ezek. 16:47</a>",
      "comment": "God’s people are held to a higher standard due to their special vocation and calling."
    },
    {
      "pk": 3525008,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 8,
      "text": "therefore thus says the Lord God: Behold, I, even I, am against you. And I will execute judgments among you in the sight of the nations.",
      "links": "<a href='/AIV/3/26/17'>Lev. 26:17</a>",
      "comment": "This public chastisement shows God’s desire to teach and correct for the sake of all people, not for destruction but restoration."
    },
    {
      "pk": 3525009,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 9,
      "text": "And because of all your abominations, I will do among you what I have never done, and the like of which I will never do again.",
      "links": "<a href='/AIV/25/4/6'>Lam. 4:6</a>; <a href='/AIV/40/24/21'>Matt. 24:21</a>",
      "comment": "A unique judgment is promised, echoed by Jesus in his prophecy of Jerusalem’s later destruction (see Matt. 24:21)."
    },
    {
      "pk": 3525010,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 10,
      "text": "Therefore fathers shall eat their sons among you, and sons shall eat their fathers. And I will execute judgments on you, and scatter all who remain of you to every wind.",
      "links": "<a href='/AIV/3/26/29'>Lev. 26:29</a>; <a href='/AIV/25/4/10'>Lam. 4:10</a>",
      "comment": "The horror of the siege and exile is described, fulfillment of the Mosaic warnings for covenant unfaithfulness."
    },
    {
      "pk": 3525011,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 11,
      "text": "Therefore, as I live, declares the Lord God, surely, because you have defiled my sanctuary with all your detestable things and with all your abominations, I will also withdraw. My eye will not spare, nor will I have pity.",
      "links": "<a href='/AIV/26/8/6'>Ezek. 8:6</a>; <a href='/AIV/25/2/7'>Lam. 2:7</a>",
      "comment": "God's presence departs when His people continually defile what is holy. The sanctuary points forward to Christ as the true Temple (<a href='/AIV/43/2/19-21'>John 2:19–21</a>)."
    },
    {
      "pk": 3525012,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 12,
      "text": "A third part of you shall die by plague and be consumed by famine in your midst; a third part shall fall by the sword all around you; and a third part I will scatter to every wind, and will pursue with the sword.",
      "links": "<a href='/AIV/24/15/2'>Jer. 15:2–3</a>; <a href='/AIV/26/6/8'>Ezek. 6:8</a>",
      "comment": "Repetition for emphasis: the judgment recalls the curses in the Law and foreshadows the scattering (diaspora) of Israel."
    },
    {
      "pk": 3525013,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 13,
      "text": "Thus shall my anger be spent, and I will satisfy my wrath upon them. And I will be comforted. And they shall know that I am the LORD— I have spoken in my zeal—when I spend my wrath upon them.",
      "links": "<a href='/AIV/26/6/12'>Ezek. 6:12</a>; <a href='/AIV/19/78/38'>Ps. 78:38</a>",
      "comment": "God’s judgments have the purpose of bringing recognition of His holiness and authority—ultimately restorative."
    },
    {
      "pk": 3525014,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 14,
      "text": "Moreover, I will make you a waste and a reproach among the nations all around you, in the sight of all who pass by.",
      "links": "<a href='/AIV/5/28/37'>Deut. 28:37</a>; <a href='/AIV/19/44/13-14'>Ps. 44:13–14</a>",
      "comment": "The shame of Israel is a solemn warning. When God’s people fail, it dishonors God before the world—but even then, it opens the door for future redemption."
    },
    {
      "pk": 3525015,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 15,
      "text": "And you shall be a reproach and a mockery, a warning and a horror to the nations around you, when I execute judgments on you in anger and in wrath, and with furious punishments—I, the LORD, have spoken—",
      "links": "<a href='/AIV/19/79/4'>Ps. 79:4</a>",
      "comment": "The punishment of God’s people instructs the nations. Compare with <a href='/AIV/46/10/6-11'>1 Cor. 10:6–11</a> where Paul says Old Testament judgments are warnings to Christians."
    },
    {
      "pk": 3525016,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 16,
      "text": "When I send against you the deadly arrows of famine, arrows for destruction, which I will send to destroy you, when I bring more and more famine upon you and break your staff of bread,",
      "links": "<a href='/AIV/3/26/26'>Lev. 26:26</a>",
      "comment": "Breaking the staff of bread means removing the basic means of life. This theme recurs in God’s judgments, but in Christ, God offers the true bread from heaven for restoration (<a href='/AIV/43/6/32-35'>John 6:32–35</a>)."
    },
    {
      "pk": 3525017,
      "translation": "AIV",
      "book": 26,
      "chapter": 5,
      "verse": 17,
      "text": "I will send famine and wild beasts against you, and they will rob you of your children. Pestilence and bloodshed will pass through you, and I will bring the sword upon you. I, the LORD, have spoken.",
      "links": "<a href='/AIV/3/26/22'>Lev. 26:22</a>; <a href='/AIV/26/14/21'>Ezek. 14:21</a>",
      "comment": "The four judgments echo the penalties for breaking covenant in Leviticus. God’s justice is severe but His intention is to lead His people to repentance and faith, preparing for His ultimate act of mercy and restoration in Christ."
    }
  ],
  "translatedAt": "2025-12-23T06:48:28.968Z"
}