{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 14,
  "verses": [
    {
      "pk": 20031401,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 1,
      "text": "Certain elders of Israel came to me and sat down before me.",
      "links": "<a href='/AIV/26/8/1'>Ezek. 8:1</a>; <a href='/AIV/26/20/1'>Ezek. 20:1</a>",
      "comment": "Ezekiel frequently receives delegations of Israel's elders, indicating a continuing, though strained, prophetic ministry among the exiles. Their presence here prepares for a pronouncement on idolatry, a central concern throughout Israel's history."
    },
    {
      "pk": 20031402,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 2,
      "text": "And the word of the LORD came to me:",
      "links": "<a href='/AIV/26/2/2'>Ezek. 2:2</a>",
      "comment": "Ezekiel’s prophetic authority is always rooted in direct revelation from the Lord, not his own opinion."
    },
    {
      "pk": 20031403,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 3,
      "text": "Son of man, these men have set up idols in their hearts and put the stumbling block of iniquity before their faces. Should I indeed let them inquire of Me?",
      "links": "<a href='/AIV/26/7/19-20'>Ezek. 7:19-20</a>; <a href='/AIV/19/66/18'>Ps. 66:18</a>",
      "comment": "God perceives not only outward actions but inward loyalties. The 'idols in their hearts' reflects internal spiritual corruption—a warning that true worship addresses both visible and invisible aspects of religion."
    },
    {
      "pk": 20031404,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 4,
      "text": "Therefore speak to them and say to them, 'This is what the Lord GOD says: Every man of the house of Israel who sets up idols in his heart and puts the stumbling block of his iniquity before his face, and then comes to the prophet—I, the LORD, will answer him according to the multitude of his idols—'",
      "links": "<a href='/AIV/26/20/31'>Ezek. 20:31</a>; <a href='/AIV/23/44/9'>Isa. 44:9</a>",
      "comment": "God will answer those with divided hearts according to their own idols, demonstrating God respects human freedom, but also the consequences of that freedom."
    },
    {
      "pk": 20031405,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 5,
      "text": "so that I may seize the house of Israel in their hearts, who have all turned away from Me because of their idols.",
      "links": "<a href='/AIV/02/34/15'>Ex. 34:15</a>; <a href='/AIV/28/7/16'>Hos. 7:16</a>",
      "comment": "This verse reveals God’s intention to bring Israel back to Himself—even through judgment, God’s goal is always restoration. This anticipates later themes of repentance and divine mercy."
    },
    {
      "pk": 20031406,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 6,
      "text": "Therefore say to the house of Israel, 'This is what the Lord GOD says: Repent, and turn away from your idols; turn your faces away from all your abominations.'",
      "links": "<a href='/AIV/26/18/30'>Ezek. 18:30</a>; <a href='/AIV/44/3/19'>Acts 3:19</a>",
      "comment": "Repentance is seen as an active turning from sin, restoring one’s relationship with God. The theme anticipates the New Testament call to conversion (<a href='/AIV/44/3/19'>Acts 3:19</a>)."
    },
    {
      "pk": 20031407,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 7,
      "text": "For when anyone from the house of Israel, or any of the foreigners who dwell in Israel, separates himself from Me and sets up idols in his heart, and puts the stumbling block of his iniquity before his face, and then comes to a prophet to inquire of Me for himself, I, the LORD, will answer him Myself.",
      "links": "<a href='/AIV/23/59/2'>Isa. 59:2</a>",
      "comment": "God’s concern extends to foreigners living among Israel—emphasizing the inclusivity of the covenant community. God Himself responds, underscoring the seriousness of intentional disobedience."
    },
    {
      "pk": 20031408,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 8,
      "text": "And I will set My face against that man and make him a sign and a byword, and I will cut him off from the midst of My people. Then you will know that I am the LORD.",
      "links": "<a href='/AIV/03/17/10'>Lev. 17:10</a>; <a href='/AIV/05/28/37'>Deut. 28:37</a>",
      "comment": "God’s judgment is always intended for the good of the covenant community, restoring true worship and demonstrating His sovereignty. 'Sign and byword' echoes covenant curses (<a href='/AIV/05/28/37'>Deut. 28:37</a>)."
    },
    {
      "pk": 20031409,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 9,
      "text": "If the prophet is deceived and speaks a word, I, the LORD, have deceived that prophet; and I will stretch out My hand against him and will destroy him from the midst of My people Israel.",
      "links": "<a href='/AIV/11/22/23'>1 Kings 22:23</a>; <a href='/AIV/05/13/1-5'>Deut. 13:1–5</a>",
      "comment": "This sobering verse affirms that God allows—even uses—false prophets to test the hearts of His people. The divine judgment upon false prophecy points towards the need for an authoritative and trustworthy teaching office in maintaining right doctrine."
    },
    {
      "pk": 20031410,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 10,
      "text": "They will bear their punishment—the punishment of the prophet will be the same as the punishment of the one who inquires—",
      "links": "<a href='/AIV/24/14/15'>Jer. 14:15</a>",
      "comment": "Both misleading prophet and sinful inquirer are held responsible, emphasizing the seriousness of both teaching and accepting error."
    },
    {
      "pk": 20031411,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 11,
      "text": "so that the house of Israel may not stray from Me any more, nor defile themselves anymore with all their transgressions, but they may be My people and I may be their God, declares the Lord GOD.",
      "links": "<a href='/AIV/24/24/7'>Jer. 24:7</a>; <a href='/AIV/26/37/27'>Ezek. 37:27</a>; <a href='/AIV/60/2/9-10'>1 Pet. 2:9–10</a>",
      "comment": "The ultimate purpose is relational restoration—God forming a people authentically devoted to Him. This language is echoed by the apostle Peter, showing continuity from old to new covenant community."
    },
    {
      "pk": 20031412,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 12,
      "text": "The word of the LORD came to me again:",
      "links": "",
      "comment": "This formula introduces a new prophetic message, indicating an ongoing, living relationship between God and His prophet."
    },
    {
      "pk": 20031413,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 13,
      "text": "Son of man, when a land sins against Me by acting faithlessly, and I stretch out My hand against it and break its supply of bread, send famine upon it, and cut off from it man and beast,",
      "links": "<a href='/AIV/03/26/26'>Lev. 26:26</a>; <a href='/AIV/26/5/16'>Ezek. 5:16-17</a>",
      "comment": "Judgment on a 'land' for unfaithfulness points to communal dimensions of sin and punishment, prefiguring Jesus’ teaching on collective repentance and intercession (<a href='/AIV/40/11/21-24'>Matt. 11:21–24</a>)."
    },
    {
      "pk": 20031414,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 14,
      "text": "even if these three men, Noah, Daniel, and Job, were in it, they would deliver only themselves by their righteousness, declares the Lord GOD.",
      "links": "<a href='/AIV/01/06/9'>Gen. 6:9</a>; <a href='/AIV/27/1/6'>Dan. 1:6</a>; <a href='/AIV/18/1/1'>Job 1:1</a>",
      "comment": "Noah, Daniel, and Job exemplify righteousness, but their merit does not extend to saving the wider community here, underlining both the need for individual faithfulness and the limits of intercession. This anticipates the unique mediatorial role of Christ discussed in Heb. 7:25."
    },
    {
      "pk": 20031415,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 15,
      "text": "If I cause wild beasts to pass through the land and they ravage it, and it is made desolate, so that no one may pass through because of the beasts,",
      "links": "<a href='/AIV/03/26/22'>Lev. 26:22</a>",
      "comment": "The sending of wild beasts echoes covenant curses in Leviticus; God's judgments take various, sometimes unexpected, forms."
    },
    {
      "pk": 20031416,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 16,
      "text": "even if these three men were in it, as I live, declares the Lord GOD, they would deliver neither sons nor daughters. They alone would be delivered, but the land would be desolate.",
      "links": "<a href='/AIV/26/14/14'>Ezek. 14:14</a>",
      "comment": "The emphasis on personal accountability continues. Human righteousness is limited; only those truly united to God are saved. This theme is later fulfilled as the need arises for a perfect mediator—Jesus Christ."
    },
    {
      "pk": 20031417,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 17,
      "text": "Or if I bring a sword upon that land, and say, ‘Let a sword pass through the land,’ and I cut off from it man and beast,",
      "links": "<a href='/AIV/03/26/25'>Lev. 26:25</a>; <a href='/AIV/05/32/25'>Deut. 32:25</a>",
      "comment": "The sword represents violence and war as instruments of judgment. Each form of judgment underscores the reality and seriousness of sin."
    },
    {
      "pk": 20031418,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 18,
      "text": "even if these three men were in it, as I live, declares the Lord GOD, they would deliver neither sons nor daughters, but they alone would be delivered.",
      "links": "<a href='/AIV/26/14/16'>Ezek. 14:16</a>",
      "comment": "Repetition strengthens the lesson: inherited faith or righteousness is not enough. Each soul stands before God on its own (cf. <a href='/AIV/26/18/20'>Ezek. 18:20</a>)."
    },
    {
      "pk": 20031419,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 19,
      "text": "Or if I send pestilence into that land and pour out My wrath upon it with blood, to cut off from it man and beast,",
      "links": "<a href='/AIV/26/5/17'>Ezek. 5:17</a>",
      "comment": "Pestilence—plague—is one of the chief judgments described in Old Testament law and prophecy. Note echoes in the apocalyptic judgments of Revelation."
    },
    {
      "pk": 20031420,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 20,
      "text": "even if Noah, Daniel, and Job were in it, as I live, declares the Lord GOD, they would deliver neither son nor daughter. They would deliver only themselves by their righteousness.",
      "links": "<a href='/AIV/26/14/14'>Ezek. 14:14</a>",
      "comment": "The repeated pattern underscores a limitation of even the greatest saints before Jesus: only the Savior can deliver many by His merit (see <a href='/AIV/45/5/15-19'>Rom. 5:15–19</a>)."
    },
    {
      "pk": 20031421,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 21,
      "text": "For thus says the Lord GOD: How much more when I send My four severe judgments—sword, famine, wild beasts, and pestilence—against Jerusalem to cut off from it man and beast!",
      "links": "<a href='/AIV/26/5/17'>Ezek. 5:17</a>; <a href='/AIV/66/6/8'>Rev. 6:8</a>",
      "comment": "The 'four judgments' constitute a complete judgment, anticipating apocalyptic visions in Revelation. These serve as both disciplinary correction and warnings of the final judgment."
    },
    {
      "pk": 20031422,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 22,
      "text": "Yet, behold, survivors will be left in it—sons and daughters—who will be brought out. Behold, when they come out to you, and you see their ways and their deeds, you will be comforted concerning the evil I have brought upon Jerusalem, all that I have brought upon it.",
      "links": "<a href='/AIV/26/6/8'>Ezek. 6:8</a>",
      "comment": "A remnant is always preserved by God—a theme running throughout Scripture culminating in the Church as the faithful remnant united to Christ."
    },
    {
      "pk": 20031423,
      "translation": "AIV",
      "book": 26,
      "chapter": 14,
      "verse": 23,
      "text": "They will comfort you when you see their ways and their deeds, and you shall know that I have not done without cause all that I have done in it, declares the Lord GOD.",
      "links": "<a href='/AIV/05/32/4'>Deut. 32:4</a>; <a href='/AIV/19/145/17'>Ps. 145:17</a>",
      "comment": "God’s actions, though severe, are always just and for the ultimate good of His people. The remnant’s faithfulness is a witness to the divine purpose in temporal judgments, foreshadowing the ultimate vindication of God’s justice in Christ’s church."
    }
  ],
  "translatedAt": "2025-12-23T06:52:49.876Z"
}