{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 42,
  "verses": [
    {
      "pk": 33042001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 1,
      "text": "Then he led me out to the outer court, toward the north, and he brought me to the set of chambers opposite the temple yard and opposite the building to the north.",
      "links": "<a href='/AIV/26/41/12'>Ezek. 41:12</a>",
      "comment": "The guide, likely an angel (Ezek. 40:3), leads Ezekiel to the priestly chambers in the temple complex. The precision reflects divine order in worship and community."
    },
    {
      "pk": 33042002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 2,
      "text": "Along the north side, the length was one hundred cubits, and the width was fifty cubits.",
      "links": "<a href='/AIV/26/40/17'>Ezek. 40:17</a>",
      "comment": "Exact measurements reinforce the holiness and separateness of temple service; the numbers are symbolic of perfection and completeness in Old Testament imagery."
    },
    {
      "pk": 33042003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 3,
      "text": "Opposite the inner court of twenty cubits, and opposite the pavement of the outer court, was a gallery facing gallery in three stories.",
      "links": "<a href='/AIV/26/41/10-11'>Ezek. 41:10-11</a>; <a href='/AIV/11/6/5-8'>1 Kings 6:5-8</a>",
      "comment": "The architecture recalls the Solomonic temple (cf. 1 Kings 6), presenting continuity between Israel’s worship across generations. Three stories subtly hint at order, structure, and hierarchy within sacred space (compare with New Testament <a href='/AIV/49/2/19-22'>Eph. 2:19-22</a>)."
    },
    {
      "pk": 33042004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 4,
      "text": "And before the chambers was a passage, ten cubits wide inward, and a way one hundred cubits long; their doors were toward the north.",
      "links": "<a href='/AIV/26/41/11'>Ezek. 41:11</a>",
      "comment": "This layout assures organized movement for priests and rituals, a foretaste of sacred order later established in the apostolic church's ministry and sacraments."
    },
    {
      "pk": 33042005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 5,
      "text": "Now the upper chambers were narrower, for the galleries took more space away from them than from the lower and the middle ones in the building.",
      "links": "<a href='/AIV/11/6/6'>1 Kings 6:6</a>",
      "comment": "The adjustment of size signifies progression and prioritization in God’s house, suggesting the value and order found in spiritual vocations. Compare with spiritual maturity in <a href='/AIV/58/5/12-14'>Heb. 5:12-14</a>."
    },
    {
      "pk": 33042006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 6,
      "text": "For they were in three stories, but did not have pillars like the pillars of the courts; therefore, the uppermost chambers were set back more than the lower and the middle ones from the ground up.",
      "links": "<a href='/AIV/26/41/6-7'>Ezek. 41:6-7</a>",
      "comment": "Absence of pillars emphasizes reliance on the structure of the temple itself, a spiritual parallel to the foundational faith resting on Christ and his apostles (<a href='/AIV/49/2/20'>Eph. 2:20</a>)."
    },
    {
      "pk": 33042007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 7,
      "text": "And the outer wall by the chambers, toward the outer court in front of the chambers, was fifty cubits long.",
      "links": "<a href='/AIV/26/40/17'>Ezek. 40:17</a>",
      "comment": "The walls not only demarcate sacredness but also provide security and separation, symbolizing the church as a protected place (cf. <a href='/AIV/43/10/9'>John 10:9</a>)."
    },
    {
      "pk": 33042008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 8,
      "text": "For the length of the chambers toward the outer court was fifty cubits, while those opposite the temple were a hundred cubits long.",
      "links": "<a href='/AIV/26/41/13'>Ezek. 41:13</a>",
      "comment": "Contrast in length marks distinct functions—outer court for more common purposes, inner areas for more sacred ministries. These dedicated spaces set the pattern for different roles within the church’s order."
    },
    {
      "pk": 33042009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 9,
      "text": "At the base of these chambers was an entrance from the east, as one enters them from the outer court.",
      "links": "<a href='/AIV/26/43/1-4'>Ezek. 43:1-4</a>",
      "comment": "Access through the east holds eschatological significance, foreshadowing the glory of the Lord returning by the eastern gate—a symbol fulfilled in God’s unique and final presence among his people."
    },
    {
      "pk": 33042010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 10,
      "text": "In the width of the wall of the court toward the south, before the outer court and before the building, were chambers.",
      "links": "<a href='/AIV/26/41/12-14'>Ezek. 41:12-14</a>",
      "comment": "These southern chambers balance the design, reinforcing the comprehensiveness and symmetry characteristic of divine architecture and the all-embracing nature of God’s house."
    },
    {
      "pk": 33042011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 11,
      "text": "And in front of them was a passage like the chambers on the north; their length and width were the same, all their exits and arrangements and doors were the same.",
      "links": "<a href='/AIV/26/42/4'>Ezek. 42:4</a>",
      "comment": "Standardization suggests unity and order—vital for right worship. The church’s unity is seen as a reflection of heavenly order (see <a href='/AIV/46/14/33'>1 Cor. 14:33</a>)."
    },
    {
      "pk": 33042012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 12,
      "text": "According to the entrances of the chambers that were on the south, there was an entrance at the head of the passage, before the wall directly corresponding to the passage one enters from the east.",
      "links": "<a href='/AIV/26/40/5'>Ezek. 40:5</a>",
      "comment": "Repeated patterns in entrances and passages suggest an established tradition, laying the groundwork for rituals and liturgical practices carried forward in the apostolic church."
    },
    {
      "pk": 33042013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 13,
      "text": "Then he said to me, 'The north chambers and the south chambers, which are opposite the courtyard, are for the priests. These are the holy chambers, where the priests who approach the LORD shall eat the most holy offerings; there they shall lay the most holy offerings—the grain offering, the sin offering, and the guilt offering—for the place is holy.'",
      "links": "<a href='/AIV/26/43/19'>Ezek. 43:19</a>; <a href='/AIV/3/6/16-18'>Lev. 6:16-18</a>; <a href='/AIV/3/7/6'>Lev. 7:6</a>",
      "comment": "Priests consuming offerings inside the holy chambers points to a sacred communion—a precursor to later sacramental practices where the ministers participate intimately in God's holiness. See spiritual continuity with <a href='/AIV/46/11/23-26'>1 Cor. 11:23-26</a>."
    },
    {
      "pk": 33042014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 14,
      "text": "When the priests enter, they shall not go out of the holy place into the outer court without laying there their sacred garments, for these are holy. They shall put on other garments before they go near that which concerns the people.",
      "links": "<a href='/AIV/2/28/40-43'>Exod. 28:40-43</a>; <a href='/AIV/3/6/11'>Lev. 6:11</a>",
      "comment": "Priesthood, garments, and separation emphasize sacred mediation—a theme fulfilled when Christ, our High Priest, mediates between God and people (<a href='/AIV/58/4/14-16'>Heb. 4:14-16</a>). The tradition of vestments continues this symbolism of holiness in ministry."
    },
    {
      "pk": 33042015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 15,
      "text": "When he had finished measuring the inner temple, he brought me out by the gate which faces east, and measured all around.",
      "links": "<a href='/AIV/26/40/5'>Ezek. 40:5</a>",
      "comment": "Measurement symbolizes exactness in God’s design—reminding us the spiritual community is founded ‘according to the pattern.’ The eastward movement anticipates the Messiah’s entrance (see <a href='/AIV/26/43/4'>Ezek. 43:4</a>)."
    },
    {
      "pk": 33042016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 16,
      "text": "He measured the east side with the measuring rod: five hundred cubits by the measuring rod all around.",
      "links": "<a href='/AIV/26/40/3-5'>Ezek. 40:3-5</a>",
      "comment": "This significant length marks out a sacred boundary. Such consecrated space reflects God’s design for setting apart His people, just as believers are set apart in Christ (<a href='/AIV/60/2/9'>1 Pet. 2:9</a>)."
    },
    {
      "pk": 33042017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 17,
      "text": "He measured the north side: five hundred cubits with the measuring rod all around.",
      "links": "",
      "comment": "Each side’s identical measurement attests to perfect justice and equality before God. Sacred architecture prefigures the all-encompassing nature of the New Jerusalem (<a href='/AIV/66/21/16'>Rev. 21:16</a>)."
    },
    {
      "pk": 33042018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 18,
      "text": "He measured the south side: five hundred cubits by the measuring rod.",
      "links": "",
      "comment": "Completing each side illustrates wholeness and inclusiveness, reflecting the fullness of God’s family gathered into perfect unity."
    },
    {
      "pk": 33042019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 19,
      "text": "He turned to the west side and measured five hundred cubits with the measuring rod.",
      "links": "",
      "comment": "Every side, east, north, south, and west, being equal, evokes fourfold universality. This imagery finds fulfillment in the spread of the Gospel to all nations (<a href='/AIV/40/28/19'>Matt. 28:19</a>), a vision of worldwide unity."
    },
    {
      "pk": 33042020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 42,
      "verse": 20,
      "text": "He measured it on the four sides. It had a wall all around—five hundred long and five hundred wide—to separate what was holy from what was common.",
      "links": "<a href='/AIV/26/22/26'>Ezek. 22:26</a>; <a href='/AIV/3/10/10'>Lev. 10:10</a>",
      "comment": "Separation between holy and common teaches the necessity for sacred boundaries. This foreshadows Christ’s work in making His people holy (see <a href='/AIV/58/10/10'>Heb. 10:10</a>). The principle of set-apart sacredness remains central in both worship and life."
    }
  ],
  "translatedAt": "2025-12-24T09:22:36.918Z"
}