{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 4,
  "verses": [
    {
      "pk": 2640001,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 1,
      "text": "And you, son of man, take a brick and set it before you, and engrave on it a city, even Jerusalem.",
      "links": "<a href='/AIV/23/8/1'>Isa. 8:1</a>; <a href='/AIV/24/1/13'>Jer. 1:13</a>",
      "comment": "Here the prophet uses a symbolic act, a common method among the prophets, to illustrate God's message. The use of physical objects and actions foreshadows how spiritual truths can be conveyed through material means—a concept rooted in biblical tradition."
    },
    {
      "pk": 2640002,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 2,
      "text": "Lay siege against it, build a siege wall, raise ramps against it, set up camps around it, and place battering rams all around.",
      "links": "<a href='/AIV/24/6/6'>Jer. 6:6</a>; <a href='/AIV/25/2/8'>Lam. 2:8</a>",
      "comment": "Ezekiel’s actions point to God’s judgment on Jerusalem. This literal siege was also a spiritual sign of consequence for Israel’s disobedience. Similar sieges appear throughout the Old Testament as a form of corrective discipline."
    },
    {
      "pk": 2640003,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 3,
      "text": "Then take an iron plate and set it as an iron wall between you and the city. Set your face toward it, and it will be under siege, and you shall besiege it. This is a sign to the house of Israel.",
      "links": "<a href='/AIV/24/1/18'>Jer. 1:18</a>",
      "comment": "The iron plate symbolizes separation between Ezekiel (as God’s stand-in) and Jerusalem’s people. This foreshadows the separation from God caused by unfaithfulness but also points to future mediation and reconciliation through divine means."
    },
    {
      "pk": 2640004,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 4,
      "text": "Then lie on your left side, and lay the guilt of the house of Israel upon yourself. According to the number of the days that you lie on it, you shall bear their guilt.",
      "links": "<a href='/AIV/28/1/2'>Hos. 1:2</a>; <a href='/AIV/40/8/17'>Matt. 8:17</a>",
      "comment": "Ezekiel’s bearing of Israel’s guilt serves as a type or foreshadowing of Christ, who would bear the sins of humanity (see Isaiah 53; 2 Corinthians 5:21). The prophetic office often sacrificially represents the people before God."
    },
    {
      "pk": 2640005,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 5,
      "text": "For I assign to you a number of days, three hundred ninety days, equal to the years of their guilt; so you shall bear the guilt of the house of Israel.",
      "links": "<a href='/AIV/4/14/34'>Num. 14:34</a>",
      "comment": "The 390 days symbolize 390 years of Israel’s persistent sin (Num. 14:34 demonstrates symbolic day-for-year interpretation). This emphasizes the seriousness of their covenant violation, with the prophet as a living sign of atonement."
    },
    {
      "pk": 2640006,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 6,
      "text": "And when you have completed these, lie down again, but on your right side, and you shall bear the guilt of the house of Judah forty days. I assign you a day for each year.",
      "links": "<a href='/AIV/4/14/34'>Num. 14:34</a>; <a href='/AIV/1/21/41'>Gen. 21:41</a>",
      "comment": "The separation of Israel and Judah’s guilt reinforces the divided nature of God’s people yet highlights a redemptive desire for unity. Future fulfillment is seen in the reunification and ultimate restoration under the New Covenant."
    },
    {
      "pk": 2640007,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 7,
      "text": "And you shall set your face toward the siege of Jerusalem, with your arm bared, and prophesy against it.",
      "links": "<a href='/AIV/23/52/10'>Isa. 52:10</a>; <a href='/AIV/26/21/2'>Ezek. 21:2</a>",
      "comment": "The bared arm is a sign of strength and readiness for action (Isa. 52:10). The prophet’s posture visually communicates God’s active involvement and impending judgment. This dramatic symbol stresses the urgency of repentance."
    },
    {
      "pk": 2640008,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 8,
      "text": "See, I will tie you with ropes, so that you cannot turn from one side to the other, until you have completed the days of your siege.",
      "links": "<a href='/AIV/26/3/25'>Ezek. 3:25</a>",
      "comment": "God’s restriction of Ezekiel’s movement reinforces divine sovereignty and obedience. The prophet’s submission prefigures the call for sacrificial obedience found throughout Scripture and ultimately fulfilled in Christ’s example."
    },
    {
      "pk": 2640009,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 9,
      "text": "And you, take wheat, barley, beans, lentils, millet, and spelt, put them in a single vessel, and make bread from them. During the number of days that you lie on your side—three hundred ninety days—you shall eat it.",
      "links": "<a href='/AIV/26/12/19'>Ezek. 12:19</a>",
      "comment": "The mixing of grains suggests scarcity and hardship, emphasizing the coming famine. Bread here, though humble, points to deeper symbolism of sustenance from God and the spiritual nourishment that better things foreshadow (see John 6:35)."
    },
    {
      "pk": 2640010,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 10,
      "text": "And your food, which you shall eat, shall be by weight, twenty shekels a day; you shall eat it from time to time.",
      "links": "<a href='/AIV/3/26/26'>Lev. 26:26</a>",
      "comment": "Strictly measured food rations highlight the severity of the coming siege (Lev. 26:26). The rationed bread underlines both judgment and God's ongoing provision, even in times of trial, pointing forward to reliance on God alone."
    },
    {
      "pk": 2640011,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 11,
      "text": "You shall also drink water by measure, a sixth of a hin; you shall drink it from time to time.",
      "links": "<a href='/AIV/3/26/26'>Lev. 26:26</a>",
      "comment": "Measured water again teaches dependence on God in want (see 1 Kings 17:8-16). The theme of spiritual thirst and satisfaction is picked up fully in New Testament teachings about living water (John 4:13-14)."
    },
    {
      "pk": 2640012,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 12,
      "text": "And you shall eat it as barley cakes, and bake it in their sight on dried human dung.",
      "links": "<a href='/AIV/28/9/3'>Hos. 9:3</a>",
      "comment": "The use of human dung for fuel signified Israel’s defilement among the nations—a shocking image emphasizing the totality of exile. The idea of ritual purity is central here, later fulfilled in New Testament purification through Christ’s sacrifice."
    },
    {
      "pk": 2640013,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 13,
      "text": "And the LORD said, 'Thus shall the people of Israel eat their bread unclean, among the nations where I will drive them.'",
      "links": "<a href='/AIV/27/1/8'>Dan. 1:8</a>; <a href='/AIV/16/9/36'>Neh. 9:36-37</a>",
      "comment": "The judgment of eating unclean bread abroad highlights consequences of covenant unfaithfulness and the longing for restoration. It also points to the need for a community rooted in pure worship and right relationship with God."
    },
    {
      "pk": 2640014,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 14,
      "text": "Then I said, 'Ah, Lord GOD! See, I have never made myself unclean; from my youth till now I have not eaten what died of itself or was torn by beasts, nor has unclean meat entered my mouth.'",
      "links": "<a href='/AIV/3/11/39-40'>Lev. 11:39–40</a>",
      "comment": "Ezekiel’s protest highlights his personal commitment to God’s laws regarding ritual purity (see Daniel 1:8). His plea underscores both personal holiness and the tension between prophetic obedience and ceremonial law."
    },
    {
      "pk": 2640015,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 15,
      "text": "Then God said to me, 'See, I will let you have cow dung instead of human dung, and you shall prepare your bread on it.'",
      "links": "<a href='/AIV/3/16/15'>Lev. 16:15</a>",
      "comment": "God permits a less defiling alternative, displaying divine compassion in judgment. This mirrors scriptural patterns where God shows mercy even as He enacts justice, keeping open the path for repentance and renewal."
    },
    {
      "pk": 2640016,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 16,
      "text": "And he said to me, 'Son of man, see, I will break the supply of bread in Jerusalem. They shall eat bread by weight, and with anxiety, and they shall drink water by measure, and with horror,",
      "links": "<a href='/AIV/3/26/26'>Lev. 26:26</a>; <a href='/AIV/25/4/8-10'>Lam. 4:8–10</a>",
      "comment": "The breakdown of bread represents not just physical hardship but a deeper spiritual famine. True satisfaction is ultimately restored in God’s covenant promises, fully realized in the New Covenant (see John 6:48-51)."
    },
    {
      "pk": 2640017,
      "translation": "AIV",
      "book": 26,
      "chapter": 4,
      "verse": 17,
      "text": "so that they will lack bread and water, and be appalled at one another, and waste away in their guilt.",
      "links": "<a href='/AIV/3/26/39'>Lev. 26:39</a>; <a href='/AIV/28/9/3'>Hos. 9:3</a>",
      "comment": "The concluding image of guilt and wasting away demonstrates the grave effects of covenant infidelity. Yet, the hope of return and restoration following repentance is an essential motif that is fulfilled in the unity, continual sacrifice, and mercy promised by God."
    }
  ],
  "translatedAt": "2025-12-23T06:48:00.653Z"
}