{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 45,
  "verses": [
    {
      "pk": 45001,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 1,
      "text": "When you divide the land as an inheritance, you shall set apart a holy portion for the Lord, twenty-five thousand cubits in length and ten thousand cubits in width; it shall be holy throughout its whole territory.",
      "links": "<a href='/AIV/03/25/23'>Lev. 25:23</a>; <a href='/AIV/26/42/16-20'>Ezek. 42:16–20</a>",
      "comment": "This sets aside a special, consecrated area in the new land apportioned to Israel. The idea of sacred land recalls the emphasis on holiness and separation for the Lord seen throughout the Law (Lev. 25:23)."
    },
    {
      "pk": 45002,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 2,
      "text": "Of this, a square plot measuring five hundred by five hundred cubits shall be for the sanctuary, with fifty cubits of open space all around it.",
      "links": "<a href='/AIV/26/42/15-20'>Ezek. 42:15–20</a>",
      "comment": "The specific measurements emphasize the precision and order in God’s worship. The sanctuary is set apart by space, symbolizing the utter holiness of God."
    },
    {
      "pk": 45003,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 3,
      "text": "And from this measured area, you shall measure out a length of twenty-five thousand cubits and a width of ten thousand cubits; in it shall be the sanctuary, the Most Holy Place.",
      "links": "<a href='/AIV/26/41/4'>Ezek. 41:4</a>",
      "comment": "The 'Most Holy Place' brings to mind the Holy of Holies in the tabernacle and temple, prefiguring the ultimate presence of God with His people (see Heb. 9:3-8)."
    },
    {
      "pk": 45004,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 4,
      "text": "It is a holy portion of the land; it shall be for the priests who minister in the sanctuary, who draw near to minister to the Lord, and it shall be a place for their houses and a holy area for the sanctuary.",
      "links": "<a href='/AIV/04/18/20'>Num. 18:20</a>; <a href='/AIV/26/44/15-16'>Ezek. 44:15-16</a>",
      "comment": "Exclusive provision for priests signifies God’s design for a dedicated priesthood. The allowance of homes nearby reinforces the need for continual ministry before the Lord, echoing the perpetual priesthood (Luke 1:8-9)."
    },
    {
      "pk": 45005,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 5,
      "text": "An area twenty-five thousand cubits long and ten thousand wide shall also be for the Levites, the ministers of the temple, for their possession, with twenty chambers.",
      "links": "<a href='/AIV/04/35/2-3'>Num. 35:2-3</a>; <a href='/AIV/26/40/17,44'>Ezek. 40:17, 44</a>",
      "comment": "Provision for the Levites highlights the importance of clergy in caring for God’s house and service. The presence of chambers or rooms implies a structure for ordered, regular ministry."
    },
    {
      "pk": 45006,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 6,
      "text": "And you shall appoint as the property of the city an area five thousand cubits wide and twenty-five thousand cubits long, alongside the holy portion; it shall belong to all the house of Israel.",
      "links": "<a href='/AIV/26/48/15-19'>Ezek. 48:15-19</a>",
      "comment": "This city space parallels the structure of Jerusalem in ancient Israel, providing for communal life. The collective inheritance hints at a unified people belonging to God."
    },
    {
      "pk": 45007,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 7,
      "text": "And to the prince shall belong the land on each side of the holy portion and the city’s property, alongside the holy portion and the property of the city, from the west side westward and from the east side eastward, matching the length of one of the portions, from the west border to the east border.",
      "links": "<a href='/AIV/26/34/24'>Ezek. 34:24</a>; <a href='/AIV/26/37/25'>Ezek. 37:25</a>",
      "comment": "The 'prince' signifies a Davidic ruler (Ezek. 34:23-24), prefiguring Christ as the true Shepherd-King. The ordered distribution of land emphasizes the role of righteous authority among God’s people."
    },
    {
      "pk": 45008,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 8,
      "text": "It shall be for him a land for possession in Israel. My princes shall no longer oppress My people, but they shall give the rest of the land to the house of Israel according to their tribes.",
      "links": "<a href='/AIV/26/34/21-22'>Ezek. 34:21-22</a>",
      "comment": "A call for just rule—no longer will rulers exploit God’s people. This echoes prophetic promises of righteous leadership (Jer. 23:5-6)."
    },
    {
      "pk": 45009,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 9,
      "text": "Thus says the Lord God: Enough, O princes of Israel! Remove violence and oppression, execute justice and righteousness, and stop dispossessing My people, declares the Lord God.",
      "links": "<a href='/AIV/23/1/17'>Isa. 1:17</a>; <a href='/AIV/26/22/27-28'>Ezek. 22:27-28</a>",
      "comment": "Condemnation of injustice is a core prophetic theme. God’s kingdom is marked by justice, a signpost of the coming messianic reign of peace (Isa. 9:7)."
    },
    {
      "pk": 45010,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 10,
      "text": "You shall have honest scales, honest ephahs, and honest baths.",
      "links": "<a href='/AIV/03/19/35-36'>Lev. 19:35-36</a>; <a href='/AIV/20/11/1'>Prov. 11:1</a>",
      "comment": "Integrity in commerce reflects God’s holiness in all parts of life. It foreshadows the call to holiness and honesty for all believers (1 Pet. 1:15-16)."
    },
    {
      "pk": 45011,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 11,
      "text": "The ephah and the bath shall be of the same measure, the bath containing one-tenth of a homer, and the ephah one-tenth of a homer; their measure shall be by the homer.",
      "links": "<a href='/AIV/03/19/36'>Lev. 19:36</a>",
      "comment": "Regulation of just measures ensures fairness; the emphasis on set standards reminds us that God is a God of order, and law serves as a guide for the community."
    },
    {
      "pk": 45012,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 12,
      "text": "And the shekel shall be twenty gerahs. Twenty shekels, twenty-five shekels, and fifteen shekels shall be your mina.",
      "links": "<a href='/AIV/02/30/13'>Ex. 30:13</a>",
      "comment": "Faithfulness in even ‘small’ things like weights and measures is expected by God, reflecting deeper spiritual truths about faithfulness (Luke 16:10)."
    },
    {
      "pk": 45013,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 13,
      "text": "This is the offering which you shall offer: one-sixth of an ephah from each homer of wheat, and one-sixth of an ephah from each homer of barley.",
      "links": "<a href='/AIV/03/2/14'>Lev. 2:14</a>",
      "comment": "These grain offerings recall earlier Levitical regulations, showing continuity in sacrificial worship (Lev. 2:14)."
    },
    {
      "pk": 45014,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 14,
      "text": "As the set portion of oil, one-tenth of a bath from each cor (the cor is ten baths or a homer, for ten baths are a homer);",
      "links": "<a href='/AIV/02/29/40'>Ex. 29:40</a>; <a href='/AIV/03/2/1'>Lev. 2:1</a>",
      "comment": "Offerings of oil were vital for both grain offerings and lampstands in worship, symbolizing the Holy Spirit’s ongoing presence."
    },
    {
      "pk": 45015,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 15,
      "text": "and one sheep from every flock of two hundred, from the watering places of Israel—to be a grain offering, burnt offering, and peace offering, to make atonement for them, declares the Lord God.",
      "links": "<a href='/AIV/03/4/20-21'>Lev. 4:20-21</a>; <a href='/AIV/03/16/6'>Lev. 16:6</a>",
      "comment": "Animal sacrifices for atonement echo Levitical practice but also point ahead to Christ’s unique, once-for-all sacrifice (see Heb. 10:10-14; John 1:29)."
    },
    {
      "pk": 45016,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 16,
      "text": "All the people of the land shall be responsible for this offering for the prince in Israel.",
      "links": "<a href='/AIV/02/30/12-15'>Ex. 30:12-15</a>",
      "comment": "Every member participates in sustaining worship. The communal aspect refers to a united, participatory form of worship that points toward full, shared fellowship."
    },
    {
      "pk": 45017,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 17,
      "text": "And it shall be the prince’s responsibility to provide burnt offerings, grain offerings, and drink offerings, at the feasts, the New Moons, and the Sabbaths, at all the appointed feasts of the house of Israel. He shall provide the sin offerings, grain offerings, burnt offerings, and peace offerings, to make atonement for the house of Israel.",
      "links": "<a href='/AIV/03/23/2-4'>Lev. 23:2–4</a>; <a href='/AIV/26/46/4-7'>Ezek. 46:4-7</a>",
      "comment": "The prince’s leadership in worship recalls royal patronage of the temple (like David and Solomon). The prince as intercessor prefigures the kingly role of Christ, who mediates and atones for His people."
    },
    {
      "pk": 45018,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 18,
      "text": "Thus says the Lord God: In the first month, on the first day of the month, you shall take a bull without blemish and cleanse the sanctuary.",
      "links": "<a href='/AIV/03/16/16'>Lev. 16:16</a>; <a href='/AIV/26/43/18-22'>Ezek. 43:18-22</a>",
      "comment": "This ritual cleansing recalls the Day of Atonement and the continual need for purification, ultimately fulfilled through Christ’s perfect priestly sacrifice (Heb. 9:13-14)."
    },
    {
      "pk": 45019,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 19,
      "text": "The priest shall take some of the blood from the sin offering and put it on the doorposts of the temple, on the four corners of the ledge of the altar, and on the posts of the gate of the inner court.",
      "links": "<a href='/AIV/02/12/7'>Ex. 12:7</a>; <a href='/AIV/03/16/18'>Lev. 16:18</a>",
      "comment": "Application of blood for sanctification draws on Exodus Passover themes and temple rituals—sacred acts that prefigure Christ’s atoning blood (1 Cor. 5:7, Heb. 9:12-14)."
    },
    {
      "pk": 45020,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 20,
      "text": "And so you shall do on the seventh day of the month for everyone who errs or is naïve; thus you shall make atonement for the temple.",
      "links": "<a href='/AIV/03/16/15-16'>Lev. 16:15-16</a>",
      "comment": "The ongoing atonement for unintentional sin and ignorance shows God’s mercy to all and is fulfilled in Christ’s once-for-all sacrifice for every transgression."
    },
    {
      "pk": 45021,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 21,
      "text": "In the first month, on the fourteenth day of the month, you shall observe the Passover, a feast of seven days. Unleavened bread shall be eaten.",
      "links": "<a href='/AIV/02/12/6-20'>Ex. 12:6-20</a>; <a href='/AIV/46/5/7'>1 Cor. 5:7</a>",
      "comment": "Passover remembrance connects to Christ, our Passover Lamb (1 Cor. 5:7). The feast, central to Israel, underlines salvation through sacrifice."
    },
    {
      "pk": 45022,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 22,
      "text": "And on that day the prince shall prepare for himself and for all the people of the land a bull for a sin offering.",
      "links": "<a href='/AIV/03/16/6'>Lev. 16:6</a>",
      "comment": "The prince serves not only for the people but also for himself, echoing the high priest’s role in Leviticus. Christ, as the perfect priest, is sinless and yet identifies with us (Heb. 7:26-28)."
    },
    {
      "pk": 45023,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 23,
      "text": "And on the seven days of the feast he shall prepare a burnt offering to the Lord: seven bulls and seven rams without blemish on each day of the seven days, and a male goat daily for a sin offering.",
      "links": "<a href='/AIV/04/28/16-25'>Num. 28:16-25</a>",
      "comment": "Completeness in numbers (seven) points to perfection in worship and sacrifice, ultimately completed in Christ’s once-for-all offering."
    },
    {
      "pk": 45024,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 24,
      "text": "He shall provide as a grain offering an ephah for each bull, an ephah for each ram, and a hin of oil for each ephah.",
      "links": "<a href='/AIV/03/2/1'>Lev. 2:1</a>",
      "comment": "These offerings highlight generosity and fullness in worship. Oil symbolizes the Spirit and the sufficiency of God’s provision."
    },
    {
      "pk": 45025,
      "translation": "AIV",
      "book": 26,
      "chapter": 45,
      "verse": 25,
      "text": "In the seventh month, on the fifteenth day of the month, at the feast, he shall offer the same as those for seven days: the same offerings for sin, burnt offerings, grain offerings, and oil.",
      "links": "<a href='/AIV/03/23/33-36'>Lev. 23:33-36</a>",
      "comment": "This refers to the Feast of Tabernacles, symbolizing God dwelling with His people. The all-encompassing offerings foreshadow the time when God will be fully present with His people in a new and greater way (Rev. 21:3)."
    }
  ],
  "translatedAt": "2025-12-23T07:10:48.535Z"
}