{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 43,
  "verses": [
    {
      "pk": 33043001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 1,
      "text": "Then he led me to the gate, the gate facing east.",
      "links": "<a href='/AIV/33/40/6'>Ezekiel 40:6</a>; <a href='/AIV/38/14/4'>Zechariah 14:4</a>",
      "comment": "The east gate represents the direction from which God's glory appears, often symbolizing new beginnings and the coming presence of the Lord. See Ezekiel 10:19 and the later return of glory to the east."
    },
    {
      "pk": 33043002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 2,
      "text": "And behold, the glory of the God of Israel was coming from the east. His voice was like the sound of many waters, and the earth shone with his glory.",
      "links": "<a href='/AIV/26/1/24'>Ezekiel 1:24</a>; <a href='/AIV/66/1/15'>Revelation 1:15</a>; <a href='/AIV/19/29/3'>Psalm 29:3</a>",
      "comment": "The image of God's glory returning echoes Revelation 1:15 and Psalm 29:3; the 'sound of many waters' is a sign of divine majesty. The theme of God's glory is a foretaste of Christ’s coming in the New Testament."
    },
    {
      "pk": 33043003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 3,
      "text": "It was like the vision I had seen when he came to destroy the city, and like the visions I saw by the Kebar canal; and I fell on my face.",
      "links": "<a href='/AIV/33/1/28'>Ezekiel 1:28</a>; <a href='/AIV/33/8/4'>Ezekiel 8:4</a>",
      "comment": "Ezekiel's vision here recalls earlier experiences of God’s holiness. Falling on his face is a posture of worship and submission, a pattern for approaching God's presence."
    },
    {
      "pk": 33043004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 4,
      "text": "The glory of the LORD entered into the temple by the gate facing east.",
      "links": "<a href='/AIV/33/10/19'>Ezekiel 10:19</a>; <a href='/AIV/33/44/1'>Ezekiel 44:1</a>",
      "comment": "God’s glory re-entering the temple hints at restoration after exile—pointing to God's desire for permanent dwelling among his people, a precursor to the indwelling presence found in the New Covenant (John 1:14)."
    },
    {
      "pk": 33043005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 5,
      "text": "The Spirit lifted me up and brought me into the inner court; and behold, the glory of the LORD filled the temple.",
      "links": "<a href='/AIV/33/40/28'>Ezekiel 40:28</a>; <a href='/AIV/11/8/10'>1 Kings 8:10-11</a>",
      "comment": "The Spirit’s role in moving Ezekiel parallels the Spirit at Pentecost (Acts 2:2-4). The temple being filled recalls 1 Kings 8:10-11, showing God’s readiness to inhabit his holy place."
    },
    {
      "pk": 33043006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 6,
      "text": "While the man stood beside me, I heard someone speaking to me out of the temple.",
      "links": "<a href='/AIV/33/40/3'>Ezekiel 40:3</a>; <a href='/AIV/33/1/28'>Ezekiel 1:28</a>",
      "comment": "A mysterious figure is present, possibly an angelic or priestly figure—reinforcing the role of intermediaries in divine encounter."
    },
    {
      "pk": 33043007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 7,
      "text": "He said to me, 'Son of man, this is the place of my throne and the place of the soles of my feet, where I will dwell among the people of Israel forever. The house of Israel shall no longer defile my holy name, neither they nor their kings, by their sexual immorality or by the corpses of their kings at their high places.'",
      "links": "<a href='/AIV/33/37/27'>Ezekiel 37:27</a>; <a href='/AIV/19/99/5'>Psalm 99:5</a>",
      "comment": "God’s throne on earth prefigures Christ reigning as King (Luke 1:33). The call to purity affirms the sanctity of worship and the need for reverence—central to the faith’s spiritual life."
    },
    {
      "pk": 33043008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 8,
      "text": "'By setting their threshold by my threshold and their doorpost beside my doorpost, with only a wall between me and them, they defiled my holy name by the abominations they committed, so I consumed them in my anger.'",
      "links": "<a href='/AIV/33/8/6'>Ezekiel 8:6</a>; <a href='/AIV/24/7/30'>Jeremiah 7:30</a>",
      "comment": "The blending of sacred and profane is condemned; faithfulness to God demands exclusive devotion, a principle lasting into the New Testament era (2 Corinthians 6:16)."
    },
    {
      "pk": 33043009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 9,
      "text": "'Now let them put away their sexual immorality and the corpses of their kings far from me, and I will dwell among them forever.'",
      "links": "<a href='/AIV/19/132/14'>Psalm 132:14</a>; <a href='/AIV/33/37/26'>Ezekiel 37:26</a>",
      "comment": "God’s permanent dwelling among his people requires purity. Spiritual preparation is necessary for true worship, reflecting deep transformation—fulfilled in the sanctified community."
    },
    {
      "pk": 33043010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 10,
      "text": "'As for you, son of man, describe the temple to the house of Israel, that they may be ashamed of their sins. Let them measure its pattern.'",
      "links": "<a href='/AIV/33/40/4'>Ezekiel 40:4</a>",
      "comment": "The measuring of the temple points to careful observance of God’s order, echoing the formation of a structured worship life."
    },
    {
      "pk": 33043011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 11,
      "text": "'If they are ashamed of all they have done, show them the design of the temple—its arrangement, its exits and entrances, its whole form—all its ordinances and laws. Write it down so they may keep its entire plan and all its statutes and do them.'",
      "links": "<a href='/AIV/33/44/5'>Ezekiel 44:5</a>; <a href='/AIV/02/25/9'>Exodus 25:9</a>",
      "comment": "Repentance leads to restoration and obedience. Writing down the law and structure signifies fidelity and lasting tradition in worship practice."
    },
    {
      "pk": 33043012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 12,
      "text": "'This is the law of the temple: the whole area around the top of the mountain shall be most holy. Behold, this is the law of the temple.'",
      "links": "<a href='/AIV/02/3/5'>Exodus 3:5</a>; <a href='/AIV/33/45/3'>Ezekiel 45:3</a>",
      "comment": "The holiness of the area set apart for God’s presence reinforces the idea of sacred space, echoed in references to Moses at Sinai."
    },
    {
      "pk": 33043013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 13,
      "text": "‘These are the measurements of the altar in cubits (a cubit is a forearm’s length plus a handbreadth): the base shall be one cubit high and one cubit wide, with a rim around its edge one span wide; this is the base of the altar.’",
      "links": "<a href='/AIV/02/27/1'>Exodus 27:1</a>; <a href='/AIV/26/2/23'>Leviticus 2:23</a>",
      "comment": "The altar’s careful design recalls the construction described in Exodus 27, showing the importance of detail and reverence."
    },
    {
      "pk": 33043014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 14,
      "text": "‘From the base on the ground to the lower ledge shall be two cubits, and its width one cubit; and from the smaller ledge to the larger ledge shall be four cubits, and its width one cubit.’",
      "links": "<a href='/AIV/02/27/1'>Exodus 27:1</a>",
      "comment": "The tiered structure of the altar emphasizes preparation for sacrifice, a concept fulfilled in Christ as the ultimate offering."
    },
    {
      "pk": 33043015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 15,
      "text": "‘The altar hearth shall be four cubits high, and from the hearth, with four horns extending upward.’",
      "links": "<a href='/AIV/19/118/27'>Psalm 118:27</a>; <a href='/AIV/02/27/2'>Exodus 27:2</a>",
      "comment": "Altar horns were used in ancient times as symbols of strength and refuge, alluding to Christ as our ultimate place of mercy."
    },
    {
      "pk": 33043016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 16,
      "text": "‘The altar hearth shall be twelve cubits long by twelve cubits wide, square in all its sides.’",
      "links": "<a href='/AIV/66/21/16'>Revelation 21:16</a>",
      "comment": "The square design, echoing completeness and perfection, may point to the heavenly city in Revelation 21:16, where God’s dwelling is eternal."
    },
    {
      "pk": 33043017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 17,
      "text": "‘The ledge shall be fourteen cubits long by fourteen cubits wide, with a rim around it half a cubit high, and its base a cubit all around. The stairs of the altar shall face east.’",
      "links": "<a href='/AIV/33/40/6'>Ezekiel 40:6</a>",
      "comment": "Orientation towards the east links to the expectation of redemption coming from the east, reinforcing a theme of anticipation for the Messiah."
    },
    {
      "pk": 33043018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 18,
      "text": "He said to me, ‘Son of man, thus says the Lord GOD: These are the ordinances for the altar on the day when it is made, for offering burnt offerings on it and sprinkling blood upon it.’",
      "links": "<a href='/AIV/03/1/5'>Leviticus 1:5</a>",
      "comment": "Sacrifice and blood are necessary for holiness and forgiveness, a theme fully consummated in Christ’s sacrifice (Hebrews 9:13-14)."
    },
    {
      "pk": 33043019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 19,
      "text": "‘You shall give a young bull as a sin offering to the Levitical priests who are descended from Zadok and approach to minister to me, declares the Lord GOD.’",
      "links": "<a href='/AIV/03/4/3'>Leviticus 4:3</a>; <a href='/AIV/33/44/15'>Ezekiel 44:15</a>",
      "comment": "Priestly lineage and ritual purity are emphasized, prefiguring the need for faithful and properly appointed clergy within worship."
    },
    {
      "pk": 33043020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 20,
      "text": "‘You shall take some of its blood and put it on the four horns of the altar and on the four corners of the ledge and upon the base all around. This is how you purify and atone for the altar.’",
      "links": "<a href='/AIV/03/8/15'>Leviticus 8:15</a>; <a href='/AIV/03/16/19'>Leviticus 16:19</a>",
      "comment": "Blood purification is central in the Bible’s teaching on atonement, culminating in Christ’s redeeming death (Romans 3:25)."
    },
    {
      "pk": 33043021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 21,
      "text": "‘You shall also take the bull of the sin offering and burn it in the appointed place outside the sanctuary.’",
      "links": "<a href='/AIV/03/4/12'>Leviticus 4:12</a>; <a href='/AIV/58/13/11-12'>Hebrews 13:11-12</a>",
      "comment": "Burning the offering outside the sanctuary finds symbolic echo in Christ being crucified outside the city (Hebrews 13:12)."
    },
    {
      "pk": 33043022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 22,
      "text": "‘On the second day, you shall offer a male goat without blemish as a sin offering, and the altar shall be purified as it was purified with the bull.’",
      "links": "<a href='/AIV/03/4/23'>Leviticus 4:23</a>",
      "comment": "A sin offering without blemish reinforces the need for spotless sacrifice, fulfilled in Christ, the Lamb without blemish (1 Peter 1:19)."
    },
    {
      "pk": 33043023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 23,
      "text": "‘When you have finished purifying it, you shall offer a young bull without blemish and a ram from the flock without blemish.’",
      "links": "<a href='/AIV/03/1/10'>Leviticus 1:10</a>; <a href='/AIV/01/22/13'>Genesis 22:13</a>",
      "comment": "Providing both a bull and a ram recalls Abraham’s sacrifice and points towards the integration of sacrificial worship into daily practice."
    },
    {
      "pk": 33043024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 24,
      "text": "‘You shall present them before the LORD, and the priests shall scatter salt on them and offer them as a burnt offering to the LORD.’",
      "links": "<a href='/AIV/03/2/13'>Leviticus 2:13</a>; <a href='/AIV/40/5/13'>Matthew 5:13</a>",
      "comment": "Salt symbolizes purity and covenant, enduring in worship. This points forward to Jesus' teaching on the necessity of being ‘the salt of the earth.’"
    },
    {
      "pk": 33043025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 25,
      "text": "‘For seven days you shall provide each day a goat as a sin offering; also, a young bull and a ram from the flock, without blemish, shall be provided.’",
      "links": "<a href='/AIV/03/8/33'>Leviticus 8:33</a>",
      "comment": "Seven days of offerings suggest completeness and dedication, a pattern continued in Christian practices of consecration."
    },
    {
      "pk": 33043026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 26,
      "text": "‘Seven days they shall make atonement for the altar and cleanse it, and so consecrate it.’",
      "links": "<a href='/AIV/03/8/15'>Leviticus 8:15</a>",
      "comment": "Atonement and cleansing here point ahead to the total cleansing achieved in the New Covenant—fulfilled in Christ’s once-for-all sacrifice."
    },
    {
      "pk": 33043027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 43,
      "verse": 27,
      "text": "‘When the days are completed, on the eighth day and thereafter, the priests shall offer your burnt offerings and your peace offerings on the altar; and I will accept you, declares the Lord GOD.’",
      "links": "<a href='/AIV/03/1/3'>Leviticus 1:3</a>; <a href='/AIV/58/9/24'>Hebrews 9:24</a>",
      "comment": "The eighth day signals new creation and renewal, reflecting resurrection themes and acceptance by God through the appointed priesthood and right worship."
    }
  ],
  "translatedAt": "2025-12-24T09:23:07.405Z"
}