{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 12,
  "verses": [
    {
      "pk": 3021201,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 1,
      "text": "The word of the LORD came to me, saying,",
      "links": "",
      "comment": "The prophetic message begins with the formulaic 'The word of the LORD came to me,' a typical phrase in Ezekiel denoting direct revelation (see <a href='/AIV/26/1/3'>Ezek. 1:3</a>)."
    },
    {
      "pk": 3021202,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 2,
      "text": "Son of man, you dwell in the midst of a rebellious house, who have eyes to see but do not see, who have ears to hear but do not hear, for they are a rebellious house.",
      "links": "<a href='/AIV/23/6/9-10'>Isa. 6:9–10</a>; <a href='/AIV/40/13/13-15'>Matt. 13:13–15</a>",
      "comment": "This verse is echoed in Jesus's words about hearing and not understanding (<a href='/AIV/40/13/13'>Matt. 13:13</a>), showing the ongoing pattern of spiritual blindness."
    },
    {
      "pk": 3021203,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 3,
      "text": "Therefore, son of man, prepare your belongings for exile, and go into exile by day in their sight. You shall go from your place to another place in their sight. Perhaps they will see, though they are a rebellious house.",
      "links": "<a href='/AIV/26/4/3'>Ezek. 4:3</a>; <a href='/AIV/24/29/1'>Jer. 29:1</a>",
      "comment": "The prophet’s symbolic act illustrates Israel’s coming exile. Sometimes actions speak more powerfully than words (see also <a href='/AIV/26/4/1-3'>Ezek. 4</a>)."
    },
    {
      "pk": 3021204,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 4,
      "text": "Bring out your luggage by day in their sight, as if you were going into exile, and then go out yourself at evening in their sight, as those who go into exile.",
      "links": "<a href='/AIV/26/24/24'>Ezek. 24:24</a>",
      "comment": "Ezekiel’s public actions serve as a dramatic sign for the people, calling them to repentance and awareness."
    },
    {
      "pk": 3021205,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 5,
      "text": "Dig through the wall in their sight and carry your belongings out through it.",
      "links": "<a href='/AIV/26/8/8'>Ezek. 8:8</a>",
      "comment": "The digging represents the desperate measures of Jerusalem’s residents during the siege and exile."
    },
    {
      "pk": 3021206,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 6,
      "text": "In their sight, put your belongings on your shoulder and carry them out in the dark. Cover your face so you cannot see the land, for I have made you a sign to the house of Israel.",
      "links": "<a href='/AIV/26/24/27'>Ezek. 24:27</a>",
      "comment": "Covering the face symbolizes shame and loss, while being a 'sign' highlights the role of visible examples in God’s plan."
    },
    {
      "pk": 3021207,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 7,
      "text": "So I did as I was commanded. During the day I brought out my belongings as though for exile, and in the evening I dug through the wall with my hands. I brought my things out in the dark, carrying them on my shoulder in their sight.",
      "links": "",
      "comment": "Ezekiel’s literal obedience sets a precedent for responsive faith—a call to follow God’s commands fully, which is mirrored in the call to deeper faith in the New Testament (<a href='/AIV/40/16/24'>Matt. 16:24</a>)."
    },
    {
      "pk": 3021208,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 8,
      "text": "In the morning the word of the LORD came to me, saying,",
      "links": "",
      "comment": "A repetition of the prophetic formula, signifying ongoing dialogue and revelation."
    },
    {
      "pk": 3021209,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 9,
      "text": "Son of man, has not the house of Israel, that rebellious house, said to you, ‘What are you doing?’",
      "links": "",
      "comment": "The prophet’s role often evokes curiosity and even scorn from the audience (see <a href='/AIV/24/20/7'>Jer. 20:7</a>)."
    },
    {
      "pk": 3021210,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 10,
      "text": "Say to them, ‘This is what the Lord GOD says: This oracle concerns the prince in Jerusalem and all the house of Israel within it.’",
      "links": "<a href='/AIV/26/17/20'>Ezek. 17:20</a>",
      "comment": "'Prince' refers to King Zedekiah. The use of the term 'oracle' here identifies a solemn and binding prophecy."
    },
    {
      "pk": 3021211,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 11,
      "text": "Say, 'I am a sign for you: as I have done, so shall it be done to them. They shall go into exile, into captivity.'",
      "links": "<a href='/AIV/26/24/24'>Ezek. 24:24</a>",
      "comment": "The prophetic sign points directly to what will happen to the people—literal fulfillment shows the reliability of God’s word."
    },
    {
      "pk": 3021212,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 12,
      "text": "The prince who is among them will lift his belongings upon his shoulder in the dark and will go out. They will dig through the wall to carry them out. He will cover his face so he does not see the land with his eyes.",
      "links": "<a href='/AIV/12/25/4'>2 Kings 25:4</a>",
      "comment": "This prophecy was fulfilled when King Zedekiah tried to escape Jerusalem by night (see <a href='/AIV/12/25/4'>2 Kings 25:4</a>)."
    },
    {
      "pk": 3021213,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 13,
      "text": "I will spread my net over him, and he will be caught in my snare. I will bring him to Babylon, to the land of the Chaldeans, yet he will not see it, and he shall die there.",
      "links": "<a href='/AIV/26/17/20'>Ezek. 17:20</a>; <a href='/AIV/12/25/7'>2 Kings 25:7</a>",
      "comment": "Zedekiah’s blindness (his eyes were put out) fulfilled ‘yet he will not see it.’ God’s justice is both literal and deeply symbolic—a warning and a call to trust divine authority."
    },
    {
      "pk": 3021214,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 14,
      "text": "I will scatter toward every wind all who are around him, his guards and all his troops, and I will draw out the sword after them.",
      "links": "<a href='/AIV/26/5/2'>Ezek. 5:2</a>",
      "comment": "Total defeat is prophesied—God’s judgment is comprehensive, showing the seriousness of sin and the call to repentance (see <a href='/AIV/26/5/2'>Ezek. 5:2</a>)."
    },
    {
      "pk": 3021215,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 15,
      "text": "And they shall know that I am the LORD, when I scatter them among the nations and disperse them through the countries.",
      "links": "<a href='/AIV/26/11/10'>Ezek. 11:10</a>",
      "comment": "God’s judgments aim at a greater purpose: leading His people to know Him. This theme of knowledge is fulfilled in the new covenant—knowing the LORD fully (<a href='/AIV/24/31/34'>Jer. 31:34</a>)."
    },
    {
      "pk": 3021216,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 16,
      "text": "But I will let a few of them escape from the sword, from famine, and from pestilence, so that they may declare all their abominations among the nations where they go; then they shall know that I am the LORD.",
      "links": "<a href='/AIV/26/6/8'>Ezek. 6:8</a>",
      "comment": "A faithful remnant will survive—a recurring theme throughout the prophets, pointing to the preservation of God’s people for His holy purposes."
    },
    {
      "pk": 3021217,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 17,
      "text": "Then the word of the LORD came to me, saying,",
      "links": "",
      "comment": "A fresh revelation, emphasizing the continual relationship between God and His prophet."
    },
    {
      "pk": 3021218,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 18,
      "text": "Son of man, eat your bread with trembling, and drink your water with anxiety and fear.",
      "links": "<a href='/AIV/26/4/16-17'>Ezek. 4:16–17</a>",
      "comment": "Symbolic actions here communicate the terror and uncertainty of the coming siege, prefiguring the suffering brought by sin."
    },
    {
      "pk": 3021219,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 19,
      "text": "Say to the people of the land, ‘This is what the Lord GOD says about the inhabitants of Jerusalem in the land of Israel: They shall eat their bread with anxiety and drink their water in desolation, because their land will be stripped of everything because of the violence of all who live there.’",
      "links": "<a href='/AIV/26/4/16'>Ezek. 4:16</a>",
      "comment": "Material deprivation results from moral failure, reinforcing the biblical principle that sin has real consequences."
    },
    {
      "pk": 3021220,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 20,
      "text": "The inhabited cities will be laid waste, and the land will become a desolation. Then you will know that I am the LORD.",
      "links": "<a href='/AIV/26/6/14'>Ezek. 6:14</a>",
      "comment": "Repeated statement of recognition, ultimately pointing to God’s sovereignty and holiness—see the emphasis on knowing God in both Old and New Testament revelation."
    },
    {
      "pk": 3021221,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 21,
      "text": "The word of the LORD came to me, saying,",
      "links": "",
      "comment": "Another transitional formula highlighting the direct divine origin of Ezekiel’s message."
    },
    {
      "pk": 3021222,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 22,
      "text": "Son of man, what is this proverb your people have about the land of Israel, which says, ‘The days go by, and every vision fails’?",
      "links": "",
      "comment": "A proverb showing widespread skepticism—doubts about fulfilled prophecy contrast with the certainty offered in the person of Christ, who fulfills all the promises (<a href='/AIV/47/1/20'>2 Cor. 1:20</a>)."
    },
    {
      "pk": 3021223,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 23,
      "text": "Tell them therefore, ‘This is what the Lord GOD says: I will put an end to this proverb, and they shall no longer use it in Israel.’ But say to them, ‘The days are near, and every vision’s fulfillment is at hand.’",
      "links": "",
      "comment": "God rebukes the notion that His word fails—every prophecy has its appointed time (see <a href='/AIV/35/2/3'>Hab. 2:3</a>)."
    },
    {
      "pk": 3021224,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 24,
      "text": "For there will be no more false vision or flattering divination within the house of Israel.",
      "links": "<a href='/AIV/26/13/2-3'>Ezek. 13:2-3</a>",
      "comment": "God purifies His people, exposing deception—a foreshadowing of the definitive truth and authority revealed in Christ and His Church."
    },
    {
      "pk": 3021225,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 25,
      "text": "For I am the LORD; I will speak, and the word that I speak will be fulfilled. It will no longer be delayed. For in your days, O rebellious house, I will speak the word and perform it, declares the Lord GOD.",
      "links": "<a href='/AIV/23/55/11'>Isa. 55:11</a>",
      "comment": "The certainty of God’s word is stressed—echoing the Incarnation, where the Word became flesh and fulfilled all God’s promises (<a href='/AIV/43/1/14'>John 1:14</a>)."
    },
    {
      "pk": 3021226,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 26,
      "text": "The word of the LORD came to me, saying,",
      "links": "",
      "comment": "Marks another section—prophecy is progressive and ongoing."
    },
    {
      "pk": 3021227,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 27,
      "text": "Son of man, behold, the house of Israel says, ‘The vision he sees is for many days from now, and he prophesies of times far off.’",
      "links": "",
      "comment": "People continue to delay repentance, believing God’s warnings are distant or irrelevant—much like those who wait to follow Christ until later in life."
    },
    {
      "pk": 3021228,
      "translation": "AIV",
      "book": 26,
      "chapter": 12,
      "verse": 28,
      "text": "Therefore say to them, ‘This is what the Lord GOD says: None of my words will be delayed any longer; whatever I speak will be fulfilled, declares the Lord GOD.’",
      "links": "<a href='/AIV/26/12/25'>Ezek. 12:25</a>",
      "comment": "God’s promises and judgments are certain and near. The urgency to respond is a persistent biblical theme, culminating in the call to follow Christ and His ordained way, united around one faith and visible leadership, just as God intended from the beginning."
    }
  ],
  "translatedAt": "2025-12-23T06:51:53.033Z"
}