{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 28,
  "verses": [
    {
      "pk": 33028001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/13/1'>Ezek. 13:1</a>; <a href='/AIV/26/27/1'>Ezek. 27:1</a>",
      "comment": "Ezekiel often introduces new messages with a direct statement that the LORD has spoken to him, emphasizing prophetic authority. This passage begins a prophecy against the ruler of Tyre."
    },
    {
      "pk": 33028002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 2,
      "text": "Son of man, say to the ruler of Tyre, 'This is what the Lord GOD says: \"Because your heart is proud, and you have said, ‘I am a god, I sit in the seat of gods, in the heart of the seas,’ yet you are a man, and not a god, though you make your heart like the heart of a god—\"",
      "links": "<a href='/AIV/23/14/13-14'>Isa. 14:13-14</a>; <a href='/AIV/44/12/21-23'>Acts 12:21-23</a>",
      "comment": "The king of Tyre is accused of pride, claiming divinity. The charge recalls other biblical figures who overstepped their limits. In spiritual interpretation, all prideful exaltation sets humanity against God— foreshadowing humanity's need for true humility, later modeled perfectly in Christ’s incarnation (cf. Phil. 2:5-8)."
    },
    {
      "pk": 33028003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 3,
      "text": "Behold, you are wiser than Daniel; no secret is hidden from you.",
      "links": "<a href='/AIV/27/1/17-20'>Dan. 1:17-20</a>; <a href='/AIV/40/11/25'>Matt. 11:25</a>",
      "comment": "Irony is present: the king is “wiser” than Daniel, the renowned wise man. God exposes the king’s arrogance. The wisdom theme hints at the limitations of human knowledge outside God’s revelation."
    },
    {
      "pk": 33028004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 4,
      "text": "By your wisdom and understanding you have made wealth for yourself, and gathered gold and silver into your treasuries.",
      "links": "<a href='/AIV/20/3/13-16'>Prov. 3:13-16</a>; <a href='/AIV/18/22/24-25'>Job 22:24-25</a>",
      "comment": "Material accumulation is achieved by talent, but the underlying sin is the attribution of these gains to oneself, not God. Earthly riches and self-sufficiency tempt leaders to set themselves above divine authority."
    },
    {
      "pk": 33028005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 5,
      "text": "By your great skill in trade you have increased your riches, and your heart has become proud in your wealth.",
      "links": "<a href='/AIV/05/08/17'>Deut. 8:17</a>; <a href='/AIV/19/52/7'>Ps. 52:7</a>",
      "comment": "Pride from wealth is condemned throughout Scripture. This spiritual trap is echoed later in Jesus’ teaching about the dangers of riches (Matt. 6:24; 19:24). True wisdom recognizes all blessings as flowing from God, not us."
    },
    {
      "pk": 33028006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 6,
      "text": "Therefore, thus says the Lord GOD: Because you have made your heart like the heart of a god,",
      "links": "<a href='/AIV/23/47/8'>Isa. 47:8</a>",
      "comment": "Divine judgment is announced in response to pride and self-deification. The pattern of pride followed by downfall is consistent throughout the Bible (cf. Prov. 16:18)."
    },
    {
      "pk": 33028007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 7,
      "text": "therefore, I will bring foreigners against you, the most ruthless of the nations. They will draw their swords against the beauty of your wisdom and defile your splendor.",
      "links": "<a href='/AIV/26/7/21'>Ezek. 7:21</a>; <a href='/AIV/23/13/17'>Isa. 13:17</a>",
      "comment": "The judgment is by foreign invaders. God’s sovereignty over nations is underscored—He uses even pagans as instruments of His justice. This sets the precedent for understanding God's providence and discipline in all epochs."
    },
    {
      "pk": 33028008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 8,
      "text": "They will bring you down to the pit, and you will die the death of the slain in the heart of the seas.",
      "links": "<a href='/AIV/19/88/4'>Ps. 88:4</a>; <a href='/AIV/26/31/18'>Ezek. 31:18</a>",
      "comment": "\"The pit\" often refers to Sheol, the realm of the dead. The location “in the heart of the seas” is a poetic allusion to the actual location of Tyre and symbolically to the depth of humiliation awaiting the proud."
    },
    {
      "pk": 33028009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 9,
      "text": "Will you still say, ‘I am a god,’ in the presence of those who kill you, though you are but a man and no god, in the hands of those who slay you?",
      "links": "<a href='/AIV/23/31/3'>Isa. 31:3</a>",
      "comment": "Finality of judgment: when confronted by death, impostor divinity is exposed. The limitation and mortality of human rulers are highlighted. This foreshadows the contrast with Christ’s true divine immortality."
    },
    {
      "pk": 33028010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 10,
      "text": "You shall die the death of the uncircumcised by the hand of foreigners; for I have spoken, declares the Lord GOD.",
      "links": "<a href='/AIV/09/17/26'>1 Sam. 17:26</a>; <a href='/AIV/26/32/19'>Ezek. 32:19</a>",
      "comment": "\"Death of the uncircumcised\" signifies shame and separation from God’s covenant people. The solemn prophetic formula “I have spoken” guarantees its fulfillment."
    },
    {
      "pk": 33028011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 11,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/12/1'>Ezek. 12:1</a>",
      "comment": "A second oracle begins with the same prophetic formula, introducing a more poetic and symbolic lament over the king of Tyre."
    },
    {
      "pk": 33028012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 12,
      "text": "Son of man, raise a lamentation over the king of Tyre, and say to him, 'This is what the Lord GOD says: “You were the seal of perfection, full of wisdom and perfect in beauty.",
      "links": "<a href='/AIV/26/27/3'>Ezek. 27:3</a>; <a href='/AIV/01/01/31'>Gen. 1:31</a>",
      "comment": "'Seal of perfection' marks the king with idealized qualities, evoking images of Adam or exalted angels. This passage carries both literal reference (to Tyre’s king) and spiritual allegory—later interpreted as alluding to the fall of Satan."
    },
    {
      "pk": 33028013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 13,
      "text": "You were in Eden, the garden of God; every precious stone was your covering: sardius, topaz, and diamond, beryl, onyx, and jasper, sapphire, turquoise, and emerald with gold. The workmanship of your settings and sockets was in you; on the day you were created they were prepared.",
      "links": "<a href='/AIV/01/02/8-15'>Gen. 2:8-15</a>; <a href='/AIV/02/28/17-20'>Ex. 28:17-20</a>; <a href='/AIV/66/21/19-20'>Rev. 21:19-20</a>",
      "comment": "Imagery of Eden links Tyre’s king to the original creation and fall. The comparison to priestly garments (Ex. 28) and the New Jerusalem (Rev. 21) foreshadows the unity of original perfection, temple imagery, and future restoration through Christ—who fulfills all priestly and kingly roles."
    },
    {
      "pk": 33028014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 14,
      "text": "You were an anointed guardian cherub. I placed you; you were on the holy mountain of God; you walked among the stones of fire.",
      "links": "<a href='/AIV/02/25/20'>Ex. 25:20</a>; <a href='/AIV/26/10/1'>Ezek. 10:1</a>",
      "comment": "The king is likened to a cherub—a high angelic being—serving on God’s holy mountain. Cherubic guardianship recalls the cherubim at Eden’s gates (Gen. 3:24) and the Temple, drawing attention to the king’s lost role of mediation and holiness."
    },
    {
      "pk": 33028015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 15,
      "text": "You were blameless in your ways from the day you were created, till unrighteousness was found in you.",
      "links": "<a href='/AIV/01/03/1-6'>Gen. 3:1-6</a>; <a href='/AIV/62/03/8'>1 John 3:8</a>",
      "comment": "Like Adam, the king was created blameless but fell through sin. The spiritual implication is the reality of original innocence lost—setting the stage for redemption by Christ, the sinless One."
    },
    {
      "pk": 33028016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 16,
      "text": "By the abundance of your trade you were filled with violence within, and you sinned; so I cast you as a profane thing from the mountain of God, and I expelled you, O guardian cherub, from among the stones of fire.",
      "links": "<a href='/AIV/23/14/12-15'>Isa. 14:12-15</a>; <a href='/AIV/01/03/24'>Gen. 3:24</a>",
      "comment": "Falling from the divine mountain and expulsion echo the spiritual tradition of angelic rebellion and Adam's exile from Eden. Both literal (Tyre's king) and spiritual (prideful angel/Adam) meanings reinforce the necessity of divine grace for restoration."
    },
    {
      "pk": 33028017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 17,
      "text": "Your heart was proud because of your beauty; you corrupted your wisdom for the sake of your splendor. I cast you to the ground; I exposed you before kings, to feast their eyes on you.",
      "links": "<a href='/AIV/20/16/18'>Prov. 16:18</a>; <a href='/AIV/66/12/9'>Rev. 12:9</a>",
      "comment": "Self-exaltation leads to a humiliating fall. Some Church Fathers saw a dual meaning of both human and angelic pride, encouraging sober humility—exemplified by Christ, the humble King."
    },
    {
      "pk": 33028018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 18,
      "text": "By the multitude of your iniquities, in the unrighteousness of your trade, you profaned your sanctuaries. So I brought fire out from your midst; it consumed you, and I turned you to ashes on the earth in the sight of all who saw you.",
      "links": "<a href='/AIV/06/7/15'>Josh. 7:15</a>; <a href='/AIV/23/66/24'>Isa. 66:24</a>",
      "comment": "Sanctuaries are profaned by unjust actions, not just ritual impurity—pointing to the spiritual reality that sin within corrupts true worship. Divine fire both punishes and purifies (cf. 1 Cor. 3:13)."
    },
    {
      "pk": 33028019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 19,
      "text": "All who know you among the peoples are appalled at you; you have come to a dreadful end and shall be no more forever.",
      "links": "<a href='/AIV/26/27/36'>Ezek. 27:36</a>",
      "comment": "Public downfall and annihilation underline the everlasting severance from glory. Spiritually, this foreshadows the ultimate fate of all who oppose God’s reign."
    },
    {
      "pk": 33028020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 20,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/28/1'>Ezek. 28:1</a>",
      "comment": "A new prophecy against Sidon is introduced—changing from Tyre to its sister city."
    },
    {
      "pk": 33028021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 21,
      "text": "Son of man, set your face toward Sidon, and prophesy against her",
      "links": "<a href='/AIV/24/25/22'>Jer. 25:22</a>",
      "comment": "Prophetic attention shifts geographically, reinforcing God's universal authority over all nations, not only Israel."
    },
    {
      "pk": 33028022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 22,
      "text": "and say, 'This is what the Lord GOD says: “Behold, I am against you, O Sidon, and I will show my glory in your midst. Then they will know that I am the LORD, when I execute judgments on her and show myself holy in her.",
      "links": "<a href='/AIV/02/14/4'>Ex. 14:4</a>; <a href='/AIV/26/39/7'>Ezek. 39:7</a>",
      "comment": "God’s glory is revealed through both judgment and acts of holiness, preparing for the later fullness of divine self-revelation in the Messiah."
    },
    {
      "pk": 33028023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 23,
      "text": "For I will send pestilence into her, and blood into her streets; the slain shall fall in her midst, by the sword against her on every side. Then they will know that I am the LORD.",
      "links": "<a href='/AIV/26/6/12'>Ezek. 6:12</a>; <a href='/AIV/26/38/22'>Ezek. 38:22</a>",
      "comment": "God’s actions serve to reveal Himself to the nations—judgment is a form of testimony (see Ex. 7:5)."
    },
    {
      "pk": 33028024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 24,
      "text": "And for the house of Israel, there shall no longer be a pricking brier or a painful thorn from any of those around them who scorned them. Then they will know that I am the Lord GOD.",
      "links": "<a href='/AIV/04/33/55'>Num. 33:55</a>; <a href='/AIV/23/60/14'>Isa. 60:14</a>",
      "comment": "After judgment on the surrounding enemies, God promises relief for Israel—an image later fulfilled more perfectly in the peace of God’s eternal Kingdom through Christ’s victory."
    },
    {
      "pk": 33028025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 25,
      "text": "This is what the Lord GOD says: 'When I gather the house of Israel from the peoples among whom they are scattered, and show myself holy among them in the sight of the nations, then they shall dwell in their own land which I gave to my servant Jacob.",
      "links": "<a href='/AIV/26/20/41-42'>Ezek. 20:41-42</a>; <a href='/AIV/01/35/12'>Gen. 35:12</a>",
      "comment": "God’s promise to gather and restore Israel points to both a historical and a spiritual return. Early interpreters saw this as partially realized in the return from exile, but its ultimate fulfillment occurs when all God’s people are united through Christ, the true Israel."
    },
    {
      "pk": 33028026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 28,
      "verse": 26,
      "text": "They shall dwell securely in it, and shall build houses and plant vineyards. They shall dwell securely, when I execute judgments on all those around them who scorned them. Then they will know that I am the LORD their God.'\"",
      "links": "<a href='/AIV/03/25/18'>Lev. 25:18</a>; <a href='/AIV/24/32/37'>Jer. 32:37</a>",
      "comment": "Safety, building, and fruitfulness are signs of restored blessing. Theologically, the peace foreshadowed here finds deeper fulfillment in New Testament teaching about the secure, lasting Kingdom of God inaugurated by Jesus Christ."
    }
  ],
  "translatedAt": "2025-12-24T09:14:01.046Z"
}