{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 39,
  "verses": [
    {
      "pk": 393901,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 1,
      "text": "Son of man, prophesy against Gog and say: This is what the Lord GOD says: Look, I am against you, Gog, chief prince of Meshech and Tubal.",
      "links": "<a href='/AIV/26/38/2'>Ezek. 38:2</a>; <a href='/AIV/26/38/3'>Ezek. 38:3</a>",
      "comment": "This repeats the condemnation begun in the previous chapter, emphasizing Gog’s opposition to God’s people. Note the address ‘chief prince’ connects to broader prophetic literature about judgment on prideful rulers."
    },
    {
      "pk": 393902,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 2,
      "text": "I will turn you around and lead you on, and I will bring you up from the far north and send you against the mountains of Israel.",
      "links": "<a href='/AIV/26/38/15'>Ezek. 38:15</a>; <a href='/AIV/26/38/21'>Ezek. 38:21</a>",
      "comment": "God’s sovereignty is underlined: He brings even enemies according to His will. The ‘far north’ is likely symbolic for Israel’s traditional enemies (cf. Jer. 1:14)."
    },
    {
      "pk": 393903,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 3,
      "text": "Then I will strike your bow from your left hand and cause your arrows to fall from your right hand.",
      "links": "<a href='/AIV/26/30/24'>Ezek. 30:24</a>; <a href='/AIV/19/46/9'>Ps. 46:9</a>",
      "comment": "God removes Gog’s ability to wage war, symbolizing the defeat of evil. The loss of weapons mirrors motifs found elsewhere depicting divine disarmament of enemies."
    },
    {
      "pk": 393904,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 4,
      "text": "You will fall on the mountains of Israel, you and all your hordes and the peoples with you. I will give you as food to birds of every kind and to the beasts of the field.",
      "links": "<a href='/AIV/26/39/17'>Ezek. 39:17</a>; <a href='/AIV/66/19/17'>Rev. 19:17-18</a>",
      "comment": "The fallen are given over as food, a divine judgment (cf. Revelation 19:17-18). Spiritual sense: ultimate fate of all those who oppose God’s elect."
    },
    {
      "pk": 393905,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 5,
      "text": "You will fall in the open field, for I have spoken, declares the Lord GOD.",
      "links": "<a href='/AIV/26/17/21'>Ezek. 17:21</a>; <a href='/AIV/23/34/5'>Isa. 34:5-8</a>",
      "comment": "God’s decree is final. Fate sealed by His word resembles themes of divine sovereignty (cf. Isa. 34:5–8)."
    },
    {
      "pk": 393906,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 6,
      "text": "I will send fire on Magog and on those who dwell securely on the coastlands, and they will know that I am the LORD.",
      "links": "<a href='/AIV/26/38/22'>Ezek. 38:22</a>; <a href='/AIV/26/30/8'>Ezek. 30:8</a>",
      "comment": "Fire stands for comprehensive judgment, as seen often in prophetic literature. The ‘know that I am the LORD’ motif is central in Ezekiel, signifying God’s self-revelation."
    },
    {
      "pk": 393907,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 7,
      "text": "My holy name I will make known among my people Israel, and I will no longer let my holy name be profaned. Then the nations will know that I am the LORD, the Holy One in Israel.",
      "links": "<a href='/AIV/22/9/16'>Isa. 9:16</a>; <a href='/AIV/26/20/39'>Ezek. 20:39</a>",
      "comment": "God’s name is tied to His holiness and covenant. Spiritual interpretation: God’s victory sanctifies His chosen people and instructs the nations."
    },
    {
      "pk": 393908,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 8,
      "text": "Look, it is coming and it will happen, declares the Lord GOD. This is the day of which I have spoken.",
      "links": "<a href='/AIV/26/39/13'>Ezek. 39:13</a>; <a href='/AIV/26/38/18'>Ezek. 38:18</a>",
      "comment": "Prophetic certainty: the ‘day’ points to God’s decisive intervention—an Old Testament precursor to themes of judgment day in the New Testament."
    },
    {
      "pk": 393909,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 9,
      "text": "Then those who dwell in the cities of Israel will go out and set fire to and burn the weapons—shields and bucklers, bows and arrows, war clubs and spears. They will burn them for seven years.",
      "links": "<a href='/AIV/26/38/21'>Ezek. 38:21</a>; <a href='/AIV/23/9/5'>Isa. 9:5</a>",
      "comment": "Seven years signifies completion and fullness. The burning of weapons echoes peace motifs and fulfills prophecies of messianic peace (cf. Isa. 9:5; Mic. 4:3)."
    },
    {
      "pk": 393910,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 10,
      "text": "They will not need to take wood from the field or cut down any from the forests, because they will burn the weapons. So they will plunder those who plundered them and rob those who robbed them, declares the Lord GOD.",
      "links": "<a href='/AIV/26/29/19'>Ezek. 29:19'>Ezek. 29:19</a>; <a href='/AIV/26/27/36'>Ezek. 27:36</a>",
      "comment": "God reverses fortunes; those once plundered now have abundance—a recurring promise for the faithful throughout Scripture."
    },
    {
      "pk": 393911,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 11,
      "text": "On that day I will give Gog a burial place in Israel, the Valley of the Travelers east of the sea. It will block those who travel there. There Gog and all his multitude will be buried. People will call it the Valley of Gog’s Multitude.",
      "links": "<a href='/AIV/26/39/15'>Ezek. 39:15</a>; <a href='/AIV/26/32/23'>Ezek. 32:23</a>",
      "comment": "Naming a valley after Gog’s defeat signifies lasting memory of God’s victory. Burial of enemies in holy land is restitution and restoration."
    },
    {
      "pk": 393912,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 12,
      "text": "The house of Israel will spend seven months burying them, to cleanse the land.",
      "links": "<a href='/AIV/26/39/14'>Ezek. 39:14</a>; <a href='/AIV/26/36/25'>Ezek. 36:25</a>",
      "comment": "Ritual cleansing reflects themes of holiness and purity. Restoration of the land is both literal and spiritual (cf. Ezek. 36:25)."
    },
    {
      "pk": 393913,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 13,
      "text": "All the people of the land will bury them. The day I am glorified will be a memorable day for them, declares the Lord GOD.",
      "links": "<a href='/AIV/66/15/4'>Rev. 15:4</a>; <a href='/AIV/19/126/2'>Ps. 126:2</a>",
      "comment": "Communal participation in burial and glorifying God prefigures worship practices. Note connections between glory, memory, and history."
    },
    {
      "pk": 393914,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 14,
      "text": "They will set men apart to travel through the land and bury the remaining bodies seen by passersby, to cleanse it. At the end of seven months they will make a search.",
      "links": "<a href='/AIV/26/39/12'>Ezek. 39:12</a>; <a href='/AIV/26/44/19'>Ezek. 44:19</a>",
      "comment": "Careful search shows emphasis on ritual purity. Spiritual reading: thorough cleansing required for restored communion."
    },
    {
      "pk": 393915,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 15,
      "text": "As they go through the land, when a traveler sees a human bone, he will set up a marker by it, so the buriers can bury it in the Valley of Gog’s Multitude.",
      "links": "<a href='/AIV/26/39/11'>Ezek. 39:11</a>; <a href='/AIV/26/37/4'>Ezek. 37:4</a>",
      "comment": "Markers for burial recall themes of respect for the dead, and symbolically point to the eventual resurrection and restoration of all things."
    },
    {
      "pk": 393916,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 16,
      "text": "The name of the city will be Hamonah. Thus they will cleanse the land.",
      "links": "<a href='/AIV/26/39/11'>Ezek. 39:11</a>; <a href='/AIV/26/36/25'>Ezek. 36:25</a>",
      "comment": "Hamonah means 'multitude.' Cleansing the land here carries sacramental significance—ritual acts restore holiness to the community."
    },
    {
      "pk": 393917,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 17,
      "text": "As for you, son of man, this is what the Lord GOD says: Speak to every bird and every beast of the field: Come together and gather from everywhere for the great sacrifice that I am preparing for you on the mountains of Israel, that you may eat flesh and drink blood.",
      "links": "<a href='/AIV/66/19/17'>Rev. 19:17</a>; <a href='/AIV/26/39/4'>Ezek. 39:4</a>",
      "comment": "The 'great sacrifice' motif is echoed in Revelation 19. Literal and spiritual meaning: divine judgment as a solemn, almost liturgical event."
    },
    {
      "pk": 393918,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 18,
      "text": "You shall eat the flesh of mighty men and drink the blood of the princes of the earth, like rams, lambs, goats, and bulls, all fattened animals of Bashan.",
      "links": "<a href='/AIV/23/34/6'>Isa. 34:6</a>; <a href='/AIV/66/19/18'>Rev. 19:18</a>",
      "comment": "Use of sacrificial animal imagery to describe enemies highlights seriousness of judgment and prefigures Messianic fulfillment."
    },
    {
      "pk": 393919,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 19,
      "text": "Eat fat until you are full and drink blood until you are drunk at the great sacrifice that I am preparing for you.",
      "links": "<a href='/AIV/26/39/17'>Ezek. 39:17</a>; <a href='/AIV/19/22/29'>Ps. 22:29</a>",
      "comment": "Extreme judgment is portrayed. Spiritual application: God’s complete victory over evil anticipated in the new creation."
    },
    {
      "pk": 393920,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 20,
      "text": "At my table you shall be filled with horses and riders, mighty men and warriors—all of them, declares the Lord GOD.",
      "links": "<a href='/AIV/66/19/21'>Rev. 19:21</a>; <a href='/AIV/19/23/5'>Ps. 23:5</a>",
      "comment": "God sets the terms of victory. ‘My table’ evokes themes of divine banquet, fulfilled in the Messiah as the true host (cf. Ps. 23:5; Luke 14:15)."
    },
    {
      "pk": 393921,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 21,
      "text": "I will set my glory among the nations, and all the nations will see my judgment that I have executed, and my hand that I have laid on them.",
      "links": "<a href='/AIV/26/28/22'>Ezek. 28:22</a>; <a href='/AIV/66/11/15'>Rev. 11:15</a>",
      "comment": "Universal display of God’s glory points ahead to the world-wide knowledge of God in the messianic age."
    },
    {
      "pk": 393922,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 22,
      "text": "The house of Israel shall know that I am the LORD their God from that day forward.",
      "links": "<a href='/AIV/26/36/28'>Ezek. 36:28</a>; <a href='/AIV/24/31/33'>Jer. 31:33</a>",
      "comment": "Covenant language stresses restoration. Spiritual interpretation: assurance of God’s abiding presence among His people."
    },
    {
      "pk": 393923,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 23,
      "text": "And the nations will know that the house of Israel was exiled for their sin, because they acted unfaithfully against me. So I hid my face from them and gave them into the hand of their enemies. They all fell by the sword.",
      "links": "<a href='/AIV/26/36/19'>Ezek. 36:19</a>; <a href='/AIV/24/5/19'>Jer. 5:19</a>",
      "comment": "Divine discipline is explained as just and purposeful. ‘Hiding God’s face’ is classic biblical language for God’s temporary withdrawal."
    },
    {
      "pk": 393924,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 24,
      "text": "According to their uncleanness and their transgressions I dealt with them, and I hid my face from them.",
      "links": "<a href='/AIV/26/39/23'>Ezek. 39:23</a>; <a href='/AIV/26/36/17'>Ezek. 36:17</a>",
      "comment": "Repetition for emphasis; divine justice and holiness. The spiritual meaning: God’s dealings prepare the people for future grace."
    },
    {
      "pk": 393925,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 25,
      "text": "Therefore this is what the Lord GOD says: Now I will restore the fortunes of Jacob and have mercy on the whole house of Israel; I will be jealous for my holy name.",
      "links": "<a href='/AIV/26/37/21'>Ezek. 37:21</a>; <a href='/AIV/26/36/11'>Ezek. 36:11</a>",
      "comment": "Restoration and mercy motifs point to God’s initiative, moving the narrative toward reconciliation and unity. Mercy is central, foreshadowing Christ’s saving work."
    },
    {
      "pk": 393926,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 26,
      "text": "They shall forget their shame and all their unfaithfulness in which they betrayed me when they live securely in their land, with no one making them afraid.",
      "links": "<a href='/AIV/26/36/33'>Ezek. 36:33</a>; <a href='/AIV/23/54/4'>Isa. 54:4</a>",
      "comment": "Redemption brings freedom from shame. Security in the land prefigures eschatological peace—the kingdom fulfilled."
    },
    {
      "pk": 393927,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 27,
      "text": "When I have brought them back from the peoples and gathered them out of their enemies’ lands, then I will be sanctified through them in the sight of many nations.",
      "links": "<a href='/AIV/26/36/24'>Ezek. 36:24</a>; <a href='/AIV/24/23/3'>Jer. 23:3</a>",
      "comment": "God’s sanctification through His people points toward the calling and election of the gathered assembly, both literal Israel and the spiritual Israel (cf. Rom. 9:6)."
    },
    {
      "pk": 393928,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 28,
      "text": "They will know that I am the LORD their God, because I sent them into exile among the nations and then gathered them into their own land. I will not leave any of them remaining among the nations.",
      "links": "<a href='/AIV/24/32/37'>Jer. 32:37</a>; <a href='/AIV/26/11/17'>Ezek. 11:17</a>",
      "comment": "God’s faithfulness surpasses human failure. None left behind—God’s persistent restoration has spiritual fulfillment in the eternal Church."
    },
    {
      "pk": 393929,
      "translation": "AIV",
      "book": 26,
      "chapter": 39,
      "verse": 29,
      "text": "And I will no longer hide my face from them, for I have poured out my Spirit upon the house of Israel, declares the Lord GOD.",
      "links": "<a href='/AIV/29/2/28'>Joel 2:28</a>; <a href='/AIV/44/2/17'>Acts 2:17'</a>",
      "comment": "The prophetic vision climaxes with the outpouring of God’s Spirit, connecting to Joel and Acts. Spiritual implication: Pentecost and the indwelling Spirit marks the beginning of a new era for God’s people."
    }
  ],
  "translatedAt": "2025-12-23T07:07:19.374Z"
}