{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 31,
  "verses": [
    {
      "pk": 2155301,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 1,
      "text": "In the eleventh year, in the third month, on the first day of the month, the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/30/20'>Ezek. 30:20</a>",
      "comment": "The setting is precise: this message is dated shortly before Jerusalem's fall. The precision emphasizes the authority and historical reality of prophecy."
    },
    {
      "pk": 2155302,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 2,
      "text": "Son of man, say to Pharaoh king of Egypt and to his multitude: To whom are you like in your greatness?",
      "links": "<a href='/AIV/26/29/3'>Ezek. 29:3</a>",
      "comment": "Pharaoh and Egypt are being compared to other mighty nations who have fallen due to pride. See also <a href='/AIV/23/14/12-15'>Isa. 14:12-15</a> regarding pride and downfall."
    },
    {
      "pk": 2155303,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 3,
      "text": "Behold, Assyria was a cedar in Lebanon, with beautiful branches and a forest shade, and of great height, and its top was among the clouds.",
      "links": "<a href='/AIV/19/92/12'>Ps. 92:12</a>; <a href='/AIV/27/4/20-22'>Dan. 4:20-22</a>",
      "comment": "Assyria is depicted as a mighty tree, a symbol also used for powerful kingdoms. See Daniel's tree vision, foreshadowing the rise and fall of empires."
    },
    {
      "pk": 2155304,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 4,
      "text": "The waters made it grow, the deep made it tall, making its rivers flow all around its planting place and sending channels to all the trees of the field.",
      "links": "<a href='/AIV/01/2/10'>Gen. 2:10</a>",
      "comment": "The tree’s growth is attributed to God’s provision, reminiscent of Eden’s watering (<a href='/AIV/01/2/10'>Genesis 2:10</a>). Spiritual abundance is linked to God’s grace."
    },
    {
      "pk": 2155305,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 5,
      "text": "So it was taller than all the trees of the field; its branches grew in abundance, and its boughs became long because of the plentiful waters as it grew.",
      "links": "<a href='/AIV/26/17/5-6'>Ezek. 17:5-6</a>",
      "comment": "The imagery, familiar from Ezekiel 17, emphasizes the privileges given to Assyria. This also serves as a reminder that great gifts come with responsibility."
    },
    {
      "pk": 2155306,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 6,
      "text": "All the birds of the heavens made their nests in its branches; all the animals of the field gave birth under its shade, and all great nations lived under its shadow.",
      "links": "<a href='/AIV/26/17/23'>Ezek. 17:23</a>; <a href='/AIV/27/4/21'>Dan. 4:21</a>; <a href='/AIV/40/13/32'>Matt. 13:32</a>",
      "comment": "This prophetic image is echoed by Jesus in Matthew 13:32, where the kingdom grows as a great tree, offering shelter for all (a spiritual church foreshadowed in Old and New Testaments)."
    },
    {
      "pk": 2155307,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 7,
      "text": "It was beautiful in its greatness, in the length of its branches, because its roots reached to abundant waters.",
      "links": "<a href='/AIV/19/1/3'>Ps. 1:3</a>",
      "comment": "The symbol of the tree by living waters points towards a righteous man or a blessed community firmly rooted in divine grace. (See Psalm 1:3)."
    },
    {
      "pk": 2155308,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 8,
      "text": "The cedars in the garden of God could not equal it. The cypresses could not match its branches, nor could the plane trees compare with its boughs. No tree in the garden of God was like it in beauty.",
      "links": "<a href='/AIV/26/28/13'>Ezek. 28:13</a>",
      "comment": "Assyria's splendor is compared even to Eden, marking its exceptional prominence. This foreshadows how God lifts up earthly kingdoms, but greater honor comes from spiritual union with God."
    },
    {
      "pk": 2155309,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 9,
      "text": "I made it beautiful in the abundance of its branches, and all the trees of Eden envied it, that were in the garden of God.",
      "links": "<a href='/AIV/01/2/9'>Gen. 2:9</a>",
      "comment": "God is the source of beauty and authority, and His plans use even pagan nations for His glory. Reference to 'Eden' alludes to a spiritual ideal lost and foreshadows its restoration in Christ."
    },
    {
      "pk": 2155310,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 10,
      "text": "Therefore, thus says the Lord GOD: Because you were exalted in height and set your top among the clouds, and your heart was lifted up in your height,",
      "links": "<a href='/AIV/20/16/18'>Prov. 16:18</a>; <a href='/AIV/23/10/12'>Isa. 10:12</a>",
      "comment": "Pride is what brings downfall, as echoed in Proverbs 16:18. This has both a literal and a spiritual message, relevant to individual and corporate sin."
    },
    {
      "pk": 2155311,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 11,
      "text": "Therefore I will give it into the hand of the mighty one of the nations; he shall surely deal with it. I have cast it out for its wickedness.",
      "links": "<a href='/AIV/23/14/12'>Isa. 14:12</a>; <a href='/AIV/27/4/24-25'>Dan. 4:24-25</a>",
      "comment": "",
      "mighty one of the nations”), often Babylon, for judgment. Divine justice works through history.": ""
    },
    {
      "pk": 2155312,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 12,
      "text": "Foreigners, ruthless among the nations, have cut it down and left it. The branches have fallen on the mountains and in all the valleys; its boughs have been broken by all the streams of the land. All the peoples of the earth have gone down from its shadow and left it.",
      "links": "<a href='/AIV/26/30/11-12'>Ezek. 30:11-12</a>",
      "comment": "God’s judgment strips away the security of oppressive kingdoms. The world’s powers are fleeting; only God’s promises endure eternally."
    },
    {
      "pk": 2155313,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 13,
      "text": "On its fallen trunk all the birds of the heavens will dwell, and all the animals of the field will be on its branches,",
      "links": "<a href='/AIV/27/4/14'>Dan. 4:14</a>",
      "comment": "The former glory is now a place for scavengers, showing the reversal of fortunes that pride brings. See Daniel 4 for a parallel vision given to Nebuchadnezzar."
    },
    {
      "pk": 2155314,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 14,
      "text": "so that all the trees by the waters may not exalt themselves in their height, nor set their top among the clouds, nor any tree that drinks water be confident in its height. For they have all been delivered to death, to the lower parts of the earth, among the children of men who go down to the pit.",
      "links": "<a href='/AIV/26/32/18'>Ezek. 32:18</a>; <a href='/AIV/19/49/14'>Ps. 49:14</a>",
      "comment": "No nation or people can remain proud before the Lord. This is a warning as well as a prophecy of judgment—humility is necessary both for individuals and communities seeking to remain in divine favor."
    },
    {
      "pk": 2155315,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 15,
      "text": "Thus says the Lord GOD: On the day it went down to Sheol, I caused mourning; I covered the deep because of it. I restrained its rivers, and the great waters were stopped. I caused Lebanon to mourn for it, and all the trees of the field fainted because of it.",
      "links": "<a href='/AIV/23/14/8'>Isa. 14:8</a>",
      "comment": "The fall of a mighty nation affects the whole order of creation. Sheol (the realm of the dead) reminds us of the seriousness of sin and the finality of divine judgment."
    },
    {
      "pk": 2155316,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 16,
      "text": "I made the nations shake at the sound of its fall, when I cast it down to Sheol with those who go down to the pit. All the trees of Eden, the choice and best of Lebanon, all that drink water, were comforted in the lower parts of the earth.",
      "links": "<a href='/AIV/23/2/19'>Isa. 2:19</a>; <a href='/AIV/19/76/8'>Ps. 76:8</a>",
      "comment": "All the great ones who have died receive the fallen Assyria—encouragement to the humble that God’s justice prevails. There is an undercurrent of hope in divine judgment, foreshadowed in Christ’s descent to the dead (<a href='/AIV/60/3/19-20'>1 Pet. 3:19-20</a>)."
    },
    {
      "pk": 2155317,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 17,
      "text": "They also went down to Sheol with it, to those who were slain by the sword, those who were its arm, who lived under its shadow among the nations.",
      "links": "<a href='/AIV/23/14/15'>Isa. 14:15</a>",
      "comment": "Assyria’s fate is shared by those connected to it—reminding us that our choices, especially who we associate with, affect our spiritual destiny."
    },
    {
      "pk": 2155318,
      "translation": "AIV",
      "book": 26,
      "chapter": 31,
      "verse": 18,
      "text": "To which of the trees in Eden do you compare yourself in glory and greatness? Yet you shall be brought down with the trees of Eden to the lower parts of the earth. You shall lie among the uncircumcised, with those slain by the sword. This is Pharaoh and all his multitude, says the Lord GOD.",
      "links": "<a href='/AIV/26/32/19'>Ezek. 32:19</a>; <a href='/AIV/23/30/33'>Isa. 30:33</a>",
      "comment": "Egypt, like Assyria, will share the fate of ‘all the trees of Eden.’ This points ahead to the total dependence of all creation on God’s mercy. There’s a spiritual hope in being joined to the true vine—Christ (see <a href='/AIV/43/15/5'>John 15:5</a>), reminding all that only through union with God can one find eternal life."
    }
  ],
  "translatedAt": "2025-12-23T07:02:57.587Z"
}