{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 38,
  "verses": [
    {
      "pk": 3838001,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/37/15'>Ezek. 37:15</a>",
      "comment": "Introduction to the prophecy: God initiates the message, a common prophetic motif echoing divine authority (cf. Ezekiel 1:3)."
    },
    {
      "pk": 3838002,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 2,
      "text": "\"Son of man, set your face toward Gog, of the land of Magog, the chief prince of Meshech and Tubal. Prophesy against him",
      "links": "<a href='/AIV/26/39/1'>Ezek. 39:1</a>; <a href='/AIV/1/10/2'>Gen. 10:2</a>",
      "comment": "\"Gog of Magog\" is a mysterious figure often seen as a symbol of enemies opposing God's people in eschatological conflict. Meshech and Tubal trace back to descendants of Japheth (Gen. 10:2), suggesting widespread nations."
    },
    {
      "pk": 3838003,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 3,
      "text": "and say, 'This is what the Lord GOD says: Behold, I am against you, Gog, chief prince of Meshech and Tubal.",
      "links": "<a href='/AIV/26/13/8'>Ezek. 13:8</a>; <a href='/AIV/26/39/1'>Ezek. 39:1</a>",
      "comment": "God Himself stands in opposition to Gog, affirming divine judgment against hostile nations."
    },
    {
      "pk": 3838004,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 4,
      "text": "And I will turn you around and put hooks in your jaws, and I will bring you out with all your army—horses and horsemen, all dressed in full armor, a great company with shield and buckler, all holding swords.",
      "links": "<a href='/AIV/2/14/25'>Ex. 14:25</a>; <a href='/AIV/26/29/4'>Ezek. 29:4</a>",
      "comment": "The image of hooks in jaws recalls God's sovereignty over nations, even those intent on evil (cf. Ex. 14:25; Ezek. 29:4). God draws these armies out for judgment."
    },
    {
      "pk": 3838005,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 5,
      "text": "Persia, Cush, and Put will be with them, all with shields and helmets;",
      "links": "<a href='/AIV/1/10/6'>Gen. 10:6</a>; <a href='/AIV/26/27/10'>Ezek. 27:10</a>",
      "comment": "The alliance of Gentile nations against Israel underlines a global scope in opposition. Persia, Cush, and Put are prominent ancient nations, consistently seen as adversarial (cf. Gen. 10:6)."
    },
    {
      "pk": 3838006,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 6,
      "text": "Gomer and all its troops; Beth-Togarmah from the far north with all its troops—many peoples are with you.",
      "links": "<a href='/AIV/1/10/3'>Gen. 10:3</a>; <a href='/AIV/26/27/14'>Ezek. 27:14</a>",
      "comment": "Gomer and Togarmah, more descendants of Japheth, illustrate the diverse and widespread nature of those united against God's people."
    },
    {
      "pk": 3838007,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 7,
      "text": "Prepare yourself, assemble all the troops with you, and be ready. You are a guard for them.",
      "links": "<a href='/AIV/26/39/8'>Ezek. 39:8</a>",
      "comment": "Gog is called to muster and lead its armies, but the context foreshadows this preparation is toward inevitable defeat."
    },
    {
      "pk": 3838008,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 8,
      "text": "After many days you will be called. In the latter years you will come into the land that has been restored from the sword, whose people have been gathered from many nations, to the mountains of Israel that had long been desolate. Its people were brought out from the nations, and all of them dwell in safety.",
      "links": "<a href='/AIV/3/26/5'>Lev. 26:5</a>; <a href='/AIV/26/34/13'>Ezek. 34:13</a>; <a href='/AIV/24/30/3'>Jer. 30:3</a>",
      "comment": "This prophecy refers to a future restoration where Israel is regathered and safe. Spiritual interpretations see this as pointing to God's ultimate plan for His people (cf. Jer. 30:3; Ezek. 34:13) and hints at fulfilled prophecy in the era when safety is established under a divinely appointed shepherd."
    },
    {
      "pk": 3838009,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 9,
      "text": "You will come up, going like a storm. You will be like a cloud covering the land, you and all your troops, and many peoples with you.",
      "links": "<a href='/AIV/24/4/13'>Jer. 4:13</a>",
      "comment": "The imagery of Gog's approach evokes chaos and power, often used to describe hostile armies (cf. Jer. 4:13), emphasizing the intensity of this eschatological conflict."
    },
    {
      "pk": 3838010,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 10,
      "text": "This is what the Lord GOD says: On that day, thoughts will come into your mind, and you will devise an evil plan.",
      "links": "<a href='/AIV/26/12/25'>Ezek. 12:25</a>",
      "comment": "Gog’s conspiracy is allowed within God's providence, showing how even evil purposes ultimately serve God’s sovereign plan."
    },
    {
      "pk": 3838011,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 11,
      "text": "You will say, ‘I will go up against the land of unwalled villages. I will attack those at rest who dwell securely—all of them living without walls, bars, or gates.’",
      "links": "<a href='/AIV/26/39/26'>Ezek. 39:26</a>",
      "comment": "This peaceful state recalls themes of messianic security (cf. Ezek. 39:26). Emphasis is on God’s protection even when vulnerable."
    },
    {
      "pk": 3838012,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 12,
      "text": "You will come to take spoil and seize plunder, to turn your hand against the restored ruins and the people gathered from the nations, who have acquired cattle and goods, and who dwell at the center of the earth.",
      "links": "<a href='/AIV/26/7/21'>Ezek. 7:21</a>; <a href='/AIV/26/11/17'>Ezek. 11:17</a>",
      "comment": "The phrase ‘center of the earth’ acknowledges Israel’s theological and spiritual centrality—foreshadowing the church’s universality in salvation history."
    },
    {
      "pk": 3838013,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 13,
      "text": "Sheba and Dedan and the merchants of Tarshish and all its leaders will say to you, ‘Have you come to take spoil? Have you gathered your armies to carry off silver and gold, to take away cattle and goods, to seize great plunder?’",
      "links": "<a href='/AIV/1/10/7'>Gen. 10:7</a>; <a href='/AIV/19/72/10'>Ps. 72:10</a>",
      "comment": "Sheba, Dedan, Tarshish represent distant trading nations questioning Gog’s motives, emphasizing greed over any just cause."
    },
    {
      "pk": 3838014,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 14,
      "text": "Therefore, son of man, prophesy and say to Gog, ‘This is what the Lord GOD says: On that day, when my people Israel are dwelling securely, will you not know it?",
      "links": "<a href='/AIV/26/34/27-28'>Ezek. 34:27-28</a>; <a href='/AIV/26/39/9'>Ezek. 39:9</a>",
      "comment": "Israel’s security is highlighted—a direct result of God’s covenantal faithfulness and foreshadows secure dwelling under the Messiah."
    },
    {
      "pk": 3838015,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 15,
      "text": "You will come from your place out of the far north, you and many peoples with you, all of them riding horses—a great horde, a mighty army.",
      "links": "<a href='/AIV/26/39/2'>Ezek. 39:2</a>",
      "comment": "The ‘far north’ is archetypal for the distant, unknown enemy. A multitude, deeply foreshadowing apocalyptic battles later fulfilled in spiritual warfare."
    },
    {
      "pk": 3838016,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 16,
      "text": "You will come up against my people Israel like a cloud covering the land. It will be in the latter days that I will bring you against my land, so that the nations may know me, when I am sanctified in you before their eyes, O Gog.",
      "links": "<a href='/AIV/26/39/21'>Ezek. 39:21</a>; <a href='/AIV/2/9/16'>Ex. 9:16</a>",
      "comment": "God’s providence: even opposition serves to reveal His glory, reminiscent of Pharaoh (Ex. 9:16). The sanctification of God’s name is a major theme leading to fulfillment in the church’s universal mission."
    },
    {
      "pk": 3838017,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 17,
      "text": "\"This is what the Lord GOD says: Are you the one I spoke of in former days through my servants the prophets of Israel, who prophesied for years that I would bring you against them?",
      "links": "<a href='/AIV/28/1/7'>Hos. 1:7</a>; <a href='/AIV/33/4/11-12'>Mic. 4:11-12</a>",
      "comment": "Gog’s attack had earlier prophetic anticipation, lengthening messianic and eschatological expectation, forging strong biblical continuity."
    },
    {
      "pk": 3838018,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 18,
      "text": "On that day, when Gog comes against the land of Israel, says the Lord GOD, my wrath will be aroused.",
      "links": "<a href='/AIV/26/7/8'>Ezek. 7:8</a>",
      "comment": "Divine wrath is both just and purifying—asserting God’s holiness and reinforcing the theme that He defends His people in history."
    },
    {
      "pk": 3838019,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 19,
      "text": "In my zeal, in the fire of my wrath, I declare that on that day there will be a great shaking in the land of Israel.",
      "links": "<a href='/AIV/26/12/19'>Ezek. 12:19</a>; <a href='/AIV/19/18/7'>Ps. 18:7</a>",
      "comment": "Earthquake imagery is a sign of God’s cosmic intervention (cf. Ps. 18:7), depicting momentous acts throughout both Old and New Testament."
    },
    {
      "pk": 3838020,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 20,
      "text": "The fish of the sea, the birds of the heavens, the beasts of the field, every creature that creeps on the earth, and all mankind will tremble at my presence. The mountains will be thrown down, the cliffs will collapse, and every wall will fall to the ground.",
      "links": "<a href='/AIV/1/7/21-22'>Gen. 7:21-22</a>; <a href='/AIV/26/6/7'>Ezek. 6:7</a>",
      "comment": "God’s judgment is holistic, affecting all creation. This totality foreshadows final judgment seen in apocalyptic visions (cf. Revelation)."
    },
    {
      "pk": 3838021,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 21,
      "text": "I will summon a sword against Gog on all my mountains, says the Lord GOD. Every man’s sword will be against his brother.",
      "links": "<a href='/AIV/7/7/22'>Judg. 7:22</a>; <a href='/AIV/1/14/20'>Gen. 14:20</a>",
      "comment": "The confusion among enemies and self-destruction is reminiscent of Old Testament battles (Judg. 7:22)—showing God’s indirect victory over foes."
    },
    {
      "pk": 3838022,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 22,
      "text": "With plague and bloodshed I will enter into judgment with Gog; I will rain down hailstones, fire, and sulfur on him and on his troops, and on the many peoples who are with him.",
      "links": "<a href='/AIV/2/9/24'>Ex. 9:24</a>; <a href='/AIV/1/19/24'>Gen. 19:24</a>; <a href='/AIV/66/20/9'>Rev. 20:9</a>",
      "comment": "Divine judgment by plague and fire recalls both Exodus and Sodom (Ex. 9:24; Gen. 19:24). This foreshadows New Testament apocalyptic judgment (Rev. 20:9) and points to the final victory of God."
    },
    {
      "pk": 3838023,
      "translation": "AIV",
      "book": 26,
      "chapter": 38,
      "verse": 23,
      "text": "I will show my greatness and holiness and make myself known in the sight of many nations. Then they will know that I am the LORD.",
      "links": "<a href='/AIV/2/7/5'>Ex. 7:5</a>; <a href='/AIV/19/46/10'>Ps. 46:10</a>; <a href='/AIV/43/17/3'>John 17:3</a>",
      "comment": "God’s ultimate purpose is the revelation of His holiness and greatness, making Himself known universally (cf. Ex. 7:5; Ps. 46:10). This anticipates the broader inclusion of all nations in the kingdom of God, with spiritual echoes pointing to the fulfillment in the church as the instrument of God’s revealed presence to the world."
    }
  ],
  "translatedAt": "2025-12-23T07:06:47.286Z"
}