{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 3,
  "verses": [
    {
      "pk": 2643001,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 1,
      "text": "He said to me, 'Son of man, eat what you find here; eat this scroll, and go, speak to the house of Israel.'",
      "links": "<a href='/AIV/26/2/8-9'>Ezek. 2:8-9</a>; <a href='/AIV/66/10/9'>Rev. 10:9</a>",
      "comment": "God commands Ezekiel to consume the scroll, symbolizing internalizing God's message before delivering it. This mirrors John's prophetic commission in Revelation, underlining the idea of receiving divine revelation inwardly."
    },
    {
      "pk": 2643002,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 2,
      "text": "So I opened my mouth, and he gave me the scroll to eat.",
      "links": "<a href='/AIV/26/2/10'>Ezek. 2:10</a>",
      "comment": "Ezekiel’s obedience highlights the prophet’s receptive role. The act of 'eating' God’s word models submission and willingness to let God's law govern one’s life, a common spiritual motif for Christian discipleship."
    },
    {
      "pk": 2643003,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 3,
      "text": "He said to me, 'Son of man, feed your stomach and fill your belly with this scroll that I give you.' So I ate it, and it was sweet as honey in my mouth.",
      "links": "<a href='/AIV/19/119/103'>Ps. 119:103</a>; <a href='/AIV/66/10/10'>Rev. 10:10</a>",
      "comment": "'Sweet as honey' echoes Psalm 119 and Revelation; God's Word brings immense joy when received in faith. There’s a spiritual sense where the message is sweet to the soul, though obeying it will often require sacrifice."
    },
    {
      "pk": 2643004,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 4,
      "text": "He said to me, 'Son of man, go to the house of Israel and speak my words to them.'",
      "links": "<a href='/AIV/26/2/3'>Ezek. 2:3</a>",
      "comment": "Ezekiel is sent as God’s messenger to Israel. The clarity of mission recalls how Jesus sends out His disciples (see <a href='/AIV/40/28/19'>Matt. 28:19</a>), highlighting God’s continual sending of emissaries to guide His people toward truth."
    },
    {
      "pk": 2643005,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 5,
      "text": "'For you are not sent to a people of unfamiliar speech and difficult language, but to the house of Israel—'",
      "links": "<a href='/AIV/26/3/6'>Ezek. 3:6</a>",
      "comment": "Israel has no language barrier to understanding God’s word—they have full access to His covenant and teaching, increasing their responsibility. The clear call contrasts with the later mission to the nations."
    },
    {
      "pk": 2643006,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 6,
      "text": "'not to many peoples of unfamiliar speech whose words you cannot understand. Surely, if I sent you to them, they would listen to you.'",
      "links": "<a href='/AIV/40/8/10-12'>Matt. 8:10–12</a>",
      "comment": "God points out Israel's stubbornness in contrast to Gentile openness. It's a theme fulfilled in Christ’s ministry, where Gentiles hear and accept the Gospel eagerly, foreshadowing the universal mission of the Church."
    },
    {
      "pk": 2643007,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 7,
      "text": "'But the house of Israel will not listen to you, because they are not willing to listen to me; for all the house of Israel are hard of head and stubborn of heart.'",
      "links": "<a href='/AIV/26/2/4'>Ezek. 2:4</a>; <a href='/AIV/44/7/51'>Acts 7:51</a>",
      "comment": "The stubbornness of Israel ties in with Stephen’s speech in Acts, identifying spiritual resistance. For believers today, it is a call to examine our openness to God’s message, not merely its delivery."
    },
    {
      "pk": 2643008,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 8,
      "text": "'See, I have made your face as hard as theirs, and your forehead as hard as theirs.'",
      "links": "<a href='/AIV/26/2/6'>Ezek. 2:6</a>",
      "comment": "God equips Ezekiel with the necessary firmness to withstand Israel’s resistance. Spiritual leadership sometimes requires both compassion and resolve—a subtle reminder of the Church's enduring defense of the faith."
    },
    {
      "pk": 2643009,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 9,
      "text": "'Like diamond, harder than flint, I have made your forehead. Do not be afraid of them or be dismayed by their looks, for they are a rebellious house.'",
      "links": "<a href='/AIV/33/3/8'>Mic. 3:8</a>",
      "comment": "God's supernatural strengthening echoes Micah’s empowerment by the Spirit. It is also a spiritual encouragement that authentic messengers of God will be divinely enabled to remain steadfast."
    },
    {
      "pk": 2643010,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 10,
      "text": "He said to me, 'Son of man, all my words that I speak to you, receive in your heart and hear with your ears.'",
      "links": "<a href='/AIV/05/6/6'>Deut. 6:6</a>; <a href='/AIV/40/13/9'>Matt. 13:9</a>",
      "comment": "Internalizing God’s word—receiving in the heart—echoes Deuteronomy, pointing to a spirituality rooted in meditated truth, not just external observance. This model underpins sacramental life and spiritual formation."
    },
    {
      "pk": 2643011,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 11,
      "text": "'Go to the exiles, to the sons of your people, and speak to them. Whether they listen or refuse, say to them, “This is what the Lord GOD says.”'",
      "links": "<a href='/AIV/26/2/5'>Ezek. 2:5</a>",
      "comment": "Ezekiel is called to faithfulness, not success—mirroring Paul’s assertion that ministers are called to plant and water, but God gives growth (<a href='/AIV/46/3/6-7'>1 Cor. 3:6-7</a>)."
    },
    {
      "pk": 2643012,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 12,
      "text": "Then the Spirit lifted me up, and I heard behind me the sound of a great earthquake: 'Blessed be the glory of the LORD from his place!'",
      "links": "<a href='/AIV/26/1/28'>Ezek. 1:28</a>",
      "comment": "The Spirit’s lifting and the doxology recall the heavenly worship and Divine glory shown earlier, paralleling the angelic worship described in Revelation (<a href='/AIV/66/4/8-11'>Rev. 4:8–11</a>)."
    },
    {
      "pk": 2643013,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 13,
      "text": "I heard the noise of the wings of the living creatures brushing together, and the sound of the wheels beside them, a loud rumbling sound.",
      "links": "<a href='/AIV/26/1/24'>Ezek. 1:24</a>",
      "comment": "This supernatural vision emphasizes God’s transcendence and majesty. It draws back to Ezekiel’s earlier vision of the throne, establishing the prophet’s authority as one grounded in real encounters with Divine mysteries."
    },
    {
      "pk": 2643014,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 14,
      "text": "The Spirit lifted me up and took me away, and I went in bitterness and the heat of my spirit, for the hand of the LORD was strong upon me.",
      "links": "<a href='/AIV/26/8/3'>Ezek. 8:3</a>",
      "comment": "Ezekiel’s emotional turmoil highlights the cost of prophetic ministry, paralleling Christ’s anguish in Gethsemane. The 'hand of the LORD' marks both suffering and holy commissioning."
    },
    {
      "pk": 2643015,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 15,
      "text": "I came to the exiles at Tel-Abib, who lived by the Kebar canal, and I sat where they were dwelling. I sat there overwhelmed among them for seven days.",
      "links": "<a href='/AIV/26/1/1'>Ezek. 1:1</a>; <a href='/AIV/18/2/13'>Job 2:13</a>",
      "comment": "Ezekiel’s seven-day silence echoes Job’s friends, signifying mourning and deep contemplation. This resonates with traditions of spiritual retreat and preparation before active ministry."
    },
    {
      "pk": 2643016,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 16,
      "text": "At the end of seven days, the word of the LORD came to me:",
      "links": "<a href='/AIV/26/1/3'>Ezek. 1:3</a>",
      "comment": "God’s timing after seven days reflects spiritual cycles of completion, as seen in Creation week. Preparation and reflection precede prophetic commission."
    },
    {
      "pk": 2643017,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 17,
      "text": "'Son of man, I have made you a watchman for the house of Israel. So hear the word from my mouth and give them warning from me.'",
      "links": "<a href='/AIV/26/33/7'>Ezek. 33:7</a>; <a href='/AIV/58/13/17'>Heb. 13:17</a>",
      "comment": "Ezekiel as 'watchman' prefigures the later role of spiritual shepherds, charged with keeping spiritual vigilance over the flock. This anticipates ideas of pastoral oversight and responsibility."
    },
    {
      "pk": 2643018,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 18,
      "text": "'If I say to the wicked, “You shall surely die,” and you do not warn him or speak to warn him of his wicked way to save his life, that wicked person will die for his guilt, but I will hold you responsible for his blood.'",
      "links": "<a href='/AIV/26/18/4'>Ezek. 18:4</a>; <a href='/AIV/44/20/26'>Acts 20:26</a>",
      "comment": "This underscores the seriousness of spiritual accountability. Failure to warn the wicked brings responsibility—a motif Paul applies to preaching the Gospel."
    },
    {
      "pk": 2643019,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 19,
      "text": "'But if you warn the wicked, and he does not turn from his wickedness or from his wicked way, he shall die for his guilt, but you will have delivered your soul.'",
      "links": "<a href='/AIV/26/33/9'>Ezek. 33:9</a>",
      "comment": "The principle here is spiritual responsibility: a faithful witness is absolved of guilt if the message is faithfully delivered, emphasizing the need for evangelistic zeal and pastoral courage."
    },
    {
      "pk": 2643020,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 20,
      "text": "'Again, when a righteous person turns away from his righteousness and commits iniquity, and I lay a stumbling block before him, he shall die. Since you did not warn him, he will die for his sin, and I will hold you responsible for his blood.'",
      "links": "<a href='/AIV/26/18/24'>Ezek. 18:24</a>; <a href='/AIV/58/6/4-6'>Heb. 6:4–6</a>",
      "comment": "Persistent righteousness is imperative; falling away has grave consequences. This passage resonates with warnings in Hebrews about apostasy and the responsibility of spiritual leaders to guard the flock."
    },
    {
      "pk": 2643021,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 21,
      "text": "'But if you warn the righteous person not to sin, and he does not sin, he shall surely live, because he took warning; and you will have delivered your soul.'",
      "links": "<a href='/AIV/26/18/9'>Ezek. 18:9</a>",
      "comment": "Faithful admonition preserves life—spiritual correction is life-giving and central to the health of God’s people."
    },
    {
      "pk": 2643022,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 22,
      "text": "The hand of the LORD was there upon me, and he said to me, 'Arise, go out to the plain, and there I will speak to you.'",
      "links": "<a href='/AIV/26/1/3'>Ezek. 1:3</a>",
      "comment": "God’s personal instruction to Ezekiel in isolation reflects the pattern of setting apart leaders for intimacy and revelation, akin to Moses and Jesus seeking solitude before ministry."
    },
    {
      "pk": 2643023,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 23,
      "text": "So I arose and went out to the plain, and behold, the glory of the LORD was standing there, like the glory I had seen by the Kebar canal; and I fell on my face.",
      "links": "<a href='/AIV/26/1/28'>Ezek. 1:28</a>; <a href='/AIV/40/17/6'>Matt. 17:6</a>",
      "comment": "Ezekiel’s response to God’s glory—falling on his face—mirrors Biblical responses to Divine presence. It embodies reverence and awe before God, a spiritual trait modeled by the saints."
    },
    {
      "pk": 2643024,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 24,
      "text": "The Spirit entered into me and set me on my feet, and he spoke with me and said to me, 'Go, shut yourself inside your house.'",
      "links": "<a href='/AIV/26/2/2'>Ezek. 2:2</a>",
      "comment": "The Spirit’s role in empowering and directing Ezekiel reflects the indwelling of God's Spirit in believers, supporting transformative personal encounters with God and the importance of receptive waiting in the Christian journey."
    },
    {
      "pk": 2643025,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 25,
      "text": "'And you, son of man, behold, cords will be placed upon you, and you shall be bound inside your house. You shall not go out among them.'",
      "links": "<a href='/AIV/26/4/8'>Ezek. 4:8</a>",
      "comment": "The theme of prophetic suffering and isolation becomes a visible sign to Israel. This anticipates later examples of spiritual leaders embracing personal trial for the sake of God’s people."
    },
    {
      "pk": 2643026,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 26,
      "text": "'I will make your tongue cling to the roof of your mouth, so that you shall be mute and unable to rebuke them, for they are a rebellious house.'",
      "links": "<a href='/AIV/26/24/27'>Ezek. 24:27</a>",
      "comment": "Temporarily silencing Ezekiel is both a judgment and a sign. God sometimes withholds revelation as a sign, paralleling moments when God appears silent in history, prompting repentance."
    },
    {
      "pk": 2643027,
      "translation": "AIV",
      "book": 26,
      "chapter": 3,
      "verse": 27,
      "text": "'But when I speak with you, I will open your mouth, and you shall say to them, “This is what the Lord GOD says.” Whoever will hear, let him hear; and whoever refuses, let him refuse; for they are a rebellious house.'",
      "links": "<a href='/AIV/40/13/9'>Matt. 13:9</a>; <a href='/AIV/66/2/7'>Rev. 2:7</a>",
      "comment": "Ezekiel’s prophetic authority comes directly from God. The phrase 'let him hear' is echoed by Jesus, inviting spiritual openness. Spiritually, it admonishes believers to receive the fullness of truth with docility and persistence."
    }
  ],
  "translatedAt": "2025-12-23T06:47:35.394Z"
}