{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 41,
  "verses": [
    {
      "pk": 33041001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 1,
      "text": "Then he brought me to the temple and measured the doorposts. Each doorpost was six cubits wide on each side—the width of the tent.",
      "links": "<a href='/AIV/02/26/22-23'>Exod. 26:22-23</a>; <a href='/AIV/26/40/48-49'>Ezek. 40:48-49</a>",
      "comment": "Ezekiel is led into the main temple structure. The specific measurements highlight the importance of precision in worship. The word 'tent' links the temple to the tabernacle in the wilderness, emphasizing continuity and the dwelling of God's presence among His people."
    },
    {
      "pk": 33041002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 2,
      "text": "The width of the entrance was ten cubits, and the sides of the entrance were five cubits on either side. He measured the length of the temple as forty cubits, and the width as twenty cubits.",
      "links": "<a href='/AIV/11/6/2'>1 Kgs. 6:2</a>; <a href='/AIV/02/26/16-18'>Exod. 26:16-18</a>",
      "comment": "The measurements correspond with the dimensions of Solomon's temple. This points to a continuity of tradition and reveals the temple as the dwelling place of God—a type pointing to Christ, whose body is the true temple (cf. <a href='/AIV/43/2/19-21'>John 2:19-21</a>)."
    },
    {
      "pk": 33041003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 3,
      "text": "Then he went inside and measured each doorpost at two cubits; and the entrance, six cubits high; and the width of the entrance, seven cubits.",
      "links": "<a href='/AIV/26/40/35-37'>Ezek. 40:35-37</a>",
      "comment": "Ezekiel records details of the sanctuary, showing the increasing sanctity as one moves closer to the Holy of Holies, reflecting the preparation and purification required to approach God."
    },
    {
      "pk": 33041004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 4,
      "text": "And he measured the length of the room—twenty cubits, and the width—twenty cubits, facing the temple. He said to me, 'This is the Most Holy Place.'",
      "links": "<a href='/AIV/03/16/2'>Lev. 16:2</a>; <a href='/AIV/58/9/3'>Heb. 9:3</a>",
      "comment": "This inner sanctuary is the Holy of Holies, representing the highest degree of sanctity and symbolizing God's dwelling among His people. Only the high priest could enter, foreshadowing Christ as the true High Priest."
    },
    {
      "pk": 33041005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 5,
      "text": "Then he measured the wall of the temple, six cubits thick; and the width of the side chambers all around the temple was four cubits.",
      "links": "<a href='/AIV/11/6/5-6'>1 Kgs. 6:5-6</a>",
      "comment": "The thick walls and side chambers emphasize protection and structure, signifying the strength and permanence of God's dwelling. The many chambers may hint at the multiplicity of roles and ministries that sustain true worship."
    },
    {
      "pk": 33041006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 6,
      "text": "The side chambers were in three stories, one above the other, thirty on each level; they extended to the wall built inside, which was for the chambers all around, so that they could support without being fastened into the temple wall itself.",
      "links": "<a href='/AIV/11/6/6'>1 Kgs. 6:6</a>",
      "comment": "The order and structure of the chambers—each supported but not fastened to the sanctuary—suggest a spiritual reality: those serving in God's presence must rely on us on His foundation. There is a core unity of faith and worship."
    },
    {
      "pk": 33041007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 7,
      "text": "The side chambers became wider at each successive level, because the surrounding structure was wider at each level. Thus, the chamber at the bottom was narrowest, and they became broader as one ascended upward. Stairways led upward from the lowest story to the highest by way of the middle.",
      "links": "<a href='/AIV/58/10/19-22'>Heb. 10:19-22</a>",
      "comment": "Ascending to the higher chambers may symbolize spiritual ascent—approaching God more closely. The path to God’s presence is revealed gradually and through ordered steps."
    },
    {
      "pk": 33041008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 8,
      "text": "I also saw that the temple had a raised foundation all around; the foundations of the side chambers were a full rod of six long cubits in height.",
      "links": "<a href='/AIV/26/40/5'>Ezek. 40:5</a>",
      "comment": "The raised foundation demonstrates separation and holiness. The measuring rod recalls God's standards and commands, reflecting that God’s dwelling is constructed according to His will—not human whim."
    },
    {
      "pk": 33041009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 9,
      "text": "The outer wall of the side chambers was five cubits thick, and the open space beside the temple was on every side.",
      "links": "<a href='/AIV/11/6/6'>1 Kgs. 6:6</a>",
      "comment": "The open space and thick walls reinforce the theme of separation for the sake of sacredness. The Church is likewise called to be set apart in order to preserve true worship and teaching."
    },
    {
      "pk": 33041010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 10,
      "text": "And between the chambers was a width of twenty cubits all around the temple, on every side.",
      "links": "<a href='/AIV/26/42/3-10'>Ezek. 42:3-10</a>",
      "comment": "The regularly measured space recalls the design God gave, representing order and peace. God is not a God of confusion but of order, reflected in the house where He dwells."
    },
    {
      "pk": 33041011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 11,
      "text": "The doors of the side chambers opened toward the open area, one door facing north and another south; and the width of the open area was five cubits all around.",
      "links": "<a href='/AIV/26/42/4'>Ezek. 42:4</a>",
      "comment": "The orientation of the doors and the open area signify readiness of access to sacred service, a reminder that worship should be approached with reverence and the proper disposition."
    },
    {
      "pk": 33041012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 12,
      "text": "The building that was facing the separate yard at the west was seventy cubits wide; and the wall of the building was five cubits thick all around, and its length was ninety cubits.",
      "links": "<a href='/AIV/26/41/15'>Ezek. 41:15</a>",
      "comment": "These additional structures connected to the temple proper suggest the support and continuity of sacred tradition and authority in worship practices."
    },
    {
      "pk": 33041013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 13,
      "text": "So he measured the temple, one hundred cubits long; the separate areas and the building with its walls were also one hundred cubits long,",
      "links": "<a href='/AIV/26/40/47'>Ezek. 40:47</a>",
      "comment": "The symmetry and completeness of the structure reflect God’s perfection and the fullness of divine revelation. The number one hundred often indicates completeness."
    },
    {
      "pk": 33041014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 14,
      "text": "The width of the temple facing north, along with the separate area, was also one hundred cubits. The same was true on the south side.",
      "links": "<a href='/AIV/26/40/19'>Ezek. 40:19</a>",
      "comment": "The repetition of measurements further emphasizes the perfection and symmetry of God’s house. The unity reflects the unity required among believers."
    },
    {
      "pk": 33041015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 15,
      "text": "He then measured the length of the building facing the separate yard at the back, and its galleries on either side—one hundred cubits. The inner temple and the porches of the court,",
      "links": "<a href='/AIV/26/40/44-47'>Ezek. 40:44-47</a>",
      "comment": "Ezekiel's care in reiterating the measurements shows the significance of every part of worship and the seriousness with which sacred tradition and liturgy must be preserved."
    },
    {
      "pk": 33041016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 16,
      "text": "the thresholds, the narrow windows, and the galleries surrounding the three stories opposite the threshold, were paneled with wood all around from the floor up to the windows; now the windows were covered,",
      "links": "<a href='/AIV/11/6/4-6'>1 Kgs. 6:4-6</a>",
      "comment": "The wood panels and covered windows represent reverence for holiness and a separation from the profane world, indicating the sacramental reality of hidden divine mysteries."
    },
    {
      "pk": 33041017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 17,
      "text": "above the door, and even to the inner house, and outside, and by all the wall all around inside and outside, by measured pattern.",
      "links": "<a href='/AIV/26/40/16'>Ezek. 40:16</a>",
      "comment": "The careful decoration and design emphasize that nothing in true worship is accidental—every detail and tradition bears significance for encountering the holy."
    },
    {
      "pk": 33041018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 18,
      "text": "It was carved with cherubim and palm trees; a palm tree between cherub and cherub. Each cherub had two faces,",
      "links": "<a href='/AIV/11/6/29'>1 Kgs. 6:29</a>; <a href='/AIV/02/25/18-20'>Exod. 25:18-20</a>",
      "comment": "Cherubim and palms symbolize angelic guardianship and victory over sin. Their presence within the temple points towards divine protection provided through sacramental life and worship."
    },
    {
      "pk": 33041019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 19,
      "text": "the face of a man toward the palm tree on one side and the face of a young lion toward the palm tree on the other side. It was made throughout all the house all around.",
      "links": "<a href='/AIV/26/1/10'>Ezek. 1:10</a>",
      "comment": "The symbolic faces echo Ezekiel’s earlier vision (Ezek. 1:10). The man and lion can signify Christ’s two natures: human and divine (cf. <a href='/AIV/43/1/1-14'>John 1:1-14</a>), and also the varied roles of the faithful."
    },
    {
      "pk": 33041020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 20,
      "text": "From the floor to above the door, cherubim and palm trees were carved on the wall of the sanctuary.",
      "links": "<a href='/AIV/11/6/35'>1 Kgs. 6:35</a>",
      "comment": "Decorative motifs extend to the entire sanctuary, reminding us that all aspects of worship are infused with reverence for God’s holiness—pointing to the beauty of liturgical worship."
    },
    {
      "pk": 33041021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 21,
      "text": "The doorposts of the temple were squared, as was the front of the sanctuary. The appearance of one was like the appearance of the other.",
      "links": "<a href='/AIV/26/40/14'>Ezek. 40:14</a>",
      "comment": "Symmetry in sacred architecture mirrors God’s perfection and unity—just as true worship should reflect unity of faith and practice."
    },
    {
      "pk": 33041022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 22,
      "text": "There was an altar of wood, three cubits high and two cubits long; its corners, base, and sides were of wood. He said to me, 'This is the table that is before the LORD.'",
      "links": "<a href='/AIV/02/30/1'>Exod. 30:1</a>; <a href='/AIV/58/13/10'>Heb. 13:10</a>",
      "comment": "The wooden altar, called a 'table,' connects to both the altar of incense and, spiritually, to the banquet of the Lamb. The altar as 'table before the LORD' foreshadows the sacrificial meal, the New Covenant’s greater sacrifice (<a href='/AIV/40/26/26-28'>Matt. 26:26-28</a>)."
    },
    {
      "pk": 33041023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 23,
      "text": "Both the temple and the sanctuary had double doors.",
      "links": "<a href='/AIV/11/6/34'>1 Kgs. 6:34</a>",
      "comment": "Double doors indicate solemnity and the dignity with which one must approach the holy mysteries. Entering God’s presence requires passing through thresholds of purification."
    },
    {
      "pk": 33041024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 24,
      "text": "Each of the doors had two panels, two swinging panels; two panels for one door, and two panels for the other.",
      "links": "<a href='/AIV/11/6/34-35'>1 Kgs. 6:34-35</a>",
      "comment": "The attention to detail in the temple furnishings teaches that the exterior forms and decorum are important in worship, as they direct minds and hearts toward the holy."
    },
    {
      "pk": 33041025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 25,
      "text": "Cherubim and palm trees were carved on the doors of the temple like those carved on the walls. There was also a wooden canopy on the front of the vestibule outside;",
      "links": "<a href='/AIV/11/6/32'>1 Kgs. 6:32</a>",
      "comment": "The theme of cherubim and palms continues, highlighting the temple as heaven’s gate on earth. The canopy (a kind of covering or 'baldachin') bears Eucharistic implications—a shelter over the place of sacrifice."
    },
    {
      "pk": 33041026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 41,
      "verse": 26,
      "text": "There were narrow windows and palm trees on one side and on the other side, on the sides of the vestibule. The side chambers of the temple and the canopies had coverings.",
      "links": "<a href='/AIV/11/6/4-5'>1 Kgs. 6:4-5</a>",
      "comment": "The recurring imagery and physical structure point forward to the sacredness of God’s true sanctuary. The coverings and canopies, setting apart and protecting what is holy, foreshadow the sacramental development of worship, inviting all to deeper reverence and participation in holy mysteries."
    }
  ],
  "translatedAt": "2025-12-24T09:22:05.734Z"
}