{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 29,
  "verses": [
    {
      "pk": 290291,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 1,
      "text": "In the tenth year, in the tenth month, on the twelfth day of the month, the word of the Lord came to me, saying:",
      "links": "<a href='/AIV/26/1/3'>Ezek. 1:3</a>",
      "comment": "The dating here identifies a specific time during the Babylonian exile. Note how Ezekiel’s prophetic ministry continues even in exile, reflecting God’s presence with His people regardless of their location."
    },
    {
      "pk": 290292,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 2,
      "text": "“Son of man, set your face against Pharaoh king of Egypt, and prophesy against him and against all Egypt.",
      "links": "<a href='/AIV/26/25/2'>Ezek. 25:2</a>; <a href='/AIV/26/32/2'>Ezek. 32:2</a>",
      "comment": "Prophecies against foreign nations often remind Israel that God is sovereign over all kingdoms, not just theirs."
    },
    {
      "pk": 290293,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 3,
      "text": "Speak and say, ‘Thus says the Lord God: Behold, I am against you, Pharaoh king of Egypt, the great dragon that lies in the midst of his streams, who says, “My Nile is my own; I made it for myself.”’",
      "links": "<a href='/AIV/23/27/1'>Isa. 27:1</a>; <a href='/AIV/26/32/2'>Ezek. 32:2</a>; <a href='/AIV/2/7/15'>Ex. 7:15</a>",
      "comment": "Pharaoh is likened to a dragon (Hebrew: tannin), symbolizing pride and rebellion. The boast reveals spiritual arrogance, echoing humanity’s tendency to claim sovereignty. Spiritual pride is continually condemned in both Old and New Testaments. See the typology of Leviathan as adversary in <a href='/AIV/23/27/1'>Isaiah 27:1</a>."
    },
    {
      "pk": 290294,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 4,
      "text": "I will put hooks in your jaws and make the fish of your rivers stick to your scales. I will pull you out of the midst of your streams, with all the fish of your rivers sticking to your scales.",
      "links": "<a href='/AIV/26/38/4'>Ezek. 38:4</a>; <a href='/AIV/18/41/1-2'>Job 41:1-2</a>",
      "comment": "Dragging Pharaoh from the Nile represents divine judgment. Note the reversal of fortune—a once powerful ruler humbled, reminiscent of how God humbles the proud throughout salvation history."
    },
    {
      "pk": 290295,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 5,
      "text": "I will leave you in the wilderness, you and all the fish of your rivers. You shall fall on the open field and not be gathered or buried. I have given you as food to the beasts of the earth and to the birds of the sky.",
      "links": "<a href='/AIV/26/32/4'>Ezek. 32:4</a>; <a href='/AIV/19/79/2'>Psalm 79:2</a>",
      "comment": "To be left unburied was a sign of utter disgrace and judgment (<a href='/AIV/26/32/4'>Ezek. 32:4</a>). The imagery here also has eschatological resonance, as final judgment involves those who rebel against God being cast out."
    },
    {
      "pk": 290296,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 6,
      "text": "Then all the inhabitants of Egypt will know that I am the Lord. Because you have been a staff of reed to the house of Israel.",
      "links": "<a href='/AIV/23/36/22-23'>Isaiah 36:6</a>; <a href='/AIV/2/15/2'>Exodus 15:2</a>",
      "comment": "Egypt’s unreliability as an ally is exposed. The phrase 'know that I am the Lord' is a recurring formula emphasizing God’s unique sovereignty and self-revelation to all nations."
    },
    {
      "pk": 290297,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 7,
      "text": "When they grasped you with the hand, you broke and tore all their shoulders; and when they leaned on you, you broke and made all their backs wrenched.",
      "links": "<a href='/AIV/23/36/6'>Isaiah 36:6</a>",
      "comment": "Egypt’s unreliability caused pain and suffering for Israel. God’s people are called to rely not on worldly powers but on Him alone—a theme echoed in Jesus’ teaching (<a href='/AIV/40/6/33'>Matthew 6:33</a>)."
    },
    {
      "pk": 290298,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 8,
      "text": "Therefore thus says the Lord God: Behold, I will bring a sword upon you and will cut off from you man and beast.",
      "links": "<a href='/AIV/26/14/17'>Ezek. 14:17</a>; <a href='/AIV/24/46/25'>Jer. 46:25</a>",
      "comment": "God’s judgment is complete, affecting all living beings. Compare with other prophecies of judgment on Egypt (<a href='/AIV/24/46/25'>Jeremiah 46:25</a>)."
    },
    {
      "pk": 290299,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 9,
      "text": "The land of Egypt will become a desolation and a waste. Then they will know that I am the Lord. Because you said, ‘The Nile is mine, and I have made it,’",
      "links": "<a href='/AIV/26/29/3'>Ezek. 29:3</a>",
      "comment": "Pharaoh’s boast is again condemned. God’s judgment on Egypt fulfills the principle that pride leads to downfall (<a href='/AIV/23/13/11'>Isaiah 13:11</a>)."
    },
    {
      "pk": 290300,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 10,
      "text": "therefore, behold, I am against you and against your streams, and I will make the land of Egypt utterly waste and desolate, from Migdol to Syene, as far as the border of Ethiopia.",
      "links": "<a href='/AIV/24/44/1'>Jeremiah 44:1</a>; <a href='/AIV/26/30/6'>Ezekiel 30:6</a>",
      "comment": "The desolation spans all of Egypt’s territory. The use of place names marks the universal scope of judgment, showing that God’s justice encompasses all nations."
    },
    {
      "pk": 290301,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 11,
      "text": "No human foot will pass through it, nor will any animal foot pass through it. It will remain uninhabited for forty years.",
      "links": "<a href='/AIV/4/14/33'>Numbers 14:33</a>; <a href='/AIV/26/4/6'>Ezekiel 4:6</a>",
      "comment": "Forty years is symbolic of a period of trial and judgment. Compare with Israel’s forty years in the wilderness (<a href='/AIV/4/14/33'>Numbers 14:33</a>), reflecting God’s pattern of purification and restoration."
    },
    {
      "pk": 290302,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 12,
      "text": "I will make the land of Egypt a desolation among desolate lands, and her cities will be laid waste among wasted cities for forty years. I will scatter the Egyptians among the nations and disperse them through the countries.",
      "links": "<a href='/AIV/26/12/15'>Ezekiel 12:15</a>; <a href='/AIV/23/19/17'>Isaiah 19:17</a>",
      "comment": "Scattering among the nations echoes the judgment experienced by Israel themselves, suggesting a theme of universal justice."
    },
    {
      "pk": 290303,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 13,
      "text": "For thus says the Lord God: At the end of forty years I will gather the Egyptians from the peoples among whom they were scattered.",
      "links": "<a href='/AIV/26/37/21'>Ezekiel 37:21</a>",
      "comment": "Restoration after judgment illustrates God’s mercy and faithfulness, a foreshadowing of New Covenant promises in Christ (<a href='/AIV/43/11/52'>John 11:52</a>)."
    },
    {
      "pk": 290304,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 14,
      "text": "I will restore the fortunes of Egypt and bring them back to the land of Pathros, to the land of their origin, and there they shall be a lowly kingdom.",
      "links": "<a href='/AIV/24/46/26'>Jeremiah 46:26</a>",
      "comment": "Egypt is restored, but as a lowly kingdom. God’s mercy is shown, but prideful self-exaltation is not restored. The pattern reflects the Gospel’s promise—restoration comes through humility and God’s grace."
    },
    {
      "pk": 290305,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 15,
      "text": "It will be the least of the kingdoms and never again exalt itself above the nations. I will make them so small that they will not rule over the nations.",
      "links": "<a href='/AIV/26/17/14'>Ezekiel 17:14</a>",
      "comment": "Egypt’s power is permanently diminished. God humbles the exalted and exalts the humble (<a href='/AIV/42/1/52'>Luke 1:52</a>), fundamental in Christ’s teaching."
    },
    {
      "pk": 290306,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 16,
      "text": "And it shall never again be the confidence of the house of Israel, reminding them of their iniquity when they turned to Egypt for help. Then they will know that I am the Lord GOD.”",
      "links": "<a href='/AIV/23/30/2'>Isaiah 30:2</a>; <a href='/AIV/26/6/7'>Ezekiel 6:7</a>",
      "comment": "Israel is warned against trusting foreign powers. These verses have spiritual significance—faith and trust belong to God alone, a principle consistently called for in the apostolic tradition."
    },
    {
      "pk": 290307,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 17,
      "text": "In the twenty-seventh year, in the first month, on the first day of the month, the word of the Lord came to me, saying:",
      "links": "<a href='/AIV/26/29/1'>Ezekiel 29:1</a>",
      "comment": "A new prophecy, dated much later. The precision of these dates underscores the historical reliability and importance of God’s revealed word (<a href='/AIV/42/1/3'>Luke 1:3</a>)."
    },
    {
      "pk": 290308,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 18,
      "text": "“Son of man, Nebuchadnezzar king of Babylon made his army labor hard against Tyre. Every head was made bald and every shoulder rubbed raw, yet he nor his army received wages from Tyre for the labor he performed against it.",
      "links": "<a href='/AIV/24/27/6-7'>Jeremiah 27:6-7</a>",
      "comment": "Nebuchadnezzar’s conquests unfulfilled illustrate the sovereignty of God over world affairs. God rewards obedience and effort according to His purpose."
    },
    {
      "pk": 290309,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 19,
      "text": "Therefore thus says the Lord God: Behold, I will give the land of Egypt to Nebuchadnezzar king of Babylon, and he shall carry off her wealth and take her spoil and seize her plunder; and it will be the wages for his army.",
      "links": "<a href='/AIV/24/43/10'>Jeremiah 43:10</a>; <a href='/AIV/26/30/10'>Ezekiel 30:10</a>",
      "comment": "Egypt is given to Babylon as a form of ‘payment’ for Nebuchadnezzar’s labor. This demonstrates that God is the true arbiter of history."
    },
    {
      "pk": 290310,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 20,
      "text": "I have given him the land of Egypt as his wages, because he worked for me, declares the Lord GOD.",
      "links": "<a href='/AIV/24/25/9'>Jeremiah 25:9</a>",
      "comment": "God uses pagan rulers for His own purposes. Spiritual authority comes from God alone, and all rulers are subject to His order, a theme carried into the New Testament epistles (<a href='/AIV/45/13/1'>Romans 13:1</a>)."
    },
    {
      "pk": 290311,
      "translation": "AIV",
      "book": 26,
      "chapter": 29,
      "verse": 21,
      "text": "On that day I will make a horn sprout for the house of Israel, and I will open your mouth among them. Then they will know that I am the Lord.”",
      "links": "<a href='/AIV/19/132/17'>Psalm 132:17</a>; <a href='/AIV/42/1/69'>Luke 1:69</a>",
      "comment": "The ‘horn’ symbolizes strength and kingship—ultimately pointing to the promise of the Messiah, fulfilled in Jesus (<a href='/AIV/42/1/69'>Luke 1:69</a>). This prophecy is both literal and spiritual, as God reestablishes His people and speaks through His prophets, culminating in Christ’s own authority and kingship."
    }
  ],
  "translatedAt": "2025-12-23T07:01:47.167Z"
}