{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 11,
  "verses": [
    {
      "pk": 33011001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 1,
      "text": "The Spirit lifted me up and brought me to the east gate of the LORD’s house, which faces east. And at the entrance were twenty-five men. Among them I saw Jaazaniah son of Azzur and Pelatiah son of Benaiah, leaders of the people.",
      "links": "<a href='/AIV/26/8/16'>Ezek. 8:16</a>; <a href='/AIV/26/9/3'>Ezek. 9:3</a>",
      "comment": "Ezekiel is granted a visionary experience by the Spirit, similar to previous encounters (Ezek. 8:16). The gate refers to a key position of authority. The calling out of specific leaders shows God’s precision in judging those in charge."
    },
    {
      "pk": 33011002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 2,
      "text": "And He said to me, 'Son of man, these are the men who plot evil and give wicked advice in this city.'",
      "links": "<a href='/AIV/26/8/17'>Ezek. 8:17</a>; <a href='/AIV/19/2/1-2'>Ps. 2:1-2</a>",
      "comment": "God exposes the hearts and intentions of Israel’s leaders, paralleling Psalm 2’s opposition to the Lord’s anointed. This underscores the seriousness of leadership and advice in guiding God’s people."
    },
    {
      "pk": 33011003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 3,
      "text": "They say, ‘It is not the time to build houses. This city is the pot, and we are the meat.’",
      "links": "<a href='/AIV/26/24/3'>Ezek. 24:3</a>",
      "comment": "The leaders give false confidence, likening themselves to protected meat cooking inside a strong pot. Later, this metaphor is used to show the coming judgment is inescapable (Ezek. 24:3)."
    },
    {
      "pk": 33011004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 4,
      "text": "Therefore, prophesy against them. Prophesy, son of man.'",
      "links": "<a href='/AIV/26/2/1'>Ezek. 2:1</a>",
      "comment": "Ezekiel is commanded to speak directly against the leaders’ deception, showing the prophetic task is divinely authorized."
    },
    {
      "pk": 33011005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 5,
      "text": "The Spirit of the LORD fell upon me, and He said to me, 'Say, Thus says the LORD: This is what you think, O house of Israel, and I know what goes through your minds.'",
      "links": "<a href='/AIV/26/2/2'>Ezek. 2:2</a>; <a href='/AIV/19/139/1-4'>Ps. 139:1-4</a>",
      "comment": "God knows internal thoughts, echoing passages like Psalm 139. The Spirit’s active role here highlights both inspiration and spiritual authority."
    },
    {
      "pk": 33011006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 6,
      "text": "You have multiplied your slain in this city and filled its streets with the dead.",
      "links": "<a href='/AIV/23/1/15'>Isa. 1:15</a>; <a href='/AIV/26/7/23'>Ezek. 7:23</a>",
      "comment": "The leaders’ guilt is pronounced. Their lack of care for life is part of the cause for judgment (Isa. 1:15, Ezek. 7:23)."
    },
    {
      "pk": 33011007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 7,
      "text": "Therefore this is what the Lord GOD says: The slain whom you have laid in the city are the meat, and this city is the pot; but I will drive you out of it.",
      "links": "<a href='/AIV/26/24/6'>Ezek. 24:6</a>",
      "comment": "God turns the false metaphor against them. The slain are the 'meat,' but the leaders will be cast out, not protected."
    },
    {
      "pk": 33011008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 8,
      "text": "You have feared the sword, and I will bring the sword upon you, declares the Lord GOD.",
      "links": "<a href='/AIV/26/21/3-5'>Ezek. 21:3-5</a>",
      "comment": "Their fear of judgment will become reality, as God brings the consequences of their deeds upon them (Ezek. 21:3-5)."
    },
    {
      "pk": 33011009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 9,
      "text": "I will drive you out of the city and deliver you into the hands of foreigners, and execute judgments against you.",
      "links": "<a href='/AIV/26/12/14'>Ezek. 12:14</a>; <a href='/AIV/28/7/16'>Hos. 7:16</a>",
      "comment": "God’s judgment includes exile and foreign domination, which is a fulfillment of covenant curses (Deut. 28:49-50, cf. Ezek. 12:14)."
    },
    {
      "pk": 33011010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 10,
      "text": "You will fall by the sword. I will judge you at the border of Israel, and you shall know that I am the LORD.",
      "links": "<a href='/AIV/26/6/7'>Ezek. 6:7</a>; <a href='/AIV/26/7/27'>Ezek. 7:27</a>",
      "comment": "Judgment at the border shows the seriousness of God’s justice and sovereignty, and the recurring aim is that the people recognize God’s lordship."
    },
    {
      "pk": 33011011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 11,
      "text": "This city will not be a pot for you, nor shall you be meat within it. I will judge you at the border of Israel.",
      "links": "<a href='/AIV/26/24/7-8'>Ezek. 24:7-8</a>",
      "comment": "The leaders will not have refuge in Jerusalem; God’s judgment reaches even to the borders, showing the fullness of His justice."
    },
    {
      "pk": 33011012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 12,
      "text": "You will know that I am the LORD, for you have not walked in My statutes nor obeyed My judgments, but have acted according to the laws of the nations around you.",
      "links": "<a href='/AIV/03/18/3-5'>Lev. 18:3-5</a>; <a href='/AIV/05/28/15'>Deut. 28:15</a>",
      "comment": "The root of Israel’s punishment is their rejection of God’s law and imitation of pagan practices. This is a key message throughout the prophets and highlights the need for faithfulness to divine commandments."
    },
    {
      "pk": 33011013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 13,
      "text": "As I prophesied, Pelatiah son of Benaiah died. Then I fell facedown and cried out with a loud voice, ‘O Lord GOD, will You bring to an end the remnant of Israel?’",
      "links": "<a href='/AIV/26/9/8'>Ezek. 9:8</a>",
      "comment": "The immediate death of Pelatiah is a supernatural sign confirming Ezekiel’s word. Ezekiel’s intercession resembles Moses’ and points to the importance of mediation for the people (cf. 9:8, Num. 14:19-20)."
    },
    {
      "pk": 33011014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 14,
      "text": "Then the word of the LORD came to me, saying:",
      "links": "",
      "comment": "A new oracle begins, signaled by the direct speech formula used by prophets."
    },
    {
      "pk": 33011015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 15,
      "text": "'Son of man, your brothers, namely your relatives, and the whole house of Israel, all of them, are those to whom the inhabitants of Jerusalem have said, “Keep far from the LORD; the land is given to us as possession.”'",
      "links": "<a href='/AIV/26/5/5'>Ezek. 5:5</a>; <a href='/AIV/01/50/23'>Gen. 50:23</a>",
      "comment": "God addresses the spiritual arrogance of those left behind, who claimed exclusive rights to the land."
    },
    {
      "pk": 33011016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 16,
      "text": "Therefore say, “Thus says the Lord GOD: Though I have removed them far among the nations, and though I have scattered them among the countries, yet I have been a sanctuary to them for a little while in the countries where they have gone.”",
      "links": "<a href='/AIV/19/90/1'>Ps. 90:1</a>; <a href='/AIV/26/6/8'>Ezek. 6:8</a>",
      "comment": "Even in dispersion, God’s presence abides with His people, an early picture of God’s presence beyond physical boundaries. This foreshadows the later vision of a renewed sanctuary."
    },
    {
      "pk": 33011017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 17,
      "text": "Therefore say, ‘Thus says the Lord GOD: I will gather you from the peoples and assemble you from the countries where you have been scattered, and I will give you the land of Israel.’",
      "links": "<a href='/AIV/26/28/25'>Ezek. 28:25</a>; <a href='/AIV/24/32/37'>Jer. 32:37</a>",
      "comment": "God promises restoration and homecoming, showing His faithfulness to covenant and mercy."
    },
    {
      "pk": 33011018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 18,
      "text": "And when they come there, they will remove from it all its detestable things and all its abominations.",
      "links": "<a href='/AIV/26/36/25'>Ezek. 36:25</a>",
      "comment": "Restoration involves both return and purification, similar to future visions echoed in Ezekiel 36:25 and ultimately fulfilled spiritually in the New Covenant."
    },
    {
      "pk": 33011019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 19,
      "text": "And I will give them one heart, and I will put a new spirit in them. I will remove the heart of stone from their flesh and give them a heart of flesh.",
      "links": "<a href='/AIV/26/36/26'>Ezek. 36:26</a>; <a href='/AIV/24/31/33'>Jer. 31:33</a>; <a href='/AIV/43/7/39'>John 7:39</a>",
      "comment": "This transformative promise foreshadows the renewal accomplished by the Holy Spirit in the New Covenant, fulfilled in Christ (Jer. 31:33, John 7:39). Literal and spiritual interpretations harmonize here, showing God’s plan for inner conversion and unity among His people."
    },
    {
      "pk": 33011020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 20,
      "text": "So that they may walk in My statutes and keep My rules and obey them. They shall be My people, and I will be their God.",
      "links": "<a href='/AIV/24/24/7'>Jer. 24:7</a>; <a href='/AIV/26/37/27'>Ezek. 37:27</a>; <a href='/AIV/47/6/16'>2 Cor. 6:16</a>",
      "comment": "Obedience is the fruit of God’s renewing work. The repeated covenant formula points to ultimate fulfillment in the one, universal church as God’s dwelling (2 Cor. 6:16)."
    },
    {
      "pk": 33011021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 21,
      "text": "But as for those whose hearts go after their detestable things and abominations, I will bring their deeds upon their own heads, declares the Lord GOD.",
      "links": "<a href='/AIV/26/16/43'>Ezek. 16:43</a>; <a href='/AIV/62/1/8'>1 John 1:8'</a>",
      "comment": "Judgment remains for those who reject God. The link to personal responsibility and divine justice anticipates biblical teachings on final judgment."
    },
    {
      "pk": 33011022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 22,
      "text": "Then the cherubim lifted up their wings, and the wheels beside them; and the glory of the God of Israel was above them.",
      "links": "<a href='/AIV/26/10/19'>Ezek. 10:19</a>",
      "comment": "The vision of God’s glory departing mirrors the earlier scene in Ezekiel 10. It signals both judgment and hope: God's glory would eventually return in a new way (cf. Ezek. 43)."
    },
    {
      "pk": 33011023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 23,
      "text": "And the glory of the LORD went up from the midst of the city and stood on the mountain east of the city.",
      "links": "<a href='/AIV/38/14/4'>Zech. 14:4</a>; <a href='/AIV/26/43/2'>Ezek. 43:2</a>",
      "comment": "The presence of God leaves Jerusalem, foreshadowing the mountain imagery later associated with messianic expectation (Zech. 14:4) and also Christ's own ascension from the Mount of Olives (Acts 1:12)."
    },
    {
      "pk": 33011024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 24,
      "text": "Then the Spirit lifted me up and brought me back in vision by the Spirit of God to Chaldea, to the exiles. And the vision that I had seen went up from me.",
      "links": "<a href='/AIV/26/3/14'>Ezek. 3:14</a>; <a href='/AIV/26/8/3'>Ezek. 8:3</a>",
      "comment": "Ezekiel’s supernatural travel and restoration to the exiled community demonstrates the reality and power of God’s Spirit to bring revelation and guidance."
    },
    {
      "pk": 33011025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 11,
      "verse": 25,
      "text": "And I told the exiles all the things that the LORD had shown me.",
      "links": "<a href='/AIV/26/3/18'>Ezek. 3:18</a>",
      "comment": "Proclamation to the exiles reveals the prophetic call to teach and encourage the faithful, prefiguring the ongoing ministry of authoritative teaching in the Church. The act of sharing the vision is itself an example of obedience and pastoral care."
    }
  ],
  "translatedAt": "2025-12-24T09:03:30.198Z"
}