{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 16,
  "verses": [
    {
      "pk": 4016001,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 1,
      "text": "And the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/6/1'>Ezek. 6:1</a>",
      "comment": "Ezekiel consistently records God’s direct messages, indicating prophetic authority."
    },
    {
      "pk": 4016002,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 2,
      "text": "Son of man, confront Jerusalem with her abominations",
      "links": "<a href='/AIV/26/5/5'>Ezek. 5:5</a>",
      "comment": "God calls Ezekiel to publicly expose Jerusalem’s sins, emphasizing the seriousness of covenant violation."
    },
    {
      "pk": 4016003,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 3,
      "text": "and say, ‘This is what the Lord GOD says to Jerusalem: Your origin and your birth are from the land of the Canaanites; your father was an Amorite and your mother a Hittite.",
      "links": "<a href='/AIV/6/10/6'>Josh. 10:6</a>; <a href='/AIV/26/21/30'>Ezek. 21:30</a>",
      "comment": "Jerusalem’s spiritual ancestry is portrayed as pagan to highlight her spiritual unfaithfulness."
    },
    {
      "pk": 4016004,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 4,
      "text": "As for your birth—on the day you were born, your cord was not cut, you were not washed with water to cleanse you, nor were you rubbed with salt or wrapped in cloths.",
      "links": "<a href='/AIV/20/30/11'>Prov. 30:11</a>",
      "comment": "Details evoke ancient childbirth customs, symbolizing neglect and lack of care (spiritual helplessness)."
    },
    {
      "pk": 4016005,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 5,
      "text": "No eye pitied you to do any of these things for you out of compassion, but you were thrown out into the open field, because you were despised on the day you were born.",
      "links": "<a href='/AIV/19/27/10'>Ps. 27:10</a>",
      "comment": "Jerusalem’s rejection at birth foreshadows God’s rescue and elevation out of abandonment."
    },
    {
      "pk": 4016006,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 6,
      "text": "Then I passed by you and saw you wallowing in your blood, and I said to you as you lay in your blood, ‘Live!’ I said to you, ‘Live!’",
      "links": "<a href='/AIV/19/71/20'>Ps. 71:20</a>",
      "comment": "God’s life-giving intervention represents divine grace and unfathomable mercy. The repetition stresses the effective power of God's Word to create spiritual life."
    },
    {
      "pk": 4016007,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 7,
      "text": "I made you grow like a plant in the field. You grew up and became tall and reached full beauty. Your breasts were formed, and your hair had grown, but you were still naked and bare.",
      "links": "<a href='/AIV/19/144/12'>Ps. 144:12</a>",
      "comment": "The growth imagery refers to Israel’s development from infancy to maturity, yet still in need of protection."
    },
    {
      "pk": 4016008,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 8,
      "text": "When I passed by you again and saw you, behold, you were at the age for love. I spread the edge of my garment over you and covered your nakedness. I declared to you my oath and entered into a covenant with you, declares the Lord GOD, and you became mine.",
      "links": "<a href='/AIV/8/3/9'>Ruth 3:9</a>; <a href='/AIV/2/24/7-8'>Ex. 24:7–8</a>",
      "comment": "God’s covenant as an act of marriage establishes Jerusalem as uniquely chosen, pointing to the enduring nature of God’s promises."
    },
    {
      "pk": 4016009,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 9,
      "text": "Then I washed you with water, cleansed you of your blood, and anointed you with oil.",
      "links": "<a href='/AIV/19/23/5'>Ps. 23:5</a>; <a href='/AIV/45/6/3'>Rom. 6:3</a>",
      "comment": "Washing and anointing symbolize the grace bestowed in spiritual adoption and purification (foreshadow’s spiritual rebirth)."
    },
    {
      "pk": 4016010,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 10,
      "text": "I clothed you with embroidered cloth and gave you fine leather sandals. I wrapped you in fine linen and covered you with silk.",
      "links": "<a href='/AIV/2/28/39'>Ex. 28:39</a>",
      "comment": "Signs of royal status, cloths represent the dignity granted to the people by God."
    },
    {
      "pk": 4016011,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 11,
      "text": "I adorned you with jewelry: I put bracelets on your wrists and a necklace around your neck.",
      "links": "<a href='/AIV/1/24/22'>Gen. 24:22</a>",
      "comment": "Jewelry connotes marital union and the gifts God bestows on His chosen."
    },
    {
      "pk": 4016012,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 12,
      "text": "And I put a ring in your nose, earrings in your ears, and a beautiful crown on your head.",
      "links": "<a href='/AIV/19/103/4'>Ps. 103:4</a>",
      "comment": "Imagery continues to build upon Jerusalem’s elevation to regal status, reminiscent of the bride in Song of Songs."
    },
    {
      "pk": 4016013,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 13,
      "text": "Thus you were adorned with gold and silver, and your clothing was of fine linen, silk, and embroidered cloth. You ate fine flour, honey, and oil. You became very beautiful and advanced to regal stature.",
      "links": "<a href='/AIV/11/10/5'>1 Kings 10:5</a>",
      "comment": "God provides not just for needs, but lavishes abundance and splendor, highlighting His generosity."
    },
    {
      "pk": 4016014,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 14,
      "text": "And your fame spread among nations because of your beauty, for it was perfect through my glory which I placed upon you, declares the Lord GOD.",
      "links": "<a href='/AIV/19/45/11'>Ps. 45:11</a>",
      "comment": "God is the source of true beauty and honor; the people’s glory is derivative of His presence."
    },
    {
      "pk": 4016015,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 15,
      "text": "But you trusted in your beauty and used your fame to act like a prostitute. You lavished your sexual favors on anyone passing by; you became his.",
      "links": "<a href='/AIV/28/1/2'>Hosea 1:2</a>",
      "comment": "The metaphor shifts to infidelity, spiritual disloyalty through idolatry and alliances, consistent with prophetic teaching of spiritual adultery."
    },
    {
      "pk": 4016016,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 16,
      "text": "You took some of your garments and made colorful high places, and on them you played the prostitute; such things should not happen nor ever occur.",
      "links": "<a href='/AIV/3/17/7'>Lev. 17:7</a>",
      "comment": "‘High places’ are linked with idolatrous worship; misuse of God’s gifts involves desecration."
    },
    {
      "pk": 4016017,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 17,
      "text": "You also took your beautiful jewelry, made of my gold and my silver, which I had given to you, and made images of men, and with them you played the prostitute.",
      "links": "<a href='/AIV/2/32/2-4'>Ex. 32:2–4</a>",
      "comment": "Material intended for worship and dignity is redirected to idolatry, paralleling the golden calf incident."
    },
    {
      "pk": 4016018,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 18,
      "text": "You took your embroidered clothes to cover them, and set my oil and incense before them.",
      "links": "<a href='/AIV/23/1/13'>Isa. 1:13</a>",
      "comment": "Priestly symbols of devotion are misapplied to idols, indicating a deep spiritual corruption."
    },
    {
      "pk": 4016019,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 19,
      "text": "Also my food which I gave you—the fine flour, oil, and honey with which I fed you—you offered before them as a pleasant aroma. That is what happened, declares the Lord GOD.",
      "links": "<a href='/AIV/3/2/2'>Lev. 2:2</a>",
      "comment": "Offerings intended for God are redirected in idolatrous worship, deepening the betrayal."
    },
    {
      "pk": 4016020,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 20,
      "text": "You took your sons and your daughters whom you bore to me, and these you sacrificed to them to be devoured. Was your prostitution so trivial,",
      "links": "<a href='/AIV/19/106/37-38'>Ps. 106:37–38</a>",
      "comment": "Shows the gravity of child sacrifice, highlighting violation of covenantal relationship."
    },
    {
      "pk": 4016021,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 21,
      "text": "that you slaughtered my children and offered them up to idols, as food?",
      "links": "<a href='/AIV/3/18/21'>Lev. 18:21</a>; <a href='/AIV/19/106/37'>Ps. 106:37</a>",
      "comment": "Emphasizes God’s claim over children and the ultimate evil of sacrificing them to false gods."
    },
    {
      "pk": 4016022,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 22,
      "text": "And in all your abominations and prostitution, you did not remember the days of your youth, when you were naked and bare, wallowing in your blood.",
      "links": "<a href='/AIV/26/16/4-6'>Ezek. 16:4–6</a>",
      "comment": "Forgetting God’s past mercy and deliverance commonly leads to spiritual pride and apostasy."
    },
    {
      "pk": 4016023,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 23,
      "text": "After all your wickedness—woe, woe to you! declares the Lord GOD—",
      "links": "<a href='/AIV/26/24/6'>Ezek. 24:6</a>",
      "comment": "The double ‘woe’ amplifies God’s grief and anger over persistent sin."
    },
    {
      "pk": 4016024,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 24,
      "text": "you built for yourself a mound and a high place in every square.",
      "links": "<a href='/AIV/12/17/9'>2 Kings 17:9</a>",
      "comment": "Wide proliferation of idolatry signifies the depth of spiritual decline."
    },
    {
      "pk": 4016025,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 25,
      "text": "At every street corner you made your high place and degraded your beauty, spreading your legs to everyone passing by, and multiplied your prostitution.",
      "links": "<a href='/AIV/24/2/20'>Jer. 2:20</a>",
      "comment": "Sexualized idolatry language continues, serving as a stark metaphor for apostasy."
    },
    {
      "pk": 4016026,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 26,
      "text": "You also played the prostitute with the Egyptians, your lustful neighbors, and multiplied your prostitution, provoking me to anger.",
      "links": "<a href='/AIV/24/2/18'>Jer. 2:18</a>",
      "comment": "Political alliances with Egypt symbolized by harlotry, showing compromise with pagan nations."
    },
    {
      "pk": 4016027,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 27,
      "text": "So I stretched out my hand against you, limited your food supply, and delivered you up to the desire of those who hated you, the daughters of the Philistines who were ashamed of your lewd ways.",
      "links": "<a href='/AIV/26/5/8'>Ezek. 5:8</a>",
      "comment": "Punishment via famine and oppression reveals God’s jealous protection of the covenant and righteous judgment."
    },
    {
      "pk": 4016028,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 28,
      "text": "You played the prostitute with the Assyrians because you were insatiably lustful; even then you were not satisfied.",
      "links": "<a href='/AIV/28/5/13'>Hosea 5:13</a>",
      "comment": "Diplomatic dependency on Assyria is spiritually condemned, continuing the theme of unsatisfied idolatry."
    },
    {
      "pk": 4016029,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 29,
      "text": "You multiplied your prostitution with Chaldea, the land of merchants, but even with this you were not satisfied.",
      "links": "<a href='/AIV/26/23/14-16'>Ezek. 23:14–16</a>",
      "comment": "Israel’s repeated running after foreign powers visualizes spiritual emptiness apart from God."
    },
    {
      "pk": 4016030,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 30,
      "text": "How sick is your heart, declares the Lord GOD, after doing all these things, the deeds of a brazen prostitute?",
      "links": "<a href='/AIV/19/78/8'>Ps. 78:8</a>",
      "comment": "Spiritual sickness is referenced by heart condition, connecting physical and spiritual realities."
    },
    {
      "pk": 4016031,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 31,
      "text": "When you built your mound at every street and made your high place in every square, you were not like a prostitute because you scorned payment.",
      "links": "<a href='/AIV/26/16/24-25'>Ezek. 16:24–25</a>",
      "comment": "Jerusalem is more shameless than a prostitute; she seeks illicit liaisons without reward."
    },
    {
      "pk": 4016032,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 32,
      "text": "Adulterous wife, who receives strangers instead of her husband!",
      "links": "<a href='/AIV/19/106/39'>Ps. 106:39</a>",
      "comment": "Returns to the marital imagery, highlighting infidelity to the covenant with God."
    },
    {
      "pk": 4016033,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 33,
      "text": "Men give gifts to all prostitutes, but you give your gifts to all your lovers and bribe them to come to you from everywhere for your prostitution.",
      "links": "<a href='/AIV/28/8/9'>Hosea 8:9'>Hosea 8:9</a>",
      "comment": "Israel’s idolatry is so extreme she reverses the natural order by bribing others to sin rather than profit from it."
    },
    {
      "pk": 4016034,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 34,
      "text": "So you were different from other women in your prostitution. No one ran after you for payment; instead, you paid your lovers, and so you were the opposite.",
      "links": "<a href='/AIV/26/23/42'>Ezek. 23:42</a>",
      "comment": "Israel’s ‘opposite’ prostitution establishes the extremity and uniqueness of her covenant violation."
    },
    {
      "pk": 4016035,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 35,
      "text": "Therefore, O prostitute, hear the word of the LORD:",
      "links": "<a href='/AIV/28/2/2'>Hosea 2:2</a>",
      "comment": "The direct divine address emphasizes judgment but also the possibility of restoration to covenant."
    },
    {
      "pk": 4016036,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 36,
      "text": "This is what the Lord GOD says: Because your filth was poured out and your nakedness uncovered in your prostitution with your lovers, and because of all the idols of your abominations and the blood of your children whom you sacrificed to them,",
      "links": "<a href='/AIV/2/20/3'>Ex. 20:3</a>",
      "comment": "Judgment arises from repeated idolatry and child sacrifice that violate the first commandments."
    },
    {
      "pk": 4016037,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 37,
      "text": "therefore, I will gather all your lovers—those you pleased and all those you hated— I will gather them against you from every side and expose your nakedness to them so they all may see.",
      "links": "<a href='/AIV/25/2/14'>Lam. 2:14</a>",
      "comment": "Enemies as instruments of judgment—a motif seen throughout prophetic literature."
    },
    {
      "pk": 4016038,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 38,
      "text": "And I will judge you as women who commit adultery and shed blood are judged, and I will bring down upon you the blood of wrath and jealousy.",
      "links": "<a href='/AIV/3/20/10'>Lev. 20:10</a>",
      "comment": "Adultery and murder in the Law require severe judgment—here applied to the nation’s apostasy."
    },
    {
      "pk": 4016039,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 39,
      "text": "I will hand you over to them, and they shall tear down your mounds and break down your high places. They shall strip you of your clothes, take your fine jewelry, and leave you naked and bare.",
      "links": "<a href='/AIV/28/2/3'>Hosea 2:3</a>",
      "comment": "God’s judgment strips away all outward signs of blessing, returning Jerusalem to its original state of exposure."
    },
    {
      "pk": 4016040,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 40,
      "text": "They shall bring up a crowd against you and stone you and cut you to pieces with their swords.",
      "links": "<a href='/AIV/26/23/47'>Ezek. 23:47</a>",
      "comment": "Public punishment for adultery is executed by the hostile nations."
    },
    {
      "pk": 4016041,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 41,
      "text": "They shall burn your houses and carry out judgments on you in the sight of many women. I will make you stop your prostitution, and you shall no longer pay your lovers.",
      "links": "<a href='/AIV/26/23/29'>Ezek. 23:29</a>",
      "comment": "Judgment leads at last to the end of public sin and idolatrous alliances."
    },
    {
      "pk": 4016042,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 42,
      "text": "So I will satisfy my wrath against you, and my jealousy will depart from you. Then I will be calm and no longer angry.",
      "links": "<a href='/AIV/19/78/38'>Ps. 78:38</a>",
      "comment": "The cooling of divine anger hints at the restoration after judgment, in line with other passages of repentance and mercy."
    },
    {
      "pk": 4016043,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 43,
      "text": "Because you did not remember the days of your youth but provoked me to anger with all these things, behold, I will bring your way back upon your own head, declares the Lord GOD. Have you not committed lewdness in addition to all your abominations?",
      "links": "<a href='/AIV/26/7/3'>Ezek. 7:3</a>",
      "comment": "Consequences are fitting; a reversal of fortune for forgetfulness and rebellion."
    },
    {
      "pk": 4016044,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 44,
      "text": "Behold, everyone who uses proverbs will speak against you, saying, ‘Like mother, like daughter.’",
      "links": "<a href='/AIV/24/31/29'>Jer. 31:29</a>",
      "comment": "The proverb imparts worsened infamy; Israel now the example of moral degeneration to others."
    },
    {
      "pk": 4016045,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 45,
      "text": "You are the daughter of your mother, who despised her husband and her children. You are the sister of your sisters, who despised their husbands and children. Your mother was a Hittite and your father an Amorite.",
      "links": "<a href='/AIV/26/16/3'>Ezek. 16:3</a>",
      "comment": "Reiterates pagan spiritual ancestry, contrasting with the pure relationship God designed."
    },
    {
      "pk": 4016046,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 46,
      "text": "Your elder sister is Samaria, who lived with her daughters to the north of you; and your younger sister, who lived to the south of you, is Sodom with her daughters.",
      "links": "<a href='/AIV/1/19/24-25'>Gen. 19:24–25</a>",
      "comment": "Positioning Jerusalem between Samaria and Sodom, two infamous cities, for dramatic effect and warning."
    },
    {
      "pk": 4016047,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 47,
      "text": "Not only did you walk in their ways and commit their abominations, but in a very little time you became more corrupt than they in all your ways.",
      "links": "<a href='/AIV/26/5/7'>Ezek. 5:7</a>",
      "comment": "Jerusalem exceeded even Sodom’s and Samaria’s wickedness; corruption escalates with greater privilege and responsibility."
    },
    {
      "pk": 4016048,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 48,
      "text": "As I live, declares the Lord GOD, your sister Sodom and her daughters have not done as you and your daughters have done.",
      "links": "<a href='/AIV/1/18/20'>Gen. 18:20</a>",
      "comment": "God swears by His own life, emphasizing the gravity of Jerusalem’s unparalleled sin."
    },
    {
      "pk": 4016049,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 49,
      "text": "Behold, this was the guilt of your sister Sodom: pride, abundance of food, and prosperous ease, but she did not aid the poor and needy.",
      "links": "<a href='/AIV/23/58/7'>Isa. 58:7</a>",
      "comment": "Sodom’s sin is social neglect and pride, expanding the traditional understanding beyond sexual immorality."
    },
    {
      "pk": 4016050,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 50,
      "text": "They were haughty and did detestable things before me, so I removed them when I saw it.",
      "links": "<a href='/AIV/1/19/13'>Gen. 19:13</a>",
      "comment": "God’s intervention in Sodom’s destruction highlights divine justice against persistent evil."
    },
    {
      "pk": 4016051,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 51,
      "text": "Samaria did not commit half of your sins. You have committed more abominations than they and have made your sisters appear righteous by all the abominations you have done.",
      "links": "<a href='/AIV/26/23/11'>Ezek. 23:11</a>",
      "comment": "Jerusalem’s guilt is so great it makes those who came before her look comparatively innocent."
    },
    {
      "pk": 4016052,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 52,
      "text": "Bear your disgrace, because you have made a case for your sisters. Because your sins were more detestable, they appear righteous compared to you. So be ashamed and bear your disgrace, because you have justified your sisters.",
      "links": "<a href='/AIV/26/16/54'>Ezek. 16:54</a>",
      "comment": "‘Justifying’ by comparison underscores the seriousness of absolute calling to holiness."
    },
    {
      "pk": 4016053,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 53,
      "text": "But I will restore their fortunes—the fortunes of Sodom and her daughters, and Samaria and her daughters, and your fortunes along with theirs—",
      "links": "<a href='/AIV/26/47/22-23'>Ezek. 47:22–23</a>",
      "comment": "Hint of divine mercy and forgiveness extended even to notorious sinners, pointing forward to a renewal beyond strict justice."
    },
    {
      "pk": 4016054,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 54,
      "text": "in order that you may bear your disgrace and be ashamed of all you have done, giving comfort to them.",
      "links": "<a href='/AIV/26/36/32'>Ezek. 36:32</a>",
      "comment": "Restoration humbles, brings repentance and deepens communal bonds among all brought back."
    },
    {
      "pk": 4016055,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 55,
      "text": "Your sisters, Sodom and her daughters, Samaria and her daughters, will return to their former state, and you and your daughters will return to your former state.",
      "links": "<a href='/AIV/26/16/53'>Ezek. 16:53</a>",
      "comment": "‘Return’ indicates a reversal of judgment; restoration signals hope, echoing God’s faithfulness despite past rebellion."
    },
    {
      "pk": 4016056,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 56,
      "text": "Did not your sister Sodom become an object of scorn for you in the day of your pride,",
      "links": "<a href='/AIV/23/13/19'>Isa. 13:19</a>",
      "comment": "Recalls attitude toward Sodom before falling into similar, then worse, sin."
    },
    {
      "pk": 4016057,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 57,
      "text": "before your wickedness was exposed? Now you have become an object of ridicule for the daughters of Edom and all her neighbors, and for the daughters of the Philistines—those all around you who despise you.",
      "links": "<a href='/AIV/19/79/4'>Ps. 79:4</a>",
      "comment": "Reversal and humiliation; those once despised now become judges."
    },
    {
      "pk": 4016058,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 58,
      "text": "You must bear the penalty of your lewdness and your abominations, declares the LORD.",
      "links": "<a href='/AIV/26/7/4'>Ezek. 7:4</a>",
      "comment": "Justice is served; the penalty highlights the seriousness of sin."
    },
    {
      "pk": 4016059,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 59,
      "text": "For this is what the Lord GOD says: I will deal with you as you have done, you who despised your oath by breaking the covenant.",
      "links": "<a href='/AIV/26/17/19'>Ezek. 17:19</a>",
      "comment": "Emphasizes the binding nature of God’s oath and the consequences of breaking sacred covenant promises."
    },
    {
      "pk": 4016060,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 60,
      "text": "Yet I will remember my covenant with you in the days of your youth, and I will establish an everlasting covenant with you.",
      "links": "<a href='/AIV/1/9/16'>Gen. 9:16</a>; <a href='/AIV/24/31/31-34'>Jer. 31:31–34</a>",
      "comment": "Here the prophetic text pivots to hope; God’s chosen people are not abandoned, but restored through an eternal covenant. This is a foreshadowing of the new covenant established through Christ (see Luke 22:20)."
    },
    {
      "pk": 4016061,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 61,
      "text": "Then you will remember your ways and be ashamed, when you receive your sisters—both those older and younger than you. I will give them to you as daughters, but not on account of your covenant.",
      "links": "<a href='/AIV/23/54/1'>Isa. 54:1</a>",
      "comment": "God’s mercy brings even notorious sinners into relationship. This spiritual expansion prefigures the gathering of all nations into the one people of God."
    },
    {
      "pk": 4016062,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 62,
      "text": "I will establish my covenant with you, and you will know that I am the LORD,",
      "links": "<a href='/AIV/26/37/26'>Ezek. 37:26</a>",
      "comment": "Knowledge of God comes through covenant relationship; new covenant points directly to Christ’s sacrificial ministry."
    },
    {
      "pk": 4016063,
      "translation": "AIV",
      "book": 26,
      "chapter": 16,
      "verse": 63,
      "text": "that you may remember and be ashamed, and never open your mouth again because of your disgrace, when I provide atonement for you for all you have done, declares the Lord GOD.",
      "links": "<a href='/AIV/19/51/2'>Ps. 51:2</a>; <a href='/AIV/58/9/12'>Heb. 9:12</a>",
      "comment": "Atonement here points forward to the redemptive work of Christ, whose once-for-all sacrifice brings restoration and forgiveness. The text also links sin, shame, and the necessity for actual, concrete atonement—emphasizing the importance of God’s established means of reconciliation through covenant and sacrifice."
    }
  ],
  "translatedAt": "2025-12-23T06:53:59.598Z"
}