{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 35,
  "verses": [
    {
      "pk": 3535001,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/6/1'>Ezek. 6:1</a>",
      "comment": "God's message comes directly to Ezekiel, marking a prophetic oracle. The phrase appears repeatedly as a sign of direct revelation."
    },
    {
      "pk": 3535002,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 2,
      "text": "Son of man, set your face against Mount Seir and prophesy against it,",
      "links": "<a href='/AIV/26/25/8-14'>Ezek. 25:8-14</a>; <a href='/AIV/39/1/4'>Mal. 1:4</a>",
      "comment": "Mount Seir represents the nation of Edom, a historic enemy of Israel. God directs Ezekiel to announce divine judgment."
    },
    {
      "pk": 3535003,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 3,
      "text": "and say to it, Thus says the Lord GOD: Behold, I am against you, Mount Seir, and I will stretch out my hand against you and make you a desolate waste.",
      "links": "<a href='/AIV/26/6/14'>Ezek. 6:14</a>; <a href='/AIV/23/34/10-15'>Isa. 34:10-15</a>",
      "comment": "The language echoes God's actions against other nations hostile toward Israel, showing God's authority over all nations (cf. Isa. 34:1–17)."
    },
    {
      "pk": 3535004,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 4,
      "text": "I will lay your cities waste, and you shall become a desolation. Then you shall know that I am the LORD.",
      "links": "<a href='/AIV/26/30/8-9'>Ezek. 30:8–9</a>",
      "comment": "'You shall know that I am the LORD' points to God's purpose in judgment: making Himself known to all peoples and nations."
    },
    {
      "pk": 3535005,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 5,
      "text": "Because you cherished perpetual enmity and gave over the people of Israel to the power of the sword at the time of their calamity, at the time when their punishment came to an end,",
      "links": "<a href='/AIV/36/2/8-10'>Zeph. 2:8–10</a>; <a href='/AIV/19/137/7'>Ps. 137:7</a>",
      "comment": "Edom's unending hostility and violence against Israel after Israel's judgment is viewed as especially evil. Cf. Obadiah 10–14."
    },
    {
      "pk": 3535006,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 6,
      "text": "therefore, as I live, declares the Lord GOD, I will prepare you for blood, and blood shall pursue you; because you did not hate bloodshed, therefore blood shall pursue you.",
      "links": "<a href='/AIV/26/18/10-13'>Ezek. 18:10–13</a>",
      "comment": "The punishment fits the crime—Edom will face the very violence it inflicted. God's retributive justice is in focus here."
    },
    {
      "pk": 3535007,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 7,
      "text": "I will make Mount Seir a desolation and a waste, and I will cut off from it all who come and go.",
      "links": "<a href='/AIV/24/49/17-18'>Jer. 49:17–18</a>",
      "comment": "A curse of total destruction, echoing earlier prophecies against proud nations. Reference to 'all who come and go' suggests total ruin."
    },
    {
      "pk": 3535008,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 8,
      "text": "And I will fill its mountains with the slain. On your hills and in your valleys and in all your ravines those who are slain with the sword shall fall.",
      "links": "<a href='/AIV/26/32/5'>Ezek. 32:5</a>",
      "comment": "Widespread destruction is described in vivid terms, signifying judgment throughout all of Edom’s territory."
    },
    {
      "pk": 3535009,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 9,
      "text": "I will make you perpetual desolations, and your cities shall never be inhabited. Then you shall know that I am the LORD.",
      "links": "<a href='/AIV/26/36/33-36'>Ezek. 36:33–36</a>",
      "comment": "The phrase 'never be inhabited' is hyperbolic, signifying complete destruction as a sign lesson to all nations."
    },
    {
      "pk": 3535010,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 10,
      "text": "Because you said, ‘These two nations and these two lands shall be mine, and we will take possession of them,’—although the LORD was there—",
      "links": "<a href='/AIV/26/36/2'>Ezek. 36:2</a>; <a href='/AIV/17/2/6'>Esth. 2:6</a>",
      "comment": "Edom's pride presumed to seize the promised land, denying God's sovereignty. God’s presence in Israel is emphasized, alluding to His ongoing dwelling among His chosen people—a theme central throughout Scripture."
    },
    {
      "pk": 3535011,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 11,
      "text": "therefore, as I live, declares the Lord GOD, I will deal with you according to the anger and jealousy you showed because of your hatred against them; and I will make Myself known among them, when I judge you.",
      "links": "<a href='/AIV/26/39/7'>Ezek. 39:7</a>",
      "comment": "God's 'anger and jealousy' reflect His zealous protection of His people and His holiness—a foreshadowing of the theme of divine presence among His people later fulfilled in Christ."
    },
    {
      "pk": 3535012,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 12,
      "text": "And you shall know that I am the LORD. I have heard all the revilings that you uttered against the mountains of Israel, saying, 'They are laid desolate; they are given to us to devour.'",
      "links": "<a href='/AIV/19/74/8'>Ps. 74:8</a>",
      "comment": "Edom is condemned for its arrogance and mockery of Israel. Even when God’s people are disciplined, He does not overlook the contempt of His enemies."
    },
    {
      "pk": 3535013,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 13,
      "text": "And you magnified yourselves against Me with your mouth, and multiplied your words against Me; I heard it.",
      "links": "<a href='/AIV/27/5/23'>Dan. 5:23</a>",
      "comment": "To insult God’s people is to insult the LORD Himself—a pattern that carries forward to Christ’s identification with His Church (Acts 9:4)."
    },
    {
      "pk": 3535014,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 14,
      "text": "Thus says the Lord GOD: While the whole earth rejoices, I will make you desolate.",
      "links": "<a href='/AIV/19/58/10'>Ps. 58:10</a>",
      "comment": "Divine justice is seen as a thing for the righteous to rejoice in (cf. Ps. 58:10). God’s righteous judgment is cause for celebration for all creation."
    },
    {
      "pk": 3535015,
      "translation": "AIV",
      "book": 26,
      "chapter": 35,
      "verse": 15,
      "text": "As you rejoiced over the inheritance of the house of Israel, because it was desolate, so I will deal with you; you shall be desolate, Mount Seir, and all Edom—all of it. Then they will know that I am the LORD.",
      "links": "<a href='/AIV/26/36/3-7'>Ezek. 36:3-7</a>",
      "comment": "God’s justice brings poetic retribution: Edom will reap what it has sown. The underlying principle is that God alone governs the inheritance of His people, a thread that runs from the Old Testament promises to the New Testament fulfillment in Christ and the Church (Gal. 3:29)."
    }
  ],
  "translatedAt": "2025-12-23T07:05:06.779Z"
}