{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 24,
  "verses": [
    {
      "pk": 2402401,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 1,
      "text": "In the ninth year, in the tenth month, on the tenth day of the month, the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/12/25/1'>2 Kings 25:1</a>; <a href='/AIV/24/39/1'>Jer. 39:1</a>",
      "comment": "Ezekiel dates the prophecy to the start of the Babylonian siege of Jerusalem, emphasizing historical accuracy and God's sovereignty over history."
    },
    {
      "pk": 2402402,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 2,
      "text": "Son of man, write down today’s date, this very day—the king of Babylon has started his siege against Jerusalem this very day.",
      "links": "<a href='/AIV/26/24/1'>Ezek. 24:1</a>; <a href='/AIV/12/25/2'>2 Kings 25:2</a>",
      "comment": "The specificity stresses the fulfillment of prophecy and the certainty of divine judgment."
    },
    {
      "pk": 2402403,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 3,
      "text": "And speak a parable to the rebellious house. Say to them, ‘This is what the Lord GOD says: Put on the pot, put it on and pour water into it.’",
      "links": "<a href='/AIV/26/17/2'>Ezek. 17:2</a>; <a href='/AIV/23/1/10'>Isa. 1:10</a>",
      "comment": "The parable uses vivid imagery to portray Jerusalem’s coming judgment, symbolized by the boiling pot."
    },
    {
      "pk": 2402404,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 4,
      "text": "Gather pieces of meat into it—all the good pieces, the thigh and the shoulder. Fill it with the choicest bones.",
      "links": "<a href='/AIV/33/3/2'>Mic. 3:2</a>; <a href='/AIV/26/11/3'>Ezek. 11:3</a>",
      "comment": "The 'choicest pieces' symbolize the leaders and important people of Jerusalem, showing judgment begins with them."
    },
    {
      "pk": 2402405,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 5,
      "text": "Take the best of the flock, pile wood beneath it for the bones; bring it to a boil, and let the bones be boiled within it.",
      "links": "<a href='/AIV/26/22/19-22'>Ezek. 22:19–22</a>",
      "comment": "The process signifies thorough purification through suffering, a common biblical theme (cf. 1 Pet. 1:7)."
    },
    {
      "pk": 2402406,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 6,
      "text": "Therefore, the Lord GOD says: Woe to the city of bloodshed, to the pot whose rust is in it, whose rust has not gone out of it! Pour out its pieces one by one, without casting lots for them.",
      "links": "<a href='/AIV/23/1/21'>Isa. 1:21</a>; <a href='/AIV/26/22/2'>Ezek. 22:2</a>",
      "comment": "‘Rust’ represents persistent guilt; judgment comes to all, emphasizing divine impartiality."
    },
    {
      "pk": 2402407,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 7,
      "text": "For her blood is in her midst. She put it on a bare rock; she did not pour it on the ground to cover it with dust.",
      "links": "<a href='/AIV/01/4/10'>Gen. 4:10</a>; <a href='/AIV/26/22/3'>Ezek. 22:3</a>",
      "comment": "Blood on the rock shows flagrant sin, unatoned and uncovered, a powerful image of public guilt (cf. Gen. 4:10)."
    },
    {
      "pk": 2402408,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 8,
      "text": "To stir up wrath and take vengeance, I have put her blood on a bare rock, that it may not be covered.",
      "links": "<a href='/AIV/19/79/6'>Ps. 79:6</a>; <a href='/AIV/26/16/38'>Ezek. 16:38</a>",
      "comment": "God’s justice means secret sins are exposed; nothing can hide from His judgment."
    },
    {
      "pk": 2402409,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 9,
      "text": "Therefore the Lord GOD says: Woe to the city of bloodshed! I will even make the pile for fire great.",
      "links": "<a href='/AIV/26/24/6'>Ezek. 24:6</a>; <a href='/AIV/36/3/1'>Zeph. 3:1</a>",
      "comment": "God’s repetition stresses severity of the coming judgment. Fire often symbolizes purification."
    },
    {
      "pk": 2402410,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 10,
      "text": "Heap on the wood, kindle the fire, boil the flesh well, mix in the spices, and let the bones be burned up.",
      "links": "<a href='/AIV/26/22/22'>Ezek. 22:22</a>",
      "comment": "Total destruction of the 'meat and bones' points to the completeness of judgment and ‘boiling’ can anticipate future purifications."
    },
    {
      "pk": 2402411,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 11,
      "text": "Then set the empty pot on the coals, so that it may become hot and its bronze may burn, its filthiness melt in it, and its rust be consumed.",
      "links": "<a href='/AIV/66/3/18'>Rev. 3:18</a>; <a href='/AIV/26/22/15'>Ezek. 22:15</a>",
      "comment": "The empty pot being burned represents the remnant and purification of Jerusalem after judgment. Fire as cleansing foreshadows spiritual cleansing in the New Covenant (<a href='/AIV/43/15/3'>John 15:3</a>)."
    },
    {
      "pk": 2402412,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 12,
      "text": "She has wearied herself with toil; her abundant rust does not go out of her; her rust will not go out by fire.",
      "links": "<a href='/AIV/23/57/10'>Isa. 57:10</a>",
      "comment": "Efforts to remove sin by human means fail—only God can cleanse thoroughly. Spiritual applications are found in New Testament calls for repentance."
    },
    {
      "pk": 2402413,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 13,
      "text": "In your filthiness is lewdness. Because I would have cleansed you, but you would not be cleansed from your filthiness, you shall not be cleansed anymore, until I have satisfied my fury upon you.",
      "links": "<a href='/AIV/23/1/16'>Isa. 1:16</a>; <a href='/AIV/11/21/29'>1 Kings 21:29</a>",
      "comment": "The refusal of cleansing means judgment is inevitable. Implies necessity of receptive hearts to divine grace."
    },
    {
      "pk": 2402414,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 14,
      "text": "I, the LORD, have spoken. It will come to pass, and I will do it. I will not go back; I will not spare; I will not change. According to your ways and deeds, they will judge you, declares the Lord GOD.",
      "links": "<a href='/AIV/04/23/19'>Num. 23:19</a>; <a href='/AIV/26/18/30'>Ezek. 18:30</a>",
      "comment": "God’s unchangeable word recalls His faithfulness and justice. This truth underpins confidence in New Testament promises (<a href='/AIV/58/6/17-18'>Heb. 6:17–18</a>)."
    },
    {
      "pk": 2402415,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 15,
      "text": "The word of the LORD came to me, saying,",
      "links": "<a href='/AIV/26/24/1'>Ezek. 24:1</a>",
      "comment": "Marks a transition to a prophetic sign-act."
    },
    {
      "pk": 2402416,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 16,
      "text": "Son of man, behold, I am about to take from you the desire of your eyes with a fatal blow; yet you shall not mourn or weep, nor shall your tears run down.",
      "links": "<a href='/AIV/20/5/18'>Prov. 5:18</a>; <a href='/AIV/26/8/6'>Ezek. 8:6</a>",
      "comment": "'Desire of your eyes' refers to Ezekiel's wife—God’s command forbids mourning, dramatizing Jerusalem’s future silence amid loss. Spiritual meanings point to giving up all for God’s will."
    },
    {
      "pk": 2402417,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 17,
      "text": "Sigh, but not aloud; make no mourning for the dead. Bind your turban on your head, put your sandals on your feet; do not cover your mustache or eat the bread of mourners.",
      "links": "<a href='/AIV/03/10/6'>Lev. 10:6</a>; <a href='/AIV/24/16/5-7'>Jer. 16:5–7</a>",
      "comment": "The actions forbidden are those of public mourning. Obedient acceptance of God’s will is a foreshadowing of Christ’s silent suffering."
    },
    {
      "pk": 2402418,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 18,
      "text": "So I spoke to the people in the morning, and my wife died in the evening. And the next morning I did as I was commanded.",
      "links": "<a href='/AIV/26/12/11'>Ezek. 12:11</a>",
      "comment": "Ezekiel’s obedience reflects prophetic suffering foreshadowed in Christ’s obedience even unto death (<a href='/AIV/50/2/8'>Phil. 2:8</a>)."
    },
    {
      "pk": 2402419,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 19,
      "text": "The people said to me, 'Will you not tell us what these things mean for us, that you are acting so?'",
      "links": "<a href='/AIV/26/12/9'>Ezek. 12:9</a>",
      "comment": "People perceive a prophetic sign, recognizing that Ezekiel’s actions have symbolic meaning regarding Jerusalem’s coming fate."
    },
    {
      "pk": 2402420,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 20,
      "text": "I answered them, 'The word of the LORD came to me, saying,",
      "links": "<a href='/AIV/26/24/15'>Ezek. 24:15</a>",
      "comment": "Ezekiel prepares to interpret the sign act for the people—prophecy and action are intertwined."
    },
    {
      "pk": 2402421,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 21,
      "text": "Say to the house of Israel, “This is what the Lord GOD says: I am about to profane my sanctuary, the pride of your strength, the delight of your eyes, and the longing of your soul. Your sons and your daughters whom you left behind will fall by the sword.",
      "links": "<a href='/AIV/19/27/4'>Ps. 27:4</a>; <a href='/AIV/25/2/7'>Lam. 2:7</a>",
      "comment": "God’s sanctuary is called the 'delight of your eyes'—its loss parallels Ezekiel’s mourning, signaling devastating judgment and the end of old forms of worship."
    },
    {
      "pk": 2402422,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 22,
      "text": "And you shall do as I have done: you shall not cover your lips or eat the bread of mourners.",
      "links": "<a href='/AIV/26/24/17'>Ezek. 24:17</a>",
      "comment": "Collective mourning will be forbidden, highlighting the depth of devastation—a loss too great for mere ritual."
    },
    {
      "pk": 2402423,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 23,
      "text": "Your turbans shall be on your heads and your sandals on your feet. You shall not mourn or weep but you shall rot away in your iniquities and groan to one another.",
      "links": "<a href='/AIV/26/7/16'>Ezek. 7:16</a>",
      "comment": "Sustained wearing of turbans and sandals reflects ongoing exile—mourning is replaced by repentance and groaning over sin."
    },
    {
      "pk": 2402424,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 24,
      "text": "Thus Ezekiel shall be a sign to you. According to all that he has done, you shall do. When this comes, then you will know that I am the Lord GOD.",
      "links": "<a href='/AIV/26/12/6'>Ezek. 12:6</a>; <a href='/AIV/43/13/19'>John 13:19</a>",
      "comment": "Ezekiel becomes an example, fulfilling his role as a prophet who points to God’s authority. When prophecy is fulfilled, God's sovereignty is recognized—a principle also seen in Jesus' life as ultimate prophet."
    },
    {
      "pk": 2402425,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 25,
      "text": "And you, son of man, on the day when I take from them their stronghold, their joy and glory, the desire of their eyes, and their heart's delight, and their sons and daughters,",
      "links": "<a href='/AIV/26/24/16'>Ezek. 24:16</a>; <a href='/AIV/24/6/11'>Jer. 6:11</a>",
      "comment": "A reiteration that God removes both spiritual and earthly sources of pride in order to draw the people to Himself."
    },
    {
      "pk": 2402426,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 26,
      "text": "on that day a fugitive will come to you to report it to your ears.",
      "links": "<a href='/AIV/26/33/21'>Ezek. 33:21</a>",
      "comment": "A lone survivor will bear witness—a role analogous to the New Testament role of witnesses, emphasizing the value of testimony."
    },
    {
      "pk": 2402427,
      "translation": "AIV",
      "book": 26,
      "chapter": 24,
      "verse": 27,
      "text": "On that day your mouth will be opened to the fugitive, and you shall speak and not be mute anymore. So you shall be a sign to them, and they will know that I am the LORD.",
      "links": "<a href='/AIV/26/3/26-27'>Ezek. 3:26–27</a>; <a href='/AIV/26/33/22'>Ezek. 33:22</a>",
      "comment": "Ezekiel’s ability to speak again marks vindication of his prophetic office. God’s revelation is affirmed through His servants as through the totality of Scripture."
    }
  ],
  "translatedAt": "2025-12-23T06:59:14.036Z"
}