{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 46,
  "verses": [
    {
      "pk": 4604601,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 1,
      "text": "The Lord God says this: The gate of the inner court that faces east shall be shut during the six days of work, but on the Sabbath day it shall be opened, and on the day of the new moon it shall be opened.",
      "links": "<a href='/AIV/26/40/6'>Ezek. 40:6</a>; <a href='/AIV/3/23/3'>Lev. 23:3</a>",
      "comment": "The Sabbath and new moon indicate special days of worship. This emphasizes set-apart times for communal liturgical worship, a pattern ordered by God."
    },
    {
      "pk": 4604602,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 2,
      "text": "The prince shall enter by the way of the vestibule of the gate from outside, and shall stand by the doorpost of the gate. The priests shall prepare his burnt offering and his peace offerings, and he shall worship at the threshold of the gate. Then he shall go out, but the gate shall not be shut until the evening.",
      "links": "<a href='/AIV/26/44/3'>Ezek. 44:3</a>",
      "comment": "The prince functions both as a leader and worshipper, standing between God and the people, suggesting a role of liturgical mediation."
    },
    {
      "pk": 4604603,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 3,
      "text": "The people of the land shall worship at the entrance of that gate before the Lord on the Sabbaths and on the new moons.",
      "links": "<a href='/AIV/23/66/23'>Isa. 66:23</a>",
      "comment": "Public worship on appointed days is explicitly required, rooting the community in shared liturgical acts, prefiguring communal worship practices in the new covenant."
    },
    {
      "pk": 4604604,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 4,
      "text": "The burnt offering that the prince brings to the Lord on the Sabbath day shall be six lambs without blemish and a ram without blemish.",
      "links": "<a href='/AIV/4/28/9-10'>Num. 28:9-10</a>",
      "comment": "This parallels previous instructions for Sabbath offerings (Num. 28), but here they are specified for the new temple, further connecting sacrifice, leadership, and worship."
    },
    {
      "pk": 4604605,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 5,
      "text": "The grain offering with the ram shall be an ephah, and the grain offering with the lambs shall be as much as he is able to give, and a hin of oil to each ephah.",
      "links": "<a href='/AIV/4/15/4'>Num. 15:4</a>",
      "comment": "The offering is both generous and according to one’s ability, pointing to a sacrificial system of the heart as well as action."
    },
    {
      "pk": 4604606,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 6,
      "text": "On the day of the new moon he shall offer a young bull without blemish, six lambs, and a ram; all without blemish.",
      "links": "<a href='/AIV/4/28/11'>Num. 28:11</a>",
      "comment": "The offering for the new moon is more elaborate, underlining the sanctity and importance of the beginning of the month."
    },
    {
      "pk": 4604607,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 7,
      "text": "And with the bull he shall offer an ephah, and with the ram an ephah, and with the lambs a grain offering as much as he is able to give, and a hin of oil to each ephah.",
      "links": "<a href='/AIV/4/28/12'>Num. 28:12</a>",
      "comment": "The flexibility in the grain offering emphasizes personal devotion alongside prescribed ritual observance."
    },
    {
      "pk": 4604608,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 8,
      "text": "When the prince enters, he shall enter by the vestibule of the gate, and he shall go out by the same way.",
      "links": "<a href='/AIV/26/44/3'>Ezek. 44:3</a>",
      "comment": "The regulated movement highlights order and reverence in sacred proceedings, hinting at the dignity of liturgical procession."
    },
    {
      "pk": 4604609,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 9,
      "text": "When the people of the land come before the Lord at the appointed feasts, whoever enters by the north gate to worship shall go out by the south gate, and whoever enters by the south gate shall go out by the north gate. No one shall return by the same gate he entered, but shall go straight out.",
      "links": "<a href='/AIV/23/2/3'>Isa. 2:3</a>",
      "comment": "The practice of not departing by the way one came may symbolize newness after worship, a theme carried over into Christian liturgy where meeting God brings change."
    },
    {
      "pk": 4604610,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 10,
      "text": "The prince, when among them, shall enter when they enter and shall leave when they leave.",
      "links": "<a href='/AIV/26/45/17'>Ezek. 45:17</a>",
      "comment": "The prince accompanying the people in worship suggests a leader who participates fully with the faithful, serving as both example and representative before God."
    },
    {
      "pk": 4604611,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 11,
      "text": "At the feasts and the appointed seasons, the grain offering with a young bull shall be an ephah, with a ram an ephah, and with lambs as much as one is able to give, and with each ephah a hin of oil.",
      "links": "<a href='/AIV/4/28/27'>Num. 28:27</a>",
      "comment": "Bringing as much as one is able again unites personal willingness and prescribed sacrifice—an anticipatory look toward true worship 'in spirit and truth' (John 4:24)."
    },
    {
      "pk": 4604612,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 12,
      "text": "When the prince makes a freewill offering, either as a burnt offering or peace offering to the Lord, the gate facing east shall be opened for him. He shall offer his burnt offering or his peace offerings as he does on the Sabbath day. Then he shall go out, and after he goes out the gate shall be shut.",
      "links": "<a href='/AIV/3/7/16'>Lev. 7:16</a>",
      "comment": "The system allows for offerings of special devotion, signaling personal initiative in communion with God even amid ritual structure."
    },
    {
      "pk": 4604613,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 13,
      "text": "You shall provide a year-old lamb without blemish as a daily burnt offering to the Lord; every morning you shall prepare it.",
      "links": "<a href='/AIV/4/28/3-4'>Num. 28:3-4</a>; <a href='/AIV/3/6/12'>Lev. 6:12</a>",
      "comment": "This represents the continual offering for sin and communion, prefiguring the perfect sacrifice of Christ—the true Lamb of God (<a href='/AIV/43/1/29'>John 1:29</a>)."
    },
    {
      "pk": 4604614,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 14,
      "text": "You shall also prepare a grain offering with it every morning, a sixth of an ephah, and a third of a hin of oil to moisten the flour—a grain offering for the Lord as a perpetual statute.",
      "links": "<a href='/AIV/4/28/5'>Num. 28:5</a>",
      "comment": "Perpetual statutes root the calendar of worship in daily life, calling to mind 'give us this day our daily bread' (Matt. 6:11) and prefiguring daily offerings in the new covenant."
    },
    {
      "pk": 4604615,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 15,
      "text": "They shall prepare the lamb, the grain offering, and the oil every morning as a regular burnt offering.",
      "links": "<a href='/AIV/4/28/6'>Num. 28:6</a>",
      "comment": "The daily rhythm of sacrificial offering gives structure to worship—a principle carried into the practice of setting aside intentional times for communal prayer."
    },
    {
      "pk": 4604616,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 16,
      "text": "Thus says the Lord God: If the prince gives a gift to any of his sons, it is his inheritance and belongs to his sons; it is their possession by inheritance.",
      "links": "<a href='/AIV/26/45/8'>Ezek. 45:8</a>",
      "comment": "The principle of hereditary succession here implies stability and continuity in spiritual leadership—a pattern seen both in Israel and the preservation of shepherding authority in the church."
    },
    {
      "pk": 4604617,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 17,
      "text": "But if he gives a gift out of his inheritance to one of his servants, it shall be his to the year of liberty. Afterward it shall return to the prince. Only his inheritance belongs to his sons.",
      "links": "<a href='/AIV/3/25/10'>Lev. 25:10</a>",
      "comment": "Jubilee year law is referenced, showing restoration of right order and the enduring principle of sacred inheritance."
    },
    {
      "pk": 4604618,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 18,
      "text": "The prince shall not take from the inheritance of the people, thrusting them out of their property. He is to give his sons their inheritance out of his own property, so that none of my people shall be separated from his property.",
      "links": "<a href='/AIV/26/45/9'>Ezek. 45:9</a>; <a href='/AIV/3/25/23'>Lev. 25:23</a>",
      "comment": "The sanctity of individual inheritance is preserved; spiritual leaders are not to appropriate what belongs to others—a protection of the flock that echoes later warnings against 'lords over the flock' (<a href='/AIV/60/5/3'>1 Peter 5:3</a>)."
    },
    {
      "pk": 4604619,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 19,
      "text": "Then he brought me through the entrance beside the gate to the holy chambers for the priests, which faced north. And behold, there was a place at the rear, westward.",
      "links": "<a href='/AIV/26/42/13'>Ezek. 42:13</a>",
      "comment": "The priests have specially designated, holy chambers, reflecting the dignity and set-apartness of their role in spiritual service."
    },
    {
      "pk": 4604620,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 20,
      "text": "And he said to me, 'This is the place where the priests shall boil the guilt offering and the sin offering, and bake the grain offering, so they do not bring them out into the outer court and so transmit holiness to the people.'",
      "links": "<a href='/AIV/3/6/16-18'>Lev. 6:16-18</a>",
      "comment": "Sacred things are to be consumed by priests in sacred space, avoiding profanation and showing the transmission of holiness is carefully regulated. This reflects belief in a special, sacramental holiness attached to sacred acts."
    },
    {
      "pk": 4604621,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 21,
      "text": "Then he brought me out to the outer court and led me to the four corners of the court, and behold, in each corner of the court there was a small court.",
      "links": "<a href='/AIV/26/40/17'>Ezek. 40:17</a>",
      "comment": "Every part of the sacred precinct has a purpose; the ordered space hints at the reality that worship engages the whole community and all its faculties."
    },
    {
      "pk": 4604622,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 22,
      "text": "In the four corners of the court there were enclosures, forty cubits long and thirty cubits wide; the four enclosures in the corners of the court were the same size.",
      "links": "",
      "comment": "The regularity and symmetry reflect heavenly order, making the temple a microcosm of divinely established reality."
    },
    {
      "pk": 4604623,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 23,
      "text": "There was a row of masonry around inside each of the four enclosures, and hearths were made at the bottom of the rows all around.",
      "links": "",
      "comment": "The presence of hearths indicates designated places for the sacrificial rituals, linking physical space with sacred function."
    },
    {
      "pk": 4604624,
      "translation": "AIV",
      "book": 26,
      "chapter": 46,
      "verse": 24,
      "text": "Then he said to me, 'These are the kitchens where those who serve the house shall boil the sacrifices of the people.'",
      "links": "<a href='/AIV/26/44/11'>Ezek. 44:11</a>",
      "comment": "The careful process of preparing and consuming sacrifices reveals a priesthood serving 'the house' and mediating between God and the people. This points to a continuing pattern of hierarchical order and sacred service in worship."
    }
  ],
  "translatedAt": "2025-12-23T07:11:20.669Z"
}