{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 40,
  "verses": [
    {
      "pk": 1940040,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 1,
      "text": "In the twenty-fifth year of our exile, at the beginning of the year, on the tenth day of the month, in the fourteenth year after the city was struck down, on that very day, the hand of the Lord was upon me, and He brought me there.",
      "links": "<a href='/AIV/26/1/3'>Ezek. 1:3</a>; <a href='/AIV/26/33/21'>Ezek. 33:21</a>",
      "comment": "The historical setting matches the period of exile; 'the hand of the Lord' here refers to prophetic inspiration (see Ezek. 1:3)."
    },
    {
      "pk": 1940041,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 2,
      "text": "In visions from God He brought me into the land of Israel and set me on a very high mountain, on which was a structure like a city on the south side.",
      "links": "<a href='/AIV/26/8/3'>Ezek. 8:3</a>; <a href='/AIV/23/2/2'>Isa. 2:2</a>",
      "comment": "Visionary journeys are common in prophecy (cf. Isa. 2:2 for the mountain imagery). Some interpret this as foreshadowing the heavenly Jerusalem (Rev. 21:10)."
    },
    {
      "pk": 1940042,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 3,
      "text": "When He brought me there, I saw a man whose appearance was like bronze, with a linen cord and a measuring reed in his hand, standing in the gateway.",
      "links": "<a href='/AIV/66/21/15'>Rev. 21:15</a>; <a href='/AIV/38/2/1'>Zech. 2:1</a>",
      "comment": "This glorious figure is reminiscent of other angelic beings involved in temple visions (Rev. 21:15)."
    },
    {
      "pk": 1940043,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 4,
      "text": "The man said to me, 'Son of man, look with your eyes, hear with your ears, and set your heart on all that I show you, for you were brought here so that I might show it to you. Declare all you see to the house of Israel.'",
      "links": "<a href='/AIV/26/2/1'>Ezek. 2:1</a>; <a href='/AIV/66/1/11'>Rev. 1:11</a>",
      "comment": "The command to pay careful attention and report is foundational for prophetic missions (see also Rev. 1:11)."
    },
    {
      "pk": 1940044,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 5,
      "text": "There was a wall all around the outside of the temple area. The measuring reed in the man's hand was six long cubits, each of which was a cubit and a handbreadth. He measured the thickness of the wall, one reed, and the height, one reed.",
      "links": "<a href='/AIV/11/6/2'>1 Kgs. 6:2</a>",
      "comment": "The ‘long cubit’ equals about 21 inches. Precise measurement emphasizes the holiness of God’s dwelling."
    },
    {
      "pk": 1940045,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 6,
      "text": "Then he went to the east gate and went up its steps and measured the threshold of the gate, one reed wide.",
      "links": "",
      "comment": "The East Gate holds importance in later prophecy and tradition (see Ezek. 43:1-4)."
    },
    {
      "pk": 1940046,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 7,
      "text": "Every alcove was one reed long and one reed wide, with five cubits between the alcoves. The threshold of the gate by the vestibule on the inside was one reed.",
      "links": "",
      "comment": "The detailed architecture highlights the order and design of worship as instructed by God."
    },
    {
      "pk": 1940047,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 8,
      "text": "Then he measured the vestibule of the gate, eight cubits, and its side pillars, two cubits. The vestibule was inside.",
      "links": "",
      "comment": "‘Vestibule’ refers to the entry chamber before entering the main temple."
    },
    {
      "pk": 1940048,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 9,
      "text": "He measured the vestibule of the gate, eight cubits, and its pillars, two cubits. The vestibule of the gate was on the inside.",
      "links": "",
      "comment": "Some translations merge v.8 and v.9; this text follows the original division."
    },
    {
      "pk": 1940049,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 10,
      "text": "The alcoves of the east gate were three on each side, each of the same size. The pillars on each side were also of the same size.",
      "links": "",
      "comment": "Uniformity symbolizes order; see also Revelation's city of equal measure (<a href='/AIV/66/21/16'>Rev. 21:16</a>)."
    },
    {
      "pk": 1940050,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 11,
      "text": "He measured the width of the gateway, ten cubits, and the length of the gate, thirteen cubits.",
      "links": "",
      "comment": "Ten cubits wide and thirteen cubits long; the precise measurements point to divine planning."
    },
    {
      "pk": 1940051,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 12,
      "text": "There was a barrier in front of the alcoves, one cubit on each side. The alcoves were six cubits on each side.",
      "links": "",
      "comment": "Translation preserves literal sense; ‘barrier’ may refer to a low wall or curb."
    },
    {
      "pk": 1940052,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 13,
      "text": "Then he measured the gate from the roof of one alcove to the roof of the other, a width of twenty-five cubits, door facing door.",
      "links": "",
      "comment": "This measurement ensures symmetry across the gateway."
    },
    {
      "pk": 1940053,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 14,
      "text": "He made the pillars sixty cubits high, and each gateway extended all around to the pillar of the court.",
      "links": "",
      "comment": "The vast height points to the majesty of the worship space."
    },
    {
      "pk": 1940054,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 15,
      "text": "From the front of the gate at the entrance to the front of the inner vestibule of the gate was fifty cubits.",
      "links": "",
      "comment": "Distance from the gate’s entrance to the inner vestibule totals fifty cubits."
    },
    {
      "pk": 1940055,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 16,
      "text": "There were narrow windows for the alcoves and their side pillars inside the gate all around, and likewise for the vestibules. Windows were all around inside, and on each pillar were palm tree designs.",
      "links": "",
      "comment": "Architectural beauty in the temple: windows for light, palm tree motif for victory or life (see <a href='/AIV/43/12/13'>John 12:13</a>)."
    },
    {
      "pk": 1940056,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 17,
      "text": "Then he brought me into the outer court. And there were chambers, and a pavement made all around the court; thirty chambers faced the pavement.",
      "links": "",
      "comment": "The ‘outer court’ is for the people; thirty chambers likely used for priests or offerings."
    },
    {
      "pk": 1940057,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 18,
      "text": "The pavement ran beside the gates, corresponding to the length of the gates; this was the lower pavement.",
      "links": "",
      "comment": "'Pavement' refers to stonework designating holy ground (compare <a href='/AIV/2/24/10'>Exod. 24:10</a>)."
    },
    {
      "pk": 1940058,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 19,
      "text": "Then he measured the width from the front of the lower gate to the front of the inner court outside, a hundred cubits on the east and on the north.",
      "links": "",
      "comment": "The hundred-cubit distance sets apart sacred spaces, highlighting reverence for worship."
    },
    {
      "pk": 1940059,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 20,
      "text": "As for the gate on the outer court that faced north, he measured its length and its width.",
      "links": "",
      "comment": "Multiple gates indicate structured access for various groups (see <a href='/AIV/44/21/28'>Acts 21:28-29</a>)."
    },
    {
      "pk": 1940060,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 21,
      "text": "Its alcoves—three on each side—its pillars, and its vestibule had the same size as the first gate. Its length was fifty cubits and its width twenty-five cubits.",
      "links": "",
      "comment": "The architecture is consistent with the east gate, reinforcing order and unity."
    },
    {
      "pk": 1940061,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 22,
      "text": "Its windows, its vestibule, and its palm tree designs were the same size as those of the gate facing east. Seven steps led up to it, with its vestibule before them.",
      "links": "",
      "comment": "Seven steps often represent spiritual ascent or perfection (see <a href='/AIV/2/25/40'>Exod. 25:40</a>)."
    },
    {
      "pk": 1940062,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 23,
      "text": "A gate to the inner court was opposite the north gate, just as on the east side. He measured from gate to gate a hundred cubits.",
      "links": "",
      "comment": "The hundred cubit measurement repeats, showing perfect symmetry."
    },
    {
      "pk": 1940063,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 24,
      "text": "Then he led me toward the south, and there was a gate facing south. He measured its side pillars and vestibule; they had the same dimensions as the others.",
      "links": "",
      "comment": "Order and repetition continue, showing the stability and perpetuity of right worship."
    },
    {
      "pk": 1940064,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 25,
      "text": "The gate and its vestibule had windows all around, like those windows. Its length was fifty cubits and its width twenty-five cubits.",
      "links": "",
      "comment": "Symbolic of God’s openness—light pouring inward (cf. <a href='/AIV/19/119/105'>Ps. 119:105</a>)."
    },
    {
      "pk": 1940065,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 26,
      "text": "There were seven steps leading up to it, and its vestibule was in front of them. It had palm tree decorations on its pillars, one on each side.",
      "links": "",
      "comment": "Palm trees symbolize new life and flourishing in God’s presence."
    },
    {
      "pk": 1940066,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 27,
      "text": "There was a gate to the inner court on the south side; he measured from gate to gate on the south side, a hundred cubits.",
      "links": "",
      "comment": "Detailed measurements stress the order and unity of God’s dwelling."
    },
    {
      "pk": 1940067,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 28,
      "text": "Then he brought me to the inner court through the south gate, and he measured the south gate; it had the same measurements as the others.",
      "links": "",
      "comment": "Inner court gates replicate the exterior, indicating both distinction and unity."
    },
    {
      "pk": 1940068,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 29,
      "text": "Its chambers, its pillars, and its vestibule had the same measurements as the others. The gate and its vestibule had windows all around. Its length was fifty cubits and its width twenty-five cubits.",
      "links": "",
      "comment": "Consistency signifies the ordered and unchanging nature of proper worship."
    },
    {
      "pk": 1940069,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 30,
      "text": "There were vestibules all around, twenty-five cubits long and five cubits wide.",
      "links": "",
      "comment": "Vestibules mark transitional spaces, preparing for sacred approach."
    },
    {
      "pk": 1940070,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 31,
      "text": "Its vestibule faced the outer court. Palm trees were on its pillars, and eight steps led up to it.",
      "links": "",
      "comment": "Eight steps—another sign of entering a higher, holier place (eight is also a number of new creation)."
    },
    {
      "pk": 1940071,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 32,
      "text": "Then he brought me to the inner court on the east side, and he measured the gate; it was the same size as the others.",
      "links": "",
      "comment": "East holds spiritual significance (tradition sees the Messiah entering by the east gate—see <a href='/AIV/26/43/1-4'>Ezek. 43:1-4</a>)."
    },
    {
      "pk": 1940072,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 33,
      "text": "Its chambers, its pillars, and its vestibule were of the same size as the others. It also had windows all around; its length was fifty cubits and its width twenty-five cubits.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1940073,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 34,
      "text": "Its vestibule faced the outer court; palm trees were on its pillars, one on each side. Eight steps led up to it.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1940074,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 35,
      "text": "Then he brought me to the north gate, and he measured it; the size was the same as the others.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1940075,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 36,
      "text": "Its chambers, its pillars, and its vestibule were the same size as the others. It also had windows all around. Its length was fifty cubits and its width twenty-five cubits.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1940076,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 37,
      "text": "Its vestibule faced the outer court. Palm trees were on its pillars on each side. Eight steps led up to it.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1940077,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 38,
      "text": "A chamber with its door was beside the gate. There they washed the burnt offering.",
      "links": "<a href='/AIV/3/8/6'>Lev. 8:6</a>",
      "comment": "Ritual washing for offerings anticipates the priestly cleanliness required—see also how sacramental washing continues the theme (Lev. 8:6)."
    },
    {
      "pk": 1940078,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 39,
      "text": "In the vestibule of the gate were two tables on each side, on which the burnt offering, the sin offering, and the guilt offering were to be slaughtered.",
      "links": "<a href='/AIV/3/1/1'>Lev. 1:1</a>; <a href='/AIV/3/4/24'>Lev. 4:24</a>",
      "comment": "The three offerings addressed the full spectrum of sin, thanksgiving, and atonement—foreshadowing Christ's all-sufficient sacrifice."
    },
    {
      "pk": 1940079,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 40,
      "text": "Outside, as one goes up to the entrance of the north gate, were two tables; and on the other side of the vestibule of the gate were two tables.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1940080,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 41,
      "text": "Four tables were on each side of the gate, eight tables on which the sacrifices were to be slaughtered.",
      "links": "",
      "comment": "Eight is a number of new beginnings; possibly pointing toward new covenants."
    },
    {
      "pk": 1940081,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 42,
      "text": "There were four tables of hewn stone for the burnt offering, a cubit and a half long, a cubit and a half wide, and one cubit high. On them were placed the instruments with which the burnt offerings and the sacrifices were slaughtered.",
      "links": "",
      "comment": "Stone tables add permanence and reflect the value of ritual sacrifice."
    },
    {
      "pk": 1940082,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 43,
      "text": "Hooks, a handbreadth long, were fastened all around the inside. The flesh for the offerings was on the tables.",
      "links": "",
      "comment": "The sanctity of blood and offering prefigures the new covenant (compare <a href='/AIV/40/26/28'>Matt. 26:28</a>)."
    },
    {
      "pk": 1940083,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 44,
      "text": "On the outside of the inner gate, in the inner court, were chambers for the singers, one at the side of the north gate facing south, and another at the side of the east gate facing north.",
      "links": "<a href='/AIV/13/6/31'>1 Chr. 6:31</a>",
      "comment": "Singers had special chambers, emphasizing the role of sacred music (see 1 Chron. 6:31)."
    },
    {
      "pk": 1940084,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 45,
      "text": "He said to me, 'This chamber that faces south is for the priests who have charge of the temple,'",
      "links": "<a href='/AIV/3/6/16'>Lev. 6:16</a>",
      "comment": "The priestly divisions are detailed (Lev. 6:16), pointing to both continuity and fulfillment (see <a href='/AIV/58/10/21'>Heb. 10:21</a>)."
    },
    {
      "pk": 1940085,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 46,
      "text": "and the chamber that faces north is for the priests who have charge of the altar. These are the sons of Zadok, who alone from among the sons of Levi may come near to the Lord to minister to Him.'",
      "links": "<a href='/AIV/26/44/15'>Ezek. 44:15</a>",
      "comment": "Sons of Zadok had a unique priesthood. Exclusive service prefigures the New Covenant’s holy ministers—set apart."
    },
    {
      "pk": 1940086,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 47,
      "text": "Then he measured the court, a hundred cubits long and a hundred cubits wide, square. The altar was in front of the temple.",
      "links": "",
      "comment": "The altar is central to the temple—paralleling Christ as the center of worship in the new covenant (see <a href='/AIV/13/6/49'>1 Chr. 6:49</a> and <a href='/AIV/58/13/10'>Heb. 13:10</a>)."
    },
    {
      "pk": 1940087,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 48,
      "text": "He brought me to the vestibule of the temple and measured the jambs of the vestibule, five cubits on each side. The width of the gate was fourteen cubits, and the side walls of the gate were three cubits on either side.",
      "links": "",
      "comment": "‘Vestibule’ here points to a time of preparation before entering God’s presence—matching the spiritual preparation before worship."
    },
    {
      "pk": 1940088,
      "translation": "AIV",
      "book": 26,
      "chapter": 40,
      "verse": 49,
      "text": "The vestibule was twenty cubits long and eleven cubits wide. Steps led up to it, and there were pillars beside the jambs, one on each side.",
      "links": "",
      "comment": "The pillars echo earlier temples (see <a href='/AIV/11/7/15'>1 Kgs. 7:15</a>); steps reflect continued ascent into deeper holiness."
    }
  ],
  "translatedAt": "2025-12-23T07:08:09.601Z"
}