{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 1,
  "verses": [
    {
      "pk": 2600101,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 1,
      "text": "In the thirtieth year, in the fourth month, on the fifth day, while I was among the exiles by the Kebar Canal, the heavens were opened and I saw visions of God.",
      "links": "<a href='/AIV/12/2/9-10'>2 Kgs. 2:9-10</a>; <a href='/AIV/42/3/21-22'>Luke 3:21-22</a>",
      "comment": "Ezekiel’s vision is received among the exiles, showing that God’s presence is not limited to Jerusalem. The opening heavens recall significant moments of divine revelation; see also Jesus’ baptism."
    },
    {
      "pk": 2600102,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 2,
      "text": "On the fifth day of the month—it was the fifth year of King Jehoiachin’s exile—",
      "links": "<a href='/AIV/12/24/8-17'>2 Kgs. 24:8-17</a>",
      "comment": "Precise dating underlines the historical accuracy of this vision, rooted in the exile of Israel’s king."
    },
    {
      "pk": 2600103,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 3,
      "text": "the word of the Lord came to Ezekiel the priest, son of Buzi, in the land of the Chaldeans by the Kebar Canal. The hand of the Lord was upon him there.",
      "links": "<a href='/AIV/24/1/1-3'>Jer. 1:1-3</a>",
      "comment": "Ezekiel’s priestly lineage and prophetic calling are highlighted. God calls servants from wherever they are—even in exile."
    },
    {
      "pk": 2600104,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 4,
      "text": "As I looked, behold, a stormy wind came out of the north, and a great cloud with flashing fire and brightness all around it. In the middle of the fire was something like gleaming metal.",
      "links": "<a href='/AIV/02/19/16-18'>Ex. 19:16-18</a>; <a href='/AIV/66/1/15'>Rev. 1:15</a>",
      "comment": "Visions of fire and wind often accompany God’s presence (theophany). The north is the traditional direction of judgment and mystery."
    },
    {
      "pk": 2600105,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 5,
      "text": "In the middle of it came the likeness of four living creatures. And this was their appearance: they had a human likeness,",
      "links": "<a href='/AIV/66/4/6-8'>Rev. 4:6-8</a>; <a href='/AIV/26/10/14-15'>Ezek. 10:14-15</a>",
      "comment": "The four living creatures prefigure heavenly beings later described in Revelation. Their humanlikeness denotes wisdom and dignity."
    },
    {
      "pk": 2600106,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 6,
      "text": "but each had four faces, and each of them had four wings.",
      "links": "<a href='/AIV/26/10/14-21'>Ezek. 10:14-21</a>",
      "comment": "Multiplicity in face and wings emphasizes their supernatural nature and readiness to serve God’s purposes in all directions."
    },
    {
      "pk": 2600107,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 7,
      "text": "Their legs were straight, and the soles of their feet were like the sole of a calf’s foot. They sparkled like burnished bronze.",
      "links": "<a href='/AIV/02/3/5'>Ex. 3:5</a>; <a href='/AIV/66/1/15'>Rev. 1:15</a>",
      "comment": "Details evoke purity and strength, reflecting the idea of angelic mediators as both heavenly and grounded in worship."
    },
    {
      "pk": 2600108,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 8,
      "text": "Under their wings on their four sides they had human hands. And the four had their faces and their wings in this way:",
      "links": "<a href='/AIV/26/10/8'>Ezek. 10:8</a>",
      "comment": "Human hands indicate the ability to act; dual imagery suggests participation both in heaven’s worship and earthly mission."
    },
    {
      "pk": 2600109,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 9,
      "text": "their wings touched one another. Each one went straight forward; they did not turn as they went.",
      "links": "<a href='/AIV/26/10/22'>Ezek. 10:22</a>",
      "comment": "Unwavering movement represents complete obedience to God’s will—no deviation from their divine mission."
    },
    {
      "pk": 2600110,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 10,
      "text": "As for the form of their faces, each had the face of a human; the four had the face of a lion on the right side, the face of an ox on the left side, and the face of an eagle.",
      "links": "<a href='/AIV/66/4/7'>Rev. 4:7</a>; <a href='/AIV/01/49/9'>Gen. 49:9</a>",
      "comment": "These faces symbolize intelligence, royalty, strength, and swiftness. Early Christian tradition saw here a shadow of the fourfold Gospel."
    },
    {
      "pk": 2600111,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 11,
      "text": "Such were their faces. And their wings were spread out upward; each had two wings that touched another, and two that covered their bodies.",
      "links": "<a href='/AIV/23/6/2'>Isa. 6:2</a>",
      "comment": "Covering with wings recalls Isaiah’s vision of seraphim, signifying awe before God’s holiness and reverence in worship."
    },
    {
      "pk": 2600112,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 12,
      "text": "Each went straight forward. Wherever the spirit would go, they went, without turning as they went.",
      "links": "<a href='/AIV/43/16/13'>John 16:13</a>",
      "comment": "Total responsiveness to the Spirit is a trait echoed in New Testament teaching (see John 16:13 on the Spirit of Truth)."
    },
    {
      "pk": 2600113,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 13,
      "text": "In the midst of the living creatures there was something that appeared like burning coals of fire, like torches moving back and forth among the living creatures. The fire was bright, and from the fire came lightning.",
      "links": "<a href='/AIV/02/3/2-4'>Ex. 3:2-4</a>; <a href='/AIV/44/2/3'>Acts 2:3</a>",
      "comment": "The fiery imagery foreshadows manifestations of the Holy Spirit at Pentecost and the sanctifying power of God’s presence."
    },
    {
      "pk": 2600114,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 14,
      "text": "And the living creatures darted back and forth, appearing like flashes of lightning.",
      "links": "<a href='/AIV/19/104/4'>Ps. 104:4</a>",
      "comment": "Their movement is swift and powerful, showing God’s might and the dynamic nature of his servants."
    },
    {
      "pk": 2600115,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 15,
      "text": "Now as I looked at the living creatures, I saw a wheel on the ground beside each creature with its four faces.",
      "links": "<a href='/AIV/26/10/9-13'>Ezek. 10:9-13</a>",
      "comment": "The wheels indicate mobility; God’s glory is not limited to one place, a theme crucial for the exiles."
    },
    {
      "pk": 2600116,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 16,
      "text": "The appearance of the wheels and their work was like sparkling beryl. All four had the same likeness, and their appearance and structure were as though a wheel were inside a wheel.",
      "links": "<a href='/AIV/27/7/9'>Dan. 7:9</a>",
      "comment": "Vision of the wheels within wheels highlights God’s mysterious omnipresence and unfathomable wisdom."
    },
    {
      "pk": 2600117,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 17,
      "text": "When they moved, they went in any of their four directions, without turning as they went.",
      "links": "<a href='/AIV/26/10/11'>Ezek. 10:11</a>",
      "comment": "Total harmony with the spirit’s direction points to God’s order within apparent complexity."
    },
    {
      "pk": 2600118,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 18,
      "text": "Their rims were tall and terrifying, and the rims of all four were full of eyes all around.",
      "links": "<a href='/AIV/66/4/6-8'>Rev. 4:6-8</a>",
      "comment": "The eyes symbolize God’s all-seeing knowledge, similar to the description in Revelation."
    },
    {
      "pk": 2600119,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 19,
      "text": "And when the living creatures moved, the wheels moved beside them. And when the living creatures rose from the earth, the wheels rose too.",
      "links": "<a href='/AIV/26/10/16-17'>Ezek. 10:16-17</a>",
      "comment": "The unity of motion suggests the harmony of the heavenly hosts and the instruments of God’s will."
    },
    {
      "pk": 2600120,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 20,
      "text": "Wherever the spirit wanted to go, they went, and the wheels rose up with them, for the spirit of the living creatures was in the wheels.",
      "links": "<a href='/AIV/43/3/8'>John 3:8</a>",
      "comment": "The inseparable connection between spirit and motion echoes the teaching that the Spirit moves where it wills."
    },
    {
      "pk": 2600121,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 21,
      "text": "When the living creatures moved, the wheels moved; and when the creatures stood still, the wheels stood still. When the creatures rose from the ground, the wheels rose along with them, for the spirit of the living creatures was in the wheels.",
      "links": "<a href='/AIV/26/10/17'>Ezek. 10:17</a>",
      "comment": "Repetition highlights the intimate unity of God’s messengers and his providential action."
    },
    {
      "pk": 2600122,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 22,
      "text": "Over the heads of the living creatures there was a likeness, an expanse shining like awe-inspiring crystal, spread out above their heads.",
      "links": "<a href='/AIV/01/1/6'>Gen. 1:6</a>; <a href='/AIV/66/4/6'>Rev. 4:6</a>",
      "comment": "The expanse echoes both the creation firmament and heavenly visions in Revelation. It separates creation from the Creator."
    },
    {
      "pk": 2600123,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 23,
      "text": "And under the expanse their wings stretched out straight, one toward another, and each covered its body with two wings.",
      "links": "<a href='/AIV/23/6/2'>Isa. 6:2</a>",
      "comment": "Reinforces the sense of awe and dignified worship found throughout biblical descriptions of angelic beings."
    },
    {
      "pk": 2600124,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 24,
      "text": "When they moved, I heard the sound of their wings like the roar of rushing waters, like the voice of the Almighty, a sound like the tumult of an army. When they stood still, they let down their wings.",
      "links": "<a href='/AIV/19/29/3'>Ps. 29:3</a>; <a href='/AIV/66/1/15'>Rev. 1:15</a>",
      "comment": "The sound imagery builds a sense of transcendence, linking God’s voice to both creation and judgment."
    },
    {
      "pk": 2600125,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 25,
      "text": "And there came a voice from above the expanse over their heads. When the living creatures stood still, they let down their wings.",
      "links": "<a href='/AIV/02/19/19'>Ex. 19:19</a>",
      "comment": "A direct voice from above signifies God’s authority. The letting down of wings signals reverent stillness before the Word."
    },
    {
      "pk": 2600126,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 26,
      "text": "Above the expanse over their heads was the likeness of a throne, like sapphire stone in appearance. And upon the likeness of the throne was a figure with the appearance of a human.",
      "links": "<a href='/AIV/66/4/2-3'>Rev. 4:2-3</a>; <a href='/AIV/27/7/9'>Dan. 7:9</a>; <a href='/AIV/19/110/1'>Ps. 110:1</a>",
      "comment": "The enthroned human figure is a foreshadowing of the divine Son of Man, central in later prophecies and in Christology."
    },
    {
      "pk": 2600127,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 27,
      "text": "And from the waist upward I saw what appeared to be glowing metal, as if full of fire within it all around; and from the waist downward, what looked like fire, with brightness around him.",
      "links": "<a href='/AIV/66/1/14-15'>Rev. 1:14-15</a>",
      "comment": "Descriptions of brightness and fire convey glory and holiness, elements ascribed to both God and the glorified Christ in Revelation."
    },
    {
      "pk": 2600128,
      "translation": "AIV",
      "book": 26,
      "chapter": 1,
      "verse": 28,
      "text": "Like the appearance of a rainbow in the clouds on a rainy day, so was the appearance of the brightness all around. This was the appearance of the likeness of the glory of the Lord. And when I saw it, I fell facedown and I heard the voice of one speaking.",
      "links": "<a href='/AIV/01/9/13-16'>Gen. 9:13-16</a>; <a href='/AIV/66/4/3'>Rev. 4:3</a>",
      "comment": "The rainbow points to God’s covenant faithfulness. Ezekiel’s act of falling face down is the proper response to God’s overwhelming glory and sets a pattern for reverent worship and reception of the divine word."
    }
  ],
  "translatedAt": "2025-12-23T06:46:48.502Z"
}