{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 43,
  "verses": [
    {
      "pk": 4304301,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 1,
      "text": "Then he led me to the gate, the gate facing east.",
      "links": "<a href='/AIV/26/40/6'>Ezek. 40:6</a>",
      "comment": "Ezekiel is guided by the man (angelic figure), continuing the vision of the new temple. The east-facing gate is significant throughout the book as the direction of God’s glory."
    },
    {
      "pk": 4304302,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 2,
      "text": "And behold, the glory of the God of Israel was coming from the east. His voice was like the sound of many waters, and the earth shone with his glory.",
      "links": "<a href='/AIV/26/1/24'>Ezek. 1:24</a>; <a href='/AIV/26/10/18-19'>Ezek. 10:18-19</a>; <a href='/AIV/66/1/15'>Rev. 1:15</a>",
      "comment": "God’s glory returns from the east, just as it departed toward the east (Ezek. 10:19). The sound of many waters is used to describe Christ in Revelation, linking the presence of God here with Christologically significant imagery, pointing ahead to the New Testament fullness of God’s dwelling with man."
    },
    {
      "pk": 4304303,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 3,
      "text": "The vision I saw was like the vision that I had seen when he came to destroy the city, and like the vision that I had seen by the Kebar canal. And I fell on my face.",
      "links": "<a href='/AIV/26/1/1'>Ezek. 1:1</a>; <a href='/AIV/26/10/22'>Ezek. 10:22</a>",
      "comment": "Ezekiel refers to earlier visions of God’s glory (Ezek. 1, 10). Falling on his face is a posture of worship and holy fear, highlighting the overwhelming nature of God’s presence."
    },
    {
      "pk": 4304304,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 4,
      "text": "And the glory of the LORD entered the temple by the gate facing east.",
      "links": "<a href='/AIV/26/43/2'>Ezek. 43:2</a>; <a href='/AIV/26/10/19'>Ezek. 10:19</a>",
      "comment": "God’s return to the temple fulfills earlier prophecies; His dwelling among His people is restored, showcasing the theme of restoration."
    },
    {
      "pk": 4304305,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 5,
      "text": "The Spirit lifted me up and brought me into the inner court; and behold, the glory of the LORD filled the temple.",
      "links": "<a href='/AIV/26/3/12'>Ezek. 3:12</a>; <a href='/AIV/2/40/34-35'>Ex. 40:34-35</a>",
      "comment": "The filling of the temple recalls Moses’ tabernacle and Solomon’s temple (<a href='/AIV/2/40/34-35'>Ex. 40:34-35</a>; <a href='/AIV/11/8/10-11'>1 Kgs. 8:10-11</a>). The Spirit’s action links to New Testament themes of the Spirit sanctifying God’s house (compare <a href='/AIV/1Co/3/16'>1 Cor. 3:16</a>)."
    },
    {
      "pk": 4304306,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 6,
      "text": "And I heard one speaking to me from the temple, while a man was standing beside me.",
      "links": "<a href='/AIV/26/43/1'>Ezek. 43:1</a>",
      "comment": "God Himself speaks from within the temple, signifying His real presence. The man/angel stands as mediator and guide, bridging the prophetic encounter."
    },
    {
      "pk": 4304307,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 7,
      "text": "And he said to me, 'Son of man, this is the place of my throne and the place of the soles of my feet, where I will dwell among the children of Israel forever. The house of Israel shall no more defile my holy name, neither they nor their kings, by their whoring and by the corpses of their kings on their high places.'",
      "links": "<a href='/AIV/26/37/26-27'>Ezek. 37:26-27</a>; <a href='/AIV/19/99/5'>Ps. 99:5</a>",
      "comment": "God’s throne and dwelling are permanently established. The promise of everlasting presence points forward to the final fulfillment in Christ, whose Church is the true temple (see <a href='/AIV/66/21/3'>Rev. 21:3</a>)."
    },
    {
      "pk": 4304308,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 8,
      "text": "By setting their threshold by my threshold and their doorposts beside my doorposts, with only a wall between me and them, they have defiled my holy name by their abominations that they committed. So I consumed them in my anger.",
      "links": "<a href='/AIV/26/8/3'>Ezek. 8:3</a>; <a href='/AIV/26/5/11'>Ezek. 5:11</a>",
      "comment": "Israel’s idolatry led to judgment, but here God emphasizes the seriousness of improper worship, setting up a need for true and continual reverence."
    },
    {
      "pk": 4304309,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 9,
      "text": "Now let them put away their whoring and the corpses of their kings far from me, and I will dwell among them forever.",
      "links": "<a href='/AIV/26/37/23'>Ezek. 37:23</a>",
      "comment": "A call to repentance and purity; God’s abiding presence is tied to the holiness of His people, anticipating the deep cleansing later provided fully in Christ."
    },
    {
      "pk": 4304310,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 10,
      "text": "As for you, son of man, describe the temple to the house of Israel, that they may be ashamed of their sins, and measure its plan.",
      "links": "<a href='/AIV/26/16/61'>Ezek. 16:61</a>; <a href='/AIV/26/40/2'>Ezek. 40:2</a>",
      "comment": "The vision of the perfect temple reveals Israel’s shortcomings, leading to repentance. God’s instructions indicate the importance of right worship and order."
    },
    {
      "pk": 4304311,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 11,
      "text": "If they are ashamed of all they have done, make known to them the design of the temple, its arrangement, its exit and entrances, its whole form and all its laws; write them in their sight, so they may keep its whole design and all its laws and do them.",
      "links": "<a href='/AIV/26/43/10'>Ezek. 43:10</a>; <a href='/AIV/26/44/5'>Ezek. 44:5</a>",
      "comment": "Complete knowledge of the temple’s design points to the fullness and completeness of God’s covenant order, emphasizing both the exterior and interior transformation He seeks."
    },
    {
      "pk": 4304312,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 12,
      "text": "This is the law of the temple: The whole area on top of the mountain all around shall be most holy. Behold, this is the law of the temple.",
      "links": "<a href='/AIV/2/19/12'>Ex. 19:12</a>; <a href='/AIV/19/24/3'>Ps. 24:3</a>",
      "comment": "The holiness of the temple shows God’s presence sanctifies not just the building, but the entire region. This echoes Old Testament revelation about sacred space, and prefigures a widened experience of God’s sanctifying grace."
    },
    {
      "pk": 4304313,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 13,
      "text": "These are the measurements of the altar by cubits (the cubit being one cubit and a handbreadth): its base shall be one cubit high and one cubit wide, with a rim of one span around its edge. This shall be the height of the altar:",
      "links": "<a href='/AIV/26/40/5'>Ezek. 40:5</a>; <a href='/AIV/2/27/1'>Ex. 27:1</a>",
      "comment": "Prescribing the dimensions shows concern for reverent, regulated worship—important for correct sacrifice and worship that pleases God."
    },
    {
      "pk": 4304314,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 14,
      "text": "From the base on the ground to the lower ledge, two cubits high and one cubit wide; and from the smaller ledge to the larger ledge, four cubits high and one cubit wide.",
      "links": "<a href='/AIV/2/27/1-2'>Ex. 27:1-2</a>",
      "comment": "Continued focus on dimensions highlights the divine order; each part has significance, reflecting the dignity and holiness required in sacrificial worship."
    },
    {
      "pk": 4304315,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 15,
      "text": "The altar hearth shall be four cubits; and from the altar hearth project upward four horns.",
      "links": "<a href='/AIV/2/27/2'>Ex. 27:2</a>; <a href='/AIV/19/118/27'>Ps. 118:27</a>",
      "comment": "The ‘horns’ of the altar are places of refuge and atonement (<a href='/AIV/2/27/2'>Ex. 27:2</a>). The altar is the central place of sacrifice—an anticipation of the ultimate sacrifice of Christ, who fulfills the altar’s purpose."
    },
    {
      "pk": 4304316,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 16,
      "text": "The altar hearth shall be twelve cubits long by twelve cubits wide, square in its four sides.",
      "links": "<a href='/AIV/2/27/1'>Ex. 27:1</a>; <a href='/AIV/26/40/47'>Ezek. 40:47</a>",
      "comment": "The altar’s square shape and the number twelve recall the twelve tribes of Israel, signifying completeness and order in worship."
    },
    {
      "pk": 4304317,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 17,
      "text": "The ledge shall be fourteen cubits long by fourteen wide on its four sides, with a rim half a cubit high around it, and its base a cubit all around. Its steps shall face east.",
      "links": "<a href='/AIV/26/40/6'>Ezek. 40:6</a>",
      "comment": "The steps facing east recall the direction of God’s glory and signify that approach to God must always be ordered according to His revealed plan. Symbolically, this points to a liturgical orientation in worship."
    },
    {
      "pk": 4304318,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 18,
      "text": "And he said to me, 'Son of man, thus says the Lord GOD: These are the ordinances for the altar: when it is erected, to offer burnt offerings on it and to sprinkle blood on it.'",
      "links": "<a href='/AIV/2/29/36'>Ex. 29:36</a>; <a href='/AIV/3/1/5'>Lev. 1:5</a>",
      "comment": "Ordinances for sacrifices reinforce the continuity with Moses’ law, but the vision also points ahead to the perfect sacrifice—completed in Christ, who brings the true once-for-all atonement (<a href='/AIV/58/10/12'>Heb. 10:12</a>)."
    },
    {
      "pk": 4304319,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 19,
      "text": "You shall give to the Levitical priests, who are of the offspring of Zadok, who come near to me to minister to me, declares the Lord GOD, a bull from the herd for a sin offering.",
      "links": "<a href='/AIV/3/8/14'>Lev. 8:14</a>; <a href='/AIV/26/40/46'>Ezek. 40:46</a>",
      "comment": "Zadokite priests are set apart due to their faithfulness. Sacrificial terms are important for Israel’s ritual purity, but also have spiritual meaning—priesthood and true sacrifice are essential for restored worship."
    },
    {
      "pk": 4304320,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 20,
      "text": "You shall take some of its blood and put it on the four horns of the altar, and on the four corners of the ledge, and on the rim all around; thus you shall purify the altar and make atonement for it.",
      "links": "<a href='/AIV/3/8/15'>Lev. 8:15</a>; <a href='/AIV/26/45/18'>Ezek. 45:18</a>",
      "comment": "Blood is for purification and atonement, prefiguring the blood of Christ that purifies the heavenly altar once for all (<a href='/AIV/58/9/13-14'>Heb. 9:13-14</a>)."
    },
    {
      "pk": 4304321,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 21,
      "text": "You shall also take the bull for the sin offering, and burn it in the appointed place of the temple, outside the sanctuary.",
      "links": "<a href='/AIV/3/4/12'>Lev. 4:12</a>",
      "comment": "Sin offerings are burned outside the camp, just as Christ was crucified outside Jerusalem (<a href='/AIV/58/13/11-12'>Heb. 13:11-12</a>)."
    },
    {
      "pk": 4304322,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 22,
      "text": "On the second day you shall offer a male goat without blemish for a sin offering; and they shall purify the altar as they purified it with the bull.",
      "links": "<a href='/AIV/3/9/3'>Lev. 9:3</a>",
      "comment": "The sequence of offerings shows the repetition necessary under the old covenant, highlighting the sufficiency of Christ’s one, perfect sacrifice."
    },
    {
      "pk": 4304323,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 23,
      "text": "When you have finished purifying it, you shall offer a bull from the herd without blemish and a ram from the flock without blemish.",
      "links": "<a href='/AIV/3/1/3'>Lev. 1:3</a>",
      "comment": "‘Without blemish’ sacrifices point to the perfection required—fulfilled completely only in Christ, ‘the Lamb without blemish or spot’ (<a href='/AIV/60/1/19'>1 Pet. 1:19</a>)."
    },
    {
      "pk": 4304324,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 24,
      "text": "You shall present them before the LORD, and the priests shall throw salt on them and offer them up as a burnt offering to the LORD.",
      "links": "<a href='/AIV/3/2/13'>Lev. 2:13</a>",
      "comment": "The salt symbolizes preservation and covenant faithfulness (see <a href='/AIV/3/2/13'>Lev. 2:13</a>), anticipating the everlasting covenant."
    },
    {
      "pk": 4304325,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 25,
      "text": "For seven days you shall provide daily a male goat for a sin offering; also a bull from the herd and a ram from the flock, without blemish, shall be provided.",
      "links": "<a href='/AIV/2/29/37'>Ex. 29:37</a>",
      "comment": "Seven days signify completeness and consecration. The repetition contrasts with Christ’s sufficient, effectual offering (see <a href='/AIV/58/10/11'>Heb. 10:11</a>)."
    },
    {
      "pk": 4304326,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 26,
      "text": "For seven days they shall make atonement for the altar and cleanse it, and so consecrate it.",
      "links": "<a href='/AIV/3/8/33'>Lev. 8:33</a>; <a href='/AIV/2/29/37'>Ex. 29:37</a>",
      "comment": "The consecration of the altar is a foundational ritual, typologically fulfilled in Christ, who consecrates not just an earthly altar but a heavenly one by His own sacrifice."
    },
    {
      "pk": 4304327,
      "translation": "AIV",
      "book": 26,
      "chapter": 43,
      "verse": 27,
      "text": "And when they have completed these days, then from the eighth day onward, the priests shall offer your burnt offerings and your peace offerings on the altar; and I will accept you, declares the Lord GOD.",
      "links": "<a href='/AIV/3/9/1'>Lev. 9:1</a>; <a href='/AIV/24/33/11'>Jer. 33:11</a>",
      "comment": "The eighth day implies new creation and a new beginning, foreshadowing resurrection themes (see <a href='/AIV/41/16/9'>Mark 16:9</a>). God’s acceptance of offerings is ultimately realized in the perfect worship Christ establishes. The transition from physical ritual to pure worship is implied, in line with the development of the one true apostolic faith."
    }
  ],
  "translatedAt": "2025-12-23T07:09:41.251Z"
}