{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 22,
  "verses": [
    {
      "pk": 33022001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/3/16'>Ezek. 3:16</a>",
      "comment": "Ezekiel frequently begins his prophecies with this phrase, emphasizing divine initiative and the prophet's role as an instrument."
    },
    {
      "pk": 33022002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 2,
      "text": "“Son of man, will you judge, will you judge the city of blood? Then declare to her all her abominations.",
      "links": "<a href='/AIV/26/24/6'>Ezek. 24:6</a>; <a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "The phrase 'city of blood' refers to Jerusalem's violent history due to injustice and idolatry. Ezekiel is called to pronounce judgment—prefiguring Christ as ultimate Judge."
    },
    {
      "pk": 33022003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 3,
      "text": "You shall say: Thus says the Lord GOD: A city shedding blood in her midst, causing her time to come; and that makes idols to defile herself.",
      "links": "<a href='/AIV/26/5/7-8'>Ezek. 5:7-8</a>; <a href='/AIV/24/2/23'>Jer. 2:23</a>",
      "comment": "Jerusalem's guilt accelerates judgment and exile; idolatry is equated with self-defilement—anticipating New Testament warnings against spiritual idolatry."
    },
    {
      "pk": 33022004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 4,
      "text": "By your blood which you have shed, you have become guilty, and by your idols which you have made, you have defiled yourself. You have brought your days near and have come to your years. Therefore I have made you a reproach to the nations and a mocking to all the lands.",
      "links": "<a href='/AIV/26/36/19'>Ezek. 36:19</a>; <a href='/AIV/19/79/4'>Ps. 79:4</a>",
      "comment": "Their sins hasten judgment. Israel's shame among nations foreshadows the need for vindication through a faithful remnant and the Messiah."
    },
    {
      "pk": 33022005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 5,
      "text": "Those who are near and those who are far from you will mock you, you infamous and much troubled city.",
      "links": "<a href='/AIV/26/36/4'>Ezek. 36:4</a>; <a href='/AIV/19/44/13'>Ps. 44:13</a>",
      "comment": "The universal scorn Israel faces points to the need for national restoration, only ultimately fulfilled through God's redemptive plan."
    },
    {
      "pk": 33022006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 6,
      "text": "See, the princes of Israel, every one according to his power, have been intent on shedding blood within you.",
      "links": "<a href='/AIV/26/11/1'>Ezek. 11:1</a>; <a href='/AIV/23/1/23'>Isa. 1:23</a>",
      "comment": "Leadership corruption is highlighted; responsibility for justice and peace reflects a spiritual principle of stewardship in both old and new covenants."
    },
    {
      "pk": 33022007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 7,
      "text": "They have treated father and mother with contempt within you; they have oppressed the foreigner in your midst; they have wronged the orphan and the widow within you.",
      "links": "<a href='/AIV/02/22/21-22'>Ex. 22:21-22</a>; <a href='/AIV/19/94/6'>Ps. 94:6</a>",
      "comment": "Neglect of family and vulnerable people violates foundational moral laws. Care for the marginalized echoes Christ's teaching and early Church practice."
    },
    {
      "pk": 33022008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 8,
      "text": "You have despised my holy things and have profaned my Sabbaths.",
      "links": "<a href='/AIV/26/20/13-16'>Ezek. 20:13-16</a>",
      "comment": "Disregard for worship and sacred times undermines covenant relationship. Respect for holy times is a key theme in both old and ongoing ecclesial traditions."
    },
    {
      "pk": 33022009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 9,
      "text": "There are men slanderous to shed blood in you; they eat on the mountains; in your midst they commit lewdness.",
      "links": "<a href='/AIV/24/7/9'>Jer. 7:9</a>; <a href='/AIV/03/18/3'>Lev. 18:3</a>",
      "comment": "The mention of eating on the mountains alludes to idolatrous sacrifices, revealing how sin corrupts both social and religious life."
    },
    {
      "pk": 33022010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 10,
      "text": "In you, they have uncovered their father’s nakedness; in you they violate women who are unclean during their menstrual impurity.",
      "links": "<a href='/AIV/03/18/7-19'>Lev. 18:7-19</a>",
      "comment": "Violations of sexual purity laws are called out specifically, demonstrating the gravity of personal and corporate sin."
    },
    {
      "pk": 33022011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 11,
      "text": "One has committed abomination with his neighbor’s wife; another has lewdly defiled his daughter-in-law; and another has violated his sister, his father’s daughter, within you.",
      "links": "<a href='/AIV/03/18/8-15'>Lev. 18:8-15</a>",
      "comment": "The specific mention of sexual sins reinforces the seriousness of breaking divine law and the need for individual and communal repentance."
    },
    {
      "pk": 33022012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 12,
      "text": "In you they have taken bribes to shed blood; you have taken interest and profit and have unjustly gained from your neighbors by oppression. But you have forgotten me, says the Lord GOD.",
      "links": "<a href='/AIV/02/23/8'>Ex. 23:8</a>; <a href='/AIV/26/16/43'>Ezek. 16:43</a>",
      "comment": "Social injustice and economic sins are here tied directly to forgetfulness of God, indicating that faith must be lived through moral and economic justice."
    },
    {
      "pk": 33022013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 13,
      "text": "See, I strike my hand at your dishonest gain which you have acquired, and at the bloodshed which is in your midst.",
      "links": "<a href='/AIV/26/21/14'>Ezek. 21:14</a>",
      "comment": "Divine anger is expressed symbolically; 'striking the hand' signals righteous judgment and the seriousness of their crimes."
    },
    {
      "pk": 33022014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 14,
      "text": "Will your heart endure, or can your hands be strong, in the days when I shall deal with you? I, the LORD, have spoken, and I will do it.",
      "links": "<a href='/AIV/26/6/12'>Ezek. 6:12</a>; <a href='/AIV/04/23/19'>Num. 23:19</a>",
      "comment": "God’s power and faithfulness to carry out judgment is emphasized; divine promises—whether for blessing or discipline—are certain."
    },
    {
      "pk": 33022015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 15,
      "text": "I will scatter you among the nations and disperse you throughout the lands, and I will consume your uncleanness from you.",
      "links": "<a href='/AIV/03/26/33'>Lev. 26:33</a>; <a href='/AIV/26/36/24-25'>Ezek. 36:24-25</a>",
      "comment": "The dispersal promises purification through exile, anticipating God’s ultimate restoration and sanctification—a pattern seen in spiritual renewal."
    },
    {
      "pk": 33022016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 16,
      "text": "You will be profaned among the nations, and you shall know that I am the LORD.",
      "links": "<a href='/AIV/26/12/15'>Ezek. 12:15</a>",
      "comment": "God’s judgments serve pedagogical purposes: through suffering and exile, the people are brought back to knowledge of the true God."
    },
    {
      "pk": 33022017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 17,
      "text": "And the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/20/45'>Ezek. 20:45</a>",
      "comment": "A new oracle begins, marking a shift in focus. The structure emphasizes the authority of divine revelation."
    },
    {
      "pk": 33022018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 18,
      "text": "“Son of man, the house of Israel has become dross to me; all of them, bronze, tin, iron, and lead in the midst of the furnace; they have become dross from silver.",
      "links": "<a href='/AIV/19/119/119'>Ps. 119:119</a>; <a href='/AIV/23/1/22-25'>Isa. 1:22-25</a>",
      "comment": "Israel’s spiritual impurity is likened to worthless residue in metal refining; the furnace imagery points to necessary purification, prefiguring sanctification in Christ."
    },
    {
      "pk": 33022019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 19,
      "text": "Therefore, thus says the Lord GOD: Because you have all become dross, look, I will gather you into Jerusalem.",
      "links": "<a href='/AIV/26/22/21'>Ezek. 22:21</a>",
      "comment": "The gathering into Jerusalem is for judgment and purification—a strong parallel to final judgment motifs and purgative themes in salvation history."
    },
    {
      "pk": 33022020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 20,
      "text": "As they gather silver, bronze, iron, lead, and tin into the midst of a furnace to blow fire upon it, to melt it, so will I gather you in my anger and in my wrath, and put you there and melt you.",
      "links": "<a href='/AIV/23/48/10'>Isa. 48:10</a>; <a href='/AIV/19/66/10'>Ps. 66:10</a>",
      "comment": "The image of melting by fire invokes themes of trial by purification, alerting the reader to spiritual refinement necessary before communion with God."
    },
    {
      "pk": 33022021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 21,
      "text": "I will gather you and blow on you with the fire of my wrath, and you shall be melted in its midst.",
      "links": "<a href='/AIV/19/97/3'>Ps. 97:3</a>",
      "comment": "The furnace reveals God’s justice as consuming fire. Compare with the apostolic warnings in Hebrews 12:29 regarding God’s holiness."
    },
    {
      "pk": 33022022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 22,
      "text": "As silver is melted in the midst of the furnace, so you shall be melted in its midst; and you shall know that I, the LORD, have poured out my wrath upon you.",
      "links": "<a href='/AIV/19/119/119'>Ps. 119:119</a>",
      "comment": "God’s punitive actions are pedagogical: suffering is permitted for the sake of ultimate restoration and deeper knowledge of God."
    },
    {
      "pk": 33022023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 23,
      "text": "And the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/20/45'>Ezek. 20:45</a>",
      "comment": "Initiates a new segment—God continues to reveal the depth and breadth of Israel’s sin."
    },
    {
      "pk": 33022024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 24,
      "text": "“Son of man, say to her: ‘You are a land that is not cleansed, nor rained upon in the day of indignation.’",
      "links": "<a href='/AIV/23/5/6'>Isa. 5:6</a>",
      "comment": "Withheld rain is a sign of judgment—a symbol of spiritual dryness, reflecting a theme of divine absence until repentance."
    },
    {
      "pk": 33022025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 25,
      "text": "There is a conspiracy of her prophets within her; like a roaring lion tearing the prey, they devour lives. They take treasures and precious things and make many widows within her.",
      "links": "<a href='/AIV/26/13/10'>Ezek. 13:10</a>; <a href='/AIV/24/23/11'>Jer. 23:11</a>",
      "comment": "Religious leaders misuse authority and abuse the flock, highlighting the importance of doctrinal fidelity and authentic spiritual leadership."
    },
    {
      "pk": 33022026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 26,
      "text": "Her priests have offended my law and have profaned my holy things. They have made no distinction between the holy and the common, nor have they taught the difference between the unclean and the clean, and they have hidden their eyes from my Sabbaths, so I am profaned among them.",
      "links": "<a href='/AIV/03/10/10'>Lev. 10:10</a>; <a href='/AIV/26/44/23'>Ezek. 44:23</a>",
      "comment": "Priestly failures underline the need for visible, sacramental distinction—pointing to continuity between Old Covenant and the apostolic church’s liturgical and moral teaching."
    },
    {
      "pk": 33022027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 27,
      "text": "Her princes within her are like wolves tearing the prey, shedding blood, destroying lives to get dishonest gain.",
      "links": "<a href='/AIV/26/34/2'>Ezek. 34:2</a>",
      "comment": "Political leaders’ violence and greed are condemned. The wolf imagery reappears in Jesus’s teaching on false prophets (Matt. 7:15)."
    },
    {
      "pk": 33022028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 28,
      "text": "Her prophets have whitewashed their deeds for them with false visions and lying divinations. They say, ‘Thus says the Lord GOD,’ when the LORD has not spoken.",
      "links": "<a href='/AIV/26/13/6'>Ezek. 13:6</a>; <a href='/AIV/24/14/14'>Jer. 14:14</a>",
      "comment": "False prophecy is rebuked, showing the necessity for recognized, authoritative interpretation grounded in authentic tradition."
    },
    {
      "pk": 33022029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 29,
      "text": "The people of the land have practiced extortion and committed robbery; they have oppressed the poor and needy, and have wronged the foreigner without justice.",
      "links": "<a href='/AIV/19/72/4'>Ps. 72:4</a>",
      "comment": "Collective guilt is highlighted—justice for the poor and stranger is central to biblical ethics and is a spiritual work of mercy."
    },
    {
      "pk": 33022030,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 30,
      "text": "I searched for a man among them who would build up the wall and stand in the gap before me for the land, so that I would not destroy it; but I found none.",
      "links": "<a href='/AIV/19/106/23'>Ps. 106:23</a>; <a href='/AIV/02/32/11'>Ex. 32:11</a>",
      "comment": "God seeks an intercessor. This prefigures the role of Christ as the Mediator and highlights the continuing need for intercessory prayer within the community."
    },
    {
      "pk": 33022031,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 22,
      "verse": 31,
      "text": "Therefore I have poured out my indignation upon them; I have consumed them with the fire of my wrath. I have returned their ways upon their heads, declares the Lord GOD.",
      "links": "<a href='/AIV/26/7/8'>Ezek. 7:8</a>",
      "comment": "Judgment is recapitulated as a consequence of unrepentant sin. This passage prepares for restoration themes to follow in later chapters, emphasizing God’s justice and mercy."
    }
  ],
  "translatedAt": "2025-12-24T09:10:18.974Z"
}