{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 30,
  "verses": [
    {
      "pk": 3403001,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/29/1'>Ezek. 29:1</a>",
      "comment": "The phrase 'the word of the LORD came to me' is commonly used in Ezekiel to establish prophetic authority. The emphasis is on divine revelation given to the prophet directly."
    },
    {
      "pk": 3403002,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 2,
      "text": "Son of man, prophesy and say, 'Thus says the Lord GOD: Wail, “Alas for the day!”'",
      "links": "<a href='/AIV/29/1/15'>Joel 1:15</a>; <a href='/AIV/02/12/30'>Ex. 12:30</a>",
      "comment": "Addressing Ezekiel as 'Son of man' highlights both his humanity and the prophetic role, a term Jesus later uses for Himself, establishing a connection between prophecy and fulfillment in Christ."
    },
    {
      "pk": 3403003,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 3,
      "text": "For the day is near, the day of the LORD is near; it will be a day of clouds, a time of doom for the nations.",
      "links": "<a href='/AIV/23/13/6'>Isa. 13:6</a>; <a href='/AIV/29/2/2'>Joel 2:2</a>",
      "comment": "The 'day of the LORD' refers to a coming time of judgment and reckoning, both historically imminent for Egypt and later in eschatological perspective—a theme echoed in the New Testament (e.g., 1 Thess. 5:2)."
    },
    {
      "pk": 3403004,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 4,
      "text": "A sword will come upon Egypt, and anguish shall be in Cush, when the slain fall in Egypt, and her wealth is taken away, and her foundations are torn down.",
      "links": "<a href='/AIV/24/46/13'>Jer. 46:13</a>; <a href='/AIV/26/32/12'>Ezek. 32:12</a>",
      "comment": "Egypt’s neighbors are drawn into her judgment. The image of the sword and the fall of foundations symbolize complete devastation, reflecting God’s sovereignty over nations."
    },
    {
      "pk": 3403005,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 5,
      "text": "Cush, Put, Lud, all Arabia, Libya, and the people of the land that is in league shall fall with them by the sword.",
      "links": "<a href='/AIV/24/46/9'>Jer. 46:9</a>; <a href='/AIV/38/2/10'>Zech. 2:10</a>",
      "comment": "These were allied nations or mercenaries supporting Egypt. Their collective downfall signifies the universal scope of God's justice beyond Israel alone."
    },
    {
      "pk": 3403006,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 6,
      "text": "Thus says the LORD: 'Those who uphold Egypt shall fall, and its proud strength shall come down; from Migdol to Syene they shall fall within her by the sword,' declares the Lord GOD.",
      "links": "<a href='/AIV/26/29/10'>Ezek. 29:10</a>",
      "comment": "The phrase 'from Migdol to Syene' means from north to south, encompassing all Egypt. God's declaration demonstrates universal authority and judgment over all people."
    },
    {
      "pk": 3403007,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 7,
      "text": "They shall be desolate in the midst of the desolated countries, and their cities shall be among the ruined cities.",
      "links": "<a href='/AIV/26/32/18'>Ezek. 32:18</a>",
      "comment": "This imagery highlights the total devastation foretold, emotionally resonant for Israelites who’d suffered similar judgments—reminding of the cost of idolatry and rebellion."
    },
    {
      "pk": 3403008,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 8,
      "text": "Then they will know that I am the LORD, when I set fire to Egypt, and all her helpers are broken.",
      "links": "<a href='/AIV/26/6/7'>Ezek. 6:7</a>",
      "comment": "'Then they will know that I am the LORD' is a repeated refrain, emphasizing the revelation of God's identity through judgment—pointing forward typologically to Christ as the ultimate revelation of God."
    },
    {
      "pk": 3403009,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 9,
      "text": "On that day, swift messengers will go out from me in ships to terrify the unsuspecting Cushites, and anguish will come upon them on the day of Egypt’s doom; for, behold, it comes!",
      "links": "<a href='/AIV/23/18/2'>Isa. 18:2</a>",
      "comment": "The swiftness of the messengers expresses inevitability and the inescapable reach of God’s decrees. The geographical mobility hints at the all-encompassing authority of the Lord."
    },
    {
      "pk": 3403010,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 10,
      "text": "Thus says the Lord GOD: 'I will put an end to the wealth of Egypt by the hand of Nebuchadnezzar king of Babylon.'",
      "links": "<a href='/AIV/26/29/19'>Ezek. 29:19</a>; <a href='/AIV/24/43/10'>Jer. 43:10</a>",
      "comment": "Nebuchadnezzar serves as an instrument of divine justice. The Lord’s sovereignty is highlighted as He directs history’s great empires, reinforcing His ultimate kingship."
    },
    {
      "pk": 3403011,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 11,
      "text": "He and his people with him, the most ruthless of nations, shall be brought in to destroy the land. They will draw their swords against Egypt and fill the land with the slain.",
      "links": "<a href='/AIV/26/28/7'>Ezek. 28:7</a>",
      "comment": "Babylon’s armies are called 'the most ruthless of nations,' underscoring the severity of the coming judgment, pointing toward God even using pagan nations for His purposes."
    },
    {
      "pk": 3403012,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 12,
      "text": "And I will dry up the Nile and sell the land into the hand of evildoers; I will bring desolation upon the land and everything in it by the hand of foreigners; I, the LORD, have spoken.",
      "links": "<a href='/AIV/02/7/18'>Ex. 7:18</a>; <a href='/AIV/23/19/5'>Isa. 19:5</a>",
      "comment": "Drought in the Nile evokes echoes of the plagues in Egypt—in both cases the Lord demonstrates His supremacy over creation and the gods of the nations."
    },
    {
      "pk": 3403013,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 13,
      "text": "Thus says the Lord GOD: 'I will destroy the idols and put an end to the images in Memphis; there shall no longer be a prince from the land of Egypt; so I will put fear in the land of Egypt.'",
      "links": "<a href='/AIV/26/6/4'>Ezek. 6:4</a>; <a href='/AIV/23/19/13'>Isa. 19:13</a>",
      "comment": "The removal of idols and princes symbolizes total spiritual and political collapse, reminding believers of God’s call to authentic worship and single-minded devotion."
    },
    {
      "pk": 3403014,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 14,
      "text": "'I will make Pathros desolate, set fire to Zoan, and execute judgments on Thebes.'",
      "links": "<a href='/AIV/23/19/11'>Isa. 19:11</a>",
      "comment": "Specific cities represent the heart of Egypt’s culture and spiritual influence. God’s judgment emphasizes His particular attention to spiritual leadership and governance."
    },
    {
      "pk": 3403015,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 15,
      "text": "I will pour out my wrath on Pelusium, the stronghold of Egypt; I will cut off the multitude of Thebes.",
      "links": "<a href='/AIV/34/3/8'>Nah. 3:8</a>",
      "comment": "The pouring out of wrath is characteristic of divine justice, yet, in the broader biblical story, foreshadows Christ bearing the wrath for human sin (cf. 1 Thess. 1:10)."
    },
    {
      "pk": 3403016,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 16,
      "text": "I will set fire to Egypt; Pelusium will writhe in anguish, Thebes will be breached, and Memphis will face daily distress.",
      "links": "<a href='/AIV/23/19/16'>Isa. 19:16</a>",
      "comment": "The repeated 'I will' statements express God’s initiative and power—not merely historical fate, but intentional divine action designed to bring about repentance and recognition."
    },
    {
      "pk": 3403017,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 17,
      "text": "The young men of On and Pi-beseth shall fall by the sword, and the cities shall go into captivity.",
      "links": "<a href='/AIV/24/43/12'>Jer. 43:12</a>",
      "comment": "Loss of the youth symbolizes the cutting off of future hope and strength, a consequence of persisting in idolatry—a call for every generation to seek faithfulness to the Lord."
    },
    {
      "pk": 3403018,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 18,
      "text": "At Tahpanhes the day shall be dark, when I break the yoke of Egypt there, and her proud strength shall come to an end in her; as for her, a cloud will cover her, and her daughters shall go into captivity.",
      "links": "<a href='/AIV/24/43/7'>Jer. 43:7</a>",
      "comment": "Darkness is both literal and symbolic for loss and mourning, paralleling the plague of darkness in Exodus—a type fulfilled in Christ who is the light conquering darkness (John 1:5)."
    },
    {
      "pk": 3403019,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 19,
      "text": "Thus I will execute judgments on Egypt; then they will know that I am the LORD.'",
      "links": "<a href='/AIV/26/25/11'>Ezek. 25:11</a>",
      "comment": "God’s judgments serve to reveal Himself to the nations, ultimately drawing all peoples to the knowledge of the one true God (cf. Phil. 2:10-11)."
    },
    {
      "pk": 3403020,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 20,
      "text": "In the eleventh year, in the first month, on the seventh day of the month, the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/29/1'>Ezek. 29:1</a>",
      "comment": "The detailed date gives historical specificity, underlining the reliability and historicity of biblical prophecy."
    },
    {
      "pk": 3403021,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 21,
      "text": "'Son of man, I have broken the arm of Pharaoh king of Egypt, and behold, it has not been bound up to heal it by binding with a bandage, so that it may become strong enough to wield the sword.'",
      "links": "<a href='/AIV/26/30/24'>Ezek. 30:24</a>",
      "comment": "The broken arm is a metaphor for irrevocable defeat—the inability to defend oneself. Healing imagery highlights the need for a true and effective restoration, which can ultimately only be fulfilled in the Messiah’s redemptive work."
    },
    {
      "pk": 3403022,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 22,
      "text": "Therefore thus says the Lord GOD: Behold, I am against Pharaoh king of Egypt, and will break his arms, both the strong and the broken; and I will make the sword fall from his hand.",
      "links": "<a href='/AIV/26/17/17'>Ezek. 17:17</a>",
      "comment": "Breaking both arms ('the strong and the broken') reinforces the totality of Pharaoh’s fall—no security or human strength can stand against God."
    },
    {
      "pk": 3403023,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 23,
      "text": "I will scatter the Egyptians among the nations, and disperse them through the countries.",
      "links": "<a href='/AIV/05/28/64'>Deut. 28:64</a>",
      "comment": "The exile motif echoes Israel’s own experiences (Deut. 28:64), showing that judgment is impartial, and yet is always meant to lead to repentance and restoration."
    },
    {
      "pk": 3403024,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 24,
      "text": "And I will strengthen the arms of the king of Babylon and put my sword in his hand, but I will break the arms of Pharaoh, and he will groan before him with the groans of a mortally wounded man.",
      "links": "<a href='/AIV/26/21/19'>Ezek. 21:19</a>",
      "comment": "God’s sovereignty is displayed as He empowers one ruler and weakens another. 'My sword' indicates His ultimate control over the instruments of justice on earth."
    },
    {
      "pk": 3403025,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 25,
      "text": "'I will strengthen the arms of the king of Babylon, but the arms of Pharaoh shall fall. Then they will know that I am the LORD, when I put my sword into the hand of the king of Babylon and he stretches it out against the land of Egypt.'",
      "links": "<a href='/AIV/26/29/20'>Ezek. 29:20</a>",
      "comment": "Repetition of divine initiative. Recognition of God’s authority comes through these true and fulfilled prophecies, which anticipate the greater authority and mission of the Messiah over all nations."
    },
    {
      "pk": 3403026,
      "translation": "AIV",
      "book": 26,
      "chapter": 30,
      "verse": 26,
      "text": "I will scatter the Egyptians among the nations and disperse them among the countries. Then they will know that I am the LORD.'",
      "links": "<a href='/AIV/26/12/15'>Ezek. 12:15</a>",
      "comment": "The recurring phrase 'they will know that I am the LORD' stresses God’s desire to reveal Himself to all peoples. The scattering also prefigures the later gathering of nations to worship God together (cf. Rev. 7:9), a spiritual unity modeled in the New Testament Church."
    }
  ],
  "translatedAt": "2025-12-23T07:02:20.924Z"
}