{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 30,
  "verses": [
    {
      "pk": 33030001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 1,
      "text": "The word of the LORD came to me again, saying:",
      "links": "<a href='/AIV/26/29/1'>Ezek. 29:1</a>; <a href='/AIV/26/30/20'>Ezek. 30:20</a>",
      "comment": "As with previous prophecies, God is once more directly speaking to Ezekiel, establishing the authority of this message as divine revelation."
    },
    {
      "pk": 33030002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 2,
      "text": "Son of man, prophesy and say, 'This is what the Lord GOD says: Wail, “Alas for the day!”'",
      "links": "<a href='/AIV/29/1/15'>Joel 1:15</a>; <a href='/AIV/23/13/6'>Isa. 13:6</a>",
      "comment": "The phrase 'son of man' emphasizes Ezekiel’s role as a representative of humanity. The cry for the day points toward the impending judgment, a theme echoed in later prophecies of the 'Day of the Lord'."
    },
    {
      "pk": 33030003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 3,
      "text": "For the day is near; yes, the day of the LORD is near—a day of clouds, a time of doom for the nations.",
      "links": "<a href='/AIV/29/2/1-2'>Joel 2:1-2</a>; <a href='/AIV/23/13/9'>Isa. 13:9</a>",
      "comment": "'Day of the LORD' refers to God's ultimate intervention in history. The gathering of nations for judgment parallels end-time prophecies, pointing both to immediate events and a future, more universal fulfillment (see Joel 2:1-2)."
    },
    {
      "pk": 33030004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 4,
      "text": "A sword will come against Egypt, and anguish will be in Cush, when the slain fall in Egypt, and her wealth is carried away, and her foundations are torn down.",
      "links": "<a href='/AIV/26/29/19'>Ezek. 29:19</a>; <a href='/AIV/23/20/3-4'>Isa. 20:3-4</a>",
      "comment": "The judgment stretches from Egypt to Cush (Nubia/Ethiopia), showing the broad reach of God's sovereignty and justice. 'Foundations' being destroyed often represents not only physical devastation but a shaking of spiritual powers (see Isa. 20:3-4)."
    },
    {
      "pk": 33030005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 5,
      "text": "Cush, Put, Lud, all Arabia, Libya, and the people of the land that is in alliance will fall with them by the sword.",
      "links": "<a href='/AIV/24/46/9'>Jer. 46:9</a>; <a href='/AIV/26/27/10'>Ezek. 27:10</a>",
      "comment": "Many nations tied to Egypt face the same judgment. The alliances of men cannot save them—a recurring biblical theme that highlights the need for trust in God's sovereignty over human power."
    },
    {
      "pk": 33030006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 6,
      "text": "'This is what the LORD says: Those who support Egypt will fall, and her proud strength will descend. From Migdol to Syene they will fall by the sword, declares the Lord GOD.'",
      "links": "<a href='/AIV/26/29/10'>Ezek. 29:10</a>",
      "comment": "'Migdol to Syene' signals the entire stretch of Egypt, emphasizing the completeness of the judgment. Human pride opposed to God is always condemned, foreshadowing themes against self-reliance (see Luke 18:14)."
    },
    {
      "pk": 33030007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 7,
      "text": "They will be desolate among devastated lands, and their cities will lie among ruined cities.",
      "links": "<a href='/AIV/26/29/12'>Ezek. 29:12</a>",
      "comment": "This verse reiterates the utter destruction Egypt will face, analogous to the desolations prophesied for Jerusalem for its unfaithfulness. The imagery recalls the consequences of sin and separation from God."
    },
    {
      "pk": 33030008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 8,
      "text": "They will know that I am the LORD when I set fire to Egypt and all her allies are broken.",
      "links": "<a href='/AIV/26/6/7'>Ezek. 6:7</a>; <a href='/AIV/26/29/6'>Ezek. 29:6</a>",
      "comment": "The recurring phrase 'they will know that I am the LORD' shows that judgment serves to reveal God’s glory and lordship, inviting all nations to true worship—a plan unified across all salvation history."
    },
    {
      "pk": 33030009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 9,
      "text": "In that day, messengers will go out from Me in ships to terrify confident Cush. Anguish will seize them on the day of Egypt’s doom; for behold, it is coming.",
      "links": "<a href='/AIV/23/18/1-2'>Isa. 18:1-2</a>",
      "comment": "God’s authority extends to initiating fear in mighty nations, again underlining His universal dominion. The sending of messengers anticipates apostolic missions—a foreshadowing of God’s reach to all the nations."
    },
    {
      "pk": 33030010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 10,
      "text": "'This is what the Lord GOD says: I will put an end to the pride of Egypt by the hand of Nebuchadnezzar king of Babylon.'",
      "links": "<a href='/AIV/26/29/19'>Ezek. 29:19</a>; <a href='/AIV/24/43/10'>Jer. 43:10</a>",
      "comment": "Babylon becomes the instrument of God’s judgment, showing that He uses even pagan nations for His broader purposes. This prefigures how God’s providence works through history to bring about His will."
    },
    {
      "pk": 33030011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 11,
      "text": "'He and his army—the most ruthless of nations—will be brought in to destroy the land. They will draw their swords against Egypt and fill the land with the slain.'",
      "links": "<a href='/AIV/26/28/7'>Ezek. 28:7</a>; <a href='/AIV/26/32/12'>Ezek. 32:12</a>",
      "comment": "The Babylonian army’s violence is described as divinely permitted. Scripture frequently affirms that God remains sovereign even over suffering and apparent chaos."
    },
    {
      "pk": 33030012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 12,
      "text": "'I will make the streams dry and sell the land into the hands of evil men. I will lay waste the land and all that fills it by the hand of foreigners. I, the LORD, have spoken.'",
      "links": "<a href='/AIV/23/19/5-6'>Isa. 19:5-6</a>; <a href='/AIV/20/21/1'>Prov. 21:1</a>",
      "comment": "The drying of streams has echoes of the plagues in Exodus, highlighting God’s power over creation. The phrase 'I, the LORD, have spoken' gives absolute weight to the threat and is a mark of certain fulfillment."
    },
    {
      "pk": 33030013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 13,
      "text": "'This is what the Lord GOD says: I will destroy the idols and put an end to the images in Memphis. There will be no longer a prince in the land of Egypt, and I will put fear in the land of Egypt.'",
      "links": "<a href='/AIV/24/46/25'>Jer. 46:25</a>; <a href='/AIV/23/19/1'>Isa. 19:1</a>",
      "comment": "The removal of idols points to the supremacy of worshipping the true God and the end of false religion—a theme that later prophets and Christ Himself will return to (see John 4:23-24 for true worship)."
    },
    {
      "pk": 33030014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 14,
      "text": "'I will make Pathros desolate and set fire to Zoan and execute judgments on Thebes.'",
      "links": "<a href='/AIV/23/19/11'>Isa. 19:11</a>",
      "comment": "Major Egyptian centers are named to mark the thoroughness of judgment. Thebes and Zoan (Tanis) represent the heart of Egyptian spiritual and political power, showing God's supremacy against earthly rulers."
    },
    {
      "pk": 33030015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 15,
      "text": "'I will pour out My wrath on Sin, the stronghold of Egypt, and I will cut off the wealth of Thebes.'",
      "links": "<a href='/AIV/23/19/13'>Isa. 19:13</a>",
      "comment": "'Sin' is Pelusium, another fortress. God is emphasizing that no earthly fortification can stand against His will, calling to mind Jesus’ later statements about the futility of storing treasure on earth (Matt. 6:19-20)."
    },
    {
      "pk": 33030016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 16,
      "text": "'I will set fire to Egypt. Sin will writhe in anguish; Thebes will be taken and Memphis will face enemies by day.'",
      "links": "<a href='/AIV/23/19/17'>Isa. 19:17</a>",
      "comment": "The emphasis here is on the inescapable nature of divine judgment—no city, however powerful or historic, will evade the consequences."
    },
    {
      "pk": 33030017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 17,
      "text": "The young men of On and Pi-beseth will fall by the sword, and the cities will go into captivity.",
      "links": "<a href='/AIV/24/43/13'>Jer. 43:13</a>",
      "comment": "On (Heliopolis) and Pi-beseth (Bubastis) were centers of idolatry. Their downfall highlights that God’s judgment purifies and renews, preparing the world for future grace and restoration."
    },
    {
      "pk": 33030018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 18,
      "text": "In Tehaphnehes the day will be dark, when I break the yoke of Egypt there. Her proud strength will cease in her; a cloud will cover her, and her daughters will go into captivity.",
      "links": "<a href='/AIV/24/43/7-9'>Jer. 43:7-9</a>",
      "comment": "The 'cloud' is a sign of mourning and judgment. The 'daughters' (smaller towns) go into captivity, demonstrating how sin and pride bring devastation even to those seemingly far from the epicenter."
    },
    {
      "pk": 33030019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 19,
      "text": "Thus I will execute judgment on Egypt, and they will know that I am the LORD.",
      "links": "<a href='/AIV/26/29/9'>Ezek. 29:9</a>",
      "comment": "The purpose of judgment is not mere punishment, but the revelation of God as the only true Lord. This theme carries into New Testament teaching on final judgment and the hope of every knee bowing before God (see Phil. 2:10-11)."
    },
    {
      "pk": 33030020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 20,
      "text": "In the eleventh year, in the first month, on the seventh day, the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/29/1'>Ezek. 29:1</a>; <a href='/AIV/26/24/1'>Ezek. 24:1</a>",
      "comment": "The precise dating underscores the historical reliability of the prophecy and God’s involvement in concrete history—not just abstract spiritual ideas."
    },
    {
      "pk": 33030021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 21,
      "text": "Son of man, I have broken the arm of Pharaoh king of Egypt. And it has not been bound up to be healed, or splinted to put it in a sling, so that it may be strong to wield the sword.",
      "links": "<a href='/AIV/23/30/7'>Isa. 30:7</a>",
      "comment": "The broken arm symbolizes broken power and helplessness. The medical imagery suggests Egypt’s irreparable decline—a lesson that rebellious power cannot sustain itself against God’s will."
    },
    {
      "pk": 33030022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 22,
      "text": "Therefore, this is what the Lord GOD says: I am against Pharaoh king of Egypt and will break his arms, both the strong and the broken one. I will make the sword fall from his hand.",
      "links": "<a href='/AIV/26/29/3'>Ezek. 29:3</a>",
      "comment": "The complete breaking of Pharaoh’s strength stresses God’s active opposition to prideful rulers. This brings continuity to the story of divine opposition to Pharaohs both in Exodus and here."
    },
    {
      "pk": 33030023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 23,
      "text": "I will scatter the Egyptians among the nations and disperse them throughout the lands.",
      "links": "<a href='/AIV/26/29/12'>Ezek. 29:12</a>",
      "comment": "Exile as judgment is an important biblical motif. It both punishes and creates opportunity for repentance—a pattern repeated throughout salvation history, from Adam to exile to restoration."
    },
    {
      "pk": 33030024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 24,
      "text": "I will strengthen the arms of the king of Babylon and put My sword in his hand; but I will break Pharaoh’s arms, and he will groan before him as one mortally wounded.",
      "links": "<a href='/AIV/26/27/10'>Ezek. 27:10</a>",
      "comment": "God raises up one ruler and humbles another, showing His absolute lordship over history. This prefigures the rise and fall of nations throughout the Bible and the ultimate victory of God’s kingdom."
    },
    {
      "pk": 33030025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 25,
      "text": "I will strengthen the arms of the king of Babylon, but the arms of Pharaoh will fall. Then they will know that I am the LORD when I put My sword into the hand of the king of Babylon and he stretches it out against the land of Egypt.",
      "links": "<a href='/AIV/26/29/20'>Ezek. 29:20</a>",
      "comment": "The repetition affirms God’s deliberate action and the certainty of His words. The implication is that victory or defeat depends not on human effort, but God’s intervention—a teaching later clarified in Christian doctrine regarding the role of divine grace."
    },
    {
      "pk": 33030026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 30,
      "verse": 26,
      "text": "I will scatter the Egyptians among the nations and disperse them throughout the countries. Then they will know that I am the LORD.",
      "links": "<a href='/AIV/26/29/12'>Ezek. 29:12</a>; <a href='/AIV/02/9/16'>Ex. 9:16</a>",
      "comment": "The closing echoes an earlier refrain: exile and dispersion await Egypt. The ultimate goal, however, is that all peoples recognize the true God—a thread culminating in the call to unity and worship found in the New Testament (see Eph. 4:4-6)."
    }
  ],
  "translatedAt": "2025-12-24T09:15:04.472Z"
}