{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 9,
  "verses": [
    {
      "pk": 3919901,
      "translation": "AIV",
      "book": 26,
      "chapter": 9,
      "verse": 1,
      "text": "Then He cried in my ears with a loud voice, saying, 'Bring near those who have charge over the city, each with his weapon of destruction in his hand.'",
      "links": "<a href='/AIV/26/10/2'>Ezek. 10:2</a>; <a href='/AIV/23/13/3-5'>Isa. 13:3-5</a>",
      "comment": "The figures summoned are heavenly agents of judgment. The text stresses their authority over Jerusalem in executing divine punishment, pointing ahead to later themes of God's justice and mercy displayed through mediators."
    },
    {
      "pk": 3919902,
      "translation": "AIV",
      "book": 26,
      "chapter": 9,
      "verse": 2,
      "text": "And behold, six men came from the direction of the upper gate, which faces north, each with his weapon for slaughter in his hand. And among them was a man clothed in linen, who had a writing case at his side. They went in and stood beside the bronze altar.",
      "links": "<a href='/AIV/26/10/2-7'>Ezek. 10:2-7</a>; <a href='/AIV/27/10/5'>Dan. 10:5</a>",
      "comment": "The 'man clothed in linen' is often seen as an angelic figure distinguished for a priestly or mediatorial role. The bronze altar marks the place of sacrifice, foreshadowing a spiritual cleansing that connects to New Testament concepts of intercession and Christ as High Priest (<a href='/AIV/58/9/11-14'>Heb. 9:11-14</a>)."
    },
    {
      "pk": 3919903,
      "translation": "AIV",
      "book": 26,
      "chapter": 9,
      "verse": 3,
      "text": "Now the glory of the God of Israel had gone up from the cherub, where it had rested, to the threshold of the house. And He called to the man clothed in linen, who had the writing case at his side.",
      "links": "<a href='/AIV/26/10/18-19'>Ezek. 10:18-19</a>; <a href='/AIV/26/43/2'>Ezek. 43:2</a>",
      "comment": "The movement of God's glory signifies judgment and the temporary departure of God's presence due to sin. The focus on 'threshold of the house' shows the shift from mercy to judgment, but also the hope of eventual restoration of God's dwelling with His people (<a href='/AIV/43/1/14'>John 1:14</a>)."
    },
    {
      "pk": 3919904,
      "translation": "AIV",
      "book": 26,
      "chapter": 9,
      "verse": 4,
      "text": "And the LORD said to him, 'Pass through the city, through Jerusalem, and put a mark on the foreheads of the men who sigh and groan over all the abominations that are committed in it.'",
      "links": "<a href='/AIV/2/12/13'>Ex. 12:13</a>; <a href='/AIV/66/7/3'>Rev. 7:3</a>; <a href='/AIV/66/9/4'>Rev. 9:4</a>",
      "comment": "The marking of the faithful recalls the Passover and anticipates the sealing of the servants of God in Revelation. Spiritual protection comes to those set apart by sorrow over sin—a powerful image of sacramental grace marking believers inwardly as belonging to God."
    },
    {
      "pk": 3919905,
      "translation": "AIV",
      "book": 26,
      "chapter": 9,
      "verse": 5,
      "text": "And to the others He said in my hearing, 'Pass through the city after him, and strike. Your eye shall not spare, and you shall show no pity.'",
      "links": "<a href='/AIV/26/5/11'>Ezek. 5:11</a>; <a href='/AIV/5/36/33'>Deut. 33:29</a>",
      "comment": "Judgment follows for those not marked. The impartiality of God's justice is underscored while showing that divine mercy always precedes judgment, fitting with the scriptural pattern of warning before wrath (see also <a href='/AIV/2/32/27-28'>Ex. 32:27-28</a>)."
    },
    {
      "pk": 3919906,
      "translation": "AIV",
      "book": 26,
      "chapter": 9,
      "verse": 6,
      "text": "'Kill old men outright, young men and maidens, little children and women, but touch no one on whom is the mark. And begin at my sanctuary.' So they began with the elders who were before the house.",
      "links": "<a href='/AIV/3/10/3'>Lev. 10:3</a>; <a href='/AIV/66/14/1'>Rev. 14:1</a>",
      "comment": "Judgment begins with those in places of spiritual leadership—the elders at the sanctuary—paralleling New Testament teaching that judgment begins with the household of God (<a href='/AIV/60/4/17'>1 Pet. 4:17</a>). This stresses the importance of spiritual authority and accountability."
    },
    {
      "pk": 3919907,
      "translation": "AIV",
      "book": 26,
      "chapter": 9,
      "verse": 7,
      "text": "Then He said to them, 'Defile the house, and fill the courts with the slain. Go out.' So they went out and struck in the city.",
      "links": "<a href='/AIV/26/7/22'>Ezek. 7:22</a>; <a href='/AIV/25/2/7'>Lam. 2:7</a>",
      "comment": "The defilement of the sanctuary demonstrates the consequences of persistent sin. There is an implicit call to the sanctity and reverence due to God's house, a theme deeply woven through all of Scripture (see <a href='/AIV/43/2/16-17'>John 2:16-17</a>)."
    },
    {
      "pk": 3919908,
      "translation": "AIV",
      "book": 26,
      "chapter": 9,
      "verse": 8,
      "text": "While they were striking, I was left alone, and I fell on my face and cried out, 'Alas, Lord GOD! Will you destroy all the remnant of Israel in your outpouring of wrath on Jerusalem?'",
      "links": "<a href='/AIV/26/11/13'>Ezek. 11:13</a>; <a href='/AIV/1/18/23'>Gen. 18:23</a>",
      "comment": "Ezekiel’s intercession echoes that of Abraham and Moses, highlighting the role of intercessors in mediating between God and His people—a foreshadowing of the ultimate Intercessor (<a href='/AIV/58/7/25'>Heb. 7:25</a>)."
    },
    {
      "pk": 3919909,
      "translation": "AIV",
      "book": 26,
      "chapter": 9,
      "verse": 9,
      "text": "Then He said to me, 'The guilt of the house of Israel and Judah is exceedingly great. The land is full of blood, and the city full of injustice. For they say, “The LORD has forsaken the land, and the LORD does not see.”'",
      "links": "<a href='/AIV/26/8/12'>Ezek. 8:12</a>; <a href='/AIV/19/94/7'>Ps. 94:7</a>",
      "comment": "The people deny God’s presence and justice, illustrating the blindness that comes from persistent sin (<a href='/AIV/6/7/20'>Josh. 7:20</a>). The text shows that separation from God is due to unrepented wrongdoing rather than God’s absence—a call to ongoing conversion."
    },
    {
      "pk": 3919910,
      "translation": "AIV",
      "book": 26,
      "chapter": 9,
      "verse": 10,
      "text": "'As for me, My eye will not spare, nor will I have pity; I will bring their conduct upon their heads.'",
      "links": "<a href='/AIV/26/8/18'>Ezek. 8:18</a>; <a href='/AIV/2/34/7'>Ex. 34:7</a>",
      "comment": "Divine justice refuses compromise with evil, reminding us of God's holiness and the necessity for repentance. The phrase 'their conduct upon their heads' connects to other passages where personal responsibility and the call to repentance are highlighted."
    },
    {
      "pk": 3919911,
      "translation": "AIV",
      "book": 26,
      "chapter": 9,
      "verse": 11,
      "text": "And behold, the man clothed in linen, with the writing case at his side, brought back word, saying, 'I have done as you commanded me.'",
      "links": "<a href='/AIV/26/10/6-7'>Ezek. 10:6-7</a>",
      "comment": "The obedience of the man in linen highlights the faithfulness of God's servants and the effectiveness of God's commands. This passage offers a spiritual lesson regarding the necessity of cooperating with God's will through faithful obedience—a model for life in faith."
    }
  ],
  "translatedAt": "2025-12-23T06:50:18.433Z"
}