{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 18,
  "verses": [
    {
      "pk": 1851801,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 1,
      "text": "The word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/17/1'>Ezek. 17:1</a>",
      "comment": "Ezekiel often prefaces his messages with an explicit statement that the LORD is speaking, emphasizing prophetic authority."
    },
    {
      "pk": 1851802,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 2,
      "text": "What do you mean by repeating this proverb concerning the land of Israel, ‘The fathers have eaten sour grapes, and the children’s teeth are set on edge’?",
      "links": "<a href='/AIV/24/31/29'>Jer. 31:29</a>",
      "comment": "This proverb was common among Israelites in exile, suggesting children suffer for their parents’ sins. God challenges this idea."
    },
    {
      "pk": 1851803,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 3,
      "text": "As surely as I live, declares the Lord GOD, you shall never again use this proverb in Israel.",
      "links": "",
      "comment": "God rejects the fatalistic notion behind the proverb, emphasizing personal moral responsibility."
    },
    {
      "pk": 1851804,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 4,
      "text": "Behold, every soul belongs to Me; the soul of the father as well as the soul of the son—both are Mine. The soul who sins, he shall die.",
      "links": "<a href='/AIV/3/17/11'>Lev. 17:11</a>; <a href='/AIV/45/6/23'>Rom. 6:23</a>",
      "comment": "Emphasizes both shared origin and individual moral accountability. Paul echoes ‘the wages of sin is death’ in Romans."
    },
    {
      "pk": 1851805,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 5,
      "text": "If a man is righteous and does what is just and right—",
      "links": "",
      "comment": "The focus shifts to describing a person living in accordance with God's law, laying a precedent for righteousness by works."
    },
    {
      "pk": 1851806,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 6,
      "text": "if he does not eat at the mountain shrines or lift up his eyes to the idols of the house of Israel, does not defile his neighbor’s wife or approach a woman during her impurity,",
      "links": "<a href='/AIV/26/6/13'>Ezek. 6:13</a>; <a href='/AIV/3/18/19'>Lev. 18:19</a>",
      "comment": "Refers to keeping clear of idolatry and following the laws regarding sexual purity."
    },
    {
      "pk": 1851807,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 7,
      "text": "does not oppress anyone, but returns what he took in pledge for a debt, commits no robbery, but gives his bread to the hungry and covers the naked with a garment,",
      "links": "<a href='/AIV/3/25/36'>Lev. 25:36</a>; <a href='/AIV/23/58/7'>Isa. 58:7</a>",
      "comment": "Emphasizes not only personal morality but active charity—a key principle in both Old and New Testaments."
    },
    {
      "pk": 1851808,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 8,
      "text": "does not lend at interest or take any profit, keeps his hand from injustice, executes true justice between man and man,",
      "links": "<a href='/AIV/2/22/25'>Ex. 22:25</a>",
      "comment": "The rejection of usury and a command for honest judgment highlight Israel’s unique social laws."
    },
    {
      "pk": 1851809,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 9,
      "text": "walks in My statutes and keeps My rules, acting faithfully—he is righteous; he shall surely live, declares the Lord GOD.",
      "links": "<a href='/AIV/3/18/5'>Lev. 18:5</a>",
      "comment": "Again, personal obedience is stressed. Paul alludes to ‘he who does them shall live by them’ in Galatians 3:12."
    },
    {
      "pk": 1851810,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 10,
      "text": "If he fathers a son who is violent, a shedder of blood, who does any of these things",
      "links": "",
      "comment": "Descendants are responsible for their own actions, not just inheritors of guilt."
    },
    {
      "pk": 1851811,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 11,
      "text": "though he himself did none of these things, but now his son has even eaten at the mountain shrines and defiled his neighbor’s wife,",
      "links": "<a href='/AIV/26/18/6'>v. 6</a>",
      "comment": "Restating sinful actions highlights the contrast with the father’s righteousness."
    },
    {
      "pk": 1851812,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 12,
      "text": "has oppressed the poor and needy, committed robbery, not returned the pledge, lifted his eyes to idols, committed abomination,",
      "links": "<a href='/AIV/26/18/7'>v. 7</a>",
      "comment": "Each sin reflects both a break with God and a violation of communal ethics."
    },
    {
      "pk": 1851813,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 13,
      "text": "lent at interest and taken profit—shall he then live? He shall not live. He has done all these abominations; he shall surely die. His blood shall be upon himself.",
      "links": "<a href='/AIV/26/18/8'>v. 8</a>",
      "comment": "Individual culpability is underscored. Also echoes the legal language about blood and responsibility in Leviticus."
    },
    {
      "pk": 1851814,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 14,
      "text": "Now, suppose this man fathers a son who sees all his father's sins that he has done, but when he sees them, does not do likewise:",
      "links": "",
      "comment": "Each generation can freely choose righteousness, regardless of heritage."
    },
    {
      "pk": 1851815,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 15,
      "text": "he does not eat at the mountain shrines, or lift up his eyes to the idols of the house of Israel, does not defile his neighbor’s wife,",
      "links": "<a href='/AIV/26/18/6'>v. 6</a>",
      "comment": "Repeats the earlier righteousness list, emphasizing personal moral agency."
    },
    {
      "pk": 1851816,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 16,
      "text": "does not oppress anyone, or require a pledge, or commit robbery, but gives his bread to the hungry and covers the naked with a garment,",
      "links": "<a href='/AIV/26/18/7'>v. 7</a>",
      "comment": "Active charity is restated as central to the righteous life."
    },
    {
      "pk": 1851817,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 17,
      "text": "keeps his hand from wrongdoing, does not take interest or profit, executes My judgments and walks in My statutes—he shall not die for his father’s sin; he shall surely live.",
      "links": "<a href='/AIV/26/18/8'>v. 8</a>; <a href='/AIV/26/18/9'>v. 9</a>",
      "comment": "Emphasizes personal rather than inherited guilt. This points towards a future where salvation is an individual—not merely corporate—reality, a foundation for New Testament teaching."
    },
    {
      "pk": 1851818,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 18,
      "text": "As for his father, because he practiced extortion, robbed his brother, and did what is not good among his people, behold, he shall die for his iniquity.",
      "links": "",
      "comment": "Each individual stands or falls for his own actions—preparing for the gospel focus on personal repentance."
    },
    {
      "pk": 1851819,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 19,
      "text": "Yet you say, ‘Why should not the son suffer for the iniquity of the father?’ When the son has done what is just and right, and has carefully kept all My statutes, he shall surely live.",
      "links": "",
      "comment": "Corrects a misunderstanding about generational punishment (cf. Ex. 20:5-6, where God’s mercy is also generational)."
    },
    {
      "pk": 1851820,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 20,
      "text": "The soul who sins shall die. The son shall not bear the iniquity of the father, nor shall the father bear the iniquity of the son. The righteousness of the righteous shall be upon himself, and the wickedness of the wicked shall be upon himself.",
      "links": "<a href='/AIV/26/18/4'>v. 4</a>",
      "comment": "Summarizes individual accountability. In the New Testament, this principle is further fulfilled in Christ, who bears our sins (Isa. 53:6; 2 Cor. 5:21)."
    },
    {
      "pk": 1851821,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 21,
      "text": "But if a wicked man turns away from all his sins that he has committed and keeps all My statutes, and does what is just and right, he shall surely live; he shall not die.",
      "links": "<a href='/AIV/33/7/18'>Mic. 7:18</a>",
      "comment": "Stresses the availability of forgiveness and restoration. The call to repentance echoes Christ’s message (Mark 1:15)."
    },
    {
      "pk": 1851822,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 22,
      "text": "None of the transgressions he has committed shall be remembered against him; for the righteousness that he has done he shall live.",
      "links": "<a href='/AIV/19/103/12'>Ps. 103:12</a>",
      "comment": "Here we see God’s willingness to forgive totally—a picture later deepened by the sacrificial system and fulfilled in Christ’s total absolution of sin for the repentant (see 1 John 1:9)."
    },
    {
      "pk": 1851823,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 23,
      "text": "Have I any pleasure in the death of the wicked? declares the Lord GOD, and not rather that he should turn from his ways and live?",
      "links": "<a href='/AIV/26/33/11'>Ezek. 33:11</a>; <a href='/AIV/54/2/4'>1 Tim. 2:4</a>",
      "comment": "Plainly states God's desire for the salvation of souls, prefiguring the universal salvific will found throughout the New Testament."
    },
    {
      "pk": 1851824,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 24,
      "text": "But if a righteous man turns away from his righteousness and commits injustice and does the same abominations the wicked man does—shall he live? None of his righteous deeds that he has done shall be remembered; for the treachery of which he is guilty and the sin he has committed, for them he shall die.",
      "links": "<a href='/AIV/26/3/20'>Ezek. 3:20</a>",
      "comment": "This warns against presuming upon past righteousness. The idea that grace can be lost by turning away is consistent with teachings on perseverance and the real possibility of apostasy (cf. Heb. 6:4-6)."
    },
    {
      "pk": 1851825,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 25,
      "text": "Yet you say, ‘The way of the Lord is not just.’ Hear now, O house of Israel: Is My way not just? Is it not your ways that are unjust?",
      "links": "<a href='/AIV/26/33/17'>Ezek. 33:17</a>",
      "comment": "Israel accuses God of injustice, but God responds by turning the charge back on them—demonstrating perfect divine justice."
    },
    {
      "pk": 1851826,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 26,
      "text": "When a righteous man turns away from his righteousness and commits injustice, he shall die for them; for his injustice that he has done he shall die.",
      "links": "<a href='/AIV/26/18/24'>v. 24</a>",
      "comment": "Reiterates the warning against falling away. Relates to the teaching that faith must be persevered in (see Matt. 24:13)."
    },
    {
      "pk": 1851827,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 27,
      "text": "Again, when a wicked man turns away from the wickedness he has committed and does what is just and right, he shall save his life.",
      "links": "<a href='/AIV/26/18/21'>v. 21</a>",
      "comment": "Emphasizes the possibility of repentance and conversion even late in life, an important precedent for later Christian pastoral practice (see Luke 15:7, 32)."
    },
    {
      "pk": 1851828,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 28,
      "text": "Because he considered and turned away from all the transgressions he had committed, he shall surely live; he shall not die.",
      "links": "",
      "comment": "‘Considered’—shows conscious examination of conscience. The emphasis on deliberate choice foreshadows the role of confession and true repentance."
    },
    {
      "pk": 1851829,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 29,
      "text": "Yet the house of Israel says, ‘The way of the Lord is not just.’ O house of Israel, are My ways not just? Is it not your ways that are unjust?",
      "links": "<a href='/AIV/26/18/25'>v. 25</a>",
      "comment": "God's repeated answer drives home the point—His justice is perfect, and human justice is lacking."
    },
    {
      "pk": 1851830,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 30,
      "text": "Therefore I will judge you, O house of Israel, every one according to his ways, declares the Lord GOD. Repent and turn from all your transgressions, lest iniquity be your ruin.",
      "links": "<a href='/AIV/24/18/11'>Jer. 18:11</a>; <a href='/AIV/40/4/17'>Matt. 4:17</a>",
      "comment": "The twofold call—judgment and repentance—becomes a key pattern in Jesus' own teaching. The necessity of true conversion is a consistent thread."
    },
    {
      "pk": 1851831,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 31,
      "text": "Cast away from you all the transgressions that you have committed, and make for yourselves a new heart and a new spirit! Why will you die, O house of Israel?",
      "links": "<a href='/AIV/19/51/10'>Ps. 51:10</a>; <a href='/AIV/26/36/26'>Ezek. 36:26</a>",
      "comment": "The promise of a ‘new heart and new spirit’ foreshadows the interior renewal brought by the Holy Spirit at Pentecost (Acts 2); this is also alluded to by Jesus (John 3:3-8)."
    },
    {
      "pk": 1851832,
      "translation": "AIV",
      "book": 26,
      "chapter": 18,
      "verse": 32,
      "text": "For I have no pleasure in the death of anyone, declares the Lord GOD, so turn and live.",
      "links": "<a href='/AIV/26/18/23'>v. 23</a>; <a href='/AIV/55/2/4'>2 Pet. 3:9</a>",
      "comment": "God’s will that all come to repentance echoes throughout the Bible. The repeated call to ‘turn and live’ is fulfilled in the call to conversion and a transformed life in Christ."
    }
  ],
  "translatedAt": "2025-12-23T06:55:11.994Z"
}