{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 20,
  "verses": [
    {
      "pk": 202005001,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 1,
      "text": "In the seventh year, in the fifth month, on the tenth day of the month, some of the elders of Israel came to inquire of the LORD, and they sat before me.",
      "links": "<a href='/AIV/26/8/1'>Ezek. 8:1</a>, <a href='/AIV/26/14/1'>Ezek. 14:1</a>",
      "comment": "The elders come seeking guidance from God, a pattern often repeated in times of national uncertainty."
    },
    {
      "pk": 202005002,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 2,
      "text": "And the word of the LORD came to me:",
      "links": "<a href='/AIV/26/3/16'>Ezek. 3:16</a>",
      "comment": "God speaks directly to Ezekiel, emphasizing his role as the LORD's chosen prophet."
    },
    {
      "pk": 202005003,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 3,
      "text": "“Son of man, speak to the elders of Israel, and say to them, ‘This is what the Lord GOD says: Have you come to inquire of Me? As I live, declares the Lord GOD, I will not be inquired of by you.’”",
      "links": "<a href='/AIV/26/14/3'>Ezek. 14:3</a>, <a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "A strong rebuke: God refuses to answer hypocritical inquiry from leaders unrepentant for rebellion. See Isa. 1:15 for a parallel."
    },
    {
      "pk": 202005004,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 4,
      "text": "“Will you judge them, son of man, will you judge them? Then make known to them the abominations of their ancestors.",
      "links": "<a href='/AIV/26/16/2'>Ezek. 16:2</a>",
      "comment": "Judgment here means exposing sin so that repentance can follow. Similar call in Ezek. 16:2."
    },
    {
      "pk": 202005005,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 5,
      "text": "Say to them, ‘This is what the Lord GOD says: On the day when I chose Israel, I swore to the descendants of the house of Jacob and made Myself known to them in the land of Egypt. I swore to them, saying, I am the LORD your God.’”",
      "links": "<a href='/AIV/02/3/6'>Ex. 3:6</a>, <a href='/AIV/02/6/7'>Ex. 6:7</a>",
      "comment": "God's covenant identity is restated. Note how the LORD reveals Himself by name in Exodus, showing personal involvement."
    },
    {
      "pk": 202005006,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 6,
      "text": "On that day I swore to bring them out of the land of Egypt into a land that I had searched out for them, flowing with milk and honey, the most splendid of all lands.",
      "links": "<a href='/AIV/02/3/8'>Ex. 3:8</a>, <a href='/AIV/02/13/5'>Ex. 13:5</a>",
      "comment": "The land's abundance signifies God's faithful provision and covenant promise. See Ex. 3:8."
    },
    {
      "pk": 202005007,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 7,
      "text": "And I said to them, ‘Cast away each of you the detestable things you feast your eyes on, and do not defile yourselves with the idols of Egypt; I am the LORD your God.’",
      "links": "<a href='/AIV/03/18/3'>Lev. 18:3</a>, <a href='/AIV/02/20/3'>Ex. 20:3</a>",
      "comment": "God requires exclusive worship. Idolatry is not tolerated among His people."
    },
    {
      "pk": 202005008,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 8,
      "text": "But they rebelled against Me and would not listen to Me. They did not cast away the detestable things they delighted in, nor did they abandon the idols of Egypt. Then I said I would pour out My wrath on them to exhaust My anger against them in the midst of the land of Egypt.",
      "links": "<a href='/AIV/26/5/13'>Ezek. 5:13</a>, <a href='/AIV/04/14/11'>Num. 14:11-12</a>",
      "comment": "Israel’s pattern of rebellion starts at the very beginning of its redemption."
    },
    {
      "pk": 202005009,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 9,
      "text": "But I acted for the sake of My name, that it should not be profaned in the sight of the nations among whom they dwelled, in whose sight I had made Myself known to them by bringing them out of the land of Egypt.",
      "links": "<a href='/AIV/02/9/16'>Ex. 9:16</a>, <a href='/AIV/26/36/21'>Ezek. 36:21-23</a>",
      "comment": "God’s actions are rooted in faithfulness to His own name and reputation. See also Ezek. 36:21-23."
    },
    {
      "pk": 202005010,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 10,
      "text": "So I led them out of the land of Egypt and brought them into the wilderness.",
      "links": "<a href='/AIV/02/12/51'>Ex. 12:51</a>, <a href='/AIV/05/8/2'>Deut. 8:2</a>",
      "comment": "God’s leading through the wilderness was both an act of deliverance and discipline."
    },
    {
      "pk": 202005011,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 11,
      "text": "I gave them My statutes and made known to them My ordinances, by which anyone who does them shall live.",
      "links": "<a href='/AIV/03/18/5'>Lev. 18:5</a>, <a href='/AIV/16/9/29'>Neh. 9:29</a>",
      "comment": "The law was given for life, not burden. Paul cites this in Gal. 3:12, pointing to life by faith and obedience."
    },
    {
      "pk": 202005012,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 12,
      "text": "Moreover, I gave them My Sabbaths to be a sign between Me and them, so that they would know that I am the LORD who sanctifies them.",
      "links": "<a href='/AIV/02/31/13'>Ex. 31:13</a>, <a href='/AIV/26/37/28'>Ezek. 37:28</a>",
      "comment": "The Sabbath is a sign set by God for His people, showing sanctification, a consecration comparable to Christian initiation (cf. Heb. 4:9 for deeper spiritual rest)."
    },
    {
      "pk": 202005013,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 13,
      "text": "But the house of Israel rebelled against Me in the wilderness. They did not walk in My statutes and they rejected My ordinances, by which anyone who does them shall live, and they greatly profaned My Sabbaths. Then I said I would pour out My wrath on them in the wilderness, to destroy them.",
      "links": "<a href='/AIV/04/14/22'>Num. 14:22-23</a>, <a href='/AIV/04/16/21'>Num. 16:21</a>",
      "comment": "Profaning the Sabbath is emphasized here; note the spiritual dangers of disregarding the day set apart for the LORD."
    },
    {
      "pk": 202005014,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 14,
      "text": "But I acted for the sake of My name, that it should not be profaned in the sight of the nations, in whose sight I had brought them out.",
      "links": "<a href='/AIV/26/20/9'>Ezek. 20:9</a>, <a href='/AIV/26/36/23'>Ezek. 36:23</a>",
      "comment": "Again, God acts to protect His name—the sacredness of God’s name is carried forward in Christian tradition."
    },
    {
      "pk": 202005015,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 15,
      "text": "Moreover, I swore to them in the wilderness that I would not bring them into the land that I had given them, a land flowing with milk and honey, the most splendid of all lands.",
      "links": "<a href='/AIV/04/14/23'>Num. 14:23</a>",
      "comment": "The punishment for unbelief is exclusion from the promised inheritance; see Heb. 3:18 for spiritual application."
    },
    {
      "pk": 202005016,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 16,
      "text": "Because they rejected My ordinances, did not walk in My statutes, and profaned My Sabbaths, for their hearts went after their idols.",
      "links": "<a href='/AIV/05/31/16'>Deut. 31:16</a>",
      "comment": "Idolatry is ultimately a matter of the heart."
    },
    {
      "pk": 202005017,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 17,
      "text": "Yet My eye spared them, and I did not destroy them or make an end of them in the wilderness.",
      "links": "<a href='/AIV/16/9/31'>Neh. 9:31</a>",
      "comment": "God’s mercy tempers His judgment, preserving a remnant. This remnant idea connects to Paul’s argument in Romans 11:5."
    },
    {
      "pk": 202005018,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 18,
      "text": "I said to their children in the wilderness, ‘Do not walk in the statutes of your fathers, nor keep their judgments, nor defile yourselves with their idols.",
      "links": "<a href='/AIV/24/16/12'>Jer. 16:12</a>",
      "comment": "Each generation is called to personal faithfulness and covenant renewal."
    },
    {
      "pk": 202005019,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 19,
      "text": "I am the LORD your God; walk in My statutes, and keep My ordinances, and do them.",
      "links": "<a href='/AIV/02/15/26'>Ex. 15:26</a>, <a href='/AIV/03/18/4'>Lev. 18:4</a>",
      "comment": "The repetition highlights the unchanging call to holiness."
    },
    {
      "pk": 202005020,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 20,
      "text": "Keep My Sabbaths holy, so that they may be a sign between Me and you, that you may know that I am the LORD your God.",
      "links": "<a href='/AIV/02/31/13'>Ex. 31:13</a>",
      "comment": "Sabbath observance is emphasized as a means of knowing God truly. In Christian tradition, the weekly gathering retains this sense of sacred covenant sign."
    },
    {
      "pk": 202005021,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 21,
      "text": "But the children rebelled against Me. They did not walk in My statutes, nor kept My ordinances to do them, by which anyone who does them shall live, and they profaned My Sabbaths. Then I said I would pour out My wrath upon them and spend My anger against them in the wilderness.",
      "links": "<a href='/AIV/04/21/5'>Num. 21:5-6</a>",
      "comment": "The cycle of rebellion and God’s threatened judgment repeats with the next generation."
    },
    {
      "pk": 202005022,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 22,
      "text": "But I withheld My hand and acted for the sake of My name, that it should not be profaned in the sight of the nations in whose sight I brought them out.",
      "links": "<a href='/AIV/26/20/9'>Ezek. 20:9,14</a>",
      "comment": "Yet again, God’s mercy is motivated by His desire that His reputation remain untarnished before the world."
    },
    {
      "pk": 202005023,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 23,
      "text": "Moreover, I swore to them in the wilderness that I would scatter them among the nations and disperse them throughout the countries,",
      "links": "<a href='/AIV/03/26/33'>Lev. 26:33</a>",
      "comment": "The threat of exile for persistent unfaithfulness is an essential covenant warning. Jesus echoes this warning for unrepentant Jerusalem in Luke 21:24."
    },
    {
      "pk": 202005024,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 24,
      "text": "because they had not done My ordinances, but had rejected My statutes, and profaned My Sabbaths, and their eyes were fixed on their fathers’ idols.",
      "links": "<a href='/AIV/26/20/16'>Ezek. 20:16</a>",
      "comment": "Persistent idolatry is the source of judgment."
    },
    {
      "pk": 202005025,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 25,
      "text": "Therefore I also gave them statutes that were not good and ordinances by which they could not live.",
      "links": "<a href='/AIV/19/81/12'>Ps. 81:12</a>, <a href='/AIV/45/1/24'>Rom. 1:24-28</a>",
      "comment": "God “gives them over” as a form of judgment, a concept referenced by Paul in Romans 1."
    },
    {
      "pk": 202005026,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 26,
      "text": "I let them become unclean through their gifts—in making all their firstborn pass through the fire—that I might devastate them, so that they would know that I am the LORD.",
      "links": "<a href='/AIV/03/18/21'>Lev. 18:21</a>, <a href='/AIV/26/23/37'>Ezek. 23:37</a>",
      "comment": "Child sacrifice is abominable; yet God’s judgment allows people to reap what they sow, leading them to recognize His sovereignty."
    },
    {
      "pk": 202005027,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 27,
      "text": "Therefore, son of man, speak to the house of Israel and say to them: ‘This is what the Lord GOD says: In this also your fathers blasphemed Me by being unfaithful to Me.",
      "links": "<a href='/AIV/26/16/30'>Ezek. 16:30</a>",
      "comment": "Blasphemy here is practical unbelief and covenant betrayal."
    },
    {
      "pk": 202005028,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 28,
      "text": "For when I brought them into the land that I swore to give them, then wherever they saw any high hill or any leafy tree, there they offered their sacrifices and presented provoking offerings. There they made soothing aromas and poured out their drink offerings.",
      "links": "<a href='/AIV/05/12/2'>Deut. 12:2</a>",
      "comment": "Pagan worship on high places is rampant; exclusive worship at the chosen place (see Deut. 12:2-5) is contrasted."
    },
    {
      "pk": 202005029,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 29,
      "text": "Then I said to them, ‘What is this high place to which you go?’ So its name is called Bamah to this day.",
      "links": "<a href='/AIV/11/13/32'>1 Kings 13:32</a>",
      "comment": "‘Bamah’ means ‘high place,’ a site of unauthorized worship. Even after centuries the sin is remembered by the name."
    },
    {
      "pk": 202005030,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 30,
      "text": "Therefore say to the house of Israel, ‘This is what the Lord GOD says: Will you defile yourselves as your fathers did, and commit harlotry after their detestable things?’",
      "links": "<a href='/AIV/26/6/9'>Ezek. 6:9</a>",
      "comment": "Idolatry equated with spiritual adultery is a repeated prophetic theme."
    },
    {
      "pk": 202005031,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 31,
      "text": "For when you offer your gifts and make your sons pass through the fire, you defile yourselves with all your idols to this day. So should I be inquired of by you, house of Israel? As I live, declares the Lord GOD, I will not be inquired of by you.",
      "links": "<a href='/AIV/26/20/3'>Ezek. 20:3</a>",
      "comment": "God refuses the prayers of the unrepentant who practice abomination."
    },
    {
      "pk": 202005032,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 32,
      "text": "What is in your mind will never happen, when you say, ‘Let us be like the nations, like the families of the earth, serving wood and stone.’",
      "links": "<a href='/AIV/09/8/5'>1 Sam. 8:5</a>",
      "comment": "God intends His people to be holy and distinct, not to imitate the nations."
    },
    {
      "pk": 202005033,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 33,
      "text": "As I live, declares the Lord GOD, surely with a mighty hand and an outstretched arm and with wrath poured out, I will be king over you.",
      "links": "<a href='/AIV/02/6/6'>Ex. 6:6</a>, <a href='/AIV/19/89/13'>Ps. 89:13</a>",
      "comment": "God’s kingship is unchanging, even when the people reject Him. Note the similarity in language to God's deliverance from Egypt."
    },
    {
      "pk": 202005034,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 34,
      "text": "I will bring you out from the peoples and gather you out of the lands where you are scattered, with a mighty hand and an outstretched arm and with wrath poured out.",
      "links": "<a href='/AIV/26/11/17'>Ezek. 11:17</a>, <a href='/AIV/24/32/37'>Jer. 32:37</a>",
      "comment": "Restoration is promised—God gathers His people back with power and discipline."
    },
    {
      "pk": 202005035,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 35,
      "text": "And I will bring you into the wilderness of the peoples, and there I will enter into judgment with you face to face.",
      "links": "<a href='/AIV/24/2/2'>Jer. 2:2</a>",
      "comment": "A new 'wilderness experience' is predicted—a time of trial leading to renewed covenant."
    },
    {
      "pk": 202005036,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 36,
      "text": "As I entered into judgment with your fathers in the wilderness of the land of Egypt, so I will enter into judgment with you, declares the Lord GOD.",
      "links": "<a href='/AIV/04/14/22'>Num. 14:22-23</a>",
      "comment": "God's justice is consistent throughout history."
    },
    {
      "pk": 202005037,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 37,
      "text": "I will make you pass under the rod, and I will bring you into the bond of the covenant.",
      "links": "<a href='/AIV/03/27/32'>Lev. 27:32</a>, <a href='/AIV/24/31/33'>Jer. 31:33</a>, <a href='/AIV/42/22/20'>Luke 22:20</a>",
      "comment": "Passing under the rod suggests God’s personal selection and discipline; the 'bond of the covenant' has deep spiritual significance—note the New Covenant promised in Jer. 31:33, fulfilled in Christ (Luke 22:20)."
    },
    {
      "pk": 202005038,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 38,
      "text": "I will purge out from among you the rebels and those who transgress against Me. I will bring them out of the land where they sojourn, but they will not enter the land of Israel. Then you will know that I am the LORD.",
      "links": "<a href='/AIV/19/101/8'>Ps. 101:8</a>, <a href='/AIV/40/13/41-43'>Matt. 13:41-43</a>",
      "comment": "Judgment precedes restoration. Jesus uses similar imagery for separating the righteous and the wicked (Matt. 13:41-43)."
    },
    {
      "pk": 202005039,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 39,
      "text": "As for you, O house of Israel, thus says the Lord GOD: Go, serve every one of you his idols, now and hereafter, if you will not listen to Me. But My holy name you shall not profane any more with your gifts and with your idols.",
      "links": "<a href='/AIV/24/44/25'>Jer. 44:25-26</a>",
      "comment": "God challenges them to choose, but the holiness of God's name remains non-negotiable."
    },
    {
      "pk": 202005040,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 40,
      "text": "For on My holy mountain, on the mountain height of Israel, declares the Lord GOD, there all the house of Israel, all of them, shall serve Me in the land. There I will accept them, and there I will require your contributions and the choicest of your gifts, with all your holy offerings.",
      "links": "<a href='/AIV/23/56/7'>Isa. 56:7</a>, <a href='/AIV/19/15/1'>Ps. 15:1</a>",
      "comment": "True worship will be restored in one central place. The sacred mountain motif points forward spiritually to the new Jerusalem and the ultimate gathering of worshipers in God's presence."
    },
    {
      "pk": 202005041,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 41,
      "text": "I will accept you as a pleasing aroma when I bring you out from the peoples and gather you out of the countries where you have been scattered, and I will be hallowed among you in the sight of the nations.",
      "links": "<a href='/AIV/03/1/9'>Lev. 1:9</a>, <a href='/AIV/26/36/23'>Ezek. 36:23</a>",
      "comment": "The 'pleasing aroma' reflects acceptable worship language from Leviticus, here applied to restored people."
    },
    {
      "pk": 202005042,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 42,
      "text": "And you shall know that I am the LORD, when I bring you into the land of Israel, the land I swore to give to your fathers.",
      "links": "<a href='/AIV/01/17/8'>Gen. 17:8</a>, <a href='/AIV/02/6/8'>Ex. 6:8</a>",
      "comment": "Covenant fulfillment demonstrates God’s faithfulness. Possession of the land is a sign of God’s promises kept."
    },
    {
      "pk": 202005043,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 43,
      "text": "There you will remember your ways and all your deeds by which you have defiled yourselves, and you will loathe yourselves for all the evils you have committed.",
      "links": "<a href='/AIV/26/36/31'>Ezek. 36:31</a>, <a href='/AIV/19/51/3-4'>Ps. 51:3-4</a>",
      "comment": "Repentance and self-examination are necessary for restoration. Godly sorrow leads to true conversion."
    },
    {
      "pk": 202005044,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 44,
      "text": "And you shall know that I am the LORD, when I deal with you for My name's sake, not according to your evil ways or according to your corrupt deeds, O house of Israel, declares the Lord GOD.",
      "links": "<a href='/AIV/26/36/22'>Ezek. 36:22</a>, <a href='/AIV/19/103/10'>Ps. 103:10</a>",
      "comment": "God’s mercy is not earned, but graciously bestowed for the sake of His name—a recurring biblical theme. Paul echoes this in Ephesians 2:8-9."
    },
    {
      "pk": 202005045,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 45,
      "text": "And the word of the LORD came to me, saying:",
      "links": "<a href='/AIV/26/21/1'>Ezek. 21:1</a>",
      "comment": "A new prophetic message begins, continuing the same chapter in the Hebrew text."
    },
    {
      "pk": 202005046,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 46,
      "text": "Son of man, set your face toward the south, and preach against the south, and prophesy against the forest land of the Negev.",
      "links": "<a href='/AIV/26/21/2'>Ezek. 21:2</a>",
      "comment": "The south alludes to Judah; the 'forest of the Negev' represents the land soon to be judged."
    },
    {
      "pk": 202005047,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 47,
      "text": "Say to the forest of the south, 'Hear the word of the LORD. Thus says the Lord GOD: Behold, I will kindle a fire in you, and it shall devour every green tree in you and every dry tree. The blazing flame shall not be quenched, and all faces from south to north shall be scorched by it.",
      "links": "<a href='/AIV/23/10/17'>Isa. 10:17</a>, <a href='/AIV/40/3/10'>Matt. 3:10-12</a>",
      "comment": "Fire symbolizes sweeping judgment that is indiscriminate and inescapable, prefiguring New Testament warnings of coming judgment."
    },
    {
      "pk": 202005048,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 48,
      "text": "All flesh shall see that I, the LORD, have kindled it; it shall not be quenched.",
      "links": "<a href='/AIV/24/21/12'>Jer. 21:12'</a>",
      "comment": "Universal acknowledgment of God's judgment underlies His goal of being known as the true LORD."
    },
    {
      "pk": 202005049,
      "translation": "AIV",
      "book": 26,
      "chapter": 20,
      "verse": 49,
      "text": "Then I said, ‘Ah, Lord GOD! They are saying of me, “Is he not just telling parables?”’",
      "links": "<a href='/AIV/26/24/3'>Ezek. 24:3</a>, <a href='/AIV/40/13/13'>Matt. 13:13</a>",
      "comment": "The people misunderstand prophetic warnings, dismissing them as riddles. This prefigures how parables are used by Jesus to reveal and conceal truth (Matt. 13:13)."
    }
  ],
  "translatedAt": "2025-12-23T06:56:25.561Z"
}