{
  "book": 33,
  "bookName": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 44,
  "verses": [
    {
      "pk": 33044001,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 1,
      "text": "Then he brought me back by way of the outer gate of the sanctuary, which faces east, and it was shut.",
      "links": "<a href='/AIV/26/43/1-2'>Ezek. 43:1-2</a>",
      "comment": "The eastern gate is significant as it was the direction of the glory of the Lord's return (see Ezek. 43:1-5). The perpetual closure signifies the sacredness and singular entrance reserved for the Lord."
    },
    {
      "pk": 33044002,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 2,
      "text": "And the LORD said to me, 'This gate shall remain shut. It shall not be opened, and no one shall enter by it, for the LORD, the God of Israel, has entered by it. Therefore, it shall remain shut.'",
      "links": "<a href='/AIV/26/43/4'>Ezek. 43:4</a>",
      "comment": "The closing of the east gate after the Lord enters is a sign of God’s unique holiness. Early Christian writers also see in this a prefiguration of the perpetual sanctity of what God sets apart (see <a href='/AIV/23/7/14'>Isaiah 7:14</a>)."
    },
    {
      "pk": 33044003,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 3,
      "text": "Only the prince may sit in it, to eat bread before the LORD; he shall enter by way of the vestibule of the gate, and shall go out by the same way.",
      "links": "<a href='/AIV/26/34/24'>Ezek. 34:24</a>; <a href='/AIV/26/45/7'>Ezek. 45:7</a>",
      "comment": "The prince—often interpreted as a messianic figure—shares a special privilege of access to the Lord's presence, pointing to a royal-priestly mediation (compare Heb. 7:17). The eating of bread foreshadows a Eucharistic reality in which the faithful partake in the presence of God."
    },
    {
      "pk": 33044004,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 4,
      "text": "Then he brought me by way of the north gate to the front of the temple. And I looked, and behold, the glory of the LORD filled the temple of the LORD, and I fell on my face.",
      "links": "<a href='/AIV/26/43/5'>Ezek. 43:5</a>; <a href='/AIV/2/40/34-35'>Ex. 40:34-35</a>",
      "comment": "Ezekiel experiences God's glory filling the temple, echoing earlier manifestations (Ex. 40:34-35; 1 Kings 8:10-11). The awe and reverence in response guide the pattern of true worship."
    },
    {
      "pk": 33044005,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 5,
      "text": "And the LORD said to me, 'Son of man, pay attention! Set your heart and look with your eyes, and hear with your ears everything I say to you concerning all the statutes of the temple of the LORD, and all its laws; and mark well who may enter the temple and all who go out from the sanctuary.'",
      "links": "<a href='/AIV/26/3/10'>Ezek. 3:10</a>",
      "comment": "The Lord emphasizes careful obedience to His statutes. Proper regulation of worship and sacred order is critical, foreshadowing the structure and rites later established in the Church."
    },
    {
      "pk": 33044006,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 6,
      "text": "And you shall say to the rebellious house of Israel, ‘This is what the Lord GOD says: Enough of all your abominations, O house of Israel,",
      "links": "<a href='/AIV/26/2/5'>Ezek. 2:5</a>; <a href='/AIV/26/20/4'>Ezek. 20:4</a>",
      "comment": "God calls out Israel's previous corrupt worship and idolatry. The restoration of proper worship is a key theme, emphasizing the need for repentance and true reverence."
    },
    {
      "pk": 33044007,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 7,
      "text": "in that you brought in foreigners, uncircumcised in heart and flesh, to be in My sanctuary, to profane it—My house—when you offered My food, the fat and the blood. You broke My covenant, in addition to all your abominations.",
      "links": "<a href='/AIV/3/17/10-12'>Lev. 17:10-12</a>; <a href='/AIV/4/18/7'>Num. 18:7</a>",
      "comment": "Allowing those unfit according to the law to enter the sanctuary profanes it. This stresses the need for true spiritual and ritual purity—anticipating the transformation of the heart promised elsewhere (Jer. 31:33)."
    },
    {
      "pk": 33044008,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 8,
      "text": "And you have not kept charge of My holy things, but you have set foreigners to keep My charge in My sanctuary for yourselves.",
      "links": "<a href='/AIV/26/22/26'>Ezek. 22:26</a>",
      "comment": "Israel failed in their priestly duty, outsourcing holy responsibilities. The priesthood is to be guarded and not diluted, grounding the importance of apostolic succession and proper ordination for leadership in worship."
    },
    {
      "pk": 33044009,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 9,
      "text": "Thus says the Lord GOD: No foreigner, uncircumcised in heart and in flesh, shall enter My sanctuary, of all the foreigners who are among the people of Israel.",
      "links": "<a href='/AIV/2/12/48'>Ex. 12:48</a>; <a href='/AIV/23/52/1'>Isa. 52:1</a>",
      "comment": "God again insists on heart and flesh circumcision—symbolizing both outward signs and inner transformation. Paul later develops this (Rom. 2:29), applying spiritual circumcision to believers."
    },
    {
      "pk": 33044010,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 10,
      "text": "But the Levites who went far from Me, when Israel went astray, who strayed away from Me after their idols, they shall bear their punishment.",
      "links": "<a href='/AIV/26/14/10'>Ezek. 14:10</a>; <a href='/AIV/26/20/39'>Ezek. 20:39</a>",
      "comment": "Not all of the priests are restored equally. The unfaithful Levites are restored only partially, reflecting the lasting consequences of leading others astray and the responsibility of spiritual leadership."
    },
    {
      "pk": 33044011,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 11,
      "text": "They may be ministers in My sanctuary, having oversight at the gates of the temple and serving in the temple; they may slaughter the burnt offering and the sacrifice for the people, and they shall stand before them to minister to them.",
      "links": "<a href='/AIV/3/1/5'>Lev. 1:5</a>",
      "comment": "Grace is shown to the Levites despite previous failures—they still serve, but their role reflects discipline. The distinction of roles in the sanctuary prefigures distinct ministries in the church."
    },
    {
      "pk": 33044012,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 12,
      "text": "Because they ministered to them before their idols and became a stumbling block of iniquity to the house of Israel, therefore I have sworn against them,' declares the Lord GOD, 'that they shall bear their punishment.",
      "links": "<a href='/AIV/26/7/19'>Ezek. 7:19</a>",
      "comment": "Serving idols made the Levites an occasion of sin for Israel, hence judgment falls upon them. This stresses the deadly impact of false worship and the seriousness of idolatry."
    },
    {
      "pk": 33044013,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 13,
      "text": "They shall not come near to Me, to serve Me as priests, nor come near any of My holy things, or to the most holy things; but they shall bear their shame and the punishment for the abominations which they have committed.",
      "links": "<a href='/AIV/26/40/46'>Ezek. 40:46</a>",
      "comment": "The holy priestly role is reserved; only the faithful are admitted to the most sacred duties. This anticipation of a priesthood that remains unbroken is later echoed in the new covenant’s concept of apostolic succession."
    },
    {
      "pk": 33044014,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 14,
      "text": "Nevertheless, I will make them keepers of the charge of the temple, for all its service and for all that is to be done in it.",
      "links": "<a href='/AIV/4/3/5-8'>Num. 3:5-8</a>",
      "comment": "The Levites are granted lesser roles as temple servants. There is a clear distinction between sacred orders and lesser ministries, which foreshadows later church organization."
    },
    {
      "pk": 33044015,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 15,
      "text": "But the Levitical priests, sons of Zadok, who kept the charge of My sanctuary when the people of Israel went astray from Me, they shall come near to Me to minister to Me, and they shall stand before Me to offer Me fat and blood, declares the Lord GOD.",
      "links": "<a href='/AIV/1/2/35'>1 Kgs. 2:35</a>; <a href='/AIV/3/17/6'>Lev. 17:6</a>",
      "comment": "The faithful priesthood is depicted as uniquely privileged to minister before God. The sons of Zadok prefigure a faithful remnant, pointing to a continuing priestly line chosen by God (see Luke 1:8-9 for priestly service)."
    },
    {
      "pk": 33044016,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 16,
      "text": "They shall enter My sanctuary, and they shall come near My table, to minister to Me, and they shall keep My charge.",
      "links": "<a href='/AIV/2/25/30'>Ex. 25:30</a>; <a href='/AIV/3/24/9'>Lev. 24:9</a>",
      "comment": "Drawing near the 'table' suggests participation in a sacred meal, an Old Testament type later fulfilled in the Lord's Supper (Luke 22:19). The privilege for the chosen priests establishes a precedent for sacramental liturgy."
    },
    {
      "pk": 33044017,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 17,
      "text": "When they enter the gates of the inner court, they shall wear linen garments; they shall have nothing of wool on them while they minister at the gates of the inner court and within.",
      "links": "<a href='/AIV/2/28/39-43'>Ex. 28:39-43</a>",
      "comment": "Priestly attire is prescribed—linen symbolizes purity and avoidance of sweat, denoting the priest's separation from daily toil. Reverence and ritual purity in dress hints at later liturgical vestments."
    },
    {
      "pk": 33044018,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 18,
      "text": "They shall have linen turbans on their heads and linen undergarments around their waists. They shall not gird themselves with anything that causes sweat.",
      "links": "<a href='/AIV/2/28/42'>Ex. 28:42</a>",
      "comment": "Avoidance of sweat also echoes the state before the Fall (Gen. 3:19). Priestly ministry is to be marked by holiness without the curse of human toil intruding into divine worship."
    },
    {
      "pk": 33044019,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 19,
      "text": "When they go out into the outer court to the people, they shall take off the garments in which they minister and lay them in the holy chambers. They shall put on other clothing, so that they do not transmit holiness to the people with their garments.",
      "links": "<a href='/AIV/3/6/10-11'>Lev. 6:10-11</a>",
      "comment": "Priestly garments are so sacred they are restricted to the sanctuary. The transfer of holiness—even through clothing—points to a deep theology of consecration and ritual sanctity."
    },
    {
      "pk": 33044020,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 20,
      "text": "They shall not shave their heads or let their hair hang loose, but they shall only trim the hair of their heads.",
      "links": "<a href='/AIV/3/21/5'>Lev. 21:5</a>",
      "comment": "Priests are not to adopt pagan mourning customs. Personal grooming practices underscore their distinction and symbolize order, discipline, and respect for God’s worship."
    },
    {
      "pk": 33044021,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 21,
      "text": "No priest shall drink wine when they enter the inner court.",
      "links": "<a href='/AIV/3/10/9'>Lev. 10:9</a>",
      "comment": "Priests must abstain from wine in ministerial service—a call to vigilance and clarity when serving God, later reemphasized by Paul to ministers (1 Tim. 3:2-3)."
    },
    {
      "pk": 33044022,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 22,
      "text": "They shall not marry a widow or a divorced woman, but only virgins of the offspring of the house of Israel, or a widow who is the widow of a priest.",
      "links": "<a href='/AIV/3/21/7-14'>Lev. 21:7-14</a>",
      "comment": "The priestly marital standard again sets them apart. They are to avoid defilement, upholding the highest moral and ritual integrity—a theme later mirrored in the high calling of leaders in the community of believers."
    },
    {
      "pk": 33044023,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 23,
      "text": "They shall teach My people the difference between the holy and the common, and show them how to distinguish between the unclean and the clean.",
      "links": "<a href='/AIV/3/10/10-11'>Lev. 10:10-11</a>",
      "comment": "Priests not only offer sacrifice but instruct God’s people—an image of teaching authority that carries into the new covenant (see Matt. 28:19-20)."
    },
    {
      "pk": 33044024,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 24,
      "text": "In disputes, they shall stand as judges; they shall judge according to My judgments. And they shall keep My laws and My statutes in all My appointed feasts, and they shall keep My Sabbaths holy.",
      "links": "<a href='/AIV/2/18/26'>Ex. 18:26</a>; <a href='/AIV/3/23/1-44'>Lev. 23:1-44</a>",
      "comment": "Priests are entrusted with judicial and liturgical authority, a pattern reflected in the subsequent functioning of the Church—a sign of divinely appointed guidance for the people."
    },
    {
      "pk": 33044025,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 25,
      "text": "They shall not defile themselves by going near to a dead person; however, only for father or mother, for son or daughter, for brother or unmarried sister, may they defile themselves.",
      "links": "<a href='/AIV/3/21/1-3'>Lev. 21:1-3</a>",
      "comment": "Limits on defilement for priests demonstrate the primacy of their holy vocation—even above certain family ties—mirrored by God’s call for absolute devotion among spiritual leaders."
    },
    {
      "pk": 33044026,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 26,
      "text": "After he is cleansed, they shall count seven days for him.",
      "links": "<a href='/AIV/4/19/11-12'>Num. 19:11-12</a>",
      "comment": "Purification after ritual defilement maintains the holiness of the sanctuary. The use of specific rites projects into later practices of spiritual cleansing and preparation for sacred ministry."
    },
    {
      "pk": 33044027,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 27,
      "text": "On the day that he goes into the sanctuary, into the inner court, to minister in the sanctuary, he shall offer his sin offering, declares the Lord GOD.",
      "links": "<a href='/AIV/3/4/3'>Lev. 4:3</a>",
      "comment": "Sin offerings before ministering underscore the continuing need for priestly purification. This concept is fulfilled ultimately in Christ, our eternal High Priest (Heb. 9:11-14)."
    },
    {
      "pk": 33044028,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 28,
      "text": "And this shall be their inheritance: I am their inheritance. And you shall give them no possession in Israel; I am their possession.",
      "links": "<a href='/AIV/4/18/20'>Num. 18:20</a>",
      "comment": "The priests’ inheritance is the Lord Himself, not land—prefiguring that spiritual leadership is about communion with God, not temporal wealth. The highest reward is His presence."
    },
    {
      "pk": 33044029,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 29,
      "text": "They shall eat the grain offering, the sin offering, and the guilt offering; and every devoted thing in Israel shall be theirs.",
      "links": "<a href='/AIV/3/2/3'>Lev. 2:3</a>",
      "comment": "Priests are supported by portions from offerings, showing the connection between altar and priesthood, and the material support of the ministry by the People of God."
    },
    {
      "pk": 33044030,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 30,
      "text": "And the first of all the firstfruits of everything, and every offering of every kind from all your offerings, shall belong to the priests. You shall also give to the priest the first of your dough, that a blessing may rest on your house.",
      "links": "<a href='/AIV/4/18/12-13'>Num. 18:12-13</a>; <a href='/AIV/3/23/17'>Lev. 23:17</a>",
      "comment": "Blessings are intimately tied to faithful offering. The sharing of firstfruits with the priesthood is a pattern continued in the support of the Church’s ministers today (see 1 Cor. 9:13-14)."
    },
    {
      "pk": 33044031,
      "translation": "AIV",
      "book": 33,
      "bookName": "Ezekiel",
      "bookAbbreviation": "Ezek",
      "chapter": 44,
      "verse": 31,
      "text": "The priests shall not eat any bird or animal that has died naturally or is torn by wild animals.",
      "links": "<a href='/AIV/3/22/8'>Lev. 22:8</a>",
      "comment": "Priestly diet is restricted for maintaining ritual purity. This requirement emphasizes God’s holiness and the need to avoid spiritual and physical defilement—echoed in New Testament calls for holiness and prudence."
    }
  ],
  "translatedAt": "2025-12-24T09:24:19.179Z"
}