{
  "book": "Ezekiel",
  "bookAbbreviation": "Ezek",
  "chapter": 11,
  "verses": [
    {
      "pk": 3011001,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 1,
      "text": "The Spirit lifted me up and brought me to the east gate of the house of the LORD, which faces east. At the entrance of the gate were twenty-five men. Among them I saw Jaazaniah the son of Azzur and Pelatiah the son of Benaiah, leaders of the people.",
      "links": "<a href='/AIV/26/8/3'>Ezek. 8:3</a>; <a href='/AIV/26/9/2'>Ezek. 9:2</a>",
      "comment": "The Spirit transports Ezekiel, signifying divine authority over true prophetic revelation. The entrance of the east gate is symbolically important as the place where God's glory will eventually return (<a href='/AIV/26/43/1-4'>Ezek. 43:1-4</a>)."
    },
    {
      "pk": 3011002,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 2,
      "text": "He said to me, 'Son of man, these are the men who plan evil and give wicked counsel in this city.'",
      "links": "<a href='/AIV/26/8/12'>Ezek. 8:12</a>; <a href='/AIV/26/22/25'>Ezek. 22:25</a>",
      "comment": "God reveals the wickedness of the city's leaders, echoing earlier prophecies against those who mislead the people."
    },
    {
      "pk": 3011003,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 3,
      "text": "They say, 'The time is not near to build houses. This city is the pot, and we are the meat.'",
      "links": "<a href='/AIV/24/29/5'>Jer. 29:5</a>",
      "comment": "The leaders mockingly believe Jerusalem is a place of safety, comparing themselves to meat secure in a pot, misunderstanding God's coming judgment."
    },
    {
      "pk": 3011004,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 4,
      "text": "Therefore, prophesy against them; prophesy, son of man.",
      "links": "<a href='/AIV/26/2/5'>Ezek. 2:5</a>",
      "comment": "God commands Ezekiel to speak His judgment, reinforcing the role of the prophet as a mediator of God's will."
    },
    {
      "pk": 3011005,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 5,
      "text": "Then the Spirit of the LORD fell upon me, and He said to me, 'Say, Thus says the LORD: You have said this, O house of Israel; for I know the things that come into your mind.'",
      "links": "<a href='/AIV/26/13/3'>Ezek. 13:3</a>; <a href='/AIV/19/139/2'>Ps. 139:2</a>",
      "comment": "A divine theophany initiates the prophetic speech, asserting God's omniscience (<a href='/AIV/19/139/4'>Ps. 139:4</a>)."
    },
    {
      "pk": 3011006,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 6,
      "text": "You have multiplied your slain in this city and filled its streets with the slain.",
      "links": "<a href='/AIV/26/7/23'>Ezek. 7:23</a>; <a href='/AIV/24/19/4-7'>Jer. 19:4-7</a>",
      "comment": "The leaders are condemned for the violence and bloodshed resulting from their policies."
    },
    {
      "pk": 3011007,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 7,
      "text": "Therefore thus says the Lord GOD: Your slain whom you have laid in it are the meat, and this city is the pot; but you will be brought out of it.",
      "links": "<a href='/AIV/26/24/6'>Ezek. 24:6</a>",
      "comment": "God reverses the leaders’ metaphor—the dead are the 'meat,' but the leaders will be removed from their supposed place of security."
    },
    {
      "pk": 3011008,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 8,
      "text": "You have feared the sword, and I will bring the sword upon you, declares the Lord GOD.",
      "links": "<a href='/AIV/24/21/9'>Jer. 21:9</a>",
      "comment": "Scripture presents God’s judgment as just: the leaders’ fear of violence becomes their reality."
    },
    {
      "pk": 3011009,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 9,
      "text": "And I will bring you out of the midst of the city, and give you into the hands of strangers, and execute judgments upon you.",
      "links": "<a href='/AIV/26/21/31'>Ezek. 21:31</a>; <a href='/AIV/24/34/21'>Jer. 34:21</a>",
      "comment": "Judgment includes being handed over to foreign powers, paralleling themes of exile as divine chastisement."
    },
    {
      "pk": 3011010,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 10,
      "text": "You shall fall by the sword. I will judge you at the border of Israel. And you shall know that I am the LORD.",
      "links": "<a href='/AIV/26/6/7'>Ezek. 6:7</a>; <a href='/AIV/26/7/4'>Ezek. 7:4</a>",
      "comment": "Explicit assertion of divine retribution and an opportunity for repentance—to know God's identity."
    },
    {
      "pk": 3011011,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 11,
      "text": "This city shall not be your pot, nor shall you be the meat in it. I will judge you at the border of Israel.",
      "links": "<a href='/AIV/26/24/3-7'>Ezek. 24:3-7</a>",
      "comment": "Reiteration: the city will not provide protection—judgment is inevitable and takes place publicly."
    },
    {
      "pk": 3011012,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 12,
      "text": "And you shall know that I am the LORD; for you have not walked in My statutes, nor obeyed My rules, but have acted according to the rules of the nations that are around you.",
      "links": "<a href='/AIV/03/18/3-4'>Lev. 18:3-4</a>",
      "comment": "Disobedience and assimilation to pagan nations is the root of Israel's troubles, warning against compromising the revealed faith."
    },
    {
      "pk": 3011013,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 13,
      "text": "Now, as I prophesied, Pelatiah the son of Benaiah died. Then I fell on my face and cried out with a loud voice, 'Ah, Lord GOD! Will you make a complete end of the remnant of Israel?'",
      "links": "<a href='/AIV/26/9/8'>Ezek. 9:8</a>",
      "comment": "Ezekiel's intercession highlights the prophetic role of pleading for God's mercy (<a href='/AIV/02/32/11-14'>Ex. 32:11-14</a>), prefiguring the ultimate Intercessor."
    },
    {
      "pk": 3011014,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 14,
      "text": "And the word of the LORD came to me:",
      "links": "",
      "comment": "A fresh prophetic directive from the LORD, signaling a shift from judgment to restoration."
    },
    {
      "pk": 3011015,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 15,
      "text": "'Son of man, your brothers, your kinsmen, your fellow exiles, and all the house of Israel, all of them, are those to whom the inhabitants of Jerusalem have said, 'Go far from the LORD; to us this land is given for a possession.'",
      "links": "<a href='/AIV/26/36/2'>Ezek. 36:2</a>",
      "comment": "Those in exile are unjustly excluded, yet God asserts their inclusion in His plans—a foreshadowing of the faithful remnant."
    },
    {
      "pk": 3011016,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 16,
      "text": "Therefore say, 'Thus says the Lord GOD: Though I removed them far off among the nations, and though I scattered them among the countries, I have been a sanctuary to them for a little while in the countries where they have gone.'",
      "links": "<a href='/AIV/24/23/8'>Jer. 23:8</a>; <a href='/AIV/43/4/21-24'>John 4:21-24</a>",
      "comment": "God Himself becomes a 'sanctuary,' showing that true worship is not limited to a physical temple—a principle that deepens in New Covenant revelation (<a href='/AIV/46/3/16'>1 Cor. 3:16</a>)."
    },
    {
      "pk": 3011017,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 17,
      "text": "Therefore say, 'Thus says the Lord GOD: I will gather you from the peoples and assemble you from the countries where you have been scattered, and I will give you the land of Israel.'",
      "links": "<a href='/AIV/05/30/3'>Deut. 30:3</a>; <a href='/AIV/26/37/21'>Ezek. 37:21</a>",
      "comment": "Promise of restoration—regathering of God’s people. This is echoed in later prophecies and seen in the Church's gathering from all nations."
    },
    {
      "pk": 3011018,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 18,
      "text": "And when they come there, they will remove from it all its detestable things and all its abominations.",
      "links": "<a href='/AIV/26/36/25'>Ezek. 36:25</a>",
      "comment": "Purification and repentance are prerequisites for true restoration. Removal of idols mirrors the call for holiness."
    },
    {
      "pk": 3011019,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 19,
      "text": "And I will give them one heart, and a new spirit I will put within them. I will remove the heart of stone from their flesh and give them a heart of flesh,",
      "links": "<a href='/AIV/26/36/26'>Ezek. 36:26</a>; <a href='/AIV/24/31/33'>Jer. 31:33</a>",
      "comment": "Prophecy of interior spiritual renewal. God alone can transform hearts—a foretaste of the grace poured out in the sacraments and the gift of the Spirit (<a href='/AIV/44/2/38'>Acts 2:38</a>)."
    },
    {
      "pk": 3011020,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 20,
      "text": "that they may walk in My statutes and keep My rules and obey them. And they shall be My people, and I will be their God.",
      "links": "<a href='/AIV/02/19/5-6'>Ex. 19:5-6</a>",
      "comment": "Renewal leads to obedience, echoing God's covenant-making formula—fulfilled most perfectly by Christ and those united to Him."
    },
    {
      "pk": 3011021,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 21,
      "text": "But as for those whose heart goes after their detestable things and their abominations, I will bring their way upon their own heads, says the Lord GOD.",
      "links": "<a href='/AIV/19/7/16'>Ps. 7:16</a>",
      "comment": "Persistent idolatry brings judgment. God’s justice is both personal and corporate in its outworking."
    },
    {
      "pk": 3011022,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 22,
      "text": "Then the cherubim lifted up their wings, with the wheels beside them, and the glory of the God of Israel was over them.",
      "links": "<a href='/AIV/26/10/19'>Ezek. 10:19</a>",
      "comment": "The visible manifestation of God’s glory departs, signifying judgment—but also the anticipation of return (<a href='/AIV/26/43/2'>Ezek. 43:2</a>)."
    },
    {
      "pk": 3011023,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 23,
      "text": "And the glory of the LORD went up from the midst of the city and stood on the mountain that is east of the city.",
      "links": "<a href='/AIV/38/14/4'>Zech. 14:4</a>; <a href='/AIV/44/1/12'>Acts 1:12'</a>",
      "comment": "The departure to the Mount of Olives prefigures significant New Testament events—such as Jesus' ascension. This hints at God’s plan to return in glory and mercy."
    },
    {
      "pk": 3011024,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 24,
      "text": "And the Spirit lifted me up and brought me, in the vision by the Spirit of God, to Chaldea, to the exiles. Then the vision that I had seen went up from me.",
      "links": "<a href='/AIV/26/3/14-15'>Ezek. 3:14-15</a>; <a href='/AIV/26/8/3'>Ezek. 8:3</a>",
      "comment": "Transition back from vision to physical reality, reminding us of the ongoing mediation between heaven and earth—a hallmark of sacramental revelation."
    },
    {
      "pk": 3011025,
      "translation": "AIV",
      "book": 26,
      "chapter": 11,
      "verse": 25,
      "text": "And I told the exiles all the things that the LORD had shown me.",
      "links": "<a href='/AIV/26/3/11'>Ezek. 3:11</a>",
      "comment": "Ezekiel imparts the revealed word to God’s people, continuing the apostolic model of teaching and passing on the revelation of God through the generations."
    }
  ],
  "translatedAt": "2025-12-23T06:51:18.688Z"
}