{
  "book": 16,
  "bookName": "Nehemiah",
  "bookAbbreviation": "Neh",
  "chapter": 4,
  "verses": [
    {
      "pk": 16004001,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 1,
      "text": "When Sanballat heard that we were rebuilding the wall, he was furious. He mocked the Jews,",
      "links": "<a href='/AIV/16/2/19'>Neh. 2:19</a>",
      "comment": "Sanballat’s opposition is a recurring theme, paralleling the constant spiritual opposition God’s people face when fulfilling His calling (see Neh. 2:19)."
    },
    {
      "pk": 16004002,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 2,
      "text": "and he spoke before his brothers and the army of Samaria, saying, 'What are these feeble Jews doing? Will they restore it for themselves? Will they offer sacrifices? Will they finish in a day? Will they revive the stones out of the heaps of rubbish, burned as they are?'",
      "links": "<a href='/AIV/19/44/13'>Ps. 44:13-14</a>; <a href='/AIV/16/2/17'>Neh. 2:17</a>",
      "comment": "Sanballat mocks both the efforts of the people and their religious practices. Ironically, the restoration of the wall parallels the spiritual renewal of God’s people, drawing a link between exterior works and interior faith."
    },
    {
      "pk": 16004003,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 3,
      "text": "Now Tobiah the Ammonite was beside him, and he said, 'Even what they are building—if a fox goes up on it, he will break down their stone wall!'",
      "links": "<a href='/AIV/19/22/7'>Ps. 22:7</a>; <a href='/AIV/16/2/19'>Neh. 2:19</a>",
      "comment": "The enemies belittle the sacred work, echoing the mockery faced by Christ at His Passion (see Ps. 22:7), hinting at deeper spiritual opposition to God's redemptive plan."
    },
    {
      "pk": 16004004,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 4,
      "text": "Hear, O our God, for we are despised. Turn their insults upon their own heads, and give them over as plunder in a land of captivity.",
      "links": "<a href='/AIV/19/123/3-4'>Ps. 123:3–4</a>; <a href='/AIV/19/79/12'>Ps. 79:12</a>",
      "comment": "Nehemiah prays as the spiritual leader, interceding for his people. The prayer reflects trust in God’s justice, a pattern seen in the psalms of lament and imprecatory prayers."
    },
    {
      "pk": 16004005,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 5,
      "text": "Do not cover their guilt, and do not let their sin be blotted out from before you, for they have provoked you to anger in the presence of the builders.",
      "links": "<a href='/AIV/19/69/27-28'>Ps. 69:27–28</a>",
      "comment": "This plea mirrors various psalm prayers seeking justice. Notably, forgiveness and justice are held together in Scripture, a tension resolved ultimately in Christ (see Ps. 69:27–28)."
    },
    {
      "pk": 16004006,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 6,
      "text": "So we rebuilt the wall until all of it reached half its height, for the people had a mind to work.",
      "links": "<a href='/AIV/16/6/15'>Neh. 6:15</a>",
      "comment": "The unity of the people is essential in accomplishing God’s mission. This cooperative effort reflects the importance of working together in faith and obedience—foreshadowing community and unity in the body of Christ."
    },
    {
      "pk": 16004007,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 7,
      "text": "But when Sanballat, Tobiah, the Arabs, the Ammonites, and the Ashdodites heard that the repair of Jerusalem’s walls was progressing and that the gaps were being closed, they were very angry.",
      "links": "<a href='/AIV/16/2/19'>Neh. 2:19</a>; <a href='/AIV/19/2/1-2'>Ps. 2:1–2</a>",
      "comment": "The surrounding nations oppose Jerusalem, reminiscent of Psalm 2 where the nations rage against the Lord and His Anointed—hinting at both political and spiritual conflicts that anticipate later opposition to Christ and His people."
    },
    {
      "pk": 16004008,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 8,
      "text": "And they all conspired together to come and fight against Jerusalem and to cause confusion in it.",
      "links": "<a href='/AIV/19/83/4-5'>Ps. 83:4–5</a>",
      "comment": "Persistent opposition is clear. The term 'confusion' can relate to spiritual disorder, a tactic used by the enemy since Genesis 3. The unity of the city, a theme for the people of God, is threatened (Ps. 83:4–5)."
    },
    {
      "pk": 16004009,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 9,
      "text": "But we prayed to our God and set a guard as a protection against them day and night.",
      "links": "<a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "Nehemiah combines prayer with practical action, demonstrating the importance of both trusting in God and acting wisely—a pattern for Christian life and spiritual warfare (see Ps. 127:1)."
    },
    {
      "pk": 16004010,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 10,
      "text": "Meanwhile, in Judah it was said, 'The strength of the laborers is failing, and there is so much rubble that we are not able to rebuild the wall.'",
      "links": "<a href='/AIV/19/6/6-7'>Ps. 6:6–7</a>",
      "comment": "Fatigue and discouragement set in internally, paralleling the importance of perseverance in the face of trials (Ps. 6:6–7). Spiritual and physical exhaustion tests the faith and unity of God’s people."
    },
    {
      "pk": 16004011,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 11,
      "text": "And our adversaries said, 'They will not know or see until we come among them and kill them and put an end to the work.'",
      "links": "<a href='/AIV/19/83/4'>Ps. 83:4</a>",
      "comment": "Plots against God’s work mirror the broader theme of evil aiming to hinder salvation history. The threat to end the work recalls attempts in Scripture to thwart God’s plan, always ultimately unsuccessful."
    },
    {
      "pk": 16004012,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 12,
      "text": "When the Jews who lived near them came, they warned us ten times, 'From every place where you turn, they will attack us.'",
      "links": "<a href='/AIV/16/6/9'>Neh. 6:9</a>",
      "comment": "The anxiety spread among God's people highlights how external threats can lead to internal fear. In the spiritual life, repeated warnings are a call not to despair but to trust in God’s sovereignty."
    },
    {
      "pk": 16004013,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 13,
      "text": "So I stationed people in the lowest parts of the space behind the wall, in the open areas. I set the people by families, with their swords, spears, and bows.",
      "links": "<a href='/AIV/16/7/3'>Neh. 7:3</a>",
      "comment": "Nehemiah’s organization of the people by families for defense points to the importance of familial structure and community order in God’s plan. Spiritual defenses are often rooted in strong families."
    },
    {
      "pk": 16004014,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 14,
      "text": "After I looked things over, I stood up and said to the nobles, the officials, and the rest of the people, 'Do not be afraid of them. Remember the Lord, who is great and awesome, and fight for your brothers, your sons and your daughters, your wives and your homes.'",
      "links": "<a href='/AIV/05/7/21'>Deut. 7:21</a>; <a href='/AIV/19/27/1'>Ps. 27:1</a>",
      "comment": "Trust in God is key to overcoming fear. Nehemiah calls the people to remember God’s greatness—a spiritual remedy for fear and discouragement, and a foreshadowing of greater leadership seen in Christ."
    },
    {
      "pk": 16004015,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 15,
      "text": "When our enemies heard that we were aware of their plot and that God had frustrated it, we all returned to the wall, each to his work.",
      "links": "<a href='/AIV/19/33/10'>Ps. 33:10</a>; <a href='/AIV/16/6/16'>Neh. 6:16</a>",
      "comment": "God’s providence is acknowledged in the victory. The people's return to work demonstrates perseverance, and reliance on both divine help and human action—mirroring Christian teaching on grace and cooperation."
    },
    {
      "pk": 16004016,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 16,
      "text": "From that day on, half of my servants worked on construction, and half held the spears, shields, bows, and armor. The leaders stood behind all the people of Judah",
      "links": "<a href='/AIV/16/7/3'>Neh. 7:3</a>",
      "comment": "Practical vigilance and division of labor echo the importance of diverse roles in the people of God. Leadership standing behind the workers also reflects the vital relationship between authority and service."
    },
    {
      "pk": 16004017,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 17,
      "text": "who were building the wall. Those who carried materials did their work with one hand and held a weapon with the other.",
      "links": "<a href='/AIV/19/149/6'>Ps. 149:6</a>",
      "comment": "Working while armed symbolizes the need to build spiritually while always ready to defend the faith—a picture of watchfulness seen in Ephesians 6:16-17 and the call to bear both spiritual fruit and armor."
    },
    {
      "pk": 16004018,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 18,
      "text": "Every builder worked with his sword strapped at his side, and the trumpeter stood beside me.",
      "links": "<a href='/AIV/04/10/9'>Num. 10:9</a>",
      "comment": "The trumpet signals the need for vigilance and readiness, echoing Old Testament calls to rally God’s people (Num. 10:9). The sword at the side also alludes to the spiritual sword of God’s word (Eph. 6:17)."
    },
    {
      "pk": 16004019,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 19,
      "text": "Then I said to the nobles, the officials, and the rest of the people, 'The work is great and extensive, and we are separated far from one another along the wall.'",
      "links": "<a href='/AIV/16/3/8'>Neh. 3:8</a>",
      "comment": "Nehemiah’s words underscore the magnitude of the mission and the physical dispersion of the workers. The unity of purpose despite separation prefigures how God’s people, though scattered, are spiritually united in one body."
    },
    {
      "pk": 16004020,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 20,
      "text": "Wherever you hear the sound of the trumpet, rally to us there. Our God will fight for us.",
      "links": "<a href='/AIV/02/14/14'>Ex. 14:14</a>; <a href='/AIV/19/46/1'>Ps. 46:1</a>",
      "comment": "The trumpet is a summons to unity and action, and assurance that true victory comes from the Lord Himself. God’s promise to fight for His people is fulfilled supremely in Christ, who conquers sin and death for us."
    },
    {
      "pk": 16004021,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 21,
      "text": "So we labored at the work, while half of them held the spears, from the break of dawn until the stars came out.",
      "links": "<a href='/AIV/19/104/19-23'>Ps. 104:19–23</a>",
      "comment": "The diligence of the workers from dawn until nightfall highlights devotion and perseverance. Laboring for God amid adversity is a key expression of faithfulness."
    },
    {
      "pk": 16004022,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 22,
      "text": "At that time I also said to the people, 'Let every man and his servant stay inside Jerusalem at night, so that they may serve as a guard for us by night and as workers by day.'",
      "links": "<a href='/AIV/16/13/19'>Neh. 13:19</a>",
      "comment": "The call for constant readiness and communal living reinforces how the people of God are meant to protect and support one another, day and night—continuity between sacred work and daily life."
    },
    {
      "pk": 16004023,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 4,
      "verse": 23,
      "text": "So neither I, nor my brothers, nor my servants, nor the men of the guard who followed me, took off our clothes; each kept his weapon at his right hand.",
      "links": "<a href='/AIV/49/6/13'>Eph. 6:13</a>; <a href='/AIV/19/132/9'>Ps. 132:9</a>",
      "comment": "Constant vigilance is a theme here; readiness at all times mirrors the Christian call to be spiritually prepared, clothed in virtue and equipped for spiritual warfare (see Eph. 6:13)."
    }
  ],
  "translatedAt": "2025-12-24T04:47:30.241Z"
}