{
  "book": 16,
  "bookName": "Nehemiah",
  "bookAbbreviation": "Neh",
  "chapter": 6,
  "verses": [
    {
      "pk": 16006001,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 1,
      "text": "When it was reported to Sanballat, Tobiah, Geshem the Arab, and the rest of our enemies that I had rebuilt the wall and that no gap remained in it—though at that time I had not set up the doors in the gates—",
      "links": "<a href='/AIV/16/4/7-8'>Neh. 4:7-8</a>; <a href='/AIV/16/2/19'>Neh. 2:19</a>",
      "comment": "Nehemiah's progress alarmed the enemies. The narrative mentions the wall being finished except for the gates, showing continued vulnerability. The mention of specific enemies highlights the spiritual reality that the people of God often face opposition when restoring or rebuilding what is sacred (cf. Ezra 4:1-5)."
    },
    {
      "pk": 16006002,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 2,
      "text": "Sanballat and Geshem sent to me, saying, 'Come, let us meet together in one of the villages in the plain of Ono.' But they intended to harm me.",
      "links": "<a href='/AIV/16/2/19'>Neh. 2:19</a>; <a href='/AIV/16/6/10'>Neh. 6:10</a>",
      "comment": "The invitation to meet was a trap. Nehemiah discerned the threat and refused. Like spiritual discernment in resisting evil, the wisdom to recognize false unity is essential (cf. Matthew 10:16)."
    },
    {
      "pk": 16006003,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 3,
      "text": "So I sent messengers to them, saying, 'I am doing a great work and cannot come down. Why should the work stop while I leave it to go down to you?'",
      "links": "<a href='/AIV/16/6/9'>Neh. 6:9</a>",
      "comment": "Nehemiah prioritizes God's work over personal concerns. This echoes the importance of mission and vocation over distractions and recalls Paul's admonition to stay focused on the race set before us (cf. Philippians 3:13-14)."
    },
    {
      "pk": 16006004,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 4,
      "text": "They sent me the same message four times, and I answered them in the same way each time.",
      "links": "<a href='/AIV/16/6/2-3'>Neh. 6:2-3</a>",
      "comment": "Persistent temptations require steadfast responses. Nehemiah shows consistency, reflecting the spiritual discipline of perseverance (cf. James 1:12)."
    },
    {
      "pk": 16006005,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 5,
      "text": "Then Sanballat sent his servant to me with an open letter the fifth time.",
      "links": "<a href='/AIV/16/6/2'>Neh. 6:2</a>",
      "comment": "An 'open letter' was meant to publicly shame or intimidate Nehemiah. Using public accusation is a tactic of those opposed to God's purpose. Compare with Christ’s public accusations by adversaries (cf. Luke 23:1-2)."
    },
    {
      "pk": 16006006,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 6,
      "text": "In it was written: 'It is reported among the nations, and Geshem agrees, that you and the Jews plan to rebel; that is why you are rebuilding the wall. According to these reports, you wish to become their king.'",
      "links": "<a href='/AIV/16/2/19'>Neh. 2:19</a>; <a href='/AIV/16/4/2-3'>Neh. 4:2-3</a>",
      "comment": "The accusation of rebellion is reminiscent of earlier claims, distorting the motives of God’s people. The use of false witness also foreshadows later conspiracies against Christ (cf. Matthew 26:59-61)."
    },
    {
      "pk": 16006007,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 7,
      "text": "‘And now you have appointed prophets to proclaim about you in Jerusalem, saying, “There is a king in Judah!” Now these things will be reported to the king. So come, let us confer together.’",
      "links": "<a href='/AIV/16/6/6'>Neh. 6:6</a>; <a href='/AIV/16/2/19'>Neh. 2:19</a>",
      "comment": "The enemy uses slander and manipulation, claiming Nehemiah seeks personal glory. Prophets as public witnesses echo the vital role of authentic guidance in the assembly, pointing to the enduring need for authoritative teaching (cf. Acts 15:28)."
    },
    {
      "pk": 16006008,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 8,
      "text": "I replied to him, 'No such things as you say have been done. You are inventing them out of your own imagination.'",
      "links": "<a href='/AIV/16/6/6'>Neh. 6:6</a>",
      "comment": "Nehemiah refutes the lies directly, teaching the virtue of truth in the face of falsehood. This reflects the call to discernment and the need to confront error within the community (cf. Ephesians 4:25)."
    },
    {
      "pk": 16006009,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 9,
      "text": "For they all wanted to frighten us, thinking, 'Their hands will weaken in the work, and it will not be finished.' But now, O God, strengthen my hands!",
      "links": "<a href='/AIV/19/27/1'>Ps. 27:1</a>; <a href='/AIV/16/2/18'>Neh. 2:18</a>",
      "comment": "Nehemiah resorts to prayer, asking God for strength rather than relying solely on his own abilities. Personal perseverance is possible only through divine aid, recalling spiritual strength given to those who serve God (cf. Philippians 4:13)."
    },
    {
      "pk": 16006010,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 10,
      "text": "Later, I went to the house of Shemaiah son of Delaiah, son of Mehetabel, who was confined to his home. He said, 'Let us meet together in the house of God, inside the temple, and let us close the doors of the temple, for they are coming to kill you—by night they are coming to kill you.'",
      "links": "<a href='/AIV/16/13/1'>Neh. 13:1</a>; <a href='/AIV/4/35/5'>Num. 35:5'</a>",
      "comment": "Shemaiah’s counsel exploits fear and even suggests hiding in the sanctuary—a misuse of holy space. The temptation to seek refuge unfaithfully foreshadows how trust in ritual alone, rather than right motive, can be misguided (cf. Jeremiah 7:4)."
    },
    {
      "pk": 16006011,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 11,
      "text": "But I said, 'Should a man like me run away? And should someone like me enter the temple to save his life? I will not go.'",
      "links": "<a href='/AIV/19/27/1'>Ps. 27:1</a>; <a href='/AIV/16/6/10'>Neh. 6:10</a>",
      "comment": "Nehemiah recognizes his responsibilities and the limits on who can enter the holy place. Proper reverence, as well as courage, guides his decision, anticipating the right ordering of spiritual authority and worship."
    },
    {
      "pk": 16006012,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 12,
      "text": "Then I realized that God had not sent him, but that he had pronounced this prophecy against me because Tobiah and Sanballat had hired him.",
      "links": "<a href='/AIV/16/13/2'>Neh. 13:2</a>; <a href='/AIV/16/6/10'>Neh. 6:10</a>",
      "comment": "Nehemiah discerns a false prophet. This highlights the need for careful distinction between genuine and counterfeit spiritual guidance—echoing Jesus’ warning about false prophets (cf. Matthew 7:15)."
    },
    {
      "pk": 16006013,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 13,
      "text": "He was hired so that I would be afraid and act in such a way and sin, so that they could give me a bad reputation in order to disgrace me.",
      "links": "<a href='/AIV/19/31/13'>Ps. 31:13</a>; <a href='/AIV/16/6/6'>Neh. 6:6</a>",
      "comment": "Fear as a weapon to incite sin shows how enemies of God's people seek to undermine leadership through temptation. The dangers of public scandal and the need for virtuous reputation are emphasized, reminiscent of Paul's concern for the conduct of church leaders (cf. 1 Timothy 3:2)."
    },
    {
      "pk": 16006014,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 14,
      "text": "Remember Tobiah and Sanballat, O my God, and also the prophetess Noadiah and the rest of the prophets who wanted to frighten me.",
      "links": "<a href='/AIV/19/35/1'>Ps. 35:1</a>; <a href='/AIV/16/13/29'>Neh. 13:29</a>",
      "comment": "Nehemiah’s prayer entrusts his adversaries to God’s justice, highlighting the biblical pattern of bringing grievances to God. False prophecy is condemned, and God’s judgment invoked (cf. Psalm 35:1)."
    },
    {
      "pk": 16006015,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 15,
      "text": "So the wall was finished on the twenty-fifth day of Elul, in fifty-two days.",
      "links": "<a href='/AIV/16/6/1'>Neh. 6:1</a>; <a href='/AIV/16/2/18'>Neh. 2:18</a>",
      "comment": "The rapid completion is presented as a work of divine enabling, showing the fruits of diligent labor and unity under right authority. Completion of sacred work is a sign of God's favor and faithfulness."
    },
    {
      "pk": 16006016,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 16,
      "text": "When all our enemies heard about this, all the nations around us were afraid and lost their confidence; for they knew that this work had been accomplished with the help of our God.",
      "links": "<a href='/AIV/19/126/2-3'>Ps. 126:2-3</a>; <a href='/AIV/7/7/21'>Judg. 7:21</a>",
      "comment": "The successful completion invokes awe in adversaries. The witness of God’s people, united and faithful, manifests divine power, which prefigures the establishment of God's people as a visible sign to the nations (cf. Matthew 5:14-16)."
    },
    {
      "pk": 16006017,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 17,
      "text": "Moreover, in those days the nobles of Judah sent many letters to Tobiah, and Tobiah’s letters came to them.",
      "links": "<a href='/AIV/16/13/4'>Neh. 13:4</a>; <a href='/AIV/16/2/10'>Neh. 2:10</a>",
      "comment": "Internal division and correspondence with adversaries threatened community stability. This reminds us of the importance of unity and fidelity within the household of faith."
    },
    {
      "pk": 16006018,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 18,
      "text": "For many in Judah were bound by oath to him, because he was son-in-law to Shecaniah son of Arah, and his son Jehohanan had married the daughter of Meshullam son of Berechiah.",
      "links": "<a href='/AIV/16/13/27'>Neh. 13:27</a>; <a href='/AIV/16/3/4'>Neh. 3:4</a>",
      "comment": "Family alliances with enemies compromised the community, highlighting the need for spiritual and moral integrity. The principle of right relationships is vital to safeguarding spiritual unity."
    },
    {
      "pk": 16006019,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 6,
      "verse": 19,
      "text": "They also spoke well of him before me and reported my words to him. Tobiah sent letters to try to frighten me.",
      "links": "<a href='/AIV/16/6/5'>Neh. 6:5</a>; <a href='/AIV/19/56/5'>Ps. 56:5</a>",
      "comment": "The chapter closes with persistent intimidation and internal betrayal. This underscores the importance of steadfast leadership, holy perseverance, and faithful witness in adversity, virtues encouraged for all who serve in the household of faith."
    }
  ],
  "translatedAt": "2025-12-24T04:48:25.369Z"
}