{
  "book": 16,
  "bookName": "Nehemiah",
  "bookAbbreviation": "Neh",
  "chapter": 3,
  "verses": [
    {
      "pk": 16003001,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 1,
      "text": "Then Eliashib the high priest arose with his fellow priests and rebuilt the Sheep Gate. They consecrated it and set up its doors. They consecrated the wall as far as the Tower of the Hundred, even to the Tower of Hananel.",
      "links": "<a href='/AIV/24/1/1'>Jer. 1:1</a>; <a href='/AIV/38/14/10'>Zech. 14:10</a>",
      "comment": "The leadership of priests in rebuilding highlights the sacred aspect of the work, showing that restoration starts with spiritual dedication. The consecration mirrors setting apart something for God, akin to how Christians are called to dedicate all good works to Him. The focus on the 'Sheep Gate' subtly foreshadows Christ, the Good Shepherd (John 10:7)."
    },
    {
      "pk": 16003002,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 2,
      "text": "Next to them the men of Jericho built, and next to them Zaccur the son of Imri built.",
      "links": "<a href='/AIV/06/6/26'>Josh. 6:26</a>",
      "comment": "Unity in the work is emphasized by the sequence of builders. Each group contributes, showing that all God's people have a unique role in His unfolding plan."
    },
    {
      "pk": 16003003,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 3,
      "text": "The sons of Hassenaah rebuilt the Fish Gate; they laid its beams, set up its doors, its bolts, and its bars.",
      "links": "<a href='/AIV/26/47/9-10'>Ezek. 47:9-10</a>",
      "comment": "The attention to details — beams, doors, bolts, bars — underscores diligence and care in service. The Fish Gate later becomes associated with trade and outreach, alluding to being 'fishers of men' (Matt. 4:19)."
    },
    {
      "pk": 16003004,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 4,
      "text": "Next to them Meremoth the son of Uriah, son of Hakkoz, made repairs. Next to him Meshullam the son of Berechiah, son of Meshezabel, made repairs. Next to him Zadok the son of Baana made repairs.",
      "links": "<a href='/AIV/15/8/33'>Ezra 8:33</a>",
      "comment": "Lists of names stress personal responsibility and honor in service to God. Each family, each person, is called to contribute to the house of God."
    },
    {
      "pk": 16003005,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 5,
      "text": "Next to them the Tekoites made repairs, but their nobles would not put their shoulders to the work of their Lord.",
      "links": "<a href='/AIV/30/1/1'>Amos 1:1</a>",
      "comment": "The mention of reluctance among leaders poses a spiritual warning. All believers, regardless of status, are called to humble service. Christ Himself demonstrated humility (Phil. 2:5-8)."
    },
    {
      "pk": 16003006,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 6,
      "text": "Joiada the son of Paseah and Meshullam the son of Besodeiah repaired the Old Gate; they laid its beams, set up its doors, its bolts, and its bars.",
      "links": "<a href='/AIV/24/26/10'>Jer. 26:10</a>",
      "comment": "Repairing the 'Old Gate' suggests a return to foundational truths and traditions. Preservation of faith is important for continuity and unity."
    },
    {
      "pk": 16003007,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 7,
      "text": "Next to them Melatiah the Gibeonite and Jadon the Meronothite, and men of Gibeon and Mizpah, repaired the section under the authority of the governor of the province Beyond the River.",
      "links": "<a href='/AIV/06/9/3'>Josh. 9:3</a>",
      "comment": "The participation of those from outside Jerusalem, under the governor's oversight, signifies inclusion and submission to rightful authority, a recurring principle in God's governance."
    },
    {
      "pk": 16003008,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 8,
      "text": "Next to them Uzziel the son of Harhaiah, of the goldsmiths, made repairs, and next to him Hananiah, one of the perfumers, made repairs. They rebuilt Jerusalem as far as the Broad Wall.",
      "links": "<a href='/AIV/24/20/2'>Jer. 20:2</a>",
      "comment": "Artisans — goldsmiths and perfumers — are involved, highlighting that all gifts can serve to beautify God’s house. The unity of many talents for God’s glory alludes to the spiritual body with diverse gifts (1 Cor. 12:4-7)."
    },
    {
      "pk": 16003009,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 9,
      "text": "Next to them Rephaiah the son of Hur, ruler of half the district of Jerusalem, made repairs.",
      "links": "<a href='/AIV/19/122/2'>Ps. 122:2</a>",
      "comment": "Leadership roles in rebuilding emphasize the necessity of wise governance and stewardship within the spiritual community."
    },
    {
      "pk": 16003010,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 10,
      "text": "Next to them Jedaiah the son of Harumaph made repairs opposite his house, and next to him Hattush the son of Hashabneiah made repairs.",
      "links": "<a href='/AIV/13/3/22'>1 Chron. 3:22</a>",
      "comment": "Repairing near one’s home points to family responsibility in faith. Foundations of faith begin at home before spreading outward."
    },
    {
      "pk": 16003011,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 11,
      "text": "Malchijah the son of Harim and Hasshub the son of Pahath-moab repaired another section and the Tower of the Ovens.",
      "links": "<a href='/AIV/14/26/9'>2 Chr. 26:9</a>",
      "comment": "Repeated mention of 'another section' reveals cooperative effort and interconnected responsibilities within the faith community."
    },
    {
      "pk": 16003012,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 12,
      "text": "Next to them Shallum the son of Hallohesh, ruler of half the district of Jerusalem, made repairs, he and his daughters.",
      "links": "<a href='/AIV/06/15/19'>Josh. 15:19</a>",
      "comment": "Mentioning daughters shows involvement of women in sacred projects, all sharing in building up the household of faith."
    },
    {
      "pk": 16003013,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 13,
      "text": "Hanun and the inhabitants of Zanoah repaired the Valley Gate; they rebuilt it and set up its doors, its bolts, and its bars, and repaired a thousand cubits of the wall as far as the Dung Gate.",
      "links": "<a href='/AIV/16/2/13'>Neh. 2:13</a>",
      "comment": "Large scale work, measured in cubits, underscores perseverance and steadfastness required in service to God."
    },
    {
      "pk": 16003014,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 14,
      "text": "Malchijah the son of Rechab, ruler of the district of Beth-haccherem, repaired the Dung Gate; he built it and set up its doors, its bolts, and its bars.",
      "links": "<a href='/AIV/24/6/1'>Jer. 6:1</a>",
      "comment": "Repairing the Dung Gate signifies the cleansing necessary for spiritual growth, echoing the need for ongoing repentance and purification in the Christian life."
    },
    {
      "pk": 16003015,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 15,
      "text": "Shallun the son of Col-hozeh, ruler of the district of Mizpah, repaired the Fountain Gate; he built it, covered it, set up its doors, its bolts, and its bars, and he repaired the wall of the Pool of Shelah by the king’s garden, as far as the stairs that go down from the City of David.",
      "links": "<a href='/AIV/19/46/4'>Ps. 46:4</a>; <a href='/AIV/23/22/9-11'>Isa. 22:9-11</a>",
      "comment": "The Fountain Gate and pool recall sources of living water, prefiguring Christ as the living water (John 4:13-14; John 7:38). The mention of the City of David draws attention to Jerusalem as the center of God's plan."
    },
    {
      "pk": 16003016,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 16,
      "text": "After him Nehemiah the son of Azbuk, ruler of half the district of Beth-zur, repaired from a point opposite the tombs of David, as far as the artificial pool and the house of the mighty men.",
      "links": "<a href='/AIV/10/5/7'>2 Sam. 5:7</a>",
      "comment": "The proximity to David’s tomb highlights continuity with the Davidic covenant and points forward to the promise of the eternal Kingdom (Luke 1:32-33)."
    },
    {
      "pk": 16003017,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 17,
      "text": "After him the Levites repaired: Rehum the son of Bani. Next to him, Hashabiah, ruler of half the district of Keilah, made repairs for his district.",
      "links": "<a href='/AIV/14/34/9'>2 Chr. 34:9</a>",
      "comment": "Levites, set apart for ministry, show the ongoing role of spiritual leadership in God’s household. Their involvement underscores devotion to sacred duties."
    },
    {
      "pk": 16003018,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 18,
      "text": "After him, their fellow Levites made repairs: Binnui the son of Henadad, ruler of half the district of Keilah.",
      "links": "<a href='/AIV/15/2/43'>Ezra 2:43</a>",
      "comment": "Continued focus on Levites signals the importance of hereditary succession in service — tradition carried down through generations."
    },
    {
      "pk": 16003019,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 19,
      "text": "Next to them Ezer the son of Jeshua, ruler of Mizpah, repaired another section opposite the ascent to the armory at the Angle.",
      "links": "<a href='/AIV/09/21/1'>1 Sam. 21:1</a>",
      "comment": "The location by the armory highlights both spiritual and physical defense; just as faith protects against adversity."
    },
    {
      "pk": 16003020,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 20,
      "text": "After him Baruch the son of Zabbai zealously repaired another section, from the Angle to the door of the house of Eliashib the high priest.",
      "links": "<a href='/AIV/14/24/4'>2 Chr. 24:4</a>",
      "comment": "Baruch's zeal is commended, reminding believers that enthusiasm for the divine work is necessary; it’s not just about duty, but love and passion in service."
    },
    {
      "pk": 16003021,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 21,
      "text": "After him Meremoth the son of Uriah, son of Hakkoz, repaired another section, from the door of Eliashib’s house to its end.",
      "links": "<a href='/AIV/15/8/33'>Ezra 8:33</a>",
      "comment": "Faithfulness in small tasks (completing a section) is rewarded by God — even the unseen works matter."
    },
    {
      "pk": 16003022,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 22,
      "text": "After him the priests, men from the surrounding area, made repairs.",
      "links": "<a href='/AIV/19/132/9'>Ps. 132:9</a>",
      "comment": "Extension of priestly ministry beyond Jerusalem signals the universality of God's call — a foretaste of worldwide mission."
    },
    {
      "pk": 16003023,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 23,
      "text": "After them Benjamin and Hasshub made repairs opposite their house. After them Azariah the son of Maaseiah, son of Ananiah, made repairs beside his own house.",
      "links": "<a href='/AIV/13/9/16'>1 Chron. 9:16</a>",
      "comment": "Emphasis on household repair underlines the need for individual and family devotion as the foundation for community renewal."
    },
    {
      "pk": 16003024,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 24,
      "text": "After him Binnui the son of Henadad repaired another section, from the house of Azariah to the Angle and to the corner.",
      "links": "<a href='/AIV/07/18/26'>Judg. 18:26</a>",
      "comment": "Again, attention to precise places illustrates order and clarity, important attributes of God’s house."
    },
    {
      "pk": 16003025,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 25,
      "text": "Palal the son of Uzai repaired opposite the Angle and the tower projecting from the upper house of the king, which is by the court of the guard. After him Pedaiah the son of Parosh made repairs.",
      "links": "<a href='/AIV/11/9/7'>1 Kgs. 9:7</a>",
      "comment": "Repair near the king’s house and court signifies proximity to spiritual authority, and respect for order in sacred service."
    },
    {
      "pk": 16003026,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 26,
      "text": "The temple servants living on Ophel made repairs as far as the front of the Water Gate toward the east and the projecting tower.",
      "links": "<a href='/AIV/15/2/43'>Ezra 2:43</a>",
      "comment": "Water Gate again calls to mind the streams of spiritual refreshment and cleansing (Ephesians 5:26). The temple servants’ participation points to ordered ministry."
    },
    {
      "pk": 16003027,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 27,
      "text": "After them the Tekoites repaired another section opposite the great projecting tower and as far as the wall of Ophel.",
      "links": "<a href='/AIV/30/1/1'>Amos 1:1</a>",
      "comment": "Repeated efforts by the same group highlight ongoing commitment, reminiscent of perseverance in good works."
    },
    {
      "pk": 16003028,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 28,
      "text": "Above the Horse Gate the priests repaired, each opposite his own house.",
      "links": "<a href='/AIV/12/11/16'>2 Kgs. 11:16</a>",
      "comment": "Priesthood’s nearness to the gate recalls both leadership and readiness for spiritual battle, horses often symbolize strength and advance."
    },
    {
      "pk": 16003029,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 29,
      "text": "After them Zadok the son of Immer made repairs opposite his own house. After him Shemaiah the son of Shecaniah, keeper of the East Gate, made repairs.",
      "links": "<a href='/AIV/26/43/1'>Ezek. 43:1</a>",
      "comment": "The East Gate is traditionally where the Messiah will enter (Ezekiel 43:1-4), linking prophecy and fulfillment — a subtle sign toward awaiting Christ."
    },
    {
      "pk": 16003030,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 30,
      "text": "After him Hananiah the son of Shelemiah and Hanun, the sixth son of Zalaph, repaired another section. After him Meshullam the son of Berechiah made repairs opposite his chamber.",
      "links": "<a href='/AIV/15/10/15'>Ezra 10:15</a>",
      "comment": "Support for communal repair shows that personal and communal sanctification go hand in hand."
    },
    {
      "pk": 16003031,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 31,
      "text": "After him Malchijah, one of the goldsmiths, made repairs as far as the house of the temple servants and the merchants, opposite the Muster Gate, and to the upper room of the corner.",
      "links": "<a href='/AIV/23/56/7'>Isa. 56:7</a>",
      "comment": "Goldsmiths and merchants working alongside temple servants illustrates spiritual and worldly trades united for God’s purposes, echoing a holistic vision for society's renewal in Christ."
    },
    {
      "pk": 16003032,
      "translation": "AIV",
      "book": 16,
      "bookName": "Nehemiah",
      "bookAbbreviation": "Neh",
      "chapter": 3,
      "verse": 32,
      "text": "And between the upper room at the corner and the Sheep Gate, the goldsmiths and the merchants made repairs.",
      "links": "<a href='/AIV/42/2/8'>Luke 2:8</a>; <a href='/AIV/43/10/1-14'>John 10:1-14</a>",
      "comment": "The closing link of Sheep Gate once more points forward to Christ, the Lamb who purifies and gathers His people. The full circle of restoration is both literal and symbolic, signaling the unity and completeness of God’s household."
    }
  ],
  "translatedAt": "2025-12-24T04:46:58.260Z"
}