{
  "book": "2 Thessalonians",
  "bookAbbreviation": "2Thess",
  "chapter": 2,
  "verses": [
    {
      "pk": 2502001,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 1,
      "text": "Now, brothers, concerning the coming of our Lord Jesus Christ and our gathering together to Him, we urge you,",
      "links": "<a href='/AIV/46/15/51-52'>1 Cor. 15:51–52</a>; <a href='/AIV/52/4/16-17'>1 Thess. 4:16–17</a>",
      "comment": "Paul recalls the return of Christ and the final assembly of believers. Note the focus on unity in being gathered together by Christ."
    },
    {
      "pk": 2502002,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 2,
      "text": "not to be quickly shaken in mind or alarmed, either by a spirit or by a message or a letter as if from us, as if the day of the Lord has come.",
      "links": "<a href='/AIV/54/4/1'>1 Tim. 4:1</a>; <a href='/AIV/62/4/1'>1 John 4:1</a>",
      "comment": "Paul warns against believing any claim that the Day of the Lord has already arrived, including false teachings or letters."
    },
    {
      "pk": 2502003,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 3,
      "text": "Let no one deceive you in any way. For that day will not come unless the rebellion comes first, and the man of lawlessness is revealed, the son of destruction,",
      "links": "<a href='/AIV/40/24/10-12'>Matt. 24:10–12</a>; <a href='/AIV/66/13/11-18'>Rev. 13:11–18</a>",
      "comment": "The 'man of lawlessness' is linked by many to antichrist figures. The apostasy—an abandonment of true faith—must precede Christ’s return."
    },
    {
      "pk": 2502004,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 4,
      "text": "who opposes and exalts himself against every so-called god or object of worship, so that he takes his seat in the temple of God, proclaiming himself to be God.",
      "links": "<a href='/AIV/27/11/36'>Dan. 11:36</a>; <a href='/AIV/40/24/15'>Matt. 24:15</a>",
      "comment": "Prophetic language reminiscent of Daniel, with a figure who blasphemes by setting himself above God’s worship, perhaps alluding to the ultimate deception."
    },
    {
      "pk": 2502005,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 5,
      "text": "Do you not remember that while I was still with you I told you these things?",
      "links": "<a href='/AIV/44/20/31'>Acts 20:31</a>",
      "comment": "The Thessalonians had received teaching on these points, which Paul reminds them of for reassurance."
    },
    {
      "pk": 2502006,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 6,
      "text": "And now you know what is restraining him, so that he may be revealed in his time.",
      "links": "<a href='/AIV/66/17/17'>Rev. 17:17</a>",
      "comment": "There is a present restraining force holding back the man of lawlessness; interpretations vary, with some seeing this as divine authority, tradition, or even the Church itself preserving truth."
    },
    {
      "pk": 2502007,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 7,
      "text": "For the mystery of lawlessness is already at work; only he who now restrains it will do so until he is out of the way.",
      "links": "<a href='/AIV/62/4/3'>1 John 4:3</a>",
      "comment": "Lawlessness has been active, but a restraining influence (often understood as the Spirit’s guidance or apostolic authority) prevents its full revelation."
    },
    {
      "pk": 2502008,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 8,
      "text": "Then the lawless one will be revealed, whom the Lord Jesus will kill with the breath of his mouth and bring to nothing by the appearance of his coming.",
      "links": "<a href='/AIV/23/11/4'>Isa. 11:4</a>; <a href='/AIV/66/19/15'>Rev. 19:15</a>",
      "comment": "Jesus’ victory is effortless—He consumes evil simply by His presence and word, showing both Christ’s divinity and the power of His judgment."
    },
    {
      "pk": 2502009,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 9,
      "text": "The coming of the lawless one is by the activity of Satan with all power and false signs and wonders,",
      "links": "<a href='/AIV/66/13/13-14'>Rev. 13:13-14</a>; <a href='/AIV/40/24/24'>Matt. 24:24</a>",
      "comment": "Miraculous deception parallels warnings by Jesus and John about false signs during the last days. The Church is always cautious about private revelation apart from the apostolic deposit of faith."
    },
    {
      "pk": 2502010,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 10,
      "text": "and with every wicked deception for those who are perishing, because they refused to love the truth and so be saved.",
      "links": "<a href='/AIV/45/1/18'>Rom. 1:18</a>; <a href='/AIV/43/3/19'>John 3:19</a>",
      "comment": "Condemnation comes from deliberate rejection of the truth which God offers—pointing to the need for full reception of all the truths Christ revealed through the apostles."
    },
    {
      "pk": 2502011,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 11,
      "text": "For this reason God sends them a powerful delusion, so that they may believe the lie,",
      "links": "<a href='/AIV/23/66/4'>Isa. 66:4</a>; <a href='/AIV/45/1/28'>Rom. 1:28</a>",
      "comment": "This echoes Romans 1:28, where abandoning truth leads to spiritual blindness. Persisting in error makes one less able to perceive truth, highlighting the seriousness of remaining united with apostolic teaching."
    },
    {
      "pk": 2502012,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 12,
      "text": "so that all may be condemned who did not believe the truth but took pleasure in unrighteousness.",
      "links": "<a href='/AIV/45/2/8'>Rom. 2:8</a>",
      "comment": "Judgment is linked to rejection of God’s truth, not ignorance. The consistent call of Scripture is to cling to the entire faith passed down through the ages."
    },
    {
      "pk": 2502013,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 13,
      "text": "But we ought always to give thanks to God for you, brothers beloved by the Lord, because God chose you as firstfruits for salvation, through sanctification by the Spirit and belief in the truth.",
      "links": "<a href='/AIV/49/1/4'>Eph. 1:4</a>; <a href='/AIV/60/1/2'>1 Pet. 1:2</a>",
      "comment": "Salvation is by God’s initiative, but the means are through the Spirit’s sanctification and firm embrace of revealed truth—emphasizing both God’s action and our response."
    },
    {
      "pk": 2502014,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 14,
      "text": "To this He called you through our gospel, so that you may obtain the glory of our Lord Jesus Christ.",
      "links": "<a href='/AIV/45/8/17'>Rom. 8:17</a>; <a href='/AIV/54/1/9'>2 Tim. 1:9</a>",
      "comment": "The goal of salvation is to share in Christ’s glory. The gospel, as proclaimed by the apostles, remains central as the way God draws the faithful."
    },
    {
      "pk": 2502015,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 15,
      "text": "So then, brothers, stand firm and hold tightly to the traditions which you were taught by us, whether by word or by letter.",
      "links": "<a href='/AIV/54/6/20'>1 Tim. 6:20</a>; <a href='/AIV/47/2/17'>2 Thess. 3:6</a>",
      "comment": "This verse strongly upholds the authority of apostolic tradition—both written and spoken. True Christian doctrine is handed down in its fullness and preserved faithfully throughout generations."
    },
    {
      "pk": 2502016,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 16,
      "text": "Now may our Lord Jesus Christ Himself, and God our Father, who loved us and gave us eternal comfort and good hope through grace,",
      "links": "<a href='/AIV/45/15/13'>Rom. 15:13</a>",
      "comment": "The prayer highlights Jesus’ divinity alongside the Father, consistent with Christological belief in the unity of Father and Son."
    },
    {
      "pk": 2502017,
      "translation": "AIV",
      "book": 53,
      "chapter": 2,
      "verse": 17,
      "text": "comfort your hearts and strengthen you in every good work and word.",
      "links": "<a href='/AIV/58/13/21'>Heb. 13:21</a>; <a href='/AIV/54/1/7'>2 Tim. 1:7</a>",
      "comment": "This blessing emphasizes growth in both action and teaching—good works are fruit of living faith, reflecting the fullness of the Christian life."
    }
  ],
  "translatedAt": "2025-12-23T04:01:01.031Z"
}