{
  "book": "2 Thessalonians",
  "bookAbbreviation": "2Thess",
  "chapter": 1,
  "verses": [
    {
      "pk": 2100101,
      "translation": "AIV",
      "book": 53,
      "chapter": 1,
      "verse": 1,
      "text": "Paul, Silvanus, and Timothy, to the church of the Thessalonians in God our Father and the Lord Jesus Christ:",
      "links": "<a href='/AIV/46/1/1'>1 Cor. 1:1</a>; <a href='/AIV/52/1/1'>1 Thess. 1:1</a>",
      "comment": "The greeting mirrors many of Paul's letters, emphasizing the unity between the Father and the Lord Jesus Christ. The use of 'church' here points to an organized community gathered in faith and sacramental unity."
    },
    {
      "pk": 2100102,
      "translation": "AIV",
      "book": 53,
      "chapter": 1,
      "verse": 2,
      "text": "Grace to you and peace from God our Father and the Lord Jesus Christ.",
      "links": "<a href='/AIV/45/1/7'>Rom. 1:7</a>; <a href='/AIV/52/1/1'>1 Thess. 1:1</a>",
      "comment": "This standard blessing reflects the Gospel's message: true peace comes from God through Christ. The dual mention of Father and Son affirms Christ’s divinity."
    },
    {
      "pk": 2100103,
      "translation": "AIV",
      "book": 53,
      "chapter": 1,
      "verse": 3,
      "text": "We are obligated to thank God always for you, brothers, as is right, because your faith is growing abundantly, and the love of each one of you for one another is increasing.",
      "links": "<a href='/AIV/52/3/12'>1 Thess. 3:12</a>; <a href='/AIV/52/4/9'>1 Thess. 4:9</a>",
      "comment": "Paul notes the continual spiritual growth of the church. Emphasis on increasing love reflects a visible sign of sanctification, the ongoing work of the Spirit."
    },
    {
      "pk": 2100104,
      "translation": "AIV",
      "book": 53,
      "chapter": 1,
      "verse": 4,
      "text": "Therefore, we ourselves boast among the churches of God about you, regarding your perseverance and faith in all your persecutions and in the afflictions that you endure.",
      "links": "<a href='/AIV/52/2/14'>1 Thess. 2:14</a>; <a href='/AIV/60/5/9'>1 Pet. 5:9</a>",
      "comment": "Persevering in trials is a hallmark of the faithful. Mentioning 'churches of God' shows early acknowledgment of a universal community of believers, enduring together for Christ."
    },
    {
      "pk": 2100105,
      "translation": "AIV",
      "book": 53,
      "chapter": 1,
      "verse": 5,
      "text": "This is evidence of the righteous judgment of God, so that you may be considered worthy of the kingdom of God, for which you are suffering.",
      "links": "<a href='/AIV/40/5/10'>Matt. 5:10</a>; <a href='/AIV/52/2/12'>1 Thess. 2:12</a>",
      "comment": "Suffering for the Kingdom is seen as a participation in Christ’s own suffering (cf. Col. 1:24). Salvation is granted through grace, but enduring suffering with faith is a sign of belonging to God's kingdom."
    },
    {
      "pk": 2100106,
      "translation": "AIV",
      "book": 53,
      "chapter": 1,
      "verse": 6,
      "text": "Since it is just for God to repay with affliction those who afflict you,",
      "links": "<a href='/AIV/45/12/19'>Rom. 12:19</a>; <a href='/AIV/19/94/1-2'>Ps. 94:1–2</a>",
      "comment": "Divine justice is asserted: God will vindicate His people. This mirrors Old Testament assurances that God judges oppressors and delivers His people."
    },
    {
      "pk": 2100107,
      "translation": "AIV",
      "book": 53,
      "chapter": 1,
      "verse": 7,
      "text": "and to give relief to you who are afflicted, as well as to us, when the Lord Jesus is revealed from heaven with His mighty angels,",
      "links": "<a href='/AIV/40/25/31'>Matt. 25:31</a>; <a href='/AIV/41/8/38'>Mark 8:38</a>",
      "comment": "Paul refers to the ultimate hope: Christ’s return ('Parousia') with angels. This highlights Christ’s glory, authority, and the tradition of angelic hosts in divine judgment."
    },
    {
      "pk": 2100108,
      "translation": "AIV",
      "book": 53,
      "chapter": 1,
      "verse": 8,
      "text": "in flaming fire, inflicting vengeance on those who do not know God and on those who do not obey the gospel of our Lord Jesus.",
      "links": "<a href='/AIV/19/50/3'>Ps. 50:3</a>; <a href='/AIV/45/2/8'>Rom. 2:8</a>",
      "comment": "Judgment imagery recalls Old Testament theophanies (e.g., Ex. 19:18, Ps. 50:3). 'Obeying the gospel' carries implications of faith made visible through concrete devotion and sacramental participation."
    },
    {
      "pk": 2100109,
      "translation": "AIV",
      "book": 53,
      "chapter": 1,
      "verse": 9,
      "text": "They will suffer the penalty of eternal destruction, away from the presence of the Lord and from the glory of His power.",
      "links": "<a href='/AIV/40/7/23'>Matt. 7:23</a>; <a href='/AIV/23/2/10'>Isa. 2:10</a>",
      "comment": "Paul describes the reality of eternal separation for those who reject God. The imagery here echoes warnings by Christ about judgment and separation from God's presence."
    },
    {
      "pk": 2100110,
      "translation": "AIV",
      "book": 53,
      "chapter": 1,
      "verse": 10,
      "text": "When He comes on that day to be glorified among His saints and to be marveled at by all who have believed, because you believed our testimony to you.",
      "links": "<a href='/AIV/51/3/4'>Col. 3:4</a>; <a href='/AIV/40/16/27'>Matt. 16:27</a>",
      "comment": "Saints are communally glorified with Christ at His return, pointing to both the resurrection of the body and the shared destiny of the faithful. Faith is shown to require both belief and reception of apostolic witness."
    },
    {
      "pk": 2100111,
      "translation": "AIV",
      "book": 53,
      "chapter": 1,
      "verse": 11,
      "text": "To this end we always pray for you, that our God may make you worthy of His calling and may fulfill every desire for goodness and every work of faith by His power,",
      "links": "<a href='/AIV/50/1/6'>Phil. 1:6</a>; <a href='/AIV/46/1/8'>1 Cor. 1:8</a>",
      "comment": "Paul prays for God’s sanctifying action. The language suggests ongoing transformation and the importance of cooperation with divine grace. The work of faith is never merely individual but empowered by God."
    },
    {
      "pk": 2100112,
      "translation": "AIV",
      "book": 53,
      "chapter": 1,
      "verse": 12,
      "text": "so that the name of our Lord Jesus may be glorified in you, and you in Him, according to the grace of our God and the Lord Jesus Christ.",
      "links": "<a href='/AIV/43/17/22'>John 17:22–23</a>; <a href='/AIV/45/8/30'>Rom. 8:30</a>",
      "comment": "The final verse presents a powerful union: believers share in Christ’s glory. This points to profound spiritual communion and the full realization of grace, echoing Christ's words about sharing glory with His followers."
    }
  ],
  "translatedAt": "2025-12-23T04:00:41.080Z"
}