{
  "book": "2 John",
  "bookAbbreviation": "2John",
  "chapter": 1,
  "verses": [
    {
      "pk": 2014001,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 1,
      "text": "The elder, to the chosen lady and to her children, whom I truly love, and not only I, but also all who have known the truth.",
      "links": "<a href='/AIV/62/4/1'>1 John 4:1</a>; <a href='/AIV/60/1/1'>1 Peter 1:1</a>",
      "comment": "The 'chosen lady' is often understood either as a church or as a Christian woman and her family. The theme of truth and love is key in Johannine writings."
    },
    {
      "pk": 2014002,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 2,
      "text": "Because of the truth which lives in us and will be with us forever.",
      "links": "<a href='/AIV/43/14/16'>John 14:16</a>; <a href='/AIV/62/2/27'>1 John 2:27</a>",
      "comment": "The promise of truth enduring forever emphasizes the indwelling of the Spirit (see John 14:16), indicating both a personal and communal abiding."
    },
    {
      "pk": 2014003,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 3,
      "text": "Grace, mercy, and peace will be with us, from God the Father and from Jesus Christ, the Son of the Father, in truth and love.",
      "links": "<a href='/AIV/54/1/2'>1 Timothy 1:2</a>; <a href='/AIV/62/1/3'>1 John 1:3</a>",
      "comment": "The threefold blessing—grace, mercy, and peace—indicates fullness of Christian life, highlighting the union between the Father and the Son, a high Christology (see John’s prologue John 1:1-3)."
    },
    {
      "pk": 2014004,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 4,
      "text": "I rejoiced greatly to find some of your children walking in the truth, just as we were commanded by the Father.",
      "links": "<a href='/AIV/43/14/15'>John 14:15</a>; <a href='/AIV/62/2/3'>1 John 2:3</a>",
      "comment": "Obedience to the command of the Father is reiteration of the theme of fidelity to apostolic teaching. Spiritual children walking in truth reflects the ongoing generational faithfulness."
    },
    {
      "pk": 2014005,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 5,
      "text": "And now I ask you, dear lady—not as though I am writing a new commandment, but one we have had from the beginning—that we love one another.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/62/2/7'>1 John 2:7</a>",
      "comment": "The command to love one another echoes Jesus’ own words and highlights continuity with foundational teachings. 'From the beginning' hints at apostolic tradition handed on consistently."
    },
    {
      "pk": 2014006,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 6,
      "text": "And this is love: that we walk according to his commandments. This is the commandment, just as you have heard from the beginning, that you should walk in it.",
      "links": "<a href='/AIV/43/14/21'>John 14:21</a>; <a href='/AIV/62/5/3'>1 John 5:3</a>",
      "comment": "True love is inseparable from obedience. Walking in the commandments from the start signals the importance of handed-down tradition in living out the faith."
    },
    {
      "pk": 2014007,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 7,
      "text": "For many deceivers have gone out into the world, those who do not confess Jesus Christ coming in the flesh. Such a one is the deceiver and the antichrist.",
      "links": "<a href='/AIV/62/4/2'>1 John 4:2-3</a>; <a href='/AIV/53/2/7'>2 Thessalonians 2:7</a>",
      "comment": "Confessing Jesus Christ ‘coming in the flesh’ reaffirms the incarnation, a distinguishing mark from early heresies. The reference to antichrist is a warning against deviations from authentic teaching."
    },
    {
      "pk": 2014008,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 8,
      "text": "Watch yourselves, so that you do not lose what we have worked for, but may win a full reward.",
      "links": "<a href='/AIV/62/2/28'>1 John 2:28</a>; <a href='/AIV/40/10/42'>Matthew 10:42</a>",
      "comment": "The exhortation to vigilance implies that perseverance is necessary for attaining the fullness of reward. The text points to cooperation with grace over time."
    },
    {
      "pk": 2014009,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 9,
      "text": "Everyone who goes ahead and does not remain in the teaching of Christ does not have God; whoever abides in the teaching has both the Father and the Son.",
      "links": "<a href='/AIV/62/2/23-24'>1 John 2:23-24</a>; <a href='/AIV/43/15/4'>John 15:4</a>",
      "comment": "Remaining in the teaching—apostolic doctrine—is essential for full communion with God. This strongly supports the importance of an unbroken, apostolic tradition."
    },
    {
      "pk": 2014010,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 10,
      "text": "If anyone comes to you and does not bring this teaching, do not welcome him into your house or give him any greeting,",
      "links": "<a href='/AIV/40/10/14'>Matthew 10:14</a>; <a href='/AIV/62/4/1'>1 John 4:1</a>",
      "comment": "Refusal of hospitality to false teachers stresses the need for boundaries in protecting the integrity of the faith community. The primacy of correct doctrine is evident."
    },
    {
      "pk": 2014011,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 11,
      "text": "for whoever greets him shares in his wicked works.",
      "links": "<a href='/AIV/19/50/18'>Psalm 50:18</a>; <a href='/AIV/62/3/8'>1 John 3:8</a>",
      "comment": "Partnership in error is seen as serious—fellowship with teaching contrary to apostolic faith is equated with evil. Community discipline is vital."
    },
    {
      "pk": 2014012,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 12,
      "text": "Although I have much to write to you, I would rather not use paper and ink. Instead, I hope to come to you and speak face to face, so that our joy may be complete.",
      "links": "<a href='/AIV/62/1/4'>1 John 1:4</a>; <a href='/AIV/45/15/24'>Romans 15:24</a>",
      "comment": "Direct, personal fellowship is the intended norm for apostolic communication, reflecting the high value given to communal gathering and shared joy."
    },
    {
      "pk": 2014013,
      "translation": "AIV",
      "book": 63,
      "chapter": 1,
      "verse": 13,
      "text": "The children of your chosen sister greet you.",
      "links": "<a href='/AIV/62/3/1'>1 John 3:1</a>; <a href='/AIV/57/1/2'>Philemon 1:2</a>",
      "comment": "Greetings from the ‘chosen sister’s children’ suggest interconnected Christian communities, united in mutual charity and faith."
    }
  ],
  "translatedAt": "2025-12-23T04:19:57.221Z"
}