{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 5,
  "verses": [
    {
      "pk": 11005001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 1,
      "text": "When Hiram king of Tyre heard that Solomon had been anointed king in place of his father David, he sent messengers to Solomon, because Hiram had always been a friend to David.",
      "links": "<a href='/AIV/10/5/11'>2 Sam. 5:11</a>; <a href='/AIV/13/14/1'>1 Chron. 14:1</a>",
      "comment": "Hiram’s continued friendship with the house of David reveals God’s providence in preserving David’s line and establishing peace for Solomon’s reign, setting the stage for temple-building. Friendship between nations prefigures the universal reach God intends for His people."
    },
    {
      "pk": 11005002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 2,
      "text": "Solomon sent word back to Hiram:",
      "links": "",
      "comment": "Preparations for diplomatic negotiation show Solomon’s wisdom and prudence, qualities that would be later seen fully in Christ, the fulfillment of divine wisdom (<a href='/AIV/19/72/1'>Ps. 72:1</a>)."
    },
    {
      "pk": 11005003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 3,
      "text": "\"You know that my father David was not able to build a house for the Name of the LORD his God, because of the wars that surrounded him until the LORD put his enemies under the soles of his feet.",
      "links": "<a href='/AIV/10/7/2-13'>2 Sam. 7:2-13</a>; <a href='/AIV/13/22/7-10'>1 Chron. 22:7-10</a>",
      "comment": "Solomon references divine intervention and David’s obstacles, revealing the importance of rest from enemies in establishing worship. The imagery of “under his feet” is repeated in messianic prophecy (<a href='/AIV/19/110/1'>Ps. 110:1</a>), later fulfilled in Christ’s triumph (<a href='/AIV/58/10/13'>Heb. 10:13</a>), demonstrating a pattern of divine plan working through generations."
    },
    {
      "pk": 11005004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 4,
      "text": "But now the LORD my God has given me rest on every side; there is no adversary and nothing evil happening.",
      "links": "<a href='/AIV/13/22/9'>1 Chron. 22:9</a>",
      "comment": "Solomon’s reign of peace is divinely ordained, foreshadowing the ultimate peace Christ brings. True worship and establishment of God’s dwelling among His people requires peace—a model followed by Abraham’s descendants and seen again in the new covenant."
    },
    {
      "pk": 11005005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 5,
      "text": "\"So I intend to build a house for the Name of the LORD my God, just as the LORD told my father David, saying, ‘Your son, whom I will set upon your throne in your place, he will build the house for My Name.’",
      "links": "<a href='/AIV/10/7/12-13'>2 Sam. 7:12-13</a>; <a href='/AIV/13/17/11-12'>1 Chron. 17:11-12</a>",
      "comment": "Solomon’s intent is fulfillment of God’s covenant with David, which contains both immediate and messianic promises. The building of the temple becomes a sign of God dwelling among His people—an image fulfilled perfectly in the incarnation of Christ (<a href='/AIV/43/1/14'>John 1:14</a>)."
    },
    {
      "pk": 11005006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 6,
      "text": "So command that cedars from Lebanon be cut for me. My servants will join your servants, and I will pay you whatever wages you set for your servants. For you know there is no one among us who can cut timber like the Sidonians.\"",
      "links": "<a href='/AIV/14/2/8-10'>2 Chron. 2:8-10</a>",
      "comment": "Solomon’s request acknowledges the unique skills of the Sidonians, implying God’s providential use of all nations for His purposes, reminiscent of the later gathering of Gentiles for divine worship (<a href='/AIV/23/60/13'>Isa. 60:13</a>). Collaboration for sacred purposes finds echoes in the unity that the people of God are called to maintain."
    },
    {
      "pk": 11005007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 7,
      "text": "When Hiram heard Solomon’s message, he rejoiced greatly and said, \"Blessed be the LORD today, who has given David a wise son to rule this great people.\"",
      "links": "<a href='/AIV/19/72/1'>Ps. 72:1</a>",
      "comment": "Hiram blesses the LORD, recognizing Solomon as a wise ruler. Gentile acknowledgement of the LORD hints at the universal call to worship God, later fulfilled in Christ, who draws all peoples unto Himself (<a href='/AIV/43/12/32'>John 12:32</a>)."
    },
    {
      "pk": 11005008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 8,
      "text": "Hiram sent word to Solomon, saying, \"I have heard your message; I will do all you desire concerning the cedar and cypress timber.",
      "links": "<a href='/AIV/14/2/16'>2 Chron. 2:16</a>",
      "comment": "Hiram’s ready cooperation continues the pattern of peaceful exchange and mutual benefit in the service of sacred work, a principle carried into the New Testament community working together to build up God’s temple—not of stone, but souls."
    },
    {
      "pk": 11005009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 9,
      "text": "My servants will bring the timber down from Lebanon to the sea. I will make rafts to float them by sea to the place you specify. I will then break them apart there, and you can take them away. You will pay me according to what I want for my household.\"",
      "links": "<a href='/AIV/14/2/16'>2 Chron. 2:16</a>",
      "comment": "The logistical arrangements display wisdom and order, reflecting the careful planning God desires in matters of worship and service, foreshadowing the organization seen in the apostolic foundation of the Church (<a href='/AIV/44/6/1-7'>Acts 6:1-7</a>)."
    },
    {
      "pk": 11005010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 10,
      "text": "So Hiram supplied Solomon with all the cedar and cypress wood he wanted.",
      "links": "<a href='/AIV/14/2/8'>2 Chron. 2:8</a>",
      "comment": "The abundance of materials is a sign of God’s blessing and generosity, paralleling the spiritual gifts God gives to build up His people (<a href='/AIV/45/12/6-8'>Rom. 12:6-8</a>)."
    },
    {
      "pk": 11005011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 11,
      "text": "Solomon then gave Hiram twenty thousand cors of wheat as food for his household, and twenty thousand baths of pure oil. Solomon gave this to Hiram year after year.",
      "links": "<a href='/AIV/14/2/10'>2 Chron. 2:10</a>",
      "comment": "Solomon’s generosity in return mirrors the biblical principle of reciprocity and sharing, prefiguring the spiritual exchange of gifts and graces within the community of faith (<a href='/AIV/47/8/13-14'>2 Cor. 8:13-14</a>)."
    },
    {
      "pk": 11005012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 12,
      "text": "The LORD gave Solomon wisdom, just as He had promised. There was peace between Hiram and Solomon, and the two of them made a treaty.",
      "links": "<a href='/AIV/11/3/12'>1 Kgs. 3:12</a>",
      "comment": "Divinely-given wisdom secures peace and order, a design repeated in the life of Christ and the apostolic leadership, which governs God’s people with understanding and unity (<a href='/AIV/49/4/3'>Eph. 4:3</a>)."
    },
    {
      "pk": 11005013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 13,
      "text": "King Solomon raised forced labor out of all Israel; thirty thousand men.",
      "links": "<a href='/AIV/09/8/10-18'>1 Sam. 8:10-18</a>; <a href='/AIV/13/22/2'>1 Chron. 22:2</a>",
      "comment": "Solomon’s organization of labor fulfills Samuel’s prophecy about kings, reflecting the cost and structure involved in building the temple. It highlights the sacrifice and cooperation required for divine worship and foreshadows the call to self-giving in Christian discipleship (<a href='/AIV/40/16/24'>Matt. 16:24</a>)."
    },
    {
      "pk": 11005014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 14,
      "text": "He sent them to Lebanon in shifts of ten thousand each month, spending a month in Lebanon and two months at home. Adoniram was in charge of the forced labor.",
      "links": "<a href='/AIV/11/4/6'>1 Kgs. 4:6</a>",
      "comment": "Solomon’s administration shows wisdom and mercy, allowing rest for workers. This prefigures rhythm and order in sacred service—a balance of work and rest. The principle of spiritual authority is evident, reflecting similar structures in New Testament leadership."
    },
    {
      "pk": 11005015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 15,
      "text": "Solomon had seventy thousand men who carried loads and eighty thousand who cut stone in the hills,",
      "links": "<a href='/AIV/13/22/2'>1 Chron. 22:2</a>",
      "comment": "The great multitude involved demonstrates the magnitude and unity required for sacred building. This illustrates the participation of all God’s people in constructing the spiritual temple of faith (<a href='/AIV/60/2/5'>1 Pet. 2:5</a>)."
    },
    {
      "pk": 11005016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 16,
      "text": "besides three thousand three hundred supervisors who oversaw the workers.",
      "links": "",
      "comment": "Organization and oversight are valued in sacred work, showing the importance of leadership and order—a motif present in the apostolic succession, which maintains unity and correct teaching in matters of faith."
    },
    {
      "pk": 11005017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 17,
      "text": "The king commanded them to quarry large, excellent stones for the foundation of the house, hewn stones.",
      "links": "<a href='/AIV/16/4/2'>Neh. 4:2</a>; <a href='/AIV/19/118/22'>Ps. 118:22</a>",
      "comment": "The use of choice stones foreshadows Christ as the ‘cornerstone’ rejected yet chosen (<a href='/AIV/19/118/22'>Ps. 118:22</a>; <a href='/AIV/42/20/17'>Luke 20:17</a>). The foundation imagery reverberates in doctrines of faith and community built on Christ and the apostles."
    },
    {
      "pk": 11005018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 5,
      "verse": 18,
      "text": "Solomon’s builders and Hiram’s builders, together with the men of Gebal, dressed the stones and prepared the timber and stones for building the house.",
      "links": "<a href='/AIV/26/27/9'>Ezek. 27:9</a>",
      "comment": "The joint effort between Israelites and Gentiles in temple construction anticipates the inclusive nature of God’s people. The image of many nations coming together finds fulfillment in the gathering of all peoples into one household of God (<a href='/AIV/49/2/19-22'>Eph. 2:19-22</a>). The temple’s building thus becomes a foreshadowing of the spiritual temple Christ establishes."
    }
  ],
  "translatedAt": "2025-12-24T03:30:10.106Z"
}