{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 3,
  "verses": [
    {
      "pk": 11003001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 1,
      "text": "Solomon allied himself with Pharaoh king of Egypt by marrying Pharaoh’s daughter. He brought her into the city of David until he had finished building his own house, the house of the LORD, and the wall around Jerusalem.",
      "links": "<a href='/AIV/10/5/9'>2 Sam. 5:9</a>; <a href='/AIV/14/8/11'>2 Chr. 8:11</a>",
      "comment": "This verse introduces Solomon's marriage to Pharaoh's daughter, symbolizing political alliance and the early consolidation of Solomon's rule. Notice the delay in bringing her into his permanent home, foreshadowing the temple's significance as the center of Israel’s worship and Solomon’s reign."
    },
    {
      "pk": 11003002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 2,
      "text": "The people were still sacrificing at the high places, because a house for the name of the LORD had not yet been built.",
      "links": "<a href='/AIV/05/12/5'>Deut. 12:5</a>; <a href='/AIV/09/7/17'>1 Sam. 7:17</a>",
      "comment": "The use of high places was permitted temporarily, reflecting Israel’s longing for a central sanctuary—ultimately fulfilled in the temple, a prefiguration of spiritual worship centered around God’s dwelling among his people."
    },
    {
      "pk": 11003003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 3,
      "text": "Solomon loved the LORD, walking in the statutes of David his father; but he also sacrificed and burned incense at the high places.",
      "links": "<a href='/AIV/19/18/1'>Ps. 18:1</a>; <a href='/AIV/11/11/4'>1 Kgs. 11:4</a>",
      "comment": "Solomon’s genuine devotion is expressed, though imperfect (not yet centralized worship). This duality foreshadows the tension between internal faithfulness and external ritual, a theme Jesus taught about (see <a href='/AIV/40/23/23-28'>Matt. 23:23-28</a>)."
    },
    {
      "pk": 11003004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 4,
      "text": "The king went to Gibeon to sacrifice there, for that was the most important high place. Solomon offered a thousand burnt offerings on that altar.",
      "links": "<a href='/AIV/09/9/12'>1 Sam. 9:12</a>; <a href='/AIV/14/1/3'>2 Chr. 1:3</a>",
      "comment": "Gibeon’s prominence and Solomon’s lavish sacrifice express total dedication and anticipation of God’s favor. The use of 'burnt offerings' hints at mediation and intercession, themes later fulfilled in Christ’s once-for-all sacrifice (<a href='/AIV/58/10/10-14'>Heb. 10:10-14</a>)."
    },
    {
      "pk": 11003005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 5,
      "text": "At Gibeon, the LORD appeared to Solomon in a dream by night, and God said, 'Ask for whatever you want Me to give you.'",
      "links": "<a href='/AIV/01/20/3'>Gen. 20:3</a>; <a href='/AIV/09/3/1-10'>1 Sam. 3:1-10</a>",
      "comment": "God initiates communication, inviting Solomon to ask—a pattern of gracious self-disclosure. Dreams are common in biblical revelation (<a href='/AIV/01/28/12'>Gen. 28:12</a>). God’s generosity echoes Jesus’ promises in <a href='/AIV/40/7/7-11'>Matt. 7:7-11</a>."
    },
    {
      "pk": 11003006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 6,
      "text": "Solomon replied, 'You have shown great and steadfast love to Your servant David my father, because he walked before You in faithfulness, righteousness, and uprightness of heart toward You. You have kept for him this great and steadfast love and have given him a son to sit on his throne this day.'",
      "links": "<a href='/AIV/10/7/15-16'>2 Sam. 7:15-16</a>; <a href='/AIV/19/89/28-29'>Ps. 89:28-29</a>",
      "comment": "References God’s covenantal faithfulness. Solomon’s words recall the Davidic promises, pointing to a lasting dynasty and, ultimately, to messianic hope through David’s descendants (<a href='/AIV/42/1/32-33'>Luke 1:32-33</a>)."
    },
    {
      "pk": 11003007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 7,
      "text": "'Now, LORD my God, You have made Your servant king in place of my father David, though I am just a young man and do not know how to go out or come in.'",
      "links": "<a href='/AIV/11/2/2'>1 Kgs. 2:2</a>; <a href='/AIV/09/18/5'>1 Sam. 18:5</a>",
      "comment": "Solomon’s humility and sense of inadequacy reflect dependence on Divine guidance—a necessary quality for true spiritual leadership and authority (see <a href='/AIV/19/25/4-5'>Ps. 25:4-5</a>)."
    },
    {
      "pk": 11003008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 8,
      "text": "'And Your servant is among Your people whom You have chosen, a great people, too numerous to be counted or numbered.'",
      "links": "<a href='/AIV/01/13/16'>Gen. 13:16</a>; <a href='/AIV/05/7/6'>Deut. 7:6</a>",
      "comment": "Solomon recognizes his role among God’s covenant people, echoing the Abrahamic promises of countless descendants—emphasizing the spiritual heritage entrusted to Israel (<a href='/AIV/01/22/17'>Gen. 22:17</a>)."
    },
    {
      "pk": 11003009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 9,
      "text": "'Therefore give Your servant an understanding heart to judge Your people and to discern between good and evil. For who is able to judge this great people of Yours?'",
      "links": "<a href='/AIV/19/72/1'>Ps. 72:1</a>; <a href='/AIV/58/5/14'>Heb. 5:14</a>",
      "comment": "Solomon’s request for wisdom to govern well sets a pattern for seeking spiritual gifts for service, anticipating the wisdom embodied in Christ (<a href='/AIV/46/1/24'>1 Cor. 1:24</a>)."
    },
    {
      "pk": 11003010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 10,
      "text": "The request pleased the Lord, that Solomon had asked for this.",
      "links": "<a href='/AIV/19/51/6'>Ps. 51:6</a>; <a href='/AIV/40/6/33'>Matt. 6:33</a>",
      "comment": "God’s delight in Solomon’s selfless request highlights the priority of spiritual gifts over material riches, a principle Jesus reaffirms regarding seeking the kingdom first."
    },
    {
      "pk": 11003011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 11,
      "text": "God said to him, 'Since you have asked for this, and not asked for a long life or riches or the death of your enemies, but have asked for understanding to discern justice,'",
      "links": "<a href='/AIV/19/119/66'>Ps. 119:66</a>; <a href='/AIV/59/1/5'>Jas. 1:5</a>",
      "comment": "Solomon’s prioritizing wisdom over temporal gains exemplifies the value of spiritual pursuits, encouraging believers to seek true understanding first."
    },
    {
      "pk": 11003012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 12,
      "text": "'I will do what you have asked. I will give you a wise and understanding heart, so that there has never been anyone like you before, nor will anyone like you arise after you.'",
      "links": "<a href='/AIV/14/1/12'>2 Chr. 1:12</a>; <a href='/AIV/19/72/7'>Ps. 72:7</a>",
      "comment": "God’s unique bestowal of wisdom upon Solomon prefigures the singular wisdom found in Christ, the new David and greater Solomon (<a href='/AIV/40/12/42'>Matt. 12:42</a>)."
    },
    {
      "pk": 11003013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 13,
      "text": "'Moreover, I will give you what you have not asked for—both riches and honor—so that in your lifetime no other king will compare to you.'",
      "links": "<a href='/AIV/19/21/6'>Ps. 21:6</a>; <a href='/AIV/19/112/2-3'>Ps. 112:2-3</a>",
      "comment": "The abundance Solomon receives illustrates the blessing given to those who seek God above all, a biblical reminder of divine generosity (see <a href='/AIV/40/6/33'>Matt. 6:33</a>)."
    },
    {
      "pk": 11003014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 14,
      "text": "'If you walk in My ways, keeping My statutes and commandments as your father David did, I will lengthen your days.'",
      "links": "<a href='/AIV/05/30/20'>Deut. 30:20</a>; <a href='/AIV/19/91/16'>Ps. 91:16</a>",
      "comment": "Conditional blessing attached to faithful obedience. This principle is consistently repeated, affirming the necessity of perseverance in God’s law."
    },
    {
      "pk": 11003015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 15,
      "text": "Solomon awoke and realized it was a dream. He returned to Jerusalem and stood before the ark of the covenant of the LORD, offered burnt offerings and peace offerings, and held a feast for all his servants.",
      "links": "<a href='/AIV/10/6/17'>2 Sam. 6:17</a>; <a href='/AIV/14/7/4-10'>2 Chr. 7:4-10</a>",
      "comment": "The ark signifies God’s real presence—central to worship. Solomon’s response with sacrifice and communal celebration models gratitude and liturgical worship, anticipating Christian worship’s focus on the true presence of God."
    },
    {
      "pk": 11003016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 16,
      "text": "Then two women who were prostitutes came to the king and stood before him.",
      "links": "<a href='/AIV/19/72/12'>Ps. 72:12</a>; <a href='/AIV/23/1/17'>Isa. 1:17</a>",
      "comment": "Solomon is approached by marginalized individuals, prefiguring Christ’s mercy and openness to those on the fringes (<a href='/AIV/40/21/31'>Matt. 21:31</a>)."
    },
    {
      "pk": 11003017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 17,
      "text": "One woman said, 'My lord, this woman and I live in the same house. I gave birth while she was in the house.'",
      "links": "<a href='/AIV/19/12/5'>Ps. 12:5</a>",
      "comment": "Their shared circumstances illustrate the complexity of community life and reliance on wise, impartial judgment."
    },
    {
      "pk": 11003018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 18,
      "text": "'Three days after I gave birth, this woman also gave birth. We were together. No one else was with us in the house; only the two of us were there.'",
      "links": "",
      "comment": "The legal situation is set up with no outside witnesses, highlighting the importance of wisdom in judicial decisions."
    },
    {
      "pk": 11003019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 19,
      "text": "'But this woman’s son died during the night because she lay on him.'",
      "links": "",
      "comment": "Real-life tragedy adds urgency to the dispute and shows the king’s responsibility for justice and mercy."
    },
    {
      "pk": 11003020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 20,
      "text": "'So she got up in the middle of the night and took my son from beside me while your servant was asleep. She laid him in her arms and put her dead son in my arms.'",
      "links": "",
      "comment": "The accusation intensifies the dilemma. The narrative’s detail underscores the search for truth—a foundation of biblical justice."
    },
    {
      "pk": 11003021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 21,
      "text": "'When I got up in the morning to nurse my son, I found him dead. But when I looked at him closely in the morning, I saw that he was not the son I had borne.'",
      "links": "",
      "comment": "Discernment and attention to detail are key; the story builds on recognition of truth amid confusion."
    },
    {
      "pk": 11003022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 22,
      "text": "The other woman said, 'No! The living child is mine and the dead child is yours.' But the first woman said, 'No! The dead child is yours and the living child is mine.' Thus, they argued before the king.",
      "links": "",
      "comment": "The intensity of the dispute signals the need for a wisdom that goes beyond mere facts; it points to the discernment needed by spiritual shepherds."
    },
    {
      "pk": 11003023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 23,
      "text": "The king said, 'This one says, \"My son is the living one and your son is the dead one.\" And the other says, \"No, your son is the dead one, and my son is the living one.\"'",
      "links": "",
      "comment": "Solomon repeats their claims, methodically clarifying and embodying just leadership—a model for authority built on understanding rather than assertion."
    },
    {
      "pk": 11003024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 24,
      "text": "The king said, 'Bring me a sword.' So they brought a sword before the king.",
      "links": "<a href='/AIV/58/4/12'>Heb. 4:12</a>",
      "comment": "The sword as an instrument of judgment suggests the necessity for decisive, sometimes sharp, action. Biblically, 'sword' also symbolizes God’s Word for discernment (see <a href='/AIV/58/4/12'>Heb. 4:12</a>)."
    },
    {
      "pk": 11003025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 25,
      "text": "The king said, 'Divide the living child in two and give half to one, and half to the other.'",
      "links": "",
      "comment": "Solomon proposes a shocking test, intending to reveal true maternal love. His wisdom utilizes the heart’s deepest instincts, rather than surface-level arguments."
    },
    {
      "pk": 11003026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 26,
      "text": "Then the woman whose son was alive spoke to the king, because her heart yearned for her son. She said, 'Please, my lord, give her the living child—do not kill him!' But the other said, 'He shall be neither mine nor yours; divide him.'",
      "links": "<a href='/AIV/23/49/15'>Isa. 49:15</a>",
      "comment": "True love is sacrificial and seeks life above justice. The mother’s plea echoes themes of self-denial and protection, characteristics embodied perfectly in Christ."
    },
    {
      "pk": 11003027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 27,
      "text": "Then the king answered, 'Give the living child to the first woman, and do not kill him; she is his mother.'",
      "links": "<a href='/AIV/19/72/2'>Ps. 72:2</a>",
      "comment": "The wise judgment vindicates authentic love and justice. Solomon’s discernment demonstrates the spiritual gift of wisdom, a gift desired by Christian leaders entrusted with care for souls."
    },
    {
      "pk": 11003028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 3,
      "verse": 28,
      "text": "When all Israel heard of the judgment the king had rendered, they stood in awe of the king, because they saw that the wisdom of God was in him to do justice.",
      "links": "<a href='/AIV/19/72/1-4'>Ps. 72:1-4</a>; <a href='/AIV/19/111/10'>Ps. 111:10</a>",
      "comment": "Solomon’s fame for wisdom spread, prefiguring the universal recognition of true authority and holiness. The wisdom seen in Solomon anticipates Christ, whose wisdom and authority surpass all others (<a href='/AIV/40/12/42'>Matt. 12:42</a>)."
    }
  ],
  "translatedAt": "2025-12-24T03:29:12.675Z"
}