{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 8,
  "verses": [
    {
      "pk": 11008001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 1,
      "text": "Then Solomon assembled the elders of Israel, all the heads of the tribes, the leaders of the ancestral houses of the Israelites, before himself in Jerusalem, to bring up the ark of the covenant of the LORD from the city of David, which is Zion.",
      "links": "<a href='/AIV/10/6/17'>2 Sam. 6:17</a>; <a href='/AIV/13/15/3-28'>1 Chron. 15:3-28</a>",
      "comment": "The beginning of the chapter focuses on the solemn gathering of Israel’s leaders for the ark’s transfer. This prefigures moments of unity and sacred assembly later seen in the Church’s history, where leaders gather for solemn rites."
    },
    {
      "pk": 11008002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 2,
      "text": "All the men of Israel assembled themselves to King Solomon at the feast in the month Ethanim, which is the seventh month.",
      "links": "<a href='/AIV/3/23/33-34'>Lev. 23:33-34</a>; <a href='/AIV/14/5/3'>2 Chron. 5:3</a>",
      "comment": "The mention of Ethanim connects to the Feast of Tabernacles, a major pilgrimage and worship festival. Such celebrations highlight the liturgical worship central to the life of God’s people."
    },
    {
      "pk": 11008003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 3,
      "text": "When all the elders of Israel had come, the priests took up the ark.",
      "links": "<a href='/AIV/4/4/5'>Num. 4:5</a>; <a href='/AIV/14/5/4'>2 Chron. 5:4</a>",
      "comment": "The priests, not laypeople, carry the ark, signifying an ordained ministry set apart for sacred duties, which is reiterated in New Testament ecclesiology."
    },
    {
      "pk": 11008004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 4,
      "text": "They brought up the ark of the LORD, the Tent of Meeting, and all the holy vessels that were in the tent; the priests and Levites carried them.",
      "links": "<a href='/AIV/2/40/34-38'>Ex. 40:34-38</a>; <a href='/AIV/13/15/14-15'>1 Chron. 15:14-15</a>",
      "comment": "The holy vessels, reserved for worship, point toward the sanctification of every element used in the worship of God, prefiguring later sacramental customs."
    },
    {
      "pk": 11008005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 5,
      "text": "King Solomon and the whole assembly of Israel, who had gathered before him, were sacrificing sheep and cattle that could not be counted or numbered for multitude before the ark.",
      "links": "<a href='/AIV/3/1/3-6'>Lev. 1:3-6</a>; <a href='/AIV/13/16/1'>1 Chron. 16:1</a>",
      "comment": "The vast number of sacrifices signifies extravagant devotion and the seriousness of entering God's presence, foreshadowing the later understanding of Christ’s singular, supreme sacrifice."
    },
    {
      "pk": 11008006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 6,
      "text": "The priests brought the ark of the covenant of the LORD to its place, into the inner sanctuary of the house, to the Most Holy Place, under the wings of the cherubim.",
      "links": "<a href='/AIV/2/26/33-34'>Ex. 26:33-34</a>; <a href='/AIV/14/5/7'>2 Chron. 5:7</a>",
      "comment": "The ark’s placement in the Holy of Holies typifies the meeting point of heaven and earth, foreshadowing the incarnation and the real presence of God."
    },
    {
      "pk": 11008007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 7,
      "text": "For the cherubim spread their wings above the place of the ark, and covered the ark and its poles from above.",
      "links": "<a href='/AIV/2/25/20'>Ex. 25:20</a>; <a href='/AIV/14/5/8'>2 Chron. 5:8</a>",
      "comment": "The cherubim’s posture reflects the reverence due to God. Iconography in worship recalls this ancient veneration."
    },
    {
      "pk": 11008008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 8,
      "text": "The poles were so long that their ends could be seen from the Holy Place in front of the inner sanctuary, but they could not be seen from outside. They are there to this day.",
      "links": "<a href='/AIV/2/25/13-15'>Ex. 25:13-15</a>",
      "comment": "The visibility of the poles underscores the perpetual testament of God’s covenant with Israel—an enduring sacramental reality."
    },
    {
      "pk": 11008009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 9,
      "text": "There was nothing in the ark except the two stone tablets Moses had placed at Horeb, when the LORD made a covenant with the Israelites after they came out of the land of Egypt.",
      "links": "<a href='/AIV/2/34/28'>Ex. 34:28</a>; <a href='/AIV/5/10/2'>Deut. 10:2</a>",
      "comment": "The contents of the ark emphasize the primacy of God’s covenant law. This law finds its fulfillment in Christ (cf. Matt. 5:17-18)."
    },
    {
      "pk": 11008010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 10,
      "text": "When the priests came out of the Holy Place, a cloud filled the house of the LORD.",
      "links": "<a href='/AIV/2/40/34-35'>Ex. 40:34-35</a>; <a href='/AIV/14/5/13'>2 Chron. 5:13</a>",
      "comment": "The cloud expresses God’s glory and presence, a theophanic sign, hinting at God’s indwelling among His people, anticipating the descent of the Spirit at Pentecost."
    },
    {
      "pk": 11008011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 11,
      "text": "The priests could not stand to minister because of the cloud, for the glory of the LORD filled the house of the LORD.",
      "links": "<a href='/AIV/19/29/9'>Ps. 29:9</a>; <a href='/AIV/2/40/35'>Ex. 40:35</a>",
      "comment": "God’s glory is overwhelming and unapproachable apart from His invitation—a theme deepened in Christian soteriology."
    },
    {
      "pk": 11008012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 12,
      "text": "Then Solomon said, \"The LORD has said that He would dwell in thick darkness.\"",
      "links": "<a href='/AIV/2/20/21'>Ex. 20:21</a>; <a href='/AIV/19/97/2'>Ps. 97:2</a>",
      "comment": "God’s willingness to be present, yet veiled, points to the deep mystery of divine revelation—only fully unveiled in Christ."
    },
    {
      "pk": 11008013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 13,
      "text": "\"I have surely built You an exalted house, a place for You to dwell forever.\"",
      "links": "<a href='/AIV/19/132/13-14'>Ps. 132:13-14</a>",
      "comment": "Solomon’s affirmation of the temple’s permanence foreshadows Christ’s promise of an eternal spiritual temple."
    },
    {
      "pk": 11008014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 14,
      "text": "Then the king turned around and blessed all the assembly of Israel, while all the assembly of Israel stood.",
      "links": "<a href='/AIV/1/27/27'>Gen. 27:27</a>; <a href='/AIV/14/6/3'>2 Chron. 6:3</a>",
      "comment": "Kingly blessings anticipate Christ’s priestly and royal role to bless His people (cf. Heb. 7:1)."
    },
    {
      "pk": 11008015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 15,
      "text": "He said: \"Blessed be the LORD, the God of Israel, who with His mouth has promised to my father David, and with His hand has fulfilled it, saying:",
      "links": "<a href='/AIV/10/7/12-16'>2 Sam. 7:12-16</a>",
      "comment": "Solomon references God’s covenant faithfulness. The fulfillment through Solomon is a type; the ultimate fulfillment is in Jesus, the Son of David."
    },
    {
      "pk": 11008016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 16,
      "text": "'Since the day I brought my people Israel out of Egypt, I have not chosen a city from all the tribes of Israel as a place to build a house for My Name, but I chose David to be over My people Israel.'",
      "links": "<a href='/AIV/5/12/5'>Deut. 12:5</a>; <a href='/AIV/10/7/8'>2 Sam. 7:8</a>",
      "comment": "The election of David and Jerusalem establishes a central locus of worship, a foreshadowing of the unified Church under an appointed leader."
    },
    {
      "pk": 11008017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 17,
      "text": "\"My father David had it in his heart to build a house for the Name of the LORD, the God of Israel.",
      "links": "<a href='/AIV/13/17/1'>1 Chron. 17:1</a>; <a href='/AIV/10/7/2'>2 Sam. 7:2</a>",
      "comment": "David’s intent to build foreshadows heartfelt desire for God’s dwelling among His people."
    },
    {
      "pk": 11008018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 18,
      "text": "But the LORD said to David my father, 'Because it was in your heart to build a house for My Name, you did well that it was in your heart.'",
      "links": "<a href='/AIV/10/7/4-7'>2 Sam. 7:4-7</a>",
      "comment": "God values David’s intention, even though Solomon fulfills it. This points to the value God places on authentic desire for His presence."
    },
    {
      "pk": 11008019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 19,
      "text": "'Nevertheless, you shall not build the house, but your son, who comes from your own body, shall build the house for My Name.'",
      "links": "<a href='/AIV/10/7/12-13'>2 Sam. 7:12-13</a>",
      "comment": "Solomon’s building of the temple looks forward to the greater Son of David, Christ, who builds the everlasting spiritual house."
    },
    {
      "pk": 11008020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 20,
      "text": "\"Now the LORD has fulfilled the word He spoke, for I have taken the place of David my father and sit on the throne of Israel, as the LORD promised, and I have built the house for the Name of the LORD, the God of Israel.",
      "links": "<a href='/AIV/13/6/10'>1 Chron. 6:10</a>",
      "comment": "Solomon’s acknowledgment shows the fulfillment of prophecy and the legitimacy of dynastic succession, an important principle for apostolic continuity."
    },
    {
      "pk": 11008021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 21,
      "text": "And there I have set a place for the ark, in which is the covenant of the LORD that He made with our ancestors when He brought them out of the land of Egypt.\"",
      "links": "<a href='/AIV/2/25/21'>Ex. 25:21</a>",
      "comment": "The presence of the ark ties together history, covenant, and worship, central themes in the unfolding plan of redemption."
    },
    {
      "pk": 11008022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 22,
      "text": "Then Solomon stood before the altar of the LORD in the presence of all the assembly of Israel and spread out his hands toward heaven.",
      "links": "<a href='/AIV/14/6/12'>2 Chron. 6:12</a>",
      "comment": "Solomon’s posture of prayer exemplifies intercessory prayer in the presence of God, setting precedent for liturgical prayer in communal worship."
    },
    {
      "pk": 11008023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 23,
      "text": "He said: \"O LORD, God of Israel, there is no God like You, in heaven above or on earth beneath, keeping covenant and showing steadfast love to Your servants who walk before You with all their heart.\"",
      "links": "<a href='/AIV/2/20/4'>Ex. 20:4</a>; <a href='/AIV/19/25/10'>Ps. 25:10</a>",
      "comment": "Solomon’s prayer emphasizes monotheism, covenant fidelity, and the importance of wholehearted devotion—anticipating the new law written on the heart (Jer. 31:33)."
    },
    {
      "pk": 11008024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 24,
      "text": "\"You have kept what You promised Your servant David my father. You spoke with Your mouth and fulfilled it with Your hand, as it is this day.\"",
      "links": "<a href='/AIV/10/7/12'>2 Sam. 7:12</a>",
      "comment": "The motif of God’s promise fulfilled by His action underlines divine faithfulness and sovereignty."
    },
    {
      "pk": 11008025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 25,
      "text": "\"Now therefore, O LORD, God of Israel, keep for Your servant David my father what You promised him, saying, 'You shall not lack a man to sit before Me on the throne of Israel, if your sons take heed to their way, to walk before Me as you have walked before Me.'",
      "links": "<a href='/AIV/10/7/12-16'>2 Sam. 7:12-16</a>",
      "comment": "The Davidic covenant’s conditionality for David’s sons points forward to fulfillment in Christ who perfectly walks before God."
    },
    {
      "pk": 11008026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 26,
      "text": "\"Now therefore, O God of Israel, let Your word that You spoke to Your servant David my father be confirmed.\"",
      "links": "<a href='/AIV/10/7/25'>2 Sam. 7:25</a>",
      "comment": "Solomon’s prayer for affirmation reiterates the need for divine assurance, reflected in prayers for certainty throughout Scripture."
    },
    {
      "pk": 11008027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 27,
      "text": "\"But will God indeed dwell on the earth? Even the heavens, and the highest heaven cannot contain You; how much less this house that I have built!\"",
      "links": "<a href='/AIV/23/66/1'>Isa. 66:1</a>; <a href='/AIV/19/139/7-8'>Ps. 139:7-8</a>",
      "comment": "Solomon’s humility acknowledges the transcendence of God; the incarnation is the ultimate answer to this question—God truly dwelling among us (John 1:14)."
    },
    {
      "pk": 11008028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 28,
      "text": "\"But listen to the prayer of Your servant and to his plea, O LORD my God, listening to the cry and to the prayer that Your servant prays before You today:\"",
      "links": "<a href='/AIV/19/5/2'>Ps. 5:2</a>",
      "comment": "Solomon acts as intercessor, a king praying for God’s attention, prefiguring Christ as the supreme intercessor."
    },
    {
      "pk": 11008029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 29,
      "text": "\"That Your eyes may be open toward this house night and day, toward the place of which You said, 'My Name shall be there,' listening to the prayer that Your servant prays toward this place.\"",
      "links": "<a href='/AIV/14/7/15'>2 Chron. 7:15</a>",
      "comment": "Direction of prayer toward a holy place points towards established patterns of liturgical worship and reverence for sacred spaces."
    },
    {
      "pk": 11008030,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 30,
      "text": "\"And listen to the plea of Your servant and Your people Israel, when they pray toward this place; listen from heaven, Your dwelling place; and when You hear, forgive.\"",
      "links": "<a href='/AIV/14/6/21'>2 Chron. 6:21</a>",
      "comment": "The repeated call for forgiveness establishes God’s place as merciful and the temple’s role as a center for reconciliation."
    },
    {
      "pk": 11008031,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 31,
      "text": "\"When someone sins against a neighbor, and is required to take an oath, and comes and swears before Your altar in this house,\"",
      "links": "<a href='/AIV/2/22/10-11'>Ex. 22:10-11</a>",
      "comment": "Solomon acknowledges the role of the altar in mediating disputes—an early example of seeking justice before God."
    },
    {
      "pk": 11008032,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 32,
      "text": "\"Then hear in heaven, and act, and judge Your servants, condemning the guilty by bringing his conduct upon his own head, and vindicating the righteous by rewarding him according to his righteousness.\"",
      "links": "<a href='/AIV/19/18/20'>Ps. 18:20</a>; <a href='/AIV/19/7/8-9'>Ps. 7:8-9</a>",
      "comment": "Divine justice and righteousness anticipate Christ’s final judgment (Matt. 25:31-46)."
    },
    {
      "pk": 11008033,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 33,
      "text": "\"When Your people Israel are struck down before an enemy because they have sinned against You, and if they turn back to You and confess Your Name, and pray and plead with You in this house,\"",
      "links": "<a href='/AIV/3/26/40-42'>Lev. 26:40-42</a>; <a href='/AIV/19/32/5'>Ps. 32:5</a>",
      "comment": "Solomon links repentance, confession, and restoration—a foundation for later doctrines of contrition and forgiveness."
    },
    {
      "pk": 11008034,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 34,
      "text": "\"Then hear in heaven, and forgive the sin of Your people Israel, and bring them back to the land that You gave to their ancestors.\"",
      "links": "<a href='/AIV/5/30/3-5'>Deut. 30:3-5</a>; <a href='/AIV/19/85/1'>Ps. 85:1</a>",
      "comment": "The prayer underscores the promise of restoration upon repentance, foreshadowing themes fulfilled in salvation history."
    },
    {
      "pk": 11008035,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 35,
      "text": "\"When heaven is shut up, and there is no rain because they have sinned against You, yet they pray toward this place and confess Your Name, and turn from their sin because You afflict them,\"",
      "links": "<a href='/AIV/3/26/19'>Lev. 26:19</a>; <a href='/AIV/14/7/13-14'>2 Chron. 7:13-14</a>",
      "comment": "Natural calamities are seen as part of God’s providential discipline, encouraging repentance and seeking God."
    },
    {
      "pk": 11008036,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 36,
      "text": "\"Then hear in heaven and forgive the sin of Your servants, Your people Israel, and teach them the good way in which they should walk; and give rain upon Your land, which You have given to Your people as an inheritance.\"",
      "links": "<a href='/AIV/5/11/14'>Deut. 11:14</a>; <a href='/AIV/19/25/8-9'>Ps. 25:8-9</a>",
      "comment": "The prayer asks for both instruction and blessing, stressing God’s guidance and providence—core aspects of spiritual formation."
    },
    {
      "pk": 11008037,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 37,
      "text": "\"If there is famine in the land, if there is pestilence, blight, mildew, locust, or caterpillar, if their enemy besieges them in their land, whatever plague or sickness there is,\"",
      "links": "<a href='/AIV/2/10/12-15'>Ex. 10:12-15</a>; <a href='/AIV/3/26/25'>Lev. 26:25</a>",
      "comment": "All calamities, both natural and manmade, fall under God’s providence, emphasizing the need for prayerful dependence."
    },
    {
      "pk": 11008038,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 38,
      "text": "\"Whatever prayer, whatever plea is made by any individual or by all Your people Israel, each knowing the affliction of his own heart and spreading out his hands toward this house,\"",
      "links": "<a href='/AIV/19/34/4'>Ps. 34:4</a>",
      "comment": "Universal intercession is permitted; the temple is seen as a center for communal and personal prayer, foreshadowing the Church’s intercessory ministry."
    },
    {
      "pk": 11008039,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 39,
      "text": "\"Then hear in heaven Your dwelling place and forgive and act and give to everyone according to his ways, whose heart You know (for You alone know the hearts of all the children of mankind),\"",
      "links": "<a href='/AIV/19/139/1-2'>Ps. 139:1-2</a>",
      "comment": "God’s omniscience is affirmed—He judges with perfect knowledge, echoing themes found throughout Scripture."
    },
    {
      "pk": 11008040,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 40,
      "text": "\"That they may fear You all the days that they live in the land You gave to our ancestors.\"",
      "links": "<a href='/AIV/5/6/2'>Deut. 6:2</a>; <a href='/AIV/19/86/11'>Ps. 86:11</a>",
      "comment": "The proper response to God’s mercy and power is reverential fear, the beginning of wisdom (Prov. 9:10)."
    },
    {
      "pk": 11008041,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 41,
      "text": "\"Likewise, when a foreigner, who is not of Your people Israel, comes from a distant land for Your Name's sake,\"",
      "links": "<a href='/AIV/23/56/6-7'>Isa. 56:6-7</a>",
      "comment": "Inclusivity in worship is introduced—God’s house meant for all nations, seen later in the opening of the Church to the Gentiles."
    },
    {
      "pk": 11008042,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 42,
      "text": "\"(for they shall hear of Your great Name and Your mighty hand and Your outstretched arm), when he comes and prays toward this house,\"",
      "links": "<a href='/AIV/2/6/6'>Ex. 6:6</a>",
      "comment": "God’s renown spreads by His deeds, attracting seekers from other nations—anticipating universal mission."
    },
    {
      "pk": 11008043,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 43,
      "text": "\"Hear in heaven Your dwelling place and do according to all for which the foreigner calls to You, so that all the peoples of the earth may know Your Name and fear You, as do Your people Israel, and that they may know that this house I have built is called by Your Name.\"",
      "links": "<a href='/AIV/19/67/1-2'>Ps. 67:1-2</a>",
      "comment": "Solomon prays for God’s house to be a testimony to all nations—a prelude to the Church’s universal outreach."
    },
    {
      "pk": 11008044,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 44,
      "text": "\"If Your people go out to battle against their enemy, by whatever way You send them, and they pray to the LORD toward the city which You have chosen and the house that I have built for Your Name,\"",
      "links": "<a href='/AIV/14/6/34'>2 Chron. 6:34</a>",
      "comment": "Directionality in prayer is again emphasized—a call to unity and order in worship."
    },
    {
      "pk": 11008045,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 45,
      "text": "\"Then hear in heaven their prayer and their plea, and uphold their cause.\"",
      "links": "<a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "God as a defender of His people, and the importance of seeking Him in times of conflict."
    },
    {
      "pk": 11008046,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 46,
      "text": "\"If they sin against You (for there is no one who does not sin) and You are angry with them and give them over to an enemy, so that they are carried away captive to the land of the enemy, far or near;\"",
      "links": "<a href='/AIV/19/143/2'>Ps. 143:2</a>; <a href='/AIV/45/3/23'>Rom. 3:23</a>",
      "comment": "Universal sinfulness is affirmed, anticipating the need for redemption and the universality of Christ’s salvific work."
    },
    {
      "pk": 11008047,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 47,
      "text": "\"Yet if they come to themselves in the land to which they were carried captive, and repent, and plead with You in the land of their captors, saying, 'We have sinned and done wrong, we have acted wickedly,'\"",
      "links": "<a href='/AIV/19/51/3'>Ps. 51:3</a>; <a href='/AIV/26/36/31'>Ezek. 36:31</a>",
      "comment": "Repentance in exile sets a pattern for restoration, paralleling themes in the prodigal son parable (Luke 15:17-21)."
    },
    {
      "pk": 11008048,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 48,
      "text": "\"If they turn back to You with all their heart and with all their soul in the land of their enemies who carried them captive, and pray to You toward their land, which You gave to their fathers, the city You have chosen, and the house I have built for Your Name:\"",
      "links": "<a href='/AIV/5/30/2'>Deut. 30:2</a>; <a href='/AIV/19/119/10'>Ps. 119:10</a>",
      "comment": "The repeated emphasis on wholehearted conversion anticipates the new covenant’s call to total devotion."
    },
    {
      "pk": 11008049,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 49,
      "text": "\"Then hear in heaven Your dwelling place their prayer and their plea, and maintain their cause,\"",
      "links": "<a href='/AIV/19/106/44'>Ps. 106:44</a>",
      "comment": "God is portrayed as just and merciful, responsive to the prayers of the penitent."
    },
    {
      "pk": 11008050,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 50,
      "text": "\"And forgive Your people who have sinned against You, and all their transgressions that they have committed against You, and cause their captors to have compassion on them,\"",
      "links": "<a href='/AIV/19/106/46'>Ps. 106:46</a>",
      "comment": "Forgiveness and the softening of hearts are linked—an answer to the people’s prayers and God’s work in history."
    },
    {
      "pk": 11008051,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 51,
      "text": "\"For they are Your people, and Your inheritance, which You brought out of Egypt, out of the midst of the iron furnace.\"",
      "links": "<a href='/AIV/5/4/20'>Deut. 4:20</a>; <a href='/AIV/2/6/6'>Ex. 6:6</a>",
      "comment": "The redemption from Egypt prefigures Christ’s redemption from sin."
    },
    {
      "pk": 11008052,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 52,
      "text": "\"Let Your eyes be open to the plea of Your servant and to the plea of Your people Israel, listening to them whenever they call to You.\"",
      "links": "<a href='/AIV/14/6/40'>2 Chron. 6:40</a>",
      "comment": "God’s attentive listening underscores His intimate relationship with His people."
    },
    {
      "pk": 11008053,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 53,
      "text": "\"For You separated them from all the peoples of the earth to be Your inheritance, as You spoke through Moses Your servant, when You brought our fathers out of Egypt, O Lord GOD.\"",
      "links": "<a href='/AIV/2/19/5-6'>Ex. 19:5-6</a>",
      "comment": "The concept of inheritance highlights election and the special calling, a theme fulfilled and expanded in the new covenant."
    },
    {
      "pk": 11008054,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 54,
      "text": "When Solomon finished praying all this prayer and plea to the LORD, he arose from before the altar of the LORD, where he had knelt with hands spread out toward heaven.",
      "links": "<a href='/AIV/19/28/2'>Ps. 28:2</a>",
      "comment": "Solomon’s kneeling posture sets a precedent for humility and reverence in formal worship, a key posture in many worship traditions."
    },
    {
      "pk": 11008055,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 55,
      "text": "He stood and blessed all the assembly of Israel with a loud voice:",
      "links": "<a href='/AIV/14/6/3'>2 Chron. 6:3</a>",
      "comment": "A vocal blessing by the leader solidifies the communal nature of worship and the mediating role of those set apart for ministry."
    },
    {
      "pk": 11008056,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 56,
      "text": "\"Blessed be the LORD, who has given rest to His people Israel according to all He promised. Not one word has failed of all His good promise, which He spoke through Moses His servant.\"",
      "links": "<a href='/AIV/6/21/45'>Josh. 21:45</a>",
      "comment": "God’s faithfulness is absolute; His word is reliable, mirroring the surety of Christ’s promises."
    },
    {
      "pk": 11008057,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 57,
      "text": "\"May the LORD our God be with us, as He was with our ancestors. May He not leave us or forsake us,\"",
      "links": "<a href='/AIV/6/1/5'>Josh. 1:5</a>; <a href='/AIV/13/28/20'>1 Chron. 28:20</a>",
      "comment": "God’s abiding presence is a comfort throughout history, culminating in Christ’s promise, ‘I am with you always’ (Matt. 28:20)."
    },
    {
      "pk": 11008058,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 58,
      "text": "\"That He may incline our hearts to Himself, to walk in all His ways, and to keep His commandments, His statutes, and His judgments, which He commanded our ancestors.\"",
      "links": "<a href='/AIV/19/119/36'>Ps. 119:36</a>",
      "comment": "Prayer for God to guide hearts acknowledges human dependence on divine grace for faithfulness."
    },
    {
      "pk": 11008059,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 59,
      "text": "\"And may these words of mine, with which I have made supplication before the LORD, be near to the LORD our God day and night, that He may uphold the cause of His servant and of His people Israel, as each day requires,\"",
      "links": "<a href='/AIV/19/141/2'>Ps. 141:2</a>",
      "comment": "Prayer is to be constant—a theme that continues into New Testament teaching (cf. 1 Thess. 5:17)."
    },
    {
      "pk": 11008060,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 60,
      "text": "\"So that all peoples of the earth may know that the LORD is God; there is no other.\"",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>",
      "comment": "The exclusivity of the LORD points toward evangelization—God’s glory to be made known universally."
    },
    {
      "pk": 11008061,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 61,
      "text": "\"Let your heart therefore be wholly devoted to the LORD our God, to walk in His statutes and to keep His commandments as at this day.\"",
      "links": "<a href='/AIV/5/6/5'>Deut. 6:5</a>; <a href='/AIV/19/119/2'>Ps. 119:2</a>",
      "comment": "Wholly devoted hearts anticipate the Christian call to love God entirely."
    },
    {
      "pk": 11008062,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 62,
      "text": "Then the king and all Israel with him offered sacrifices before the LORD.",
      "links": "<a href='/AIV/14/7/4'>2 Chron. 7:4</a>",
      "comment": "Sacrificial offerings in abundance foreshadow the total self-giving later taught by Christ."
    },
    {
      "pk": 11008063,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 63,
      "text": "Solomon offered as a peace offering to the LORD twenty-two thousand oxen and a hundred and twenty thousand sheep. Thus the king and all the children of Israel dedicated the house of the LORD.",
      "links": "<a href='/AIV/3/3/1'>Lev. 3:1</a>; <a href='/AIV/14/7/5'>2 Chron. 7:5</a>",
      "comment": "The magnitude of the offerings signifies both communal participation and a lavish act of worship fit for God’s presence."
    },
    {
      "pk": 11008064,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 64,
      "text": "The same day the king consecrated the middle of the court that was before the house of the LORD; for there he offered the burnt offering, the grain offering, and the fat of the peace offerings, because the bronze altar before the LORD was too small to hold the burnt offering, the grain offering, and the fat of the peace offerings.",
      "links": "<a href='/AIV/3/1/9-13'>Lev. 1:9-13</a>",
      "comment": "The abundance required enlarging the physical space for sacrifice; this highlights the insufficiency of earthly measures for divine worship, reminding us to continually expand our hearts to God."
    },
    {
      "pk": 11008065,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 65,
      "text": "Solomon held the feast at that time, and all Israel with him, a great assembly from the entrance of Hamath to the Brook of Egypt, before the LORD our God, seven days and then seven more days, fourteen days in all.",
      "links": "<a href='/AIV/3/23/34'>Lev. 23:34</a>; <a href='/AIV/14/7/8'>2 Chron. 7:8-9</a>",
      "comment": "The length and scope of the feast reflect the joy and fullness of God’s provision—a type of the eternal celebration promised by God."
    },
    {
      "pk": 11008066,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 8,
      "verse": 66,
      "text": "On the eighth day Solomon sent the people away, and they blessed the king and went to their tents joyful and glad of heart because of all the goodness that the LORD had shown to David His servant and to Israel His people.",
      "links": "<a href='/AIV/14/7/10'>2 Chron. 7:10</a>",
      "comment": "The people’s joy and blessing conclude the account; celebrating after worship demonstrates the real effects of God’s goodness, shaping communal life. Note how the visible unity of worship and leaders prefigures the later apostolic gatherings."
    }
  ],
  "translatedAt": "2025-12-24T03:32:47.616Z"
}