{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 12,
  "verses": [
    {
      "pk": 11012001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 1,
      "text": "Rehoboam went to Shechem, for all Israel had come to Shechem to make him king.",
      "links": "<a href='/AIV/14/10/1'>2 Chron. 10:1</a>; <a href='/AIV/09/8/4-5'>1 Sam. 8:4-5</a>",
      "comment": "Shechem was historically a place of covenant renewal for Israel, signifying the importance of this event. This echoes the earlier congregation of Israel under Joshua (Joshua 24:1), a theme highlighting the continuity and sacred assembly of God's people."
    },
    {
      "pk": 11012002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 2,
      "text": "And when Jeroboam son of Nebat heard of it—he was in Egypt, where he had fled from King Solomon—Jeroboam returned from Egypt.",
      "links": "<a href='/AIV/11/11/40'>1 Kgs. 11:40</a>; <a href='/AIV/14/10/2'>2 Chron. 10:2</a>",
      "comment": "Jeroboam's exile and return fulfill the prophecy of Ahijah (1 Kings 11:29-39), emphasizing divine sovereignty over political developments."
    },
    {
      "pk": 11012003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 3,
      "text": "And they sent for him. Then Jeroboam and all the assembly of Israel came and spoke to Rehoboam, saying:",
      "links": "<a href='/AIV/11/11/31'>1 Kgs. 11:31</a>",
      "comment": "Here the people, led by Jeroboam, act in unity, highlighting the desire for wise and just leadership. This reflects the need for communal discernment, hinting at the ongoing theme of guidance for all God's people."
    },
    {
      "pk": 11012004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 4,
      "text": "\"Your father made our yoke heavy. Now, therefore, lighten the harsh labor and heavy yoke your father imposed on us, and we will serve you.\"",
      "links": "<a href='/AIV/11/4/7-19'>1 Kgs. 4:7-19</a>; <a href='/AIV/14/10/4'>2 Chron. 10:4</a>",
      "comment": "The people plead for mercy and justice—central themes in the biblical view of kingship (cf. Deut. 17:14-20). Mercy is foundational in governance and character, echoing later New Testament calls to charity and kindness."
    },
    {
      "pk": 11012005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 5,
      "text": "He said to them, \"Go away for three days, and then come back to me.\" So the people departed.",
      "links": "<a href='/AIV/14/10/5'>2 Chron. 10:5</a>",
      "comment": "Rehoboam seeks time to consider, a mark of prudence. Consulting advisors is seen as wise, but discernment of the right counsel is crucial, paralleling New Testament admonitions toward spiritual guidance (James 1:5)."
    },
    {
      "pk": 11012006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 6,
      "text": "Then King Rehoboam consulted with the elders who had served his father Solomon during his lifetime, asking, \"How do you advise me to answer these people?\"",
      "links": "<a href='/AIV/11/3/16-28'>1 Kgs. 3:16-28</a>; <a href='/AIV/14/10/6'>2 Chron. 10:6</a>",
      "comment": "Seeking advice from elders recognizes wisdom present in the tradition. There is a subtle suggestion for continuity between generations, resembling New Testament images of apostolic transmission (2 Tim. 2:2)."
    },
    {
      "pk": 11012007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 7,
      "text": "They answered him, \"If you will be a servant to these people today and serve them, and speak good words to them, they will be your servants forever.\"",
      "links": "<a href='/AIV/19/78/71-72'>Ps. 78:71-72</a>; <a href='/AIV/40/20/26-28'>Matt. 20:26-28</a>",
      "comment": "The elders’ advice foreshadows Christ’s teaching that greatness comes through humble service (cf. Mark 10:43-45). Leadership rooted in serving others is a core biblical ethic."
    },
    {
      "pk": 11012008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 8,
      "text": "But he abandoned the counsel of the elders which they had given him, and consulted with the young men who had grown up with him and were now serving him.",
      "links": "<a href='/AIV/11/11/9-13'>1 Kgs. 11:9-13</a>; <a href='/AIV/19/1/1'>Ps. 1:1</a>",
      "comment": "Rejecting the tradition of wisdom, Rehoboam turns toward peer influence, exemplifying the dangers of forsaking established guidance. This contrasts community wisdom with individualistic choices."
    },
    {
      "pk": 11012009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 9,
      "text": "He said to them, \"What do you advise, that we should answer these people who have said to me, 'Lighten the yoke your father put on us'?\"",
      "links": "<a href='/AIV/14/10/9'>2 Chron. 10:9</a>",
      "comment": "Rehoboam seeks affirmation from those with less experience, a warning about the importance of seeking mature, tested counsel. This pattern appears frequently in scripture as a cautionary tale."
    },
    {
      "pk": 11012010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 10,
      "text": "And the young men who had grown up with him answered, \"Say this to the people who said to you, 'Your father made our yoke heavy, but you lighten it for us'—say to them, 'My little finger is thicker than my father's waist.'\"",
      "links": "<a href='/AIV/20/29/1'>Prov. 29:1</a>; <a href='/AIV/14/10/10'>2 Chron. 10:10</a>",
      "comment": "Their advice is boastful and harsh, lacking mercy. Comparison to his father invokes pride, which is repeatedly criticized in scripture (Prov. 16:18)."
    },
    {
      "pk": 11012011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 11,
      "text": "\"Now, my father laid on you a heavy yoke, but I will make it even heavier. My father chastised you with whips, but I will chastise you with scorpions.\"",
      "links": "<a href='/AIV/02/1/13-14'>Ex. 1:13-14</a>; <a href='/AIV/14/10/11'>2 Chron. 10:11</a>",
      "comment": "The language intensifies, recalling Egypt’s harsh treatment of Israel (Ex. 1:13-14). Such threats show failure in servant-leadership and feed division, foreshadowing later schisms."
    },
    {
      "pk": 11012012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 12,
      "text": "So Jeroboam and all the people came to Rehoboam on the third day, just as the king had directed, saying, \"Return to me on the third day.\"",
      "links": "<a href='/AIV/40/12/40'>Matt. 12:40</a>; <a href='/AIV/14/10/12'>2 Chron. 10:12</a>",
      "comment": "The mention of the third day echoes biblical themes of waiting and fulfillment (cf. Hosea 6:2), subtly anticipating restoration and resurrection motifs seen in Christ."
    },
    {
      "pk": 11012013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 13,
      "text": "The king answered the people harshly, forsaking the advice the elders had given him.",
      "links": "<a href='/AIV/20/15/1'>Prov. 15:1</a>; <a href='/AIV/14/10/13'>2 Chron. 10:13</a>",
      "comment": "Rehoboam’s harsh answer brings division, highlighting the biblical principle that soft answers turn away wrath (Prov. 15:1). The consequences of rejecting true wisdom echo throughout scripture."
    },
    {
      "pk": 11012014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 14,
      "text": "He spoke to them as the young men had advised, saying, \"My father made your yoke heavy, but I will make it even heavier. My father disciplined you with whips, but I will discipline you with scorpions.\"",
      "links": "<a href='/AIV/14/10/14'>2 Chron. 10:14</a>",
      "comment": "Repeating this unmerciful message confirms his choice for division over unity—a spiritual lesson about obedience to God’s wisdom and the consequences of prideful leadership."
    },
    {
      "pk": 11012015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 15,
      "text": "So the king did not listen to the people, for this turn of events was from the LORD, to confirm what He had spoken by Ahijah the Shilonite to Jeroboam son of Nebat.",
      "links": "<a href='/AIV/11/11/29-31'>1 Kgs. 11:29-31</a>; <a href='/AIV/14/10/15'>2 Chron. 10:15</a>",
      "comment": "This fulfills prophecy, attesting to God's ultimate sovereignty, even through human failure. The interplay of divine providence and free will is a major theological motif."
    },
    {
      "pk": 11012016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 16,
      "text": "When all Israel saw that the king refused to listen to them, the people answered the king: \"What share do we have in David? We have no inheritance in the son of Jesse. To your tents, O Israel! Look after your own house, David!\" So Israel departed to their tents.",
      "links": "<a href='/AIV/10/20/1'>2 Sam. 20:1</a>; <a href='/AIV/14/10/16'>2 Chron. 10:16</a>",
      "comment": "The rejection of Davidic leadership echoes earlier divisions (2 Sam. 20:1), and prefigures later questions of legitimate authority and unity among God's people."
    },
    {
      "pk": 11012017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 17,
      "text": "But as for the Israelites living in the cities of Judah, Rehoboam still reigned over them.",
      "links": "<a href='/AIV/14/10/17'>2 Chron. 10:17</a>",
      "comment": "A remnant remains under the Davidic king, keeping the messianic line alive, which is vital for understanding the promise fulfilled in Christ (Matt. 1:1)."
    },
    {
      "pk": 11012018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 18,
      "text": "Then King Rehoboam sent Adoram, who was in charge of forced labor, but all Israel stoned him to death. And King Rehoboam quickly mounted his chariot and fled to Jerusalem.",
      "links": "<a href='/AIV/11/4/6'>1 Kgs. 4:6</a>; <a href='/AIV/14/10/18'>2 Chron. 10:18</a>",
      "comment": "The rejection of harsh policies is immediate and dramatic. The theme of leader fleeing recalls the consequences of oppressive rulers (cf. Ex. 2:15, Moses fleeing Pharaoh)."
    },
    {
      "pk": 11012019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 19,
      "text": "So Israel has been in rebellion against the house of David to this day.",
      "links": "<a href='/AIV/14/10/19'>2 Chron. 10:19</a>",
      "comment": "This is a pivotal turning point, marking the division that shapes biblical history and sets the stage for later restoration prophecies (cf. Ezek. 37:21-22)."
    },
    {
      "pk": 11012020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 20,
      "text": "When all Israel heard that Jeroboam had returned, they summoned him to the assembly and made him king over all Israel. Only the tribe of Judah followed the house of David.",
      "links": "<a href='/AIV/14/10/20'>2 Chron. 10:20</a>; <a href='/AIV/11/11/13'>1 Kgs. 11:13</a>",
      "comment": "The schism becomes formal. Only Judah remains with David’s line, preserving the promise of a true king, which finds ultimate fulfillment in Christ, descendant of David."
    },
    {
      "pk": 11012021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 21,
      "text": "When Rehoboam arrived in Jerusalem, he assembled all the house of Judah and the tribe of Benjamin—one hundred eighty thousand chosen warriors—to fight against the house of Israel and restore the kingdom to Rehoboam son of Solomon.",
      "links": "<a href='/AIV/14/11/1'>2 Chron. 11:1</a>",
      "comment": "Plans for civil war begin; the division among God’s people necessitates divine intervention. The gathering echoes the mustering for battle in earlier stories."
    },
    {
      "pk": 11012022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 22,
      "text": "But the word of God came to Shemaiah the man of God:",
      "links": "<a href='/AIV/14/11/2'>2 Chron. 11:2</a>; <a href='/AIV/11/13/1'>1 Kgs. 13:1</a>",
      "comment": "Shemaiah’s prophetic intervention shows God’s word protects unity and peace over violence, a theme continued into the teaching of Christ."
    },
    {
      "pk": 11012023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 23,
      "text": "\"Tell Rehoboam son of Solomon king of Judah, and all the house of Judah and Benjamin, and the rest of the people,",
      "links": "<a href='/AIV/14/11/3'>2 Chron. 11:3</a>",
      "comment": "God addresses all factions, signifying His concern for the entire community of believers."
    },
    {
      "pk": 11012024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 24,
      "text": "‘Thus says the LORD: You shall not go up and fight your brothers, the people of Israel. Each man return to his home, for this thing is from Me.’ So they listened to the word of the LORD and went home, just as the LORD had said.",
      "links": "<a href='/AIV/11/11/11'>1 Kgs. 11:11</a>; <a href='/AIV/14/11/4'>2 Chron. 11:4</a>",
      "comment": "God commands peace, emphasizing reconciliation over division. The need for unity is a foundational truth, later fulfilled and deepened in Christ’s prayer for oneness (John 17:21)."
    },
    {
      "pk": 11012025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 25,
      "text": "Then Jeroboam built Shechem in the hill country of Ephraim and lived there. And he went out and built Penuel.",
      "links": "<a href='/AIV/01/32/30'>Gen. 32:30</a>",
      "comment": "Jeroboam establishes his reign by physically building cities, a mark of earthly authority. The mention of Penuel recalls Jacob’s encounter with God—a subtle reminder that true authority rests in faithfulness to God."
    },
    {
      "pk": 11012026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 26,
      "text": "Then Jeroboam said in his heart, \"Now the kingdom will turn back to the house of David;",
      "links": "<a href='/AIV/11/11/38'>1 Kgs. 11:38</a>",
      "comment": "Jeroboam's motivation shows fear for loss of power. The internal deliberation is a recurring Old Testament motif, suggesting vulnerability to temptation and lack of trust in God’s promise."
    },
    {
      "pk": 11012027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 27,
      "text": "If this people go up to offer sacrifices in the house of the LORD in Jerusalem, then the heart of this people will turn to their lord, to Rehoboam king of Judah, and they will kill me and return to Rehoboam king of Judah.\"",
      "links": "<a href='/AIV/05/12/5'>Deut. 12:5-6</a>; <a href='/AIV/42/2/41'>Luke 2:41</a>",
      "comment": "The importance of centralized worship is clear. Jeroboam’s fear leads to spiritual compromise, highlighting the danger of valuing political expediency over religious fidelity—a theme relevant to integrity in worship."
    },
    {
      "pk": 11012028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 28,
      "text": "So the king took counsel, and made two golden calves. He said to the people, \"You have gone up to Jerusalem long enough. Here are your gods, O Israel, who brought you up out of the land of Egypt.\"",
      "links": "<a href='/AIV/02/32/4'>Ex. 32:4</a>; <a href='/AIV/19/106/19-20'>Ps. 106:19-20</a>",
      "comment": "Jeroboam’s creation of golden calves directly invokes the sin at Sinai (Ex. 32). This act of idolatry marks the beginning of spiritual downfall, teaching about the danger of deviating from true worship."
    },
    {
      "pk": 11012029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 29,
      "text": "And he set one in Bethel, and the other he put in Dan.",
      "links": "<a href='/AIV/07/18/30'>Judg. 18:30-31</a>",
      "comment": "These locations were sacred and accessible, but the move substitutes the true center of worship, warning against innovations not rooted in God's revealed will—a lesson for how the community preserves faith."
    },
    {
      "pk": 11012030,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 30,
      "text": "Now this thing became a sin, for the people went as far as Dan to worship one of the calves.",
      "links": "<a href='/AIV/19/106/19-20'>Ps. 106:19-20</a>",
      "comment": "This sin leads Israel astray for generations. The need for true worship—remaining in continuity with God's revelation—is underlined. Spiritual fidelity is paramount."
    },
    {
      "pk": 11012031,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 31,
      "text": "He also made shrines on high places and appointed priests from among all the people, who were not from the sons of Levi.",
      "links": "<a href='/AIV/04/3/5-10'>Num. 3:5-10</a>; <a href='/AIV/11/13/33'>1 Kgs. 13:33-34</a>",
      "comment": "Unauthorized priesthood and worship are highlighted as serious errors. This has significance for the right transmission of authority and worship, showing the value of divinely appointed leaders."
    },
    {
      "pk": 11012032,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 32,
      "text": "Jeroboam instituted a feast on the fifteenth day of the eighth month, like the feast held in Judah, and he offered sacrifices on the altar. So he did at Bethel, sacrificing to the calves he had made. And at Bethel he installed priests for the high places he had made.",
      "links": "<a href='/AIV/03/23/34'>Lev. 23:34'>; <a href='/AIV/11/13/1'>1 Kgs. 13:1</a>",
      "comment": "Jeroboam’s imitation of legitimate worship constitutes rebellion against God’s commands. The attempt to parallel true worship with false practices is a warning about authenticity and faithfulness in liturgy."
    },
    {
      "pk": 11012033,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 12,
      "verse": 33,
      "text": "He went up to the altar that he had made at Bethel on the fifteenth day in the eighth month, a month of his own choosing. He offered sacrifices on the altar, and instituted a feast for the people of Israel. He appointed priests for the high places he had made.",
      "links": "<a href='/AIV/11/13/1'>1 Kgs. 13:1</a>; <a href='/AIV/03/23/34'>Lev. 23:34</a>",
      "comment": "By creating his own religious observance, Jeroboam exemplifies dangerous independence from divinely ordained tradition. The importance of rightly ordered worship is shown by the consequences that follow, emphasizing steadfastness to true doctrine and practices handed down through time."
    }
  ],
  "translatedAt": "2025-12-24T03:35:27.318Z"
}