{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 1,
  "verses": [
    {
      "pk": 11001001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 1,
      "text": "King David was old and advanced in years; even when they covered him with blankets, he could not keep warm.",
      "links": "<a href='/AIV/10/21/17'>2 Sam. 21:17</a>; <a href='/AIV/13/23/1'>1 Chr. 23:1</a>",
      "comment": "David's old age marks a transition of leadership. His physical weakness symbolizes the impending need for new leadership in Israel."
    },
    {
      "pk": 11001002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 2,
      "text": "So his servants said to him, 'Let a young virgin be sought for my lord the king, and let her attend the king and care for him. Let her lie in your arms, that my lord the king may be warm.'",
      "links": "<a href='/AIV/17/2/2'>Esth. 2:2</a>",
      "comment": "A practical solution is proposed to comfort David. The use of a young woman here is culturally specific, meant for warmth and service, not marital relations."
    },
    {
      "pk": 11001003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 3,
      "text": "So they sought for a beautiful young woman throughout all the territory of Israel, and found Abishag the Shunammite, and brought her to the king.",
      "links": "<a href='/AIV/11/2/17-22'>1 Kgs. 2:17-22</a>",
      "comment": "Abishag, from Shunem, is introduced. Her presence will later play a role in Solomon’s consolidation of the throne."
    },
    {
      "pk": 11001004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 4,
      "text": "The young woman was very beautiful, and she nursed the king and attended to him, but the king did not have relations with her.",
      "links": "<a href='/AIV/11/2/13-25'>1 Kgs. 2:13-25</a>",
      "comment": "The text clarifies there was no sexual relationship, emphasizing her role as helper, not wife or concubine. This preserves David’s dignity and the sanctity of the succession."
    },
    {
      "pk": 11001005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 5,
      "text": "Now Adonijah the son of Haggith exalted himself, saying, 'I will be king.' He prepared chariots and horsemen, and fifty men to run before him.",
      "links": "<a href='/AIV/10/15/1'>2 Sam. 15:1</a>",
      "comment": "Adonijah repeats Absalom’s ambitions (cf. 2 Sam. 15:1). Self-exaltation, apart from God’s chosen order, always brings division."
    },
    {
      "pk": 11001006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 6,
      "text": "His father had never at any time rebuked him by saying, 'Why have you done thus and so?' He was also a very handsome man, and he was born next after Absalom.",
      "links": "<a href='/AIV/10/3/3'>2 Sam. 3:3</a>",
      "comment": "David’s failure as a disciplinarian contributes to family strife. The emphasis on Adonijah's appearance echoes the theme of outward appearance versus inward character (see 1 Sam. 16:7)."
    },
    {
      "pk": 11001007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 7,
      "text": "And he conferred with Joab the son of Zeruiah and with Abiathar the priest, and they supported Adonijah.",
      "links": "<a href='/AIV/11/2/26-35'>1 Kgs. 2:26-35</a>; <a href='/AIV/10/8/16'>2 Sam. 8:16</a>",
      "comment": "Key leaders join Adonijah, revealing the political dimensions of the succession crisis. They seek legitimacy through religious and military alliances."
    },
    {
      "pk": 11001008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 8,
      "text": "But Zadok the priest, Benaiah the son of Jehoiada, Nathan the prophet, Shimei, Rei, and David’s mighty men were not with Adonijah.",
      "links": "<a href='/AIV/11/2/35'>1 Kgs. 2:35</a>; <a href='/AIV/13/29/22'>1 Chr. 29:22</a>",
      "comment": "A split among the leadership emerges. Key figures oppose Adonijah, highlighting the legitimacy of God's chosen line through the prophet and priest."
    },
    {
      "pk": 11001009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 9,
      "text": "Adonijah sacrificed sheep, oxen, and fattened cattle by the stone of Zoheleth, which is beside En-rogel, and he invited all his brothers, the king’s sons, and all the men of Judah, the king’s servants.",
      "links": "<a href='/AIV/10/15/7-10'>2 Sam. 15:7-10</a>",
      "comment": "An attempt at a royal feast and sacrifice. Saul’s and Absalom’s similar deeds show the danger of using religious rituals to legitimize rebellion."
    },
    {
      "pk": 11001010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 10,
      "text": "But he did not invite Nathan the prophet, Benaiah, the mighty men, or Solomon his brother.",
      "links": "<a href='/AIV/11/1/8'>1 Kgs. 1:8</a>",
      "comment": "Excluding the prophet, the true priest, the warriors, and Solomon demonstrates Adonijah's awareness they would not endorse his self-made kingship."
    },
    {
      "pk": 11001011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 11,
      "text": "Then Nathan said to Bathsheba, the mother of Solomon, 'Have you not heard that Adonijah the son of Haggith has become king and David our lord does not know it?'",
      "links": "<a href='/AIV/10/12/24'>2 Sam. 12:24</a>",
      "comment": "Nathan’s intervention is God’s providence in action. The prophetic voice works to preserve the just order for God’s people, through human cooperation."
    },
    {
      "pk": 11001012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 12,
      "text": "Now therefore come, let me give you counsel, that you may save your own life and the life of your son Solomon.",
      "links": "<a href='/AIV/11/2/13-25'>1 Kgs. 2:13-25</a>",
      "comment": "The stakes are high; royal intrigue can result in deadly outcomes for rivals. Prophetic wisdom also protects the innocent."
    },
    {
      "pk": 11001013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 13,
      "text": "Go in to King David and say to him, ‘Did you not, my lord the king, swear to your servant, saying: “Solomon your son shall reign after me, and he shall sit on my throne”? Why then is Adonijah king?’",
      "links": "<a href='/AIV/10/12/25'>2 Sam. 12:25</a>",
      "comment": "The reference to David’s oath suggests divine guidance for succession. David’s word, given as king, reflects God’s promise and plan."
    },
    {
      "pk": 11001014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 14,
      "text": "Then, while you are still speaking with the king, I also will come in after you and confirm your words.'",
      "links": "<a href='/AIV/5/19/15'>Deut. 19:15</a>",
      "comment": "Nathan wisely appeals to the biblical principle of confirming truth with two witnesses. The use of process reflects both law and order."
    },
    {
      "pk": 11001015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 15,
      "text": "So Bathsheba went in to the king into his chamber. The king was very old, and Abishag the Shunammite was attending to the king.",
      "links": "<a href='/AIV/11/1/3-4'>1 Kgs. 1:3-4</a>",
      "comment": "The detail of Abishag’s service and the king’s isolation highlight David’s vulnerability and the urgency for legitimate succession."
    },
    {
      "pk": 11001016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 16,
      "text": "And Bathsheba bowed and paid homage to the king. And the king said, 'What do you wish?'",
      "links": "<a href='/AIV/11/2/19'>1 Kgs. 2:19</a>",
      "comment": "Her posture of homage reflects right order and respect for the Davidic kingship, a foreshadowing of true reverence due to Christ the King."
    },
    {
      "pk": 11001017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 17,
      "text": "She said to him, 'My lord, you swore to your servant by the LORD your God, saying, “Solomon your son shall reign after me, and he shall sit on my throne.”'",
      "links": "<a href='/AIV/11/1/13'>1 Kgs. 1:13</a>",
      "comment": "She appeals to David’s oath before God, showing the seriousness of the pledge and the importance of faithfulness to public oaths."
    },
    {
      "pk": 11001018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 18,
      "text": "And now, see, Adonijah is king, although you, my lord the king, do not know it.",
      "links": "<a href='/AIV/10/3/4-5'>2 Sam. 3:4-5</a>",
      "comment": "Bathsheba tactfully points out the usurpation taking place, involving David in the keeping of God's covenanted order."
    },
    {
      "pk": 11001019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 19,
      "text": "He has sacrificed oxen, fattened cattle, and sheep in abundance, and has invited all the sons of the king, Abiathar the priest, and Joab the commander of the army, but Solomon your servant he has not invited.",
      "links": "<a href='/AIV/11/1/9-10'>1 Kgs. 1:9-10</a>",
      "comment": "This selective invitation reveals Adonijah’s political motives and highlights Solomon as the true, threatened heir."
    },
    {
      "pk": 11001020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 20,
      "text": "And you, my lord the king, all Israel’s eyes are on you, to tell them who shall sit on the throne of my lord the king after him.",
      "links": "<a href='/AIV/13/28/5'>1 Chr. 28:5</a>",
      "comment": "The monarchy's succession depends on David’s decisive word. This demonstrates the foundational importance of clear leadership and guidance in the community of faith."
    },
    {
      "pk": 11001021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 21,
      "text": "Otherwise it will come to pass, my lord the king, when he sleeps with his fathers, that I and my son Solomon will be counted as offenders.",
      "links": "<a href='/AIV/11/2/22-25'>1 Kgs. 2:22-25</a>",
      "comment": "Failure to declare the rightful heir jeopardizes Bathsheba and Solomon, revealing the consequences of unresolved leadership in God’s people."
    },
    {
      "pk": 11001022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 22,
      "text": "While she was still speaking with the king, Nathan the prophet came in.",
      "links": "<a href='/AIV/11/1/14'>1 Kgs. 1:14</a>",
      "comment": "Nathan enters, ensuring the importance and validity of the message through the testimony of two witnesses (cf. Deut. 19:15)."
    },
    {
      "pk": 11001023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 23,
      "text": "And they told the king, 'Here is Nathan the prophet.' And when he came in before the king, he bowed before the king with his face to the ground.",
      "links": "<a href='/AIV/11/1/16'>1 Kgs. 1:16</a>",
      "comment": "Nathan honors David as king, upholding the proper order between king and prophet as both serve God’s will."
    },
    {
      "pk": 11001024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 24,
      "text": "And Nathan said, 'My lord the king, have you said, “Adonijah shall reign after me, and he shall sit on my throne”?'",
      "links": "<a href='/AIV/11/1/13'>1 Kgs. 1:13</a>",
      "comment": "Nathan presents the situation in the form of a question, stressing the need for the king’s public affirmation of God’s chosen successor."
    },
    {
      "pk": 11001025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 25,
      "text": "For he has gone down this day and sacrificed oxen, fattened cattle, and sheep in abundance, and has invited all the king’s sons, the commanders of the army, and Abiathar the priest; and behold, they are eating and drinking before him, and saying, “Long live King Adonijah!”",
      "links": "<a href='/AIV/10/16/16'>2 Sam. 16:16</a>",
      "comment": "The celebration imitates legitimate anointings, but the lack of God’s order exposes its false nature."
    },
    {
      "pk": 11001026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 26,
      "text": "But he has not invited me, your servant, nor Zadok the priest, nor Benaiah the son of Jehoiada, nor your servant Solomon.",
      "links": "<a href='/AIV/11/1/10'>1 Kgs. 1:10</a>",
      "comment": "Nathan emphasizes the exclusion of legitimate spiritual and military leaders from Adonijah's circle."
    },
    {
      "pk": 11001027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 27,
      "text": "Has this thing been brought about by my lord the king and you have not told your servants who should sit on the throne of my lord the king after him?'",
      "links": "<a href='/AIV/13/28/5-6'>1 Chr. 28:5-6</a>",
      "comment": "Nathan humbly asks for clarity, respecting the king’s authority while highlighting the importance of transparency and public affirmation for succession."
    },
    {
      "pk": 11001028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 28,
      "text": "Then King David answered, 'Call Bathsheba to me.' So she came into the king’s presence and stood before the king.",
      "links": "<a href='/AIV/11/1/15-16'>1 Kgs. 1:15-16</a>",
      "comment": "David reengages Bathsheba, demonstrating her importance in God’s providential plan for the royal lineage."
    },
    {
      "pk": 11001029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 29,
      "text": "And the king swore and said, 'As the LORD lives, who has redeemed my soul out of every distress,",
      "links": "<a href='/AIV/10/4/9'>2 Sam. 4:9</a>",
      "comment": "David’s oath recalls God’s faithfulness and redemption, affirming the sacredness of his words."
    },
    {
      "pk": 11001030,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 30,
      "text": "just as I swore to you by the LORD, the God of Israel, saying, “Solomon your son shall reign after me, and he shall sit on my throne in my place,” even so I will do this day.'",
      "links": "<a href='/AIV/11/1/13'>1 Kgs. 1:13</a>",
      "comment": "David recalls and fulfills his previous vow, showing the importance of kingly faithfulness to divine promises."
    },
    {
      "pk": 11001031,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 31,
      "text": "Then Bathsheba bowed with her face to the ground, and paid homage to the king, saying, 'May my lord King David live forever!'",
      "links": "<a href='/AIV/11/1/16'>1 Kgs. 1:16</a>",
      "comment": "Her act of homage underscores reverence for God’s anointed, mirroring the respect shown to Christ, the true and eternal King."
    },
    {
      "pk": 11001032,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 32,
      "text": "And King David said, 'Call to me Zadok the priest, Nathan the prophet, and Benaiah the son of Jehoiada.' So they came before the king.",
      "links": "<a href='/AIV/11/1/8'>1 Kgs. 1:8</a>",
      "comment": "David calls the faithful to execute his appointment, joining king, priest, and prophet, echoing roles fulfilled perfectly in Jesus (see Heb. 1:1-3)."
    },
    {
      "pk": 11001033,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 33,
      "text": "And the king said to them, 'Take with you the servants of your lord, and have Solomon my son ride on my own mule, and bring him down to Gihon.'",
      "links": "<a href='/AIV/38/9/9'>Zech. 9:9</a>; <a href='/AIV/40/21/5'>Matt. 21:5</a>",
      "comment": "Riding on the king’s mule signified royal approval. This action foreshadows Christ’s entry into Jerusalem on a donkey as the true King."
    },
    {
      "pk": 11001034,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 34,
      "text": "Let Zadok the priest and Nathan the prophet anoint him there king over Israel. Then blow the trumpet and say, \"Long live King Solomon!\"",
      "links": "<a href='/AIV/9/16/13'>1 Sam. 16:13</a>; <a href='/AIV/11/1/25'>1 Kgs. 1:25</a>",
      "comment": "Anointing by priest and prophet confers divine legitimacy, showing how God establishes leaders through proper rite and authority."
    },
    {
      "pk": 11001035,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 35,
      "text": "Then you shall come up after him, and he shall come and sit on my throne. For he shall be king in my place, and I have appointed him to be ruler over Israel and Judah.'",
      "links": "<a href='/AIV/13/28/5'>1 Chr. 28:5</a>",
      "comment": "Solomon is both chosen and officially installed, affirming the need for continuity and unity in leadership."
    },
    {
      "pk": 11001036,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 36,
      "text": "And Benaiah the son of Jehoiada answered the king, 'Amen! May the LORD, the God of my lord the king, say so as well.'",
      "links": "<a href='/AIV/11/1/37'>1 Kgs. 1:37</a>",
      "comment": "Benaiah affirms the king’s word with an 'Amen,' expressing agreement and invoking God’s will over human plans."
    },
    {
      "pk": 11001037,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 37,
      "text": "As the LORD has been with my lord the king, so may he be with Solomon, and make his throne even greater than the throne of my lord King David.'",
      "links": "<a href='/AIV/10/7/16'>2 Sam. 7:16</a>",
      "comment": "There is hope for the increase of Solomon’s kingdom—a foreshadowing of the coming of a greater King whose rule endures forever."
    },
    {
      "pk": 11001038,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 38,
      "text": "So Zadok the priest, Nathan the prophet, Benaiah the son of Jehoiada, the Cherethites, and the Pelethites went down, and set Solomon on King David’s mule, and brought him to Gihon.",
      "links": "<a href='/AIV/11/1/33'>1 Kgs. 1:33</a>",
      "comment": "Solomon’s enthronement is public and accompanied by all levels of leadership—prophet, priest, military—modeling order and unity."
    },
    {
      "pk": 11001039,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 39,
      "text": "And Zadok the priest took the horn of oil from the tent and anointed Solomon. Then they blew the trumpet, and all the people said, 'Long live King Solomon!'",
      "links": "<a href='/AIV/9/10/1'>1 Sam. 10:1</a>; <a href='/AIV/9/16/13'>1 Sam. 16:13</a>",
      "comment": "Anointing is an act of consecration, linking Solomon to the Davidic promise and prefiguring the Messiah, the Anointed One."
    },
    {
      "pk": 11001040,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 40,
      "text": "And all the people went up after him, playing on pipes and rejoicing with great joy, so that the earth shook with their noise.",
      "links": "<a href='/AIV/11/1/25'>1 Kgs. 1:25</a>",
      "comment": "Public celebration of the true king’s anointing indicates widespread acceptance—joy accompanies legitimate divine action."
    },
    {
      "pk": 11001041,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 41,
      "text": "Adonijah and all the guests who were with him heard it as they were finishing their feast. And when Joab heard the sound of the trumpet, he said, 'Why is the city in such an uproar?'",
      "links": "<a href='/AIV/10/18/14'>2 Sam. 18:14</a>",
      "comment": "The contrast between Adonijah’s secretive feast and Solomon’s public coronation exposes the difference between false and true kingship."
    },
    {
      "pk": 11001042,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 42,
      "text": "While he was still speaking, behold, Jonathan the son of Abiathar the priest came. And Adonijah said, 'Come in, for you are a worthy man and bring good news.'",
      "links": "<a href='/AIV/10/15/27-36'>2 Sam. 15:27-36</a>",
      "comment": "Expectation for ‘good news’ shows how partisans hoped for success before the new reality of Solomon’s kingship."
    },
    {
      "pk": 11001043,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 43,
      "text": "But Jonathan answered Adonijah, 'No, for our lord King David has made Solomon king.",
      "links": "<a href='/AIV/11/1/34'>1 Kgs. 1:34</a>",
      "comment": "The announcement of David’s action leaves no doubt as to the true king, ending Adonijah’s coup attempt."
    },
    {
      "pk": 11001044,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 44,
      "text": "And the king has sent with him Zadok the priest, Nathan the prophet, Benaiah the son of Jehoiada, the Cherethites, and the Pelethites, and they have made him ride on the king’s mule.",
      "links": "<a href='/AIV/11/1/33'>1 Kgs. 1:33</a>",
      "comment": "Official kingly support, spiritual and military, ends the crisis of succession."
    },
    {
      "pk": 11001045,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 45,
      "text": "And Zadok the priest and Nathan the prophet have anointed him king at Gihon, and they have gone up from there rejoicing, so that the city rang with this noise. This is the noise that you have heard.",
      "links": "<a href='/AIV/11/1/39'>1 Kgs. 1:39</a>",
      "comment": "The dramatic public acceptance of Solomon’s reign affirms the importance of visible, proper acts in installing leadership."
    },
    {
      "pk": 11001046,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 46,
      "text": "Solomon now sits on the royal throne.",
      "links": "<a href='/AIV/11/1/35'>1 Kgs. 1:35</a>",
      "comment": "Solomon’s enthronement completes his legitimate transition—order and continuity are restored."
    },
    {
      "pk": 11001047,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 47,
      "text": "And moreover, the king’s servants came to bless our lord King David, saying, 'May your God make the name of Solomon more famous than yours, and make his throne greater than your throne.' And the king bowed himself on the bed.",
      "links": "<a href='/AIV/11/1/37'>1 Kgs. 1:37</a>",
      "comment": "David’s blessing and submission highlight the humility required for the transmission of true authority. This hints at the gracious abdication of power for God’s greater plan."
    },
    {
      "pk": 11001048,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 48,
      "text": "And the king also said, 'Blessed be the LORD, the God of Israel, who has granted someone to sit on my throne this day, so that my own eyes have seen it.'",
      "links": "<a href='/AIV/13/29/20'>1 Chr. 29:20-23</a>",
      "comment": "David openly acknowledges God’s hand in establishing succession and fulfills his role as shepherd of Israel."
    },
    {
      "pk": 11001049,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 49,
      "text": "Then all the guests of Adonijah trembled and rose, and each went his own way.",
      "links": "<a href='/AIV/10/15/23-37'>2 Sam. 15:23-37</a>",
      "comment": "Fear and flight follow the collapse of illegitimate leadership—a recurring theme when human ambition opposes God's order."
    },
    {
      "pk": 11001050,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 50,
      "text": "And Adonijah feared Solomon. So he arose and went to grasp the horns of the altar.",
      "links": "<a href='/AIV/2/21/13-14'>Exod. 21:13-14</a>; <a href='/AIV/11/2/28'>1 Kgs. 2:28</a>",
      "comment": "Seeking refuge at the altar signifies hope for mercy—anticipating themes of intercession and mediation central to Israel’s worship life."
    },
    {
      "pk": 11001051,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 51,
      "text": "It was told Solomon, 'Behold, Adonijah fears King Solomon, for he has laid hold of the horns of the altar, saying, “Let King Solomon swear to me first that he will not put his servant to death with the sword.”'",
      "links": "<a href='/AIV/11/2/24-25'>1 Kgs. 2:24-25</a>",
      "comment": "Adonijah pleads for pardon, appealing to the sanctuary’s protection, demonstrating the intertwining of mercy and justice in Israelite practice."
    },
    {
      "pk": 11001052,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 52,
      "text": "And Solomon said, 'If he shows himself a worthy man, not one of his hairs shall fall to the earth; but if wickedness is found in him, he shall die.'",
      "links": "<a href='/AIV/10/14/14'>2 Sam. 14:14</a>",
      "comment": "Solomon’s judgment is measured and just, offering mercy conditioned on repentance—a subtle anticipation of New Testament teaching on forgiveness."
    },
    {
      "pk": 11001053,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 1,
      "verse": 53,
      "text": "So King Solomon sent, and they brought him down from the altar. He came and bowed down to King Solomon, and Solomon said to him, 'Go to your house.'",
      "links": "<a href='/AIV/11/2/25'>1 Kgs. 2:25</a>",
      "comment": "Solomon’s first act as king is merciful. Adonijah’s submission to the true king is a model for peace between subjects and God-appointed leadership."
    }
  ],
  "translatedAt": "2025-12-24T03:27:35.389Z"
}