{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 22,
  "verses": [
    {
      "pk": 11022001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 1,
      "text": "For three years there was no war between Aram and Israel.",
      "links": "<a href='/AIV/12/6/24'>2 Kgs 6:24</a>",
      "comment": "This verse marks a temporary peace. The number three often has symbolic importance in Scripture, hinting at fullness or completion (cf. <a href='/AIV/40/12/40'>Matt 12:40</a>)."
    },
    {
      "pk": 11022002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 2,
      "text": "In the third year, Jehoshaphat the king of Judah went down to the king of Israel.",
      "links": "<a href='/AIV/14/18/2'>2 Chr 18:2</a>",
      "comment": "Jehoshaphat's alliance with the king of Israel sets up the coming events. The unity of the two kingdoms, even if briefly, foreshadows the gathering of God's people (cf. <a href='/AIV/43/17/21'>John 17:21</a>)."
    },
    {
      "pk": 11022003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 3,
      "text": "The king of Israel said to his servants, \"Do you know that Ramoth-gilead belongs to us, and we hesitate to take it out of the hand of the king of Aram?\"",
      "links": "<a href='/AIV/06/21/38'>Josh 21:38</a>; <a href='/AIV/09/10/32'>1 Sam 10:32</a>",
      "comment": "Ramoth-gilead was a city of refuge and levitical city. There's an undercurrent of not claiming rightful inheritance, echoing themes of promised land and God's faithfulness."
    },
    {
      "pk": 11022004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 4,
      "text": "He said to Jehoshaphat, \"Will you go with me to fight against Ramoth-gilead?\" Jehoshaphat answered the king of Israel, \"I am as you are, my people as your people, my horses as your horses.\"",
      "links": "<a href='/AIV/07/20/11'>Judg 20:11</a>; <a href='/AIV/14/18/3'>2 Chr 18:3</a>",
      "comment": "The unity Jehoshaphat expresses points to the ideal oneness of God’s people (cf. <a href='/AIV/19/133/1'>Ps 133:1</a>). This is also a foreshadowing of how unity among believers is foundational to God’s plan."
    },
    {
      "pk": 11022005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 5,
      "text": "Jehoshaphat said to the king of Israel, \"Please inquire first for the word of the LORD.\"",
      "links": "<a href='/AIV/09/23/2'>1 Sam 23:2</a>; <a href='/AIV/20/3/6'>Prov 3:6</a>",
      "comment": "Jehoshaphat’s pious inclination marks him as a king who seeks God’s will first, a model for discernment in God’s people."
    },
    {
      "pk": 11022006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 6,
      "text": "So the king of Israel gathered the prophets together, about four hundred men, and said to them, \"Shall I go to battle against Ramoth-gilead, or shall I refrain?\" They said, \"Go up, for the Lord will give it into the hand of the king.\"",
      "links": "<a href='/AIV/11/18/19'>1 Kgs 18:19</a>; <a href='/AIV/26/13/10'>Ezek 13:10</a>",
      "comment": "These prophets probably served at Ahab’s court and may be inclined to tell the king what he wants to hear. True prophecy comes from God, not from majority opinion (cf. <a href='/AIV/24/23/16'>Jer 23:16</a>)."
    },
    {
      "pk": 11022007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 7,
      "text": "But Jehoshaphat said, \"Is there not still a prophet of the LORD here, that we may inquire of him?\"",
      "links": "<a href='/AIV/24/37/17'>Jer 37:17</a>",
      "comment": "Jehoshaphat’s discernment points to hierarchy and authentic teaching authority. Not all who claim God’s word speak with divine authority—one must test the spirits and seek genuine guidance (cf. <a href='/AIV/62/4/1'>1 John 4:1</a>)."
    },
    {
      "pk": 11022008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 8,
      "text": "The king of Israel said to Jehoshaphat, \"There is yet one man by whom we may inquire of the LORD, Micaiah the son of Imlah, but I hate him, for he never prophesies good concerning me, but only evil.\" Jehoshaphat said, \"Let not the king say so.\"",
      "links": "<a href='/AIV/24/18/18'>Jer 18:18</a>",
      "comment": "True prophets often speak hard truths. This also illustrates the role of the persecuted prophet who stands by God’s word regardless of popularity, prefiguring Christ (<a href='/AIV/40/23/37'>Matt 23:37</a>)."
    },
    {
      "pk": 11022009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 9,
      "text": "Then the king of Israel called an officer and said, \"Bring quickly Micaiah the son of Imlah.\"",
      "links": "",
      "comment": "The seeking of Micaiah indicates that even corrupt earthly power sometimes bows to true spiritual authority."
    },
    {
      "pk": 11022010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 10,
      "text": "Now the king of Israel and Jehoshaphat the king of Judah were sitting on their thrones, arrayed in their robes, at the threshing floor at the entrance of the gate of Samaria, and all the prophets were prophesying before them.",
      "links": "<a href='/AIV/13/13/9'>1 Chr 13:9</a>",
      "comment": "The thrones and robes stress their authority; the gathering of prophets in front of physical kings foreshadows the final authority of the divine King and the heavenly court."
    },
    {
      "pk": 11022011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 11,
      "text": "Zedekiah the son of Chenaanah made himself horns of iron and said, \"Thus says the LORD: ‘With these you shall push the Arameans until they are destroyed.’\"",
      "links": "<a href='/AIV/05/33/17'>Deut 33:17</a>; <a href='/AIV/33/4/13'>Mic 4:13</a>",
      "comment": "Physical symbols are sometimes used in true and false prophecy. The use of signs anticipates sacramental realities—outward actions reflecting inward truths."
    },
    {
      "pk": 11022012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 12,
      "text": "All the prophets prophesied so and said, \"Go up to Ramoth-gilead and triumph; for the LORD will give it into the hand of the king.\"",
      "links": "",
      "comment": "A consensus does not guarantee truth. Throughout salvation history, God often works through a faithful remnant or single voice."
    },
    {
      "pk": 11022013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 13,
      "text": "The messenger who went to summon Micaiah said to him, \"Behold, the words of the prophets with one accord are favorable to the king. Let your word be like theirs, and speak favorably.\"",
      "links": "<a href='/AIV/24/23/16'>Jer 23:16</a>",
      "comment": "Pressure to conform has always challenged true messengers of God, just as the call of prophets—and apostles—was marked by integrity and fidelity to God's word."
    },
    {
      "pk": 11022014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 14,
      "text": "But Micaiah said, \"As the LORD lives, what the LORD says to me, that I will speak.\"",
      "links": "<a href='/AIV/24/26/15'>Jer 26:15</a>",
      "comment": "This is the hallmark of a true prophet—submission to the living and active word of God. Similarly, authentic ministry must remain faithful to God's revelation."
    },
    {
      "pk": 11022015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 15,
      "text": "And when he came to the king, the king said to him, \"Micaiah, shall we go to Ramoth-gilead to battle, or shall we refrain?\" He answered him, \"Go up and triumph; the LORD will give it into the hand of the king.\"",
      "links": "",
      "comment": "Micaiah’s initial agreement is likely delivered with irony; the discerning king recognizes the tone as sarcasm, pointing to the importance of spiritual attentiveness."
    },
    {
      "pk": 11022016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 16,
      "text": "But the king said to him, \"How many times must I make you swear that you will tell me nothing but the truth in the name of the LORD?\"",
      "links": "",
      "comment": "Even those resistant to God’s word recognize authentic prophecy, underscoring the power and clarity of truth. The invocation of God's name shows the seriousness of prophecy."
    },
    {
      "pk": 11022017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 17,
      "text": "Then he said, \"I saw all Israel scattered on the mountains, like sheep that have no shepherd. And the LORD said, ‘These have no master. Let each return to his house in peace.’\"",
      "links": "<a href='/AIV/04/27/17'>Num 27:17</a>; <a href='/AIV/40/9/36'>Matt 9:36</a>",
      "comment": "The image of sheep without a shepherd prefigures Christ as the Good Shepherd (<a href='/AIV/43/10/11'>John 10:11</a>). It also points to the importance of divinely instituted guidance for God’s people."
    },
    {
      "pk": 11022018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 18,
      "text": "And the king of Israel said to Jehoshaphat, \"Did I not tell you that he would not prophesy good concerning me, but only evil?\"",
      "links": "",
      "comment": "The king’s reaction mirrors humanity’s tendency to reject uncomfortable truth, just as the leaders in Jesus’ day rejected his words."
    },
    {
      "pk": 11022019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 19,
      "text": "And Micaiah said, \"Therefore hear the word of the LORD: I saw the LORD sitting on his throne, and all the host of heaven standing by him on his right hand and on his left;",
      "links": "<a href='/AIV/18/1/6'>Job 1:6</a>; <a href='/AIV/23/6/1'>Isa 6:1</a>; <a href='/AIV/66/4/2'>Rev 4:2</a>",
      "comment": "A vision of the heavenly court reveals God's sovereignty over earthly kingdoms, a key biblical theme, and foreshadows Christ's enthronement (<a href='/AIV/44/7/55-56'>Acts 7:55-56</a>)."
    },
    {
      "pk": 11022020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 20,
      "text": "and the LORD said, 'Who will entice Ahab, so that he may go up and fall at Ramoth-gilead?' And one said one thing, and another said another.",
      "links": "",
      "comment": "God’s providence governs even the actions of kings; God permits deception as judgment when hearts are hardened (<a href='/AIV/53/2/11'>2 Thess 2:11</a>)."
    },
    {
      "pk": 11022021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 21,
      "text": "Then a spirit came forward and stood before the LORD, saying, ‘I will entice him.’",
      "links": "",
      "comment": "God’s sovereignty extends over spiritual beings, showing the harmony of visible and invisible realities, a theme found in both the Old and New Covenants."
    },
    {
      "pk": 11022022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 22,
      "text": "And the LORD said to him, 'By what means?' And he said, 'I will go out and be a lying spirit in the mouth of all his prophets.' And he said, 'You are to entice him, and you shall succeed. Go out and do so.'",
      "links": "<a href='/AIV/26/14/9'>Ezek 14:9</a>",
      "comment": "The allowance of a 'lying spirit' illustrates God's judgment and respect for free will. It demonstrates the need for authentic spiritual discernment under divinely instituted authority."
    },
    {
      "pk": 11022023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 23,
      "text": "Now, therefore, behold, the LORD has put a lying spirit in the mouth of all these your prophets; the LORD has spoken disaster concerning you.\"",
      "links": "<a href='/AIV/24/14/14'>Jer 14:14</a>",
      "comment": "This demonstrates divine judgment on prophetic corruption, a warning regarding the gravity of authentic ministry and teaching."
    },
    {
      "pk": 11022024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 24,
      "text": "Then Zedekiah the son of Chenaanah came near and struck Micaiah on the cheek and said, \"How did the Spirit of the LORD pass from me to speak to you?\"",
      "links": "<a href='/AIV/25/3/30'>Lam 3:30</a>; <a href='/AIV/40/26/67'>Matt 26:67</a>",
      "comment": "Micaiah is struck, like many prophets and ultimately Christ. Suffering for truth is a mark of those in true succession to the prophets (<a href='/AIV/42/6/22-23'>Luke 6:22-23</a>)."
    },
    {
      "pk": 11022025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 25,
      "text": "And Micaiah said, \"Behold, you shall see on that day when you go into an inner chamber to hide yourself.\"",
      "links": "<a href='/AIV/11/20/30'>1 Kgs 20:30</a>",
      "comment": "True prophecy will be vindicated. False guides are ultimately exposed as self-serving and must retreat when the truth is revealed."
    },
    {
      "pk": 11022026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 26,
      "text": "The king of Israel said, \"Seize Micaiah and take him back to Amon the governor of the city and to Joash the king's son,",
      "links": "",
      "comment": "Persecuting God’s messenger is a theme throughout salvation history, foreshadowing the treatment of Christ and the apostles."
    },
    {
      "pk": 11022027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 27,
      "text": "and say, 'Thus says the king, Put this man in prison and feed him with meager rations of bread and water until I come in peace.'\"",
      "links": "<a href='/AIV/41/6/17'>Mark 6:17</a>",
      "comment": "The suffering of faithful prophets signals the importance of perseverance in the truth, no matter the cost."
    },
    {
      "pk": 11022028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 28,
      "text": "And Micaiah said, \"If you return in peace, the LORD has not spoken by me.\" And he said, \"Hear, all you peoples!\"",
      "links": "<a href='/AIV/33/1/2'>Micah 1:2</a>",
      "comment": "Micaiah appeals to the people, showing that prophetic truth is meant for the whole assembly, not just leaders—a prefigurement of the Church’s public teaching role."
    },
    {
      "pk": 11022029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 29,
      "text": "So the king of Israel and Jehoshaphat the king of Judah went up to Ramoth-gilead.",
      "links": "<a href='/AIV/14/18/28'>2 Chr 18:28</a>",
      "comment": "Both kings proceed, even after the warning, demonstrating how leaders may ignore authentic divine guidance, a warning for all generations."
    },
    {
      "pk": 11022030,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 30,
      "text": "The king of Israel said to Jehoshaphat, \"I will disguise myself and go into battle, but you wear your robes.\" So the king of Israel disguised himself and went into battle.",
      "links": "<a href='/AIV/14/18/29'>2 Chr 18:29</a>",
      "comment": "Ahab’s attempt to deceive and save himself contrasts with the call to witness openly. Authentic leadership does not hide from danger but leads sacrificially (cf. <a href='/AIV/43/10/15'>John 10:15</a>)."
    },
    {
      "pk": 11022031,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 31,
      "text": "Now the king of Aram had commanded the thirty-two captains of his chariots, saying, \"Do not fight with small or great, but only with the king of Israel.\"",
      "links": "<a href='/AIV/11/20/24'>1 Kgs 20:24</a>",
      "comment": "This command singles out leadership as especially significant and points to spiritual warfare that targets shepherds to scatter the flock (<a href='/AIV/38/13/7'>Zech 13:7</a>)."
    },
    {
      "pk": 11022032,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 32,
      "text": "So when the captains of the chariots saw Jehoshaphat, they said, \"Surely it is the king of Israel.\" So they turned to fight against him, and Jehoshaphat cried out.",
      "links": "<a href='/AIV/14/18/31'>2 Chr 18:31</a>",
      "comment": "The confusion highlights the consequences of false actions by leaders. Jehoshaphat’s cry prefigures the call to God found throughout the Psalms."
    },
    {
      "pk": 11022033,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 33,
      "text": "And when the captains of the chariots saw that it was not the king of Israel, they turned back from pursuing him.",
      "links": "",
      "comment": "Jehoshaphat is spared, showing God’s hand in preserving the faithful even amid chaos."
    },
    {
      "pk": 11022034,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 34,
      "text": "But a certain man drew his bow at random and struck the king of Israel between the armor joints. So he said to his chariot driver, \"Turn around and carry me out of the battle, for I am wounded.\"",
      "links": "<a href='/AIV/14/18/33'>2 Chr 18:33</a>",
      "comment": "Ahab’s death by a seemingly random shot shows that nothing is outside God’s providence. This is a powerful reminder of God’s justice and sovereignty."
    },
    {
      "pk": 11022035,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 35,
      "text": "And the battle grew fierce that day, and the king was propped up in his chariot before the Arameans, and he died at evening. The blood from his wound ran down into the bottom of the chariot.",
      "links": "<a href='/AIV/11/21/19'>1 Kgs 21:19</a>",
      "comment": "Fulfillment of judgment pronounced earlier. The detail of blood in the chariot alludes to previous prophecy and the seriousness of disobedience."
    },
    {
      "pk": 11022036,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 36,
      "text": "A cry passed through the army as the sun was going down, saying, \"Every man to his city, and every man to his country!\"",
      "links": "<a href='/AIV/11/22/17'>1 Kgs 22:17</a>",
      "comment": "Chaos and scattering, as the prophet had foretold. Fulfillment of God’s word is inevitable."
    },
    {
      "pk": 11022037,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 37,
      "text": "So the king died, and was brought to Samaria; and they buried the king in Samaria.",
      "links": "<a href='/AIV/11/16/28'>1 Kgs 16:28</a>",
      "comment": "Ahab’s burial in Samaria finalizes the divine judgment. The fate of evil kings serves as a caution and a reassurance: God’s justice prevails."
    },
    {
      "pk": 11022038,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 38,
      "text": "And they washed the chariot by the pool of Samaria, and the dogs licked up his blood (as the word of the LORD had spoken), and the prostitutes washed themselves there.",
      "links": "<a href='/AIV/11/21/19'>1 Kgs 21:19</a>; <a href='/AIV/14/18/34'>2 Chr 18:34</a>",
      "comment": "Explicit fulfillment of God’s word to Elijah. The narrative’s realism underscores the certainty of divine prophecy."
    },
    {
      "pk": 11022039,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 39,
      "text": "Now the rest of the acts of Ahab, and all that he did, and the ivory house that he built, and all the cities that he built, are they not written in the Book of the Chronicles of the Kings of Israel?",
      "links": "",
      "comment": "Reference to historical records outside the biblical canon demonstrates the thoroughness of Israel’s remembrance, and how God’s story is woven with history."
    },
    {
      "pk": 11022040,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 40,
      "text": "So Ahab slept with his fathers; and Ahaziah his son became king in his place.",
      "links": "<a href='/AIV/12/1/2'>2 Kgs 1:2</a>",
      "comment": "Despite human opposition, God’s plan moves forward; dynasties change but divine providence endures."
    },
    {
      "pk": 11022041,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 41,
      "text": "Jehoshaphat the son of Asa became king over Judah in the fourth year of Ahab king of Israel.",
      "links": "<a href='/AIV/14/17/1'>2 Chr 17:1</a>",
      "comment": "A transition to the reign of Judah’s king. Judah’s line was crucial to the messianic promises fulfilled in Jesus (<a href='/AIV/40/1/1-2'>Matt 1:1-2</a>)."
    },
    {
      "pk": 11022042,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 42,
      "text": "Jehoshaphat was thirty-five years old when he began to reign, and he reigned twenty-five years in Jerusalem. His mother's name was Azubah the daughter of Shilhi.",
      "links": "<a href='/AIV/14/20/31'>2 Chr 20:31</a>",
      "comment": "Details about reign lengths and matrilineal lines highlight both continuity and the scriptural care for genealogies, anticipating the New Testament."
    },
    {
      "pk": 11022043,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 43,
      "text": "And he walked in all the ways of Asa his father; he did not turn aside from it, doing what was right in the eyes of the LORD. Yet the high places were not taken away; the people still sacrificed and made offerings on the high places.",
      "links": "<a href='/AIV/05/12/2-4'>Deut 12:2-4</a>; <a href='/AIV/14/20/33'>2 Chr 20:33</a>",
      "comment": "Jehoshaphat is commended but not perfect—reform is incomplete. The persistence of high places points to the enduring struggle between pure worship and compromise."
    },
    {
      "pk": 11022044,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 44,
      "text": "Jehoshaphat made peace with the king of Israel.",
      "links": "",
      "comment": "This act of peace reflects hope for unity among God’s people; unity is a continuing desire in God’s plan for his people (<a href='/AIV/43/17/22'>John 17:22</a>)."
    },
    {
      "pk": 11022045,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 45,
      "text": "Now the rest of the acts of Jehoshaphat, and his might that he showed, and how he fought, are they not written in the Book of the Chronicles of the Kings of Judah?",
      "links": "<a href='/AIV/14/17/3'>2 Chr 17:3</a>",
      "comment": "Reference to other historical records once again points to a deep-rooted continuity in Israel's history, and the careful memory of God's people."
    },
    {
      "pk": 11022046,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 46,
      "text": "And the remnant of the male cult prostitutes, who remained in the days of his father Asa, he expelled from the land.",
      "links": "<a href='/AIV/05/23/17'>Deut 23:17</a>; <a href='/AIV/11/15/12'>1 Kgs 15:12</a>",
      "comment": "Expelling cult prostitutes purifies the worship of Israel. This pattern of reform signals the draw toward holiness that prefigures the purifying action of Christ in the new covenant."
    },
    {
      "pk": 11022047,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 47,
      "text": "Now there was no king in Edom; a deputy was king.",
      "links": "",
      "comment": "This note shows a power vacuum in Edom, an opening for further conflict or cooperation, and is significant for Israel’s broader relationship to surrounding nations."
    },
    {
      "pk": 11022048,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 48,
      "text": "Jehoshaphat made ships of Tarshish to go to Ophir for gold, but they did not go, for the ships were wrecked at Ezion-geber.",
      "links": "<a href='/AIV/14/20/36-37'>2 Chr 20:36-37</a>",
      "comment": "The failure of Jehoshaphat’s fleet shows the limits of human planning apart from God’s full blessing. It humbles kings and reminds us of Providence."
    },
    {
      "pk": 11022049,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 49,
      "text": "Then Ahaziah the son of Ahab said to Jehoshaphat, \"Let my servants go with your servants in the ships.\" But Jehoshaphat was not willing.",
      "links": "",
      "comment": "Jehoshaphat chooses to limit his alliance, indicating concerns for purity and obedience. This restraint models prudent cooperation without full compromise."
    },
    {
      "pk": 11022050,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 50,
      "text": "Jehoshaphat slept with his fathers and was buried with his fathers in the city of David his father. And Jehoram his son became king in his place.",
      "links": "<a href='/AIV/14/21/1'>2 Chr 21:1</a>",
      "comment": "Again, the city of David is emphasized, tying into messianic expectations and continuity in leadership."
    },
    {
      "pk": 11022051,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 51,
      "text": "Ahaziah the son of Ahab became king over Israel in Samaria in the seventeenth year of Jehoshaphat king of Judah, and he reigned two years over Israel.",
      "links": "<a href='/AIV/12/1/2'>2 Kgs 1:2</a>",
      "comment": "Transition to a new king in the northern kingdom. Short reigns often indicate instability or divine disfavor."
    },
    {
      "pk": 11022052,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 52,
      "text": "He did what was evil in the sight of the LORD and walked in the way of his father and the way of his mother and in the way of Jeroboam the son of Nebat, who made Israel to sin.",
      "links": "<a href='/AIV/11/16/30-33'>1 Kgs 16:30-33</a>",
      "comment": "Following parental and traditional error is condemned, showing that lineage alone does not guarantee divine favor. True faithfulness means remaining in right worship and doctrine."
    },
    {
      "pk": 11022053,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 22,
      "verse": 53,
      "text": "He served Baal and worshiped him and provoked the LORD, the God of Israel, to anger in every way that his father had done.",
      "links": "<a href='/AIV/11/16/31'>1 Kgs 16:31</a>",
      "comment": "Ahaziah’s idolatry provokes God’s jealousy. It underscores the biblical urgency to worship according to God’s command, remaining faithful to the true faith handed down."
    }
  ],
  "translatedAt": "2025-12-24T03:42:19.676Z"
}