{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 11,
  "verses": [
    {
      "pk": 11011001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 1,
      "text": "King Solomon loved many foreign women, in addition to Pharaoh’s daughter—Moabite, Ammonite, Edomite, Sidonian, and Hittite women—",
      "links": "<a href='/AIV/05/07/3-4'>Deut. 7:3-4</a>",
      "comment": "Solomon’s love for foreign women is a direct violation of the warnings given in Deuteronomy about relationships with pagan nations, which would lead Israel away from God's commands."
    },
    {
      "pk": 11011002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 2,
      "text": "from the nations about which the LORD had said to the Israelites, 'You must not intermarry with them, nor they with you. For surely, they will turn your hearts after their gods.' Yet Solomon clung to these women in love.",
      "links": "<a href='/AIV/05/07/3-4'>Deut. 7:3-4</a>",
      "comment": "God’s clear command is repeated here. Solomon’s deliberate disregard shows the strength of human will and desire over divine instruction, foreshadowing exile."
    },
    {
      "pk": 11011003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 3,
      "text": "He had seven hundred wives of royal birth and three hundred concubines, and his wives turned his heart away.",
      "links": "<a href='/AIV/19/106/35-39'>Ps. 106:35-39</a>",
      "comment": "The staggering number highlights the depth of Solomon’s deviation from monogamous marriage as intended in Genesis 2:24, which points to union and fidelity."
    },
    {
      "pk": 11011004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 4,
      "text": "In Solomon’s old age, his wives turned his heart after other gods, and his heart was not wholly devoted to the LORD his God as the heart of David his father had been.",
      "links": "<a href='/AIV/10/12/13'>2 Sam. 12:13</a>; <a href='/AIV/19/51/10'>Ps. 51:10</a>",
      "comment": "Solomon’s fall is compared with David’s faithfulness and repentance, reflecting the importance of undivided devotion to God, a spiritual principle foundational for authentic worship."
    },
    {
      "pk": 11011005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 5,
      "text": "Solomon followed Ashtoreth, the goddess of the Sidonians, and Milcom, the abomination of the Ammonites.",
      "links": "<a href='/AIV/07/02/13'>Judg. 2:13</a>; <a href='/AIV/03/18/21'>Lev. 18:21</a>",
      "comment": "The worship of foreign gods reflected a corrupting influence. Solomon, Israel’s king, leads the people into idolatry—contrary to the priestly calling of the king."
    },
    {
      "pk": 11011006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 6,
      "text": "Solomon did evil in the sight of the LORD and did not fully follow the LORD as David his father had done.",
      "links": "<a href='/AIV/09/13/14'>1 Sam. 13:14</a>",
      "comment": "Notice the pattern set by David, who, when repentant, was wholeheartedly restored. Here, the heart’s disposition and repentance are key spiritual lessons."
    },
    {
      "pk": 11011007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 7,
      "text": "At that time Solomon built a high place for Chemosh, the abomination of Moab, on the mountain east of Jerusalem, and for Molech, the abomination of the Ammonites.",
      "links": "<a href='/AIV/07/10/6'>Judg. 10:6</a>; <a href='/AIV/24/32/35'>Jer. 32:35</a>",
      "comment": "The physical building of places of worship for false gods solidifies the spiritual downfall; the location near Jerusalem is significant, hinting at opposition to the true worship in the temple."
    },
    {
      "pk": 11011008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 8,
      "text": "He did the same for all his foreign wives, who burned incense and made sacrifices to their gods.",
      "links": "<a href='/AIV/02/20/3-5'>Exod. 20:3-5</a>",
      "comment": "The repeated offenses further intensify the narrative of spiritual compromise, undermining proper sacrifice and worship established by God."
    },
    {
      "pk": 11011009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 9,
      "text": "The LORD was angry with Solomon because his heart had turned away from the LORD, the God of Israel, who had appeared to him twice.",
      "links": "<a href='/AIV/11/03/5'>1 Kgs. 3:5</a>; <a href='/AIV/11/09/2'>1 Kgs. 9:2</a>",
      "comment": "Solomon’s privilege, with personal manifestations of God, makes his apostasy especially grave. Divine anger reflects the seriousness of covenant betrayal."
    },
    {
      "pk": 11011010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 10,
      "text": "God had commanded him about this matter, not to follow other gods. But Solomon did not keep the LORD’s command.",
      "links": "<a href='/AIV/02/20/3-5'>Exod. 20:3-5</a>; <a href='/AIV/05/05/7'>Deut. 5:7</a>",
      "comment": "Obedience is a central theme. The king’s purpose includes representing spiritual fidelity and obedience, foreshadowing Christ’s fulfillment of perfect obedience."
    },
    {
      "pk": 11011011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 11,
      "text": "So the LORD said to Solomon, 'Because you have done this, and have not kept My covenant and My statutes which I have commanded you, I will surely tear the kingdom away from you and give it to your servant.'",
      "links": "<a href='/AIV/09/15/28'>1 Sam. 15:28</a>; <a href='/AIV/11/12/16'>1 Kgs. 12:16</a>",
      "comment": "Loss of the kingdom is a direct consequence of unfaithfulness. The division recalls the lasting effects of spiritual choices, relevant both individually and collectively."
    },
    {
      "pk": 11011012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 12,
      "text": "'Nevertheless, for the sake of your father David, I will not do it during your lifetime. I will tear it out of the hand of your son.'",
      "links": "<a href='/AIV/10/07/15-16'>2 Sam. 7:15-16</a>",
      "comment": "Divine mercy toward David reflects the enduring nature of God’s promises—pointing toward the concept of spiritual heritage and succession."
    },
    {
      "pk": 11011013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 13,
      "text": "'However, I will not tear away all the kingdom. I will give one tribe to your son, for the sake of David My servant and for Jerusalem which I have chosen.'",
      "links": "<a href='/AIV/11/12/20'>1 Kgs. 12:20</a>; <a href='/AIV/19/132/13'>Ps. 132:13</a>",
      "comment": "Preserving a remnant is critical; it prefigures God’s faithfulness to His promises, ultimately fulfilled in the coming Messiah through the line of David."
    },
    {
      "pk": 11011014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 14,
      "text": "Then the LORD raised up an adversary against Solomon, Hadad the Edomite; he was of the royal family in Edom.",
      "links": "<a href='/AIV/11/11/25'>1 Kgs. 11:25</a>",
      "comment": "Divine retribution often comes through historical means. The adversaries embody the consequences of spiritual error and the loss of unity."
    },
    {
      "pk": 11011015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 15,
      "text": "Earlier, when David was in Edom, Joab the commander of the army had gone to bury the slain after striking down every male in Edom.",
      "links": "<a href='/AIV/10/08/14'>2 Sam. 8:14</a>",
      "comment": "Historical background informs the origin of Hadad’s animosity, showing how past actions often sow seeds for future conflicts."
    },
    {
      "pk": 11011016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 16,
      "text": "Joab and all Israel remained there for six months, until every male in Edom was killed.",
      "links": "<a href='/AIV/10/08/14'>2 Sam. 8:14</a>",
      "comment": "This verse underscores the thoroughness of Joab’s campaign and sets the stage for lasting bitterness."
    },
    {
      "pk": 11011017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 17,
      "text": "But Hadad escaped to Egypt, he and some Edomite servants of his father, while Hadad was still a boy.",
      "links": "<a href='/AIV/02/02/10'>Exod. 2:10</a>",
      "comment": "Hadad’s escape to Egypt parallels other biblical figures whose exile shapes later historical events, echoing the theme of exile and return."
    },
    {
      "pk": 11011018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 18,
      "text": "They set out from Midian and went to Paran, taking men with them from Paran, and then came to Egypt, to Pharaoh king of Egypt, who gave Hadad a house, assigned him food, and gave him land.",
      "links": "<a href='/AIV/01/12/10'>Gen. 12:10</a>",
      "comment": "Hospitality for exiles—especially in Egypt—recalls earlier biblical patterns of God’s providence for those displaced."
    },
    {
      "pk": 11011019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 19,
      "text": "Hadad found great favor in the sight of Pharaoh, so that he gave him as wife the sister of his own wife, Tahpenes the queen.",
      "links": "<a href='/AIV/02/12/36'>Exod. 12:36</a>",
      "comment": "Favor in exile offers a recurring theme of prosperity despite displacement, similar to Joseph’s own rise in Egypt."
    },
    {
      "pk": 11011020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 20,
      "text": "Tahpenes’ sister bore Hadad a son, Genubath, whom Tahpenes brought up in Pharaoh’s palace, and Genubath lived among Pharaoh’s children.",
      "links": "<a href='/AIV/01/45/10'>Gen. 45:10</a>",
      "comment": "Being raised in a royal court, Genubath’s experience mirrors that of Moses and Joseph, two influential outsiders in Egypt."
    },
    {
      "pk": 11011021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 21,
      "text": "When Hadad heard in Egypt that David had rested with his fathers and that Joab the commander of the army was dead, Hadad said to Pharaoh, 'Send me away so I may go to my own country.'",
      "links": "<a href='/AIV/01/15/15'>Gen. 15:15</a>",
      "comment": "The phrase 'rested with his fathers' draws on the concept of death and the afterlife, an important spiritual theme in both Old and New Testament contexts."
    },
    {
      "pk": 11011022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 22,
      "text": "But Pharaoh said to him, 'What have you lacked with me that you now seek to return to your own country?' And Hadad replied, 'Nothing, but please let me go.'",
      "links": "<a href='/AIV/01/47/5-6'>Gen. 47:5-6</a>",
      "comment": "Hadad’s response highlights a yearning for homeland, a motif found throughout scripture, including the longing for the heavenly city in Hebrews 11:16."
    },
    {
      "pk": 11011023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 23,
      "text": "God also raised up another adversary against Solomon, Rezon son of Eliada, who had fled from his master Hadadezer king of Zobah.",
      "links": "<a href='/AIV/10/08/03'>2 Sam. 8:3</a>",
      "comment": "The raising up of adversaries is understood as divine judgment; history and spiritual consequence are closely linked."
    },
    {
      "pk": 11011024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 24,
      "text": "He gathered men to himself and became leader of a band when David killed the men of Zobah, and they went to Damascus and settled there, and Rezon ruled in Damascus.",
      "links": "<a href='/AIV/10/08/06'>2 Sam. 8:6</a>",
      "comment": "Damascus becomes a key city. Rezon’s leadership signals a new political threat; the rise of adversaries exemplifies consequences of spiritual decline."
    },
    {
      "pk": 11011025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 25,
      "text": "He was an adversary to Israel all the days of Solomon, besides the trouble caused by Hadad. He hated Israel and ruled over Aram.",
      "links": "<a href='/AIV/10/08/05'>2 Sam. 8:5</a>",
      "comment": "Opposition faced by Solomon led to the weakening of Israel’s security, showing that spiritual compromise leads to concrete negative outcomes."
    },
    {
      "pk": 11011026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 26,
      "text": "Jeroboam son of Nebat, an Ephraimite from Zeredah, a servant of Solomon whose mother’s name was Zeruah, a widow, also rebelled against the king.",
      "links": "<a href='/AIV/11/12/2-4'>1 Kgs. 12:2-4</a>",
      "comment": "Jeroboam’s introduction foreshadows the coming division; note the connection to Ephraim, symbolizing the northern tribes’ breakaway."
    },
    {
      "pk": 11011027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 27,
      "text": "This is the account of how he rebelled against the king: Solomon was building the Millo and closing the gap of the wall of the city of David his father.",
      "links": "<a href='/AIV/10/05/09'>2 Sam. 5:9</a>",
      "comment": "Building projects like the Millo, while impressive, are tied to forced labor and dissatisfaction among the people, connecting reverence for tradition and leadership."
    },
    {
      "pk": 11011028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 28,
      "text": "Now Jeroboam was a man of ability, and when Solomon saw that the young man was industrious, he put him in charge of all the forced labor of the house of Joseph.",
      "links": "<a href='/AIV/01/41/41'>Gen. 41:41</a>",
      "comment": "Jeroboam’s rise echoes Joseph’s stewardship in Egypt, but the forced labor compared to the bondage narrative undermines unity and justice."
    },
    {
      "pk": 11011029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 29,
      "text": "At that time, as Jeroboam went out of Jerusalem, the prophet Ahijah the Shilonite met him on the road, wearing a new cloak. They were alone in the country.",
      "links": "<a href='/AIV/11/14/2'>1 Kgs. 14:2</a>",
      "comment": "Prophets as bearers of God’s word play a critical role, as Ahijah’s new cloak symbolizes new beginnings and divine selection."
    },
    {
      "pk": 11011030,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 30,
      "text": "Ahijah took hold of the new cloak he was wearing and tore it into twelve pieces.",
      "links": "<a href='/AIV/09/15/27'>1 Sam. 15:27</a>",
      "comment": "The symbolism of twelve pieces recalls the twelve tribes, connecting to Israel’s identity as God’s chosen people, prefiguring the later unity in spiritual fulfillment."
    },
    {
      "pk": 11011031,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 31,
      "text": "He said to Jeroboam, 'Take ten pieces for yourself. For this is what the LORD, the God of Israel, says: See, I am about to tear the kingdom out of Solomon’s hand and give you ten tribes.'",
      "links": "<a href='/AIV/11/12/16'>1 Kgs. 12:16</a>",
      "comment": "Ahijah’s prophecy is the basis for later division, showing transitions are governed by divine will, not mere politics."
    },
    {
      "pk": 11011032,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 32,
      "text": "'But he will have one tribe, for the sake of My servant David and for the sake of Jerusalem, the city I have chosen out of all the tribes of Israel.'",
      "links": "<a href='/AIV/19/132/13'>Ps. 132:13</a>",
      "comment": "God’s election of David and Jerusalem highlights the themes of covenantal promise and spiritual center, which finds ultimate fulfillment in Christ."
    },
    {
      "pk": 11011033,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 33,
      "text": "'For they have forsaken Me, worshiped Ashtoreth the goddess of the Sidonians, Chemosh the god of Moab, and Milcom the god of the Ammonites, and have not walked in My ways, done what is right in My eyes, nor kept My statutes and judgments as David did.'",
      "links": "<a href='/AIV/02/20/5'>Exod. 20:5</a>",
      "comment": "The list of gods stresses the depth of apostasy. David’s relative faithfulness is the model, although not perfect, his repentance keeps him in favor."
    },
    {
      "pk": 11011034,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 34,
      "text": "'I will not take the whole kingdom out of his hand, but I will make him ruler all the days of his life, for the sake of My servant David whom I chose, who kept My commandments and statutes.'",
      "links": "<a href='/AIV/19/89/28-37'>Ps. 89:28-37</a>",
      "comment": "NOTE: Even amid judgment, God’s promise to David preserves a remnant—an anticipation of lasting kingship completed in Christ."
    },
    {
      "pk": 11011035,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 35,
      "text": "'But I will take the kingdom out of his son’s hand and give ten tribes to you.'",
      "links": "<a href='/AIV/11/12/20'>1 Kgs. 12:20</a>",
      "comment": "Highlighting succession by spiritual rather than merely physical inheritance. True kingship is always granted by God’s authority."
    },
    {
      "pk": 11011036,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 36,
      "text": "'To his son I will give one tribe, so that My servant David will always have a lamp before Me in Jerusalem, the city where I have chosen to put My Name.'",
      "links": "<a href='/AIV/11/15/4'>1 Kgs. 15:4</a>; <a href='/AIV/19/132/17'>Ps. 132:17</a>",
      "comment": "‘Lamp’ is a symbol for enduring dynasty and the presence of God’s light, foreshadowing the Messianic fulfillment in Christ, ‘the true Light’."
    },
    {
      "pk": 11011037,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 37,
      "text": "'I will take you, and you shall reign over all that your soul desires, and you shall be king over Israel.'",
      "links": "<a href='/AIV/11/12/20'>1 Kgs. 12:20</a>",
      "comment": "God’s sovereign will appoints Jeroboam as king, setting the stage for later prophets and kings to serve as visible signs of God’s plan."
    },
    {
      "pk": 11011038,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 38,
      "text": "'If you obey all that I command you, walk in My ways, and do what is right in My eyes by keeping My statutes and My commandments, as David My servant did, then I will be with you, and will build you an enduring house, as I built for David, and will give Israel to you.'",
      "links": "<a href='/AIV/10/07/16'>2 Sam. 7:16</a>",
      "comment": "The conditional nature of blessing and dynasty points to ongoing covenant faithfulness, a continual theme in salvation history."
    },
    {
      "pk": 11011039,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 39,
      "text": "'I will afflict David’s descendants because of this, but not forever.'",
      "links": "<a href='/AIV/10/07/16'>2 Sam. 7:16</a>; <a href='/AIV/19/89/33-37'>Ps. 89:33-37</a>",
      "comment": "Judgment is not permanent; mercy foreshadows the restoration promised in the Prophets and ultimately fulfilled through Christ."
    },
    {
      "pk": 11011040,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 40,
      "text": "Solomon tried to kill Jeroboam, but Jeroboam fled to Egypt, to Shishak king of Egypt, and remained there until Solomon’s death.",
      "links": "<a href='/AIV/11/12/2'>1 Kgs. 12:2</a>",
      "comment": "Conflict and exile echo previous stories, including Moses. The refuge in Egypt is a motif that carries through salvation history."
    },
    {
      "pk": 11011041,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 41,
      "text": "The rest of the acts of Solomon, all he did, and his wisdom, are they not written in the Book of the Acts of Solomon?",
      "links": "<a href='/AIV/11/14/19'>1 Kgs. 14:19</a>",
      "comment": "Extra-biblical records are referenced, demonstrating that not all history is contained directly in the canon—highlighting oral tradition and authority."
    },
    {
      "pk": 11011042,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 42,
      "text": "Solomon reigned in Jerusalem over all Israel forty years.",
      "links": "<a href='/AIV/11/02/11'>1 Kgs. 2:11</a>",
      "comment": "The biblical significance of forty years often signals completion or fullness of time, as seen in Israel’s wanderings and in Christ’s forty days."
    },
    {
      "pk": 11011043,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 11,
      "verse": 43,
      "text": "Solomon rested with his fathers, and was buried in the city of David his father. And Rehoboam his son reigned in his place.",
      "links": "<a href='/AIV/11/14/31'>1 Kgs. 14:31</a>",
      "comment": "The ending of Solomon’s life sets the stage for the kingdom’s division. Note the burial in the city chosen by God, underscoring continuity of tradition and inheritance."
    }
  ],
  "translatedAt": "2025-12-24T03:34:52.757Z"
}