{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 15,
  "verses": [
    {
      "pk": 11015001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 1,
      "text": "In the eighteenth year of King Jeroboam, Abijah became king over Judah.",
      "links": "<a href='/AIV/14/13/1'>2 Chr. 13:1</a>",
      "comment": "Abijah's reign in Judah is contrasted with Jeroboam in Israel. The text sets up the division between the two kingdoms."
    },
    {
      "pk": 11015002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 2,
      "text": "He reigned three years in Jerusalem. His mother’s name was Maacah, the daughter of Abishalom.",
      "links": "<a href='/AIV/14/13/2'>2 Chr. 13:2</a>",
      "comment": "Abijah's short reign is noted, and his mother's lineage underscores the royal family’s descent. Strong matriarchal figures sometimes indicate dynastic alliances."
    },
    {
      "pk": 11015003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 3,
      "text": "He walked in all the sins of his father before him, and his heart was not loyal to the LORD his God as was the heart of his ancestor David.",
      "links": "<a href='/AIV/19/89/20'>Ps. 89:20</a>; <a href='/AIV/13/28/9'>1 Chr. 28:9</a>",
      "comment": "Abijah failed to live up to David’s model. The heart’s loyalty is a repeated theme—fidelity to God foreshadows the need for true, full-hearted devotion, later exemplified by Christ Himself."
    },
    {
      "pk": 11015004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 4,
      "text": "But for David’s sake the LORD his God gave him a lamp in Jerusalem, by raising up his son after him and establishing Jerusalem.",
      "links": "<a href='/AIV/10/7/12-13'>2 Sam. 7:12-13</a>; <a href='/AIV/19/132/17'>Ps. 132:17</a>",
      "comment": "‘Lamp’ symbolically refers to David’s dynasty. The Lord’s promises endure despite human failure—an early pointer to God’s faithfulness and the coming Messiah as the true son of David."
    },
    {
      "pk": 11015005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 5,
      "text": "Because David had done what was right in the eyes of the LORD, and did not turn aside from anything He commanded him all his life, except in the matter of Uriah the Hittite.",
      "links": "<a href='/AIV/10/11/27'>2 Sam. 11:27</a>; <a href='/AIV/19/51/1-4'>Ps. 51:1-4</a>",
      "comment": "David is honored for his faithfulness, with one exception. His repentance is echoed in Psalm 51, and the pattern of forgiveness and restoration points forward to the grace offered through Christ."
    },
    {
      "pk": 11015006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 6,
      "text": "There was war between Rehoboam and Jeroboam all the days of his life.",
      "links": "<a href='/AIV/11/14/30'>1 Kgs. 14:30</a>",
      "comment": "Conflict between North and South underlines Israel’s divided house. The eventual unity in the Messiah brings reconciliation where such divisions existed."
    },
    {
      "pk": 11015007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 7,
      "text": "The rest of the acts of Abijah, and all that he did, are written in the Book of the Chronicles of the Kings of Judah. There was also war between Abijah and Jeroboam.",
      "links": "<a href='/AIV/14/13/2-22'>2 Chr. 13:2-22</a>",
      "comment": "References to other chronicles show the text’s historicity and encourage careful study of the whole Scripture. War continues due to lack of unity and spiritual fidelity."
    },
    {
      "pk": 11015008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 8,
      "text": "Abijah rested with his fathers, and they buried him in the city of David. Then Asa his son became king in his place.",
      "links": "<a href='/AIV/14/14/1'>2 Chr. 14:1</a>",
      "comment": "Succession continues as Asa rises to power; burial in the city of David maintains dynastic continuity."
    },
    {
      "pk": 11015009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 9,
      "text": "In the twentieth year of Jeroboam king of Israel, Asa began to reign over Judah.",
      "links": "<a href='/AIV/14/14/1'>2 Chr. 14:1</a>",
      "comment": "Historical markers highlight the intertwined timelines of Israel and Judah."
    },
    {
      "pk": 11015010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 10,
      "text": "He reigned forty-one years in Jerusalem. His mother’s name was Maacah, the daughter of Abishalom.",
      "links": "<a href='/AIV/14/14/2'>2 Chr. 14:2</a>",
      "comment": "Asa's lengthy reign stands out for relative stability and reform."
    },
    {
      "pk": 11015011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 11,
      "text": "Asa did what was right in the eyes of the LORD, as his ancestor David had done.",
      "links": "<a href='/AIV/14/14/2'>2 Chr. 14:2</a>; <a href='/AIV/19/89/20'>Ps. 89:20</a>",
      "comment": "Asa is portrayed as a reformer, restoring true worship; this models full-hearted fidelity and points forward to the restoration Christ brings."
    },
    {
      "pk": 11015012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 12,
      "text": "He removed the male shrine prostitutes from the land and took away all the idols his ancestors had made.",
      "links": "<a href='/AIV/14/14/3'>2 Chr. 14:3</a>; <a href='/AIV/3/18/22'>Lev. 18:22</a>",
      "comment": "Reforms included purifying the land of idolatry and immorality, illustrating the call to holiness and single-minded devotion."
    },
    {
      "pk": 11015013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 13,
      "text": "He even removed Maacah his mother from being queen mother, because she had made a disgusting image for Asherah. Asa cut down her image, burned it at the Kidron Valley.",
      "links": "<a href='/AIV/14/15/16'>2 Chr. 15:16</a>",
      "comment": "Asa puts fidelity to the Lord ahead of family ties, rejecting idolatry and drawing a clear line for true worship."
    },
    {
      "pk": 11015014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 14,
      "text": "But the high places were not removed; nevertheless Asa’s heart was loyal to the LORD all his days.",
      "links": "<a href='/AIV/14/15/17'>2 Chr. 15:17</a>",
      "comment": "Even good kings left some reforms unfinished. The heart’s loyalty remains key for spiritual growth, modeling perseverance."
    },
    {
      "pk": 11015015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 15,
      "text": "He brought into the house of the LORD the dedicated things of his father, and his own dedicated things—silver, gold, and utensils.",
      "links": "<a href='/AIV/14/15/18'>2 Chr. 15:18</a>; <a href='/AIV/2/25/2'>Ex. 25:2</a>",
      "comment": "Offering dedicated items to the temple underlines the importance of sacred worship, continuity, and honoring what is devoted to God—a theme prominent in the life of the Church."
    },
    {
      "pk": 11015016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 16,
      "text": "Now there was war between Asa and Baasha king of Israel all their days.",
      "links": "<a href='/AIV/14/16/1'>2 Chr. 16:1</a>",
      "comment": "Inter-tribal conflict persisted, marking human weakness and the need for the peace that only God’s kingdom, later revealed by Christ, can bring."
    },
    {
      "pk": 11015017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 17,
      "text": "Baasha king of Israel went up against Judah, and built Ramah, so that he might not let anyone go out or come in to Asa king of Judah.",
      "links": "<a href='/AIV/14/16/1'>2 Chr. 16:1</a>",
      "comment": "Baasha’s blockade shows the depth of division; physical obstacles symbolize spiritual ones. Unity is only truly possible through divine intervention."
    },
    {
      "pk": 11015018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 18,
      "text": "Then Asa took all the silver and gold left in the treasuries of the house of the LORD and in the king’s house, and entrusted them to his servants. King Asa sent them to Ben-hadad the son of Tabrimmon, the son of Hezion, king of Syria, who dwelled in Damascus, saying:",
      "links": "<a href='/AIV/14/16/2'>2 Chr. 16:2</a>",
      "comment": "Asa relied on political alliances, giving away temple treasure. A subtle warning against trusting human power over the Lord; prioritizing spiritual treasures is a central biblical lesson."
    },
    {
      "pk": 11015019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 19,
      "text": "\"Let there be a treaty between me and you, as there was between my father and your father. See, I have sent you a gift of silver and gold. Come, break your treaty with Baasha king of Israel, so he will depart from me.\"",
      "links": "<a href='/AIV/14/16/3'>2 Chr. 16:3</a>",
      "comment": "Diplomatic maneuvering replaces trust in God. This foreshadows the importance of seeking spiritual rather than political solutions to obstacles."
    },
    {
      "pk": 11015020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 20,
      "text": "Ben-hadad listened to King Asa and sent the commanders of his armies against the cities of Israel. They attacked Ijon, Dan, Abel-beth-maacah, and all Chinneroth, with all the land of Naphtali.",
      "links": "<a href='/AIV/14/16/4'>2 Chr. 16:4</a>",
      "comment": "Foreign alliances temporarily succeed but do not result in lasting peace or blessing—a subtle lesson about the primacy of spiritual covenant over worldly politics."
    },
    {
      "pk": 11015021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 21,
      "text": "When Baasha heard of it, he stopped building Ramah and remained in Tirzah.",
      "links": "<a href='/AIV/14/16/5'>2 Chr. 16:5</a>",
      "comment": "Strategic maneuvers alter earthly circumstances, but true change requires spiritual transformation from God."
    },
    {
      "pk": 11015022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 22,
      "text": "Then King Asa made a proclamation to all Judah—no one was exempt—and they carried away the stones and timber of Ramah. With these King Asa built Geba of Benjamin and Mizpah.",
      "links": "<a href='/AIV/14/16/6'>2 Chr. 16:6</a>",
      "comment": "Resources once used for division get repurposed for defense and governance. Shows how God can transform setbacks into new possibilities for His people."
    },
    {
      "pk": 11015023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 23,
      "text": "The rest of all the acts of Asa, all his might, and all that he did, and the cities which he built, are written in the Book of the Chronicles of the Kings of Judah. But in his old age, he suffered from a disease in his feet.",
      "links": "<a href='/AIV/14/16/11-14'>2 Chr. 16:11-14</a>",
      "comment": "Scripture mentions Asa’s declining health. Physical suffering often parallels spiritual struggle and dependence on the Lord’s mercy and grace."
    },
    {
      "pk": 11015024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 24,
      "text": "Asa rested with his ancestors and was buried with them in the city of David his father. Jehoshaphat his son reigned in his place.",
      "links": "<a href='/AIV/14/17/1'>2 Chr. 17:1</a>",
      "comment": "Dynastic succession continues; burial in Jerusalem links the king’s legacy to God’s city—a sign of ongoing promise and covenant."
    },
    {
      "pk": 11015025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 25,
      "text": "Nadab son of Jeroboam became king over Israel in the second year of Asa king of Judah, and he reigned over Israel two years.",
      "links": "<a href='/AIV/13/10/13-14'>1 Chr. 10:13-14</a>",
      "comment": "A brief reign suggests instability apart from God’s favor."
    },
    {
      "pk": 11015026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 26,
      "text": "He did evil in the sight of the LORD, and walked in the way of his father and in his sin, which he made Israel to commit.",
      "links": "<a href='/AIV/11/12/30'>1 Kgs. 12:30</a>",
      "comment": "Nadab’s reign is defined by perpetuating idolatry, warning against generational sin and the failure to pursue true worship."
    },
    {
      "pk": 11015027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 27,
      "text": "Baasha son of Ahijah, of the tribe of Issachar, conspired against him. Baasha killed Nadab at Gibbethon, which belonged to the Philistines, while Nadab and all Israel were besieging Gibbethon.",
      "links": "<a href='/AIV/11/16/9-10'>1 Kgs. 16:9-10</a>",
      "comment": "Plots and assassination mark Israel’s instability. Human intrigue cannot substitute for the Lord’s chosen way."
    },
    {
      "pk": 11015028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 28,
      "text": "Baasha killed him in the third year of Asa king of Judah, and reigned in his place.",
      "links": "<a href='/AIV/11/15/33'>1 Kgs. 15:33</a>",
      "comment": "Power is seized by violence, showing the consequences of spiritual infidelity."
    },
    {
      "pk": 11015029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 29,
      "text": "As soon as he became king, Baasha destroyed all the house of Jeroboam. He did not leave Jeroboam any survivors, but wiped them out completely, as the LORD had spoken by His servant Ahijah the Shilonite.",
      "links": "<a href='/AIV/11/14/9-14'>1 Kgs. 14:9-14</a>",
      "comment": "Prophecy fulfilled demonstrates the reliability of God’s word. God’s justice works in history for ultimate good."
    },
    {
      "pk": 11015030,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 30,
      "text": "This happened because of the sins of Jeroboam, which he committed and made Israel commit, because he provoked the LORD, the God of Israel, to anger.",
      "links": "<a href='/AIV/11/14/16'>1 Kgs. 14:16</a>",
      "comment": "Judgment falls for leading others into sin, underscoring the seriousness of spiritual leadership. The true Shepherd guides rightly, fulfilling prophecy and promise."
    },
    {
      "pk": 11015031,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 31,
      "text": "The rest of the acts of Nadab, and all he did, are written in the Book of the Chronicles of the Kings of Israel.",
      "links": "<a href='/AIV/13/10/13-14'>1 Chr. 10:13-14</a>",
      "comment": "Historical notation invites deeper study and integration of Scripture."
    },
    {
      "pk": 11015032,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 32,
      "text": "There was war between Asa and Baasha king of Israel all their days.",
      "links": "<a href='/AIV/14/16/1'>2 Chr. 16:1</a>",
      "comment": "Ongoing division emphasizes the need for unity that comes from spiritual renewal."
    },
    {
      "pk": 11015033,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 33,
      "text": "Baasha son of Ahijah became king over all Israel at Tirzah in the third year of Asa king of Judah, and he reigned twenty-four years.",
      "links": "<a href='/AIV/11/16/8'>1 Kgs. 16:8</a>",
      "comment": "The duration of Baasha’s rule marks a time of relative stability, yet spiritual struggle persists."
    },
    {
      "pk": 11015034,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 15,
      "verse": 34,
      "text": "He did evil in the sight of the LORD and walked in the way of Jeroboam, and in his sin which he made Israel to commit.",
      "links": "<a href='/AIV/11/12/30'>1 Kgs. 12:30</a>; <a href='/AIV/11/16/2'>1 Kgs. 16:2</a>",
      "comment": "Persistent disobedience leads to downfall. Faithfulness to God is the mark of true leadership, which is perfectly realized in Jesus Christ, the King who alone restores all division."
    }
  ],
  "translatedAt": "2025-12-24T03:37:10.371Z"
}