{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 13,
  "verses": [
    {
      "pk": 11013001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 1,
      "text": "Suddenly, a man of God came from Judah to Bethel by the word of the LORD. Jeroboam was standing by the altar to burn incense.",
      "links": "<a href='/AIV/12/23/16-18'>2 Kgs 23:16-18</a>",
      "comment": "The phrase 'by the word of the LORD' highlights his prophetic authority, with a direct mission from God. This sets the scene for the confrontation against false worship at Bethel."
    },
    {
      "pk": 11013002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 2,
      "text": "He cried out against the altar by the word of the LORD: 'Altar, altar! This is what the LORD says: “Look, a son will be born to the house of David, Josiah by name, and he will sacrifice on you the priests of the high places who burn incense on you. Human bones will be burned on you.”'",
      "links": "<a href='/AIV/12/23/15-20'>2 Kgs 23:15-20</a>",
      "comment": "The prophecy is fulfilled in Josiah centuries later, showing God's control over history. Reference to burning bones highlights the rejection of illegitimate worship and priesthood, foreshadowing a restoration of proper divine worship."
    },
    {
      "pk": 11013003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 3,
      "text": "And on that day he gave a sign, saying, 'This is the sign that the LORD has spoken: The altar will be split apart, and the ashes that are on it will be poured out.'",
      "links": "<a href='/AIV/7/6/17-21'>Judg. 6:17-21</a>; <a href='/AIV/12/23/15'>2 Kgs 23:15</a>",
      "comment": "A sign authenticates the prophet’s message, similar to miracles and signs given to confirm a divine message throughout salvation history."
    },
    {
      "pk": 11013004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 4,
      "text": "When King Jeroboam heard the words of the man of God, as he cried out against the altar at Bethel, he stretched out his hand from the altar, saying, 'Seize him!' But his hand, which he stretched out against him, dried up, so that he could not pull it back to himself.",
      "links": "<a href='/AIV/19/105/15'>Ps. 105:15</a>",
      "comment": "God immediately intervenes to protect His messenger. Judgment on Jeroboam underscores the seriousness of opposing God’s appointed representative."
    },
    {
      "pk": 11013005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 5,
      "text": "The altar was also split apart, and the ashes were poured out from the altar, according to the sign that the man of God had given by the word of the LORD.",
      "links": "<a href='/AIV/2/7/5'>Ex. 7:5</a>",
      "comment": "The fulfillment of the sign confirms the authenticity of the prophecy and affirms that false worship is powerless before God’s word."
    },
    {
      "pk": 11013006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 6,
      "text": "Then the king said to the man of God, 'Please intercede with the LORD your God, and pray for me so that my hand may be healed.' So the man of God interceded with the LORD, and the king's hand was restored, and became as it was before.",
      "links": "<a href='/AIV/4/12/13'>Num. 12:13</a>; <a href='/AIV/11/17/22'>1 Kgs 17:22</a>",
      "comment": "The request for intercession highlights the God-given authority of the prophet. The concept of mediators and intercessory prayer plays a crucial role in salvation history, foreshadowing the role of saints and the need for ordained leadership."
    },
    {
      "pk": 11013007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 7,
      "text": "The king said to the man of God, 'Come home with me and refresh yourself. I will give you a reward.'",
      "links": "<a href='/AIV/14/18/4'>2 Chr 18:4</a>",
      "comment": "Jeroboam attempts to offer hospitality and a reward—something which could compromise the prophet’s divine mission. Reminiscent of temptations faced by Christ, where staying true to divine instructions is paramount."
    },
    {
      "pk": 11013008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 8,
      "text": "But the man of God said to the king, 'Even if you gave me half your house, I would not go with you, nor would I eat bread or drink water in this place.'",
      "links": "<a href='/AIV/1/14/17'>Gen. 14:17</a>; <a href='/AIV/40/4/4'>Matt. 4:4</a>",
      "comment": "His refusal emphasizes obedience to God over earthly rewards, recalling how Christ refused temptations in the wilderness."
    },
    {
      "pk": 11013009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 9,
      "text": "'For this is what I was commanded by the word of the LORD: “You shall not eat bread or drink water or return by the way you came.”'",
      "links": "<a href='/AIV/19/119/3'>Ps. 119:3</a>",
      "comment": "God’s command is absolute and entails detachment from the false worship at Bethel; a call to purity, separation, and obedience, reminiscent of vows and ascetic discipline."
    },
    {
      "pk": 11013010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 10,
      "text": "So he went another way and did not return by the way he had come to Bethel.",
      "links": "<a href='/AIV/5/12/31'>Deut. 12:31</a>",
      "comment": "The prophet's obedience is a mark of genuine faith, an essential virtue in those who are entrusted with divine missions."
    },
    {
      "pk": 11013011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 11,
      "text": "Now there was an old prophet living in Bethel. His sons came and told him all that the man of God had done that day in Bethel; they also told their father the words he had spoken to the king.",
      "links": "<a href='/AIV/12/2/3'>2 Kgs 2:3</a>",
      "comment": "This introduces another prophet, adding complexity to the narrative. The old prophet’s presence may imply the continued existence of revelation even amidst apostasy."
    },
    {
      "pk": 11013012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 12,
      "text": "'Which way did he go?' their father asked them. So his sons showed him the road which the man of God from Judah had taken.",
      "links": "<a href='/AIV/9/9/6'>1 Sam 9:6</a>",
      "comment": "The old prophet’s curiosity may indicate a desire to understand the message, or perhaps a motive born from envy or concern."
    },
    {
      "pk": 11013013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 13,
      "text": "He said to his sons, 'Saddle the donkey for me.' So they saddled the donkey, and he rode on it.",
      "links": "<a href='/AIV/10/16/1-2'>2 Sam 16:1-2</a>",
      "comment": "Donkeys are often used for travel by prophets and leaders in the Old Testament, symbolizing humility."
    },
    {
      "pk": 11013014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 14,
      "text": "He went after the man of God and found him sitting under an oak tree. He said to him, 'Are you the man of God who came from Judah?' He answered, 'I am.'",
      "links": "<a href='/AIV/1/18/1'>Gen. 18:1</a>",
      "comment": "Meeting under a tree may hint at an ancient place of religious encounter—as with Abraham at the oaks of Mamre—and reinforces the prophet’s authenticity."
    },
    {
      "pk": 11013015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 15,
      "text": "Then he said to him, 'Come home with me and eat bread.'",
      "links": "<a href='/AIV/1/18/5'>Gen. 18:5</a>",
      "comment": "Food and hospitality in Scripture often carry symbolic spiritual meaning, representing fellowship and covenant."
    },
    {
      "pk": 11013016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 16,
      "text": "But he said, 'I cannot go back with you or eat bread or drink water with you in this place.'",
      "links": "<a href='/AIV/1/39/9-10'>Gen. 39:9-10</a>",
      "comment": "The prophet’s refusal echoes the steadfastness required in maintaining God’s command, even when tested by fellow believers."
    },
    {
      "pk": 11013017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 17,
      "text": "'For I was told by the word of the LORD, “You shall not eat bread or drink water there. Do not return by the way you came.”'",
      "links": "<a href='/AIV/5/27/9-10'>Deut. 27:9-10</a>",
      "comment": "Repeating the divine command, the prophet demonstrates single-minded devotion to God’s instructions."
    },
    {
      "pk": 11013018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 18,
      "text": "He replied, 'I too am a prophet as you are, and an angel spoke to me by the word of the LORD, saying, “Bring him back with you to your house so that he may eat bread and drink water.”' But he was lying to him.",
      "links": "<a href='/AIV/9/28/6-7'>1 Sam 28:6-7</a>; <a href='/AIV/48/1/8'>Gal. 1:8</a>",
      "comment": "The narrative warns against false revelations and the subtle dangers even from within religious circles, stressing discernment and faithfulness to original revelation—a lesson echoed by the Church Fathers."
    },
    {
      "pk": 11013019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 19,
      "text": "So he went back with him, and ate bread in his house and drank water.",
      "links": "<a href='/AIV/41/14/72'>Mark 14:72</a>",
      "comment": "The man of God’s failure reveals human weakness, even among God’s elect—a recurring biblical theme."
    },
    {
      "pk": 11013020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 20,
      "text": "As they were sitting at the table, the word of the LORD came to the prophet who had brought him back.",
      "links": "<a href='/AIV/1/18/9-10'>Gen. 18:9-10</a>",
      "comment": "Divine messages sometimes come in surprising ways, including through those who previously erred. God’s sovereignty is evident."
    },
    {
      "pk": 11013021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 21,
      "text": "He cried out to the man of God who came from Judah, 'This is what the LORD says: “Because you have disobeyed the mouth of the LORD, and have not kept the command which the LORD your God commanded you,”'",
      "links": "<a href='/AIV/1/3/11'>Gen. 3:11</a>;",
      "comment": "The emphasis on 'mouth of the LORD' stresses the authority of God’s direct command. Disobedience in sacred matters has serious consequences."
    },
    {
      "pk": 11013022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 22,
      "text": "'...but you came back and ate bread and drank water in the place where He said to you, “Do not eat bread and do not drink water.” Your body shall not be buried in the tomb of your fathers.'",
      "links": "<a href='/AIV/24/22/19'>Jer. 22:19</a>",
      "comment": "Not being buried with one’s ancestors indicates judgment. Spiritual consequences can be both present and eternal."
    },
    {
      "pk": 11013023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 23,
      "text": "After he had eaten and drunk, the prophet who had brought him back saddled the donkey for him.",
      "links": "<a href='/AIV/9/13/3'>1 Sam. 13:3</a>",
      "comment": "The narrative moves swiftly, suggesting the prophet’s fate is imminent. The motif of journey carries symbolic weight in biblical literature."
    },
    {
      "pk": 11013024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 24,
      "text": "He went on his way, and a lion met him on the road and killed him. His body was left on the road, with the donkey and the lion standing beside it.",
      "links": "<a href='/AIV/20/13/20'>Prov. 13:20</a>",
      "comment": "The strange coexistence of donkey and lion at the body testifies to a supernatural judgment—no random event, but divine intervention."
    },
    {
      "pk": 11013025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 25,
      "text": "Some men passed by and saw the body lying there, with the lion standing beside the body. So they went and told it in the city where the old prophet lived.",
      "links": "<a href='/AIV/12/2/16'>2 Kgs 2:16</a>",
      "comment": "The witness ensures the story’s continuation among the people, emphasizing the public nature of God’s judgment and the importance of testimony."
    },
    {
      "pk": 11013026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 26,
      "text": "When the prophet who had brought him back from the way heard of it, he said, 'It is the man of God who disobeyed the word of the LORD. The LORD has given him to the lion, which has torn him and killed him, as the word of the LORD had spoken to him.'",
      "links": "<a href='/AIV/9/28/19-20'>1 Sam 28:19-20</a>",
      "comment": "God’s word stands true, and even prophets are not exempt from its consequences. This underlines the seriousness of obedience within the spiritual life."
    },
    {
      "pk": 11013027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 27,
      "text": "Then he said to his sons, 'Saddle the donkey for me.' So they saddled it.",
      "links": "<a href='/AIV/10/16/1-2'>2 Sam 16:1-2</a>",
      "comment": "A repeated act often signals urgency or importance in the narrative."
    },
    {
      "pk": 11013028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 28,
      "text": "He went out and found the body lying on the road, with the donkey and the lion standing beside the body. The lion had neither eaten the body nor torn the donkey.",
      "links": "<a href='/AIV/19/34/10'>Ps. 34:10</a>",
      "comment": "This detail reinforces the supernatural nature of the event—the lion acts only according to the judgment permitted by God."
    },
    {
      "pk": 11013029,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 29,
      "text": "The prophet took the body of the man of God, laid it on the donkey, and brought it back. He came to the city to mourn and to bury him.",
      "links": "<a href='/AIV/1/50/14'>Gen. 50:14</a>",
      "comment": "Mourning and burial rites in Scripture underscore the dignity of life and the respect for those called by God, even in judgment."
    },
    {
      "pk": 11013030,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 30,
      "text": "He laid his body in his own grave, and they mourned over him, saying, “Alas, my brother!”",
      "links": "<a href='/AIV/1/37/35'>Gen. 37:35</a>",
      "comment": "Calling him 'brother' speaks to the spiritual kinship among those serving God, hinting at unity in faith and hope despite weakness."
    },
    {
      "pk": 11013031,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 31,
      "text": "After burying him, he said to his sons, 'When I die, bury me in the grave where the man of God is buried. Lay my bones beside his bones.'",
      "links": "<a href='/AIV/12/13/21'>2 Kgs 13:21</a>",
      "comment": "Desire to be buried near a holy person reflects reverence for sanctity, foreshadowing later practices regarding holy relics and places of martyrdom."
    },
    {
      "pk": 11013032,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 32,
      "text": "'For the message that he proclaimed by the word of the LORD against the altar in Bethel, and against all the shrines in the towns of Samaria, will surely come to pass.'",
      "links": "<a href='/AIV/12/23/19-20'>2 Kgs 23:19-20</a>",
      "comment": "Acknowledging the enduring truthfulness of prophetic word foreshadows the authority of apostolic and prophetic witness in the life of the community of faith."
    },
    {
      "pk": 11013033,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 33,
      "text": "Even after this, Jeroboam did not turn away from his evil way, but again appointed priests from all sorts of people for the high places. Anyone who wanted to, he consecrated to be priests of high places.",
      "links": "<a href='/AIV/3/8/1-18'>Lev. 8:1-18</a>; <a href='/AIV/9/2/28'>1 Sam 2:28</a>",
      "comment": "The appointment of unqualified priests undermines true worship and authority. Proper ordination is crucial for valid service at the altar, a principle echoed throughout Scripture and tradition."
    },
    {
      "pk": 11013034,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 13,
      "verse": 34,
      "text": "This was the sin of the house of Jeroboam, leading to its destruction and being wiped out from the face of the earth.",
      "links": "<a href='/AIV/11/14/10'>1 Kgs 14:10</a>; <a href='/AIV/28/1/4'>Hos 1:4</a>",
      "comment": "Persistent false worship leads to judgment and removal from God’s blessing—a warning to remain in faithful worship and obedience. See <a href='/AIV/19/106/36-39'>Ps 106:36-39</a>."
    }
  ],
  "translatedAt": "2025-12-24T03:36:02.581Z"
}