{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 17,
  "verses": [
    {
      "pk": 11017001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 1,
      "text": "Now Elijah the Tishbite, from Tishbe in Gilead, said to Ahab, 'As the LORD, the God of Israel, lives, before whom I stand, there will be neither dew nor rain these years, except by my word.'",
      "links": "<a href='/AIV/59/5/17'>Jas. 5:17</a>; <a href='/AIV/05/11/16-17'>Deut. 11:16-17</a>",
      "comment": "Elijah powerfully invokes the living God and declares a drought as judgment on idolatry. See James 5:17, where Elijah’s prayer is referenced as a model for effective, righteous intercession. This reveals the intercessory role that righteous men can play, foreshadowing the New Testament understanding of mediation and prayer."
    },
    {
      "pk": 11017002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 2,
      "text": "Then the word of the LORD came to him, saying,",
      "links": "<a href='/AIV/24/1/2'>Jer. 1:2</a>",
      "comment": "God often gives instructions directly to His prophets, demonstrating both guidance and providence. Note how true prophets receive and pass on the divine word, aligning with the historic tradition of God speaking through His chosen leaders."
    },
    {
      "pk": 11017003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 3,
      "text": "'Go away from here and turn eastward, and hide yourself by the brook Kerith, which is east of the Jordan.'",
      "links": "<a href='/AIV/19/32/7'>Ps. 32:7</a>",
      "comment": "Elijah is told to hide, indicating periods where faithfulness involves withdrawal and trust in God’s provision. Such divine hiding recalls the spiritual principle of retreat for prayer and preparation."
    },
    {
      "pk": 11017004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 4,
      "text": "'You will drink from the brook, and I have commanded the ravens to provide for you there.'",
      "links": "<a href='/AIV/19/104/27'>Ps. 104:27</a>; <a href='/AIV/40/6/26'>Matt. 6:26</a>",
      "comment": "God’s sovereignty over all creation is shown by His command even of the ravens. Jesus later uses birds as illustrations of God’s providence (Matt. 6:26), pointing to trust in the Father’s care."
    },
    {
      "pk": 11017005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 5,
      "text": "So he went and did according to the word of the LORD; he went and lived by the brook Kerith, which is east of the Jordan.",
      "links": "<a href='/AIV/01/22/3'>Gen. 22:3</a>",
      "comment": "Elijah’s obedience is unwavering, echoing the faith of Abraham. Obedience to God’s word, even when difficult, is a recurring call both in Old and New Testament faithfulness."
    },
    {
      "pk": 11017006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 6,
      "text": "The ravens brought him bread and meat in the morning, and bread and meat in the evening, and he drank from the brook.",
      "links": "<a href='/AIV/02/16/4'>Ex. 16:4</a>; <a href='/AIV/19/78/24'>Ps. 78:24</a>",
      "comment": "Miraculous provision parallels how God fed Israel in the wilderness with manna and quail, highlighting the enduring theme of divine sustenance in times of need."
    },
    {
      "pk": 11017007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 7,
      "text": "After some time, the brook dried up, because there was no rain in the land.",
      "links": "<a href='/AIV/24/14/1-6'>Jer. 14:1-6</a>",
      "comment": "Even in God’s plan miraculous provision may falter, teaching trust amidst change, and showing God’s power over nature and history."
    },
    {
      "pk": 11017008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 8,
      "text": "Then the word of the LORD came to him, saying,",
      "links": "<a href='/AIV/09/3/21'>1 Sam. 3:21</a>",
      "comment": "The repetition emphasizes God’s direct guidance and the importance of listening, a theme carried forward in scripture as part of authentic discipleship."
    },
    {
      "pk": 11017009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 9,
      "text": "'Arise, go to Zarephath, which belongs to Sidon, and live there. Behold, I have commanded a widow there to provide for you.'",
      "links": "<a href='/AIV/42/4/25-26'>Luke 4:25-26</a>",
      "comment": "God chooses an unlikely gentile widow as Elijah’s provider, foreshadowing the inclusion of the nations and God’s miraculous work among the humble. Jesus highlights this event as significant (Luke 4:25-26)."
    },
    {
      "pk": 11017010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 10,
      "text": "So he arose and went to Zarephath. When he came to the entrance of the city, there was a widow gathering sticks, and he called to her and said, 'Please bring me a little water in a vessel, that I may drink.'",
      "links": "<a href='/AIV/19/146/9'>Ps. 146:9</a>",
      "comment": "God’s instructions often require faith and action. Elijah's spoken request echoes the hospitality expected by God’s people and God’s special care for widows and the poor."
    },
    {
      "pk": 11017011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 11,
      "text": "As she was going to get it, he called to her and said, 'Please bring me a piece of bread in your hand.'",
      "links": "<a href='/AIV/40/10/42'>Matt. 10:42</a>",
      "comment": "Elijah’s second request further illustrates hospitality and the blessing on those who serve God’s messengers, as also taught by Jesus (Matt. 10:42)."
    },
    {
      "pk": 11017012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 12,
      "text": "But she said, 'As the LORD your God lives, I have no bread, only a handful of flour in a jar and a little oil in a jug. I am gathering a couple of sticks, that I may go in and prepare it for myself and my son, that we may eat it and die.'",
      "links": "<a href='/AIV/09/1/15-16'>1 Sam. 1:15-16</a>",
      "comment": "The widow’s dire condition underlines the gravity of the drought. Her reference to ‘the LORD your God’ shows her openness to faith, despite her foreignness."
    },
    {
      "pk": 11017013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 13,
      "text": "Elijah said to her, 'Do not be afraid. Go and do as you have said, but first make a small cake for me from it, and bring it to me; and afterwards make some for you and your son.'",
      "links": "<a href='/AIV/40/6/33'>Matt. 6:33</a>; <a href='/AIV/19/37/25'>Ps. 37:25</a>",
      "comment": "Elijah’s request to provide for him first is a test of faith reminiscent of the call to seek God’s kingdom first. True faith is demonstrated in sacrificial trust and prioritizing God’s messenger."
    },
    {
      "pk": 11017014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 14,
      "text": "'For thus says the LORD, the God of Israel: “The jar of flour will not be used up, and the jug of oil will not run dry, until the day the LORD sends rain on the land.”'",
      "links": "<a href='/AIV/47/9/8-10'>2 Cor. 9:8-10</a>",
      "comment": "God’s promise of ongoing provision recalls the miraculous supply seen throughout the Bible, showing He sustains those who trust and obey Him."
    },
    {
      "pk": 11017015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 15,
      "text": "So she went away and did according to the word of Elijah. And she and he and her household ate for many days.",
      "links": "<a href='/AIV/58/11/7'>Heb. 11:7</a>; <a href='/AIV/40/14/19-21'>Matt. 14:19-21</a>",
      "comment": "Obedience brings a blessing for the entire household—mirroring the way God’s blessings through faith can extend beyond the individual."
    },
    {
      "pk": 11017016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 16,
      "text": "The jar of flour was not used up, nor did the jug of oil run dry, according to the word of the LORD spoken by Elijah.",
      "links": "<a href='/AIV/40/6/11'>Matt. 6:11</a>; <a href='/AIV/50/4/19'>Phil. 4:19</a>",
      "comment": "A continuous miracle illustrates God’s ongoing providence—fulfilling daily needs anticipates Jesus’ teaching on daily bread. The perpetual supply hints at God’s ability to work wonders through the faith of His saints."
    },
    {
      "pk": 11017017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 17,
      "text": "After these things, the son of the woman who owned the house became ill; his illness was so severe that there was no breath left in him.",
      "links": "<a href='/AIV/42/7/12'>Luke 7:12</a>",
      "comment": "Human suffering persists even amid God’s blessings. The scene parallels later resurrection miracles, preparing the way for Christ's authority over death."
    },
    {
      "pk": 11017018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 18,
      "text": "She said to Elijah, 'What have I to do with you, man of God? Have you come to bring my sin to remembrance and kill my son?'",
      "links": "<a href='/AIV/42/5/8'>Luke 5:8</a>",
      "comment": "The widow interprets tragedy as divine judgment for sin, acknowledging God’s holiness. Similar sentiments are found in Peter’s encounter with Jesus in Luke 5:8."
    },
    {
      "pk": 11017019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 19,
      "text": "But he said to her, 'Give me your son.' So he took him from her arms and carried him to the upper room where he was staying, and laid him on his own bed.",
      "links": "<a href='/AIV/44/9/39-40'>Acts 9:39-40</a>",
      "comment": "Elijah acts as a mediator, interceding physically and spiritually for the widow. This act foreshadows priestly intercession and later apostolic miracles, as performed by Peter."
    },
    {
      "pk": 11017020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 20,
      "text": "He cried out to the LORD and said, 'O LORD my God, have You brought tragedy even upon the widow with whom I lodge, by killing her son?'",
      "links": "<a href='/AIV/19/13/1'>Ps. 13:1</a>",
      "comment": "Honest lament and prayer are not forbidden; God welcomes authentic intercession and even questions. Elijah’s prayer establishes a model of fervent, priestly mediation."
    },
    {
      "pk": 11017021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 21,
      "text": "He stretched himself upon the child three times and called to the LORD, 'O LORD my God, let this child’s life return to him!'",
      "links": "<a href='/AIV/12/4/34-35'>2 Kgs. 4:34-35</a>; <a href='/AIV/41/5/41-42'>Mark 5:41-42</a>",
      "comment": "Elijah’s bodily prayer, repeated three times, hints at sacramental, physical intercession. The triple action may also anticipate Trinitarian realities revealed later in salvation history. This finds its echo in Jesus and the apostles’ miracles of resurrection."
    },
    {
      "pk": 11017022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 22,
      "text": "The LORD listened to the voice of Elijah, and the life of the child returned to him, and he revived.",
      "links": "<a href='/AIV/58/11/35'>Heb. 11:35</a>; <a href='/AIV/44/20/10-12'>Acts 20:10-12</a>",
      "comment": "God answering Elijah’s prayer shows the power of righteous intercession. Hebrews 11:35 and similar passages in the New Testament recall such resurrection miracles as signs of God’s dominion over life and death."
    },
    {
      "pk": 11017023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 23,
      "text": "Elijah took the child, brought him down from the upper room into the house, and delivered him to his mother. And Elijah said, 'See, your son lives.'",
      "links": "<a href='/AIV/42/7/14-15'>Luke 7:14-15</a>",
      "comment": "Elijah’s restoration of the child to his mother parallels Jesus’ later miracles, foreshadowing Christ’s victory over death and His pastoral care for families."
    },
    {
      "pk": 11017024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 17,
      "verse": 24,
      "text": "Then the woman said to Elijah, 'Now I know that you are a man of God, and that the word of the LORD in your mouth is truth.'",
      "links": "<a href='/AIV/43/17/17'>John 17:17</a>",
      "comment": "The widow’s confession affirms that authentic miracles confirm the truth of one’s message. Jesus, as the ultimate prophet, priest, and king, also authenticated authority by signs, leading His followers to recognize the fullness of revealed truth."
    }
  ],
  "translatedAt": "2025-12-24T03:38:30.595Z"
}