{
  "book": 11,
  "bookName": "1 Kings",
  "bookAbbreviation": "1Kgs",
  "chapter": 9,
  "verses": [
    {
      "pk": 11009001,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 1,
      "text": "When Solomon had finished building the house of the Lord, the king’s house, and all that Solomon had desired to make,",
      "links": "<a href='/AIV/10/7/1'>2 Sam. 7:1</a>; <a href='/AIV/11/6/1'>1 Kgs 6:1</a>",
      "comment": "The passage opens by emphasizing Solomon’s completion of the Temple, fulfilling his father David’s desire (2 Samuel 7:1-13). The construction represents the dwelling of God among His people, a strong typology connecting the Old Testament Tabernacle (Exodus 25:8) and the fulfillment in Christ as God dwelling among us (John 1:14)."
    },
    {
      "pk": 11009002,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 2,
      "text": "the Lord appeared to Solomon a second time, just as He had appeared to him at Gibeon.",
      "links": "<a href='/AIV/11/3/5'>1 Kgs 3:5</a>; <a href='/AIV/02/29/42'>Ex. 29:42</a>",
      "comment": "God’s second appearance to Solomon (first: 1 Kings 3:5) echoes God’s covenantal communication. Divine appearances affirm the important role of prophetic vision and God’s direction in sacred architecture."
    },
    {
      "pk": 11009003,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 3,
      "text": "And the Lord said to him, \"I have heard your prayer and your plea which you have made before Me; I have consecrated this house which you have built, to put My Name there forever, and My eyes and My heart will be there for all time.\"",
      "links": "<a href='/AIV/11/8/28-30'>1 Kgs 8:28-30</a>; <a href='/AIV/14/7/12-16'>2 Chr. 7:12-16</a>",
      "comment": "God confirms He has consecrated the Temple, making it the center of worship for His people. The assurance that His ‘eyes and heart’ are perpetually present points to His abiding presence and the importance of sacred places in worship. This anticipates Christ’s promise of being present in the gathering of believers (Matt 18:20)."
    },
    {
      "pk": 11009004,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 4,
      "text": "\"As for you, if you walk before Me as David your father walked, with integrity of heart and uprightness, doing according to all that I have commanded you, and keeping My statutes and My ordinances,",
      "links": "<a href='/AIV/11/3/14'>1 Kgs 3:14</a>; <a href='/AIV/10/7/12'>2 Sam. 7:12</a>",
      "comment": "This conditional promise ties the king’s faithfulness to God’s commands with the enduring stability of the kingdom. David’s role as a model for leadership and the importance of passing down covenant fidelity alludes spiritually to apostolic succession and continuity."
    },
    {
      "pk": 11009005,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 5,
      "text": "then I will establish the throne of your kingdom over Israel forever, just as I promised David your father, saying, ‘You shall not lack a man on the throne of Israel.’",
      "links": "<a href='/AIV/10/7/16'>2 Sam. 7:16</a>; <a href='/AIV/19/89/3-4'>Ps. 89:3-4</a>",
      "comment": "The promise of an unending dynasty fulfills the Davidic covenant, foreshadowing the coming of the Messiah (Luke 1:32-33). The reference to an eternal kingdom connects to the Church as the continuation of David’s throne through Christ."
    },
    {
      "pk": 11009006,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 6,
      "text": "\"But if you or your sons at all turn away from following Me, and do not keep My commandments and My statutes which I have set before you, but go and serve other gods and worship them,",
      "links": "<a href='/AIV/05/28/15'>Deut. 28:15</a>; <a href='/AIV/03/26/14'>Lev. 26:14</a>",
      "comment": "A warning is given about covenant unfaithfulness. The Old Testament consistently links obedience with blessings and disobedience with curses. Spiritual idolatry remains a danger for the people of God in every age."
    },
    {
      "pk": 11009007,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 7,
      "text": "then I will cut off Israel from the land which I have given them; and this house which I have consecrated for My Name I will cast out of My sight, and Israel will become a proverb and a byword among all peoples.",
      "links": "<a href='/AIV/23/64/10-11'>Isa. 64:10-11</a>; <a href='/AIV/24/7/12-14'>Jer. 7:12-14</a>",
      "comment": "The severe consequences of national apostasy are stated. The Temple’s desecration prefigures both the exile and the greater warning against abandoning divine truth. The loss of God’s presence is always depicted as spiritual tragedy."
    },
    {
      "pk": 11009008,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 8,
      "text": "And this house will be exalted; yet everyone who passes by it will be astonished and will hiss and say, ‘Why has the Lord done such things to this land and to this house?’",
      "links": "<a href='/AIV/24/22/8-9'>Jer. 22:8-9</a>; <a href='/AIV/19/74/7'>Ps. 74:7</a>",
      "comment": "The prophecy of the Temple’s coming desolation points to future judgments (see Jeremiah 22:8-9). Architectural grandeur is not enough—faithfulness is required. The visible signs of tragedy are warnings for all generations."
    },
    {
      "pk": 11009009,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 9,
      "text": "Then they will answer, ‘Because they abandoned the Lord their God, who brought their ancestors out of the land of Egypt, and have embraced other gods and worshiped and served them. That is why the Lord has brought all this disaster upon them.’\"",
      "links": "<a href='/AIV/02/20/2-6'>Ex. 20:2-6</a>; <a href='/AIV/05/29/25-28'>Deut. 29:25-28</a>",
      "comment": "The root cause of calamity is unfaithfulness to the Lord who redeems. The Exodus is recalled as the foundational act of salvation history, a foreshadowing of Christ’s redemption from spiritual bondage. Corporate fidelity is central to receiving blessings."
    },
    {
      "pk": 11009010,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 10,
      "text": "At the end of twenty years, during which Solomon built the two houses, the house of the Lord and the king’s house,",
      "links": "<a href='/AIV/11/6/38'>1 Kgs 6:38</a>; <a href='/AIV/11/7/1'>1 Kgs 7:1</a>",
      "comment": "Solomon’s dual projects signify both the sacred and the royal. The passage chronicles devotion to both God and the temporal realm, foreshadowing the importance of stewardship and order in Christian leadership."
    },
    {
      "pk": 11009011,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 11,
      "text": "Hiram king of Tyre had supplied Solomon with cedar and cypress timber and gold, as much as Solomon desired, so King Solomon gave to Hiram twenty cities in the land of Galilee.",
      "links": "<a href='/AIV/11/5/9-11'>1 Kgs 5:9-11</a>; <a href='/AIV/10/8/10'>2 Sam. 8:10</a>",
      "comment": "The relationship with Hiram marks international cooperation in building the Temple, prefiguring the universal nature of worship and collaboration among nations, and an early hint of God’s plan for a people beyond Israel (see Isaiah 49:6)."
    },
    {
      "pk": 11009012,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 12,
      "text": "But Hiram came from Tyre to see the cities Solomon had given him, and they did not please him.",
      "links": "<a href='/AIV/06/21/32-34'>Josh. 21:32-34</a>",
      "comment": "Hiram’s disappointment with the cities alludes to the incomplete satisfaction found in earthly pursuits. It also highlights the enduring value of spiritual rather than merely material inheritance."
    },
    {
      "pk": 11009013,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 13,
      "text": "So he said, \"What are these cities that you have given me, my brother?\" And he called them the land of Cabul, as they are called to this day.",
      "links": "<a href='/AIV/06/19/27'>Josh. 19:27</a>",
      "comment": "‘Cabul’ means ‘good for nothing,’ reflecting Hiram’s sentiment. This cultural exchange highlights the boundaries between earthly authority and divine promise."
    },
    {
      "pk": 11009014,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 14,
      "text": "And Hiram had sent to the king one hundred and twenty talents of gold.",
      "links": "<a href='/AIV/11/10/10'>1 Kgs 10:10</a>; <a href='/AIV/11/7/51'>1 Kgs 7:51</a>",
      "comment": "The vast wealth exchanged demonstrates the opulence achieved under Solomon, yet the spiritual tone of the passage increasingly reminds of the fleetingness of earthly riches (Matt 6:19-21)."
    },
    {
      "pk": 11009015,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 15,
      "text": "This is the account of the forced labor which King Solomon raised to build the house of the Lord, his own house, the Millo, the wall of Jerusalem, Hazor, Megiddo, and Gezer:",
      "links": "<a href='/AIV/11/5/13-16'>1 Kgs 5:13-16</a>; <a href='/AIV/11/11/28'>1 Kgs 11:28</a>",
      "comment": "Forced labor recalls the cost of national projects. The Millo and major cities signify Solomon’s administrative vision, which can draw a spiritual parallel to building up the community of faith."
    },
    {
      "pk": 11009016,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 16,
      "text": "Pharaoh king of Egypt had come up and captured Gezer, burned it with fire, and killed the Canaanites who lived in the city, and gave it as a dowry to his daughter, Solomon’s wife.",
      "links": "<a href='/AIV/11/3/1'>1 Kgs 3:1</a>; <a href='/AIV/06/16/10'>Josh. 16:10</a>",
      "comment": "Gezer’s history, now part of Solomon’s domain, reflects the mingling of royal families and the geopolitics shaping Israel. Marriage alliances prefigure unity through covenant relationship."
    },
    {
      "pk": 11009017,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 17,
      "text": "So Solomon rebuilt Gezer, Lower Beth-horon,",
      "links": "<a href='/AIV/06/10/10'>Josh. 10:10</a>",
      "comment": "Solomon’s reconstruction efforts demonstrate wise stewardship and preparation, echoing principles of building up the faithful community both physically and spiritually."
    },
    {
      "pk": 11009018,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 18,
      "text": "Baalath, and Tamar in the wilderness, in the land of Judah,",
      "links": "<a href='/AIV/06/19/44'>Josh. 19:44</a>; <a href='/AIV/13/8/6'>1 Chr. 8:6</a>",
      "comment": "The capture and construction of these cities demonstrates extending influence, playing a typological role in gathering the people under one leadership."
    },
    {
      "pk": 11009019,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 19,
      "text": "and all the store cities that Solomon had, and the cities for his chariots, and the cities for his horsemen, and whatever Solomon desired to build in Jerusalem, in Lebanon, and throughout all the land of his dominion.",
      "links": "<a href='/AIV/11/4/26'>1 Kgs 4:26</a>",
      "comment": "Solomon’s wide-scale projects point to the pursuit of excellence and order, reflecting God’s creative work and the proper use of gifts for service."
    },
    {
      "pk": 11009020,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 20,
      "text": "All the people who were left of the Amorites, Hittites, Perizzites, Hivites, and Jebusites, who were not of the children of Israel—",
      "links": "<a href='/AIV/07/3/5'>Judg. 3:5</a>; <a href='/AIV/02/23/31'>Ex. 23:31</a>",
      "comment": "Solomon’s workforce included non-Israelites from the original inhabitants. This diversity, though it carried risks of syncretism, points to God’s plan to draw the nations to His worship eventually."
    },
    {
      "pk": 11009021,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 21,
      "text": "their descendants who were left in the land, whom the Israelites were not able to utterly destroy—Solomon conscripted them for forced labor to this day.",
      "links": "<a href='/AIV/07/1/28'>Judg. 1:28</a>",
      "comment": "The incomplete conquest reflects the persistent challenge of compromise. Spiritually, it encourages believers to pursue wholehearted devotion, avoiding syncretism."
    },
    {
      "pk": 11009022,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 22,
      "text": "But Solomon did not make slaves of the children of Israel; they were the men of war, his servants, his officials, his captains, his chariot commanders, and his horsemen.",
      "links": "<a href='/AIV/03/25/39'>Lev. 25:39</a>",
      "comment": "Distinction is made between Israelites and others for labor. The dignity accorded to God’s chosen people is highlighted, resonating with the New Testament’s emphasis on the spiritual priesthood (1 Pet 2:9)."
    },
    {
      "pk": 11009023,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 23,
      "text": "These were the chief officers who were over Solomon’s work: five hundred and fifty who had charge of the people who carried out the work.",
      "links": "<a href='/AIV/11/5/16'>1 Kgs 5:16</a>; <a href='/AIV/14/8/10'>2 Chr 8:10</a>",
      "comment": "Order and hierarchy are shown in the administrative structure. This relates to the spiritual principle of authority and leadership, which Jesus established among the apostles."
    },
    {
      "pk": 11009024,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 24,
      "text": "But Pharaoh’s daughter went up from the City of David to her house which Solomon had built for her. Then he constructed the Millo.",
      "links": "<a href='/AIV/11/3/1'>1 Kgs 3:1</a>; <a href='/AIV/11/6/24'>1 Kgs 6:24</a>",
      "comment": "Pharaoh’s daughter and the Millo mark important milestones in Solomon’s reign, connecting royal alliances and strengthening the city. This continues the theme of unity through godly leadership."
    },
    {
      "pk": 11009025,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 25,
      "text": "Three times a year Solomon offered burnt offerings and peace offerings on the altar which he had built for the Lord; he burned incense on the altar before the Lord. So he finished the house.",
      "links": "<a href='/AIV/02/23/14-17'>Ex. 23:14-17</a>; <a href='/AIV/03/6/12'>Lev. 6:12</a>; <a href='/AIV/14/8/13'>2 Chr. 8:13</a>",
      "comment": "The worship festivals reflect the rhythm of liturgical life, and Solomon’s active role underscores the importance of both leadership and sacrifice. These offerings prefigure and foreshadow perpetual worship and sacramental life."
    },
    {
      "pk": 11009026,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 26,
      "text": "King Solomon built a fleet of ships at Ezion-geber, which is near Eloth on the shore of the Red Sea, in the land of Edom.",
      "links": "<a href='/AIV/04/33/35'>Num. 33:35</a>; <a href='/AIV/14/8/17'>2 Chr. 8:17</a>",
      "comment": "Solomon’s reach extended into maritime trade, marking Israel’s expanding influence. This expansion prefigures the universal mission to ‘all nations’ (Matt 28:19)."
    },
    {
      "pk": 11009027,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 27,
      "text": "Hiram sent his servants, sailors who knew the sea, with the fleet to work alongside Solomon’s servants.",
      "links": "<a href='/AIV/11/10/11'>1 Kgs 10:11</a>; <a href='/AIV/14/8/18'>2 Chr. 8:18</a>",
      "comment": "Shared labor between Hiram’s and Solomon’s servants highlights unity in diversity, acting as a type of the gathering of peoples for God’s purposes."
    },
    {
      "pk": 11009028,
      "translation": "AIV",
      "book": 11,
      "bookName": "1 Kings",
      "bookAbbreviation": "1Kgs",
      "chapter": 9,
      "verse": 28,
      "text": "They went to Ophir and brought from there four hundred and twenty talents of gold, and brought it to King Solomon.",
      "links": "<a href='/AIV/11/10/11'>1 Kgs 10:11</a>; <a href='/AIV/14/9/10'>2 Chr. 9:10</a>",
      "comment": "The narrative closes with prosperity through cooperation. The gold from Ophir represents God’s blessing, but also foreshadows the greater riches found in wisdom and faithfulness to God’s covenant."
    }
  ],
  "translatedAt": "2025-12-24T03:33:21.274Z"
}