{
  "book": "Philippians",
  "bookAbbreviation": "Phil",
  "chapter": 3,
  "verses": [
    {
      "pk": 370301,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 1,
      "text": "Finally, my brothers, rejoice in the Lord. To write the same things to you is no trouble for me and is safe for you.",
      "links": "<a href='/AIV/19/97/12'>Ps. 97:12</a>; <a href='/AIV/52/5/16'>1 Thess. 5:16</a>",
      "comment": "Paul reminds believers to rejoice in the Lord, an enduring theme in Christian life. Repetition is important for doctrinal safety—note the value of written tradition."
    },
    {
      "pk": 370302,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 2,
      "text": "Watch out for the dogs, watch out for evil workers, watch out for those who mutilate the flesh.",
      "links": "<a href='/AIV/23/56/10-11'>Isa. 56:10–11</a>; <a href='/AIV/66/22/15'>Rev. 22:15</a>",
      "comment": "Paul cautions against false teachers who rely on circumcision for righteousness. The use of 'dogs' echoes Old Testament warnings against impurity and false doctrine."
    },
    {
      "pk": 370303,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 3,
      "text": "For we are the true circumcision, who worship by the Spirit of God and glory in Christ Jesus and put no confidence in the flesh.",
      "links": "<a href='/AIV/43/4/23'>John 4:23</a>; <a href='/AIV/45/2/28-29'>Rom. 2:28-29</a>",
      "comment": "Paul teaches that true worship is spiritual, not merely ritual. The inward transformation is linked with sacramental realities and spiritual worship, fulfilling Old Testament types."
    },
    {
      "pk": 370304,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 4,
      "text": "Though I myself have reasons for confidence in the flesh. If anyone else thinks he has grounds for confidence in the flesh, I have more:",
      "links": "<a href='/AIV/47/11/18'>2 Cor. 11:18</a>",
      "comment": "Paul sets up his background to show that human credentials do not bring salvation, only grace in Christ."
    },
    {
      "pk": 370305,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 5,
      "text": "circumcised on the eighth day, of the people of Israel, of the tribe of Benjamin, a Hebrew of Hebrews; regarding the law, a Pharisee;",
      "links": "<a href='/AIV/01/17/12'>Gen. 17:12</a>; <a href='/AIV/09/9/21'>1 Sam. 9:21</a>",
      "comment": "Paul lists his Jewish heritage and adherence to the law, emphasizing that even strict observance of ritual cannot compare to knowing Christ."
    },
    {
      "pk": 370306,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 6,
      "text": "as for zeal, persecuting the church; as for righteousness under the law, blameless.",
      "links": "<a href='/AIV/44/8/3'>Acts 8:3</a>; <a href='/AIV/48/1/14'>Gal. 1:14</a>",
      "comment": "Paul had been zealous, even to persecution, yet this did not give him true righteousness—a subtle call to rely on divine grace over self-righteousness."
    },
    {
      "pk": 370307,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 7,
      "text": "But whatever was gain to me, I have counted as loss for the sake of Christ.",
      "links": "<a href='/AIV/40/16/26'>Matt. 16:26</a>; <a href='/AIV/45/8/18'>Rom. 8:18</a>",
      "comment": "Worldly status and accomplishments are forsaken for the greater reality found in Christ—an echo of Christ's teaching about gaining the world but losing one's soul."
    },
    {
      "pk": 370308,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 8,
      "text": "Indeed, I count everything as loss because of the surpassing worth of knowing Christ Jesus my Lord. For his sake I have suffered the loss of all things and count them as rubbish, that I may gain Christ",
      "links": "<a href='/AIV/40/13/44'>Matt. 13:44</a>",
      "comment": "Paul's total surrender exemplifies the radical call to discipleship. The language matches the parable of the hidden treasure, underscoring the infinite value of union with Christ."
    },
    {
      "pk": 370309,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 9,
      "text": "and be found in him, not having a righteousness of my own that comes from the law, but that which is through faith in Christ—the righteousness from God based on faith.",
      "links": "<a href='/AIV/45/3/22'>Rom. 3:22</a>; <a href='/AIV/23/61/10'>Isa. 61:10</a>",
      "comment": "Paul affirms justification by faith, not works of the law. Righteousness comes from God—a theme that points toward participation in Christ and ongoing sanctification."
    },
    {
      "pk": 370310,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 10,
      "text": "I want to know Christ and the power of his resurrection and share in his sufferings, becoming like him in his death,",
      "links": "<a href='/AIV/45/6/5'>Rom. 6:5</a>; <a href='/AIV/40/20/22-23'>Matt. 20:22-23</a>",
      "comment": "Paul seeks not just intellectual knowledge but personal union with Christ, especially through suffering. This is a key aspect of Christian spirituality—being conformed to Christ's passion."
    },
    {
      "pk": 370311,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 11,
      "text": "that by any means possible I may attain the resurrection from the dead.",
      "links": "<a href='/AIV/46/15/22'>1 Cor. 15:22</a>; <a href='/AIV/43/5/29'>John 5:29</a>",
      "comment": "Resurrection is the final hope—Paul emphasizes perseverance and the possibility of attaining eternal life, hinting at ongoing cooperation with grace."
    },
    {
      "pk": 370312,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 12,
      "text": "Not that I have already obtained all this, or have become perfect, but I press on to make it my own, because Christ Jesus has made me his own.",
      "links": "<a href='/AIV/46/9/24'>1 Cor. 9:24</a>",
      "comment": "Paul acknowledges that spiritual perfection is a lifelong process, stressing growth and perseverance—a call to ongoing sanctification and pursuit of spiritual maturity."
    },
    {
      "pk": 370313,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 13,
      "text": "Brothers, I do not consider myself to have taken hold of it yet. But one thing I do: forgetting what lies behind and straining forward to what is ahead,",
      "links": "<a href='/AIV/42/9/62'>Luke 9:62</a>",
      "comment": "Paul presses forward, not dwelling on past failures. The continual striving reveals an active, daily conversion—echoing Christ’s teaching about setting one’s hand to the plow."
    },
    {
      "pk": 370314,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 14,
      "text": "I press on toward the goal for the prize of the upward call of God in Christ Jesus.",
      "links": "<a href='/AIV/46/9/25'>1 Cor. 9:25</a>",
      "comment": "A call to perseverance, aiming for the prize of sharing in Christ’s glory. This mindset supports a high view of the Christian vocation and the necessity of final perseverance."
    },
    {
      "pk": 370315,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 15,
      "text": "Let those of us who are mature think this way; and if in anything you think differently, God will reveal this also to you.",
      "links": "<a href='/AIV/46/2/6'>1 Cor. 2:6'</a>",
      "comment": "Spiritual maturity is marked by humble pursuit. Unity of mind is fostered by openness to correction—an implicit encouragement towards spiritual discernment, often guided within tradition."
    },
    {
      "pk": 370316,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 16,
      "text": "Only let us hold true to what we have attained.",
      "links": "<a href='/AIV/66/3/11'>Rev. 3:11</a>",
      "comment": "Steadfastness in the faith already received is vital, indicating the role of faithfully preserving received doctrine and practice."
    },
    {
      "pk": 370317,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 17,
      "text": "Brothers, join together in imitating me, and keep your eyes on those who walk according to the example you have in us.",
      "links": "<a href='/AIV/46/4/16'>1 Cor. 4:16</a>; <a href='/AIV/58/13/7'>Heb. 13:7</a>",
      "comment": "Paul exhorts disciples to follow apostolic examples. The emphasis on imitation and tradition is foundational in the passing down of Christian life and doctrine from the apostles."
    },
    {
      "pk": 370318,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 18,
      "text": "For many walk as enemies of the cross of Christ. I have often told you about them, and now tell you again with tears.",
      "links": "<a href='/AIV/45/16/18'>Rom. 16:18</a>",
      "comment": "Paul grieves over false brethren, highlighting the seriousness of opposition to the true Gospel and the cross, a central mystery of Christian faith."
    },
    {
      "pk": 370319,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 19,
      "text": "Their end is destruction, their god is their stomach, and they glory in their shame, with their minds set on earthly things.",
      "links": "<a href='/AIV/45/16/18'>Rom. 16:18</a>; <a href='/AIV/19/52/7'>Ps. 52:7</a>",
      "comment": "Worldly-mindedness is warned against; salvation requires turning from earthly priorities to the things above. Moral discipline and ascetic practices are often implied here in Christian tradition."
    },
    {
      "pk": 370320,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 20,
      "text": "But our citizenship is in heaven, and from it we await a Savior, the Lord Jesus Christ,",
      "links": "<a href='/AIV/58/13/14'>Heb. 13:14</a>; <a href='/AIV/40/25/31'>Matt. 25:31</a>",
      "comment": "The focus shifts to the heavenly kingdom. Christians' ultimate belonging is not earthly but spiritual, pointing to a transformed community under Christ’s everlasting reign."
    },
    {
      "pk": 370321,
      "translation": "AIV",
      "book": 50,
      "chapter": 3,
      "verse": 21,
      "text": "who will transform our lowly bodies to be like his glorious body, by the power that enables him even to subject all things to himself.",
      "links": "<a href='/AIV/46/15/43-49'>1 Cor. 15:43-49</a>; <a href='/AIV/62/3/2'>1 John 3:2</a>",
      "comment": "Final resurrection includes bodily transformation, mirroring Christ’s own glorified body. This passage affirms a robust hope not only in spiritual but bodily renewal, joined in Christ's victory over all things."
    }
  ],
  "translatedAt": "2025-12-23T03:56:56.410Z"
}