{
  "book": 57,
  "bookName": "Philippians",
  "bookAbbreviation": "Phil",
  "chapter": 3,
  "verses": [
    {
      "pk": 57003001,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 1,
      "text": "Finally, my brothers, rejoice in the Lord. To write the same things to you is no trouble for me and is safe for you.",
      "links": "<a href='/AIV/50/4/4'>Phil 4:4</a>; <a href='/AIV/52/5/16'>1 Thess 5:16</a>",
      "comment": "Paul encourages joy in the Lord, repeating this theme for the sake of their spiritual safety. Repetition is a safeguard, emphasizing the importance of ongoing remembrance in the faith, reflecting the need for continual instruction and tradition."
    },
    {
      "pk": 57003002,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 2,
      "text": "Beware of the dogs, beware of the evil workers, beware of those who mutilate the flesh.",
      "links": "<a href='/AIV/23/56/10-11'>Isa 56:10-11</a>; <a href='/AIV/5/23/18'>Deut 23:18</a>",
      "comment": "The term 'dogs' was a harsh expression for false teachers who relied on outward rituals rather than inward faith. It warns against legalism and those who distort the true practice of faith, emphasizing the spiritual reality over external observance."
    },
    {
      "pk": 57003003,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 3,
      "text": "For we are the true circumcision, who worship by the Spirit of God and glory in Christ Jesus and put no confidence in the flesh.",
      "links": "<a href='/AIV/45/2/29'>Rom 2:29</a>; <a href='/AIV/43/4/23-24'>John 4:23-24</a>",
      "comment": "'True circumcision' means inward transformation by the Spirit, not merely outward sign. The mention of worshiping in the Spirit and glorying in Christ Jesus points to the unity of faith based on spiritual reality, not just Jewish identity."
    },
    {
      "pk": 57003004,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 4,
      "text": "Though I myself have reason for confidence in the flesh also. If anyone else thinks he has reason for confidence in the flesh, I have more:",
      "links": "<a href='/AIV/47/11/18-22'>2 Cor 11:18-22</a>",
      "comment": "Paul prepares to list his credentials, emphasizing that even with impressive spiritual and cultural background, these cannot compare to the righteousness received by faith in Christ. He sets up a contrast between worldly status and divine grace."
    },
    {
      "pk": 57003005,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 5,
      "text": "Circumcised on the eighth day, of the people of Israel, of the tribe of Benjamin, a Hebrew of Hebrews; as to the law, a Pharisee;",
      "links": "<a href='/AIV/1/17/12'>Gen 17:12</a>; <a href='/AIV/9/13/1-2'>1 Sam 13:1-2</a>",
      "comment": "Paul recites his Jewish heritage and strict adherence to the Law. His mention of being 'a Hebrew of Hebrews' highlights both lineage and faithful observance, pointing to the importance of spiritual inheritance alongside faith (cf. Rom 9:4-5)."
    },
    {
      "pk": 57003006,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 6,
      "text": "as to zeal, persecuting the church; as to righteousness under the law, blameless.",
      "links": "<a href='/AIV/44/8/3'>Acts 8:3</a>; <a href='/AIV/42/18/21'>Luke 18:21</a>",
      "comment": "Paul underlines his former passion for the law, even to persecuting believers. Yet he intends to show that such zeal, apart from Christ, does not fulfill the promise of salvation."
    },
    {
      "pk": 57003007,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 7,
      "text": "But whatever gain I had, I counted as loss for the sake of Christ.",
      "links": "<a href='/AIV/40/16/26'>Matt 16:26</a>; <a href='/AIV/47/5/16-17'>2 Cor 5:16-17</a>",
      "comment": "Earthly credentials, once valuable to Paul, are deemed worthless compared to knowing Christ. This renunciation is an example for believers to value spiritual union with Jesus over worldly gain."
    },
    {
      "pk": 57003008,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 8,
      "text": "Indeed, I count everything as loss because of the surpassing worth of knowing Christ Jesus my Lord. For his sake I have suffered the loss of all things and count them as rubbish, so that I may gain Christ",
      "links": "<a href='/AIV/40/13/44-46'>Matt 13:44-46</a>",
      "comment": "Knowing Christ surpasses all else. The strong language—'rubbish'—shows Paul’s absolute focus on Christ. This echoes the call to forsake all for the kingdom of God (cf. Luke 14:33)."
    },
    {
      "pk": 57003009,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 9,
      "text": "and be found in him, not having a righteousness of my own that comes from the law, but that which comes through faith in Christ, the righteousness from God that depends on faith—",
      "links": "<a href='/AIV/45/3/21-22'>Rom 3:21-22</a>; <a href='/AIV/47/5/21'>2 Cor 5:21</a>",
      "comment": "Paul explains salvation comes from union with Christ, and righteousness is God’s gift through faith. This is a key point in Christian doctrine: salvation is not earned but received."
    },
    {
      "pk": 57003010,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 10,
      "text": "that I may know him and the power of his resurrection, and may share his sufferings, becoming like him in his death,",
      "links": "<a href='/AIV/45/6/5'>Rom 6:5</a>; <a href='/AIV/47/4/10-11'>2 Cor 4:10-11</a>",
      "comment": "Paul desires deep union with Christ, both in resurrection power and in suffering. This participation in Christ’s death and resurrection points to a life patterned after Jesus, an idea developed further in sacramental theology through spiritual participation in Christ’s sacrifice."
    },
    {
      "pk": 57003011,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 11,
      "text": "that by any means possible I may attain the resurrection from the dead.",
      "links": "<a href='/AIV/45/8/11'>Rom 8:11</a>; <a href='/AIV/46/15/20-23'>1 Cor 15:20-23</a>",
      "comment": "The ultimate goal for Paul is resurrection, sharing in Christ’s victory over death. This connects to the Christian hope of bodily resurrection at the end of the age."
    },
    {
      "pk": 57003012,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 12,
      "text": "Not that I have already obtained this or am already perfect, but I press on to make it my own, because Christ Jesus has made me his own.",
      "links": "<a href='/AIV/46/9/24-27'>1 Cor 9:24-27</a>",
      "comment": "Paul clarifies he is still striving. Christian life is ongoing growth in holiness, not instant perfection. Perseverance is key, motivated by Christ’s initiative in drawing each person."
    },
    {
      "pk": 57003013,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 13,
      "text": "Brothers, I do not consider that I have made it my own. But one thing I do: forgetting what lies behind and reaching forward to what lies ahead,",
      "links": "<a href='/AIV/42/9/62'>Luke 9:62</a>",
      "comment": "A forward-looking faith is emphasized. Past achievements or failures do not determine one’s present pursuit of Christ. This reflects continual transformation in the Christian journey."
    },
    {
      "pk": 57003014,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 14,
      "text": "I press on toward the goal for the prize of the upward call of God in Christ Jesus.",
      "links": "<a href='/AIV/46/9/24'>1 Cor 9:24</a>",
      "comment": "Paul uses athletic imagery for the faith journey, echoing the idea of striving for the heavenly call. This lifelong pursuit of holiness is foundational for understanding sanctification."
    },
    {
      "pk": 57003015,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 15,
      "text": "Let those who are mature think this way. And if in anything you think differently, God will reveal that also to you.",
      "links": "<a href='/AIV/47/3/15-16'>2 Cor 3:15-16</a>",
      "comment": "True spiritual maturity is shown in continual pursuit of Christ. God leads believers to unity in truth over time, underscoring the role of spiritual guidance in understanding doctrine."
    },
    {
      "pk": 57003016,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 16,
      "text": "Only let us hold true to what we have attained.",
      "links": "<a href='/AIV/48/5/7'>Gal 5:7</a>",
      "comment": "Paul urges holding firmly to what has already been received in faith, reflecting the importance of perseverance in the foundational teachings handed down to the Church."
    },
    {
      "pk": 57003017,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 17,
      "text": "Brothers, join in imitating me and observe those who walk according to the example you have in us.",
      "links": "<a href='/AIV/46/11/1'>1 Cor 11:1</a>; <a href='/AIV/52/1/6'>1 Thess 1:6</a>",
      "comment": "Imitation of apostolic example reinforces the principle of learning faith through following godly leaders. The stress on example aligns with the idea of a visible, apostolic tradition."
    },
    {
      "pk": 57003018,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 18,
      "text": "For many, of whom I have often told you and now tell you even with tears, walk as enemies of the cross of Christ.",
      "links": "<a href='/AIV/45/16/17-18'>Rom 16:17-18</a>",
      "comment": "Paul grieves over those who reject the sacrificial path of Christ. Enemies of the cross may claim to be religious, but they undermine the saving work of Jesus by their actions."
    },
    {
      "pk": 57003019,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 19,
      "text": "Their end is destruction, their god is their belly, and they glory in their shame, with minds set on earthly things.",
      "links": "<a href='/AIV/45/8/5-7'>Rom 8:5-7</a>",
      "comment": "Paul warns that pursuit of fleshly desires leads to ruin. Focusing on earthly things, instead of things above, leads away from salvation and the true hope found in Christ."
    },
    {
      "pk": 57003020,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 20,
      "text": "But our citizenship is in heaven, and from it we await a Savior, the Lord Jesus Christ,",
      "links": "<a href='/AIV/58/12/22-24'>Heb 12:22-24</a>; <a href='/AIV/40/25/31'>Matt 25:31</a>",
      "comment": "Believers' true homeland is heavenly, and their hope is in the coming of Christ. This points to the idea of the Church as a pilgrim people, journeying toward final union with Christ."
    },
    {
      "pk": 57003021,
      "translation": "AIV",
      "book": 57,
      "bookName": "Philippians",
      "bookAbbreviation": "Phil",
      "chapter": 3,
      "verse": 21,
      "text": "who will transform our humble body to be like his glorious body, by the power that enables him to subject all things to himself.",
      "links": "<a href='/AIV/46/15/42-49'>1 Cor 15:42-49</a>; <a href='/AIV/62/3/2'>1 John 3:2</a>",
      "comment": "The resurrection will bring physical transformation for believers, patterned after Christ’s glorified body. This highlights the hope of the bodily resurrection, a central Christian doctrine affirming both physical and spiritual renewal. Christ’s sovereignty over all creation is also underlined here."
    }
  ],
  "translatedAt": "2025-12-24T12:05:28.097Z"
}