{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 37,
  "verses": [
    {
      "pk": 2037001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 1,
      "text": "Bezalel made the ark of acacia wood. It was two and a half cubits long, one and a half cubits wide, and one and a half cubits high.",
      "links": "<a href='/AIV/2/25/10'>Exod. 25:10</a>",
      "comment": "Here the skilled craftsman, Bezalel, fulfills the command given earlier for constructing the ark. The precise measurements emphasize obedience and the sacredness of God's instruction, pointing to reverence in worship."
    },
    {
      "pk": 2037002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 2,
      "text": "He overlaid it with pure gold inside and out, and made a gold molding around it.",
      "links": "<a href='/AIV/2/25/11'>Exod. 25:11</a>; <a href='/AIV/1/6/21'>Gen. 6:21</a>",
      "comment": "Pure gold symbolizes incorruptibility and holiness, set apart from common use. This points forward to Christ, who is both fully divine and without corruption (<a href='/AIV/58/4/15'>Heb. 4:15</a>)."
    },
    {
      "pk": 2037003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 3,
      "text": "He cast four rings of gold for it, for its four feet, two rings on one side and two rings on the other side.",
      "links": "<a href='/AIV/2/25/12'>Exod. 25:12</a>",
      "comment": "The rings enabled the ark to be carried reverently. This highlights the care with which sacred objects are handled, an attitude we see continued in worship and the treatment of holy things."
    },
    {
      "pk": 2037004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 4,
      "text": "He made poles of acacia wood and overlaid them with gold.",
      "links": "<a href='/AIV/2/25/13'>Exod. 25:13</a>",
      "comment": "The acacia wood, durable and incorruptible, reflects enduring faithfulness, made glorious by being covered in gold."
    },
    {
      "pk": 2037005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 5,
      "text": "He put the poles into the rings on the sides of the ark to carry the ark.",
      "links": "<a href='/AIV/2/25/14'>Exod. 25:14</a>",
      "comment": "These instructions prevent improper handling of the ark, emphasizing reverence. The importance of rightly ordered worship is underlined here (<a href='/AIV/4/4/15-20'>Num. 4:15-20</a>)."
    },
    {
      "pk": 2037006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 6,
      "text": "He made a cover of pure gold, two and a half cubits long and one and a half cubits wide.",
      "links": "<a href='/AIV/2/25/17'>Exod. 25:17</a>",
      "comment": "Also called the mercy seat, this cover is the place of atonement where God meets His people. This foreshadows Christ making atonement for us (<a href='/AIV/45/3/25'>Rom. 3:25</a>)."
    },
    {
      "pk": 2037007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 7,
      "text": "He made two cherubim of hammered gold; he made them at the two ends of the cover:",
      "links": "<a href='/AIV/2/25/18'>Exod. 25:18</a>",
      "comment": "The cherubim signify the heavenly presence and remind us of the depth and mystery of worship, where heaven and earth meet (<a href='/AIV/26/10/1'>Ezek. 10:1</a>)."
    },
    {
      "pk": 2037008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 8,
      "text": "one cherub at one end and one cherub at the other end; he made the cherubim at the two ends of one piece with the cover.",
      "links": "<a href='/AIV/1/3/24'>Gen. 3:24</a>; <a href='/AIV/2/25/19'>Exod. 25:19</a>",
      "comment": "Integral to the cover, the unity of the design suggests harmony and completeness in God's dwelling, alluding to unity within the People of God."
    },
    {
      "pk": 2037009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 9,
      "text": "The cherubim spread their wings upward, covering the cover with their wings, their faces looking toward each other; the faces of the cherubim were toward the cover.",
      "links": "<a href='/AIV/11/6/27'>1 Kings 6:27</a>",
      "comment": "This posture of the cherubim symbolizes worship. Such reverent attention at the mercy seat prefigures the worship offered before God's presence in heaven (<a href='/AIV/66/4/6'>Rev. 4:6-8</a>)."
    },
    {
      "pk": 2037010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 10,
      "text": "He made the table of acacia wood, two cubits long, one cubit wide, and one and a half cubits high.",
      "links": "<a href='/AIV/2/25/23'>Exod. 25:23</a>",
      "comment": "The table holds the bread of the Presence, a continual offering foreshadowing the perpetual sacrifice in Christian worship (<a href='/AIV/40/26/26'>Matt. 26:26</a>)."
    },
    {
      "pk": 2037011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 11,
      "text": "He overlaid it with pure gold and made a gold molding around it.",
      "links": "<a href='/AIV/2/25/24'>Exod. 25:24</a>",
      "comment": "Again, gold marks something set apart for God, emphasizing the sacredness of the bread to be placed there."
    },
    {
      "pk": 2037012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 12,
      "text": "He made a rim a handbreadth wide around it and made a gold molding for the rim around it.",
      "links": "<a href='/AIV/2/25/25'>Exod. 25:25</a>",
      "comment": "The decorative rim safeguards and honors what is set apart—an echo of the care given to the liturgy’s holy vessels in the temple and beyond."
    },
    {
      "pk": 2037013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 13,
      "text": "He cast four gold rings for it and attached the rings to the four corners that were on its four legs.",
      "links": "<a href='/AIV/2/25/26'>Exod. 25:26</a>",
      "comment": "The parallel to the ark carries forward the holiness and need for ritual purity in the handling of all sacred things."
    },
    {
      "pk": 2037014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 14,
      "text": "The rings were close to the rim, as holders for the poles to carry the table.",
      "links": "<a href='/AIV/2/25/27'>Exod. 25:27</a>",
      "comment": "The method of transport preserves the table’s sanctity, a reminder of God’s ongoing presence among His people."
    },
    {
      "pk": 2037015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 15,
      "text": "He made the poles of acacia wood and overlaid them with gold, to carry the table.",
      "links": "<a href='/AIV/2/25/28'>Exod. 25:28</a>",
      "comment": "As with the ark, adherence to these instructions points to a tradition of faithful stewardship and a continuity of worship practice."
    },
    {
      "pk": 2037016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 16,
      "text": "He made the vessels that were on the table, its dishes, pans, bowls, and jars for pouring drink offerings, of pure gold.",
      "links": "<a href='/AIV/2/25/29'>Exod. 25:29</a>",
      "comment": "These golden utensils point forward to the sacred vessels used in ongoing worship. In church tradition, these link to the vessels used at the altar, showing the continuity and sacredness of worship across the ages."
    },
    {
      "pk": 2037017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 17,
      "text": "He made the lampstand of pure gold. He made the lampstand of hammered work, its base and its shaft; its cups, its buds, and its flowers were of one piece with it.",
      "links": "<a href='/AIV/2/25/31'>Exod. 25:31</a>",
      "comment": "The lampstand, or menorah, is styled to resemble a tree, linking creation and worship. Its light prefigures the light of Christ, who is the true light to the world (<a href='/AIV/43/8/12'>John 8:12</a>)."
    },
    {
      "pk": 2037018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 18,
      "text": "There were six branches going out from its sides, three branches of the lampstand out of one side, and three branches out of the other side.",
      "links": "<a href='/AIV/2/25/32'>Exod. 25:32</a>",
      "comment": "The six branches and central shaft total seven lights—symbolic of perfection and fullness, analogous to spiritual completeness."
    },
    {
      "pk": 2037019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 19,
      "text": "Three cups made like almond blossoms, each with bud and flower, were on each branch—three on one branch and three on every branch. And on the lampstand itself were four cups made like almond blossoms, with their buds and flowers.",
      "links": "<a href='/AIV/2/25/33'>Exod. 25:33</a>",
      "comment": "The almond blossom design suggests life and resurrection, resonating with later biblical imagery of spiritual flourishing (<a href='/AIV/24/1/11-12'>Jer. 1:11-12</a>)."
    },
    {
      "pk": 2037020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 20,
      "text": "There was a bud under each pair of branches, all made of one piece with the lampstand, all of one hammered work of pure gold.",
      "links": "<a href='/AIV/2/25/34'>Exod. 25:34</a>",
      "comment": "That it’s all made of one piece further symbolizes unity and undivided purpose in worship—a foundational theme in God’s people."
    },
    {
      "pk": 2037021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 21,
      "text": "There were three buds for the six branches going out of the lampstand, one bud under each pair of branches.",
      "links": "<a href='/AIV/2/25/35'>Exod. 25:35</a>",
      "comment": "This ornamental detail shows the meticulousness required for God’s service, where beauty and order reflect heavenly worship."
    },
    {
      "pk": 2037022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 22,
      "text": "Their buds and their branches were of one piece with it; all of it was one hammered piece of pure gold.",
      "links": "<a href='/AIV/2/25/36'>Exod. 25:36</a>",
      "comment": "The emphasis on unity here anticipates the unity Christ desires for His followers (<a href='/AIV/43/17/21'>John 17:21</a>)."
    },
    {
      "pk": 2037023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 23,
      "text": "He made its seven lamps, its wick trimmers and its trays, of pure gold.",
      "links": "<a href='/AIV/2/25/37'>Exod. 25:37</a>",
      "comment": "The number seven points to completeness. Bringing light into the holy place is a symbol of God's presence and illumination."
    },
    {
      "pk": 2037024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 24,
      "text": "He used a talent of pure gold for all its implements.",
      "links": "<a href='/AIV/2/25/39'>Exod. 25:39</a>",
      "comment": "A talent equates to around 75 pounds (34 kg) of gold, indicating the generosity befitting God’s dwelling."
    },
    {
      "pk": 2037025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 25,
      "text": "He made the altar of incense of acacia wood. It was a cubit long and a cubit wide—it was square—and two cubits high. Its horns were of one piece with it.",
      "links": "<a href='/AIV/2/30/1-2'>Exod. 30:1-2</a>",
      "comment": "The altar of incense, like the prayers of the saints rising to God, will be echoed in <a href='/AIV/66/8/3-4'>Revelation 8:3-4</a>, showing a continuity of spiritual worship."
    },
    {
      "pk": 2037026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 26,
      "text": "He overlaid it with pure gold on its top, its sides all around, and its horns, and he made a gold molding around it.",
      "links": "<a href='/AIV/2/30/3'>Exod. 30:3</a>",
      "comment": "Gold overlay marks out this altar as holy. The altar’s role in worship is fulfilled spiritually in New Testament worship, where sacrifice becomes prayer and praise (<a href='/AIV/58/13/15'>Heb. 13:15</a>)."
    },
    {
      "pk": 2037027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 27,
      "text": "He made two gold rings for it under its molding, on its two opposite sides, to hold the poles with which to carry it.",
      "links": "<a href='/AIV/2/30/4'>Exod. 30:4</a>",
      "comment": "Provision for moving the incense altar shows the mobility of Israel’s worship but also the reverent care with which worship is to be conducted."
    },
    {
      "pk": 2037028,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 28,
      "text": "He made the poles of acacia wood and overlaid them with gold.",
      "links": "<a href='/AIV/2/30/5'>Exod. 30:5</a>",
      "comment": "This mirrors the instructions for the ark and table, affirming the importance of precise obedience and continuity in worship tradition."
    },
    {
      "pk": 2037029,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 37,
      "verse": 29,
      "text": "He made the holy anointing oil and the pure fragrant incense, the work of a perfumer.",
      "links": "<a href='/AIV/2/30/22-38'>Exod. 30:22-38</a>",
      "comment": "The anointing oil and incense signify the setting apart of persons and objects for God’s service—echoing how God marks His own with His Spirit. Such sacramental language and action foreshadow the sanctifying work of Christ and the Spirit in the life of the faithful."
    }
  ],
  "translatedAt": "2025-12-24T01:08:00.370Z"
}