{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 29,
  "verses": [
    {
      "pk": 2029001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 1,
      "text": "This is what you must do to consecrate them, so they may serve Me as priests: Take one young bull and two rams without blemish,",
      "links": "<a href='/AIV/3/8/2'>Lev. 8:2</a>",
      "comment": "The word 'consecrate' here means 'make holy, set apart.' Note how only unblemished animals are used, a prefiguration of Christ, who is the flawless sacrificial Lamb (see <a href='/AIV/43/1/29'>John 1:29</a> and <a href='/AIV/58/9/14'>Heb. 9:14</a>)."
    },
    {
      "pk": 2029002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 2,
      "text": "And unleavened bread, unleavened cakes mixed with oil, and unleavened wafers spread with oil. Make them from fine wheat flour.",
      "links": "<a href='/AIV/2/12/8'>Exod 12:8</a>;<a href='/AIV/3/2/4'>Lev. 2:4</a>",
      "comment": "Unleavened bread is significant for purity and the absence of corruption (symbolically sin), and the oil signifies anointing and the Holy Spirit. The bread points forward typologically to the bread that becomes the center of New Covenant worship (<a href='/AIV/40/26/26'>Matt 26:26</a>)."
    },
    {
      "pk": 2029003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 3,
      "text": "Put these into one basket, and present them in the basket, along with the bull and the two rams.",
      "links": "",
      "comment": "The single basket signifies unity of offerings, recalling how the Eucharist is also one bread (see <a href='/AIV/46/10/17'>1 Cor 10:17</a>)."
    },
    {
      "pk": 2029004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 4,
      "text": "Then bring Aaron and his sons to the entrance of the tent of meeting, and wash them with water.",
      "links": "<a href='/AIV/3/8/6'>Lev. 8:6</a>;<a href='/AIV/56/3/5'>Titus 3:5</a>",
      "comment": "Washing is a ritual act of purification, foreshadowing the washing of baptism as entry into priestly service (<a href='/AIV/60/2/9'>1 Pet 2:9</a>)."
    },
    {
      "pk": 2029005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 5,
      "text": "Take the garments and put the tunic on Aaron, as well as the robe of the ephod, the ephod itself, and the breastpiece. Fasten the woven waistband of the ephod around him.",
      "links": "<a href='/AIV/2/28/4'>Exod 28:4</a>",
      "comment": "Aaron's clothing marks him as set apart for a sacred task, pointing to the apostolic and ministerial offices of the Church."
    },
    {
      "pk": 2029006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 6,
      "text": "Set the turban on his head and place the holy crown on the turban.",
      "links": "<a href='/AIV/2/28/36'>Exod 28:36</a>",
      "comment": "The crown engraved 'Holy to the Lord' foreshadows Christ, the true High Priest and King (<a href='/AIV/58/2/17'>Heb 2:17</a>)."
    },
    {
      "pk": 2029007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 7,
      "text": "Then take the anointing oil and pour it on his head and anoint him.",
      "links": "<a href='/AIV/3/8/12'>Lev 8:12</a>",
      "comment": "Anointing with oil symbolizes being set apart by the Spirit (see <a href='/AIV/42/4/18'>Luke 4:18</a>); Christ/Messiah means 'anointed one.'"
    },
    {
      "pk": 2029008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 8,
      "text": "Bring his sons and clothe them with laziness and mind the codes of the Torah.",
      "links": "<a href='/AIV/2/28/41'>Exod 28:41</a>",
      "comment": "Intended: 'Clothe them with tunics.' Garment giving marks entry into ministerial office, anticipating apostolic succession and laying on of hands (see <a href='/AIV/54/4/14'>1 Tim 4:14</a>)."
    },
    {
      "pk": 2029009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 9,
      "text": "Tie sashes around Aaron and his sons and put the caps on them. The priesthood belongs to them by a perpetual statute. In this way you are to ordain Aaron and his sons.",
      "links": "<a href='/AIV/2/40/15'>Exod 40:15</a>",
      "comment": "Priesthood is hereditary for Aaron's line, replaced in the New Covenant by spiritual succession through ordination (<a href='/AIV/58/7/24'>Heb 7:24</a>)."
    },
    {
      "pk": 2029010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 10,
      "text": "Then bring the bull in front of the tent of meeting. Aaron and his sons shall lay their hands on the head of the bull.",
      "links": "<a href='/AIV/3/1/4'>Lev 1:4</a>",
      "comment": "Laying on hands is a sign of transferring sin and identification with the sacrifice; this action is foundational for sacramental mediatorship."
    },
    {
      "pk": 2029011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 11,
      "text": "Slaughter the bull before the Lord at the entrance of the tent of meeting.",
      "links": "<a href='/AIV/3/4/4'>Lev 4:4</a>",
      "comment": "Sacrifice at the tent entrance, where God draws near, points to the altar as the place of reconciliation and meeting with God—anticipating true communion with God through Christ."
    },
    {
      "pk": 2029012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 12,
      "text": "Take some of the bull's blood, put it on the horns of the altar with your finger, and pour out all the rest of the blood at the base of the altar.",
      "links": "<a href='/AIV/3/8/15'>Lev 8:15</a>",
      "comment": "Sanctifying the altar by blood foreshadows that only a sacrifice mediates access to God, culminating in Christ’s blood on the cross."
    },
    {
      "pk": 2029013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 13,
      "text": "Take all the fat that covers the inner organs, the lobe of the liver, the two kidneys with their fat, and burn them on the altar.",
      "links": "<a href='/AIV/3/8/16'>Lev 8:16</a>",
      "comment": "Burning select portions of the sacrifice shows sacredness and the idea of offering the best and innermost parts to God."
    },
    {
      "pk": 2029014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 14,
      "text": "But burn the flesh of the bull, its skin, and its dung outside the camp; it is a sin offering.",
      "links": "<a href='/AIV/58/13/11'>Heb 13:11</a>",
      "comment": "The sin offering burned outside the camp prefigures Jesus' suffering outside Jerusalem (see <a href='/AIV/58/13/12'>Heb 13:12</a>), showing the typological fulfillment in Christ."
    },
    {
      "pk": 2029015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 15,
      "text": "Take one of the rams, and Aaron and his sons shall lay their hands on its head.",
      "links": "<a href='/AIV/3/8/18'>Lev 8:18</a>",
      "comment": "Hand-laying again indicates transfer and participation in the offering, reflecting the theology of priestly mediation."
    },
    {
      "pk": 2029016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 16,
      "text": "Slaughter the ram, take its blood, and sprinkle it all around the altar.",
      "links": "<a href='/AIV/3/8/19'>Lev 8:19</a>",
      "comment": "Blood around the altar sanctifies it. The theme of sprinkling blood is picked up in New Testament reflections on atonement (<a href='/AIV/58/9/21'>Heb 9:21-22</a>)."
    },
    {
      "pk": 2029017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 17,
      "text": "Cut the ram into pieces, wash the internal parts and legs, and put them with its pieces and its head.",
      "links": "",
      "comment": "Complete washing and preparation of the offering signifies the thoroughness needed in approaching God."
    },
    {
      "pk": 2029018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 18,
      "text": "Burn the whole ram on the altar. It is a burnt offering to the Lord; it is a pleasing aroma, a food offering to the Lord.",
      "links": "<a href='/AIV/1/8/21'>Gen 8:21</a>",
      "comment": "Aromatic offering points to pleasing God by whole, unreserved surrender—modeled perfectly in Christ's self-offering."
    },
    {
      "pk": 2029019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 19,
      "text": "Take the other ram, and Aaron and his sons shall lay their hands on its head.",
      "links": "<a href='/AIV/3/8/22'>Lev 8:22</a>",
      "comment": "Second ram for ordination, further sanctifying the priesthood to serve at God’s altar."
    },
    {
      "pk": 2029020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 20,
      "text": "Slaughter the ram, and take some of its blood and put it on the lobe of Aaron’s right ear and on his sons' right ears, and on the thumbs of their right hands and the big toes of their right feet. Then sprinkle the rest of the blood around the altar.",
      "links": "<a href='/AIV/3/8/23'>Lev 8:23-24</a>",
      "comment": "Blood consecrates the senses and actions of the priests—hearing, service, and path—mapping to how Christians are to dedicate all faculties to God."
    },
    {
      "pk": 2029021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 21,
      "text": "Take some blood from the altar and some of the anointing oil and sprinkle them on Aaron and his garments, and on his sons and their garments as well. So Aaron and his garments will be holy, and his sons and their garments with him.",
      "links": "<a href='/AIV/3/8/30'>Lev 8:30</a>",
      "comment": "The blend of blood and oil shows the union of cleansing and consecration—hinting promise of a new priestly consecration in Christ."
    },
    {
      "pk": 2029022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 22,
      "text": "Take from the ram the fat, the fat tail, the fat covering the internal organs, the lobe of the liver, the two kidneys with their fat, and the right thigh (for it is a ram of ordination),",
      "links": "",
      "comment": "The best and choicest parts are for God—presaging the dedication of the best gifts and offerings in New Covenant worship."
    },
    {
      "pk": 2029023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 23,
      "text": "and from the basket of unleavened bread before the Lord, take one loaf, one cake made with oil, and one wafer.",
      "links": "",
      "comment": "Three types of bread point to the variety and completion in worship, echoing later emphasis on a bread-offering in the Lord’s Supper."
    },
    {
      "pk": 2029024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 24,
      "text": "Put all these in the hands of Aaron and his sons, and wave them as a wave offering before the Lord.",
      "links": "<a href='/AIV/3/8/27'>Lev 8:27</a>",
      "comment": "They physically present the offering as partners with God—like the priest offering the Church’s sacrifice, acting as mediator."
    },
    {
      "pk": 2029025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 25,
      "text": "Then take them from their hands and burn them on the altar with the burnt offering as a pleasing aroma before the Lord. It is a food offering to the Lord.",
      "links": "",
      "comment": "A pleasing aroma signifies acceptance by God; the eucharistic food motif is foreshadowed."
    },
    {
      "pk": 2029026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 26,
      "text": "Take the breast of the ram for Aaron's ordination and wave it before the Lord as a wave offering; that will be your portion.",
      "links": "",
      "comment": "Moses, as mediator, receives a share, anticipating priestly participation in sacred things."
    },
    {
      "pk": 2029027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 27,
      "text": "Consecrate the breast of the wave offering and the thigh of the contribution that are waved and lifted up from the ram of ordination, from what was for Aaron and his sons.",
      "links": "",
      "comment": "The special portions for priests foreshadow the Church’s later practice of priestly support from the altar."
    },
    {
      "pk": 2029028,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 28,
      "text": "It shall be a perpetual statute for Aaron and his sons from the people of Israel, that because it is a contribution. It shall belong to Aaron and his sons from the sacrifices of peace offerings—the people’s contribution to the Lord.",
      "links": "",
      "comment": "The perpetual nature of the priesthood and offerings reflects a lasting ministry, fulfilled in Christ’s eternal priesthood (<a href='/AIV/58/7/24'>Heb 7:24</a>)."
    },
    {
      "pk": 2029029,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 29,
      "text": "The holy garments of Aaron shall be for his sons after him; they shall be anointed in them and ordained in them.",
      "links": "",
      "comment": "Passing garments from father to son typifies the continuity and apostolic succession in ministry."
    },
    {
      "pk": 2029030,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 30,
      "text": "The priest who is anointed and ordained to serve as priest in his father's place shall wear them for seven days, when he enters the tent of meeting to minister in the Holy Place.",
      "links": "",
      "comment": "Seven days signals fullness and spiritual completeness. Ministry succession is a key idea here."
    },
    {
      "pk": 2029031,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 31,
      "text": "Take the ram of ordination and boil its flesh in a holy place.",
      "links": "",
      "comment": "A holy place for cooking signifies the separation of sacred things from common use—see parallel in Lord’s words about sacredness in worship (<a href='/AIV/40/7/6'>Matt 7:6</a>)."
    },
    {
      "pk": 2029032,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 32,
      "text": "Aaron and his sons shall eat the flesh of the ram and the bread that is in the basket at the entrance of the tent of meeting.",
      "links": "<a href='/AIV/3/8/31'>Lev 8:31</a>",
      "comment": "Priests eating the offering prefigures the New Covenant meal where the ministers share in the sacrifice—hinting at the Lord’s Supper, where Christ gives His body to His ministers and people."
    },
    {
      "pk": 2029033,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 33,
      "text": "They shall eat those things with which atonement was made at their ordination and consecration, but a layman shall not eat them, because they are holy.",
      "links": "",
      "comment": "Only the priests may eat the sacrifice—showing an inner circle for holy mysteries, fulfilled in Christ’s institution of the special meal for His apostles (<a href='/AIV/40/26/26-28'>Matt 26:26-28</a>)."
    },
    {
      "pk": 2029034,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 34,
      "text": "If any of the flesh or bread is left until morning, burn it with fire. It shall not be eaten, because it is holy.",
      "links": "<a href='/AIV/2/12/10'>Exod 12:10</a>",
      "comment": "This recalls Passover rules. Nothing holy is to be wasted or left to corruption—echoed in the careful handling of sacred mysteries (<a href='/AIV/43/6/12'>John 6:12</a>)."
    },
    {
      "pk": 2029035,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 35,
      "text": "Do for Aaron and his sons all that I have commanded you, taking seven days to ordain them.",
      "links": "",
      "comment": "Seven day ordination is significant for fullness and solemnity, seen later in New Testament laying on of hands and ordination rites."
    },
    {
      "pk": 2029036,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 36,
      "text": "Each day offer a bull as a sin offering for atonement. Also purify the altar by making atonement for it and anoint it to consecrate it.",
      "links": "",
      "comment": "Daily sin offerings highlight the necessity of continual atonement until the perfect, once-for-all sacrifice of Christ (<a href='/AIV/58/10/10-14'>Heb 10:10-14</a>)."
    },
    {
      "pk": 2029037,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 37,
      "text": "For seven days make atonement for the altar and consecrate it. Then the altar will be most holy; whatever touches the altar shall become holy.",
      "links": "<a href='/AIV/2/30/29'>Exod 30:29</a>",
      "comment": "The holiness of the altar transfers to whatever or whoever touches it, a theme fulfilled at Pentecost as the Spirit makes people holy through the apostolic ministry."
    },
    {
      "pk": 2029038,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 38,
      "text": "Now this is what you shall offer on the altar: two lambs a year old, day by day, continually.",
      "links": "<a href='/AIV/4/28/3'>Num 28:3-4</a>",
      "comment": "Daily sacrifices undergird constant worship, anticipating the continual sacrifice and the idea of a perpetual offering in Christian worship."
    },
    {
      "pk": 2029039,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 39,
      "text": "Offer one lamb in the morning and the other lamb at twilight.",
      "links": "",
      "comment": "Morning and evening sacrifices show a rhythm of daily devotion. Jesus’ crucifixion at the time of the evening sacrifice links Him to this daily worship (<a href='/AIV/42/23/44-46'>Luke 23:44-46</a>)."
    },
    {
      "pk": 2029040,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 40,
      "text": "With the first lamb offer a tenth of an ephah of fine flour mixed with a quarter of a hin of beaten oil, and a quarter of a hin of wine as a drink offering.",
      "links": "",
      "comment": "The blend of bread, oil, and wine in the offerings closely parallels the signs used in Christian worship as Christ instituted in the New Covenant."
    },
    {
      "pk": 2029041,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 41,
      "text": "The other lamb you shall offer at twilight, and with it a grain offering and a drink offering, like the one in the morning, for a pleasing aroma, a food offering to the Lord.",
      "links": "",
      "comment": "Evening sacrifice with bread and wine anticipates the fulfillment in the Lord’s Supper ‘as often as you do this’ (<a href='/AIV/46/11/26'>1 Cor 11:26</a>)."
    },
    {
      "pk": 2029042,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 42,
      "text": "It shall be a continual burnt offering throughout your generations at the entrance of the tent of meeting before the Lord, where I will meet with you, to speak with you there.",
      "links": "",
      "comment": "God meets with His people at the altar. This pattern is fulfilled when Christ dwells with His people in sacramental worship."
    },
    {
      "pk": 2029043,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 43,
      "text": "There I will meet with the Israelites, and the place will be consecrated by My glory.",
      "links": "",
      "comment": "God’s presence makes the place holy, reflected in the Christian assembly where Christ’s presence sanctifies (<a href='/AIV/40/18/20'>Matt 18:20</a>)."
    },
    {
      "pk": 2029044,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 44,
      "text": "So I will consecrate the tent of meeting and the altar, and I will consecrate Aaron and his sons to serve Me as priests.",
      "links": "",
      "comment": "God alone makes the place, altar, and priests holy—a type of the sanctifying grace given through the New Covenant ministry."
    },
    {
      "pk": 2029045,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 45,
      "text": "I will dwell among the Israelites and will be their God.",
      "links": "<a href='/AIV/26/37/27'>Ezek 37:27</a>",
      "comment": "God dwelling among His people anticipates the Incarnation—Christ 'tabernacling' among humanity (<a href='/AIV/43/1/14'>John 1:14</a>)."
    },
    {
      "pk": 2029046,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 29,
      "verse": 46,
      "text": "Then they will know that I am the Lord their God, who brought them out of the land of Egypt, that I might dwell among them. I am the Lord their God.",
      "links": "<a href='/AIV/3/26/12'>Lev 26:12</a>",
      "comment": "God’s desire is always to dwell among His people, achieving this most perfectly in the incarnation and the continual divine presence with His Church."
    }
  ],
  "translatedAt": "2025-12-24T01:02:51.804Z"
}