{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 38,
  "verses": [
    {
      "pk": 2038001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 1,
      "text": "He made the altar of burnt offering out of acacia wood. It was square, measuring five cubits long and five cubits wide, and three cubits high.",
      "links": "<a href='/AIV/2/27/1'>Exod 27:1</a>; <a href='/AIV/2/35/11'>Exod 35:11</a>",
      "comment": "This verse closely follows the earlier instructions in Exodus 27. The altar's construction sets the foundation for the sacrificial system, which ultimately points ahead to the perfect sacrifice, foreshadowing Christ's offering on the cross (Heb 9:12)."
    },
    {
      "pk": 2038002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 2,
      "text": "He made horns for it, one on each of its four corners; the horns were all of one piece with it, and he overlaid the altar with bronze.",
      "links": "<a href='/AIV/2/27/2'>Exod 27:2</a>; <a href='/AIV/3/8/15'>Lev 8:15</a>",
      "comment": "The horns symbolize strength and the mercy offered at the altar, where blood was applied during sacrifices—another shadow of the redemption found in Christ's blood (Luke 1:69; Heb 9:22)."
    },
    {
      "pk": 2038003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 3,
      "text": "He made all the utensils for the altar—the pots, shovels, basins, forks, and firepans. He made them out of bronze.",
      "links": "<a href='/AIV/2/27/3'>Exod 27:3</a>",
      "comment": "Each instrument had a specific purpose, emphasizing the intentionality and reverence with which God is to be worshiped. This care in worship echoes in Christ's establishment of new forms and means of grace (John 4:24), showing both literal and spiritual depth."
    },
    {
      "pk": 2038004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 4,
      "text": "He made a grate for the altar, a bronze network, which he placed under the ledge halfway up from the base.",
      "links": "<a href='/AIV/2/27/4'>Exod 27:4</a>",
      "comment": "The grate allowed the ashes to fall below, representing the offering rising up to God. Symbolically, this also points to Christ, whose sacrifice bridges earth and heaven (Eph 5:2), fulfilling the typology of the altar."
    },
    {
      "pk": 2038005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 5,
      "text": "He cast four rings for the four corners of the bronze network as holders for the poles.",
      "links": "<a href='/AIV/2/27/4'>Exod 27:4</a>",
      "comment": "The rings enabled transport, signifying the mobility of God's presence with His people—a prefiguration of the Church being present throughout the world, always gathered around the altar."
    },
    {
      "pk": 2038006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 6,
      "text": "He made poles of acacia wood and overlaid them with bronze.",
      "links": "<a href='/AIV/2/27/6'>Exod 27:6</a>",
      "comment": "The use of acacia wood overlaid with bronze again shows practical craftsmanship and symbolic meaning: incorruptibility and strength, both qualities found in Christ and the means He gives to approach God."
    },
    {
      "pk": 2038007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 7,
      "text": "He inserted the poles into the rings on the sides of the altar so it could be carried. He made it hollow, out of boards.",
      "links": "<a href='/AIV/2/27/7'>Exod 27:7</a>",
      "comment": "The portable design points to flexibility and ongoing movement of God’s people—foreshadowing the spreading of worship beyond any static place (John 4:21)."
    },
    {
      "pk": 2038008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 8,
      "text": "He made the basin of bronze and its stand of bronze, from the mirrors of the women who served at the entrance to the Tent of Meeting.",
      "links": "<a href='/AIV/2/30/18'>Exod 30:18</a>; <a href='/AIV/2/40/30'>Exod 40:30</a>",
      "comment": "The offering of the women’s mirrors is notable; it signifies self-sacrifice and purity. The basin’s use for washing prefigures cleansing rituals and, spiritually, the washing of regeneration (Titus 3:5), a sign of entering into worship."
    },
    {
      "pk": 2038009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 9,
      "text": "He made the courtyard. On the south side, the hangings of the courtyard were made of finely twisted linen, a hundred cubits long.",
      "links": "<a href='/AIV/2/27/9'>Exod 27:9</a>",
      "comment": "The use of pure, fine linen represents righteousness (Rev 19:8). The courtyard boundaries provide a physical separation, spiritually echoing the call to holiness among God’s people."
    },
    {
      "pk": 20380010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 10,
      "text": "Its twenty posts and their twenty bronze bases had silver hooks and bands on the posts.",
      "links": "<a href='/AIV/2/27/10'>Exod 27:10</a>",
      "comment": "Silver often points to redemption (Num 18:16) and is seen here alongside the bronze, linking sacrifice and atonement. The structure’s enduring elements quietly recall the enduring nature of God’s covenant community."
    },
    {
      "pk": 20380011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 11,
      "text": "On the north side, the length was also a hundred cubits, with twenty posts and bronze bases, and the hooks and bands for the posts were silver.",
      "links": "<a href='/AIV/2/27/11'>Exod 27:11</a>",
      "comment": "The repetition signifies the importance of order and symmetry in worship, a reminder of the harmonious unity among God’s people."
    },
    {
      "pk": 20380012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 12,
      "text": "On the west side, there were hangings fifty cubits long, with ten posts and their ten bases; the hooks and bands on the posts were silver.",
      "links": "<a href='/AIV/2/27/12'>Exod 27:12</a>",
      "comment": "Each side of the courtyard has its specified length, supporting the concept of a divinely ordered space where worship takes place according to God’s commands."
    },
    {
      "pk": 20380013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 13,
      "text": "On the east side, towards the sunrise, the courtyard was also fifty cubits long.",
      "links": "<a href='/AIV/2/27/13'>Exod 27:13</a>",
      "comment": "Eastward positioning recalls Eden (Gen 2:8) and Christ as the rising Sun (Luke 1:78), drawing attention to new beginnings and divine presence."
    },
    {
      "pk": 20380014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 14,
      "text": "The hangings on one side of the gate were fifteen cubits long, with three posts and three bases.",
      "links": "<a href='/AIV/2/27/14'>Exod 27:14</a>",
      "comment": "Details like the posts and bases highlight stability and orderly access to God, prefiguring the spiritual discipline necessary for entering into worship."
    },
    {
      "pk": 20380015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 15,
      "text": "And the same was true on the other side—fifteen cubits of hangings, with three posts and three bases.",
      "links": "<a href='/AIV/2/27/15'>Exod 27:15</a>",
      "comment": "The symmetry on both sides presents a unified entry, reflecting the inclusivity and unity of the one people gathered at God’s invitation."
    },
    {
      "pk": 20380016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 16,
      "text": "All the hangings around the courtyard were of finely twisted linen.",
      "links": "<a href='/AIV/2/27/16'>Exod 27:16</a>",
      "comment": "The repeated mention of fine linen again points to purity, foreshadowing the call to holiness given to the Church (Eph 5:27)."
    },
    {
      "pk": 20380017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 17,
      "text": "The bases for the posts were bronze, and the hooks and bands for the posts were silver; the tops of the posts were overlaid with silver, and all the posts around the courtyard had silver bands.",
      "links": "<a href='/AIV/2/27/17'>Exod 27:17</a>",
      "comment": "Combining bronze and silver offers a visible reminder of both judgment (bronze) and mercy/redemption (silver), recurring themes that come to fullness in Christ."
    },
    {
      "pk": 20380018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 18,
      "text": "The curtain for the entrance to the courtyard was embroidered with blue, purple, and scarlet yarn, and finely twisted linen—the work of an embroiderer. It was twenty cubits long and, like the other hangings, five cubits high.",
      "links": "<a href='/AIV/2/27/16'>Exod 27:16</a>; <a href='/AIV/2/36/37'>Exod 36:37</a>",
      "comment": "The beautiful colors and craftsmanship signal reverence for God. Such careful preparations point to the dignity of worship and the honor given to God in His dwelling, anticipating the fullness of worship in heaven (Rev 7:9)."
    },
    {
      "pk": 20380019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 19,
      "text": "It had four posts with four bronze bases, and their hooks and bands were silver, with the tops overlaid with silver.",
      "links": "<a href='/AIV/2/36/38'>Exod 36:38</a>",
      "comment": "The structure allows for a distinguished entrance, reinforcing the sacredness of entering into God’s presence."
    },
    {
      "pk": 20380020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 20,
      "text": "All the tent pegs for the tabernacle and for the courtyard all around were made of bronze.",
      "links": "<a href='/AIV/2/27/19'>Exod 27:19</a>",
      "comment": "Bronze, a strong and lasting material, symbolizes endurance and steadfastness, qualities meant for the believer and the community gathered in faith."
    },
    {
      "pk": 20380021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 21,
      "text": "This is the inventory of the tabernacle, the Tabernacle of the Testimony, as recorded by the Levites under the direction of Ithamar son of Aaron, the priest.",
      "links": "<a href='/AIV/2/39/32'>Exod 39:32</a>",
      "comment": "Careful record-keeping highlights integrity and accountability in worship, entrusted to the ordained mediators (Levites), a principle seen in later Church order."
    },
    {
      "pk": 20380022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 22,
      "text": "Bezalel son of Uri, son of Hur, of the tribe of Judah, made everything that the LORD commanded Moses.",
      "links": "<a href='/AIV/2/31/2'>Exod 31:2</a>; <a href='/AIV/2/36/1'>Exod 36:1</a>",
      "comment": "Bezalel’s obedience and artistry point to how God equips chosen leaders for service, prefiguring Christ—the ultimate obedient servant from the tribe of Judah."
    },
    {
      "pk": 20380023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 23,
      "text": "With him was Oholiab son of Ahisamach, of the tribe of Dan, an engraver, designer, and embroiderer in blue, purple, and scarlet yarn and in fine linen.",
      "links": "<a href='/AIV/2/31/6'>Exod 31:6</a>",
      "comment": "The inclusion of Oholiab from a different tribe shows the collaborative nature of sacred work. This synergy foreshadows the later unity and diversity within the People of God working together for worship."
    },
    {
      "pk": 20380024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 24,
      "text": "The total gold from the offerings used for all the work of the sanctuary was twenty-nine talents and seven hundred thirty shekels, according to the sanctuary shekel.",
      "links": "<a href='/AIV/2/25/3'>Exod 25:3</a>",
      "comment": "Such quantities indicate great sacrifice and generosity, teaching that worship involves wholehearted giving—a theme fulfilled when Christ gave Himself fully."
    },
    {
      "pk": 20380025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 25,
      "text": "The silver from those of the congregation who were counted was a hundred talents and one thousand seven hundred seventy-five shekels, according to the sanctuary shekel.",
      "links": "<a href='/AIV/2/30/13'>Exod 30:13</a>",
      "comment": "The silver, part of the census offering, prefigures atonement and redemption for every soul included—a spiritual promise of the redemption found in Christ (1 Pet 1:18-19)."
    },
    {
      "pk": 20380026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 26,
      "text": "This amounted to one beka per person, that is, half a shekel, according to the sanctuary shekel, for everyone who was counted, from twenty years old and up—six hundred three thousand, five hundred fifty men.",
      "links": "<a href='/AIV/2/30/15'>Exod 30:15</a>; <a href='/AIV/4/1/46'>Num 1:46</a>",
      "comment": "Equal contribution from all men reflects solidarity and responsibility for the sanctuary—a feature of the unified body of believers."
    },
    {
      "pk": 20380027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 27,
      "text": "The hundred talents of silver were used to cast the bases of the sanctuary and of the curtain—one hundred bases from one hundred talents, one talent for each base.",
      "links": "<a href='/AIV/2/26/19'>Exod 26:19</a>",
      "comment": "Each base made possible the proper setting for God’s presence. Foundations matter—a motif Christ uses when He calls Himself the cornerstone (Eph 2:20)."
    },
    {
      "pk": 20380028,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 28,
      "text": "With the one thousand seven hundred seventy-five shekels he made hooks for the posts, overlaid their tops, and made their bands.",
      "links": "<a href='/AIV/2/26/32'>Exod 26:32</a>",
      "comment": "Attention to detail shows that everything contributing to worship matters. This careful assembly foreshadows spiritual perfection and beauty in God’s household."
    },
    {
      "pk": 20380029,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 29,
      "text": "The bronze from the offerings was seventy talents and two thousand four hundred shekels.",
      "links": "<a href='/AIV/2/25/3'>Exod 25:3</a>",
      "comment": "Bronze symbolizes judgment (Num 21:9). The offerings demonstrate the cost and seriousness of approaching God—a theme realized in Christ’s sacrificial death."
    },
    {
      "pk": 20380030,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 30,
      "text": "With it, he made the bases for the entrance to the Tent of Meeting, the bronze altar and its bronze grate and all its utensils, the bases for the courtyard all around, and for the entrance to the courtyard, and all the tent pegs for the tabernacle and the courtyard.",
      "links": "<a href='/AIV/2/27/19'>Exod 27:19</a>; <a href='/AIV/2/26/37'>Exod 26:37</a>",
      "comment": "All these elements work together toward a unified purpose: facilitating worship and communion with God, prefiguring the sacramental life and spiritual unity in Christ's gathering."
    },
    {
      "pk": 20380031,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 38,
      "verse": 31,
      "text": "for the bases of the courtyard all around, and the bases for the gate of the courtyard, all the pegs for the tabernacle, and all the pegs around the courtyard.",
      "links": "<a href='/AIV/2/27/19'>Exod 27:19</a>",
      "comment": "The repetition highlights the importance of maintaining stability in all aspects of worship, suggesting the need for careful structure and leadership—a principle vital in the ongoing life of the worshiping community."
    }
  ],
  "translatedAt": "2025-12-24T01:08:29.904Z"
}