{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 11,
  "verses": [
    {
      "pk": 2011001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 11,
      "verse": 1,
      "text": "The LORD said to Moses, “I will bring one more plague on Pharaoh and on Egypt. After that, he will let you go from here. When he lets you go, he will forcefully drive you out altogether.”",
      "links": "<a href='/AIV/2/12/31'>Exod 12:31-33</a>; <a href='/AIV/19/105/36'>Ps. 105:36</a>",
      "comment": "This verse introduces the final and decisive act of judgment on Egypt. It emphasizes God's sovereignty and foreknowledge. Note the phrase 'forcefully drive you out,' suggesting not only release but expulsion, highlighting the dramatic reversal from previous reluctance (Exod 12:31-33). The spiritual interpretation also foreshadows ultimate liberation from bondage, an image later fulfilled in Christ."
    },
    {
      "pk": 2011002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 11,
      "verse": 2,
      "text": "Speak now in the hearing of the people, so that every man may ask his neighbor and every woman her neighbor for articles of silver and gold.”",
      "links": "<a href='/AIV/2/3/21-22'>Exod 3:21-22</a>; <a href='/AIV/2/12/35-36'>Exod 12:35-36</a>",
      "comment": "Here, God fulfills His earlier promise (Exod 3:21-22) that the Israelites would not leave empty-handed, but with gifts from the Egyptians. This mirrors the justice and restoration for years of servitude. The request for silver and gold has spiritual resonance with receiving spiritual riches through obedience and faith (Eph 1:7-8)."
    },
    {
      "pk": 2011003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 11,
      "verse": 3,
      "text": "And the LORD gave the people favor in the sight of the Egyptians. Moreover, Moses himself became highly esteemed in the land of Egypt, in the eyes of Pharaoh’s servants and the people.",
      "links": "<a href='/AIV/2/12/36'>Exod 12:36</a>; <a href='/AIV/1/41/41-44'>Gen 41:41-44</a>",
      "comment": "The divine favor shown to the Israelites and the high regard for Moses echo Joseph's rise in Egypt (Gen 41:41-44). God’s providential grace is not limited to His people but extends even into the hearts of those outside. This 'favor' prefigures the elevation of those faithful in God's plan, a theme seen in the communion of saints."
    },
    {
      "pk": 2011004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 11,
      "verse": 4,
      "text": "Moses said, “This is what the LORD says: ‘About midnight I will go out into the midst of Egypt,'",
      "links": "<a href='/AIV/2/12/29'>Exod 12:29</a>; <a href='/AIV/19/135/8-9'>Ps. 135:8-9</a>",
      "comment": "God's personal intervention is emphasized, demonstrating His direct involvement in judgment. The timing at midnight conveys suddenness and completeness (Exod 12:29). Spiritually, it mirrors the eschatological coming of the Lord (Matt 25:6)."
    },
    {
      "pk": 2011005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 11,
      "verse": 5,
      "text": "and every firstborn in the land of Egypt will die, from Pharaoh’s firstborn who sits on his throne, to the firstborn of the slave girl who is behind the millstone, and all the firstborn of the cattle.",
      "links": "<a href='/AIV/2/12/29-30'>Exod 12:29-30</a>; <a href='/AIV/19/78/51'>Ps. 78:51</a>",
      "comment": "The judgment is universal, affecting all social classes, even animals, emphasizing the totality of God’s justice. The theme of the firstborn is significant; it foreshadows the redemption of the firstborn, culminating in Christ as the firstborn among many brethren (Rom 8:29; Col 1:18; Heb 12:23)."
    },
    {
      "pk": 2011006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 11,
      "verse": 6,
      "text": "There shall be a great cry throughout all the land of Egypt, such as there has never been nor ever will be again.",
      "links": "<a href='/AIV/2/12/30'>Exod 12:30</a>; <a href='/AIV/19/105/38'>Ps. 105:38</a>",
      "comment": "The singularity of Egypt’s sorrow highlights the unprecedented nature of this judgment. The 'great cry' is reminiscent of the earlier cries of the Israelites in bondage (Exod 2:23). It displays the reversal in God’s deliverance and redemption through suffering."
    },
    {
      "pk": 2011007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 11,
      "verse": 7,
      "text": "But among all the Israelites, not even a dog will bark at either man or animal, so that you may know that the LORD makes a distinction between Egypt and Israel.",
      "links": "<a href='/AIV/2/8/22'>Exod 8:22</a>; <a href='/AIV/2/9/4'>Exod 9:4</a>",
      "comment": "The supernatural peace for Israel accentuates God’s protective power, underscoring divine election. The 'distinction' points to God’s intimate care for His chosen people, a theme continued in Christ’s relationship with His Church (John 17:6,9)."
    },
    {
      "pk": 2011008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 11,
      "verse": 8,
      "text": "All these your servants will come down to me and bow themselves before me, saying, ‘Go out, you and all the people who follow you.’ After that I will go out.” And he left Pharaoh’s presence in hot anger.",
      "links": "<a href='/AIV/2/12/31'>Exod 12:31</a>; <a href='/AIV/19/105/38'>Ps. 105:38</a>",
      "comment": "Moses prophesies the Egyptians’ humiliating request for prompt departure. The motif of bowing foreshadows the recognition of God’s authority and even the reverence given to God’s ordained leaders (1 Kings 2:19; Phil 2:10). Moses’ anger at Pharaoh highlights both righteous indignation and the gravity of persistent hardness of heart."
    },
    {
      "pk": 2011009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 11,
      "verse": 9,
      "text": "The LORD had said to Moses, “Pharaoh will not listen to you, so that my wonders may be multiplied in the land of Egypt.”",
      "links": "<a href='/AIV/2/7/3-5'>Exod 7:3-5</a>; <a href='/AIV/2/4/21'>Exod 4:21</a>",
      "comment": "God's foreknowledge and sovereign purpose in hardening Pharaoh’s heart serve to magnify His power through signs and wonders. This prefigures signs granted in the ministry of Jesus and His apostles (John 12:37-40; Acts 2:22)."
    },
    {
      "pk": 2011010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 11,
      "verse": 10,
      "text": "Moses and Aaron performed all these wonders before Pharaoh, but the LORD hardened Pharaoh’s heart, and he would not let the Israelites go out of his land.",
      "links": "<a href='/AIV/2/4/21'>Exod 4:21</a>; <a href='/AIV/2/7/13'>Exod 7:13</a>; <a href='/AIV/2/10/20'>Exod 10:20</a>",
      "comment": "The summary emphasizes both God’s patience and justice in the face of repeated resistance. The divine hardening of Pharaoh’s heart demonstrates the mysterious cooperation between God's sovereignty and human responsibility. The persistent ministry despite rejection can be seen as a template for faithful proclamation by the Church throughout history (Acts 5:29-32)."
    }
  ],
  "translatedAt": "2025-12-24T00:52:08.864Z"
}