{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 6,
  "verses": [
    {
      "pk": 2006001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 1,
      "text": "Then the LORD said to Moses, 'Now you will see what I will do to Pharaoh. Because of a strong hand, he will let them go; indeed, because of a mighty hand, he will drive them out of his land.'",
      "links": "<a href='/AIV/1/15/13-14'>Gen. 15:13-14</a>; <a href='/AIV/2/3/19-20'>Exod. 3:19-20</a>",
      "comment": "God assures Moses of His power over Pharaoh. The 'strong hand' emphasizes divine intervention for deliverance, preparing the way for the exodus. This foreshadows God's ultimate authority and His saving action, prefiguring later salvation through Christ."
    },
    {
      "pk": 2006002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 2,
      "text": "God spoke to Moses and said to him, 'I am the LORD.'",
      "links": "<a href='/AIV/2/3/14'>Exod. 3:14</a>; <a href='/AIV/3/26/12'>Lev. 26:12</a>",
      "comment": "'I am the LORD' reaffirms God's covenant name (YHWH) and His faithfulness. Revealing His name points to mystery and majesty, with parallels in Christ’s own declarations of 'I AM' (John 8:58)."
    },
    {
      "pk": 2006003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 3,
      "text": "'I appeared to Abraham, to Isaac, and to Jacob as God Almighty, but by my name the LORD I was not known to them.'",
      "links": "<a href='/AIV/1/17/1'>Gen. 17:1</a>; <a href='/AIV/1/35/11'>Gen. 35:11</a>",
      "comment": "God reveals a deeper understanding of Himself. The patriarchs knew God as 'El Shaddai' (God Almighty); now, Israel is learning the unique covenant name. This progressive revelation anticipates Christ’s fulfillment of God’s promises."
    },
    {
      "pk": 2006004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 4,
      "text": "'I also established my covenant with them, to give them the land of Canaan, the land in which they lived as sojourners.'",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/1/15/18'>Gen. 15:18</a>",
      "comment": "God recalls His promise to the patriarchs. The idea of covenant underscores God's desire for relationship, ultimately fulfilled in the new covenant through Christ (Luke 22:20)."
    },
    {
      "pk": 2006005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 5,
      "text": "'I have also heard the groaning of the Israelites, whom the Egyptians hold as slaves, and I have remembered my covenant.'",
      "links": "<a href='/AIV/2/2/24'>Exod. 2:24</a>; <a href='/AIV/19/105/8-10'>Ps. 105:8-10</a>",
      "comment": "God’s remembrance is active and faithful. This shows divine compassion and covenant fidelity, a precursor to God’s deliverance accomplished in Christ for all who are ‘slaves to sin’ (Romans 6:17-18)."
    },
    {
      "pk": 2006006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 6,
      "text": "'Say therefore to the Israelites: I am the LORD, and I will bring you out from under the burdens of the Egyptians. I will deliver you from their slavery, and I will redeem you with an outstretched arm and with great judgments.'",
      "links": "<a href='/AIV/1/15/13-14'>Gen. 15:13-14</a>; <a href='/AIV/2/3/8'>Exod. 3:8</a>",
      "comment": "‘Redeem’ here hints at God as a kinsman-redeemer, a theme later fulfilled in Christ’s sacrificial work (Mark 10:45). The ‘outstretched arm’ echoes imagery of divine strength and protection, also seen in messianic expectations."
    },
    {
      "pk": 2006007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 7,
      "text": "'I will take you as my own people, and I will be your God. You will know that I am the LORD your God, who brings you out from under the burdens of the Egyptians.'",
      "links": "<a href='/AIV/3/26/12'>Lev. 26:12</a>; <a href='/AIV/24/31/33'>Jer. 31:33</a>",
      "comment": "God’s promise to claim His people prefigures the spiritual union of Christ and the Church (Ephesians 5:25-27). The intimate relationship points toward the fulfillment found in the new covenant."
    },
    {
      "pk": 2006008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 8,
      "text": "'I will bring you into the land I swore to give to Abraham, Isaac, and Jacob. I will give it to you as an inheritance. I am the LORD.'",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/1/28/13'>Gen. 28:13</a>",
      "comment": "The inheritance imagery links to the promised inheritance for all believers in Christ (Galatians 3:29; Hebrews 9:15). God’s faithfulness persists throughout salvation history."
    },
    {
      "pk": 2006009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 9,
      "text": "Moses spoke thus to the Israelites, but they did not listen to Moses because of their broken spirit and harsh slavery.",
      "links": "<a href='/AIV/2/5/21-23'>Exod. 5:21-23</a>; <a href='/AIV/43/11/39-40'>John 11:39-40</a>",
      "comment": "Human despair often leads to doubt even when God’s promise is spoken. The narrative highlights faith’s struggle—later mirrored in the New Testament when many cannot see past suffering to the hope Christ brings."
    },
    {
      "pk": 2006010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 10,
      "text": "So the LORD said to Moses,",
      "links": "<a href='/AIV/2/3/10'>Exod. 3:10</a>",
      "comment": "God’s continued conversation shows perseverance in revelation, similar to Christ’s patience with the apostles (Luke 24:25-27)."
    },
    {
      "pk": 2006011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 11,
      "text": "'Go in, and tell Pharaoh king of Egypt to let the Israelites go out of his land.'",
      "links": "<a href='/AIV/2/3/18'>Exod. 3:18</a>; <a href='/AIV/2/5/1'>Exod. 5:1</a>",
      "comment": "God commands perseverance in speaking His Word, as prophets and apostles are later sent. Obedience, even when facing resistance, is a recurring call in Scripture."
    },
    {
      "pk": 2006012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 12,
      "text": "But Moses answered before the LORD, 'Look, the Israelites have not listened to me; how then will Pharaoh listen to me, since I am unskilled in speech?'",
      "links": "<a href='/AIV/2/4/10'>Exod. 4:10</a>; <a href='/AIV/24/1/6'>Jer. 1:6</a>",
      "comment": "Moses’ hesitation reflects human limitation. God can work through humble instruments, foreshadowing later examples, such as the apostles who were seen as ‘unlearned’ yet powerfully used (Acts 4:13)."
    },
    {
      "pk": 2006013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 13,
      "text": "Then the LORD spoke to Moses and Aaron, and gave them a command for the Israelites and for Pharaoh king of Egypt, to bring the Israelites out of the land of Egypt.",
      "links": "<a href='/AIV/2/3/10'>Exod. 3:10</a>; <a href='/AIV/2/4/27-30'>Exod. 4:27-30</a>",
      "comment": "God’s charge includes a shared mission for Moses and Aaron, anticipating later biblical models of leadership and apostolic succession (Matthew 28:19-20)."
    },
    {
      "pk": 2006014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 14,
      "text": "These are the heads of their fathers’ houses: The sons of Reuben, the firstborn of Israel: Hanoch, Pallu, Hezron, and Carmi; these are the clans of Reuben.",
      "links": "<a href='/AIV/1/46/9'>Gen. 46:9</a>; <a href='/AIV/4/26/5-7'>Num. 26:5-7</a>",
      "comment": "The genealogy confirms historical continuity and familial leadership. Such listings highlight the importance of succession, tradition, and remembrance—key biblical themes."
    },
    {
      "pk": 2006015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 15,
      "text": "The sons of Simeon: Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul—the son of a Canaanite woman. These are the clans of Simeon.",
      "links": "<a href='/AIV/1/46/10'>Gen. 46:10</a>; <a href='/AIV/4/26/12-14'>Num. 26:12-14</a>",
      "comment": "Details about origins show inclusivity within Israel’s lineage. This serves as early precedent for God’s mercy extending beyond strict ethnic boundaries, later seen in Christ’s outreach (Matthew 15:21-28)."
    },
    {
      "pk": 2006016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 16,
      "text": "These are the names of the sons of Levi, according to their generations: Gershon, Kohath, and Merari. Levi lived one hundred thirty-seven years.",
      "links": "<a href='/AIV/1/46/11'>Gen. 46:11</a>; <a href='/AIV/4/26/57-59'>Num. 26:57-59</a>",
      "comment": "Levi’s descendants become central to priestly ministry. Priestly succession is rooted here, leading to the importance of ordained ministry as a biblical theme (Hebrews 5:1-4)."
    },
    {
      "pk": 2006017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 17,
      "text": "The sons of Gershon: Libni and Shimei, by their clans.",
      "links": "<a href='/AIV/4/3/18'>Num. 3:18</a>",
      "comment": "The genealogy of Levi sets up the foundation for priestly service, emphasizing structure and ordained roles within the people of God."
    },
    {
      "pk": 2006018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 18,
      "text": "The sons of Kohath: Amram, Izhar, Hebron, and Uzziel. Kohath lived one hundred thirty-three years.",
      "links": "<a href='/AIV/4/3/19-20'>Num. 3:19-20</a>",
      "comment": "Kohath’s genealogy gives context for Moses and Aaron’s lineage, highlighting the roots of priesthood and leadership by divine providence."
    },
    {
      "pk": 2006019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 19,
      "text": "The sons of Merari: Mahli and Mushi. These are the clans of the Levites according to their generations.",
      "links": "<a href='/AIV/4/3/33'>Num. 3:33</a>; <a href='/AIV/4/26/58'>Num. 26:58'",
      "comment": "Listing of Merari connects with Levitical responsibilities and the ordering of worship, which is significant in shaping communal life and liturgical practice."
    },
    {
      "pk": 2006020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 20,
      "text": "Amram married Jochebed, his father's sister, and she bore him Aaron and Moses. Amram lived one hundred thirty-seven years.",
      "links": "<a href='/AIV/4/26/59'>Num. 26:59</a>",
      "comment": "The birth of Moses and Aaron from Levi’s house points to legitimate ordained ministry rooted in divine calling. This genealogy highlights the importance of spiritual authority being passed faithfully through generations."
    },
    {
      "pk": 2006021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 21,
      "text": "The sons of Izhar: Korah, Nepheg, and Zichri.",
      "links": "<a href='/AIV/4/16/1'>Num. 16:1</a>; <a href='/AIV/4/26/58'>Num. 26:58</a>",
      "comment": "Korah’s mention foreshadows later rebellion against God’s appointed leadership, teaching the lesson of obedience to divine order."
    },
    {
      "pk": 2006022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 22,
      "text": "The sons of Uzziel: Mishael, Elzaphan, and Sithri.",
      "links": "<a href='/AIV/3/10/4'>Lev. 10:4</a>",
      "comment": "Descendants are mentioned by name, underlying the importance of known lineage, which is crucial for proper service in the sanctuary."
    },
    {
      "pk": 2006023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 23,
      "text": "Aaron married Elisheba, daughter of Amminadab and sister of Nahshon; and she bore him Nadab, Abihu, Eleazar, and Ithamar.",
      "links": "<a href='/AIV/3/10/1-2'>Lev. 10:1-2</a>; <a href='/AIV/4/3/2'>Num. 3:2</a>",
      "comment": "Aaron’s sons play significant roles in later worship and service. The establishment of a priestly family prepares for the principle of ordered priesthood, which remains central in the practice of faith."
    },
    {
      "pk": 2006024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 24,
      "text": "The sons of Korah: Assir, Elkanah, and Abiasaph. These are the clans of the Korahites.",
      "links": "<a href='/AIV/4/26/58-59'>Num. 26:58-59</a>; <a href='/AIV/19/42/1'>Ps. 42:1</a>",
      "comment": "The descendants of Korah are later noted in the Psalms for their spiritual contributions, showing the potential for redemption and service even from problematic beginnings."
    },
    {
      "pk": 2006025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 25,
      "text": "Eleazar, Aaron’s son, married one of the daughters of Putiel, and she bore him Phinehas. These are the heads of the fathers' houses of the Levites by their clans.",
      "links": "<a href='/AIV/4/25/11-13'>Num. 25:11-13</a>",
      "comment": "Phinehas is later rewarded for his zeal, exemplifying faithful priestly service—a sign that God honors devotion and right worship."
    },
    {
      "pk": 2006026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 26,
      "text": "These are the Aaron and Moses to whom the LORD said, 'Bring the Israelites out of the land of Egypt according to their divisions.'",
      "links": "<a href='/AIV/2/3/10'>Exod. 3:10</a>; <a href='/AIV/4/33/1'>Num. 33:1</a>",
      "comment": "The text clarifies Moses and Aaron’s authoritative role, highlighting the importance of divinely appointed leaders for the guidance and sanctification of the people."
    },
    {
      "pk": 2006027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 27,
      "text": "They are the ones who spoke to Pharaoh king of Egypt to bring the Israelites out of Egypt; this Moses and this Aaron.",
      "links": "<a href='/AIV/2/5/1'>Exod. 5:1</a>",
      "comment": "Emphasis on ‘this Moses and this Aaron’ stresses the historical reality and personal nature of God's chosen instruments, paralleling later narrated apostolic acts."
    },
    {
      "pk": 2006028,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 28,
      "text": "Now it happened, on the day the LORD spoke to Moses in Egypt,",
      "links": "<a href='/AIV/2/7/1'>Exod. 7:1</a>",
      "comment": "Temporal markers reinforce the credibility and historicity of divine revelation—mirrored in New Testament references to 'the day' of Christ’s fulfillment."
    },
    {
      "pk": 2006029,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 29,
      "text": "the LORD said to Moses, 'I am the LORD; tell Pharaoh king of Egypt everything that I am telling you.'",
      "links": "<a href='/AIV/2/3/14'>Exod. 3:14</a>; <a href='/AIV/2/7/2'>Exod. 7:2</a>",
      "comment": "Repetition of 'I am the LORD' underlines divine authority and consistency, a theme that recurs in Scripture, and is ultimately revealed in Christ’s direct teaching."
    },
    {
      "pk": 2006030,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 6,
      "verse": 30,
      "text": "But Moses said to the LORD, 'Look, I am unskilled in speech; how will Pharaoh listen to me?'",
      "links": "<a href='/AIV/2/4/10'>Exod. 4:10</a>; <a href='/AIV/24/1/6'>Jer. 1:6</a>",
      "comment": "Moses’ humility and sense of inadequacy points to the need for dependence on God’s grace, reminiscent of Paul’s reflection, ‘God’s power is made perfect in weakness’ (2 Corinthians 12:9). God’s choice of humble servants is a key theme throughout Scripture."
    }
  ],
  "translatedAt": "2025-12-24T00:49:51.267Z"
}