{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 20,
  "verses": [
    {
      "pk": 2020001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 1,
      "text": "Then God spoke all these words:",
      "links": "<a href='/AIV/5/5/22'>Deut. 5:22</a>",
      "comment": "The giving of the Ten Commandments begins with God Himself speaking directly to the people, highlighting the authority and unchanging nature of these words. Compare with Deuteronomy 5:22, where Moses recounts the event."
    },
    {
      "pk": 2020002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 2,
      "text": "I am the LORD your God, who brought you out of the land of Egypt, out of the house of slavery.",
      "links": "<a href='/AIV/5/5/6'>Deut. 5:6</a>; <a href='/AIV/3/26/13'>Lev. 26:13</a>",
      "comment": "God begins the commandments by establishing His relationship with Israel as Redeemer and Lord. This introduces the context for the commandments as rooted in God's saving action. Compare with Deut. 5:6 and Lev. 26:13."
    },
    {
      "pk": 2020003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 3,
      "text": "You shall have no other gods before Me.",
      "links": "<a href='/AIV/5/6/4'>Deut. 6:4</a>; <a href='/AIV/23/45/5'>Isa. 45:5</a>",
      "comment": "The first commandment affirms monotheism and the exclusive worship of the one true God. This forms the foundation for authentic worship and a united faith. Later, Jesus affirms the greatest commandment is to love God with all one’s heart (Mark 12:29-30)."
    },
    {
      "pk": 2020004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 4,
      "text": "You shall not make for yourself a carved image, nor any likeness of anything that is in heaven above, or on the earth beneath, or in the water under the earth.",
      "links": "<a href='/AIV/3/19/4'>Lev. 19:4</a>; <a href='/AIV/23/44/9-20'>Isa. 44:9-20</a>",
      "comment": "This commandment forbids idolatry in all forms. It emphasizes the transcendence of God and sets Israel apart from pagan practices. The Church continues to stress the spiritual worship, understanding holy images as pointing beyond themselves to heavenly realities (cf. John 4:24, Col. 1:15)."
    },
    {
      "pk": 2020005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 5,
      "text": "You shall not bow down to them or serve them, for I, the LORD your God, am a jealous God, visiting the iniquity of the fathers on the children to the third and the fourth generation of those who hate Me,",
      "links": "<a href='/AIV/5/5/9'>Deut. 5:9</a>; <a href='/AIV/6/7/10'>Josh. 7:10</a>",
      "comment": "God warns of the consequences of idolatry, which can perpetuate across generations, especially when families turn away from Him. This passage should be understood as the natural spiritual consequences of sin within families (see Ezek. 18:20)."
    },
    {
      "pk": 2020006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 6,
      "text": "but showing steadfast love to thousands of those who love Me and keep My commandments.",
      "links": "<a href='/AIV/5/7/9'>Deut. 7:9</a>; <a href='/AIV/19/103/17-18'>Ps. 103:17-18</a>",
      "comment": "God’s mercy greatly outweighs His judgment: blessing extends to thousands who remain faithful. Jesus later affirms the need to keep His commandments as an expression of love (John 14:15)."
    },
    {
      "pk": 2020007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 7,
      "text": "You shall not take the name of the LORD your God in vain, for the LORD will not leave unpunished anyone who takes His name in vain.",
      "links": "<a href='/AIV/3/19/12'>Lev. 19:12</a>; <a href='/AIV/24/7/9-10'>Jer. 7:9-10</a>",
      "comment": "The sacredness of God’s name is emphasized here. Reverence in speech, oath, and deed is required in both Old and New Testaments (see Matt. 6:9; James 5:12)."
    },
    {
      "pk": 2020008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 8,
      "text": "Remember the Sabbath day, to keep it holy.",
      "links": "<a href='/AIV/5/5/12'>Deut. 5:12</a>; <a href='/AIV/1/2/2-3'>Gen. 2:2-3</a>",
      "comment": "God commands not only rest but also holiness for one day a week, reflecting His own rest at creation. This concept is later deepened as Christian worship centers on the day of the Lord’s Resurrection (Rev. 1:10)."
    },
    {
      "pk": 2020009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 9,
      "text": "Six days you shall labor and do all your work,",
      "links": "<a href='/AIV/3/23/3'>Lev. 23:3</a>",
      "comment": "The command distinguishes between the ordinary work of daily life and the holy rest of the Sabbath. Work is good and ordained by God, yet true rest completes and sanctifies our lives."
    },
    {
      "pk": 20200010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 10,
      "text": "but the seventh day is a Sabbath to the LORD your God. On it you shall not do any work, neither you, nor your son, nor your daughter, nor your male servant, nor your female servant, nor your livestock, nor the stranger who is within your gates.",
      "links": "<a href='/AIV/3/25/4'>Lev. 25:4</a>; <a href='/AIV/5/5/14'>Deut. 5:14</a>",
      "comment": "The Sabbath rest is universal for every household member and even animals. The structure of community worship and rest is foundational for the unity and holiness of God’s people. The principle anticipates the spiritual rest found in Christ (Heb. 4:9-10)."
    },
    {
      "pk": 20200011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 11,
      "text": "For in six days the LORD made the heavens and the earth, the sea, and all that is in them, and rested the seventh day. Therefore the LORD blessed the Sabbath day and made it holy.",
      "links": "<a href='/AIV/1/2/2-3'>Gen. 2:2-3</a>; <a href='/AIV/19/146/6'>Ps. 146:6</a>",
      "comment": "The root of the Sabbath commandment is creation itself. The Sabbath prefigures the new creation and points to the eternal rest to come (cf. Heb. 4:4-11)."
    },
    {
      "pk": 20200012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 12,
      "text": "Honor your father and your mother, that you may live long in the land that the LORD your God is giving you.",
      "links": "<a href='/AIV/5/5/16'>Deut. 5:16</a>; <a href='/AIV/49/6/2-3'>Eph. 6:2-3</a>",
      "comment": "The first commandment with a promise. Respect for parents underpins a stable and moral society and anticipates honoring spiritual authorities (cf. Heb. 13:17)."
    },
    {
      "pk": 20200013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 13,
      "text": "You shall not murder.",
      "links": "<a href='/AIV/5/5/17'>Deut. 5:17</a>; <a href='/AIV/40/5/21-22'>Matt. 5:21-22</a>",
      "comment": "Life is sacred and belongs to God alone; this includes implications for the protection of all innocent life. Jesus expands this commandment to include anger and hatred (Matt. 5:21-22), teaching the law’s true spiritual intent."
    },
    {
      "pk": 20200014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 14,
      "text": "You shall not commit adultery.",
      "links": "<a href='/AIV/5/5/18'>Deut. 5:18</a>; <a href='/AIV/40/5/27-28'>Matt. 5:27-28</a>",
      "comment": "Fidelity in marriage reflects God’s faithfulness to His people. Jesus deepens this teaching by addressing not only the act but also purity of heart (Matt. 5:27-28)."
    },
    {
      "pk": 20200015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 15,
      "text": "You shall not steal.",
      "links": "<a href='/AIV/5/5/19'>Deut. 5:19</a>; <a href='/AIV/3/19/11'>Lev. 19:11</a>",
      "comment": "Property rights are protected, and respect for the goods of others is commanded. Integrity is both a legal and a spiritual principle."
    },
    {
      "pk": 20200016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 16,
      "text": "You shall not bear false witness against your neighbor.",
      "links": "<a href='/AIV/5/5/20'>Deut. 5:20</a>; <a href='/AIV/3/19/16'>Lev. 19:16</a>",
      "comment": "Truthfulness and justice are essential for community life. Jesus claims to be ‘the Truth’ (John 14:6); by living the truth, believers reflect His light to the world."
    },
    {
      "pk": 20200017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 17,
      "text": "You shall not covet your neighbor’s house. You shall not covet your neighbor’s wife, or his male servant, or his female servant, or his ox, or his donkey, or anything that belongs to your neighbor.",
      "links": "<a href='/AIV/5/5/21'>Deut. 5:21</a>; <a href='/AIV/45/7/7'>Rom. 7:7</a>",
      "comment": "God’s law reaches to the inner desires and intentions of the heart, not just outward actions. Paul makes explicit the spiritual application of coveting (Rom. 7:7-8)."
    },
    {
      "pk": 20200018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 18,
      "text": "All the people saw the thunder and the flashes of lightning, and the sound of the trumpet and the mountain smoking. When the people saw it, they trembled and stood far off.",
      "links": "<a href='/AIV/5/5/23-27'>Deut. 5:23-27</a>; <a href='/AIV/58/12/18-21'>Heb. 12:18-21</a>",
      "comment": "The manifestation of God’s presence causes fear and awe, underscoring that divine revelation is a profound and serious encounter. See Heb. 12:18-21 for a spiritual parallel to this theophany."
    },
    {
      "pk": 20200019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 19,
      "text": "They said to Moses, 'You speak to us, and we will listen; but do not let God speak to us, or we will die.'",
      "links": "<a href='/AIV/5/5/25-27'>Deut. 5:25-27</a>",
      "comment": "The people’s fear illustrates human limitations before God’s holiness, and their need for a mediator. Moses prefigures the one ultimate Mediator (1 Tim. 2:5; Heb. 3:1-6)."
    },
    {
      "pk": 20200020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 20,
      "text": "Moses said to the people, 'Do not fear, for God has come to test you, that His fear may be before you, so that you may not sin.'",
      "links": "<a href='/AIV/5/8/2'>Deut. 8:2</a>; <a href='/AIV/20/16/6'>Prov. 16:6</a>",
      "comment": "Righteous fear of God is intended to lead to holiness, not despair. Tests and trials are permitted by God for the deepening of faith and purification from sin."
    },
    {
      "pk": 20200021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 21,
      "text": "The people stood far off, while Moses drew near to the thick darkness where God was.",
      "links": "<a href='/AIV/19/97/2'>Ps. 97:2</a>; <a href='/AIV/5/5/22-27'>Deut. 5:22-27</a>",
      "comment": "Moses alone enters the cloud, symbolizing his unique role as mediator. Later, Christ fulfills this role perfectly, granting believers access to God (Heb. 10:19-22)."
    },
    {
      "pk": 20200022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 22,
      "text": "Then the LORD said to Moses, 'Tell the people of Israel: You have seen that I have spoken with you from heaven.'",
      "links": "<a href='/AIV/5/4/36'>Deut. 4:36</a>",
      "comment": "Divine revelation is not a human invention, but a direct encounter with the living God. This sets the foundation for the authority of the following instructions."
    },
    {
      "pk": 20200023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 23,
      "text": "'You shall not make gods of silver to be with Me, nor shall you make for yourselves gods of gold.'",
      "links": "<a href='/AIV/2/32/1-4'>Exod. 32:1-4</a>; <a href='/AIV/3/19/4'>Lev. 19:4</a>",
      "comment": "This restates and expands the prohibition against idolatry given earlier, preparing for later incidents like the golden calf (Exod. 32)."
    },
    {
      "pk": 20200024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 24,
      "text": "'An altar of earth you shall make for Me and sacrifice on it your burnt offerings and your peace offerings, your sheep and your cattle. In every place where I cause My name to be remembered, I will come to you and bless you.'",
      "links": "<a href='/AIV/5/12/5'>Deut. 12:5</a>; <a href='/AIV/3/17/8-9'>Lev. 17:8-9</a>",
      "comment": "Simple altars, rather than ornate ones, emphasized God’s presence, not human artistry. The promise of God’s blessings reinforces the importance of worship at appointed places. This foreshadows the later importance of worship centers and eventually a universal sacrifice of praise, fulfilled in the new covenant (Heb. 13:10, Mal. 1:11)."
    },
    {
      "pk": 20200025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 25,
      "text": "'If you make an altar of stone for Me, do not build it of cut stones, for if you wield your tool on it, you profane it.'",
      "links": "<a href='/AIV/5/27/5-6'>Deut. 27:5-6</a>; <a href='/AIV/6/8/31'>Josh. 8:31</a>",
      "comment": "Stones left untouched reflect God’s design and holiness, not human effort or pride. This underscores the primacy of God’s grace in true worship."
    },
    {
      "pk": 20200026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 20,
      "verse": 26,
      "text": "'And you shall not go up by steps to My altar, that your nakedness may not be exposed on it.'",
      "links": "<a href='/AIV/3/6/10'>Lev. 6:10</a>",
      "comment": "Modesty and reverence are paramount in worship. The detailed care regarding approach to the altar points forward to the respect due in the liturgical assembly and the sacred mysteries."
    }
  ],
  "translatedAt": "2025-12-24T00:57:28.915Z"
}