{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 36,
  "verses": [
    {
      "pk": 2036001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 1,
      "text": "Bezalel and Oholiab, and every skilled man whom the Lord had given ability and wisdom to know how to do all the work for the service of the sanctuary, shall do all that the Lord has commanded.",
      "links": "<a href='/AIV/2/31/6'>Exod. 31:6</a>; <a href='/AIV/2/35/10'>Exod. 35:10</a>",
      "comment": "This verse highlights God's direct involvement in equipping individuals for sacred work. The emphasis on 'commanded' underscores the divine authority behind the instructions. The need for skilled artisans foreshadows how special offices and roles, divinely gifted, are used for the building up of the worshiping community (see Eph. 4:11-13)."
    },
    {
      "pk": 2036002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 2,
      "text": "Moses called Bezalel and Oholiab and every skilled man whose heart the Lord had stirred up, everyone whose heart moved him to come to do the work.",
      "links": "<a href='/AIV/2/35/21-26'>Exod. 35:21-26</a>",
      "comment": "Note the dual emphasis: God stirs men's hearts, but they must willingly respond. This union of grace and human freedom is reflected throughout Scripture (cf. Phil. 2:12-13)."
    },
    {
      "pk": 2036003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 3,
      "text": "They received from Moses all the offerings the people of Israel had brought for the work of the service of the sanctuary. The people continued to bring freewill offerings to him every morning.",
      "links": "<a href='/AIV/2/35/5,21-29'>Exod. 35:5,21-29</a>",
      "comment": "The repeated offerings point to the overflowing generosity of the people—an example of true stewardship and the spirit of sacrificial giving in worship (cf. 2 Cor. 8:1-5)."
    },
    {
      "pk": 2036004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 4,
      "text": "So all the craftsmen who were doing every kind of work on the sanctuary came, each from the work he was doing,",
      "links": "<a href='/AIV/2/35/10'>Exod. 35:10</a>",
      "comment": "This demonstrates an organized, communal effort in caring for the sanctuary. All roles were necessary, reflecting the varied gifts in the body of believers (see 1 Cor. 12:14–20)."
    },
    {
      "pk": 2036005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 5,
      "text": "and they said to Moses, 'The people are bringing much more than enough for the service of the work that the Lord has commanded us to do.'",
      "links": "<a href='/AIV/2/25/2'>Exod. 25:2</a>; <a href='/AIV/2/36/7'>Exod. 36:7</a>",
      "comment": "God's blessing is seen in the overabundance, echoing later teachings: 'Give, and it will be given to you...' (Luke 6:38). Excess offerings show responsibility in distributing for the needs of the sanctuary, a theme that continues in faithful stewardship."
    },
    {
      "pk": 2036006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 6,
      "text": "So Moses gave an order, and they sent a proclamation throughout the camp, saying, 'Let no man or woman make anything else as an offering for the sanctuary.' So the people were restrained from bringing more.",
      "links": "<a href='/AIV/2/35/5,21'>Exod. 35:5,21</a>",
      "comment": "It's rare for leaders to have to stop people's generosity. The care for the sanctuary here shows deep reverence for ordered, proper worship and the importance of obedience even in giving."
    },
    {
      "pk": 2036007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 7,
      "text": "For what they had already was more than enough to do all the work.",
      "links": "<a href='/AIV/2/36/5'>Exod. 36:5</a>",
      "comment": "God often supplies more than is necessary for the building up of His dwelling among His people. This reveals trust in Divine Providence and an ordered approach to communal resources."
    },
    {
      "pk": 2036008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 8,
      "text": "All the skilled workers among them made the tabernacle with ten curtains of fine twisted linen, blue, purple, and scarlet yarn, with cherubim skillfully worked into them.",
      "links": "<a href='/AIV/2/26/1'>Exod. 26:1</a>; <a href='/AIV/2/35/35'>Exod. 35:35</a>",
      "comment": "The tabernacle’s beauty reflects the glory and order of the heavenly worship (cf. Heb. 8:5), as the New Testament shows earthly worship prefiguring heavenly realities."
    },
    {
      "pk": 2036009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 9,
      "text": "The length of each curtain was twenty-eight cubits, and the width of each curtain four cubits; all the curtains were the same size.",
      "links": "<a href='/AIV/2/26/2'>Exod. 26:2</a>",
      "comment": "Precise measurements show God values order, structure, and obedience in worship. The unity of size also suggests harmony in the sanctuary."
    },
    {
      "pk": 2036010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 10,
      "text": "He joined five curtains to one another, and the other five curtains he joined together.",
      "links": "<a href='/AIV/2/26/3'>Exod. 26:3</a>",
      "comment": "The act of joining signifies the unity and completeness of God’s dwelling with His people, each piece necessary and fitting into the whole."
    },
    {
      "pk": 2036011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 11,
      "text": "He made loops of blue yarn on the edge of the outermost curtain in the first set, and the same on the edge of the outermost curtain in the second set.",
      "links": "<a href='/AIV/2/26/4'>Exod. 26:4</a>",
      "comment": "Blue often symbolized heaven or divinity, reminding worshippers that their assembly was connected to heavenly realities."
    },
    {
      "pk": 2036012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 12,
      "text": "He made fifty loops on one curtain, and fifty loops on the edge of the curtain that was in the second set, the loops sitting opposite each other.",
      "links": "<a href='/AIV/2/26/5'>Exod. 26:5</a>",
      "comment": "The symmetry in design points to the ordered nature of God’s plan for worship, mirroring the precision of creation."
    },
    {
      "pk": 2036013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 13,
      "text": "He made fifty gold clasps and joined the curtains together with the clasps, so the tabernacle became one whole.",
      "links": "<a href='/AIV/2/26/6'>Exod. 26:6</a>",
      "comment": "Gold signifies purity and value, while the tabernacle being 'one whole' prefigures the unity of the people of God, united in worship (cf. John 17:21)."
    },
    {
      "pk": 2036014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 14,
      "text": "He made curtains of goats’ hair for a tent over the tabernacle. He made eleven of these curtains.",
      "links": "<a href='/AIV/2/26/7'>Exod. 26:7</a>",
      "comment": "The outer protective layer symbolizes God’s sheltering presence. The layering points to the need for mediation and covering in entering holy places."
    },
    {
      "pk": 2036015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 15,
      "text": "The length of each curtain was thirty cubits, and the width of each curtain four cubits; the eleven curtains were the same size.",
      "links": "<a href='/AIV/2/26/8'>Exod. 26:8</a>",
      "comment": "Uniformity in measurements again emphasizes order and the equality of all parts in God’s design."
    },
    {
      "pk": 2036016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 16,
      "text": "He joined five curtains separately and six curtains separately.",
      "links": "<a href='/AIV/2/26/9'>Exod. 26:9</a>",
      "comment": "Specific instructions signify obedience to God’s will, which is a key part of worship."
    },
    {
      "pk": 2036017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 17,
      "text": "He made fifty loops on the edge of the curtain at the end of the first set, and fifty loops he made on the edge of the curtain in the second set.",
      "links": "<a href='/AIV/2/26/10'>Exod. 26:10</a>",
      "comment": "Orderly connection points for the coverings ensure structural stability, reflecting the doctrine of the visible assembly having a tangible integrity."
    },
    {
      "pk": 2036018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 18,
      "text": "He made fifty bronze clasps to join the tent together so that it became a single covering.",
      "links": "<a href='/AIV/2/26/11'>Exod. 26:11</a>",
      "comment": "The use of bronze, less valuable than gold, for the outermost connections matches a pattern of increasing holiness from the outside in."
    },
    {
      "pk": 2036019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 19,
      "text": "He made for the tent a covering of rams’ skins dyed red, and a covering of fine leather above.",
      "links": "<a href='/AIV/2/26/14'>Exod. 26:14</a>",
      "comment": "The red-dyed skins recall sacrificial imagery, prefiguring the necessity of blood and sacrifice for covering sins (see Heb. 9:22)."
    },
    {
      "pk": 2036020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 20,
      "text": "He made upright frames of acacia wood for the tabernacle.",
      "links": "<a href='/AIV/2/26/15'>Exod. 26:15</a>",
      "comment": "Acacia wood was prized for its durability—a subtle sign of the enduring nature of God’s dwelling among men."
    },
    {
      "pk": 2036021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 21,
      "text": "Each frame was ten cubits long and one and a half cubits wide.",
      "links": "<a href='/AIV/2/26/16'>Exod. 26:16</a>",
      "comment": "Again, the precision in dimension underscores God’s order and intentional design in worship and dwelling."
    },
    {
      "pk": 2036022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 22,
      "text": "Each frame had two tenons, joined to one another; so he did for all the frames of the tabernacle.",
      "links": "<a href='/AIV/2/26/17'>Exod. 26:17</a>",
      "comment": "The joining of tenons parallels the unity required for the foundation of God’s dwelling—each part, fitted together, makes the whole strong (Eph. 2:19–22)."
    },
    {
      "pk": 2036023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 23,
      "text": "He made the frames for the tabernacle: twenty for the south side.",
      "links": "<a href='/AIV/2/26/18'>Exod. 26:18</a>",
      "comment": "Detailed instructions maintain symmetry and stability for the tabernacle."
    },
    {
      "pk": 2036024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 24,
      "text": "He made forty silver bases to put under the twenty frames: two bases under each frame for its two tenons.",
      "links": "<a href='/AIV/2/26/19'>Exod. 26:19</a>",
      "comment": "Silver, a precious metal, forms the foundation—an image of redemption (cf. Num. 18:16)."
    },
    {
      "pk": 2036025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 25,
      "text": "For the second side of the tabernacle, on the north side, he made twenty frames",
      "links": "<a href='/AIV/2/26/20'>Exod. 26:20</a>",
      "comment": "The perfect symmetry between south and north sides points to a balanced and just foundation for God’s presence."
    },
    {
      "pk": 2036026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 26,
      "text": "and their forty silver bases, two bases under each frame.",
      "links": "<a href='/AIV/2/26/21'>Exod. 26:21</a>",
      "comment": "Again we see the use of silver, connecting to ransom and atonement themes in Israel’s worship system."
    },
    {
      "pk": 2036027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 27,
      "text": "For the west side of the tabernacle he made six frames.",
      "links": "<a href='/AIV/2/26/22'>Exod. 26:22</a>",
      "comment": "The number of frames is less on the west side by design, creating the sacred dimensions for the Most Holy Place."
    },
    {
      "pk": 2036028,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 28,
      "text": "He made two frames for the corners of the tabernacle at the rear.",
      "links": "<a href='/AIV/2/26/23'>Exod. 26:23</a>",
      "comment": "The corner frames reinforce the structure, pointing to the necessity of a strong foundation and supporting the sacred space."
    },
    {
      "pk": 2036029,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 29,
      "text": "These were joined at both top and bottom to make a single corner; he did the same for both corners.",
      "links": "<a href='/AIV/2/26/24'>Exod. 26:24</a>",
      "comment": "The single piece at each corner gives stability and wholeness, highlighting unity in God’s temple—one house, not divided."
    },
    {
      "pk": 2036030,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 30,
      "text": "There were eight frames, and their silver bases: sixteen bases, two bases under each frame.",
      "links": "<a href='/AIV/2/26/25'>Exod. 26:25</a>",
      "comment": "Such details again highlight the deliberate, tangible way God set up His dwelling amid His people."
    },
    {
      "pk": 2036031,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 31,
      "text": "He made bars of acacia wood: five for the frames on one side of the tabernacle,",
      "links": "<a href='/AIV/2/26/26'>Exod. 26:26</a>",
      "comment": "The use of strong wood for the bars symbolizes the spiritual reinforcement of God’s dwelling."
    },
    {
      "pk": 2036032,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 32,
      "text": "five bars for the frames on the other side of the tabernacle, and five bars for the frames at the back, on the west side.",
      "links": "<a href='/AIV/2/26/27'>Exod. 26:27</a>",
      "comment": "The number seven (in total) and five in each part often symbolize completion and grace in Scripture."
    },
    {
      "pk": 2036033,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 33,
      "text": "He made the middle bar to pass through the frames from end to end.",
      "links": "<a href='/AIV/2/26/28'>Exod. 26:28</a>",
      "comment": "The central bar uniting the frames can be seen as a foreshadowing of the central role of Christ (cf. Col. 1:17)."
    },
    {
      "pk": 2036034,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 34,
      "text": "He overlaid the frames with gold, made rings of gold for them to hold the bars, and overlaid the bars with gold.",
      "links": "<a href='/AIV/2/26/29'>Exod. 26:29</a>",
      "comment": "Covering the supports with gold marks out the tabernacle as a place of extraordinary holiness."
    },
    {
      "pk": 2036035,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 35,
      "text": "He made the veil of blue, purple, and scarlet yarn, and fine twisted linen, with cherubim skillfully worked into it.",
      "links": "<a href='/AIV/2/26/31'>Exod. 26:31</a>; <a href='/AIV/58/10/20'>Heb. 10:20</a>",
      "comment": "The veil served as a barrier pointing to humanity’s separation from God due to sin, fulfilled when Christ’s flesh was torn (see Heb. 10:20). Cherubim recall God’s heavenly court (see Gen. 3:24)."
    },
    {
      "pk": 2036036,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 36,
      "text": "He made for it four pillars of acacia wood and overlaid them with gold, with gold hooks, and cast four silver bases for them.",
      "links": "<a href='/AIV/2/26/32'>Exod. 26:32</a>",
      "comment": "These pillars support the veil separating the Holy and Most Holy Place, a physical sign of God’s holiness and the necessary mediation for access to Him."
    },
    {
      "pk": 2036037,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 37,
      "text": "He made a screen for the entrance of the tent, of blue, purple, and scarlet yarn, and fine twisted linen, embroidered with needlework,",
      "links": "<a href='/AIV/2/26/36'>Exod. 26:36</a>",
      "comment": "The entrance screen denotes the beauty and sanctity of entering God's house, reserved for the worthy and properly prepared."
    },
    {
      "pk": 2036038,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 36,
      "verse": 38,
      "text": "and its five pillars with their hooks. He overlaid their tops and their bands with gold, and their five bases were made of bronze.",
      "links": "<a href='/AIV/2/26/37'>Exod. 26:37</a>",
      "comment": "The progression of metals from gold to bronze demonstrates the hierarchy of holiness, with inner elements being of the highest value. This points to the sacredness of God’s dwelling, access to which requires proper mediation and reverence."
    }
  ],
  "translatedAt": "2025-12-24T01:07:24.036Z"
}