{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 22,
  "verses": [
    {
      "pk": 2022001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 1,
      "text": "If a man steals an ox or a sheep, and kills it or sells it, he must repay five oxen for an ox, and four sheep for a sheep.",
      "links": "<a href='/AIV/2/21/37'>Exod 21:37</a>; <a href='/AIV/20/6/30-31'>Prov 6:30-31</a>",
      "comment": "This verse shows strict justice and restitution for theft. The penalties exceed the value stolen, indicating the seriousness of the crime. The call for restoration can be seen as foreshadowing the principle of satisfaction for sins, a theme that ultimately finds fulfillment in Christ restoring what was lost (Luke 19:8-10)."
    },
    {
      "pk": 2022002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 2,
      "text": "If a thief is caught breaking in and is struck so that he dies, the one who struck him is not guilty of bloodshed.",
      "links": "<a href='/AIV/2/21/12-14'>Exod 21:12-14</a>; <a href='/AIV/4/35/16-25'>Num 35:16-25</a>",
      "comment": "The law recognizes the right to defend one’s home, but see next verse for limits. There is a principle here of proportional response. Augustine and other Church Fathers emphasized that justice is always balanced with mercy and intent."
    },
    {
      "pk": 2022003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 3,
      "text": "But if the sun has risen on him, he is guilty of bloodshed; he must surely make restitution. If he has nothing, he must be sold for his theft.",
      "links": "<a href='/AIV/3/25/39-43'>Lev 25:39-43</a>",
      "comment": "This verse indicates that lethal force is only justified in immediate self-defense (at night). During the day, excessive force is condemned. The law upholds human dignity and the value of life."
    },
    {
      "pk": 2022004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 4,
      "text": "If what was stolen is found alive in his possession, whether it is an ox, donkey, or sheep, he must restore double.",
      "links": "<a href='/AIV/2/21/34'>Exod 21:34</a>",
      "comment": "Restitution is double for recovered property, showing mercy compared to the harsher punishment for destroyed or sold property. Justice is meant to bring about healing and restoration."
    },
    {
      "pk": 2022005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 5,
      "text": "If a man lets a field or vineyard be grazed bare, and lets his animal loose, and it grazes in another man’s field, he must make restitution from the best of his own field and the best of his own vineyard.",
      "links": "<a href='/AIV/2/23/4'>Exod 23:4</a>; <a href='/AIV/20/24/30-31'>Prov 24:30-31</a>",
      "comment": "Justice requires that restitution be made from one's best, highlighting the importance of making amends sacrificially—an ancient forerunner of the call to offer one’s best to God."
    },
    {
      "pk": 2022006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 6,
      "text": "If a fire breaks out and spreads into thorns so that stacked grain, standing grain, or a field is consumed, the one who started the fire must make full restitution.",
      "links": "<a href='/AIV/7/15/5'>Judg 15:5</a>",
      "comment": "Negligence is accountable. Even indirect harm requires satisfaction. The principle of reparation here echoes the need for atonement in spiritual life."
    },
    {
      "pk": 2022007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 7,
      "text": "If a man gives his neighbor money or goods to keep for him, and it is stolen from the man’s house, if the thief is found, he must pay double.",
      "links": "<a href='/AIV/2/22/4'>Exod 22:4</a>",
      "comment": "Entrusted property involves a special duty. This verse prefigures the importance of faithfulness with what is entrusted, a theme later applied by Jesus to spiritual stewardship (see Luke 19:17)."
    },
    {
      "pk": 2022008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 8,
      "text": "If the thief is not found, then the owner of the house shall be brought before God to determine whether he has put his hand to his neighbor’s goods.",
      "links": "<a href='/AIV/5/19/17-18'>Deut 19:17-18</a>; <a href='/AIV/2/21/6'>Exod 21:6</a>",
      "comment": "Disputes were settled by God, often via the priests or judges. Here is the early role of sacred authority in mediating justice, which later develops in the appointment of authoritative leaders in the community."
    },
    {
      "pk": 2022009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 9,
      "text": "In every case of trespass, whether it concerns ox, donkey, sheep, clothing, or any kind of lost thing about which one says, ‘This is mine,’ the case of both parties shall come before God. The one whom God condemns must pay double to his neighbor.",
      "links": "<a href='/AIV/3/19/20-22'>Lev 19:20-22</a>",
      "comment": "God is the ultimate judge in all disputes. The system points ahead to a time when spiritual leaders will judge in God’s name, reflecting visible authority within the community."
    },
    {
      "pk": 2022010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 10,
      "text": "If a man gives his neighbor a donkey, ox, sheep, or any animal to keep, and it dies or is injured or driven away, no one seeing it,",
      "links": "",
      "comment": "Complex cases require oath-taking and communal discernment. The law builds a framework that values both justice and truth."
    },
    {
      "pk": 2022011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 11,
      "text": "then an oath of the LORD shall be between them both, to determine whether he has not put his hand to his neighbor’s goods. The owner shall accept the oath, and the other shall not make restitution.",
      "links": "<a href='/AIV/4/5/19-22'>Num 5:19-22</a>",
      "comment": "The sanctity of oaths is highlighted—God is actively involved in judgment. Swearing before God ultimately leads to New Testament teachings about oath and integrity (Matt 5:34-37)."
    },
    {
      "pk": 2022012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 12,
      "text": "But if it is indeed stolen from him, he must make restitution to its owner.",
      "links": "<a href='/AIV/2/22/7'>Exod 22:7</a>",
      "comment": "Responsibility is expected if the entrusted item is lost due to negligence. Care for what is given is a recurring Scriptural theme."
    },
    {
      "pk": 2022013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 13,
      "text": "If it is torn to pieces by a beast, let him bring it as evidence; he shall not make restitution for what was torn.",
      "links": "<a href='/AIV/1/37/33'>Gen 37:33</a>",
      "comment": "Fairness is important—blameless loss is not punished. This foreshadows Jesus as the Good Shepherd, who protects from the wolf (John 10:12)."
    },
    {
      "pk": 2022014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 14,
      "text": "If a man borrows anything from his neighbor, and it is injured or dies while its owner is not present, he must make full restitution.",
      "links": "<a href='/AIV/2/22/6-7'>Exod 22:6–7</a>",
      "comment": "Borrowing implies responsibility. Scripture teaches that we are stewards of all God gives, and accountability is expected."
    },
    {
      "pk": 2022015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 15,
      "text": "If the owner was present, he shall not make it good; if it was hired, it came for its hire.",
      "links": "<a href='/AIV/2/22/14'>Exod 22:14</a>",
      "comment": "Contracts and just arrangements are approved. Doing justly in business and relationships fosters trust and community."
    },
    {
      "pk": 2022016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 16,
      "text": "If a man entices a virgin who is not pledged to be married, and sleeps with her, he must pay the bride price for her and make her his wife.",
      "links": "<a href='/AIV/5/22/28-29'>Deut 22:28-29</a>",
      "comment": "Sexual relations imply commitment and responsibility. This builds the foundation for the biblical view of marriage as both covenantal and communal, seen later in Christ’s teaching (Matt 19:5-6)."
    },
    {
      "pk": 2022017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 17,
      "text": "If her father refuses to give her to him, he must still pay money equal to the bride price for virgins.",
      "links": "<a href='/AIV/2/22/16'>Exod 22:16</a>",
      "comment": "Parental authority and protection is respected. The law affirms the role of family in safeguarding virtue and dignity."
    },
    {
      "pk": 2022018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 18,
      "text": "You shall not allow a sorceress to live.",
      "links": "<a href='/AIV/5/18/10-12'>Deut 18:10-12</a>; <a href='/AIV/9/28/7'>1 Sam 28:7</a>",
      "comment": "Occult practices were absolute rejections of God’s sovereignty. The severity shows God’s desire for spiritual purity. In Christian tradition, refusal to seek power apart from God anticipates Christ’s total victory over evil (Col 2:15)."
    },
    {
      "pk": 2022019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 19,
      "text": "Anyone who lies with an animal shall surely be put to death.",
      "links": "<a href='/AIV/3/18/23'>Lev 18:23</a>",
      "comment": "Sexual morality is tied to human dignity. Violation of God’s order is a grave offense with communal consequences."
    },
    {
      "pk": 2022020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 20,
      "text": "Whoever sacrifices to any god other than the LORD alone shall be destroyed.",
      "links": "<a href='/AIV/2/20/3'>Exod 20:3</a>; <a href='/AIV/5/13/6-10'>Deut 13:6-10</a>",
      "comment": "Exclusive worship is demanded. This foundational doctrine is echoed in Jesus’ rebuke of Satan: ‘You shall worship the Lord your God, and serve Him only’ (Matt 4:10)."
    },
    {
      "pk": 2022021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 21,
      "text": "You shall not oppress a stranger or foreigner, for you were strangers in the land of Egypt.",
      "links": "<a href='/AIV/3/19/33-34'>Lev 19:33-34</a>; <a href='/AIV/5/24/17-18'>Deut 24:17-18</a>",
      "comment": "Compassion to outsiders is demanded by God. The consistent biblical theme of caring for the marginalized continues into Christ’s ministry (Luke 10:36-37)."
    },
    {
      "pk": 2022022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 22,
      "text": "You shall not mistreat any widow or fatherless child.",
      "links": "<a href='/AIV/19/82/3'>Ps 82:3</a>; <a href='/AIV/23/1/17'>Isa 1:17</a>; <a href='/AIV/59/1/27'>Jas 1:27</a>",
      "comment": "Protection of the vulnerable is a sign of true religion. James 1:27 echoes this as core to practicing true faith."
    },
    {
      "pk": 2022023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 23,
      "text": "If you do mistreat them, and they cry out to Me, I will surely hear their cry;",
      "links": "<a href='/AIV/19/34/17-18'>Ps 34:17-18</a>",
      "comment": "God identifies with those who suffer injustice. The Lord’s advocacy for the weak foreshadows His mercy revealed in Christ (Matt 25:40)."
    },
    {
      "pk": 2022024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 24,
      "text": "and My anger will burn, and I will kill you with the sword; your wives shall become widows, and your children fatherless.",
      "links": "<a href='/AIV/23/10/1-2'>Isa 10:1-2</a>",
      "comment": "Divine retribution is promised for oppressing the helpless—God personally intervenes to defend justice."
    },
    {
      "pk": 2022025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 25,
      "text": "If you lend money to any of My people who is poor among you, you shall not be like a moneylender to him; you shall not charge him interest.",
      "links": "<a href='/AIV/3/25/36-37'>Lev 25:36-37</a>; <a href='/AIV/19/15/5'>Ps 15:5</a>",
      "comment": "Usury is prohibited among God’s people. Church tradition has often emphasized economic justice for the poor and the dignity that follows generous charity. Compassion for the poor is inseparable from genuine faith."
    },
    {
      "pk": 2022026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 26,
      "text": "If you ever take your neighbor’s cloak as a pledge, you must return it to him before the sun goes down,",
      "links": "<a href='/AIV/5/24/12-13'>Deut 24:12-13</a>",
      "comment": "Mercy tempers justice. Even in debt, basic human dignity is preserved. This spirit of mercy will later be exemplified perfectly in Christ."
    },
    {
      "pk": 2022027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 27,
      "text": "for that is his only covering; it is his cloak for his body. What else will he sleep in? And if he cries to Me, I will hear, for I am compassionate.",
      "links": "<a href='/AIV/19/86/15'>Ps 86:15</a>; <a href='/AIV/19/103/8'>Ps 103:8</a>",
      "comment": "The Lord’s compassion for the poor is a recurring theme. This points to the later teaching that God desires mercy, not sacrifice (Hos 6:6; Matt 9:13)."
    },
    {
      "pk": 2022028,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 28,
      "text": "You shall not curse God, nor curse a leader of your people.",
      "links": "<a href='/AIV/4/16/11'>Num 16:11</a>; <a href='/AIV/44/23/5'>Acts 23:5</a>",
      "comment": "Respect for both God and appointed leaders is required. Obedience and honor to spiritual authority is a theme continued in the New Testament (Heb 13:17)."
    },
    {
      "pk": 2022029,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 29,
      "text": "You shall not delay to offer from the fullness of your harvest and the outflow of your presses. You shall give Me the firstborn of your sons.",
      "links": "<a href='/AIV/2/13/2'>Exod 13:2</a>; <a href='/AIV/4/18/12-15'>Num 18:12-15</a>",
      "comment": "Firstfruits and firstborn belong to God. This teaches faith in God’s provision and points ahead to the offering up of Christ (the firstborn) for our salvation (Rom 8:29)."
    },
    {
      "pk": 2022030,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 30,
      "text": "You must do the same with your oxen and your sheep; seven days it shall be with its mother; on the eighth day you shall give it to Me.",
      "links": "<a href='/AIV/3/22/27'>Lev 22:27</a>; <a href='/AIV/1/17/12'>Gen 17:12</a>",
      "comment": "The eighth day marks a new sacred beginning (cf. circumcision). The act of consecration is a pattern for New Testament sacramental theology, setting apart even the ordinary for God."
    },
    {
      "pk": 2022031,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 22,
      "verse": 31,
      "text": "You shall be holy people to Me. Therefore you shall not eat any meat that is torn by beasts in the field; you shall throw it to the dogs.",
      "links": "<a href='/AIV/3/22/8'>Lev 22:8</a>; <a href='/AIV/60/1/15-16'>1 Pet 1:15-16</a>",
      "comment": "God calls His people to be set apart—holy. Dietary laws shaped their identity. In Christ, all are called to holiness and spiritual purity (1 Pet 1:15-16)."
    }
  ],
  "translatedAt": "2025-12-24T00:58:48.821Z"
}