{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 7,
  "verses": [
    {
      "pk": 2007001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 1,
      "text": "Then the Lord said to Moses, \"See, I have made you like God to Pharaoh, and your brother Aaron shall be your prophet.\"",
      "links": "<a href='/AIV/2/4/16'>Exod. 4:16</a>; <a href='/AIV/11/1/17-18'>1 Kings 17:17-18</a>",
      "comment": "God elevates Moses to a unique position, giving him authority over Pharaoh. The arrangement echoes the idea of divine mediation, with Aaron acting as Moses’ spokesman, foreshadowing the importance of authoritative messengers in God’s plan (cf. Exod. 4:16)."
    },
    {
      "pk": 2007002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 2,
      "text": "You shall speak all that I command you; and Aaron your brother shall tell Pharaoh to let the children of Israel leave his land.",
      "links": "<a href='/AIV/2/4/15-16'>Exod. 4:15-16</a>",
      "comment": "Here, the partnership between Moses and Aaron is reinforced. Moses receives God’s word directly, while Aaron communicates it to Pharaoh—demonstrating the necessity of both divine instruction and authoritative proclamation."
    },
    {
      "pk": 2007003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 3,
      "text": "But I will harden Pharaoh’s heart, and though I multiply my signs and wonders in Egypt,",
      "links": "<a href='/AIV/2/4/21'>Exod. 4:21</a>; <a href='/AIV/65/9/17'>Rom. 9:17-18</a>",
      "comment": "Divine initiative is shown in hardening Pharaoh’s heart (see Rom. 9:17-18), pointing to God’s sovereignty and providence. This sets the stage for the miraculous deliverance."
    },
    {
      "pk": 2007004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 4,
      "text": "Pharaoh will not listen to you. Then I will lay my hand upon Egypt and bring my hosts, my people the children of Israel, out of the land of Egypt by great acts of judgment.",
      "links": "<a href='/AIV/2/6/6'>Exod. 6:6</a>; <a href='/AIV/2/12/12'>Exod. 12:12</a>",
      "comment": "‘Hosts’ here refers to God’s gathered people; this language anticipates later references to the church as ‘the assembly’ or ‘people of God.’ The acts of judgment are demonstrations of God’s justice."
    },
    {
      "pk": 2007005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 5,
      "text": "The Egyptians shall know that I am the Lord when I stretch out my hand against Egypt and bring out the Israelites from among them.",
      "links": "<a href='/AIV/2/14/4'>Exod. 14:4</a>",
      "comment": "God’s glory is revealed both in judgment and in deliverance. The knowledge of the true God spreads to the nations (see Exod. 14:4), hinting at the outwardly visible signs present in authentic worship."
    },
    {
      "pk": 2007006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 6,
      "text": "Moses and Aaron did as the Lord commanded them; they did exactly as they were told.",
      "links": "<a href='/AIV/2/39/42'>Exod. 39:42</a>",
      "comment": "The importance of obedience to God’s commands is highlighted; this theme runs throughout Scripture, modeling faithfulness and trust (see Exod. 39:42)."
    },
    {
      "pk": 2007007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 7,
      "text": "Now Moses was eighty years old and Aaron eighty-three when they spoke to Pharaoh.",
      "links": "<a href='/AIV/2/6/7'>Exod. 6:7</a>; <a href='/AIV/19/90/10'>Ps. 90:10</a>",
      "comment": "Despite their age, Moses and Aaron are chosen for great service. This illustrates that God’s calling is not limited by human weakness or limitation (see Ps. 90:10)."
    },
    {
      "pk": 2007008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 8,
      "text": "Then the Lord said to Moses and Aaron,",
      "links": "<a href='/AIV/2/4/30'>Exod. 4:30</a>",
      "comment": "God speaks personally to both leaders, reinforcing divine guidance and confirming that revelation is given to those appointed as guardians and teachers of the people."
    },
    {
      "pk": 2007009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 9,
      "text": "\"When Pharaoh says to you, 'Show a miracle,' then you shall say to Aaron, 'Take your staff and throw it down before Pharaoh.' It will become a serpent.\"",
      "links": "<a href='/AIV/2/4/3'>Exod. 4:3</a>; <a href='/AIV/2/4/17'>Exod. 4:17</a>",
      "comment": "Miraculous signs have a teaching function, affirming God’s power. The staff turning into a serpent anticipates the function of miracles as authenticating divine authority."
    },
    {
      "pk": 2007010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 10,
      "text": "So Moses and Aaron went to Pharaoh and did as the Lord commanded. Aaron threw down his staff before Pharaoh and his servants, and it became a serpent.",
      "links": "<a href='/AIV/2/4/30'>Exod. 4:30</a>; <a href='/AIV/2/4/3'>Exod. 4:3</a>",
      "comment": "Obedience produces visible results. The miracle evokes the contest between the power of God and the pagan magicians, emphasizing the supremacy of true worship."
    },
    {
      "pk": 2007011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 11,
      "text": "Then Pharaoh summoned his wise men and sorcerers. They also, the magicians of Egypt, did the same by their secret arts:",
      "links": "<a href='/AIV/55/3/8'>2 Tim. 3:8</a>; <a href='/AIV/2/7/22'>Exod. 7:22</a>",
      "comment": "The magicians, through occult practices, attempt to replicate God’s miracle (cf. 2 Tim. 3:8). True miracles are distinguished from counterfeit wonders by their source and purpose."
    },
    {
      "pk": 2007012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 12,
      "text": "For each man threw down his staff, and they became serpents. But Aaron’s staff swallowed up their staffs.",
      "links": "<a href='/AIV/2/4/3'>Exod. 4:3</a>; <a href='/AIV/19/110/2'>Ps. 110:2</a>",
      "comment": "Aaron’s staff swallowing the others is a sign of decisive victory of divine authority over false powers, foreshadowing the triumph of God over sin and evil (see Ps. 110:2)."
    },
    {
      "pk": 2007013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 13,
      "text": "Yet Pharaoh’s heart was hardened, and he would not listen to them, just as the Lord had said.",
      "links": "<a href='/AIV/2/4/21'>Exod. 4:21</a>; <a href='/AIV/2/7/3'>Exod. 7:3</a>",
      "comment": "Pharaoh’s resistance fulfills God’s forewarning, accentuating human stubbornness contrasted with divine patience and mercy."
    },
    {
      "pk": 2007014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 14,
      "text": "Then the Lord said to Moses, \"Pharaoh’s heart is stubborn; he refuses to let the people go.\"",
      "links": "<a href='/AIV/2/8/15'>Exod. 8:15</a>",
      "comment": "God discerns the hidden motives of rulers. Pharaoh’s persistent refusal sets up the pattern for the coming plagues, illustrating the consequences of resisting God’s will."
    },
    {
      "pk": 2007015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 15,
      "text": "\"Go to Pharaoh in the morning as he is going out to the water. Stand on the bank of the Nile to meet him, and take in your hand the staff that turned into a serpent.\"",
      "links": "<a href='/AIV/2/4/3'>Exod. 4:3</a>; <a href='/AIV/2/7/20'>Exod. 7:20</a>",
      "comment": "The Nile, a symbol of Egyptian power, is the first arena for God’s judgment. The staff is the sign of God’s chosen leader, later seen as a mark of spiritual authority."
    },
    {
      "pk": 2007016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 16,
      "text": "\"Say to him, ‘The Lord, the God of the Hebrews, has sent me to you, saying, \"Let my people go, that they may worship me in the wilderness.\" But so far, you have not listened.'\"",
      "links": "<a href='/AIV/2/4/22-23'>Exod. 4:22-23</a>; <a href='/AIV/2/5/1'>Exod. 5:1</a>",
      "comment": "God’s demand for worship highlights the priority of right worship and freedom to serve Him—reflecting both spiritual and physical liberation."
    },
    {
      "pk": 2007017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 17,
      "text": "\"Thus says the Lord: ‘By this you will know that I am the Lord. Look, I will strike the water of the Nile with the staff that is in my hand, and it will be turned to blood.'\"",
      "links": "<a href='/AIV/2/4/9'>Exod. 4:9</a>; <a href='/AIV/66/8/6-8'>Rev. 8:6-8</a>",
      "comment": "The turning of water into blood is both literal judgment and rich symbolism for purification and divine power. It foreshadows sacramental imagery that would later be fulfilled in Christ’s saving blood (see Rev. 8:6-8)."
    },
    {
      "pk": 2007018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 18,
      "text": "\"The fish in the Nile will die, and the river will stink, and the Egyptians will be unable to drink its water.\"",
      "links": "<a href='/AIV/2/7/21'>Exod. 7:21</a>; <a href='/AIV/2/8/14'>Exod. 8:14</a>",
      "comment": "Natural consequences follow supernatural acts, foreshadowing the emptiness brought by idolatry and separation from God—lack of spiritual sustenance."
    },
    {
      "pk": 2007019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 19,
      "text": "The Lord said to Moses, \"Say to Aaron, ‘Take your staff and stretch your hand over the waters of Egypt—over rivers, canals, ponds, and all pools of water—that they may turn to blood. There shall be blood throughout all the land, even in vessels of wood and stone.'\"",
      "links": "<a href='/AIV/2/4/9'>Exod. 4:9</a>; <a href='/AIV/66/16/3-4'>Rev. 16:3-4</a>",
      "comment": "The comprehensive scope of the plague demonstrates total judgment and the need for purity. Moses instructs Aaron—reinforcing the importance of liturgical actions performed by those set apart."
    },
    {
      "pk": 2007020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 20,
      "text": "Moses and Aaron did as the Lord commanded; Aaron lifted up the staff and struck the water in the Nile, in the sight of Pharaoh and his servants; and all the water in the Nile turned to blood.",
      "links": "<a href='/AIV/2/7/17'>Exod. 7:17</a>; <a href='/AIV/2/4/30'>Exod. 4:30</a>",
      "comment": "The execution of God’s command before witnesses validates the role of leaders in manifesting God’s presence and power, with typological resonance for later liturgical practices."
    },
    {
      "pk": 2007021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 21,
      "text": "The fish in the Nile died, the river stank, and the Egyptians could not drink its water. There was blood everywhere in Egypt.",
      "links": "<a href='/AIV/2/7/18'>Exod. 7:18</a>; <a href='/AIV/2/8/14'>Exod. 8:14</a>",
      "comment": "This illustrates the severity of God’s judgment, and the inability of idolatrous cultures to provide true sustenance, which is only found in God’s covenant."
    },
    {
      "pk": 2007022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 22,
      "text": "But the magicians of Egypt did the same by their secret arts; so Pharaoh’s heart remained hard, and he would not listen to them, just as the Lord had said.",
      "links": "<a href='/AIV/55/3/8'>2 Tim. 3:8</a>; <a href='/AIV/2/7/13'>Exod. 7:13</a>",
      "comment": "Although the magicians imitated the sign, true conversion and repentance only come by God’s initiative. Counterfeit miracles have limited power and cannot bring salvation."
    },
    {
      "pk": 2007023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 23,
      "text": "Pharaoh turned and went into his house, and he did not take even this to heart.",
      "links": "<a href='/AIV/2/9/7'>Exod. 9:7</a>",
      "comment": "Pharaoh’s lack of repentance contrasts with Godly sorrow, which leads to transformation. Here, persistent hardness of heart highlights the necessity of conversion through grace."
    },
    {
      "pk": 2007024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 24,
      "text": "All the Egyptians dug along the Nile for water to drink, because they could not drink of the river water.",
      "links": "<a href='/AIV/2/7/18'>Exod. 7:18</a>",
      "comment": "Human effort was insufficient to restore what God had judged. The people’s search for pure water prefigures the longing for grace and spiritual life that only God can satisfy."
    },
    {
      "pk": 2007025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 7,
      "verse": 25,
      "text": "Seven days passed after the Lord had struck the Nile.",
      "links": "<a href='/AIV/2/12/15'>Exod. 12:15</a>; <a href='/AIV/19/119/164'>Ps. 119:164</a>",
      "comment": "The completion of seven days connects this event to other scriptural periods of preparation and purification (see Exod. 12:15). Time set apart for repentance and restoration is a recurring theme in Scripture."
    }
  ],
  "translatedAt": "2025-12-24T00:50:16.058Z"
}