{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 23,
  "verses": [
    {
      "pk": 2023001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 1,
      "text": "You shall not spread a false report. Do not join hands with the wicked by being a malicious witness.",
      "links": "<a href='/AIV/2/20/16'>Exod 20:16</a>; <a href='/AIV/19/15/3'>Ps 15:3</a>",
      "comment": "This command upholds honesty in community life, echoing the broader context of bearing true witness as in the Ten Commandments. Notice how justice and truth are foundational to the faith."
    },
    {
      "pk": 2023002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 2,
      "text": "You shall not follow the majority in doing evil, and you shall not give testimony in a lawsuit siding with the crowd to pervert justice.",
      "links": "<a href='/AIV/2/23/6'>Exod 23:6</a>; <a href='/AIV/2/23/7'>Exod 23:7</a>",
      "comment": "Justice is not about popular opinion but the truth. There is an echo here of standing firm for righteousness, even against opposition, which finds its fulfillment in Christ's own example."
    },
    {
      "pk": 2023003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 3,
      "text": "You shall not show favoritism to a poor person in his lawsuit.",
      "links": "<a href='/AIV/3/19/15'>Lev 19:15</a>; <a href='/AIV/20/24/23'>Prov 24:23</a>",
      "comment": "Justice requires impartiality regardless of social status, which reflects the impartial nature of divine judgment."
    },
    {
      "pk": 2023004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 4,
      "text": "If you come across your enemy’s ox or donkey wandering away, you must return it to him.",
      "links": "<a href='/AIV/5/22/1-3'>Deut 22:1-3</a>; <a href='/AIV/40/5/44'>Matt 5:44</a>",
      "comment": "Even toward one's enemy, charity and responsibility are required. Christ intensifies this ethic when commanding love for enemies. The spiritual interpretation points to reconciliation and peace."
    },
    {
      "pk": 2023005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 5,
      "text": "If you see the donkey of someone who hates you fallen under its load, do not ignore it. You shall help him lift it up.",
      "links": "<a href='/AIV/19/37/5'>Ps 37:5</a>; <a href='/AIV/40/5/44'>Matt 5:44</a>",
      "comment": "Acting for the good of one's adversary is a foreshadowing of the commandment to love enemies, which Christ fulfills."
    },
    {
      "pk": 2023006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 6,
      "text": "You shall not deny justice to the poor in their lawsuit.",
      "links": "<a href='/AIV/3/19/15'>Lev 19:15</a>; <a href='/AIV/19/72/4'>Ps 72:4</a>",
      "comment": "This verse demands justice for the poor, balancing the earlier instruction against favoritism, and highlighting care for the marginalized, consistent with the ministry of Jesus."
    },
    {
      "pk": 2023007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 7,
      "text": "Keep far from a false charge, and do not kill the innocent and the righteous, for I will not acquit the wicked.",
      "links": "<a href='/AIV/5/16/19'>Deut 16:19</a>; <a href='/AIV/40/27/4'>Matt 27:4</a>",
      "comment": "The seriousness of false accusation and harming the innocent finds profound consequence here. It anticipates the weight of injustice, most vividly seen in the Passion narratives."
    },
    {
      "pk": 2023008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 8,
      "text": "You shall not take a bribe, for a bribe blinds the clear-sighted and corrupts the words of the righteous.",
      "links": "<a href='/AIV/5/16/19'>Deut 16:19</a>; <a href='/AIV/20/17/23'>Prov 17:23</a>",
      "comment": "The prohibition against bribery is essential for preserving justice and integrity among God’s people, recognizing the fallen nature that can lead to corruption."
    },
    {
      "pk": 2023009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 9,
      "text": "You shall not oppress a foreigner; you know the heart of a foreigner, because you were foreigners in the land of Egypt.",
      "links": "<a href='/AIV/2/22/21'>Exod 22:21</a>; <a href='/AIV/3/19/34'>Lev 19:34</a>",
      "comment": "Empathy toward the outsider is commanded, rooted in Israel's own history. Spiritually, this prefigures the universal call of the gospel."
    },
    {
      "pk": 2023010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 10,
      "text": "For six years you shall sow your land and gather its produce.",
      "links": "<a href='/AIV/3/25/1-7'>Lev 25:1-7</a>; <a href='/AIV/1/2/3'>Gen 2:3</a>",
      "comment": "The rhythm of work and rest is established, reflecting the created order and anticipation of deeper spiritual Sabbaths revealed later."
    },
    {
      "pk": 2023011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 11,
      "text": "But the seventh year you shall let it rest and lie fallow, so the poor of your people may eat; and what they leave, the wild animals may eat. You shall do the same with your vineyard and olive grove.",
      "links": "<a href='/AIV/3/25/4-7'>Lev 25:4-7</a>; <a href='/AIV/5/15/1-3'>Deut 15:1-3</a>",
      "comment": "Instituting Sabbath years foreshadows spiritual renewal, provision for the poor, and mercy reflected most perfectly in Jesus."
    },
    {
      "pk": 2023012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 12,
      "text": "Six days you shall do your work, but on the seventh day you shall rest, so your ox and your donkey may rest, and the son of your servant and the foreigner may be refreshed.",
      "links": "<a href='/AIV/2/20/8-11'>Exod 20:8-11</a>; <a href='/AIV/1/2/2-3'>Gen 2:2-3</a>",
      "comment": "The command to observe the Sabbath extends mercy to all, prefiguring the promise of spiritual rest and renewal in the New Covenant."
    },
    {
      "pk": 2023013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 13,
      "text": "Pay attention to all that I have said to you. You shall not mention the names of other gods, nor let them be heard from your mouth.",
      "links": "<a href='/AIV/5/6/13'>Deut 6:13-14</a>; <a href='/AIV/2/20/3'>Exod 20:3</a>",
      "comment": "Exclusive devotion to the Lord is commanded, which would later find its fulfillment in Christ's call for single-hearted worship."
    },
    {
      "pk": 2023014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 14,
      "text": "Three times each year you shall celebrate a feast to Me.",
      "links": "<a href='/AIV/5/16/16'>Deut 16:16</a>; <a href='/AIV/3/23/4-44'>Lev 23:4-44</a>",
      "comment": "The rhythm of feasts anchors communal worship. These celebrations prepare the way for later liturgical cycles."
    },
    {
      "pk": 2023015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 15,
      "text": "You shall keep the Feast of Unleavened Bread. For seven days you shall eat unleavened bread, as I commanded you, at the appointed time in the month of Abib, for in it you came out from Egypt. No one shall appear before Me empty-handed.",
      "links": "<a href='/AIV/3/23/6-8'>Lev 23:6-8</a>; <a href='/AIV/5/16/3-8'>Deut 16:3-8</a>",
      "comment": "The Feast of Unleavened Bread commemorates redemption and deliverance. It also points forward to the final Passover fulfilled in Christ’s sacrifice."
    },
    {
      "pk": 2023016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 16,
      "text": "And the Feast of Harvest, the firstfruits of your labor that you sow in the field; and the Feast of Ingathering at the end of the year, when you gather in the yield of your work from the field.",
      "links": "<a href='/AIV/3/23/15-22'>Lev 23:15-22</a>; <a href='/AIV/5/16/9-15'>Deut 16:9-15</a>",
      "comment": "These feasts, marking the firstfruits and ingathering, have spiritual meaning as well, signifying gratitude and anticipation of a future harvest, as reflected in the hope of the resurrection."
    },
    {
      "pk": 2023017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 17,
      "text": "Three times in the year all your males shall appear before the Lord God.",
      "links": "<a href='/AIV/5/16/16'>Deut 16:16</a>; <a href='/AIV/19/122/4'>Ps 122:4</a>",
      "comment": "Mandatory pilgrimage to present oneself before God foreshadows later practices of structured worship gatherings, showing the importance of communal and visible unity in faith."
    },
    {
      "pk": 2023018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 18,
      "text": "You shall not offer the blood of My sacrifice with leavened bread, nor shall the fat of My feast remain until morning.",
      "links": "<a href='/AIV/3/2/11'>Lev 2:11</a>; <a href='/AIV/2/12/10'>Exod 12:10</a>",
      "comment": "Purity at sacrifice points to the holiness required in worship, later fulfilled and deepened in the perfect offering of Christ."
    },
    {
      "pk": 2023019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 19,
      "text": "The best of the firstfruits of your ground you shall bring into the house of the Lord your God. You shall not boil a young goat in its mother’s milk.",
      "links": "<a href='/AIV/2/34/26'>Exod 34:26</a>; <a href='/AIV/3/23/10'>Lev 23:10</a>",
      "comment": "Offering firstfruits demonstrates gratitude and dependence on God. The prohibition against boiling a goat in its mother's milk removes pagan associations from worship."
    },
    {
      "pk": 2023020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 20,
      "text": "See, I am sending an angel before you, to guard you on your way and to bring you to the place I have prepared.",
      "links": "<a href='/AIV/6/5/13-15'>Josh 5:13-15</a>; <a href='/AIV/40/28/20'>Matt 28:20</a>",
      "comment": "The angel sent by God prefigures Christ, who goes before His people as guide and protector (seen especially in typology in the New Testament)."
    },
    {
      "pk": 2023021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 21,
      "text": "Pay attention to him and listen to his voice. Do not rebel against him, for he will not forgive your transgression, since My Name is in him.",
      "links": "<a href='/AIV/23/9/6'>Isa 9:6</a>; <a href='/AIV/43/14/13'>John 14:13</a>",
      "comment": "‘My Name is in him’ presents a profound mystery. Many early interpreters see this angel as a foreshadowing of the Incarnation, considering his authority to forgive or hold sin."
    },
    {
      "pk": 2023022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 22,
      "text": "But if you carefully obey his voice and do all that I say, then I will be an enemy to your enemies and an adversary to your adversaries.",
      "links": "<a href='/AIV/1/12/3'>Gen 12:3</a>; <a href='/AIV/19/18/1-3'>Ps 18:1-3</a>",
      "comment": "God’s protection is promised through obedience to His mediator. Link this to the New Testament focus on obedience to Christ as a source of blessing and protection."
    },
    {
      "pk": 2023023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 23,
      "text": "For My angel will go before you and bring you to the Amorites, Hittites, Perizzites, Canaanites, Hivites, and Jebusites, and I will cut them off.",
      "links": "<a href='/AIV/6/3/10'>Josh 3:10</a>; <a href='/AIV/2/33/2'>Exod 33:2</a>",
      "comment": "The angel ensures victory, revealing God’s sovereignty and anticipates spiritual conquest over sin and evil through Christ."
    },
    {
      "pk": 2023024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 24,
      "text": "You shall not bow down to their gods, serve them, or do as they do, but you shall utterly destroy them and break their sacred pillars.",
      "links": "<a href='/AIV/5/12/3'>Deut 12:3</a>; <a href='/AIV/2/34/13'>Exod 34:13</a>",
      "comment": "Total renunciation of idolatry is commanded as necessary for spiritual purity and fidelity, setting a pattern for later doctrinal purity."
    },
    {
      "pk": 2023025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 25,
      "text": "You shall serve the Lord your God, and He will bless your bread and your water, and I will take away sickness from among you.",
      "links": "<a href='/AIV/5/7/13'>Deut 7:13</a>; <a href='/AIV/40/6/11'>Matt 6:11</a>",
      "comment": "God’s blessing follows true worship and obedience, anticipating the promises of Christ regarding God’s provision and healing through communal worship."
    },
    {
      "pk": 2023026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 26,
      "text": "None shall miscarry or be barren in your land. I will fulfill the number of your days.",
      "links": "<a href='/AIV/5/7/14'>Deut 7:14</a>; <a href='/AIV/19/91/16'>Ps 91:16</a>",
      "comment": "Divine blessing brings fruitfulness and long life, symbolically pointing to spiritual fruit in the community of faith."
    },
    {
      "pk": 2023027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 27,
      "text": "I will send My terror before you and throw into confusion all the peoples you encounter. I will make all your enemies turn their backs to you.",
      "links": "<a href='/AIV/6/2/10'>Josh 2:10</a>; <a href='/AIV/7/7/22'>Judg 7:22</a>",
      "comment": "God’s power goes before His people, echoing the spiritual realities of victory over evil, as ultimately seen in Christ’s triumph over sin."
    },
    {
      "pk": 2023028,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 28,
      "text": "I will send hornets ahead of you, and they will drive out the Hivites, Canaanites, and Hittites from before you.",
      "links": "<a href='/AIV/6/24/12'>Josh 24:12</a>; <a href='/AIV/5/7/20'>Deut 7:20</a>",
      "comment": "The hornets symbolize miraculous interventions, and divine power prepares the way for the faithful, spiritually reflecting overcoming obstacles in the journey of faith."
    },
    {
      "pk": 2023029,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 29,
      "text": "I will not drive them out from before you in one year, so that the land does not become desolate and the wild animals multiply against you.",
      "links": "<a href='/AIV/5/7/22'>Deut 7:22</a>",
      "comment": "God’s gradual working unfolds in providence, reflecting patience in salvation history and in the establishment of the faithful community."
    },
    {
      "pk": 2023030,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 30,
      "text": "Little by little I will drive them out from before you, until you have increased and possess the land.",
      "links": "<a href='/AIV/5/7/22'>Deut 7:22</a>; <a href='/AIV/1/22/17'>Gen 22:17</a>",
      "comment": "The principle of gradual growth is affirmed, anticipating patient maturity in the household of faith."
    },
    {
      "pk": 2023031,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 31,
      "text": "I will set your borders from the Red Sea to the sea of the Philistines, and from the desert to the River. For I will deliver the inhabitants of the land into your hand, and you shall drive them out before you.",
      "links": "<a href='/AIV/6/13/2-6'>Josh 13:2-6</a>; <a href='/AIV/5/11/24'>Deut 11:24</a>",
      "comment": "God’s sovereign gift of land fulfills His promises and establishes purpose, hinting toward an ultimate inheritance in the faith."
    },
    {
      "pk": 2023032,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 32,
      "text": "You shall make no covenant with them or with their gods.",
      "links": "<a href='/AIV/2/34/12'>Exod 34:12</a>; <a href='/AIV/5/7/2'>Deut 7:2</a>",
      "comment": "Exclusive covenantal faithfulness is commanded. This anticipates the fullness of spiritual union with God, which later comes through the New Covenant."
    },
    {
      "pk": 2023033,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 23,
      "verse": 33,
      "text": "They shall not dwell in your land, lest they make you sin against Me; for if you serve their gods, surely it will be a snare to you.",
      "links": "<a href='/AIV/5/7/4'>Deut 7:4</a>; <a href='/AIV/6/23/13'>Josh 23:13</a>",
      "comment": "Living close to idolatry is spiritually dangerous. This serves as a warning to maintain holiness and avoid compromise, echoing the importance of doctrinal purity and communal discipline in faith."
    }
  ],
  "translatedAt": "2025-12-24T00:59:21.504Z"
}