{
  "book": 2,
  "bookName": "Exodus",
  "bookAbbreviation": "Exod",
  "chapter": 39,
  "verses": [
    {
      "pk": 2039001,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 1,
      "text": "They made the woven garments for serving in the sanctuary, the holy garments for Aaron, as the LORD commanded Moses.",
      "links": "<a href='/AIV/2/28/2'>Exod. 28:2</a>; <a href='/AIV/3/8/7'>Lev. 8:7</a>",
      "comment": "Here begins the account of making the priestly garments, following God’s detailed instructions. These garments set apart Aaron and his sons for a special, sacrificial ministry, foreshadowing the priesthood’s mediating role between God and His people (see Hebrews 7:26-28)."
    },
    {
      "pk": 2039002,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 2,
      "text": "He made the ephod of gold, blue, purple, and scarlet yarn, and finely woven linen.",
      "links": "<a href='/AIV/2/28/6'>Exod. 28:6</a>",
      "comment": "The ephod was an essential priestly vestment. Its colors and gold signify royal and heavenly qualities, hinting at the future priesthood of Christ in glory (cf. Hebrews 4:14)."
    },
    {
      "pk": 2039003,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 3,
      "text": "They hammered out thin sheets of gold and cut them into threads to work into the blue, purple, and scarlet yarn and the fine linen, the work of skilled craftsmen.",
      "links": "<a href='/AIV/2/28/8'>Exod. 28:8</a>; <a href='/AIV/13/29/2'>1 Chr. 29:2</a>",
      "comment": "Pure gold woven into these garments reveals the depth of reverence due in worship, and points to the splendor of heavenly realities (see Revelation 1:13)."
    },
    {
      "pk": 2039004,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 4,
      "text": "They made shoulder pieces for the ephod, joined together at its two edges.",
      "links": "<a href='/AIV/2/28/7'>Exod. 28:7</a>",
      "comment": "The joining of the shoulder pieces symbolizes unity and the carrying of Israel’s tribes before the LORD. Christ bears His people on His shoulders as the Good Shepherd (cf. Luke 15:5)."
    },
    {
      "pk": 2039005,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 5,
      "text": "And the skillfully woven waistband on the ephod matched it and was made of gold, blue, purple, and scarlet yarn, and finely woven linen, as the LORD commanded Moses.",
      "links": "<a href='/AIV/2/28/8'>Exod. 28:8</a>",
      "comment": "The waistband represents readiness and servanthood (cf. Luke 12:35), also alluding to the priest’s consecration for sacred duty."
    },
    {
      "pk": 2039006,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 6,
      "text": "They made onyx stones, mounted in gold settings, engraved with the names of the sons of Israel as a seal is engraved.",
      "links": "<a href='/AIV/2/28/9'>Exod. 28:9-11</a>; <a href='/AIV/2/28/21'>Exod. 28:21</a>",
      "comment": "The twelve names engraved on stones represent continual remembrance of God’s people before Him—an echo of intercessory ministry seen in Christ (cf. Romans 8:34)."
    },
    {
      "pk": 2039007,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 7,
      "text": "He fastened them on the shoulder pieces of the ephod as memorial stones for the sons of Israel, as the LORD commanded Moses.",
      "links": "<a href='/AIV/2/28/12'>Exod. 28:12</a>",
      "comment": "Memorial stones remind the priest and people of God’s covenant faithfulness. They prefigure the foundation stones in Revelation 21:14, symbolizing the unity and perpetuity of God’s people."
    },
    {
      "pk": 2039008,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 8,
      "text": "He made the breastpiece, the work of a skilled craftsman, like the work of the ephod: of gold, blue, purple, and scarlet yarn, and finely woven linen.",
      "links": "<a href='/AIV/2/28/15'>Exod. 28:15</a>",
      "comment": "The breastpiece’s ornate detail indicates the care required in liturgical worship, foreshadowing the reverence we see in heavenly worship (cf. Revelation 4:4)."
    },
    {
      "pk": 2039009,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 9,
      "text": "It was square, doubling over, a span in length and a span in width when double-folded.",
      "links": "<a href='/AIV/2/28/16'>Exod. 28:16</a>",
      "comment": "The precise shape and measurements signify order and perfection, reflecting man’s union with God through the detailed rituals assigned."
    },
    {
      "pk": 20390010,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 10,
      "text": "They set in it four rows of stones: first row, sardius, topaz, and emerald;",
      "links": "<a href='/AIV/2/28/17'>Exod. 28:17</a>; <a href='/AIV/66/21/19'>Rev. 21:19</a>",
      "comment": "The precious stones represent the twelve tribes, and the beauty and diversity within God’s people—drawn into unity by worship."
    },
    {
      "pk": 20390011,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 11,
      "text": "the second row, turquoise, sapphire, and diamond;",
      "links": "<a href='/AIV/66/21/20'>Rev. 21:20</a>",
      "comment": "Each gemstone’s uniqueness underlines the individuality of God’s people, yet all are set together into one sacred priestly vestment."
    },
    {
      "pk": 20390012,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 12,
      "text": "the third row, jacinth, agate, and amethyst;",
      "links": "<a href='/AIV/66/21/20'>Rev. 21:20</a>",
      "comment": "The repeated mention of twisting and setting stones highlights ritual craft and spiritual devotion, reflected in liturgical precision."
    },
    {
      "pk": 20390013,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 13,
      "text": "the fourth row, beryl, onyx, and jasper. They were set in gold filigree settings.",
      "links": "<a href='/AIV/2/28/20'>Exod. 28:20</a>; <a href='/AIV/66/21/20'>Rev. 21:20</a>",
      "comment": "Gold settings for the stones point to their precious value, showing that every tribe (and later, every believer) is highly honored in God’s sight."
    },
    {
      "pk": 20390014,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 14,
      "text": "There were twelve stones, according to the names of Israel’s sons, each engraved like a seal, each with the name of one of the twelve tribes.",
      "links": "<a href='/AIV/2/28/21'>Exod. 28:21</a>; <a href='/AIV/66/21/14'>Rev. 21:14</a>",
      "comment": "The inscription of each tribe signifies a personal relationship and covenant. This inclusion prefigures the gathering of all believers into one spiritual family."
    },
    {
      "pk": 20390015,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 15,
      "text": "They made two braided chains of pure gold for the breastpiece, twisted like cords.",
      "links": "<a href='/AIV/2/28/22'>Exod. 28:22</a>",
      "comment": "These golden chains attach the breastpiece securely, a symbol of unbroken connection between the priest, God, and the people."
    },
    {
      "pk": 20390016,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 16,
      "text": "They made two gold settings and two gold rings, and fastened the two rings to the two ends of the breastpiece.",
      "links": "<a href='/AIV/2/28/23'>Exod. 28:23</a>",
      "comment": "The careful detail in structure highlights God’s desire for order and holiness in worship—a reminder for liturgical faithfulness."
    },
    {
      "pk": 20390017,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 17,
      "text": "They attached the two gold cords to the two rings at the ends of the breastpiece.",
      "links": "<a href='/AIV/2/28/24'>Exod. 28:24</a>",
      "comment": "Attachment of cords further strengthens the caretaking and permanence of the priest’s role."
    },
    {
      "pk": 20390018,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 18,
      "text": "The other ends of the two cords they fastened to the two gold settings and attached them to the shoulder pieces of the ephod at the front.",
      "links": "<a href='/AIV/2/28/25'>Exod. 28:25</a>",
      "comment": "Front-facing attachments symbolize the active, ongoing mediation between God and His people, anticipating the intercession of Christ (see Hebrews 9:24)."
    },
    {
      "pk": 20390019,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 19,
      "text": "They made two gold rings and put them at the two other ends of the breastpiece, on its inside edge next to the ephod.",
      "links": "<a href='/AIV/2/28/26'>Exod. 28:26</a>",
      "comment": "Positioning on the inside highlights discretion and modesty, virtues for those serving in sacred spaces."
    },
    {
      "pk": 20390020,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 20,
      "text": "They made two more gold rings and attached them to the bottom of the shoulder pieces on the front, close to the seam above the waistband of the ephod.",
      "links": "<a href='/AIV/2/28/27'>Exod. 28:27</a>",
      "comment": "Everything is securely joined, showing unity among the parts. This might hint at the unity found in Christ’s one body (Ephesians 4:4-6)."
    },
    {
      "pk": 20390021,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 21,
      "text": "They bound the breastpiece by its rings to the rings of the ephod with a blue cord, so that it would rest above the waistband, and not come loose from the ephod, as the LORD commanded Moses.",
      "links": "<a href='/AIV/2/28/28'>Exod. 28:28</a>",
      "comment": "Binding with a blue cord symbolizes fidelity and heavenly connection, setting apart holy tasks for divine service."
    },
    {
      "pk": 20390022,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 22,
      "text": "He made the robe of the ephod entirely of blue cloth, the work of a skilled weaver.",
      "links": "<a href='/AIV/2/28/31'>Exod. 28:31</a>",
      "comment": "A completely blue garment represents the heavens and spiritual realities, setting the priest’s ministry on a higher level."
    },
    {
      "pk": 20390023,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 23,
      "text": "There was an opening in the center of the robe like the opening in a coat of mail, with a woven edge around the opening so it would not tear.",
      "links": "<a href='/AIV/2/28/32'>Exod. 28:32</a>",
      "comment": "The careful weaving to prevent tearing reflects the indestructible nature of true priesthood, anticipating the eternal priesthood of Christ (Hebrews 7:24)."
    },
    {
      "pk": 20390024,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 24,
      "text": "They made pomegranates of blue, purple, and scarlet yarn, and attached them to the hem of the robe.",
      "links": "<a href='/AIV/2/28/33'>Exod. 28:33</a>",
      "comment": "Pomegranates symbolize fruitfulness and abundance—a theme picked up in Christ’s teaching on bearing fruit by remaining in Him (cf. John 15:5)."
    },
    {
      "pk": 20390025,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 25,
      "text": "They made bells of pure gold and fastened them between the pomegranates around the hem of the robe.",
      "links": "<a href='/AIV/2/28/34'>Exod. 28:34</a>",
      "comment": "Golden bells sounded whenever the priest moved, signifying the unmistakable presence of God’s chosen mediator and announcing the way to holy things."
    },
    {
      "pk": 20390026,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 26,
      "text": "A bell and a pomegranate alternated around the hem of the robe, for ministering as the LORD commanded Moses.",
      "links": "<a href='/AIV/2/28/35'>Exod. 28:35</a>",
      "comment": "The alternating order shows balance between announcing God’s presence and fruitful living—a subtle tie to sacramental and visible signs in worship."
    },
    {
      "pk": 20390027,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 27,
      "text": "They made tunics for Aaron and his sons of fine linen, the work of a skilled tailor.",
      "links": "<a href='/AIV/2/28/39'>Exod. 28:39</a>",
      "comment": "Fine linen garments symbolize purity (cf. Revelation 19:8), essential for ministers approaching God's presence."
    },
    {
      "pk": 20390028,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 28,
      "text": "They made the turban of fine linen, the caps of fine linen for Aaron’s sons, and the undergarments of finely woven linen.",
      "links": "<a href='/AIV/2/28/40'>Exod. 28:40</a>",
      "comment": "Head coverings set apart the priest’s office and symbolize obedience, while undergarments preserve modesty—needed for those representing holiness (cf. Ezekiel 44:18)."
    },
    {
      "pk": 20390029,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 29,
      "text": "The sash was of finely woven linen, embroidered with blue, purple, and scarlet yarn, as the LORD commanded Moses.",
      "links": "<a href='/AIV/2/28/39'>Exod. 28:39</a>",
      "comment": "The embroidered sash completes the liturgical vestments, reminding us of the seamless garment Christ wore (John 19:23), connecting old and new priesthoods."
    },
    {
      "pk": 20390030,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 30,
      "text": "They made the plate, the holy crown, of pure gold and engraved on it like an inscription on a seal: 'Holy to the LORD.'",
      "links": "<a href='/AIV/2/28/36'>Exod. 28:36</a>",
      "comment": "The golden frontlet with 'Holy to the LORD' designates the priest as set apart, a sign of holiness through consecration—foreshadowing Christ's full sanctification in His sacrifice (Hebrews 7:26)."
    },
    {
      "pk": 20390031,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 31,
      "text": "They tied it with a blue cord to fasten it to the turban, as the LORD commanded Moses.",
      "links": "<a href='/AIV/2/28/37'>Exod. 28:37</a>",
      "comment": "This final touch completes the priestly attire. Blue again urges heavenly-mindedness, preparing to enter God's holy place."
    },
    {
      "pk": 20390032,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 32,
      "text": "So all the work of the tabernacle, the tent of meeting, was finished. The Israelites did everything just as the LORD commanded Moses.",
      "links": "<a href='/AIV/2/35/10'>Exod. 35:10</a>; <a href='/AIV/2/25/9'>Exod. 25:9</a>",
      "comment": "Israel’s obedience in completing the tabernacle models the importance of submission to divine instruction—a key aspect of communal worship and order."
    },
    {
      "pk": 20390033,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 33,
      "text": "Then they brought the tabernacle to Moses: the tent and all its furnishings, its clasps, frames, crossbars, posts, and bases;",
      "links": "<a href='/AIV/2/26/1-37'>Exod. 26:1-37</a>",
      "comment": "Details on all items presented to Moses underscore orderly stewardship of the sacred, reminiscent of offerings in later temple worship."
    },
    {
      "pk": 20390034,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 34,
      "text": "the covering of rams’ skins dyed red, the covering of fine leather, and the curtain for the entrance;",
      "links": "<a href='/AIV/2/26/14'>Exod. 26:14</a>",
      "comment": "Multiple coverings symbolize layers of holiness, each getting closer to the presence of God, reminiscent of spiritual ascent."
    },
    {
      "pk": 20390035,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 35,
      "text": "the ark of the testimony with its poles and the mercy seat;",
      "links": "<a href='/AIV/2/25/10-22'>Exod. 25:10-22</a>",
      "comment": "The mercy seat atop the ark represents God's throne among His people, later prefiguring Christ as our propitiation (Romans 3:25; Hebrews 9:5)."
    },
    {
      "pk": 20390036,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 36,
      "text": "the table with all its utensils and the bread of the Presence;",
      "links": "<a href='/AIV/2/25/23-30'>Exod. 25:23-30</a>; <a href='/AIV/40/26/26'>Matt. 26:26</a>",
      "comment": "The bread of the Presence alludes to God’s continual sustenance, foreshadowing the New Testament institution of the Lord’s Supper by Christ."
    },
    {
      "pk": 20390037,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 37,
      "text": "the pure gold lampstand, its lamps, lamps set in order, all its accessories, and the oil for the light;",
      "links": "<a href='/AIV/2/25/31-40'>Exod. 25:31-40</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "Light in the lampstand stands for the presence and revelation of God, later fulfilled in Christ as the Light of the World."
    },
    {
      "pk": 20390038,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 38,
      "text": "the golden altar, the anointing oil, fragrant incense, and the curtain for the entrance to the tent;",
      "links": "<a href='/AIV/2/30/1-10'>Exod. 30:1-10</a>; <a href='/AIV/66/8/3-4'>Rev. 8:3-4</a>",
      "comment": "Incense before God symbolizes prayer rising from the faithful, connected to worship in heaven (see Revelation 8:3-4)."
    },
    {
      "pk": 20390039,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 39,
      "text": "the bronze altar with its grate, poles, and all its utensils; the basin and its stand;",
      "links": "<a href='/AIV/2/27/1-8'>Exod. 27:1-8</a>; <a href='/AIV/19/51/2'>Ps. 51:2</a>",
      "comment": "The altar for burnt offering stands for sacrifice and atonement—a foreshadowing of Christ’s sacrificial death, and the basin for cleansing anticipating Christian baptism."
    },
    {
      "pk": 20390040,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 40,
      "text": "the curtains of the courtyard, posts and bases, and the curtain for the entrance to the courtyard, its ropes and pegs—all the furnishings for the tabernacle, the tent of meeting;",
      "links": "<a href='/AIV/2/27/9-19'>Exod. 27:9-19</a>",
      "comment": "Curtains and boundaries mark off the sacred space, emphasizing the need for reverence in approaching God."
    },
    {
      "pk": 20390041,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 41,
      "text": "along with the woven garments for ministering in the sanctuary—both the holy garments for Aaron the priest and garments for his sons for their priestly service.",
      "links": "<a href='/AIV/2/28/2-4'>Exod. 28:2-4</a>",
      "comment": "Distinct garments for the priest and his sons designate unique but united roles, a model for hierarchical ministry and succession in the community of faith."
    },
    {
      "pk": 20390042,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 42,
      "text": "The Israelites did all the work as the LORD commanded Moses.",
      "links": "<a href='/AIV/2/25/9'>Exod. 25:9</a>; <a href='/AIV/2/35/10'>Exod. 35:10</a>",
      "comment": "Israel’s perfect obedience is a model for worship that seeks to follow divine instruction, resonating in Christian tradition."
    },
    {
      "pk": 20390043,
      "translation": "AIV",
      "book": 2,
      "bookName": "Exodus",
      "bookAbbreviation": "Exod",
      "chapter": 39,
      "verse": 43,
      "text": "Moses saw all the work and, behold, they had done it as the LORD commanded; so Moses blessed them.",
      "links": "<a href='/AIV/2/40/16'>Exod. 40:16</a>; <a href='/AIV/1/1/28'>Gen. 1:28</a>",
      "comment": "Moses' blessing after successful completion parallels the blessing given for obedience throughout Scripture (Genesis 1:28; Numbers 6:23-27). God’s requirements, met with humble obedience, bring His blessing upon the people—something Christ fulfilled and established in His church (cf. Matthew 16:18-19)."
    }
  ],
  "translatedAt": "2025-12-24T01:09:06.933Z"
}