{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 6,
  "verses": [
    {
      "pk": 7006001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 1,
      "text": "The Israelites did what was evil in the sight of the LORD, so the LORD gave them into the hand of Midian for seven years.",
      "links": "<a href='/AIV/2/23/32-33'>Exod. 23:32-33</a>; <a href='/AIV/7/2/14'>Judg. 2:14</a>",
      "comment": "The pattern of Israel’s repeated apostasy and oppression by foreign nations highlights the need for continual faithfulness. Seven years signifies a cycle of completeness in judgment."
    },
    {
      "pk": 7006002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 2,
      "text": "And the power of Midian prevailed against Israel, because of Midian the Israelites made for themselves dens in the mountains, caves, and strongholds.",
      "links": "<a href='/AIV/1/13/6'>Gen. 13:6</a>; <a href='/AIV/1/19/30'>Gen. 19:30</a>",
      "comment": "God used Midian’s strength to humble Israel. The Israelites’ retreat into caves reveals their total desperation and removal from the Promised Land’s blessings."
    },
    {
      "pk": 7006003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 3,
      "text": "Whenever the Israelites planted crops, the Midianites, the Amalekites, and the people of the east would come up against them.",
      "links": "<a href='/AIV/2/17/8'>Exod. 17:8</a>; <a href='/AIV/7/3/13'>Judg. 3:13</a>",
      "comment": "The repetition of enemies is a reminder of the consequences of forsaking God’s covenant."
    },
    {
      "pk": 7006004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 4,
      "text": "They would camp against them and destroy the produce of the land as far as Gaza, and leave no sustenance in Israel, nor sheep or ox or donkey.",
      "links": "<a href='/AIV/3/26/20'>Lev. 26:20</a>; <a href='/AIV/5/28/31-33'>Deut. 28:31-33</a>",
      "comment": "This judgment fulfills covenant curses, showing that breaking God’s law brings tangible consequences to all aspects of life (see Deut. 28)."
    },
    {
      "pk": 7006005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 5,
      "text": "For they and their livestock would come up with their tents. They would come like locusts in number—both they and their camels could not be counted—so they laid waste the land as they came in.",
      "links": "<a href='/AIV/2/10/14-15'>Exod. 10:14-15</a>; <a href='/AIV/7/7/12'>Judg. 7:12</a>",
      "comment": "The imagery of locusts points to total devastation, mirroring the plagues of Egypt. The mention of many camels highlights the formidable strength of Israel’s oppressors."
    },
    {
      "pk": 7006006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 6,
      "text": "And Israel was brought very low because of Midian, and the Israelites cried out to the LORD for help.",
      "links": "<a href='/AIV/2/2/23'>Exod. 2:23</a>; <a href='/AIV/7/2/18'>Judg. 2:18</a>",
      "comment": "Humility and repentance are necessary preconditions for deliverance. The cycle of crying out to God is a recurring theme in Judges."
    },
    {
      "pk": 7006007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 7,
      "text": "When the Israelites cried out to the LORD because of Midian,",
      "links": "<a href='/AIV/14/7/14'>2 Chr. 7:14</a>",
      "comment": "God listens to the cries of His people, but His response includes instruction and correction, as well as deliverance."
    },
    {
      "pk": 7006008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 8,
      "text": "the LORD sent a prophet to the Israelites, and he said to them, 'Thus says the LORD, the God of Israel: I brought you up out of Egypt and out of the house of slavery,",
      "links": "<a href='/AIV/2/12/51'>Exod. 12:51</a>; <a href='/AIV/7/2/1'>Judg. 2:1</a>",
      "comment": "Before deliverance, God sends a prophet to remind Israel of His past faithfulness and their obligation to Him. The role of prophets as communicators of God’s will continues throughout Scripture."
    },
    {
      "pk": 7006009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 9,
      "text": "'And I delivered you from the hand of Egypt and from all who oppressed you, and drove them out before you and gave you their land.'",
      "links": "<a href='/AIV/6/21/43-44'>Josh. 21:43-44</a>",
      "comment": "The prophet emphasizes God’s total initiative in Israel’s past deliverance and gift of the land, foreshadowing the pattern of God’s grace before law."
    },
    {
      "pk": 7006010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 10,
      "text": "'And I said to you, ‘I am the LORD your God; you shall not fear the gods of the Amorites, in whose land you dwell.’ But you have not obeyed my voice.'",
      "links": "<a href='/AIV/2/20/2-3'>Exod. 20:2-3</a>; <a href='/AIV/7/2/2'>Judg. 2:2</a>",
      "comment": "Disobedience to God’s voice is the root cause of Israel’s suffering. Worship of other gods always brings destruction."
    },
    {
      "pk": 7006011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 11,
      "text": "Now the angel of the LORD came and sat under the oak at Ophrah, which belonged to Joash the Abiezrite, as his son Gideon was beating out wheat in the winepress to hide it from the Midianites.",
      "links": "<a href='/AIV/1/18/1'>Gen. 18:1</a>; <a href='/AIV/7/13/3'>Judg. 13:3</a>",
      "comment": "The 'angel of the LORD' often represents God Himself acting in the world. Gideon's humility in threshing wheat in secret is a setup for God’s glory through weakness. Some Church Fathers see in the oak a symbolism for the cross."
    },
    {
      "pk": 7006012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 12,
      "text": "And the angel of the LORD appeared to him and said to him, 'The LORD is with you, O mighty man of valor.'",
      "links": "<a href='/AIV/6/1/9'>Joshua 1:9</a>; <a href='/AIV/7/13/6'>Judg. 13:6</a>",
      "comment": "God sees not only what is but what can be in His servant. Declaring Gideon 'mighty' despite his fear shows God's gracious initiative. Such language anticipates how God calls unlikely people for His mission."
    },
    {
      "pk": 7006013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 13,
      "text": "Gideon said to him, 'Please, my lord, if the LORD is with us, why then has all this happened to us? Where are all his wonderful deeds that our fathers recounted to us, saying, ‘Did not the LORD bring us up from Egypt?’ But now the LORD has forsaken us and given us into the hand of Midian.'",
      "links": "<a href='/AIV/2/14/11'>Exod. 14:11</a>",
      "comment": "Gideon’s honest questioning mirrors the Psalms’ complaints, reflecting real faith in God’s promises and a desire to understand suffering."
    },
    {
      "pk": 7006014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 14,
      "text": "And the LORD turned to him and said, 'Go in this might of yours and save Israel from the hand of Midian; do I not send you?'",
      "links": "<a href='/AIV/2/3/10'>Exod. 3:10-12</a>",
      "comment": "God’s commands are always paired with His presence: 'I send you.' This recalls God’s sending of Moses and anticipates Christ’s sending of the apostles. True strength comes from God’s call."
    },
    {
      "pk": 7006015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 15,
      "text": "He said to him, 'Please, Lord, how can I save Israel? Look, my clan is the weakest in Manasseh, and I am the least in my father's house.'",
      "links": "<a href='/AIV/9/16/7'>1 Sam. 16:7</a>",
      "comment": "God’s choice often reverses human expectations, choosing the humble and lowly. This principle is fulfilled in the lives of major biblical figures, including Mary (Luke 1:48)."
    },
    {
      "pk": 7006016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 16,
      "text": "And the LORD said to him, 'But I will be with you, and you shall strike the Midianites as one man.'",
      "links": "<a href='/AIV/1/28/15'>Gen. 28:15</a>; <a href='/AIV/6/1/5'>Josh. 1:5</a>",
      "comment": "God’s presence ensures victory. His promises of being 'with you' echo the promises to the patriarchs and are fulfilled in Christ (Matthew 28:20)."
    },
    {
      "pk": 7006017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 17,
      "text": "And he said to him, 'If now I have found favor in your eyes, then show me a sign that it is you who speak with me.'",
      "links": "<a href='/AIV/2/3/12'>Exod. 3:12</a>;<a href='/AIV/7/13/17'>Judg. 13:17</a>",
      "comment": "Seeking a sign shows Gideon's desire for certainty in divine encounters, which foreshadows the importance of concrete assurances found in the sacraments."
    },
    {
      "pk": 7006018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 18,
      "text": "'Please do not leave here, until I come to you and bring out my offering and set it before you.' And he said, 'I will stay until you return.'",
      "links": "<a href='/AIV/1/18/5'>Gen. 18:5</a>",
      "comment": "The offering Gideon prepares for the angel underlines the importance of sacrifice in approaching God, a pattern continued in biblical worship."
    },
    {
      "pk": 7006019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 19,
      "text": "So Gideon went in and prepared a young goat and unleavened cakes from an ephah of flour. He put the meat in a basket and the broth in a pot, and brought them out to him under the oak and presented them.",
      "links": "<a href='/AIV/1/18/6-8'>Gen. 18:6-8</a>",
      "comment": "The use of unleavened cakes recalls Passover imagery, showing God’s continuing faithfulness. The meal setting suggests a sacred communion."
    },
    {
      "pk": 7006020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 20,
      "text": "And the angel of God said to him, 'Take the meat and the unleavened cakes and lay them on this rock, and pour out the broth.' And he did so.",
      "links": "<a href='/AIV/2/29/16'>Exod. 29:16'</a>",
      "comment": "The command to place the offering on a rock foreshadows the use of altars and demonstrates the link between earthly elements and divine action."
    },
    {
      "pk": 7006021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 21,
      "text": "Then the angel of the LORD reached out the tip of the staff that was in his hand and touched the meat and the unleavened cakes. And fire sprang up from the rock and consumed the meat and the unleavened cakes. Then the angel of the LORD vanished from his sight.",
      "links": "<a href='/AIV/3/9/24'>Lev. 9:24</a>; <a href='/AIV/1/4/4'>Gen. 4:4</a>",
      "comment": "Divine fire signifies God’s acceptance of sacrifice. This anticipates God’s self-giving in later sacrifices. The sudden disappearance furthers the mystery of the angel’s identity."
    },
    {
      "pk": 7006022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 22,
      "text": "When Gideon realized that he was the angel of the LORD, he said, 'Alas, O LORD God! For now I have seen the angel of the LORD face to face.'",
      "links": "<a href='/AIV/2/33/20'>Exod. 33:20</a>",
      "comment": "Seeing God’s messenger inspires holy fear, pointing to the unapproachable holiness of God experienced in theophanies."
    },
    {
      "pk": 7006023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 23,
      "text": "But the LORD said to him, 'Peace be to you. Do not fear; you shall not die.'",
      "links": "<a href='/AIV/1/43/30'>Gen. 43:30</a>; <a href='/AIV/6/5/10'>Josh. 5:10'>",
      "comment": "God’s gift of peace reassures those He calls, prefiguring the peace Christ bestows upon His disciples (John 20:19)."
    },
    {
      "pk": 7006024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 24,
      "text": "Then Gideon built an altar there to the LORD and called it 'The LORD is Peace.' To this day it still stands at Ophrah, which belongs to the Abiezrites.",
      "links": "<a href='/AIV/2/17/15'>Exod. 17:15</a>",
      "comment": "Altars commemorate God's intervention and are focal points of worship. 'The LORD is Peace' prefigures Christ, our peace, and the establishment of ongoing remembrance in worship."
    },
    {
      "pk": 7006025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 25,
      "text": "That night the LORD said to him, 'Take your father’s bull, and a second bull seven years old, and pull down the altar of Baal that your father has, and cut down the Asherah that is beside it.'",
      "links": "<a href='/AIV/2/34/13'>Exod. 34:13</a>; <a href='/AIV/5/7/5'>Deut. 7:5</a>",
      "comment": "The destruction of idols precedes God’s deliverance. True worship requires removing all rivals, both public and familial."
    },
    {
      "pk": 7006026,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 26,
      "text": "And build an altar to the LORD your God on top of the stronghold here, with stones laid in proper order. Then take the second bull and offer it as a burnt offering with the wood of the Asherah that you cut down.",
      "links": "<a href='/AIV/2/20/24-26'>Exod. 20:24-26</a>",
      "comment": "Worship must be rightly ordered, just as the altar is built with stones 'in proper order.' The old sanctuaries are replaced with right worship—a pattern seen in church renewal."
    },
    {
      "pk": 7006027,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 27,
      "text": "So Gideon took ten men of his servants and did as the LORD had told him. But because he was too afraid of his family and the men of the town to do it by day, he did it by night.",
      "links": "<a href='/AIV/9/17/12'>1 Sam. 17:12</a>",
      "comment": "Gideon’s fear and his obedience by night show the cost of faith and the challenge of following God in the face of opposition."
    },
    {
      "pk": 7006028,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 28,
      "text": "When the men of the town rose early in the morning, behold, the altar of Baal was broken down, and the Asherah beside it was cut down, and the second bull was offered on the altar that had been built.",
      "links": "<a href='/AIV/4/20/26-27'>Num. 20:26-27</a>",
      "comment": "The public exposure of true worship contrasts with the secrecy of idolatry, showing how God brings actions into the light."
    },
    {
      "pk": 7006029,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 29,
      "text": "And they said to one another, 'Who has done this thing?' And after they had searched and asked, they said, 'Gideon the son of Joash has done this thing.'",
      "links": "<a href='/AIV/10/19/20'>1 Kings 19:20</a>",
      "comment": "Public zeal for false religion is challenged by the boldness of one who obeys God, even at personal risk."
    },
    {
      "pk": 7006030,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 30,
      "text": "Then the men of the town said to Joash, 'Bring out your son, that he may die, for he has broken down the altar of Baal and cut down the Asherah beside it.'",
      "links": "<a href='/AIV/2/32/27-28'>Exod. 32:27-28</a>",
      "comment": "Zeal for Baal is so strong that the penalty is death, foreshadowing how the world often resists true reform."
    },
    {
      "pk": 7006031,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 31,
      "text": "But Joash said to all who stood against him, 'Will you contend for Baal? Or will you save him? Whoever contends for him shall be put to death by morning. If he is a god, let him contend for himself, because his altar has been broken down.'",
      "links": "<a href='/AIV/9/17/45-47'>1 Sam. 17:45-47</a>",
      "comment": "The impotence of idols is exposed—true faith rests in the living God who defends Himself, unlike false gods."
    },
    {
      "pk": 7006032,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 32,
      "text": "Therefore on that day Gideon was called Jerubbaal, that is to say, 'Let Baal contend against him,' because he broke down his altar.",
      "links": "<a href='/AIV/7/7/1'>Judg. 7:1</a>",
      "comment": "The new name marks Gideon as one who challenges the false gods. God’s servants often receive new names in the story of salvation, a pattern fulfilled in Jesus renaming his disciples (e.g., Simon to Peter)."
    },
    {
      "pk": 7006033,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 33,
      "text": "Now all the Midianites and the Amalekites and the people of the east came together, and they crossed the Jordan and encamped in the Valley of Jezreel.",
      "links": "<a href='/AIV/7/3/13'>Judg. 3:13</a>",
      "comment": "A gathering of enemies presents a crisis demanding God’s intervention, setting the stage for a great deliverance."
    },
    {
      "pk": 7006034,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 34,
      "text": "But the Spirit of the LORD clothed Gideon, and he blew the trumpet, and the Abiezrites were called out to follow him.",
      "links": "<a href='/AIV/4/11/25'>Num. 11:25</a>; <a href='/AIV/7/3/10'>Judg. 3:10</a>",
      "comment": "God’s Spirit empowering a leader signals divine appointment. The blowing of the trumpet prefigures the call to assembly, later fulfilled in the New Covenant Church."
    },
    {
      "pk": 7006035,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 35,
      "text": "And he sent messengers throughout all Manasseh, and they too were called out to follow him; and he sent messengers to Asher, Zebulun, and Naphtali, and they went up to meet them.",
      "links": "<a href='/AIV/7/4/6'>Judg. 4:6</a>",
      "comment": "Gideon’s gathering of the tribes recalls the unity of Israel under God’s anointed leadership—a type for later assemblies."
    },
    {
      "pk": 7006036,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 36,
      "text": "Then Gideon said to God, 'If you will save Israel by my hand, as you have said,",
      "links": "<a href='/AIV/2/4/1'>Exod. 4:1</a>",
      "comment": "Gideon seeks reassurance, highlighting the human need for repeated confirmation of God’s will, which points us toward the value of clear, instituted signs."
    },
    {
      "pk": 7006037,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 37,
      "text": "'behold, I am laying a fleece of wool on the threshing floor. If there is dew on the fleece alone, and it is dry on all the ground, then I shall know that you will save Israel by my hand, as you have said.'",
      "links": "<a href='/AIV/7/5/20'>Judg. 5:20</a>",
      "comment": "The 'fleece' test is a physical sign, foreshadowing the use of material things for spiritual assurance."
    },
    {
      "pk": 7006038,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 38,
      "text": "And it was so. When he rose early next morning and squeezed the fleece, he wrung enough dew from the fleece to fill a bowl with water.",
      "links": "<a href='/AIV/4/17/6'>Num. 17:6'</a>",
      "comment": "God’s patience with Gideon’s doubt reveals His gentleness with the weak, encouraging confidence to draw near."
    },
    {
      "pk": 7006039,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 39,
      "text": "Then Gideon said to God, 'Let not your anger burn against me; let me speak just once more. Please let me test just once more with the fleece. Please let it be dry on the fleece only, and on all the ground let there be dew.'",
      "links": "<a href='/AIV/1/18/32'>Gen. 18:32</a>",
      "comment": "Gideon humbly asks for a second sign, showing the importance of reverence when asking for confirmation. The Church Fathers often compared the dew and fleece to divine grace and the Incarnation."
    },
    {
      "pk": 7006040,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 6,
      "verse": 40,
      "text": "And God did so that night: it was dry on the fleece only, and on all the ground there was dew.",
      "links": "<a href='/AIV/1/18/33'>Gen. 18:33</a>",
      "comment": "God reaffirms his promise with a sign. Early Christian commentators sometimes saw the fleece and dew as typological, representing singular grace given for a purpose, with echoes of the Virgin Birth and spiritual signs."
    }
  ],
  "translatedAt": "2025-12-24T02:34:02.862Z"
}