{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 2,
  "verses": [
    {
      "pk": 7002001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 1,
      "text": "The angel of the LORD went up from Gilgal to Bochim and said, 'I brought you up out of Egypt and led you into the land that I swore to give to your fathers. I said, “I will never break my covenant with you.”'",
      "links": "<a href='/AIV/2/12/42'>Ex. 12:42</a>; <a href='/AIV/6/24/11'>Josh. 24:11</a>",
      "comment": "The angel of the LORD is often seen as a divine figure foreshadowing Christ's mediation (Judg. 6:11-24). The mention of covenant faithfulness points to the enduring promises of God."
    },
    {
      "pk": 7002002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 2,
      "text": "'And you shall not make a covenant with the inhabitants of this land. You shall tear down their altars.' But you have not obeyed my voice. Why have you done this?",
      "links": "<a href='/AIV/2/34/12-13'>Ex. 34:12-13</a>; <a href='/AIV/5/7/2'>Deut. 7:2</a>",
      "comment": "Israel's disobedience in failing to destroy the altars demonstrates the consequences of partial obedience. This ongoing theme reveals the need for leadership to preserve true worship."
    },
    {
      "pk": 7002003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 3,
      "text": "So I also said, “I will not drive them out before you, but they will be thorns in your sides, and their gods will be a snare to you.”'",
      "links": "<a href='/AIV/4/33/55'>Num. 33:55</a>",
      "comment": "This warning foreshadows future struggles with idolatry, which ultimately led the people away from true worship and unity, showing the need for spiritual guidance and discipline."
    },
    {
      "pk": 7002004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 4,
      "text": "When the angel of the LORD had spoken these words to all the Israelites, the people lifted up their voices and wept.",
      "links": "<a href='/AIV/6/24/24'>Josh. 24:24</a>",
      "comment": "The sorrow of the Israelites demonstrates a moment of conviction and collective repentance, highlighting the necessity of both sorrow for sin and communal reconciliation with God."
    },
    {
      "pk": 7002005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 5,
      "text": "So they called that place Bochim, and they offered sacrifices there to the LORD.",
      "links": "<a href='/AIV/1/35/14'>Gen. 35:14</a>",
      "comment": "\"Bochim\" means \"weepers.\" Their sacrifice, following confession, reflects a pattern maintained in the continuity of faith: repentance followed by sacrifice for atonement."
    },
    {
      "pk": 7002006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 6,
      "text": "When Joshua had dismissed the people, the Israelites went each to his own inheritance to possess the land.",
      "links": "<a href='/AIV/6/24/28'>Josh. 24:28</a>",
      "comment": "This summary bookends the era of Joshua, emphasizing the importance of God’s appointed leaders in settling and ordering the people."
    },
    {
      "pk": 7002007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 7,
      "text": "The people served the LORD all the days of Joshua and all the days of the elders who outlived Joshua, who had seen all the great works the LORD had done for Israel.",
      "links": "<a href='/AIV/6/24/31'>Josh. 24:31</a>",
      "comment": "Faithfulness corresponded with living memory of God’s miracles. Tradition and community leadership help preserve the faith."
    },
    {
      "pk": 7002008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 8,
      "text": "Joshua son of Nun, the servant of the LORD, died at the age of 110 years.",
      "links": "<a href='/AIV/6/24/29'>Josh. 24:29</a>",
      "comment": "Joshua is portrayed here as a faithful and righteous leader, called the servant of the LORD, drawing a parallel with Moses. His death marks a transition in leadership and faithfulness."
    },
    {
      "pk": 7002009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 9,
      "text": "They buried him in the territory of his inheritance at Timnath Heres, in the hill country of Ephraim, north of Mount Gaash.",
      "links": "<a href='/AIV/6/24/30'>Josh. 24:30</a>",
      "comment": "Joshua’s burial in the allotted land highlights the fulfillment of God’s promise and the importance of resting in the inheritance promised by God."
    },
    {
      "pk": 7002010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 10,
      "text": "All that generation also were gathered to their fathers. And another generation arose after them who did not know the LORD or the work that he had done for Israel.",
      "links": "<a href='/AIV/1/50/26'>Gen. 50:26</a>; <a href='/AIV/19/78/11'>Ps. 78:11</a>",
      "comment": "Forgetting God's works leads to spiritual decline. Passing on the faith, especially through tradition and liturgy, is necessary to retain knowledge of God."
    },
    {
      "pk": 7002011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 11,
      "text": "The Israelites did evil in the eyes of the LORD and served the Baals.",
      "links": "<a href='/AIV/2/20/2-5'>Ex. 20:2-5</a>",
      "comment": "Idolatry here represents not only a physical but a spiritual departure from God—an ongoing struggle for all believers to remain steadfast."
    },
    {
      "pk": 7002012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 12,
      "text": "They abandoned the LORD, the God of their fathers, who had brought them out of the land of Egypt, and followed other gods, from among the gods of the peoples around them. They bowed down to them, and provoked the LORD to anger.",
      "links": "<a href='/AIV/5/6/14-15'>Deut. 6:14-15</a>",
      "comment": "Departing from exclusive worship of God inevitably provokes righteous justice, driving home the importance of doctrinal purity and unity in worship."
    },
    {
      "pk": 7002013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 13,
      "text": "They abandoned the LORD and served Baal and the Ashtoreths.",
      "links": "<a href='/AIV/7/3/7'>Judg. 3:7</a>",
      "comment": "Turning to foreign gods violated their exclusive covenant relationship with God, foreshadowing ongoing need for spiritual renewal and proper authority."
    },
    {
      "pk": 7002014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 14,
      "text": "The anger of the LORD burned against Israel, and he handed them over to plunderers who plundered them. He sold them into the hands of their enemies all around, so that they could no longer stand before their enemies.",
      "links": "<a href='/AIV/2/14/27'>Ex. 14:27</a>; <a href='/AIV/19/106/41'>Ps. 106:41</a>",
      "comment": "God’s chastisement is for correction and restoration, not destruction, similar to loving discipline in the family of faith (Heb. 12:6)."
    },
    {
      "pk": 7002015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 15,
      "text": "Wherever they went out, the hand of the LORD was against them for harm, as the LORD had spoken and as the LORD had sworn to them. And they were greatly distressed.",
      "links": "<a href='/AIV/5/28/15'>Deut. 28:15</a>; <a href='/AIV/5/31/17'>Deut. 31:17</a>",
      "comment": "This is the fulfillment of covenant warnings (Deut. 28-31). God's discipline calls his people to repentance and restoration."
    },
    {
      "pk": 7002016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 16,
      "text": "Then the LORD raised up judges, who saved them out of the hands of those who plundered them.",
      "links": "<a href='/AIV/7/3/9'>Judg. 3:9</a>",
      "comment": "God works through chosen leaders to bring deliverance. This points to the necessity of divinely instituted offices for the welfare of the faithful."
    },
    {
      "pk": 7002017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 17,
      "text": "Yet they did not listen even to their judges, but prostituted themselves after other gods and bowed down to them. They quickly turned aside from the way their fathers had walked, obeying the LORD’s commands. They did not do as their fathers did.",
      "links": "<a href='/AIV/19/106/36-37'>Ps. 106:36-37</a>",
      "comment": "Infidelity to God is described in marital terms, pointing to the profound call to spiritual faithfulness and the consequences of separation from God’s law."
    },
    {
      "pk": 7002018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 18,
      "text": "When the LORD raised up judges for them, the LORD was with the judge, and he saved them from the hand of their enemies all the days of the judge; for the LORD had compassion because of their groaning under those who oppressed and afflicted them.",
      "links": "<a href='/AIV/19/106/44-45'>Ps. 106:44-45</a>",
      "comment": "God’s compassion is unfailing; through appointed deliverers, he demonstrates mercy. This reflects the continuous care provided through his chosen servants."
    },
    {
      "pk": 7002019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 19,
      "text": "But whenever the judge died, they turned back and did more corruptly than their fathers, going after other gods, serving them, and bowing down to them. They did not cease from their own stubborn ways.",
      "links": "<a href='/AIV/19/78/57-58'>Ps. 78:57-58</a>",
      "comment": "Tragic cycle of apostasy shows the dangers of lacking enduring spiritual authority and tradition. Stability and fidelity require clear leadership and continuity."
    },
    {
      "pk": 7002020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 20,
      "text": "So the anger of the LORD burned against Israel, and he said, 'Because this nation has transgressed the covenant that I commanded their fathers, and have not obeyed my voice,",
      "links": "<a href='/AIV/3/26/14-17'>Lev. 26:14-17</a>",
      "comment": "Breaking covenant brings consequences, reaffirming the necessity of obedience to divine authority established through revealed commands."
    },
    {
      "pk": 7002021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 21,
      "text": "'I also will no longer drive out from before them any of the nations that Joshua left when he died,",
      "links": "<a href='/AIV/2/23/29-30'>Ex. 23:29-30</a>",
      "comment": "God’s patience allows the nations to test Israel, purifying their faith and devotion through ongoing challenges."
    },
    {
      "pk": 7002022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 22,
      "text": "in order to test Israel by them, whether they will keep the way of the LORD and walk in it as their fathers did, or not.'",
      "links": "<a href='/AIV/5/8/2'>Deut. 8:2</a>",
      "comment": "Testing purifies faith. Trials are used by God to preserve and strengthen the people’s fidelity and dependence on his commands."
    },
    {
      "pk": 7002023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 2,
      "verse": 23,
      "text": "So the LORD left those nations, not driving them out quickly, and did not give them into the hand of Joshua.",
      "links": "<a href='/AIV/7/3/1-4'>Judg. 3:1-4</a>",
      "comment": "The Lord’s actions remind the faithful of the need for perseverance, obedience, and continuing the faithful tradition through the community, always in reliance upon the Lord."
    }
  ],
  "translatedAt": "2025-12-24T02:31:18.906Z"
}