{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 14,
  "verses": [
    {
      "pk": 7014001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 1,
      "text": "Samson went down to Timnah, and there he saw a woman, one of the daughters of the Philistines.",
      "links": "<a href='/AIV/06/15/10'>Josh. 15:10</a>",
      "comment": "Timnah was a Philistine city at the time. This sets the stage for Samson's complicated relationship with Israel's enemies."
    },
    {
      "pk": 7014002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 2,
      "text": "He came up and told his father and mother, 'I saw a woman in Timnah, one of the daughters of the Philistines. Now get her for me as my wife.'",
      "links": "<a href='/AIV/01/24/4'>Gen. 24:4</a>; <a href='/AIV/07/13/2'>Judg. 13:2</a>",
      "comment": "While Israelites were commanded not to marry outside their people (see Gen. 24:4), Samson's desire here foreshadows God working even through seemingly questionable choices."
    },
    {
      "pk": 7014003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 3,
      "text": "But his father and mother said to him, 'Is there not a woman among the daughters of your own relatives, or among our people, that you must go and take a wife from the uncircumcised Philistines?' But Samson said to his father, 'Get her for me, for she pleases me.'",
      "links": "<a href='/AIV/02/34/16'>Exod. 34:16</a>; <a href='/AIV/05/07/3'>Deut. 7:3</a>",
      "comment": "Marriage with the Philistines was forbidden by the Law (Exod. 34:16, Deut. 7:3), but God often works in unexpected ways through flawed people."
    },
    {
      "pk": 7014004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 4,
      "text": "His father and mother did not know that this was from the LORD, for he was seeking an opportunity against the Philistines, because at that time the Philistines ruled over Israel.",
      "links": "<a href='/AIV/07/13/1'>Judg. 13:1</a>; <a href='/AIV/01/50/20'>Gen. 50:20</a>",
      "comment": "God's providence is at work, even through human weakness and questionable choices (see Gen. 50:20). Spiritual lessons can be drawn about God's mysterious plans."
    },
    {
      "pk": 7014005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 5,
      "text": "Then Samson went down with his father and mother to Timnah. As they came to the vineyards of Timnah, suddenly a young lion came roaring toward him.",
      "links": "<a href='/AIV/09/17/34'>1 Sam. 17:34</a>",
      "comment": "The confrontation with the lion is reminiscent of later stories of God empowering His chosen ones for miraculous deeds (1 Sam. 17:34)."
    },
    {
      "pk": 7014006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 6,
      "text": "The Spirit of the LORD came powerfully upon him, and he tore the lion apart with his bare hands as one tears a young goat. But he did not tell his father or mother what he had done.",
      "links": "<a href='/AIV/07/3/10'>Judg. 3:10</a>; <a href='/AIV/07/15/14'>Judg. 15:14</a>",
      "comment": "God's Spirit empowers Samson beyond human strength, a reminder that the Spirit gives supernatural graces. This points ahead to the power given by God through the Holy Spirit (Acts 1:8)."
    },
    {
      "pk": 7014007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 7,
      "text": "Then he went down and talked with the woman, and she pleased Samson.",
      "links": "",
      "comment": "Samson’s desire, though problematic, is being used in God’s plan, showing that God's providence often unfolds in surprising ways."
    },
    {
      "pk": 7014008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 8,
      "text": "After some days he returned to marry her, and turning aside to see the carcass of the lion, he saw that a swarm of bees and honey were in the body of the lion.",
      "links": "<a href='/AIV/19/81/16'>Ps. 81:16</a>",
      "comment": "Honey from a lion's corpse is an unexpected source, teaching about the mysterious way God brings sweetness from what is otherwise dead or unclean."
    },
    {
      "pk": 7014009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 9,
      "text": "He scraped it out into his hands and went on, eating as he went. He came to his father and mother and gave some to them, and they also ate, but he did not tell them that he had taken the honey from the body of the lion.",
      "links": "<a href='/AIV/03/11/27'>Lev. 11:27</a>",
      "comment": "Touching a dead animal was a violation of ritual purity (Lev. 11:27). Samson’s disregard points to his lack of concern for the consecration expected of a Nazirite."
    },
    {
      "pk": 7014010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 10,
      "text": "His father went down to the woman, and Samson prepared a feast there, as the young men used to do.",
      "links": "<a href='/AIV/01/29/22'>Gen. 29:22</a>",
      "comment": "Wedding feasts were customarily long and joyful affairs. Such feasts often symbolize a celebration of covenant, which is echoed in the New Testament (Matt. 22:2)."
    },
    {
      "pk": 7014011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 11,
      "text": "When the people saw him, they brought thirty companions to be with him.",
      "links": "<a href='/AIV/07/16/27'>Judg. 16:27</a>",
      "comment": "The Philistines provide companions, perhaps to keep watch on Samson. Their distrust will soon be revealed."
    },
    {
      "pk": 7014012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 12,
      "text": "And Samson said to them, 'Let me now put a riddle to you. If you can tell me the answer within the seven days of the feast and solve it, then I will give you thirty linen garments and thirty sets of clothes.'",
      "links": "<a href='/AIV/07/14/14'>Judg. 14:14</a>",
      "comment": "Riddles and wagers were common in ancient feasts. Samson’s challenge sets the stage for conflict and demonstrates wit as well as strength."
    },
    {
      "pk": 7014013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 13,
      "text": "'But if you cannot solve it, then you shall give me thirty linen garments and thirty sets of clothes.' And they said to him, 'Put forth your riddle, that we may hear it.'",
      "links": "",
      "comment": "Clothing in this context was a valuable commodity. The exchange shows the seriousness of Samson's proposal."
    },
    {
      "pk": 7014014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 14,
      "text": "And he said to them, 'Out of the eater came something to eat, and out of the strong came something sweet.' For three days they could not solve the riddle.",
      "links": "<a href='/AIV/07/14/8-9'>Judg. 14:8-9</a>",
      "comment": "Samson’s riddle is rooted in his unique experience. Symbolically, it speaks of life coming from death, a common theme fulfilled in the resurrection of Christ (1 Cor. 15:54–55)."
    },
    {
      "pk": 7014015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 15,
      "text": "On the fourth day they said to Samson's wife, 'Entice your husband to explain the riddle to us, or we will burn you and your father's house with fire. Did you invite us here to rob us?'",
      "links": "<a href='/AIV/07/15/6'>Judg. 15:6</a>",
      "comment": "The Philistines’ threat shows their violence and how foreign alliances could bring trouble to God's people (cf. Judg. 15:6)."
    },
    {
      "pk": 7014016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 16,
      "text": "Samson’s wife wept before him and said, 'You only hate me; you do not love me. You have put a riddle to my people, but you have not explained it to me.' And he said to her, 'Look, I have not explained it to my father or my mother, so why should I explain it to you?'",
      "links": "",
      "comment": "The tension between loyalty to family and loyalty to one’s spouse is highlighted. The breakdown in trust foreshadows future betrayals."
    },
    {
      "pk": 7014017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 17,
      "text": "She wept before him for the seven days of their feast. On the seventh day he told her, because she pressed him, and she told the riddle to her people.",
      "links": "<a href='/AIV/07/16/15-17'>Judg. 16:15-17</a>",
      "comment": "Samson's weakness before women recurs throughout his story (cf. Judg. 16:15–17). The theme of betrayal is strong here."
    },
    {
      "pk": 7014018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 18,
      "text": "So the men of the city said to him on the seventh day before sunset, 'What is sweeter than honey? What is stronger than a lion?' And he said to them, 'If you had not plowed with my heifer, you would not have solved my riddle.'",
      "links": "",
      "comment": "Samson's cryptic language makes clear his anger at their use of his wife’s loyalty to get the answer. This introduces questions about marital unity and trust."
    },
    {
      "pk": 7014019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 19,
      "text": "Then the Spirit of the LORD rushed upon him, and he went down to Ashkelon and struck down thirty men of the city, took their spoil, and gave the sets of clothes to those who had told the riddle. In his anger he went back up to his father's house.",
      "links": "<a href='/AIV/07/3/10'>Judg. 3:10</a>; <a href='/AIV/07/15/14'>Judg. 15:14</a>",
      "comment": "Though violent, Samson's actions are prompted by the Spirit to fulfill God's deliverance of Israel. The Spirit’s power can be both just and mysterious."
    },
    {
      "pk": 7014020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 14,
      "verse": 20,
      "text": "Samson’s wife was given to his companion, who had been his friend.",
      "links": "<a href='/AIV/07/15/2'>Judg. 15:2</a>",
      "comment": "The Philistines break custom, taking away Samson’s wife and giving her to another. This offense leads to greater conflict. The cycle of betrayal and the loss of spiritual fidelity points forward to themes later found in the prophets."
    }
  ],
  "translatedAt": "2025-12-24T02:38:58.066Z"
}