{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 18,
  "verses": [
    {
      "pk": 7018001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 1,
      "text": "In those days, there was no king in Israel. And in those days the tribe of the Danites was seeking for itself an inheritance to live in, for until that day, their territory among the tribes of Israel had not fallen to them.",
      "links": "<a href='/AIV/7/17/6'>Judg. 17:6</a>; <a href='/AIV/7/19/1'>Judg. 19:1</a>",
      "comment": "This verse repeats the theme that Israel lacked centralized leadership. The Danites' search for an inheritance recalls the incomplete conquest in Joshua <a href='/AIV/6/19/47'>Josh. 19:47</a>; see how this points to the need for righteous authority and unity, important in both a spiritual and communal sense."
    },
    {
      "pk": 7018002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 2,
      "text": "So the children of Dan sent five men from their whole clan, men of valor from Zorah and Eshtaol, to spy out the land and to explore it; and they said to them, 'Go, explore the land.' So they came to the hill country of Ephraim, to the house of Micah, and spent the night there.",
      "links": "<a href='/AIV/7/13/25'>Judg. 13:25</a>; <a href='/AIV/6/2/1'>Josh. 2:1</a>",
      "comment": "The mission of the Danite spies mirrors the earlier Israelite spying in Numbers 13 and Joshua 2. Their journey to Micah's house foreshadows coming events and connections between worship and the establishment of territory."
    },
    {
      "pk": 7018003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 3,
      "text": "While they were near Micah’s household, they recognized the voice of the young Levite. So they turned aside and said to him, 'Who brought you here? What are you doing in this place? What is your business here?'",
      "links": "<a href='/AIV/7/17/7-13'>Judg. 17:7-13</a>",
      "comment": "The Levite’s presence in a layman’s house alludes to the spiritual disarray in Israel at the time. Levitical wandering points to the future importance of a unified place of worship and a structured priesthood (see <a href='/AIV/5/12/5-14'>Deut. 12:5-14</a>)."
    },
    {
      "pk": 7018004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 4,
      "text": "He told them, 'Micah did such and such for me. He hired me, and I became his priest.'",
      "links": "<a href='/AIV/7/17/10'>Judg. 17:10</a>",
      "comment": "A Levite serving as a private priest for an individual reveals the irregularity of worship practices during this period. God’s law intended Levites to serve in established sanctuaries (see <a href='/AIV/4/3/6-10'>Num. 3:6–10</a>)."
    },
    {
      "pk": 7018005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 5,
      "text": "So they said to him, 'Please inquire of God for us, that we may know whether the journey on which we are going will succeed.'",
      "links": "<a href='/AIV/9/22/10'>1 Sam. 22:10</a>; <a href='/AIV/5/18/21-22'>Deut. 18:21-22</a>",
      "comment": "Seeking divine guidance was practiced, but not always in the manner God prescribed. This highlights the human yearning for direction from God, ultimately fulfilled in Christ (see <a href='/AIV/43/14/6'>John 14:6</a>)."
    },
    {
      "pk": 7018006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 6,
      "text": "And the priest said to them, 'Go in peace. The journey you are making is under the Lord’s eye.'",
      "links": "<a href='/AIV/6/6/23'>Josh. 6:23</a>; <a href='/AIV/7/17/13'>Judg. 17:13</a>",
      "comment": "The blessing echoes traditional priestly language. However, the authenticity of the priest’s blessing may be questionable due to the questionable context. Points to the need for true mediators between God and man—ultimately fulfilled in Christ as High Priest (<a href='/AIV/58/4/14-16'>Heb. 4:14-16</a>)."
    },
    {
      "pk": 7018007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 7,
      "text": "So the five men departed and came to Laish. They saw that the people dwelling there were living securely, after the manner of the Sidonians, quiet and unsuspecting, lacking nothing in the land and possessing wealth. They were far from the Sidonians and had no allies.",
      "links": "<a href='/AIV/1/2/10-11'>Gen. 10:19</a>; <a href='/AIV/6/19/47'>Josh. 19:47</a>",
      "comment": "Laish's isolation made it vulnerable—a physical reality often paralleled spiritually when one is cut off from the people of God."
    },
    {
      "pk": 7018008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 8,
      "text": "When they returned to their relatives at Zorah and Eshtaol, their brothers said to them, 'What do you report?'",
      "links": "<a href='/AIV/7/13/25'>Judg. 13:25</a>",
      "comment": "Their return echoes earlier spy missions in Israel’s history (see <a href='/AIV/4/13/26'>Num. 13:26</a>)."
    },
    {
      "pk": 7018009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 9,
      "text": "And they replied, 'Get up! Let us go up against them. For we have seen the land, and it is very good. Will you do nothing? Do not delay to go and enter, take possession of the land.'",
      "links": "<a href='/AIV/6/2/23-24'>Josh. 2:23-24</a>; <a href='/AIV/4/13/30'>Num. 13:30</a>",
      "comment": "Their enthusiasm resembles Caleb’s confidence in Numbers 13:30. Notice the language of taking possession—reflects Israel’s ongoing mission."
    },
    {
      "pk": 7018010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 10,
      "text": "'When you go, you will come to a secure people, and the land is spacious. For God has delivered it into your hands, a place where there is no lack of anything that is on the earth.'",
      "links": "<a href='/AIV/6/21/45'>Josh. 21:45</a>",
      "comment": "Their confidence stands both in their reconnaissance and in God’s promise. The language 'God has delivered…' is similar to God’s words in earlier conquests (<a href='/AIV/6/8/7'>Josh. 8:7</a>)."
    },
    {
      "pk": 7018011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 11,
      "text": "So six hundred men of the clan of the Danites, armed with weapons of war, set out from Zorah and Eshtaol.",
      "links": "<a href='/AIV/7/13/25'>Judg. 13:25</a>; <a href='/AIV/6/19/47'>Josh. 19:47</a>",
      "comment": "The organized force indicates seriousness in claiming their promised inheritance."
    },
    {
      "pk": 7018012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 12,
      "text": "They went up and camped at Kiriath-jearim in Judah. That is why to this day the place is called Mahaneh-dan; it is west of Kiriath-jearim.",
      "links": "<a href='/AIV/7/13/25'>Judg. 13:25</a>; <a href='/AIV/6/15/9-13'>Josh. 15:9-13</a>",
      "comment": "Mahaneh-dan, 'Camp of Dan,' stands as a historic marker for Dan’s movement. It is noteworthy for its connection to Samson’s origin story, showing the interconnectedness of Israel’s history and God’s providence."
    },
    {
      "pk": 7018013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 13,
      "text": "From there they passed on to the hill country of Ephraim and came to Micah’s house.",
      "links": "<a href='/AIV/7/17/1'>Judg. 17:1</a>",
      "comment": "The Danites’ return to Micah’s house signals a pivotal moment regarding worship and idolatry."
    },
    {
      "pk": 7018014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 14,
      "text": "Then the five men who had gone to scout the land of Laish said to their brothers, 'Do you know that in these houses there are an ephod, household gods, a carved image, and a metal image? Therefore consider what you should do.'",
      "links": "<a href='/AIV/7/17/5'>Judg. 17:5</a>; <a href='/AIV/1/31/19'>Gen. 31:19</a>",
      "comment": "Reference to the ephod and images points out confusion surrounding legitimate versus illegitimate worship—a major theme in the Old Testament regarding how God is to be worshipped properly."
    },
    {
      "pk": 7018015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 15,
      "text": "They turned aside there and came to the house of the young Levite, at Micah’s house, and greeted him.",
      "links": "<a href='/AIV/7/17/10'>Judg. 17:10</a>",
      "comment": "Their approach to the Levite for blessing seeks security, again showing how leadership and priestly mediation shaped Israel’s conscience."
    },
    {
      "pk": 7018016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 16,
      "text": "Now the six hundred men of the Danites, armed with their weapons of war, stood by the entrance of the gate.",
      "links": "<a href='/AIV/7/18/11'>Judg. 18:11</a>",
      "comment": "The mention of armed men at the gate sets up confrontation and suggests an atmosphere of intimidation."
    },
    {
      "pk": 7018017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 17,
      "text": "And the five men who had gone to scout the land entered and took the carved image, the ephod, the household gods, and the metal image, while the priest stood at the entrance of the gate with the six hundred men armed with weapons of war.",
      "links": "<a href='/AIV/7/17/5'>Judg. 17:5</a>",
      "comment": "Taking the idols reveals the misguided attempt to secure divine favor through created things. This practice of moving sacred objects places a greater emphasis on the need for proper worship, eventually only possible in the setting established by God (see <a href='/AIV/5/12/13-14'>Deut. 12:13-14</a>)."
    },
    {
      "pk": 7018018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 18,
      "text": "When these men went into Micah’s house and took the carved image, the ephod, the household gods, and the metal image, the priest said to them, 'What are you doing?'",
      "links": "<a href='/AIV/7/18/14'>Judg. 18:14</a>",
      "comment": "The priest's objection is ironic: he has himself participated in setting up irregular worship."
    },
    {
      "pk": 7018019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 19,
      "text": "They said to him, 'Be quiet. Put your hand over your mouth and come with us. Be a father and a priest to us. Is it better for you to be priest to the household of one man, or to be priest to a tribe and clan in Israel?'",
      "links": "<a href='/AIV/1/45/8'>Gen. 45:8</a>; <a href='/AIV/2/18/19'>Ex. 18:19</a>",
      "comment": "They offer greater honor, but outside of God’s prescribed way. The title 'father' signals spiritual authority and hints at the development of spiritual leadership structures."
    },
    {
      "pk": 7018020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 20,
      "text": "So the priest was glad in his heart. He took the ephod, the household gods, and the carved image, and went among the people.",
      "links": "<a href='/AIV/7/18/17'>Judg. 18:17</a>",
      "comment": "The Levite’s willingness to go for prestige shows the human weakness for ambition rather than God’s call—contrasting with true ministers who sacrifice for their flock."
    },
    {
      "pk": 7018021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 21,
      "text": "They turned and departed, putting the little ones, the livestock, and the goods in front of them.",
      "links": "<a href='/AIV/1/33/1-2'>Gen. 33:1-2</a>",
      "comment": "Placing the vulnerable in front was a strategic practice for protection but also signals prioritizing the community."
    },
    {
      "pk": 7018022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 22,
      "text": "When they had gone a short distance from Micah’s house, the men who lived in the houses near Micah's house cried out and overtook the Danites.",
      "links": "<a href='/AIV/7/17/2'>Judg. 17:2</a>",
      "comment": "Neighbors show concern for Micah’s loss, underlining how religious practices were closely tied to the local community’s identity."
    },
    {
      "pk": 7018023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 23,
      "text": "They called out to the Danites, who turned around and said to Micah, 'What is the matter with you, that you have gathered together?'",
      "links": "<a href='/AIV/7/18/22'>Judg. 18:22</a>",
      "comment": "The Danites’ confrontational question highlights the breakdown of relationships and communal bonds."
    },
    {
      "pk": 7018024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 24,
      "text": "He replied, 'You have taken away my gods which I made, and the priest, and have gone away, and what do I have left? How then can you ask me, ‘What is the matter with you?’'",
      "links": "<a href='/AIV/1/31/30-35'>Gen. 31:30-35</a>",
      "comment": "Micah’s loss exposes the futility of idols: he admits he made his gods—contrary to the worship of the one true uncreated God. Spiritualized, this verse warns against forming our own means of salvation."
    },
    {
      "pk": 7018025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 25,
      "text": "The Danites said to him, 'Do not let your voice be heard among us, lest angry men fall upon you, and you lose your life and the lives of your household.'",
      "links": "<a href='/AIV/1/34/30'>Gen. 34:30</a>",
      "comment": "A warning mixed with threat. The use of force shows how far Israel had drifted from covenant ideals of brotherhood."
    },
    {
      "pk": 7018026,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 26,
      "text": "Then the Danites went their way. When Micah saw that they were too strong for him, he turned and went back to his house.",
      "links": "<a href='/AIV/7/17/2'>Judg. 17:2</a>",
      "comment": "Micah’s retreat reflects personal powerlessness when separated from worshiping God in Spirit and truth."
    },
    {
      "pk": 7018027,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 27,
      "text": "But the Danites took what Micah had made, and the priest who belonged to him, and they went to Laish, to a people quiet and unsuspecting, and struck them with the edge of the sword and burned the city with fire.",
      "links": "<a href='/AIV/1/34/25-29'>Gen. 34:25-29</a>",
      "comment": "The destruction of Laish underlines the consequences of spiritual and physical isolation. God seeks to gather and protect through unity."
    },
    {
      "pk": 7018028,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 28,
      "text": "There was no one to rescue them, because they lived far from Sidon and had no dealings with anyone. The city was in the valley that belongs to Beth-rehob. Then the Danites rebuilt the city and lived in it.",
      "links": "<a href='/AIV/6/19/47'>Josh. 19:47</a>",
      "comment": "The isolation of Laish ironically becomes an opening for the Danites. Rebuilding the city is an act of claiming inheritance, but it is tainted by violence and questionable worship."
    },
    {
      "pk": 7018029,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 29,
      "text": "And they named the city Dan, after the name of Dan their ancestor, who was born to Israel; but the name of the city was formerly Laish.",
      "links": "<a href='/AIV/1/30/6'>Gen. 30:6</a>; <a href='/AIV/6/19/47'>Josh. 19:47</a>",
      "comment": "Renaming the city marks a new beginning rooted in Israel's history but unfortunately not always in faithful worship."
    },
    {
      "pk": 7018030,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 30,
      "text": "The Danites set up for themselves the carved image. Jonathan, the son of Gershom, son of Moses, and his sons were priests to the tribe of Dan until the day of the captivity of the land.",
      "links": "<a href='/AIV/2/2/22'>Ex. 2:22</a>; <a href='/AIV/13/23/15-16'>1 Chr. 23:15-16</a>",
      "comment": "Jonathan, descendant of Moses, establishes a rival priesthood in Dan. Highlights a division in worship: true mediation requires legitimacy and apostolic succession—important principles still central for understanding spiritual authority today."
    },
    {
      "pk": 7018031,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 18,
      "verse": 31,
      "text": "So they set up Micah's carved image that he made, all the time that the house of God was at Shiloh.",
      "links": "<a href='/AIV/6/18/1'>Josh. 18:1</a>; <a href='/AIV/9/1/3'>1 Sam. 1:3</a>",
      "comment": "The contrast between worship at Dan and at the divinely-appointed Shiloh foreshadows the need for unity around the true dwelling place of God. Only in God’s appointed house is true worship found—a foreshadowing of the later gathering of all believers around one altar and one High Priest, Christ (<a href='/AIV/58/10/19-22'>Heb. 10:19-22</a>)."
    }
  ],
  "translatedAt": "2025-12-24T02:41:06.164Z"
}