{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 8,
  "verses": [
    {
      "pk": 7008001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 1,
      "text": "The men of Ephraim said to Gideon, \"What have you done to us by not calling us when you went to fight Midian?\" They argued sharply with him.",
      "links": "<a href='/AIV/7/12/1-3'>Judg. 12:1-3</a>; <a href='/AIV/6/17/14'>Josh. 17:14</a>",
      "comment": "Ephraim's complaint shows inter-tribal tensions, a theme that recurs. This anticipates the unity needed among God's people—seen later in the Church as formed in Acts 2:42-47."
    },
    {
      "pk": 7008002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 2,
      "text": "But Gideon answered them, \"What have I accomplished compared to you? Aren’t the gleanings of Ephraim better than the full harvest of Abiezer?",
      "links": "<a href='/AIV/7/6/11'>Judg. 6:11</a>; <a href='/AIV/7/7/24'>Judg. 7:24-25</a>",
      "comment": "Gideon uses humility and diplomacy, emphasizing their shared victory. This approach reflects the Scriptural principle of unity among believers."
    },
    {
      "pk": 7008003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 3,
      "text": "God gave Oreb and Zeeb, the Midianite leaders, into your hands. What was I able to do compared to you?\" At this, their anger subsided.",
      "links": "<a href='/AIV/7/7/25'>Judg. 7:25</a>; <a href='/AIV/2/14/19'>Ex. 14:19</a>",
      "comment": "Gideon credits the victory to God, modeling humility. This anticipates Christian understanding of spiritual victories as God's work."
    },
    {
      "pk": 7008004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 4,
      "text": "Gideon and his three hundred men, exhausted but still pursuing, came to the Jordan and crossed over.",
      "links": "<a href='/AIV/7/7/7'>Judg. 7:7</a>; <a href='/AIV/6/3/17'>Josh. 3:17</a>",
      "comment": "Even in weariness, Gideon persists. Perseverance in faith is highly praised throughout Scripture (Heb. 12:1-3)."
    },
    {
      "pk": 7008005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 5,
      "text": "He said to the men of Succoth, \"Please give my men some bread. They are exhausted, and I am chasing Zebah and Zalmunna, kings of Midian.\"",
      "links": "<a href='/AIV/7/8/12'>Judg. 8:12</a>; <a href='/AIV/13/30/24'>Prov. 30:24</a>",
      "comment": "Asking aid reveals reliance on the charity and support among God's people, foreshadowing Christ's teaching on works of mercy (Matt. 25:35-40)."
    },
    {
      "pk": 7008006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 6,
      "text": "But the leaders of Succoth replied, \"Are Zebah and Zalmunna already in your hands, that we should give bread to your army?\"",
      "links": "<a href='/AIV/11/17/10'>1 Kgs. 17:10</a>",
      "comment": "The refusal contrasts with the virtue of hospitality and faith, essential in both Old and New Covenants. Compare with Abraham’s hospitality (Gen. 18:1-8)."
    },
    {
      "pk": 7008007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 7,
      "text": "Then Gideon said, \"For that, when the LORD hands Zebah and Zalmunna over to me, I will tear your flesh with thorns and briers from the wilderness.\"",
      "links": "<a href='/AIV/23/9/18'>Isa. 9:18</a>",
      "comment": "Gideon's stern warning signals consequences for lack of charity, paralleling future teachings about judgment for ignoring the needy."
    },
    {
      "pk": 7008008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 8,
      "text": "From there he went up to Peniel and asked the same thing. But they answered him just as the men of Succoth had.",
      "links": "<a href='/AIV/1/32/30'>Gen. 32:30</a>; <a href='/AIV/7/8/6'>Judg. 8:6</a>",
      "comment": "Peniel’s name recalls Jacob’s encounter with God, highlighting Israel’s spiritual heritage. Again, refusal marks a lack of faith and hospitality."
    },
    {
      "pk": 7008009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 9,
      "text": "So he said to the men of Peniel, \"When I return in victory, I will tear down this tower.\"",
      "links": "<a href='/AIV/7/8/17'>Judg. 8:17</a>",
      "comment": "Gideon promises punishment, which reflects the seriousness of failing to support and obey God’s appointed leader."
    },
    {
      "pk": 7008010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 10,
      "text": "Zebah and Zalmunna were at Karkor with their armies, about fifteen thousand men—all who were left of the armies of the eastern peoples. One hundred and twenty thousand sword bearers had fallen.",
      "links": "<a href='/AIV/7/7/22'>Judg. 7:22</a>",
      "comment": "This shows the might of God’s deliverance. The devastation of the enemy ties to divine intervention, not human strength alone."
    },
    {
      "pk": 7008011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 11,
      "text": "Gideon went up by the route of the tent-dwellers, east of Nobah and Jogbehah, and attacked the camp when the army felt secure.",
      "links": "<a href='/AIV/4/21/10'>Num. 21:10-12</a>",
      "comment": "Gideon’s surprise attack is reminiscent of God’s strategy for victory. Security comes not from numbers but faith."
    },
    {
      "pk": 7008012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 12,
      "text": "Zebah and Zalmunna fled, but Gideon pursued and captured both kings of Midian. He threw all their army into confusion.",
      "links": "<a href='/AIV/2/14/25'>Ex. 14:25</a>; <a href='/AIV/7/7/22'>Judg. 7:22</a>",
      "comment": "Delivers the enemy kings, fulfilling God’s promise to deliver Israel’s enemies. This echoes the Lord’s victories in Israel’s history."
    },
    {
      "pk": 7008013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 13,
      "text": "Then Gideon son of Joash returned from the battle by the pass of Heres.",
      "links": "<a href='/AIV/7/6/11'>Judg. 6:11</a>",
      "comment": "Gideon’s return signifies fulfillment of his vows. The narrative continues his faith-filled leadership."
    },
    {
      "pk": 7008014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 14,
      "text": "He captured a young man from Succoth and questioned him, who wrote down for him the names of the seventy-seven leaders and elders of Succoth.",
      "links": "<a href='/AIV/7/8/6'>Judg. 8:6</a>",
      "comment": "The recording of names is noteworthy, recalling the importance of accountability in leadership and community."
    },
    {
      "pk": 7008015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 15,
      "text": "He went to the men of Succoth and said, \"Here are Zebah and Zalmunna, about whom you mocked me, saying, 'Are they already in your hands?'\"",
      "links": "<a href='/AIV/7/8/6'>Judg. 8:6</a>",
      "comment": "Gideon confronts their faithlessness. Their lack of trust foreshadows later consequences for doubting God."
    },
    {
      "pk": 7008016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 16,
      "text": "He took the elders of the city, and with thorns and briers from the wilderness, he punished the men of Succoth.",
      "links": "<a href='/AIV/7/8/7'>Judg. 8:7</a>",
      "comment": "Gideon fulfills his warning. This punishment hints at the discipline God enacts on those who resist His purpose."
    },
    {
      "pk": 7008017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 17,
      "text": "He also tore down the tower of Peniel and killed the men of the city.",
      "links": "<a href='/AIV/7/8/9'>Judg. 8:9</a>",
      "comment": "The severity underscores the gravity of rejecting God’s appointed deliverance. Later, Christ speaks of building the ultimate 'tower'—the Church (Matt. 16:18)."
    },
    {
      "pk": 7008018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 18,
      "text": "Then he asked Zebah and Zalmunna, \"What kind of men did you kill at Tabor?\" They answered, \"Men like yourself, each one like a king’s son.\"",
      "links": "<a href='/AIV/7/4/6'>Judg. 4:6</a>",
      "comment": "Their answer implies noble lineage, underlining the injustice of their actions and Gideon’s right to seek justice."
    },
    {
      "pk": 7008019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 19,
      "text": "Gideon said, \"They were my brothers, sons of my own mother. As surely as the LORD lives, if you had spared them, I would not kill you.\"",
      "links": "<a href='/AIV/1/4/9'>Gen. 4:9</a>",
      "comment": "Blood vengeance is consistent with Old Testament law; it also points beyond, to Christ who forgives even those who kill Him (Luke 23:34)."
    },
    {
      "pk": 7008020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 20,
      "text": "He told Jether, his firstborn, \"Rise, kill them.\" But the boy did not draw his sword; he was afraid, for he was still a youth.",
      "links": "<a href='/AIV/9/17/7'>1 Sam. 17:7</a>",
      "comment": "Jether’s fear is a human moment; contrasts with David’s boldness. The idea of sonship and authority runs through Scripture, culminating in Christ."
    },
    {
      "pk": 7008021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 21,
      "text": "Then Zebah and Zalmunna said, \"Rise yourself and strike us, for as a man is, so is his strength.\" So Gideon arose and killed Zebah and Zalmunna, and took the crescents from their camels’ necks.",
      "links": "<a href='/AIV/19/76/5'>Ps. 76:5</a>",
      "comment": "Gideon administers justice personally. Notice the mention of crescents, hinting at foreign idolatrous symbols rejected by Israel."
    },
    {
      "pk": 7008022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 22,
      "text": "Then the men of Israel said to Gideon, \"Rule over us—you, your son, and your grandson; for you have delivered us out of Midian’s hand.\"",
      "links": "<a href='/AIV/11/2/12'>1 Sam. 2:12</a>",
      "comment": "Israel desires a hereditary rule; this foreshadows later monarchy and priestly succession—how God ordains leaders for the people."
    },
    {
      "pk": 7008023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 23,
      "text": "But Gideon said to them, \"I will not rule over you, nor will my son rule over you; the LORD will rule over you.\"",
      "links": "<a href='/AIV/9/8/7'>1 Sam. 8:7</a>",
      "comment": "Gideon rightly points to the Lord as King, contrasting earthly leadership with divine authority. This points to Christ as the true King (John 18:36)."
    },
    {
      "pk": 7008024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 24,
      "text": "Then Gideon said to them, \"Let me make a request: each of you give me an earring from your share of the plunder.\" (They had gold earrings, because they were Ishmaelites.)",
      "links": "<a href='/AIV/2/32/2'>Ex. 32:2</a>",
      "comment": "Gold earrings recall the golden calf incident and dangers of wealth. Spiritual leaders must be wary of material temptations."
    },
    {
      "pk": 7008025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 25,
      "text": "They answered, \"We will gladly give them.\" So they spread out a cloak and threw each earring from their plunder onto it.",
      "links": "<a href='/AIV/2/12/35'>Ex. 12:35-36</a>",
      "comment": "Generosity contrasts previous refusals, yet there is an underlying caution about its direction."
    },
    {
      "pk": 7008026,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 26,
      "text": "The weight of the gold earrings came to seventeen hundred shekels, not counting the crescent ornaments, pendants, and purple garments worn by the Midianite kings, nor the collars on their camels.",
      "links": "<a href='/AIV/2/38/24'>Ex. 38:24</a>",
      "comment": "The specific weights highlight the immense spoils. Purple garments refer to royal status, later associated with Christ’s kingship (Mark 15:17)."
    },
    {
      "pk": 7008027,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 27,
      "text": "Gideon made the gold into an ephod, which he placed in Ophrah, his city. All Israel prostituted themselves by worshipping it there, and it became a snare to Gideon and his family.",
      "links": "<a href='/AIV/2/28/6'>Ex. 28:6</a>; <a href='/AIV/2/32/4'>Ex. 32:4</a>",
      "comment": "The ephod, meant for priestly service, becomes idolatrous. See how even holy things can be misused, underscoring the seriousness of true worship and the dangers of innovation."
    },
    {
      "pk": 7008028,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 28,
      "text": "Midian was subdued before the Israelites, and did not lift its head again. During Gideon's lifetime, the land had peace for forty years.",
      "links": "<a href='/AIV/7/3/11'>Judg. 3:11</a>",
      "comment": "Forty years of peace echoes Israel's cycles and the blessing of obedience, a foretaste of the eternal rest Christ promises (Heb. 4:9-11)."
    },
    {
      "pk": 7008029,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 29,
      "text": "Jerub-Baal son of Joash went back to his home and lived there.",
      "links": "<a href='/AIV/7/6/32'>Judg. 6:32</a>",
      "comment": "Jerub-Baal is Gideon’s other name. His return marks the end of his active leadership, yet the repercussions will follow."
    },
    {
      "pk": 7008030,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 30,
      "text": "Gideon had seventy sons, his own offspring, for he had many wives.",
      "links": "<a href='/AIV/7/9/2'>Judg. 9:2</a>; <a href='/AIV/13/29/21'>Prov. 29:21</a>",
      "comment": "Many wives and sons reflect the culture, though later Scripture upholds monogamy as the ideal (Matt. 19:4-6)."
    },
    {
      "pk": 7008031,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 31,
      "text": "His concubine at Shechem also bore him a son, whom he named Abimelech.",
      "links": "<a href='/AIV/7/9/18'>Judg. 9:18</a>",
      "comment": "Abimelech’s birth outside wedlock foreshadows conflict. God’s design for family points toward a faithful, unified household."
    },
    {
      "pk": 7008032,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 32,
      "text": "Gideon son of Joash died at a good old age, and was buried in the tomb of Joash his father in Ophrah of the Abiezrites.",
      "links": "<a href='/AIV/1/15/15'>Gen. 15:15</a>",
      "comment": "Gideon’s peaceful death is a blessing, foreshadowing the promised rest for the faithful in Christ. Burial with ancestors recalls continuity in faith."
    },
    {
      "pk": 7008033,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 33,
      "text": "After Gideon’s death, the Israelites turned again to prostituting themselves with the Baals; they made Baal-Berith their god.",
      "links": "<a href='/AIV/7/2/11-13'>Judg. 2:11-13</a>; <a href='/AIV/7/8/27'>Judg. 8:27</a>",
      "comment": "Israel repeats the cycle of apostasy. Spiritual fidelity is crucial—see parallels in the steadfastness called for in New Testament teaching (1 Cor. 10:14)."
    },
    {
      "pk": 7008034,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 34,
      "text": "The Israelites did not remember the LORD their God, who had rescued them from the hands of all their enemies on every side.",
      "links": "<a href='/AIV/5/8/14'>Deut. 8:14'>Deut. 8:14-20</a>; <a href='/AIV/7/2/10'>Judg. 2:10</a>",
      "comment": "Spiritual amnesia is a danger to God’s people. The importance of remembrance and gratitude is central in worship and prayer."
    },
    {
      "pk": 7008035,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 8,
      "verse": 35,
      "text": "Nor did they show kindness to the family of Jerub-Baal (Gideon) for all the good he had done for Israel.",
      "links": "<a href='/AIV/7/9/16'>Judg. 9:16-19</a>",
      "comment": "Failure to honor God’s servant points to the need for perpetual remembrance of spiritual leaders and faithfulness—a principle found in later Christian tradition (Heb. 13:7)."
    }
  ],
  "translatedAt": "2025-12-24T02:35:08.671Z"
}