{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 15,
  "verses": [
    {
      "pk": 7015001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 1,
      "text": "After some days, during the wheat harvest, Samson went to visit his wife, bringing a young goat as a gift; he said, 'Let me go in to my wife in her room.' But her father would not allow him to go in.",
      "links": "<a href='/AIV/07/14/20'>Judg. 14:20</a>",
      "comment": "Samson attempts to reconcile with his wife after a period of separation—his intent to bring a gift shows custom and seeks reconciliation (cf. Judg. 14:20)."
    },
    {
      "pk": 7015002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 2,
      "text": "Her father said, 'I truly thought you hated her, so I gave her to your companion. Is not her younger sister more beautiful than she? Please take her instead.'",
      "links": "<a href='/AIV/07/14/20'>Judg. 14:20</a>",
      "comment": "The father’s offer reflects ancient customs and reveals misunderstandings in human relationships. The law regarding betrothals and marriage is highlighted here (see Deut. 24:1)."
    },
    {
      "pk": 7015003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 3,
      "text": "Samson said to them, 'This time I will be innocent concerning the Philistines, if I do them harm.'",
      "links": "<a href='/AIV/07/14/4'>Judg. 14:4</a>",
      "comment": "Samson considers himself justified in taking action against the Philistines. The phrase points toward the justness of his forthcoming vengeance, indicating righteous indignation in line with the biblical concept of justice."
    },
    {
      "pk": 7015004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 4,
      "text": "So Samson went and caught three hundred foxes, and took torches. He tied them tail to tail and put a torch between each pair of tails.",
      "links": "<a href='/AIV/Ex/8/17-18'>Ex. 8:17-18</a>",
      "comment": "The remarkable feat of catching foxes shows supernatural help or extraordinary ability. The use of fire as divine judgment echoes other Old Testament symbolism regarding God’s wrath (e.g., Gen. 19:24)."
    },
    {
      "pk": 7015005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 5,
      "text": "When he had set fire to the torches, he released them into the standing grain of the Philistines and burned up both the shocks and the standing grain, along with the vineyards and olive groves.",
      "links": "<a href='/AIV/Ex/22/6'>Ex. 22:6</a>; <a href='/AIV/07/6/4'>Judg. 6:4</a>",
      "comment": "This devastation disrupts the Philistines’ entire economy and food supply. The destruction recalls covenant curses when Israel’s enemies are judged (cf. Deut. 28:30–32)."
    },
    {
      "pk": 7015006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 6,
      "text": "Then the Philistines asked, 'Who has done this?' They were told, 'Samson, the son-in-law of the Timnite, because his father-in-law took Samson’s wife and gave her to his companion.' So the Philistines went up and burned her and her father with fire.",
      "links": "<a href='/AIV/07/14/15'>Judg. 14:15</a>; <a href='/AIV/07/14/20'>Judg. 14:20</a>",
      "comment": "The burning of the woman and her father tragically fulfills the threat made by the Philistines in Judg. 14:15. The consequences of sin and betrayal are highlighted, demonstrating the seriousness of covenant vows."
    },
    {
      "pk": 7015007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 7,
      "text": "Samson said to them, 'If this is what you do, I will not stop until I have taken vengeance on you.'",
      "links": "<a href='/AIV/Deut/32/35'>Deut. 32:35</a>",
      "comment": "Samson’s pursuit of vengeance is depicted as relentless but personal. The theme of righteous anger and vindication is consistent throughout Scripture, with God ultimately having the final say (Rom. 12:19)."
    },
    {
      "pk": 7015008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 8,
      "text": "And he struck them down ruthlessly, with a great slaughter. Then he went down and stayed in the cleft of the rock at Etam.",
      "links": "<a href='/AIV/07/6/2'>Judg. 6:2</a>",
      "comment": "Samson’s retreat emphasizes his isolation as a deliverer figure, suffering alone for his people. Many saints in history, including Christ, endured loneliness for the sake of salvation (cf. Matt. 26:36)."
    },
    {
      "pk": 7015009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 9,
      "text": "Then the Philistines came up, camped in Judah, and spread out in Lehi.",
      "links": "<a href='/AIV/07/13/1'>Judg. 13:1</a>",
      "comment": "The encampment in Judah signifies the Philistines’ oppression of Israel—reflecting a cycle of foreign domination due to Israel’s unfaithfulness. The need for a mediator or deliverer is clear."
    },
    {
      "pk": 7015010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 10,
      "text": "The men of Judah said, 'Why have you come up against us?' They answered, 'We have come to bind Samson, to do to him as he did to us.'",
      "links": "<a href='/AIV/07/14/4'>Judg. 14:4</a>",
      "comment": "Rather than defending Samson, Judah negotiates with the Philistines, showing the tragic state of Israel’s faith and unity. Samson is a foreshadowing of the suffering righteous, rejected by his own (cf. John 1:11)."
    },
    {
      "pk": 7015011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 11,
      "text": "Then three thousand men of Judah went down to the cleft of the rock at Etam and said to Samson, 'Do you not know that the Philistines rule over us? What then is this that you have done to us?' He replied, 'As they did to me, so I have done to them.'",
      "links": "<a href='/AIV/Ex/21/23-25'>Ex. 21:23-25</a>",
      "comment": "The Israelites’ fear and submission to foreign rule highlights a lack of faith and leadership. Samson’s words echo the Old Testament law of retribution (lex talionis)."
    },
    {
      "pk": 7015012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 12,
      "text": "They said to him, 'We have come down to bind you, so that we may deliver you into the hands of the Philistines.' Samson said to them, 'Swear to me that you will not attack me yourselves.'",
      "links": "",
      "comment": "Samson’s acceptance of being handed over demonstrates humility and submission to God’s will, not unlike Christ’s surrender in the Garden (cf. Luke 22:42)."
    },
    {
      "pk": 7015013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 13,
      "text": "They answered him, 'No, we will only bind you and give you into their hands. We will not kill you.' So they bound him with two new ropes and brought him up from the rock.",
      "links": "",
      "comment": "The use of new ropes may symbolize a ceremonial or serious vow. Throughout the Bible, being bound or delivered to enemies often prepares the way for God’s power to be revealed (cf. Acts 12:6–7)."
    },
    {
      "pk": 7015014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 14,
      "text": "When he came to Lehi, the Philistines shouted as they met him. Then the Spirit of the LORD came powerfully upon him, and the ropes on his arms became like flax that had caught fire, and his bonds melted from his hands.",
      "links": "<a href='/AIV/07/14/6'>Judg. 14:6</a>; <a href='/AIV/Acts/16/26'>Acts 16:26</a>",
      "comment": "The empowerment by the Spirit of the LORD is a recurring theme in Judges, showing that true liberation is by divine intervention. Physical bonds breaking serve as a sign of spiritual deliverance (cf. Isa. 61:1)."
    },
    {
      "pk": 7015015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 15,
      "text": "He found a fresh jawbone of a donkey, reached out his hand, took it, and with it struck down a thousand men.",
      "links": "<a href='/AIV/Lev/26/8'>Lev. 26:8</a>",
      "comment": "Samson using an unlikely weapon points to God’s power to use humble instruments for mighty deeds. Such prefigures God’s use of humble means (cf. 1 Cor. 1:27), fulfilled in Christ’s own humility and sacrifice."
    },
    {
      "pk": 7015016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 16,
      "text": "Then Samson said, 'With a jawbone of a donkey, heaps upon heaps, with the jawbone of a donkey I have struck down a thousand men.'",
      "links": "",
      "comment": "Samson’s chant is both a victory song and a riddle, echoing the poetic style of biblical deliverers (see Ex. 15:1). Literal victories often carry deeper spiritual meanings."
    },
    {
      "pk": 7015017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 17,
      "text": "When he finished speaking, he threw away the jawbone, and that place was called Ramath-lehi.",
      "links": "",
      "comment": "Ramath-lehi means 'Jawbone Hill.' Naming sites after acts of deliverance reflects biblical tradition, marking places where God intervened for his people."
    },
    {
      "pk": 7015018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 18,
      "text": "He was very thirsty and called upon the LORD and said, 'You have given this great deliverance by your servant, and now shall I die of thirst and fall into the hands of the uncircumcised?'",
      "links": "<a href='/AIV/Ps/22/15'>Ps. 22:15</a>",
      "comment": "Samson prays, acknowledging the LORD as the source of victory. His thirst invokes the suffering of the righteous, foreshadowed in Christ’s passion (cf. John 19:28). Restoration often follows trial."
    },
    {
      "pk": 7015019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 19,
      "text": "So God split the hollow place at Lehi, and water came out; when he drank, his spirit returned, and he revived. Therefore it was called En-hakkore, which is at Lehi to this day.",
      "links": "<a href='/AIV/Ex/17/6'>Ex. 17:6</a>; <a href='/AIV/Num/20/11'>Num. 20:11</a>",
      "comment": "God’s miraculous provision of water recalls similar events during the Exodus. Physical thirst satisfied by miraculous water points to spiritual revival, anticipating the living water offered in Christ (John 4:10, 14)."
    },
    {
      "pk": 7015020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 15,
      "verse": 20,
      "text": "And he judged Israel in the days of the Philistines for twenty years.",
      "links": "<a href='/AIV/07/16/31'>Judg. 16:31</a>",
      "comment": "Samson’s twenty years of judging signifies a provisional period of leadership and partial deliverance, foreshadowing the permanent reign of the promised Deliverer. The cycle of judges points to the ongoing need for ordered leadership and established authority in God’s plan."
    }
  ],
  "translatedAt": "2025-12-24T02:39:23.438Z"
}