{
  "book": 7,
  "bookName": "Judges",
  "bookAbbreviation": "Judg",
  "chapter": 13,
  "verses": [
    {
      "pk": 7013001,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 1,
      "text": "Again, the children of Israel did what was evil in the sight of the LORD, and the LORD delivered them into the hand of the Philistines for forty years.",
      "links": "<a href='/AIV/7/2/11'>Judg. 2:11</a>; <a href='/AIV/7/10/7'>Judg. 10:7</a>; <a href='/AIV/1/6/14'>Gen. 6:14</a>",
      "comment": "The repeated cycle of Israel's unfaithfulness and God's discipline is a central pattern in Judges. Forty years of oppression recall other periods of testing (e.g., Israel's wilderness wandering—Num. 14:33)."
    },
    {
      "pk": 7013002,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 2,
      "text": "There was a certain man of Zorah, of the tribe of the Danites, whose name was Manoah. His wife was barren and had borne no children.",
      "links": "<a href='/AIV/1/11/30'>Gen. 11:30</a>; <a href='/AIV/9/1/11'>1 Sam. 1:2</a>",
      "comment": "Barren women miraculously bearing children is a theme throughout Scripture (Sarah, Rachel, Hannah), emphasizing God’s intervention and the special calling of the child."
    },
    {
      "pk": 7013003,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 3,
      "text": "The angel of the LORD appeared to the woman and said to her, 'Behold, you are barren and have borne no children, but you shall conceive and bear a son.'",
      "links": "<a href='/AIV/1/18/10'>Gen. 18:10</a>; <a href='/AIV/9/1/11'>1 Sam. 1:11</a>; <a href='/AIV/42/1/13'>Luke 1:13</a>",
      "comment": "The angel of the LORD often acts as a physical manifestation of God, a foreshadowing of the Incarnation in the New Testament. The announcement parallels the birth of Isaac, Samuel, and even John the Baptist and Jesus (see Luke 1:13, 31)."
    },
    {
      "pk": 7013004,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 4,
      "text": "Now, therefore, be careful, and drink no wine or strong drink, and do not eat anything unclean.",
      "links": "<a href='/AIV/4/6/3'>Num. 6:3</a>; <a href='/AIV/3/11/1-47'>Lev. 11:1-47</a>",
      "comment": "These restrictions relate to the Nazirite vow (Num. 6:1-21), signifying dedication and holiness. Notice the importance of ritual purity for the one preparing to bear a consecrated servant."
    },
    {
      "pk": 7013005,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 5,
      "text": "For behold, you shall conceive and bear a son. No razor shall come upon his head, for the boy shall be a Nazirite to God from the womb. He will begin to save Israel from the hand of the Philistines.",
      "links": "<a href='/AIV/4/6/5'>Num. 6:5</a>; <a href='/AIV/1/49/16'>Gen. 49:16</a>; <a href='/AIV/9/1/11'>1 Sam. 1:11</a>",
      "comment": "Samson’s lifelong Nazirite consecration is unique. He will only begin, not complete, Israel’s deliverance, pointing to the need for a final, perfect deliverer—fulfilled in Christ (see Matt. 1:21)."
    },
    {
      "pk": 7013006,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 6,
      "text": "Then the woman came and told her husband, saying, 'A man of God came to me, and his appearance was like the appearance of the angel of God, very awesome. I did not ask him where he was from, and he did not tell me his name.'",
      "links": "<a href='/AIV/1/32/29'>Gen. 32:29</a>; <a href='/AIV/2/6/22'>Exod. 6:22</a>",
      "comment": "'Angel of God' can mean messenger or a theophany—a direct visitation from God. The awe inspired by this visitor emphasizes the holiness surrounding God's plan."
    },
    {
      "pk": 7013007,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 7,
      "text": "But he said to me, ‘Behold, you shall conceive and bear a son. So drink no wine or strong drink, and eat nothing unclean, for the boy shall be a Nazirite to God from the womb until the day of his death.’",
      "links": "<a href='/AIV/4/6/2'>Num. 6:2-5</a>; <a href='/AIV/9/1/11'>1 Sam. 1:11</a>",
      "comment": "A double emphasis on dedicating Samson to God through the Nazirite vow highlights God's hand in his life even before birth—a pointing toward the sanctity of life in the womb."
    },
    {
      "pk": 7013008,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 8,
      "text": "Then Manoah prayed to the LORD and said, 'O Lord, please let the man of God whom you sent come again to us, and teach us what we are to do for the boy who will be born.'",
      "links": "<a href='/AIV/1/25/21'>Gen. 25:21</a>; <a href='/AIV/42/1/34'>Luke 1:34</a>",
      "comment": "Manoah’s prayer for guidance reveals humility and a desire to follow God’s will in raising the promised child, showing the importance of seeking God’s direction in family vocations."
    },
    {
      "pk": 7013009,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 9,
      "text": "And God listened to the voice of Manoah, and the angel of God came again to the woman while she was sitting in the field; but her husband Manoah was not with her.",
      "links": "<a href='/AIV/19/34/15'>Ps. 34:15</a>; <a href='/AIV/42/1/11'>Luke 1:11</a>",
      "comment": "God responds graciously to Manoah’s prayer. The visitation to the woman first highlights the dignity and key role played by women in salvation history (cf. Mary in Luke 1)."
    },
    {
      "pk": 7013010,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 10,
      "text": "So the woman ran quickly and told her husband, 'Behold, the man who came to me the other day has appeared to me.'",
      "links": "<a href='/AIV/9/3/5-10'>1 Sam. 3:5-10</a>",
      "comment": "Her eagerness shows her faith and the importance of marital unity in hearing and responding to God’s revelations."
    },
    {
      "pk": 7013011,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 11,
      "text": "So Manoah got up and followed his wife. He came to the man and said to him, 'Are you the man who spoke to this woman?' And he said, 'I am.'",
      "links": "<a href='/AIV/2/3/14'>Exod. 3:14</a>; <a href='/AIV/43/8/58'>John 8:58</a>",
      "comment": "The reply 'I am' echoes God's self-identification (Exod. 3:14); in Christ, such statements take on particular significance pointing to divinity (John 8:58)."
    },
    {
      "pk": 7013012,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 12,
      "text": "And Manoah said, 'Now when your words come true, what shall be the boy's rule of life and his work?'",
      "links": "<a href='/AIV/9/1/23'>1 Sam. 1:23</a>",
      "comment": "Manoah assumes the prophecy will be fulfilled and asks for instructions on raising the child, showing trust and the importance of instruction in righteousness."
    },
    {
      "pk": 7013013,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 13,
      "text": "And the angel of the LORD said to Manoah, 'Of all that I said to the woman, let her be careful.'",
      "links": "<a href='/AIV/7/13/4'>Judg. 13:4</a>; <a href='/AIV/7/13/7'>Judg. 13:7</a>",
      "comment": "The angel reaffirms the special instructions, emphasizing obedience to God's commands, especially in matters of sacred calling."
    },
    {
      "pk": 7013014,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 14,
      "text": "She may not eat anything that comes from the vine, nor drink wine or strong drink, nor eat anything unclean. All that I commanded her, let her observe.'",
      "links": "<a href='/AIV/4/6/3-4'>Num. 6:3-4</a>",
      "comment": "God’s requirements reemphasize the importance of holiness and preparation for sacred service from before birth. Obeying even small commands is key for those set apart for God's purpose."
    },
    {
      "pk": 7013015,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 15,
      "text": "Manoah said to the angel of the LORD, 'Please let us detain you, and we will prepare a young goat for you.'",
      "links": "<a href='/AIV/1/18/3'>Gen. 18:3</a>; <a href='/AIV/7/6/18'>Judg. 6:18-19</a>",
      "comment": "Offering hospitality to divine visitors is a recurring scriptural theme (e.g., Abraham in Gen. 18). In welcoming God’s messenger, one unwittingly welcomes God Himself."
    },
    {
      "pk": 7013016,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 16,
      "text": "And the angel of the LORD said to Manoah, 'If you detain me, I will not eat your food, but if you prepare a burnt offering, then offer it to the LORD.' (For Manoah did not know that he was the angel of the LORD.)",
      "links": "<a href='/AIV/7/6/20-21'>Judg. 6:20-21</a>; <a href='/AIV/1/18/8'>Gen. 18:8</a>",
      "comment": "The true recipient of all Old Testament sacrifices is God. The refusal to eat human food places the heavenly visitor above normal human needs and alludes to divine worship reserved for God alone."
    },
    {
      "pk": 7013017,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 17,
      "text": "Manoah said to the angel of the LORD, 'What is your name, so that when your words come true, we may honor you?'",
      "links": "<a href='/AIV/1/32/29'>Gen. 32:29</a>",
      "comment": "Asking a name in the ancient world implied knowing the person’s nature; God’s messengers often withhold their names, keeping the focus on God’s glory rather than their own."
    },
    {
      "pk": 7013018,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 18,
      "text": "But the angel of the LORD said to him, 'Why do you ask my name, seeing it is wonderful?'",
      "links": "<a href='/AIV/23/9/6'>Isa. 9:6</a>; <a href='/AIV/1/32/29'>Gen. 32:29</a>",
      "comment": "'Wonderful' (Hebrew, 'Pelei') is associated with the divine (see Isaiah 9:6 – 'Wonderful Counselor'). God’s identity is beyond human comprehension—another allusion to the hiddenness and greatness of God."
    },
    {
      "pk": 7013019,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 19,
      "text": "So Manoah took the young goat with the grain offering and offered it upon the rock to the LORD, and He did a wondrous thing while Manoah and his wife looked on.",
      "links": "<a href='/AIV/7/6/21'>Judg. 6:21</a>; <a href='/AIV/2/3/2'>Exod. 3:2</a>",
      "comment": "A miraculous event marks the offering as divinely accepted. Sacrifices and offerings throughout the Old Testament point forward to the one perfect sacrifice in Christ (see Heb. 10:10)."
    },
    {
      "pk": 7013020,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 20,
      "text": "As the flame went up toward heaven from the altar, the angel of the LORD ascended in the flame of the altar. When Manoah and his wife saw this, they fell on their faces to the ground.",
      "links": "<a href='/AIV/7/6/21'>Judg. 6:21</a>; <a href='/AIV/1/17/3'>Gen. 17:3</a>",
      "comment": "The angel's departure in the fire underscores his divine nature, and the couple’s response of prostration is appropriate worship and awe before God."
    },
    {
      "pk": 7013021,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 21,
      "text": "The angel of the LORD appeared no more to Manoah and his wife. Then Manoah knew that he was the angel of the LORD.",
      "links": "<a href='/AIV/2/33/20'>Exod. 33:20</a>; <a href='/AIV/1/32/30'>Gen. 32:30</a>",
      "comment": "Recognition comes after the disappearance—often the pattern with divine manifestations. Direct encounters with God’s glory leave an indelible impression."
    },
    {
      "pk": 7013022,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 22,
      "text": "Manoah said to his wife, 'We shall surely die, for we have seen God.'",
      "links": "<a href='/AIV/2/33/20'>Exod. 33:20</a>; <a href='/AIV/1/32/30'>Gen. 32:30</a>",
      "comment": "It was a common belief that seeing God meant death (see Exod. 33:20). Yet God’s mercy preserves those chosen for His purposes—a theme fulfilled in the new covenant (cf. John 1:18)."
    },
    {
      "pk": 7013023,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 23,
      "text": "But his wife said to him, 'If the LORD had meant to kill us, He would not have accepted a burnt offering and a grain offering at our hands, or shown us all these things, or now announced such things as these to us.'",
      "links": "<a href='/AIV/1/4/4'>Gen. 4:4</a>",
      "comment": "Manoah’s wife uses sound reasoning: God’s blessings and revelations are signs of favor, not wrath. God's acceptance of sacrifice prefigures the sacramental assurance of grace through visible signs."
    },
    {
      "pk": 7013024,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 24,
      "text": "The woman bore a son and called his name Samson. The boy grew, and the LORD blessed him.",
      "links": "<a href='/AIV/1/21/20'>Gen. 21:20</a>; <a href='/AIV/9/2/26'>1 Sam. 2:26</a>; <a href='/AIV/42/2/52'>Luke 2:52</a>",
      "comment": "Samson’s blessing and growth echo those of other chosen servants—Samuel (1 Sam. 2:26), and especially Jesus (Luke 2:52) who would be the ultimate Savior and Deliverer."
    },
    {
      "pk": 7013025,
      "translation": "AIV",
      "book": 7,
      "bookName": "Judges",
      "bookAbbreviation": "Judg",
      "chapter": 13,
      "verse": 25,
      "text": "And the Spirit of the LORD began to move him at Mahaneh-dan, between Zorah and Eshtaol.",
      "links": "<a href='/AIV/7/14/6'>Judg. 14:6</a>; <a href='/AIV/9/10/6'>1 Sam. 10:6</a>",
      "comment": "The Spirit’s action initiates Samson’s mission, showing that true leadership and strength for God’s people comes by the Spirit. The Spirit’s descent prefigures the empowering of leaders and, ultimately, the coming of the Spirit at Pentecost (Acts 2)."
    }
  ],
  "translatedAt": "2025-12-24T02:38:28.059Z"
}