{
  "book": 35,
  "bookName": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 8,
  "verses": [
    {
      "pk": 35008001,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 1,
      "text": "Set the trumpet to your lips! Like an eagle, destruction comes upon the house of the LORD, because they have broken my covenant and rebelled against my law.",
      "links": "<a href='/AIV/28/5/8'>Amos 5:8</a>; <a href='/AIV/28/9/1'>Amos 9:1</a>; <a href='/AIV/28/21/1'>Jer. 21:1</a>",
      "comment": "The trumpet signifies a call to war or warning, and the eagle represents swift judgment (see Deut. 28:49). Israel’s violation of God’s covenant is central to this theme, alluding to the seriousness of covenant fidelity. The reference to the 'house of the LORD' may also carry spiritual implications for the unity of God’s people throughout salvation history."
    },
    {
      "pk": 35008002,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 2,
      "text": "Israel cries out to me, ‘My God, we know you!’",
      "links": "<a href='/AIV/24/2/8'>Jer. 2:8</a>; <a href='/AIV/28/7/14'>Amos 7:14</a>",
      "comment": "Despite Israel’s claim to know God, their actions contradict true knowledge and relationship. This verse points to a distinction between verbal profession and heartfelt faith—echoing Jesus’ warning in Matthew 7:21 about those who say ‘Lord, Lord’ but do not do the Father’s will."
    },
    {
      "pk": 35008003,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 3,
      "text": "Israel has rejected what is good; an enemy will pursue him.",
      "links": "<a href='/AIV/28/5/14'>Amos 5:14</a>; <a href='/AIV/24/2/19'>Jer. 2:19</a>",
      "comment": "The rejection of what is good is a rejection of God’s moral order and law. The consequence of this rejection is divine discipline, paralleling Paul’s warning in Romans 1:28-32 about the results of rejecting God."
    },
    {
      "pk": 35008004,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 4,
      "text": "They set up kings, but not by me; they made princes, of whom I did not approve. With their silver and gold they made idols for themselves, that they might be cut off.",
      "links": "<a href='/AIV/11/12/20'>1 Kings 12:20</a>; <a href='/AIV/19/115/4'>Ps. 115:4</a>",
      "comment": "Israel’s self-appointed leaders and their idolatry demonstrate a lack of submission to God’s will and authority, prefiguring Christ’s establishment of rightful leadership for God’s people (see John 10:16). The spiritual sense anticipates that hearts must be properly disposed before God."
    },
    {
      "pk": 35008005,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 5,
      "text": "Your calf, O Samaria, has cast you off. My anger burns against them. How long will they be incapable of innocence?",
      "links": "<a href='/AIV/02/32/4'>Ex. 32:4</a>; <a href='/AIV/11/12/28'>1 Kings 12:28</a>",
      "comment": "The reference to the calf directly recalls the golden calf in Exodus, symbolizing persistent idolatry. This idolatry is contrasted with the call to holiness that God’s people are meant to embody, anticipating the importance of true worship and sacred images rightly ordered in Christian worship."
    },
    {
      "pk": 35008006,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 6,
      "text": "For from Israel a craftsman made it; it is not God. The calf of Samaria shall be broken to pieces.",
      "links": "<a href='/AIV/19/135/15'>Ps. 135:15</a>; <a href='/AIV/23/40/18-19'>Isa. 40:18-19</a>",
      "comment": "The prophet criticizes idols as mere human creations, unworthy of worship. The future breaking of the calf symbolizes the defeat of false religions and calls towards the establishment of proper worship as given by God, echoing spiritual realities fulfilled in the new covenant."
    },
    {
      "pk": 35008007,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 7,
      "text": "For they sow the wind, and they shall reap the whirlwind. The stalk has no bud; it shall yield no meal. If it were to yield, foreigners would swallow it up.",
      "links": "<a href='/AIV/24/12/13'>Jer. 12:13</a>; <a href='/AIV/48/6/7'>Gal. 6:7</a>",
      "comment": "This proverb reflects the principle of sowing and reaping, reinforcing that sinful actions lead to destruction—a theme repeated by Paul in Galatians 6:7. The agricultural imagery points to deeper spiritual fruitfulness, found only through communion with God."
    },
    {
      "pk": 35008008,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 8,
      "text": "Israel is swallowed up; now they are among the nations like a vessel no one delights in.",
      "links": "<a href='/AIV/24/25/27'>Jer. 25:27</a>; <a href='/AIV/19/31/12'>Ps. 31:12</a>",
      "comment": "The loss of Israel’s favor foreshadows God’s broader plan to bless all nations through Israel’s ultimate fulfillment in the Messiah (see Isa. 42:6). Spiritually, God works through seeming defeat to bring about a greater restoration."
    },
    {
      "pk": 35008009,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 9,
      "text": "For they have gone up to Assyria, a wild donkey wandering alone; Ephraim has hired lovers.",
      "links": "<a href='/AIV/28/5/13'>Amos 5:13</a>; <a href='/AIV/24/3/2'>Jer. 3:2</a>",
      "comment": "The wild donkey signifies stubborn independence and spiritual betrayal. Seeking help from foreign nations instead of God demonstrates the consequence of relying on worldly powers, subtly pointing to the necessity of remaining loyal within the true family of faith."
    },
    {
      "pk": 35008010,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 10,
      "text": "Though they have hired allies among the nations, I will now gather them. They will begin to diminish under the burden of the king of princes.",
      "links": "<a href='/AIV/26/16/28'>Ezek. 16:28</a>; <a href='/AIV/24/46/16'>Jer. 46:16</a>",
      "comment": "God promises a gathering, even amid judgment, hinting at eventual restoration. Historically, this looks forward to God’s plan to restore His people, culminating in the unity of believers under Christ, who is the King of kings (Rev. 19:16)."
    },
    {
      "pk": 35008011,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 11,
      "text": "Because Ephraim has made many altars for sin, they have become altars for sinning.",
      "links": "<a href='/AIV/03/17/7'>Lev. 17:7</a>; <a href='/AIV/28/10/1'>Hos. 10:1</a>",
      "comment": "Ephraim’s proliferation of unauthorized altars displays the danger of religious innovation apart from God’s rule, emphasizing the importance of worship fully in accordance with God’s instructions—anticipating the ordered worship and sacramental life found in the apostolic tradition."
    },
    {
      "pk": 35008012,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 12,
      "text": "Though I write for them my many laws, they are regarded as something strange.",
      "links": "<a href='/AIV/19/119/18'>Ps. 119:18</a>; <a href='/AIV/23/5/24'>Isa. 5:24</a>",
      "comment": "God’s law is viewed as foreign due to hardened hearts. True obedience flows from reverence for God’s revealed word, foreshadowing the new covenant in which law is written upon the heart (see Heb. 8:10; Jer. 31:33)."
    },
    {
      "pk": 35008013,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 13,
      "text": "They offer sacrifices to me and eat the meat, but the LORD does not accept them. He will remember their wickedness and punish their sins; they shall return to Egypt.",
      "links": "<a href='/AIV/23/1/11'>Isa. 1:11</a>; <a href='/AIV/24/14/10'>Jer. 14:10</a>",
      "comment": "Sacrifice without true faith and obedience is rejected by God. The spiritual meaning involves a faithful heart participating in worship, not mere ritual. The return to Egypt symbolizes a return to bondage—a recurring type fulfilled by liberation through Christ."
    },
    {
      "pk": 35008014,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 8,
      "verse": 14,
      "text": "Israel has forgotten his Maker and built palaces; Judah has multiplied fortified cities. So I will send fire upon his cities, and it shall devour her strongholds.",
      "links": "<a href='/AIV/05/32/18'>Deut. 32:18</a>; <a href='/AIV/23/64/11'>Isa. 64:11</a>",
      "comment": "Forgetting the Creator leads to misplaced security in worldly power. God’s judgment here recalls both literal and symbolic destruction. In the spiritual sense, the passage exhorts believers to center their lives on God and trust not in earthly strength, highlighting the enduring call for true discipleship and union with the one apostolic community."
    }
  ],
  "translatedAt": "2025-12-24T09:37:38.885Z"
}