{
  "book": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 14,
  "verses": [
    {
      "pk": 24001401,
      "translation": "AIV",
      "book": 28,
      "chapter": 14,
      "verse": 1,
      "text": "Return, O Israel, to the LORD your God, for you have stumbled because of your iniquity.",
      "links": "<a href='/AIV/23/55/7'>Isa. 55:7</a>; <a href='/AIV/24/3/12-14'>Jer. 3:12-14</a>",
      "comment": "The call to return to the LORD echoes the prophetic tradition, urging the people to repentance. The imagery of 'stumbling' because of sin emphasizes the personal responsibility of Israel in their turning away. The LORD is presented as both judge and merciful redeemer, preparing the way for later New Testament themes of confession and restoration (<a href='/AIV/42/15/18'>Luke 15:18</a>)."
    },
    {
      "pk": 24001402,
      "translation": "AIV",
      "book": 28,
      "chapter": 14,
      "verse": 2,
      "text": "Take words with you and return to the LORD; say to Him, 'Take away all iniquity; accept what is good, and we will offer the fruit of our lips as sacrifices.'",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/58/13/15'>Heb. 13:15</a>",
      "comment": "The invitation to bring 'words' highlights the importance of confession (cf. <a href='/AIV/19/32/5'>Ps. 32:5</a>). The 'fruit of our lips' points toward spiritual sacrifices, later echoed in Christian liturgical practice. The notion that prayer, confession, and praise are acceptable offerings to God anticipates New Testament worship."
    },
    {
      "pk": 24001403,
      "translation": "AIV",
      "book": 28,
      "chapter": 14,
      "verse": 3,
      "text": "Assyria will not save us; we will not ride on horses, and we will say no more, 'Our God,' to the work of our hands. For in you the orphan finds mercy.",
      "links": "<a href='/AIV/19/33/17'>Ps. 33:17</a>; <a href='/AIV/23/31/1'>Isa. 31:1</a>",
      "comment": "Rejecting reliance on foreign powers or idols signals a turn toward total trust in God. The mention of mercy to the orphan echoes God's special concern for the vulnerable (<a href='/AIV/19/68/5'>Ps. 68:5</a>). The passage reflects both a literal and spiritual call to trust in God's provision."
    },
    {
      "pk": 24001404,
      "translation": "AIV",
      "book": 28,
      "chapter": 14,
      "verse": 4,
      "text": "I will heal their waywardness; I will love them freely, for My anger has turned away from them.",
      "links": "<a href='/AIV/19/103/3'>Ps. 103:3</a>; <a href='/AIV/23/57/18'>Isa. 57:18</a>",
      "comment": "The LORD Himself promises healing and unmerited love, underscoring divine initiative in reconciliation. God's love is portrayed as unearned, which finds fulfillment in Christ (cf. <a href='/AIV/45/5/8'>Rom. 5:8</a>). The phrase 'My anger has turned away' alludes to appeasement, anticipated in the atoning sacrifice of Jesus."
    },
    {
      "pk": 24001405,
      "translation": "AIV",
      "book": 28,
      "chapter": 14,
      "verse": 5,
      "text": "I will be like the dew to Israel; he will blossom like the lily; he will take root like the cedars of Lebanon.",
      "links": "<a href='/AIV/19/92/12'>Ps. 92:12</a>; <a href='/AIV/23/35/1-2'>Isa. 35:1-2</a>",
      "comment": "Dew signifies life, blessing, and God's gracious presence. The lily and cedar offer images of both beauty and strength, foreshadowing the restoration of God's people. Theological traditions see the dew as symbolic of the outpouring of grace, and the blossoming as the flourishing of the faithful in God's kingdom."
    },
    {
      "pk": 24001406,
      "translation": "AIV",
      "book": 28,
      "chapter": 14,
      "verse": 6,
      "text": "His shoots will spread out; his beauty shall be like the olive tree, and his fragrance like the cedars of Lebanon.",
      "links": "<a href='/AIV/19/52/8'>Ps. 52:8</a>; <a href='/AIV/24/11/16'>Jer. 11:16</a>",
      "comment": "The olive tree and cedar were symbols of endurance, prosperity, and divine favor. These images spiritually point to Israel's mission to bear fruit in the world. Later Christian tradition often connects these images to the flourishing of the Church and the spread of the Gospel (<a href='/AIV/40/13/31-32'>Matt. 13:31-32</a>)."
    },
    {
      "pk": 24001407,
      "translation": "AIV",
      "book": 28,
      "chapter": 14,
      "verse": 7,
      "text": "Those who dwell under his shade will return; they will revive like the grain and blossom like the vine; his fame will be like the wine of Lebanon.",
      "links": "<a href='/AIV/19/80/8-9'>Ps. 80:8-9</a>; <a href='/AIV/43/15/1-5'>John 15:1-5</a>",
      "comment": "'Dwelling under his shade' evokes the idea of finding refuge in God's community. The grain and vine are images rich in sacramental meaning, recalling the bread and wine later instituted by Jesus as signs of the new covenant (<a href='/AIV/40/26/26-29'>Matt. 26:26-29</a>)."
    },
    {
      "pk": 24001408,
      "translation": "AIV",
      "book": 28,
      "chapter": 14,
      "verse": 8,
      "text": "Ephraim will say, 'What more have I to do with idols?' It is I who answer and look after him. I am like a flourishing cypress; your fruit is found in Me.",
      "links": "<a href='/AIV/23/44/21-22'>Isa. 44:21-22</a>; <a href='/AIV/43/15/4'>John 15:4</a>",
      "comment": "God here is portrayed as the source of all spiritual fruitfulness and faithfulness. 'Your fruit is found in Me' anticipates Jesus' teaching about abiding in the true vine (<a href='/AIV/43/15/5'>John 15:5</a>), showing that only through God can true spiritual life be borne. The rejection of idols is total and lasting."
    },
    {
      "pk": 24001409,
      "translation": "AIV",
      "book": 28,
      "chapter": 14,
      "verse": 9,
      "text": "Who is wise? Let him understand these things; who is discerning? Let him know them. For the ways of the LORD are upright, and the righteous walk in them, but transgressors stumble in them.",
      "links": "<a href='/AIV/20/2/6-8'>Prov. 2:6-8</a>; <a href='/AIV/19/1/6'>Ps. 1:6</a>",
      "comment": "This verse concludes as a wisdom saying, urging careful meditation on God's ways. The choice between walking and stumbling echoes the theme found throughout Scripture: true wisdom consists of obedience and faithfulness. The verse encourages both a literal following of the law and a deeper spiritual walk, in harmony with the fullness of divine revelation."
    }
  ],
  "translatedAt": "2025-12-23T07:23:49.731Z"
}