{
  "book": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 8,
  "verses": [
    {
      "pk": 470801,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 1,
      "text": "Set the trumpet to your mouth! Like an eagle, destruction comes against the house of the LORD, because they have transgressed my covenant and rebelled against my law.",
      "links": "<a href='/AIV/5/28/49'>Deut. 28:49</a>; <a href='/AIV/24/4/5'>Jer. 4:5</a>",
      "comment": "The trumpet signals imminent judgment for breaking covenant—compare Deuteronomy’s warnings. Prophetic imagery portrays swift retribution, foreshadowing God’s discipline for covenant unfaithfulness and spiritual rebellion."
    },
    {
      "pk": 470802,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 2,
      "text": "Israel cries to me, 'My God, we know you!'",
      "links": "<a href='/AIV/40/7/21-23'>Matt. 7:21–23</a>; <a href='/AIV/23/29/13'>Isa. 29:13</a>",
      "comment": "Claiming to know God is not sufficient; mere outward profession without interior conversion leads to self-deception—see Christ’s teaching on empty confession. Highlights necessity of true faith and living relationship, not only outward ritual."
    },
    {
      "pk": 470803,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 3,
      "text": "Israel has rejected what is good; the enemy will pursue him.",
      "links": "<a href='/AIV/19/81/12'>Ps. 81:12</a>; <a href='/AIV/24/2/13'>Jer. 2:13</a>",
      "comment": "Rejecting goodness and God's law brings consequences—the loss of divine protection, permitting judgment to fall. There’s an implicit invitation for repentance and return to covenant faithfulness. Divine justice and mercy remain intertwined."
    },
    {
      "pk": 470804,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 4,
      "text": "They made kings, but not by my authority; they appointed princes, but I did not acknowledge them. With their silver and gold they made idols, so they will be cut off.",
      "links": "<a href='/AIV/11/12/31'>1 Kgs. 12:31</a>; <a href='/AIV/02/20/23'>Ex. 20:23</a>",
      "comment": "Human authority outside of God’s will results in spiritual disorder; sinful use of wealth leads to idolatry and separation. Highlights necessity of God-ordained leadership and proper worship, prefiguring the emphasis on apostolic succession and obedience to divinely appointed leaders."
    },
    {
      "pk": 470805,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 5,
      "text": "Your calf, O Samaria, has rejected you. My anger burns against them. How long will they be incapable of innocence?",
      "links": "<a href='/AIV/11/12/28'>1 Kgs. 12:28</a>; <a href='/AIV/19/106/19-20'>Ps. 106:19-20</a>",
      "comment": "The ‘calf’ references the infamous golden calves of the divided kingdom—idolatry as stubborn disobedience. The question points to persistent lack of repentance. These sins disconnect the people from divine favor."
    },
    {
      "pk": 470806,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 6,
      "text": "For this thing was made by Israel; it is not God. The calf of Samaria shall be shattered.",
      "links": "<a href='/AIV/19/115/4-8'>Ps. 115:4–8</a>",
      "comment": "Man-made objects cannot save—only the true God can. This verse affirms spiritual reality beyond external forms; and underscores the futility of false worship. Anticipates New Testament fulfillment where true worship is ‘in spirit and truth’ (John 4:23–24)."
    },
    {
      "pk": 470807,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 7,
      "text": "For they sow the wind, and they will reap the whirlwind. The stalk has no bud; it will produce no meal. Even if it should yield, strangers will consume it.",
      "links": "<a href='/AIV/48/6/7'>Gal. 6:7</a>; <a href='/AIV/18/4/8'>Job 4:8</a>",
      "comment": "The principle of sowing and reaping, echoed in Christ’s parables and Paul’s letters—sinful acts produce devastating consequences. The image also warns of spiritual emptiness when separated from God's grace."
    },
    {
      "pk": 470808,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 8,
      "text": "Israel is swallowed up; now they are among the nations like a worthless vessel.",
      "links": "<a href='/AIV/23/30/14'>Isa. 30:14</a>; <a href='/AIV/24/22/28'>Jer. 22:28</a>",
      "comment": "The imagery of a discarded vessel points to brokenness from apostasy, loss of chosen status, and scattering among nations—suggesting need for restoration through God’s redemptive plan for unity and wholeness."
    },
    {
      "pk": 470809,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 9,
      "text": "For they have gone up to Assyria, like a wild donkey wandering alone; Ephraim has hired lovers.",
      "links": "<a href='/AIV/24/2/24-25'>Jer. 2:24–25</a>",
      "comment": "Seeking security through alliances rather than faithfulness to God is likened to spiritual adultery. The donkey imagery highlights stubbornness and isolation caused by sin, reinforcing the danger of trusting in man over divine providence."
    },
    {
      "pk": 470810,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 10,
      "text": "Even though they hire allies among the nations, I will now gather them together, and they will begin to diminish under the burden of the king and princes.",
      "links": "<a href='/AIV/24/30/11'>Jer. 30:11</a>",
      "comment": "Dependence on foreign powers brings suffering; only God’s gathering can restore. This previews the theme of a scattered people reunited by divine initiative—an early pointer toward both literal and spiritual restoration."
    },
    {
      "pk": 470811,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 11,
      "text": "Because Ephraim has multiplied altars for sin, they have become altars for sinning.",
      "links": "<a href='/AIV/05/12/13'>Deut. 12:13</a>",
      "comment": "Unauthorized altars emphasize disobedience to God’s prescribed worship—only the true altar, consecrated by divine authority, brings atonement. Spiritual interpretation gestures to the necessity of worship in accord with divine instruction and apostolic tradition."
    },
    {
      "pk": 470812,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 12,
      "text": "Though I write for them the many things of my law, they are regarded as something foreign.",
      "links": "<a href='/AIV/19/119/18'>Ps. 119:18</a>; <a href='/AIV/19/147/19-20'>Ps. 147:19–20</a>",
      "comment": "God’s law is disregarded despite its clarity. Spiritual blindness and hardness of heart obscure truth, pointing to the need for grace and teachings preserved by faithful transmission."
    },
    {
      "pk": 470813,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 13,
      "text": "They offer sacrifices, eating meat, but the LORD does not accept them. Now he will remember their iniquity and punish their sins; they will return to Egypt.",
      "links": "<a href='/AIV/19/50/9-13'>Ps. 50:9–13</a>; <a href='/AIV/02/16/3'>Ex. 16:3</a>",
      "comment": "External rituals without obedience do not please God. ‘Return to Egypt’ symbolizes a loss of freedom and a slide back into spiritual slavery—a theme where true worship is intimately tied to the right heart, not mere performance."
    },
    {
      "pk": 470814,
      "translation": "AIV",
      "book": 28,
      "chapter": 8,
      "verse": 14,
      "text": "Israel has forgotten his Maker and built palaces; Judah has multiplied fortified cities. So I will send fire upon their cities, and it will devour their strongholds.",
      "links": "<a href='/AIV/19/78/58-61'>Ps. 78:58–61</a>; <a href='/AIV/23/5/24'>Isa. 5:24</a>",
      "comment": "Forgetfulness of God and trust in human strength leads to destruction—emphasizing the futility of reliance on worldly security. Points back to the enduring need for God-centered worship, divine guidance, and lasting peace found in spiritual fidelity."
    }
  ],
  "translatedAt": "2025-12-23T07:21:56.163Z"
}