{
  "book": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 10,
  "verses": [
    {
      "pk": 3011001,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 1,
      "text": "Israel was a spreading vine; he produced fruit for himself. The more his fruit increased, the more altars he built; as his land prospered, he adorned his sacred pillars.",
      "links": "<a href='/AIV/19/80/8-9'>Ps. 80:8-9</a>; <a href='/AIV/28/8/11'>Hos. 8:11</a>",
      "comment": "Israel’s prosperity leads to idolatry, contrasting true worship with empty ritual. The vine imagery reflects how blessings can be twisted if not rightly ordered toward God (<a href='/AIV/19/80/8'>Ps. 80:8</a>). This foreshadows Jesus as the true vine who brings authentic fruit (<a href='/AIV/43/15/1'>John 15:1</a>)."
    },
    {
      "pk": 3011002,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 2,
      "text": "Their hearts are deceitful; now they must bear their guilt. The LORD will break down their altars and destroy their sacred pillars.",
      "links": "<a href='/AIV/28/6/7'>Hos. 6:7</a>; <a href='/AIV/05/12/3'>Deut. 12:3</a>",
      "comment": "Heart deceit brings judgment, pointing to the necessity of single-hearted devotion. Destruction of altars recalls the command to worship in the place chosen by God (<a href='/AIV/05/12/3'>Deut. 12:3</a>), hinting at a central authority for worship."
    },
    {
      "pk": 3011003,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 3,
      "text": "Surely now they will say, 'We have no king, for we do not fear the LORD; and even the king—what could he do for us?'",
      "links": "<a href='/AIV/09/8/7'>1 Sam. 8:7</a>; <a href='/AIV/28/3/4'>Hos. 3:4</a>",
      "comment": "Rejecting God as king results in political instability. This text subtly looks toward the need for both earthly and spiritual leadership, fulfilled ultimately in Christ the King (<a href='/AIV/43/18/37'>John 18:37</a>)."
    },
    {
      "pk": 3011004,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 4,
      "text": "They speak empty words, swearing falsely when making covenants; so judgment springs up like poisonous weeds in the furrows of a field.",
      "links": "<a href='/AIV/19/58/3-4'>Ps. 58:3–4</a>; <a href='/AIV/23/59/13-15'>Isa. 59:13-15</a>",
      "comment": "Faithlessness in speech and covenants corrupts society. The theme of true and binding oaths echoes the seriousness of sacraments and vows, which require integrity (<a href='/AIV/40/5/33-37'>Matt. 5:33-37</a>)."
    },
    {
      "pk": 3011005,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 5,
      "text": "The inhabitants of Samaria tremble for the calf of Beth-aven; the people mourn over it, and so do its priests—those who rejoiced over its glory—because it has departed from them.",
      "links": "<a href='/AIV/11/12/28-30'>1 Kgs. 12:28-30</a>; <a href='/AIV/28/8/5'>Hos. 8:5</a>",
      "comment": "The reference to the golden calf shows a longing for tangible worship objects, a caution against mistaking symbols for the divine, while also affirming the legitimacy of sacred images when properly ordered."
    },
    {
      "pk": 3011006,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 6,
      "text": "It will be carried to Assyria as a tribute for the great king. Ephraim shall be put to shame; Israel will be ashamed of its idol.",
      "links": "<a href='/AIV/28/5/13'>Hos. 5:13</a>; <a href='/AIV/28/8/10'>Hos. 8:10</a>",
      "comment": "Idolatry leads to exile and humiliation, symbolizing separation from God. The exile also hints at eventual purification and restoration, preparing for a new, everlasting covenant (see <a href='/AIV/24/31/31-34'>Jer. 31:31-34</a>)."
    },
    {
      "pk": 3011007,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 7,
      "text": "Samaria’s king is cut off, like a twig floating on the water.",
      "links": "<a href='/AIV/28/13/11'>Hos. 13:11</a>",
      "comment": "Royal authority proves transient without obedience to God’s will. Authority is seen as valid only when grounded in God's order—a theme applied both in Israel’s history and in the Church."
    },
    {
      "pk": 3011008,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 8,
      "text": "The high places of Aven, the sin of Israel, will be destroyed; thorn and thistle will grow up on their altars. They will say to the mountains, 'Cover us!' and to the hills, 'Fall on us!'",
      "links": "<a href='/AIV/28/4/13'>Hos. 4:13</a>; <a href='/AIV/42/23/30'>Luke 23:30</a>; <a href='/AIV/66/6/16'>Rev. 6:16</a>",
      "comment": "Judgment leads the people to utter despair—words echoed by Jesus on the way to the cross (<a href='/AIV/42/23/30'>Luke 23:30</a>), pointing to Christ’s fulfillment of prophecy and the need for true repentance."
    },
    {
      "pk": 3011009,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 9,
      "text": "O Israel, you have sinned since the days of Gibeah. There they have continued; shall not war overtake the evildoers in Gibeah?",
      "links": "<a href='/AIV/07/19/22-30'>Judg. 19:22-30</a>; <a href='/AIV/28/9/9'>Hos. 9:9</a>",
      "comment": "Gibeah recalls deep moral decay, rooted in Israel’s history (<a href='/AIV/07/19/22-30'>Judg. 19</a>). Such memories call for collective repentance and an ordered restoration."
    },
    {
      "pk": 3011010,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 10,
      "text": "When I desire, I will discipline them; and peoples will be gathered against them when they are bound for their double guilt.",
      "links": "<a href='/AIV/28/8/10'>Hos. 8:10</a>; <a href='/AIV/24/30/11'>Jer. 30:11</a>",
      "comment": "Divine discipline aims to purify. The gathering of nations suggests God’s universal rule and his desire for a single people made holy by trial."
    },
    {
      "pk": 3011011,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 11,
      "text": "Ephraim was a trained heifer that loved to thresh; and I spared her fair neck, but I will harness Ephraim, Judah must plow, Jacob must break up the ground.",
      "links": "<a href='/AIV/28/11/12'>Hos. 11:12</a>; <a href='/AIV/18/39/10-12'>Job 39:10-12</a>",
      "comment": "The imagery shows God’s patience yet his resolve to discipline his people. Different tribes have distinct roles, foreshadowing unity from diversity—an ordered service to God."
    },
    {
      "pk": 3011012,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 12,
      "text": "Sow for yourselves righteousness; reap steadfast love. Break up your unplowed ground, for it is time to seek the LORD, till he comes and rains righteousness upon you.",
      "links": "<a href='/AIV/19/72/6'>Ps. 72:6</a>; <a href='/AIV/40/6/33'>Matt. 6:33</a>",
      "comment": "Repentance and spiritual renewal lead to God’s blessing. The rain of righteousness anticipates Christ, the source of grace. The verse balances human effort with God’s initiative, hinting at cooperation in salvation."
    },
    {
      "pk": 3011013,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 13,
      "text": "You have plowed wickedness, you have reaped injustice, you have eaten the fruit of lies. Because you have trusted in your own way, and in your many warriors,",
      "links": "<a href='/AIV/20/14/12'>Prov. 14:12</a>; <a href='/AIV/24/17/5'>Jer. 17:5</a>",
      "comment": "Trust in self and military might brings ruin. This highlights the importance of abandoning self-reliance for faith in God, a recurring theme in the spiritual life (<a href='/AIV/47/1/9'>2 Cor. 1:9</a>)."
    },
    {
      "pk": 3011014,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 14,
      "text": "Therefore the tumult of war will arise among your people, and all your fortresses will be destroyed—as Shalman destroyed Beth-arbel on the day of battle; mothers were dashed to pieces with their children.",
      "links": "<a href='/AIV/12/17/3-6'>2 Kgs. 17:3-6</a>",
      "comment": "The horror of judgment is graphic, reflecting the consequences of ongoing rebellion. Such warnings aim to move hearts to repentance and the seeking of mercy."
    },
    {
      "pk": 3011015,
      "translation": "AIV",
      "book": 28,
      "chapter": 10,
      "verse": 15,
      "text": "So shall it be done to you, O Bethel, because of your great evil. At dawn the king of Israel will be utterly cut off.",
      "links": "<a href='/AIV/28/10/5'>Hos. 10:5</a>; <a href='/AIV/28/13/16'>Hos. 13:16</a>",
      "comment": "Bethel, once a place of meeting with God, now stands as a warning. The cutting off of the king reminds readers that no earthly authority is immune without faithfulness to God’s covenant—pointing toward the need for a new, eternal king."
    }
  ],
  "translatedAt": "2025-12-23T07:22:37.523Z"
}