{
  "book": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 6,
  "verses": [
    {
      "pk": 660601,
      "translation": "AIV",
      "book": 28,
      "chapter": 6,
      "verse": 1,
      "text": "Come, let us return to the LORD, for he has torn us, that he may heal us; he has struck us down, but he will bind us up.",
      "links": "<a href='/AIV/23/30/26'>Isaiah 30:26</a>; <a href='/AIV/18/5/18'>Job 5:18</a>",
      "comment": "Hosea calls Israel to repentance, emphasizing the Lord's discipline is for the purpose of healing. The language is reminiscent of divine correction for restoration found in other Scriptures. Spiritual restoration often follows after necessary chastisement."
    },
    {
      "pk": 660602,
      "translation": "AIV",
      "book": 28,
      "chapter": 6,
      "verse": 2,
      "text": "After two days he will revive us; on the third day he will raise us up, that we may live before him.",
      "links": "<a href='/AIV/40/16/21'>Matt. 16:21</a>; <a href='/AIV/46/15/4'>1 Cor. 15:4</a>",
      "comment": "The reference to 'the third day' anticipates resurrection themes, later fulfilled in Christ's resurrection (see 1 Corinthians 15:4). This verse has both literal meaning for Israel's restoration and a deeper, spiritual significance that prefigures new life in Christ."
    },
    {
      "pk": 660603,
      "translation": "AIV",
      "book": 28,
      "chapter": 6,
      "verse": 3,
      "text": "Let us know; let us press on to know the LORD. His going out is as sure as the dawn; he will come to us like the rain, like the latter and former rain that waters the earth.",
      "links": "<a href='/AIV/23/58/8'>Isaiah 58:8</a>; <a href='/AIV/05/11/14'>Deut. 11:14</a>; <a href='/AIV/29/2/23'>Joel 2:23</a>",
      "comment": "Knowing the LORD is portrayed as continual and necessary. The imagery of rain indicates undeserved grace and faithfulness, echoing the Spirit's outpouring and the steadfast approach of God toward his people."
    },
    {
      "pk": 660604,
      "translation": "AIV",
      "book": 28,
      "chapter": 6,
      "verse": 4,
      "text": "What shall I do with you, O Ephraim? What shall I do with you, O Judah? Your love is like a morning cloud, like the dew that goes early away.",
      "links": "<a href='/AIV/19/78/37'>Psalm 78:37</a>; <a href='/AIV/23/1/31'>Isaiah 1:31</a>",
      "comment": "God laments the fleeting nature of Israel and Judah’s faithfulness. The comparison to temporary dew and cloud shows how shallow their devotion is, inviting deeper reflection on genuine, persevering love for God."
    },
    {
      "pk": 660605,
      "translation": "AIV",
      "book": 28,
      "chapter": 6,
      "verse": 5,
      "text": "Therefore I have cut them down by the prophets; I have slain them by the words of my mouth, and my judgment goes forth as the light.",
      "links": "<a href='/AIV/24/23/29'>Jer. 23:29</a>; <a href='/AIV/19/119/130'>Psalm 119:130</a>",
      "comment": "God’s prophetic word has the power to judge and correct. The comparison to light implies the clarity and righteousness of divine judgment—God uses his messengers and his spoken word to guide and discipline his people."
    },
    {
      "pk": 660606,
      "translation": "AIV",
      "book": 28,
      "chapter": 6,
      "verse": 6,
      "text": "For I desire steadfast love and not sacrifice, the knowledge of God rather than burnt offerings.",
      "links": "<a href='/AIV/09/15/22'>1 Sam. 15:22</a>; <a href='/AIV/40/9/13'>Matt. 9:13</a>; <a href='/AIV/40/12/7'>Matt. 12:7</a>",
      "comment": "True worship is rooted in internal devotion and knowing God personally, not just external ritual. Jesus himself quotes this verse (Matt 9:13, 12:7), highlighting the priority of mercy over ritual sacrifice—a theme central in the life of the Church."
    },
    {
      "pk": 660607,
      "translation": "AIV",
      "book": 28,
      "chapter": 6,
      "verse": 7,
      "text": "But like Adam, they transgressed the covenant; there they dealt faithlessly with me.",
      "links": "<a href='/AIV/01/3/6'>Genesis 3:6</a>; <a href='/AIV/19/106/6'>Psalm 106:6</a>",
      "comment": "Israel's breach of covenant echoes Adam’s original sin. Humanity's default to infidelity underscores the universal need for grace and mediation that is ultimately fulfilled in the new Adam, Christ."
    },
    {
      "pk": 660608,
      "translation": "AIV",
      "book": 28,
      "chapter": 6,
      "verse": 8,
      "text": "Gilead is a city of evildoers, tracked with blood.",
      "links": "<a href='/AIV/28/12/11'>Hos. 12:11</a>; <a href='/AIV/28/1/11'>Hos. 1:11</a>",
      "comment": "Gilead, a region associated with healing balm, is ironically identified with violence. This contrast between calling and deed suggests that leadership or sacred responsibility can be corrupted if devoid of holiness."
    },
    {
      "pk": 660609,
      "translation": "AIV",
      "book": 28,
      "chapter": 6,
      "verse": 9,
      "text": "As robbers lie in wait for a man, so the company of priests murder on the way to Shechem; they commit outrages.",
      "links": "<a href='/AIV/06/21/21'>Josh. 21:21</a>; <a href='/AIV/07/9/45'>Judg. 9:45</a>",
      "comment": "Priests, intended as mediators, are indicted for grave sin. Corruption among the clergy is strongly condemned, affirming the biblical expectation that spiritual leaders are to be holy and above reproach."
    },
    {
      "pk": 660610,
      "translation": "AIV",
      "book": 28,
      "chapter": 6,
      "verse": 10,
      "text": "In the house of Israel I have seen a horrible thing; Ephraim's whoredom is there; Israel is defiled.",
      "links": "<a href='/AIV/28/4/1'>Hos. 4:1</a>; <a href='/AIV/24/2/20'>Jer. 2:20</a>",
      "comment": "Spiritual infidelity is repeatedly pictured as harlotry. The prophetic witness emphasizes that defilement comes from abandoning the covenant, yet eventual healing and restoration are always anticipated."
    },
    {
      "pk": 660611,
      "translation": "AIV",
      "book": 28,
      "chapter": 6,
      "verse": 11,
      "text": "Also, O Judah, a harvest is appointed for you, when I restore the fortunes of my people.",
      "links": "<a href='/AIV/28/2/23'>Hos. 2:23</a>; <a href='/AIV/29/3/13'>Joel 3:13</a>",
      "comment": "The language of ‘harvest’ carries both the nuance of judgment and of promise. God disciplines, yet ultimately promises the restoration and unity of his people—a recurring theme that points forward to the gathering of the faithful into one Church."
    }
  ],
  "translatedAt": "2025-12-23T07:21:21.680Z"
}