{
  "book": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 12,
  "verses": [
    {
      "pk": 3001201,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 1,
      "text": "Ephraim feeds on wind and pursues the east wind all day; he multiplies lies and violence. They make a covenant with Assyria, and oil is carried to Egypt.",
      "links": "<a href='/AIV/28/4/19'>Hos. 4:19</a>; <a href='/AIV/28/7/11'>Hos. 7:11</a>; <a href='/AIV/23/30/6'>Isa. 30:6</a>",
      "comment": "The wind imagery—a sign of emptiness—shows Ephraim's trust in human alliances instead of God. The ties to Assyria and Egypt foreshadow repeated biblical warnings against relying on worldly powers rather than divine providence (see Isa. 30:1–3)."
    },
    {
      "pk": 3001202,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 2,
      "text": "The LORD has a dispute with Judah, and will punish Jacob according to his ways; he will repay him for his deeds.",
      "links": "<a href='/AIV/28/4/1'>Hos. 4:1</a>; <a href='/AIV/19/62/12'>Ps. 62:12</a>",
      "comment": "Both the northern (Ephraim) and southern (Judah) kingdoms are accountable. The reference to Jacob recalls the patriarch, linking the people's behavior to their ancestor's, and anticipates the New Testament concept of God rewarding according to one’s works (see Rom. 2:6)."
    },
    {
      "pk": 3001203,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 3,
      "text": "In the womb he took his brother by the heel, and as a man he strove with God.",
      "links": "<a href='/AIV/1/25/26'>Gen. 25:26</a>; <a href='/AIV/1/32/24-30'>Gen. 32:24–30</a>",
      "comment": "Jacob’s struggle emphasizes the theme of striving with God for blessing—a pattern fulfilled spiritually in persevering prayer (see Gen. 32:28, Luke 18:1-8). This 'heel holding' is symbolic for grasping after spiritual inheritance."
    },
    {
      "pk": 3001204,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 4,
      "text": "He contended with the angel and prevailed; he wept and sought his favor. At Bethel he found him, and there he spoke with us.",
      "links": "<a href='/AIV/1/32/28'>Gen. 32:28</a>; <a href='/AIV/1/35/9-15'>Gen. 35:9–15</a>",
      "comment": "Jacob’s wrestling at Bethel is a critical moment, with 'the angel' frequently interpreted as the pre-incarnate Christ (see Gen. 32:30, John 1:51). Hosea says that 'he spoke with us,' implying an ongoing divine communication to God's people—a hint at enduring revelation through sacred tradition and teaching."
    },
    {
      "pk": 3001205,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 5,
      "text": "The LORD, the God of hosts, the LORD is his memorial name.",
      "links": "<a href='/AIV/2/3/15'>Ex. 3:15</a>; <a href='/AIV/19/24/10'>Ps. 24:10</a>",
      "comment": "This verse explicitly recalls God's self-revelation to Moses. 'The LORD is his memorial name' underlines the importance of proper worship and remembrance—see Ex. 3:15 for God’s unchanging name. The stress on 'God of hosts' points toward God's sovereignty over all, prefiguring Christ as Lord of heaven and earth (see Col. 2:10)."
    },
    {
      "pk": 3001206,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 6,
      "text": "So you, by the help of your God, return; hold fast to love and justice, and always wait for your God.",
      "links": "<a href='/AIV/28/6/6'>Hos. 6:6</a>; <a href='/AIV/33/6/8'>Mic. 6:8</a>",
      "comment": "The call to return to God echoes both repentance and ongoing conversion. 'Love and justice' parallel God’s own character and foreshadow New Testament teaching—faith working through love (see Gal. 5:6, James 2:17)—and the importance of perseverance (see Matt. 24:13)."
    },
    {
      "pk": 3001207,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 7,
      "text": "A merchant keeps deceptive balances; he loves to oppress.",
      "links": "<a href='/AIV/28/7/1'>Hos. 7:1</a>; <a href='/AIV/3/19/35-36'>Lev. 19:35–36</a>",
      "comment": "The image of the merchant with 'deceptive balances' highlights social injustice—a sin condemned repeatedly (see Amos 8:5, Mic. 6:11). Scripture expects the faithful to practice honesty, prefiguring Jesus’ demand for sincerity and truth (see Matt. 5:37)."
    },
    {
      "pk": 3001208,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 8,
      "text": "Ephraim says, 'Surely I have become rich; I have found wealth for myself. In all my labors, no one will find in me iniquity that is sin.'",
      "links": "<a href='/AIV/28/8/11'>Hos. 8:11</a>; <a href='/AIV/28/13/6'>Hos. 13:6</a>",
      "comment": "Self-sufficiency and moral blindness are linked; spiritual pride prevents true repentance. This warns against relying on earthly riches and one’s self-assessment, a theme addressed by Jesus in his warnings to the rich (see Luke 12:16–21)."
    },
    {
      "pk": 3001209,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 9,
      "text": "But I am the LORD your God ever since the land of Egypt; I will again make you dwell in tents, as in the days of the appointed feast.",
      "links": "<a href='/AIV/3/23/42-43'>Lev. 23:42–43</a>; <a href='/AIV/28/13/4'>Hos. 13:4</a>",
      "comment": "Reminders of the Exodus connect divine deliverance and covenant identity. Living in tents points to humility and a return to dependence on God, as commemorated at the Feast of Tabernacles—a living symbol of God’s ongoing guidance and provision."
    },
    {
      "pk": 3001210,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 10,
      "text": "I spoke to the prophets and multiplied visions, and through the prophets gave parables.",
      "links": "<a href='/AIV/28/6/5'>Hos. 6:5</a>; <a href='/AIV/1/41/15'>Gen. 41:15</a>",
      "comment": "God communicates progressively through prophets, visions, and parables—a pattern fulfilled ultimately in Christ, who spoke in parables (see Matt. 13:34–35) and is the final revelation (see Heb. 1:1–2)."
    },
    {
      "pk": 3001211,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 11,
      "text": "Is Gilead iniquity? Surely, they are vanity. In Gilgal they sacrifice bulls, but their altars are like heaps in the furrows of the field.",
      "links": "<a href='/AIV/28/6/8'>Hos. 6:8</a>; <a href='/AIV/28/9/15'>Hos. 9:15</a>",
      "comment": "Gilead and Gilgal are linked with false worship. The piling up of altars is empty ritual—contrasting with God’s desire for true obedience and worship 'in spirit and truth' (see John 4:23)."
    },
    {
      "pk": 3001212,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 12,
      "text": "Jacob fled to the land of Aram, and Israel served for a wife and tended sheep for a wife.",
      "links": "<a href='/AIV/1/28/5'>Gen. 28:5</a>; <a href='/AIV/1/29/20'>Gen. 29:20</a>",
      "comment": "Jacob’s hardships—service and waiting—foreshadow themes of suffering and patient fidelity, seen in Christ’s own life (see Phil. 2:7–8), and anticipated in believers' journeys of sanctification."
    },
    {
      "pk": 3001213,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 13,
      "text": "By a prophet the LORD brought Israel up from Egypt, and by a prophet he was guarded.",
      "links": "<a href='/AIV/2/12/50-51'>Ex. 12:50–51</a>; <a href='/AIV/2/33/12'>Ex. 33:12</a>",
      "comment": "Moses as prophet is a type for Christ, the ultimate deliverer and shepherd (see Acts 3:22, Heb. 3:5–6). Protection by a prophet highlights the mediatory role assigned by God, prefiguring Christ’s priestly and kingly mediation."
    },
    {
      "pk": 3001214,
      "translation": "AIV",
      "book": 28,
      "chapter": 12,
      "verse": 14,
      "text": "Ephraim provoked bitter anger. But his Lord will leave his bloodguilt on him, and will repay him for his contempt.",
      "links": "<a href='/AIV/28/9/7'>Hos. 9:7</a>; <a href='/AIV/19/9/12'>Ps. 9:12</a>",
      "comment": "Final justice is assured: God holds Ephraim accountable—anticipating the reality of judgment and the need for authentic repentance, repeatedly demanded by the prophets and fulfilled through reconciliation and sacrificial mediation in Christ’s atonement (see Rom. 3:24–25)."
    }
  ],
  "translatedAt": "2025-12-23T07:23:14.728Z"
}