{
  "book": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 5,
  "verses": [
    {
      "pk": 305001,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 1,
      "text": "Hear this, O priests! Pay attention, O house of Israel! Listen, O house of the king! For the judgment is against you, because you have become a snare at Mizpah and a net spread on Tabor.",
      "links": "<a href='/AIV/28/6/9'>Hos. 6:9</a>; <a href='/AIV/9/12/14'>1 Sam. 12:14</a>",
      "comment": "Hosea addresses priests, leaders, and the royal house, highlighting their responsibility for leading the people astray. Traditions and religious leadership play an essential role in guiding people to true worship, referencing Mt 23:1-3 on leaders' accountability."
    },
    {
      "pk": 305002,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 2,
      "text": "The rebels have gone deep into slaughter, but I will discipline all of them.",
      "links": "<a href='/AIV/28/4/9'>Hos. 4:9</a>; <a href='/AIV/19/36/1'>Ps. 36:1</a>",
      "comment": "This verse alludes to misguided worship and unfaithfulness. God's discipline is portrayed as corrective, reminiscent of the loving Father's discipline in Heb 12:6."
    },
    {
      "pk": 305003,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 3,
      "text": "I know Ephraim, and Israel is not hidden from me; for now, O Ephraim, you have played the prostitute; Israel is defiled.",
      "links": "<a href='/AIV/28/6/10'>Hos. 6:10</a>; <a href='/AIV/19/139/1-4'>Ps. 139:1-4</a>",
      "comment": "God's omniscience sees even hidden sins. Spiritual prostitution refers to idolatry and unfaithfulness. The image foreshadows the call for purity in Christ's relationship with the Church (see Eph 5:25-27)."
    },
    {
      "pk": 305004,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 4,
      "text": "Their deeds do not allow them to return to their God, for a spirit of prostitution is within them, and they do not know the LORD.",
      "links": "<a href='/AIV/28/4/12'>Hos. 4:12</a>; <a href='/AIV/23/29/13'>Isa 29:13</a>",
      "comment": "Sin creates a barrier to true worship. The phrase 'do not know the LORD' calls for an intimate, covenant relationship, fulfilled most fully in Christ (Jn 17:3)."
    },
    {
      "pk": 305005,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 5,
      "text": "The arrogance of Israel testifies against him; both Israel and Ephraim stumble in their guilt; Judah also stumbles with them.",
      "links": "<a href='/AIV/28/7/10'>Hos. 7:10</a>; <a href='/AIV/20/16/18'>Prov. 16:18</a>",
      "comment": "Pride leads to downfall (Prov. 16:18). All tribes are implicated, showing sin’s communal effect—an early picture of the doctrine that the faith community’s sins impact all its members (see 1 Cor 12:26)."
    },
    {
      "pk": 305006,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 6,
      "text": "With their flocks and herds they go to seek the LORD, but they will not find him; he has withdrawn from them.",
      "links": "<a href='/AIV/28/8/13'>Hos. 8:13</a>; <a href='/AIV/23/1/11-15'>Isa. 1:11-15</a>",
      "comment": "Rituals alone cannot substitute for obedience and a right heart. The idea of God withdrawing speaks of the need for genuine repentance, not just external acts (cf. Mt 15:8-9)."
    },
    {
      "pk": 305007,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 7,
      "text": "They have betrayed the LORD; for they have born alien children. Now the new moon will devour them and their fields.",
      "links": "<a href='/AIV/28/2/4'>Hos. 2:4</a>; <a href='/AIV/23/1/13'>Isa. 1:13</a>",
      "comment": "Having 'alien children' is a metaphor for spiritual infidelity. The reference to the new moon ties civil and liturgical calendars, showing the connection between worship and daily life—prefiguring the unity of liturgy and moral life in Christian practice."
    },
    {
      "pk": 305008,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 8,
      "text": "Blow the horn in Gibeah, the trumpet in Ramah. Sound the alarm at Beth-aven; behind you, Benjamin!",
      "links": "<a href='/AIV/7/5/14'>Judg. 5:14</a>; <a href='/AIV/28/4/15'>Hos. 4:15</a>",
      "comment": "Trumpets signal warning of judgment—echoing calls to repentance found throughout both Old and New Testaments (see Joel 2:1; Mt 3:2)."
    },
    {
      "pk": 305009,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 9,
      "text": "Ephraim shall become a desolation in the day of punishment; among the tribes of Israel I make known what is certain.",
      "links": "<a href='/AIV/28/9/3'>Hos. 9:3</a>; <a href='/AIV/1/19/25'>Gen. 19:25</a>",
      "comment": "God's justice comes swiftly and surely, assuring certainty in His word. A reminder of coming judgment (cf. Mt 24:44) and the need for repentance."
    },
    {
      "pk": 305010,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 10,
      "text": "The princes of Judah are like those who move a boundary; on them I will pour out my wrath like water.",
      "links": "<a href='/AIV/5/19/14'>Deut. 19:14</a>; <a href='/AIV/19/69/24'>Ps. 69:24</a>",
      "comment": "Moving boundaries was forbidden (Deut. 19:14) and represents injustice. God's justice is exhaustive, calling for uprightness from civil and spiritual leaders alike. The discipline also foreshadows the purifying trials for leaders in the new covenant Church (see 1 Cor 3:13)."
    },
    {
      "pk": 305011,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 11,
      "text": "Ephraim is oppressed, crushed in judgment, because he was determined to go after filth.",
      "links": "<a href='/AIV/28/12/1'>Hos. 12:1</a>; <a href='/AIV/23/5/20'>Isa. 5:20</a>",
      "comment": "The pursuit of 'filth' is both literal (idol worship) and spiritual (abandoning God). This has echoes in warnings against false doctrine and the need for sound teaching (2 Tim 4:3)."
    },
    {
      "pk": 305012,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 12,
      "text": "But I am like a moth to Ephraim, and like dry rot to the house of Judah.",
      "links": "<a href='/AIV/28/13/9'>Hos. 13:9</a>; <a href='/AIV/23/51/8'>Isa. 51:8</a>",
      "comment": "God’s judgment is often gradual but sure, just as decay works slowly. The idea reflects divine patience, offering opportunity for repentance, as with the patience shown toward Peter after his denial (Lk 22:32)."
    },
    {
      "pk": 305013,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 13,
      "text": "When Ephraim saw his sickness, and Judah his wound, then Ephraim went to Assyria, and sent to the great king. But he is not able to heal you or cure your wound.",
      "links": "<a href='/AIV/28/7/11'>Hos. 7:11</a>; <a href='/AIV/24/2/36'>Jer. 2:36</a>",
      "comment": "Seeking healing from foreign rulers instead of God shows misplaced trust. Only God is the source of true healing—the divine physician (cf. Mk 2:17)."
    },
    {
      "pk": 305014,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 14,
      "text": "For I will be like a lion to Ephraim, and like a young lion to the house of Judah. I, even I, will tear and go away; I will carry off, and there will be none to rescue.",
      "links": "<a href='/AIV/28/13/7-8'>Hos. 13:7-8</a>; <a href='/AIV/23/31/4'>Isa. 31:4</a>",
      "comment": "The image of God as lion highlights both His power and His just judgment. Yet, the Lord, who wounds, also heals (cf. Hos 6:1); foreshadowing both repentance and restoration in Christ."
    },
    {
      "pk": 305015,
      "translation": "AIV",
      "book": 28,
      "chapter": 5,
      "verse": 15,
      "text": "I will go away; I will return to my place until they acknowledge their guilt and seek my face, and in their distress, they will earnestly seek me.",
      "links": "<a href='/AIV/28/6/1'>Hos. 6:1</a>; <a href='/AIV/19/27/8'>Ps. 27:8</a>",
      "comment": "God withdraws to provoke repentance and sincere seeking—themes realized in the call to conversion and confession (see 1 Jn 1:9; Mt 4:17). The pattern of judgment leading to mercy is fulfilled in the new covenant restoration."
    }
  ],
  "translatedAt": "2025-12-23T07:21:04.039Z"
}