{
  "book": 35,
  "bookName": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 1,
  "verses": [
    {
      "pk": 35001001,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 1,
      "verse": 1,
      "text": "The word of the LORD came to Hosea son of Beeri, during the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah, and during the days of Jeroboam son of Joash, king of Israel.",
      "links": "<a href='/AIV/12/15/32-38'>2 Kings 15:32-38</a>; <a href='/AIV/14/26/1'>2 Chr. 26:1</a>",
      "comment": "This verse gives the historical context of Hosea’s ministry, anchoring his prophetic message in real historical reigns. Notice the shared lineage with other prophets, showing God's continuity in guiding His people through chosen messengers."
    },
    {
      "pk": 35001002,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 1,
      "verse": 2,
      "text": "When the LORD first spoke to Hosea, the LORD said to him, 'Go, take for yourself a wife of prostitution and children of unfaithfulness, for the land is guilty of forsaking the LORD in its prostitution.'",
      "links": "<a href='/AIV/28/4/15'>Hos. 4:15</a>; <a href='/AIV/23/1/21'>Isa. 1:21</a>",
      "comment": "God instructs Hosea to take a wife whose unfaithfulness mirrors Israel’s spiritual infidelity. This dramatic command reveals God's deep desire to teach through visible signs. The choice is symbolic, laying groundwork for understanding the strong link between marital covenant and divine covenant."
    },
    {
      "pk": 35001003,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 1,
      "verse": 3,
      "text": "So Hosea went and took Gomer daughter of Diblaim, and she conceived and bore him a son.",
      "links": "<a href='/AIV/28/3/1-3'>Hos. 3:1-3</a>",
      "comment": "Hosea’s obedience underscores prophetic faithfulness. Gomer’s background intensifies the lesson: God’s love remains steadfast despite the repeated unfaithfulness of His people, reflecting His mercy and readiness to restore even the most lost."
    },
    {
      "pk": 35001004,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 1,
      "verse": 4,
      "text": "Then the LORD said to Hosea, 'Name him Jezreel, for soon I will punish the house of Jehu for the bloodshed at Jezreel, and I will end the kingdom of Israel.'",
      "links": "<a href='/AIV/12/10/1-11'>2 Kings 10:1-11</a>; <a href='/AIV/28/2/22'>Hos. 2:22</a>",
      "comment": "The naming of Jezreel connects Hosea’s family directly to the fate of Israel—symbolizing both judgment and future restoration. The reference to Jehu's dynasty is a reminder that God holds rulers accountable, and historic violence will be answered, echoing divine justice throughout Scripture."
    },
    {
      "pk": 35001005,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 1,
      "verse": 5,
      "text": "On that day, I will break the bow of Israel in the Valley of Jezreel.",
      "links": "<a href='/AIV/19/46/9'>Ps. 46:9</a>; <a href='/AIV/28/2/22-23'>Hos. 2:22-23</a>",
      "comment": "God’s act of breaking Israel's bow marks the end of military strength and self-reliance, highlighting how God humbles His people to bring them back in line with His plan. It foreshadows God working through apparent defeat to prepare for future restoration."
    },
    {
      "pk": 35001006,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 1,
      "verse": 6,
      "text": "Gomer conceived again and gave birth to a daughter. And the LORD said to Hosea: 'Name her Lo-Ruhamah, for I will no longer show compassion to the house of Israel, that I should forgive them.'",
      "links": "<a href='/AIV/28/2/4-13'>Hos. 2:4-13</a>; <a href='/AIV/19/85/7'>Ps. 85:7</a>",
      "comment": "This name, meaning 'No Mercy,' underscores the consequences of persistent unfaithfulness. Yet the theme of compassion is recurrent in Scripture, hinting at God's ultimate intention to restore mercy—an anticipation seen fulfilled in the New Testament picture of divine forgiveness."
    },
    {
      "pk": 35001007,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 1,
      "verse": 7,
      "text": "But I will have compassion on the house of Judah, and I will save them—not by bow or sword or war, nor by horses or horsemen, but by the LORD their God.",
      "links": "<a href='/AIV/23/37/36'>Isa. 37:36</a>; <a href='/AIV/19/20/7'>Ps. 20:7</a>",
      "comment": "Here, God’s salvation is not through human means but by His own intervention. This verse prefigures New Testament themes of salvation by grace through faith—ultimately realized in Christ’s redemptive work, where victory comes through surrender to God’s will, not human strength."
    },
    {
      "pk": 35001008,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 1,
      "verse": 8,
      "text": "After she had weaned Lo-Ruhamah, Gomer conceived and bore a son.",
      "links": "<a href='/AIV/28/2/23'>Hos. 2:23</a>",
      "comment": "The birth of a third child deepens the prophetic symbolism. The weaning suggests a period of transition, signifying a coming change in God’s dealing with the people, whether in judgment or unexpected restoration."
    },
    {
      "pk": 35001009,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 1,
      "verse": 9,
      "text": "Then the LORD said, 'Name him Lo-Ammi, for you are not my people, and I am not your God.'",
      "links": "<a href='/AIV/03/26/12'>Lev. 26:12</a>; <a href='/AIV/28/2/23'>Hos. 2:23</a>; <a href='/AIV/60/2/10'>1 Pet. 2:10</a>",
      "comment": "Lo-Ammi, meaning 'Not My People,' marks a powerful moment of disinheritance, shocking in its finality. But the broader biblical pattern is restoration after exile—a theme later echoed in the promise to welcome those once estranged back into God’s family, as emphasized in the New Testament."
    },
    {
      "pk": 35001010,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 1,
      "verse": 10,
      "text": "Yet the number of the children of Israel will be like the sand of the sea, which cannot be measured or counted; and in the place where it was said to them, 'You are not my people,' there it will be said, 'You are children of the living God.'",
      "links": "<a href='/AIV/01/22/17'>Gen. 22:17</a>; <a href='/AIV/45/9/25-26'>Rom. 9:25-26</a>; <a href='/AIV/60/2/10'>1 Pet. 2:10</a>",
      "comment": "Despite judgment, God’s promise to Abraham is reaffirmed—Israel’s numbers will be countless, and the rejected will be restored as children of God. This prophetic reversal is fulfilled in Christ, where those far off are reconciled, pointing to the universal call to join God’s family through spiritual adoption."
    },
    {
      "pk": 35001011,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 1,
      "verse": 11,
      "text": "Then the children of Judah and the children of Israel will be gathered together, and they will appoint one head for themselves, and they will go up from the land, for great will be the day of Jezreel.",
      "links": "<a href='/AIV/28/3/5'>Hos. 3:5</a>; <a href='/AIV/26/37/22'>Ezek. 37:22'</a>; <a href='/AIV/43/10/16'>John 10:16</a>",
      "comment": "The promise of unity under one leader foreshadows Messianic hope, later fulfilled in Jesus Christ, the true Shepherd. This reunion signifies both literal return and spiritual gathering, inviting all believers to anticipate restoration and leadership that is divinely appointed and apostolic in its succession."
    }
  ],
  "translatedAt": "2025-12-24T09:34:51.016Z"
}