{
  "book": 35,
  "bookName": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 3,
  "verses": [
    {
      "pk": 35003001,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 3,
      "verse": 1,
      "text": "Then the LORD said to me, 'Go again and love a woman who is loved by another man and is an adulteress, just as the LORD loves the children of Israel, though they turn to other gods and love raisin cakes.'",
      "links": "<a href='/AIV/28/1/2'>Hos. 1:2</a>; <a href='/AIV/24/3/1'>Jer. 3:1</a>; <a href='/AIV/05/32/16'>Deut. 32:16</a>",
      "comment": "The LORD commands Hosea to pursue his unfaithful wife again, symbolizing God's steadfast love for Israel despite their idolatry. The mention of 'raisin cakes' refers to food connected with pagan worship. The recurring theme of God's faithful love, despite persistent unfaithfulness, foreshadows the deeper mercy seen ultimately in Christ’s redemption for all people (<a href='/AIV/45/5/8'>Rom. 5:8</a>). The word for 'love' is covenantal, echoing God's unbreakable commitment."
    },
    {
      "pk": 35003002,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 3,
      "verse": 2,
      "text": "So I bought her for fifteen pieces of silver and a homer and a half of barley.",
      "links": "<a href='/AIV/02/21/32'>Ex. 21:32</a>; <a href='/AIV/03/20/15'>Lev. 27:15-16</a>",
      "comment": "Hosea redeems his wife for a set price, symbolizing ransom or restoration. This act prefigures the redemptive price paid for sinners (<a href='/AIV/40/20/28'>Matt. 20:28</a>). The use of both silver and barley emphasizes a literal and figurative redemption that unites body and soul."
    },
    {
      "pk": 35003003,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 3,
      "verse": 3,
      "text": "And I said to her, 'You must stay with me many days; you shall not play the prostitute, nor shall you belong to another man; so I will also be toward you.'",
      "links": "<a href='/AIV/26/16/41'>Ezek. 16:41</a>; <a href='/AIV/45/7/4'>Rom. 7:4</a>",
      "comment": "This verse points to a period of purification and exclusivity, echoing the call to holiness and singular devotion to God. The covenantal language hints at the intimate relationship God desires with His people (see <a href='/AIV/49/5/25-27'>Eph. 5:25-27</a>). There is both a literal call to marital faithfulness and a spiritual summons to unwavering faith in God’s one, true Church."
    },
    {
      "pk": 35003004,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 3,
      "verse": 4,
      "text": "For the children of Israel shall remain many days without king, without prince, without sacrifice, without sacred pillar, and without ephod or household idols.",
      "links": "<a href='/AIV/23/1/7'>Isa. 1:7</a>; <a href='/AIV/28/10/3'>Hos. 10:3</a>; <a href='/AIV/09/14/3'>1 Sam. 14:3</a>",
      "comment": "A time is foretold when Israel will lose all leaders, sacrifices, and symbols of religious life. Historically, this refers to exile and the end of temple worship. Spiritually, it signifies a longing for restoration of right worship, which finds ultimate fulfillment in Christ's priesthood and the establishment of the sacramental life of the Church (<a href='/AIV/41/14/24'>Mark 14:24</a>), continuing the true sacrifice."
    },
    {
      "pk": 35003005,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 3,
      "verse": 5,
      "text": "Afterward the children of Israel will return and seek the LORD their God and David their king. And they will come trembling to the LORD and to His goodness in the last days.",
      "links": "<a href='/AIV/24/30/9'>Jer. 30:9</a>; <a href='/AIV/26/34/23-24'>Ezek. 34:23-24</a>; <a href='/AIV/42/1/32-33'>Luke 1:32-33</a>",
      "comment": "'David their king' refers prophetically to the Messiah (see <a href='/AIV/43/7/42'>John 7:42</a>). The return and seeking of the LORD points toward the future gathering of God's people under the Messiah’s rule, fulfilled in Christ. The phrase 'in the last days' underscores a hope for the messianic era and reunion of God's people, realized most fully in the ultimate unity and peace that Christ brings."
    }
  ],
  "translatedAt": "2025-12-24T09:35:45.895Z"
}