{
  "book": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 13,
  "verses": [
    {
      "pk": 1955013,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 1,
      "text": "When Ephraim spoke, men trembled; he was exalted in Israel. But when he offended through Baal, he died.",
      "links": "<a href='/AIV/28/5/5'>Hosea 5:5</a>; <a href='/AIV/11/18/21'>1 Kings 18:21</a>",
      "comment": "Ephraim represents the northern kingdom of Israel. His initial strength and honor were lost when he turned to idolatry. Baal worship often led Israel into spiritual death—see <a href='/AIV/19/106/28'>Psalm 106:28</a> for further consequences of idolatry."
    },
    {
      "pk": 1955014,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 2,
      "text": "Now they sin more and more, and make for themselves cast images from silver, idols according to their own understanding, all of them the work of craftsmen. They say to them, 'Those who sacrifice may kiss the calves.'",
      "links": "<a href='/AIV/02/20/4-5'>Exodus 20:4-5</a>; <a href='/AIV/11/12/28'>1 Kings 12:28</a>",
      "comment": "The creation and worship of idols violated the first commandments. 'Kissing the calves' reveals the depth of their devotion to false gods. Spiritual application: giving worship to created things instead of the Creator always leads away from truth."
    },
    {
      "pk": 1955015,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 3,
      "text": "Therefore, they will be like the morning mist, like the dew that disappears early, like chaff blown from the threshing floor, or like smoke from a window.",
      "links": "<a href='/AIV/19/68/2'>Psalm 68:2</a>; <a href='/AIV/19/35/5'>Psalm 35:5</a>",
      "comment": "Their brief existence and influence will vanish quickly, as judgment comes. Compare the fleetingness of earthly glory with the eternal promises given to those who remain in God's covenant."
    },
    {
      "pk": 1955016,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 4,
      "text": "Yet I am the LORD your God since the land of Egypt; you shall know no God but Me, and besides Me there is no Savior.",
      "links": "<a href='/AIV/02/20/2-3'>Exodus 20:2-3</a>; <a href='/AIV/23/43/11'>Isaiah 43:11</a>",
      "comment": "A strong affirmation of monotheism and God's unique role as Savior. This verse anticipates the fullness of salvation, ultimately fulfilled in Christ (see <a href='/AIV/44/4/12'>Acts 4:12</a>)."
    },
    {
      "pk": 1955017,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 5,
      "text": "I knew you in the wilderness, in the land of drought.",
      "links": "<a href='/AIV/05/8/2'>Deuteronomy 8:2</a>; <a href='/AIV/19/78/19'>Psalm 78:19</a>",
      "comment": "God's intimate care during the Exodus highlights His providence. Spiritual interpretation: even in times of spiritual dryness, God's knowledge and care for His people remain steadfast."
    },
    {
      "pk": 1955018,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 6,
      "text": "When they had pasture, they became satisfied; and when they were satisfied, their hearts became proud, so they forgot Me.",
      "links": "<a href='/AIV/05/8/12-14'>Deuteronomy 8:12-14</a>",
      "comment": "Material abundance led to spiritual complacency and pride. This pattern endures—forgetting God during times of ease remains a persistent temptation. Compare with lessons in humility from Jesus (<a href='/AIV/40/5/3'>Matthew 5:3</a>)."
    },
    {
      "pk": 1955019,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 7,
      "text": "So I will become like a lion to them; like a leopard I will lie in wait by the way.",
      "links": "<a href='/AIV/25/3/10'>Lamentations 3:10</a>; <a href='/AIV/23/5/29'>Isaiah 5:29</a>",
      "comment": "God's judgment is depicted as relentless and unavoidable, contrasting with His earlier nurturing care. Scripturally, wild predator imagery often symbolizes coming destruction for persistent sin."
    },
    {
      "pk": 1955020,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 8,
      "text": "I will attack them like a bear robbed of her cubs, I will tear open their chest, and there I will devour them like a lion; wild animals will rip them apart.",
      "links": "<a href='/AIV/34/2/11'>Nahum 2:11</a>",
      "comment": "Powerful imagery of wrath—God's judgment is thorough and fierce. Historically, this refers to the actual invasions and destruction Israel faced. Spiritual lesson: persistent rebellion brings grave consequences."
    },
    {
      "pk": 1955021,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 9,
      "text": "You are destroyed, Israel, because you are against Me, against your helper.",
      "links": "<a href='/AIV/05/33/26-29'>Deuteronomy 33:26-29</a>",
      "comment": "The tragedy is self-inflicted—rejecting God's protection exposes Israel to destruction. God's ultimate desire is to be the true Helper and Deliverer, foreshadowing the New Testament's emphasis on Christ as Savior."
    },
    {
      "pk": 1955022,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 10,
      "text": "Where now is your king, that he may save you? Where are all your rulers, in whom you said, 'Give me a king and princes'?",
      "links": "<a href='/AIV/09/8/19-20'>1 Samuel 8:19-20</a>; <a href='/AIV/09/10/19'>1 Samuel 10:19</a>",
      "comment": "The request for worldly leadership, as opposed to divine kingship, leads to disappointment. Spiritual meaning: only God's appointed means of governance offers true protection and security."
    },
    {
      "pk": 1955023,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 11,
      "text": "I gave you a king in My anger, and I took him away in My wrath.",
      "links": "<a href='/AIV/09/8/7'>1 Samuel 8:7</a>; <a href='/AIV/09/15/26'>1 Samuel 15:26</a>",
      "comment": "God granted Israel's demand for a king, but it came with consequences. The rise and fall of kings demonstrates that seeking leadership apart from God's will brings instability—see how this principle is fulfilled in the figure of Christ, the true King."
    },
    {
      "pk": 1955024,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 12,
      "text": "Ephraim’s iniquity is bound up; his sin is stored up.",
      "links": "<a href='/AIV/19/32/1-2'>Psalm 32:1-2</a>; <a href='/AIV/23/64/6'>Isaiah 64:6</a>",
      "comment": "The accumulation of sin awaits reckoning; only true redemption can erase guilt. Compare with God's promise to forgive and cover sins for those reconciled to Him."
    },
    {
      "pk": 1955025,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 13,
      "text": "Pains of childbirth come for him, but he is an unwise son; for at the right time, he should not stay in the place of birth.",
      "links": "<a href='/AIV/23/66/9'>Isaiah 66:9</a>; <a href='/AIV/19/22/9'>Psalm 22:9</a>",
      "comment": "The image of birth pangs implies opportunity for renewal or rebirth, but Israel refuses to respond. There are spiritual parallels here to baptism and new birth, with implications for faith and conversion."
    },
    {
      "pk": 1955026,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 14,
      "text": "I will redeem them from the power of Sheol; I will save them from death. Death, where are your plagues? Sheol, where is your destruction? Compassion is hidden from My eyes.",
      "links": "<a href='/AIV/46/15/55'>1 Corinthians 15:55</a>; <a href='/AIV/23/25/8'>Isaiah 25:8</a>",
      "comment": "A profound prophecy pointing to the resurrection—a clear link between Old and New Testament deliverance from death. Paul references this in <a href='/AIV/46/15/55'>1 Corinthians 15:55</a>, tying redemption, resurrection, and victory over death together. This passage carries deep implications about divine mercy and judgment."
    },
    {
      "pk": 1955027,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 15,
      "text": "Though he prospers among his brothers, an east wind will come, the wind of the LORD rising from the wilderness, and his spring will dry up and his fountain will be parched; he will plunder the storehouse of treasures.",
      "links": "<a href='/AIV/28/12/1'>Hosea 12:1</a>; <a href='/AIV/23/41/16'>Isaiah 41:16</a>",
      "comment": "Temporary earthly prosperity cannot withstand the coming judgment. The 'east wind' often symbolizes destructive power or invasion. Spiritually, blessings apart from fidelity to God are unsecured."
    },
    {
      "pk": 1955028,
      "translation": "AIV",
      "book": 28,
      "chapter": 13,
      "verse": 16,
      "text": "Samaria will bear her guilt, for she rebelled against her God. They will fall by the sword, their infants will be dashed to pieces, and their pregnant women ripped open.",
      "links": "<a href='/AIV/28/10/14'>Hosea 10:14</a>; <a href='/AIV/23/13/16'>Isaiah 13:16</a>",
      "comment": "A sobering depiction of the tragic consequences of rebellion. Historically fulfilled in Israel's destruction. Calls to mind both the justice and mercy revealed in the whole Scriptural witness—an invitation to respond through true worship and repentance."
    }
  ],
  "translatedAt": "2025-12-23T07:23:31.752Z"
}