{
  "book": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 7,
  "verses": [
    {
      "pk": 2009701,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 1,
      "text": "When I would heal Israel, the sin of Ephraim is revealed, and the evil deeds of Samaria. For they deal falsely; thieves break in, and robbers raid outside.",
      "links": "<a href='/AIV/23/59/2-3'>Isa. 59:2-3</a>; <a href='/AIV/28/6/1'>Hos. 6:1</a>",
      "comment": "God’s desire to heal is met with Israel’s persistent sin, showing the depth of their corruption. The imagery of thieves and robbers highlights a breakdown in faithfulness and community justice."
    },
    {
      "pk": 2009702,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 2,
      "text": "But they do not consider in their hearts that I remember all their wickedness. Now their deeds surround them; they are before My face.",
      "links": "<a href='/AIV/19/139/1-4'>Ps. 139:1-4</a>; <a href='/AIV/24/17/10'>Jer. 17:10</a>",
      "comment": "Here God exposes the self-deception of the people, who think their sins are hidden. Divine omniscience recalls that nothing is truly secret from God—a theme found throughout both Old and New Testaments."
    },
    {
      "pk": 2009703,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 3,
      "text": "With their wickedness they make the king glad, and the princes enjoy their lies.",
      "links": "<a href='/AIV/28/4/18'>Hos. 4:18</a>; <a href='/AIV/19/15/4'>Ps. 15:4</a>",
      "comment": "Rulers are corrupted, delighting in wickedness themselves, pointing to the need for true spiritual leadership. This underscores the biblical model where just authority is meant to guide the people back to righteousness."
    },
    {
      "pk": 2009704,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 4,
      "text": "They are all adulterers; they are like a heated oven whose baker ceases stirring the dough after kneading it, until it is leavened.",
      "links": "<a href='/AIV/28/4/2'>Hos. 4:2</a>; <a href='/AIV/19/106/35-39'>Ps. 106:35-39</a>",
      "comment": "Adultery is both literal and spiritual—the people have abandoned the covenant. The oven metaphor conveys their unchecked passion for sin, boiling beneath the surface."
    },
    {
      "pk": 2009705,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 5,
      "text": "On the day of our king, the princes become sick with heat from wine; he stretches out his hand with mockers.",
      "links": "<a href='/AIV/20/31/4-5'>Prov. 31:4-5</a>; <a href='/AIV/28/4/1'>Hos. 4:1</a>",
      "comment": "Leaders indulge in revelry and drunkenness, neglecting their responsibilities. This criticism of moral decay in leadership anticipates New Testament teachings on sober-mindedness and true shepherding."
    },
    {
      "pk": 2009706,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 6,
      "text": "For their hearts are like an oven as they plot—throughout the night their anger smolders; in the morning it blazes like a flaming fire.",
      "links": "<a href='/AIV/19/36/1-2'>Ps. 36:1-2</a>",
      "comment": "Sin, compared again to an overheated oven, is not an accident but a deliberate, cultivated passion. This reflects the depth of human brokenness apart from God’s grace."
    },
    {
      "pk": 2009707,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 7,
      "text": "They are all hot as an oven; they devour their rulers. All their kings have fallen. None among them calls on Me.",
      "links": "<a href='/AIV/28/13/10-11'>Hos. 13:10-11</a>; <a href='/AIV/19/14/2-3'>Ps. 14:2-3</a>",
      "comment": "Israel’s political chaos is traced to their refusal to seek God. This verse highlights both individual and communal responsibility to call upon God for deliverance."
    },
    {
      "pk": 2009708,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 8,
      "text": "Ephraim mixes himself among the peoples; Ephraim is like a flat cake not turned.",
      "links": "<a href='/AIV/28/8/8'>Hos. 8:8</a>",
      "comment": "The metaphor of an unturned cake implies a lack of completeness—Israel assimilates with nations, losing distinctiveness. The danger of spiritual compromise and neglect is exposed here."
    },
    {
      "pk": 2009709,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 9,
      "text": "Strangers have devoured his strength, but he does not know it. Gray hairs are sprinkled on him, but he does not notice.",
      "links": "<a href='/AIV/28/8/7'>Hos. 8:7</a>; <a href='/AIV/19/103/5'>Ps. 103:5</a>",
      "comment": "Israel is unaware of its diminishing strength—signs of decline are ignored, warning against spiritual blindness. There is a call here for discernment and self-examination."
    },
    {
      "pk": 2009710,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 10,
      "text": "The pride of Israel testifies against him; yet they do not return to the LORD their God, nor seek Him for all this.",
      "links": "<a href='/AIV/28/5/5'>Hos. 5:5</a>; <a href='/AIV/24/3/12-14'>Jer. 3:12-14</a>",
      "comment": "Despite suffering, Israel’s pride prevents repentance. The necessity of humble return to God echoes throughout scripture, central to true spiritual renewal and reconciliation."
    },
    {
      "pk": 2009711,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 11,
      "text": "Ephraim is like a silly dove, without sense; they call to Egypt, they go to Assyria.",
      "links": "<a href='/AIV/28/11/11'>Hos. 11:11</a>; <a href='/AIV/23/31/1'>Isa. 31:1</a>",
      "comment": "Israel’s reliance on foreign powers rather than on God is likened to a foolish bird. True security comes from fidelity, not political maneuvering—this points to the biblical vision of covenant loyalty."
    },
    {
      "pk": 2009712,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 12,
      "text": "As they go, I will spread My net over them; I will bring them down like birds of the sky. I will discipline them according to what was reported to their congregation.",
      "links": "<a href='/AIV/28/8/1'>Hos. 8:1</a>; <a href='/AIV/19/140/5'>Ps. 140:5</a>",
      "comment": "The image of the net conveys divine justice, yet discipline is described as remedial, pointing to God’s intent to draw the people back into union with Himself—anticipating spiritual restoration."
    },
    {
      "pk": 2009713,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 13,
      "text": "Woe to them, for they have strayed from Me! Destruction to them, for they have rebelled against Me! I would redeem them, but they speak lies against Me.",
      "links": "<a href='/AIV/28/13/14'>Hos. 13:14</a>; <a href='/AIV/19/78/35-37'>Ps. 78:35-37</a>",
      "comment": "God’s desire to redeem is frustrated by persistent rebellion. This anticipates later doctrines of redemption fulfilled in Christ (see <a href='/AIV/45/3/24'>Rom. 3:24</a>), showing both divine justice and mercy."
    },
    {
      "pk": 2009714,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 14,
      "text": "They do not cry to Me from their hearts, but wail on their beds; for grain and new wine they gather themselves, but they turn away from Me.",
      "links": "<a href='/AIV/28/9/4'>Hos. 9:4</a>; <a href='/AIV/19/78/34-37'>Ps. 78:34-37</a>",
      "comment": "The lack of genuine prayer and repentance is portrayed—ritual without relationship. Hosea stresses the importance of true, heartfelt devotion over mere outward displays."
    },
    {
      "pk": 2009715,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 15,
      "text": "Though I trained and strengthened their arms, yet they devise evil against Me.",
      "links": "<a href='/AIV/19/18/34'>Ps. 18:34</a>; <a href='/AIV/05/32/15'>Deut. 32:15</a>",
      "comment": "God’s provision is repaid with betrayal. The historical pattern of God’s faithfulness and human rebellion is consistent throughout scripture, calling for deeper conversion."
    },
    {
      "pk": 2009716,
      "translation": "AIV",
      "book": 28,
      "chapter": 7,
      "verse": 16,
      "text": "They turn, but not upward; they are like a slack bow. Their princes shall fall by the sword because of their insolent tongue. This will be their mockery in the land of Egypt.",
      "links": "<a href='/AIV/19/78/57'>Ps. 78:57</a>; <a href='/AIV/28/9/6'>Hos. 9:6</a>",
      "comment": "Turning, but not to God—misguided repentance leads to ruin. The slack bow metaphor: effort without direction or purpose. The warning is to seek true reconciliation with God, through humble submission."
    }
  ],
  "translatedAt": "2025-12-23T07:21:40.144Z"
}