{
  "book": 35,
  "bookName": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 7,
  "verses": [
    {
      "pk": 35007001,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 1,
      "text": "When I would heal Israel, the iniquity of Ephraim is revealed, and the evil deeds of Samaria; for they practice deceit, and thieves break in, and bandits raid outside.",
      "links": "<a href='/AIV/23/1/6'>Isa. 1:6</a>; <a href='/AIV/28/6/4'>Hos. 6:4</a>",
      "comment": "God’s desire to heal Israel exposes their sin even further. The reference to Ephraim and Samaria shows that the whole northern kingdom is involved in these sins, both publicly and secretly. Healing here implies both physical and spiritual restoration, pointing to the promises fulfilled in Christ (see Matt. 9:12-13)."
    },
    {
      "pk": 35007002,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 2,
      "text": "But they do not consider in their hearts that I remember all their evil. Now their deeds surround them; they are right before my face.",
      "links": "<a href='/AIV/19/90/8'>Ps. 90:8</a>; <a href='/AIV/24/2/22'>Jer. 2:22</a>",
      "comment": "The Israelites fail to realize that God sees and remembers all wicked actions. This phrase 'before my face' underscores God’s omniscience. The heart’s disposition is critical—Israel’s disregard for God’s remembrance reveals their need for inner conversion (cf. Heb. 4:13)."
    },
    {
      "pk": 35007003,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 3,
      "text": "They make the king glad with their wickedness, and the princes with their lies.",
      "links": "<a href='/AIV/19/52/3'>Ps. 52:3</a>; <a href='/AIV/20/29/12'>Prov. 29:12</a>",
      "comment": "Israel’s leaders are not only tolerant of sin but take pleasure in it. This shows how corruption can reach every level of a nation. Leaders must be true shepherds, guided by truth, not lies (cf. John 10:11)."
    },
    {
      "pk": 35007004,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 4,
      "text": "They are all adulterers; they burn with passion like an oven heated by a baker who stops stirring the fire from the kneading of the dough until it is leavened.",
      "links": "<a href='/AIV/28/4/13'>Hos. 4:13-14</a>; <a href='/AIV/46/5/6'>1 Cor. 5:6</a>",
      "comment": "The image of the oven portrays unchecked sinful desire. Adultery here has both literal and spiritual implications—Israel’s unfaithfulness to the Lord. The yeast metaphor also recalls how a little leaven affects the whole (cf. Matt. 16:6, 1 Cor. 5:6), pointing to the far-reaching consequences of sin."
    },
    {
      "pk": 35007005,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 5,
      "text": "On the day of our king, the officials become sick with the heat of wine; he stretches out his hand with those who mock.",
      "links": "<a href='/AIV/20/23/29-30'>Prov. 23:29-30</a>; <a href='/AIV/19/1/1'>Ps. 1:1</a>",
      "comment": "The king’s day—likely his birthday—should be a time of solemnity, but it becomes an excuse for drunkenness and revelry among leaders. Associating with mockers, their hearts are further hardened. This contrasts with the value placed on temperance and sober-minded leadership (cf. 1 Tim. 3:2-3)."
    },
    {
      "pk": 35007006,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 6,
      "text": "For with their hearts like an oven they plot their schemes; their anger smolders all night, in the morning it blazes like a flaming fire.",
      "links": "<a href='/AIV/19/36/1-4'>Ps. 36:1-4</a>; <a href='/AIV/28/4/8'>Hos. 4:8</a>",
      "comment": "Sinful desire is internal and continuous, not accidental. The progression from hidden intent to open sin mirrors the pattern laid out in James 1:14-15. The heart's continual plotting shows the need for God’s grace and interior renewal (cf. Ezek. 36:26-27)."
    },
    {
      "pk": 35007007,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 7,
      "text": "All of them are hot as an oven, and they devour their rulers. All their kings have fallen, and none among them calls on me.",
      "links": "<a href='/AIV/28/8/4'>Hos. 8:4</a>; <a href='/AIV/12/15/8-10'>2 Kings 15:8-10</a>",
      "comment": "Political instability—kings falling, rulers devoured—results from spiritual decline. Calling out to God is the solution, yet Israel remains self-reliant. Reliance on God, through prayer and worship, is essential for restoration (see 2 Chron. 7:14)."
    },
    {
      "pk": 35007008,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 8,
      "text": "Ephraim mixes himself among the peoples; Ephraim is a flat cake not turned over.",
      "links": "<a href='/AIV/28/5/13'>Hos. 5:13</a>; <a href='/AIV/19/106/35'>Ps. 106:35</a>",
      "comment": "‘Mixing with the peoples’ indicates syncretism—Israel absorbs pagan practices. The image of a half-baked cake shows incompleteness and lack of discernment. God’s people are called to be set apart, not conformed to the world (Romans 12:2)."
    },
    {
      "pk": 35007009,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 9,
      "text": "Strangers devour his strength, yet he does not realize it; even gray hair is sprinkled on him, but he does not notice.",
      "links": "<a href='/AIV/28/5/12'>Hos. 5:12</a>; <a href='/AIV/07/16/20'>Judg. 16:20</a>",
      "comment": "Israel’s strength is diminished from within and without. Like Samson not knowing the Lord had left him, Israel is blind to their decline. Spiritual lethargy is deadly; this subtly points to the need for tradition and living faith—not just outward practices (see Rev. 3:1-3)."
    },
    {
      "pk": 35007010,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 10,
      "text": "The pride of Israel testifies against him; yet they do not return to the LORD their God, nor seek him for all this.",
      "links": "<a href='/AIV/28/5/5'>Hos. 5:5</a>; <a href='/AIV/19/10/4'>Ps. 10:4</a>",
      "comment": "Persistent pride prevents repentance. This verse underlines the call to constant turning back to God—a pattern lived out in the life of the saints. True humility is fundamental for spiritual renewal."
    },
    {
      "pk": 35007011,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 11,
      "text": "Ephraim is like a dove, easily deceived and without understanding; they call to Egypt, they go to Assyria.",
      "links": "<a href='/AIV/19/74/19'>Ps. 74:19</a>; <a href='/AIV/28/12/1'>Hos. 12:1</a>",
      "comment": "Israel's reliance on foreign powers, instead of God, shows misplaced trust. The dove represents foolishness, not innocence here. God desires his people to trust in Him alone, prefiguring Christian life grounded in faith. (See Isa. 30:1-3; referenced often by Christ for spiritual wisdom.)"
    },
    {
      "pk": 35007012,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 12,
      "text": "Even as they go, I will spread my net over them; I will bring them down like birds of the sky. I will punish them in accordance with what their assembly has heard.",
      "links": "<a href='/AIV/19/140/9-10'>Ps. 140:9-10</a>; <a href='/AIV/28/8/1'>Hos. 8:1</a>",
      "comment": "God’s discipline is compared to a net catching birds, showing that there is no escape from divine justice. The assembly alludes to the people gathered for worship or council—reminding readers that hearing God’s word brings responsibility (see Matt. 13:47-50)."
    },
    {
      "pk": 35007013,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 13,
      "text": "Woe to them, for they have strayed from me! Destruction to them, for they have rebelled against me! Though I would redeem them, they speak lies against me.",
      "links": "<a href='/AIV/28/11/7-9'>Hos. 11:7-9</a>; <a href='/AIV/19/81/15'>Ps. 81:15</a>",
      "comment": "God’s grief is clear: He desires to redeem, but Israel’s response is rebellion and lies. The concept of redemption points forward to Christ’s work on the cross, which fulfills all God’s promises of deliverance (cf. Gal. 3:13)."
    },
    {
      "pk": 35007014,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 14,
      "text": "They do not cry to me from their hearts, but wail upon their beds; for grain and new wine they gash themselves; they turn away from me.",
      "links": "<a href='/AIV/12/18/28'>1 Kings 18:28</a>; <a href='/AIV/19/78/34-36'>Ps. 78:34-36</a>",
      "comment": "Superficial displays of sorrow (‘wailing, gashing’) are not genuine repentance. This mirrors pagan practices and shows the difference between ritual and heartfelt prayer. Authentic relationship with God involves inward conversion (see Joel 2:12-13)."
    },
    {
      "pk": 35007015,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 15,
      "text": "Though I disciplined and strengthened their arms, yet they devise evil against me.",
      "links": "<a href='/AIV/05/8/5'>Deut. 8:5</a>; <a href='/AIV/58/12/5-8'>Heb. 12:5-8</a>",
      "comment": "Chastisement and blessings from God are meant to draw us to fidelity, not further rebellion. This verse highlights the connection between God’s loving discipline and His desire for our sanctification."
    },
    {
      "pk": 35007016,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 7,
      "verse": 16,
      "text": "They turn, but not upward; they are like a treacherous bow. Their leaders will fall by the sword because of the insolence of their tongues; this will be their mockery in the land of Egypt.",
      "links": "<a href='/AIV/19/78/57'>Ps. 78:57</a>; <a href='/AIV/28/9/3'>Hos. 9:3</a>",
      "comment": "Israel’s attempts at repentance are not directed toward God—‘not upward’—making their actions fruitless. Like a warped weapon, they are unreliable. Leadership failure due to unrepentant hearts and haughty speech is a recurring theme. Following God as the source of unity and guidance safeguards against such ruin (cf. John 17:21)."
    }
  ],
  "translatedAt": "2025-12-24T09:37:18.409Z"
}