{
  "book": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 1,
  "verses": [
    {
      "pk": 1932101,
      "translation": "AIV",
      "book": 28,
      "chapter": 1,
      "verse": 1,
      "text": "The word of the LORD came to Hosea, the son of Beeri, during the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah, and during the days of Jeroboam, son of Joash, king of Israel.",
      "links": "<a href='/AIV/23/1/1'>Isaiah 1:1</a>; <a href='/AIV/12/15/1-12'>2 Kings 15:1-12</a>",
      "comment": "Introduces Hosea’s prophetic call and sets the historical context. The naming of kings emphasizes both the southern (Judah) and northern (Israel) kingdoms, showing Hosea’s message was relevant to all God's people."
    },
    {
      "pk": 1932102,
      "translation": "AIV",
      "book": 28,
      "chapter": 1,
      "verse": 2,
      "text": "When the LORD first spoke through Hosea, the LORD said to him, 'Go, take for yourself a wife of whoredom and have children of whoredom, for the land commits great whoredom by forsaking the LORD.'",
      "links": "<a href='/AIV/23/1/21'>Isaiah 1:21</a>; <a href='/AIV/24/3/1'>Jeremiah 3:1</a>",
      "comment": "God’s command uses strong language to highlight Israel’s spiritual adultery. This physical union is a living symbol of Israel’s relationship with God, anticipating New Testament themes of Christ’s union with His Church (<a href='/AIV/49/5/25-27'>Ephesians 5:25-27</a>)."
    },
    {
      "pk": 1932103,
      "translation": "AIV",
      "book": 28,
      "chapter": 1,
      "verse": 3,
      "text": "So he went and took Gomer, daughter of Diblaim, and she conceived and bore him a son.",
      "links": "<a href='/AIV/23/8/3'>Isaiah 8:3</a>; <a href='/AIV/12/6/27'>2 Kings 6:27</a>",
      "comment": "Hosea’s obedience is direct and complete. His marriage to Gomer shows God's faithful love even in the face of persistent sin. The names introduced in subsequent verses will carry prophetic meaning."
    },
    {
      "pk": 1932104,
      "translation": "AIV",
      "book": 28,
      "chapter": 1,
      "verse": 4,
      "text": "And the LORD said to him, 'Name him Jezreel, for in a little while I will punish the house of Jehu for the bloodshed at Jezreel, and I will put an end to the kingdom of the house of Israel.'",
      "links": "<a href='/AIV/12/10/11'>2 Kings 10:11</a>; <a href='/AIV/24/30/11'>Jeremiah 30:11</a>",
      "comment": "Jezreel means 'God sows.' The prophecy promises coming judgment for past violence, yet also hints at restoration, echoing biblical patterns of punishment followed by mercy (<a href='/AIV/19/103/8-12'>Psalm 103:8-12</a>)."
    },
    {
      "pk": 1932105,
      "translation": "AIV",
      "book": 28,
      "chapter": 1,
      "verse": 5,
      "text": "On that day I will break the bow of Israel in the valley of Jezreel.",
      "links": "<a href='/AIV/26/39/3'>Ezekiel 39:3</a>",
      "comment": "Breaking the bow symbolizes God removing Israel's military strength. Hosea’s audience would understand this as impending defeat and loss of autonomy. This sets the stage for God’s greater work of restoration."
    },
    {
      "pk": 1932106,
      "translation": "AIV",
      "book": 28,
      "chapter": 1,
      "verse": 6,
      "text": "She conceived again and bore a daughter. And he said to him, 'Name her Lo-Ruhamah, for I will no longer have compassion on the house of Israel, that I should utterly forgive them.'",
      "links": "<a href='/AIV/23/40/2'>Isaiah 40:2</a>; <a href='/AIV/24/15/6'>Jeremiah 15:6</a>",
      "comment": "Lo-Ruhamah means 'Not pitied.' The withdrawal of compassion signals the seriousness of Israel's rebellion, yet always within the context of God’s desire to restore. The naming of children as prophecy foreshadows Christ’s own manifestation as a sign to Israel (<a href='/AIV/42/2/34'>Luke 2:34</a>)."
    },
    {
      "pk": 1932107,
      "translation": "AIV",
      "book": 28,
      "chapter": 1,
      "verse": 7,
      "text": "But I will have compassion on the house of Judah, and I will save them by the LORD their God, not by bow, sword, or war, nor by horses or horsemen.",
      "links": "<a href='/AIV/23/37/36'>Isaiah 37:36</a>; <a href='/AIV/19/33/16-17'>Psalm 33:16-17</a>",
      "comment": "In contrast to Israel, Judah receives mercy and salvation through God's direct intervention, not human might. This foreshadows the spiritual means by which God saves His people, anticipating themes of grace fulfilled in Christ."
    },
    {
      "pk": 1932108,
      "translation": "AIV",
      "book": 28,
      "chapter": 1,
      "verse": 8,
      "text": "After she had weaned Lo-Ruhamah, she conceived and bore a son.",
      "links": "<a href='/AIV/23/8/3'>Isaiah 8:3</a>",
      "comment": "The pattern of conception and naming underscores God’s ongoing communication through family and generations. It also gestures toward God’s work in history through chosen individuals and their descendants."
    },
    {
      "pk": 1932109,
      "translation": "AIV",
      "book": 28,
      "chapter": 1,
      "verse": 9,
      "text": "And the LORD said, 'Name him Lo-Ammi, for you are not my people, and I am not your God.'",
      "links": "<a href='/AIV/19/43/2'>Psalm 43:2</a>; <a href='/AIV/45/9/25-26'>Romans 9:25-26</a>",
      "comment": "Lo-Ammi means 'Not my people.' Here God declares a temporary cessation of covenant relationship—a severe warning, yet Romans 9:25-26 uses this passage to show how Gentiles are later included as God’s people through Christ, anticipating the unity and universality of God’s family."
    },
    {
      "pk": 1932110,
      "translation": "AIV",
      "book": 28,
      "chapter": 1,
      "verse": 10,
      "text": "Yet the number of the children of Israel shall be like the sand of the sea, which cannot be measured or counted. And in the place where it was said to them, 'You are not my people,' it shall be said to them, 'Children of the living God.'",
      "links": "<a href='/AIV/44/13/46-48'>Acts 13:46-48</a>; <a href='/AIV/1/22/17'>Genesis 22:17</a>; <a href='/AIV/45/9/25-26'>Romans 9:25-26</a>",
      "comment": "God promises a reversal and restoration, echoing His covenant to Abraham. This has clear christological implications, as Paul interprets it as fulfilled in the inclusion of all believers in God’s family—Jew and Gentile alike (<a href='/AIV/45/11/17-24'>Romans 11:17-24</a>)."
    },
    {
      "pk": 1932111,
      "translation": "AIV",
      "book": 28,
      "chapter": 1,
      "verse": 11,
      "text": "And the children of Judah and the children of Israel shall be gathered together and appoint one leader for themselves, and they shall go up from the land, for great shall be the day of Jezreel.",
      "links": "<a href='/AIV/26/37/22'>Ezekiel 37:22</a>; <a href='/AIV/60/2/10'>1 Peter 2:10</a>",
      "comment": "This looks ahead to future unity under a single leader, a spiritual and messianic prophecy fulfilled in Christ. The 'day of Jezreel' points both to judgment and to the new sowing—God’s restoration of His people into one holy, apostolic family. This unity and gathering foreshadow the universal church founded and shepherded by Christ and His appointed leaders."
    }
  ],
  "translatedAt": "2025-12-23T07:19:25.288Z"
}