{
  "book": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 3,
  "verses": [
    {
      "pk": 2603001,
      "translation": "AIV",
      "book": 28,
      "chapter": 3,
      "verse": 1,
      "text": "Then the LORD said to me, “Go again, love a woman who is loved by another and is an adulteress, just as the LORD loves the people of Israel, though they turn to other gods and love cakes of raisins.”",
      "links": "<a href='/AIV/28/1/2-3'>Hos. 1:2–3</a>; <a href='/AIV/5/7/8'>Deut. 7:8</a>; <a href='/AIV/24/3/1'>Jer. 3:1</a>",
      "comment": "God commands Hosea to express his love for an unfaithful woman as a living sign—mirroring the LORD’s unwavering love for Israel, who betrays Him by worshiping idols. Raisin cakes were likely used in pagan rituals (cf. 2 Sam. 6:19; Jer. 7:18). Hosea’s actions serve as a prophetic sign both literally and spiritually, foreshadowing Christ’s sacrificial, merciful love for His unfaithful people (cf. John 3:16, Rom. 5:8)."
    },
    {
      "pk": 2603002,
      "translation": "AIV",
      "book": 28,
      "chapter": 3,
      "verse": 2,
      "text": "So I bought her for myself for fifteen pieces of silver and a homer and a half of barley.",
      "links": "<a href='/AIV/2/21/32'>Ex. 21:32</a>; <a href='/AIV/3/27/16'>Lev. 27:16'>Lev. 27:16</a>",
      "comment": "Hosea’s purchase of his wife symbolizes the price of redemption, hinting at the theme of ransom or buying back (cf. Ex. 21:32). This act prefigures the ultimate redemption achieved by Christ, who ransoms humanity at a great price (cf. 1 Pet. 1:18-19). Spiritually, believers are reminded that true restoration often involves sacrificial action, not mere words."
    },
    {
      "pk": 2603003,
      "translation": "AIV",
      "book": 28,
      "chapter": 3,
      "verse": 3,
      "text": "And I said to her, “You must live with me for many days; you shall not play the prostitute, and you shall not be with another man, so I also will be with you.”",
      "links": "<a href='/AIV/28/2/2-3'>Hos. 2:2–3</a>; <a href='/AIV/24/3/1'>Jer. 3:1</a>",
      "comment": "Hosea’s demand for faithfulness reflects God’s desire for Israel’s exclusive devotion. This period of separation echoes the purification and preparation motifs in Scripture (see Ezekiel 36:25–27). The mutual commitment—'I also will be with you'—foreshadows the closeness of Christ with His Church, who is called to be set apart (cf. Eph. 5:25-27)."
    },
    {
      "pk": 2603004,
      "translation": "AIV",
      "book": 28,
      "chapter": 3,
      "verse": 4,
      "text": "For the children of Israel will live for many days without king, without prince, without sacrifice or pillar, without ephod or household idols.",
      "links": "<a href='/AIV/28/10/3'>Hos. 10:3</a>; <a href='/AIV/23/3/6'>Isa. 3:6</a>; <a href='/AIV/9/6/14'>Judg. 6:14</a>",
      "comment": "This prophecy foretells a time of deprivation and purification—Israel without ruler, worship, or idolatry. Historically, this may point to the exile and the loss of temple worship. Spiritually, it reflects a time of longing and anticipation for restoration, which is ultimately fulfilled in the coming of the Messiah who reestablishes the true priesthood and kingship in Himself (cf. Heb. 7:23-27; Luke 1:32-33)."
    },
    {
      "pk": 2603005,
      "translation": "AIV",
      "book": 28,
      "chapter": 3,
      "verse": 5,
      "text": "Afterward, the children of Israel will return and seek the LORD their God and David their king. They will come trembling to the LORD and to His goodness in the latter days.",
      "links": "<a href='/AIV/24/30/9'>Jer. 30:9</a>; <a href='/AIV/26/34/23-24'>Ezek. 34:23–24</a>; <a href='/AIV/44/15/16-17'>Acts 15:16–17</a>",
      "comment": "The prophecy concludes with hope: Israel turning back to the LORD and 'David their king.' Here 'David' alludes to the Messiah, who descends from David (see Jer. 30:9; Ezek. 34:23–24). This spiritual and literal fulfillment is found in Jesus Christ, who establishes the everlasting kingdom. The ‘latter days’ points to a future time of restoration, reconciliation, and abundant grace. For believers, this foreshadows Christ’s role as the one, true shepherd-king, and anticipates the full gathering and unification of all God’s people under a visible, divinely instituted leadership—one faith, one shepherd (cf. John 10:16)."
    }
  ],
  "translatedAt": "2025-12-23T07:20:08.755Z"
}