{
  "book": 35,
  "bookName": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 12,
  "verses": [
    {
      "pk": 35012001,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 1,
      "text": "Ephraim feeds on wind and pursues the east wind all day long; he multiplies lies and violence. He makes a covenant with Assyria, and carries oil to Egypt.",
      "links": "<a href='/AIV/28/5/13'>Hos. 5:13</a>; <a href='/AIV/28/7/11'>Hos. 7:11</a>; <a href='/AIV/24/2/36-37'>Jer. 2:36-37</a>",
      "comment": "Hosea uses wind as a metaphor for the emptiness and futility of Israel’s reliance on foreign alliances, showing their lack of trust in God alone for salvation. The literal pursuit of Assyria and Egypt connects to the spiritual pursuit of other sources of security, drawing parallels with later warnings about turning from Christ as the true source of life."
    },
    {
      "pk": 35012002,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 2,
      "text": "The LORD also has a dispute with Judah, and will punish Jacob according to his ways; he will repay him for what he has done.",
      "links": "<a href='/AIV/23/3/13'>Isa. 3:13</a>; <a href='/AIV/28/4/1'>Hos. 4:1</a>",
      "comment": "Both Israel (Ephraim) and Judah are accountable to God. 'Jacob' is used collectively for the nation, emphasizing corporate identity and the principle of reaping what is sown—a theme echoed by Paul in Galatians 6:7."
    },
    {
      "pk": 35012003,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 3,
      "text": "In the womb he grasped his brother’s heel, and in his strength he struggled with God.",
      "links": "<a href='/AIV/01/25/26'>Gen. 25:26</a>; <a href='/AIV/01/32/24-28'>Gen. 32:24-28</a>",
      "comment": "Refers to the birth of Jacob and his wrestling with God, connecting Israel’s physical ancestor’s striving with God to their own spiritual struggles. Early Christian writers saw Jacob as a figure of perseverance in seeking divine blessing, prefiguring Christ’s victory through apparent weakness."
    },
    {
      "pk": 35012004,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 4,
      "text": "He wrestled with the angel and prevailed; he wept and sought his favor. He found him at Bethel, and there God spoke with us—",
      "links": "<a href='/AIV/01/32/24-30'>Gen. 32:24-30</a>; <a href='/AIV/01/35/1-7'>Gen. 35:1-7</a>",
      "comment": "Jacob's victory in wrestling is seen not in physical power but in humility and supplication—'he wept and sought his favor.' The encounter at Bethel is a key moment of revelation, anticipating later instances where God’s people receive new names and missions. See also parallels with Moses and the burning bush (Ex. 3)."
    },
    {
      "pk": 35012005,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 5,
      "text": "the LORD, the God of armies, the LORD is his name.",
      "links": "<a href='/AIV/02/03/14-15'>Ex. 3:14-15</a>; <a href='/AIV/19/46/7'>Ps. 46:7</a>",
      "comment": "‘LORD’ (YHWH) ties back to the divine self-revelation to Moses, and the title ‘God of armies’ (hosts) reveals God's power. The stress on His name shows the importance of right worship, and the continuity of God's action from Jacob's time to the present."
    },
    {
      "pk": 35012006,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 6,
      "text": "Therefore, return to your God; hold fast to faithful love and justice, and wait continually for your God.",
      "links": "<a href='/AIV/28/6/6'>Hos. 6:6</a>; <a href='/AIV/33/6/8'>Mic. 6:8</a>",
      "comment": "The call to 'faithful love and justice' resonates with commands to moral and liturgical fidelity. The order to 'wait continually' anticipates later teachings on patient hope in salvation, central to the virtuous Christian life grounded in both faith and works (Jas. 2:24)."
    },
    {
      "pk": 35012007,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 7,
      "text": "A merchant, whose scales are deceitful, loves to oppress.",
      "links": "<a href='/AIV/28/12/8'>Hos. 12:8</a>; <a href='/AIV/03/19/35-36'>Lev. 19:35-36</a>",
      "comment": "Business dishonesty is cast as a moral failure, paralleling warnings against injustice in other prophetic books. The accusation links economic sin with spiritual unfaithfulness, echoing Christ’s concern for interior conversion (Mt. 6:24)."
    },
    {
      "pk": 35012008,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 8,
      "text": "Ephraim says, “I have become rich; I have found wealth for myself. In all my labor they will find in me no iniquity that is sin.”",
      "links": "<a href='/AIV/05/08/17'>Deut. 8:17</a>; <a href='/AIV/28/13/6'>Hos. 13:6</a>",
      "comment": "Ephraim's pride reflects trust in material wealth rather than God, echoing warnings about self-justification and blindness to sin. Jesus’ teaching about the deceitfulness of riches (Mk. 10:23-25) is anticipated here."
    },
    {
      "pk": 35012009,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 9,
      "text": "But I am the LORD your God from the land of Egypt; I will again make you dwell in tents, as in the days of the appointed feast.",
      "links": "<a href='/AIV/03/23/42-43'>Lev. 23:42-43</a>; <a href='/AIV/28/13/4'>Hos. 13:4</a>",
      "comment": "Here God recalls Israel’s origins, connecting worship and communal identity to their liberation from Egypt. The 'appointed feast' alludes to the Feast of Tabernacles, suggesting a return to foundational worship and dependence upon God—a model for liturgical remembrance involving both past and present."
    },
    {
      "pk": 35012010,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 10,
      "text": "I have spoken to the prophets, and I have multiplied visions; through the prophets I gave parables.",
      "links": "<a href='/AIV/04/12/6'>Num. 12:6</a>; <a href='/AIV/19/78/2'>Ps. 78:2</a>; <a href='/AIV/40/13/34-35'>Mt. 13:34-35</a>",
      "comment": "God’s use of prophets and parables foreshadows Christ’s ministry, especially his teaching in parables (Mt. 13:35 fulfills Ps. 78:2). This verse teaches that God’s revelation is deep, layered, and mediated through chosen agents whose authority is divinely given."
    },
    {
      "pk": 35012011,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 11,
      "text": "Is Gilead wicked? Surely, they are vanity. In Gilgal they sacrifice bulls—yes, their altars are like stone heaps along the furrows of the field.",
      "links": "<a href='/AIV/28/06/8'>Hos. 6:8</a>; <a href='/AIV/24/11/13'>Jer. 11:13</a>",
      "comment": "Exposes the emptiness of ritual sacrifice without heartfelt obedience, a theme fulfilled when Christ abolished the old sacrifices through his own sacrifice (Heb. 10:10-14). The multiplication of altars illustrates the danger of unauthorized worship forms."
    },
    {
      "pk": 35012012,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 12,
      "text": "Jacob fled to the land of Aram; Israel served for a wife, and for a wife he guarded sheep.",
      "links": "<a href='/AIV/01/28/5'>Gen. 28:5</a>; <a href='/AIV/01/29/20'>Gen. 29:20</a>",
      "comment": "This recalls Jacob’s humble service—a reminder of God’s blessing through patient endurance and obedience. Such humility finds fulfillment in Christ’s own humble service and total gift of self (Phil. 2:6-8)."
    },
    {
      "pk": 35012013,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 13,
      "text": "By a prophet the LORD brought Israel up from Egypt, and by a prophet he was guarded.",
      "links": "<a href='/AIV/02/12/50-51'>Ex. 12:50-51</a>; <a href='/AIV/05/34/10'>Deut. 34:10</a>",
      "comment": "Alludes to Moses as the mediator of Israel's deliverance. Prefigures Christ, the final prophet and deliverer, who brings the new exodus and guards his people through established leadership."
    },
    {
      "pk": 35012014,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 12,
      "verse": 14,
      "text": "Ephraim has bitterly provoked anger, so his Lord will leave his bloodguilt on him, and will repay him for his contempt.",
      "links": "<a href='/AIV/28/09/7'>Hos. 9:7</a>; <a href='/AIV/24/2/19'>Jer. 2:19</a>",
      "comment": "Judgment comes from persistent rebellion. The withholding of grace due to obstinacy is a warning, highlighting the need for repentance and trust in God's appointed means of reconciliation. This anticipates New Testament teachings about divine discipline (Heb. 12:5-11), and the ongoing consequence of unrepented sin."
    }
  ],
  "translatedAt": "2025-12-24T09:39:19.902Z"
}