{
  "book": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 11,
  "verses": [
    {
      "pk": 4201101,
      "translation": "AIV",
      "book": 28,
      "chapter": 11,
      "verse": 1,
      "text": "When Israel was a child, I loved him, and out of Egypt I called My son.",
      "links": "<a href='/AIV/2/4/22-23'>Ex. 4:22–23</a>; <a href='/AIV/40/2/15'>Matt. 2:15</a>",
      "comment": "This verse is famously referenced in Matthew 2:15, revealing a dual meaning: God’s love for Israel as His 'son' in the Exodus, and its prophetic fulfillment in Jesus Christ. Matthew identifies Jesus as the true Son called out of Egypt, indicating typology between Israel and Christ."
    },
    {
      "pk": 4201102,
      "translation": "AIV",
      "book": 28,
      "chapter": 11,
      "verse": 2,
      "text": "The more I called them, the more they went away; they sacrificed to the Baals and burned offerings to carved images.",
      "links": "<a href='/AIV/7/2/11-13'>Judg. 2:11–13</a>; <a href='/AIV/13/28/23'>2 Chr. 28:23</a>",
      "comment": "Though God called Israel to Himself, they continually strayed. This verse makes clear the close connection between calling and response—and how idolatry breaks covenant faithfulness."
    },
    {
      "pk": 4201103,
      "translation": "AIV",
      "book": 28,
      "chapter": 11,
      "verse": 3,
      "text": "Yet it was I who taught Ephraim to walk; I took them in My arms, but they did not know that I healed them.",
      "links": "<a href='/AIV/5/8/2'>Deut. 8:2</a>; <a href='/AIV/19/103/3'>Ps. 103:3</a>",
      "comment": "The image of teaching a child to walk is both gentle and personal, reflecting God’s intimate care—a deeper level of covenantal grace and healing, which often goes unrecognized until later."
    },
    {
      "pk": 4201104,
      "translation": "AIV",
      "book": 28,
      "chapter": 11,
      "verse": 4,
      "text": "I led them with cords of kindness, with bands of love. And I became to them like one who eases the yoke on their jaws, and I bent down and fed them.",
      "links": "<a href='/AIV/2/16/4'>Ex. 16:4</a>; <a href='/AIV/19/23/1'>Ps. 23:1–2</a>",
      "comment": "The Lord’s leading is gentle, not harsh—illustrated by ‘cords of kindness’. The yoke reference recalls Mosaic law and the liberation from heavy burdens (see Matthew 11:29-30), prefiguring Jesus’ gentle shepherding."
    },
    {
      "pk": 4201105,
      "translation": "AIV",
      "book": 28,
      "chapter": 11,
      "verse": 5,
      "text": "They shall not return to the land of Egypt, but Assyria shall be their king, because they refused to return to Me.",
      "links": "<a href='/AIV/12/17/6'>2 Kings 17:6</a>",
      "comment": "God warns that Israel’s rejection results in exile under Assyria—a just consequence for their refusal to return. This marks a pattern: bondage follows rebellion, but freedom follows return to God."
    },
    {
      "pk": 4201106,
      "translation": "AIV",
      "book": 28,
      "chapter": 11,
      "verse": 6,
      "text": "The sword shall rage against their cities, consume their bars, and devour them because of their own counsels.",
      "links": "<a href='/AIV/23/1/20'>Isa. 1:20</a>",
      "comment": "Israel’s own plans, rooted in self-will, bring destruction. Worldly wisdom without God leads to ruin—a perennial call for spiritual obedience over self-reliance."
    },
    {
      "pk": 4201107,
      "translation": "AIV",
      "book": 28,
      "chapter": 11,
      "verse": 7,
      "text": "My people are bent on turning away from Me. Though they call out to the Most High, He shall not lift them up at all.",
      "links": "<a href='/AIV/23/29/13'>Isa. 29:13</a>; <a href='/AIV/19/18/41'>Ps. 18:41</a>",
      "comment": "Outward forms of worship without true repentance leave prayers unanswered—an important warning concerning authentic spiritual conversion and reliance on the Lord over mere external practices."
    },
    {
      "pk": 4201108,
      "translation": "AIV",
      "book": 28,
      "chapter": 11,
      "verse": 8,
      "text": "How can I give you up, O Ephraim? How can I hand you over, O Israel? How can I treat you like Admah? How can I make you like Zeboiim? My heart is turned within Me; My compassion grows warm and tender.",
      "links": "<a href='/AIV/1/19/24-25'>Gen. 19:24–25</a>; <a href='/AIV/19/25/6'>Ps. 25:6</a>",
      "comment": "God’s justice is strong, but His mercy prevails. Admah and Zeboiim were destroyed with Sodom, yet God’s love for Israel holds Him back—a glimpse of divine mercy prevailing over justice (cf. James 2:13)."
    },
    {
      "pk": 4201109,
      "translation": "AIV",
      "book": 28,
      "chapter": 11,
      "verse": 9,
      "text": "I will not execute My fierce anger; I will not again destroy Ephraim, for I am God and not a man, the Holy One in your midst, and I will not come in wrath.",
      "links": "<a href='/AIV/3/13/13'>Lev. 13:13</a>; <a href='/AIV/23/12/1-2'>Isa. 12:1–2</a>",
      "comment": "Here, God’s holiness is transcendent, paired with tender mercy. His presence ‘in the midst’ points to the intimate dwelling with His people, prefiguring the Incarnation of Christ."
    },
    {
      "pk": 4201110,
      "translation": "AIV",
      "book": 28,
      "chapter": 11,
      "verse": 10,
      "text": "They shall go after the Lord; He will roar like a lion, and when He roars, His children shall come trembling from the west.",
      "links": "<a href='/AIV/28/3/5'>Hos. 3:5</a>; <a href='/AIV/23/27/13'>Isa. 27:13</a>",
      "comment": "The Lord’s ‘roar’ signals a new gathering of His people. This has layers: a return from exile and eschatological fulfillment in Christ drawing all nations to Himself (see John 10:16)."
    },
    {
      "pk": 4201111,
      "translation": "AIV",
      "book": 28,
      "chapter": 11,
      "verse": 11,
      "text": "They shall come trembling like birds from Egypt, and like doves from the land of Assyria; and I will settle them in their homes, declares the Lord.",
      "links": "<a href='/AIV/23/60/8-9'>Isa. 60:8–9</a>",
      "comment": "God’s promise to bring His people home echoes spiritual restoration and reunion, a foretaste of God’s gathering of a people from all nations into a single, unified covenant family."
    },
    {
      "pk": 4201112,
      "translation": "AIV",
      "book": 28,
      "chapter": 11,
      "verse": 12,
      "text": "Ephraim surrounds Me with lies, and the house of Israel with deceit; but Judah still walks with God, and is faithful to the Holy One.",
      "links": "<a href='/AIV/19/78/36-37'>Ps. 78:36–37</a>",
      "comment": "This final contrast highlights the remnant that remains faithful. ‘Walking with God’ is used of key Old Testament figures (e.g., Enoch, Gen. 5:24), anticipating faithfulness made possible most perfectly through Christ by union with Him and participation in His life."
    }
  ],
  "translatedAt": "2025-12-23T07:22:56.088Z"
}