{
  "book": 35,
  "bookName": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 9,
  "verses": [
    {
      "pk": 35009001,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 1,
      "text": "Do not rejoice, Israel, do not celebrate like the other nations, for you have been unfaithful to your God. You have loved the wages of a prostitute at every grain threshing floor.",
      "links": "<a href='/AIV/02/32/6'>Ex. 32:6</a>; <a href='/AIV/23/1/21'>Isa. 1:21</a>; <a href='/AIV/28/2/5'>Hos. 2:5</a>",
      "comment": "Here, Hosea warns Israel not to rejoice because their worship has turned away from God toward idolatry, described using the imagery of adultery. The metaphor of prostitution here points to spiritual unfaithfulness and emphasizes the seriousness of idolatry. The reference to threshing floors connects to harvest festival celebrations, which often became occasions for syncretistic worship (see Ex. 32:6). The spiritual meaning points to the need for fidelity in worship, prefiguring Christ’s call for the Church to be His pure bride (cf. Eph. 5:25-27)."
    },
    {
      "pk": 35009002,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 2,
      "text": "The threshing floor and the winepress will not feed them, and the new wine will fail them.",
      "links": "<a href='/AIV/03/17/11'>Lev. 17:11</a>; <a href='/AIV/28/2/9'>Hos. 2:9</a>",
      "comment": "Israel’s prosperity depended on God’s blessings, but because of unfaithfulness, even the land’s produce cannot sustain them. This shows that without God’s favor, rituals or festivals are empty. The physical blessings are withdrawn because of Israel’s spiritual corruption, subtly pointing to the necessity of proper worship and the consequences for breaking covenant with God."
    },
    {
      "pk": 35009003,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 3,
      "text": "They will not remain in the LORD’s land; Ephraim will return to Egypt, and they will eat unclean food in Assyria.",
      "links": "<a href='/AIV/05/28/68'>Deut. 28:68</a>; <a href='/AIV/28/8/13'>Hos. 8:13</a>",
      "comment": "Exile is the consequence for Israel’s continued infidelity: spiritual exile is reflected in physical exile. Egypt symbolizes bondage, and Assyria is the nation that will take them captive. Eating unclean food underscores the loss of ritual purity. This hints at the importance of sacred tradition and of remaining within God’s covenant community (see also 1 Pet. 1:1-2, where believers are called 'exiles')."
    },
    {
      "pk": 35009004,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 4,
      "text": "They will not pour out wine offerings to the LORD, nor will their sacrifices please Him. Their bread will be like mourners’ bread; all who eat it will be defiled. For their bread will be for themselves; it will not come into the house of the LORD.",
      "links": "<a href='/AIV/03/21/17'>Lev. 21:17</a>; <a href='/AIV/05/26/14'>Deut. 26:14</a>",
      "comment": "Hosea explains that, in exile, Israel’s worship becomes impossible—they cannot lawfully offer sacrifices. The phrase 'bread of mourners' alludes to ritual impurity (Num. 19:14). The spiritual message is that separation from the sanctuary cuts off true worship, foreshadowing the necessity of remaining in God’s true Temple, a principle fulfilled in Christ (cf. John 2:21)."
    },
    {
      "pk": 35009005,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 5,
      "text": "What will you do on the day of the appointed festival, and on the day of the LORD’s feast?",
      "links": "<a href='/AIV/03/23/4'>Lev. 23:4</a>; <a href='/AIV/23/1/13'>Isa. 1:13</a>",
      "comment": "The question emphasizes the loss of identity and relationship with God. Without access to the LORD’s festivals, Israel cannot participate in the life of worship. This sets the stage for later fulfillment where worship is fully restored in the one body of Christ (cf. Col. 2:16-17)."
    },
    {
      "pk": 35009006,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 6,
      "text": "For even if they manage to escape destruction, Egypt will gather them, and Memphis will bury them. Nettles will possess their treasures of silver; thorns will grow in their tents.",
      "links": "<a href='/AIV/23/19/13'>Isa. 19:13</a>; <a href='/AIV/24/2/16'>Jer. 2:16</a>",
      "comment": "This verse refers to the futility of fleeing judgment. Egypt, the place of bondage, is now the place of burial. Memphis was a famous burial city. The lost treasures and ruined homes indicate both material and spiritual judgment. Theologically, this reflects the ultimate emptiness apart from God’s guidance."
    },
    {
      "pk": 35009007,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 7,
      "text": "The days of punishment have come; the days of retribution are here. Let Israel know this! Because of your many sins, and because your hostility is great, the prophet is considered a fool, the inspired man a madman.",
      "links": "<a href='/AIV/23/5/20'>Isa. 5:20</a>; <a href='/AIV/24/20/7'>Jer. 20:7</a>",
      "comment": "Divine judgment arrives, and those who speak for God are rejected or ridiculed. This motif recurs with God’s true messengers—from the prophets to Christ Himself, who was also called mad (Mark 3:21). Spiritually, this prepares the way for the ultimate Prophet, Jesus, who faced rejection (cf. John 1:11)."
    },
    {
      "pk": 35009008,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 8,
      "text": "The prophet is a watchman for my God over Ephraim, yet traps are on all his paths, hostility is in the house of his God.",
      "links": "<a href='/AIV/26/3/17'>Ezek. 3:17</a>; <a href='/AIV/28/6/5'>Hos. 6:5</a>",
      "comment": "God’s prophets warn the people, but they are met with traps and hostility—even within the community of faith. This serves as a warning not to reject those God sends, mirroring the opposition Jesus and the apostles faced. Remaining in communion with the true teaching authority protects against deception."
    },
    {
      "pk": 35009009,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 9,
      "text": "They have sunk deep into corruption as in the days of Gibeah. God will remember their iniquity; He will punish their sins.",
      "links": "<a href='/AIV/07/19/22'>Judg. 19:22</a>; <a href='/AIV/28/10/9'>Hos. 10:9</a>",
      "comment": "Gibeah refers to the horrific sin described in Judges 19. By recalling this, Hosea shows the depth of Israel’s apostasy and warns of sure judgment. The reference suggests that grave sins within the community require strong action and true repentance."
    },
    {
      "pk": 35009010,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 10,
      "text": "Like grapes in the wilderness, I found Israel. Like the first fruit on the fig tree in its first season, I saw your ancestors. But when they came to Baal Peor, they consecrated themselves to shame and became as detestable as the thing they loved.",
      "links": "<a href='/AIV/04/25/1-3'>Num. 25:1-3</a>; <a href='/AIV/19/106/28-29'>Ps. 106:28-29</a>",
      "comment": "God’s initial delight in Israel is contrasted with their later apostasy at Baal Peor (Num. 25). The transition from beloved first fruits to detestable idolaters underlines how quickly grace can be lost through sin. The fig tree imagery is later taken up by Jesus regarding faithfulness (Mark 11:12-14), pointing to continuity between Testaments."
    },
    {
      "pk": 35009011,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 11,
      "text": "Ephraim’s glory will fly away like a bird—no birth, no pregnancy, no conception.",
      "links": "<a href='/AIV/28/4/7'>Hos. 4:7</a>; <a href='/AIV/05/28/62'>Deut. 28:62</a>",
      "comment": "God’s blessing of fruitfulness is reversed, reflecting covenant curses described in Deut. 28. This judgment affects future generations, teaching the importance of God’s ongoing favor and the consequences of disobedience."
    },
    {
      "pk": 35009012,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 12,
      "text": "Even if they raise children, I will bereave them till none is left. Woe also to them when I turn away from them!",
      "links": "<a href='/AIV/28/4/6'>Hos. 4:6</a>; <a href='/AIV/24/14/8'>Jer. 14:8</a>",
      "comment": "Ongoing faithlessness leads to God’s withdrawal, leaving the people bereft even of what little remains. Spiritual abandonment is the ultimate tragedy, highlighting the need for remaining in God’s favor and under His guidance."
    },
    {
      "pk": 35009013,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 13,
      "text": "I have seen Ephraim, like Tyre, planted in a pleasant place. But Ephraim will bring out his children to the executioner.",
      "links": "<a href='/AIV/26/27/3'>Ezek. 27:3</a>; <a href='/AIV/19/137/8-9'>Ps. 137:8-9</a>",
      "comment": "God planted Ephraim in prosperity, yet now the effects of sin lead to destruction of the next generation. The reference to 'executioner' points to violent judgment, but also foreshadows the need for a faithful remnant—one continued lineage—which finds ultimate fulfillment in the Messiah (see Matt. 2:16-18)."
    },
    {
      "pk": 35009014,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 14,
      "text": "Give them, LORD—what will you give? Give them a miscarrying womb and dry breasts.",
      "links": "<a href='/AIV/05/28/18'>Deut. 28:18</a>; <a href='/AIV/42/23/29'>Luke 23:29</a>",
      "comment": "This prayer-cry shows the severity of Israel’s judgment: loss of posterity and blessing. Compare Christ’s prophecy in Luke 23:29 about the coming judgment on Jerusalem, where loss of children is seen as a sign of great calamity."
    },
    {
      "pk": 35009015,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 15,
      "text": "All their evil began in Gilgal; there I came to hate them. Because of their wicked deeds, I will drive them out of my house. I will love them no more; all their princes are rebels.",
      "links": "<a href='/AIV/09/15/12-23'>1 Sam. 15:12-23</a>; <a href='/AIV/28/4/15'>Hos. 4:15</a>",
      "comment": "Gilgal was a site associated with both God’s blessings and later, rebellion. To be driven from God’s house is to be excluded from His presence, emphasizing the need to dwell within the sacred assembly, under the overseers God appoints. The motif of rebellion among leaders is a warning to obey those whom God truly sends."
    },
    {
      "pk": 35009016,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 16,
      "text": "Ephraim is struck down; their roots are dried up, they will bear no fruit. Even if they give birth, I will slay their cherished offspring.",
      "links": "<a href='/AIV/28/8/7'>Hos. 8:7</a>; <a href='/AIV/40/3/10'>Matt. 3:10</a>",
      "comment": "The image of a cut-off, fruitless tree, later used by John the Baptist, conveys God’s judgment but also frames the expectation of the one true Vine blessed by God (John 15:1-6). Faithful fruitfulness comes by remaining joined to God’s chosen instrument."
    },
    {
      "pk": 35009017,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 9,
      "verse": 17,
      "text": "My God will reject them because they did not listen to him; they will become wanderers among the nations.",
      "links": "<a href='/AIV/05/28/64'>Deut. 28:64</a>; <a href='/AIV/28/7/8'>Hos. 7:8</a>; <a href='/AIV/60/1/1'>1 Pet. 1:1</a>",
      "comment": "Rejection comes from disobedience, resulting in exile among the nations. This anticipates Israel’s dispersion, but also foreshadows the ingathering of God’s people into the one flock under Christ (John 10:16). Spiritual unity requires attentive listening to God’s voice, mediated through those He appoints."
    }
  ],
  "translatedAt": "2025-12-24T09:38:11.781Z"
}