{
  "book": 35,
  "bookName": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 10,
  "verses": [
    {
      "pk": 35010001,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 1,
      "text": "Israel is a spreading vine; he brings forth fruit for himself. The more his fruit increased, the more he built altars; as his land prospered, he adorned his sacred pillars.",
      "links": "<a href='/AIV/28/2/8'>Hos. 2:8</a>; <a href='/AIV/05/12/2-3'>Deut. 12:2–3</a>; <a href='/AIV/28/8/11'>Hos. 8:11</a>",
      "comment": "Israel’s material prosperity led to increased idolatry, violating the covenant faithfulness expected of God’s people. The reference to altars and pillars alludes to forbidden worship practices (<a href='/AIV/05/12/2-3'>Deut. 12:2–3</a>)."
    },
    {
      "pk": 35010002,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 2,
      "text": "Their heart is divided; now they must bear their guilt. The Lord will break down their altars and destroy their sacred pillars.",
      "links": "<a href='/AIV/19/119/113'>Ps. 119:113</a>; <a href='/AIV/05/7/5'>Deut. 7:5</a>; <a href='/AIV/28/8/14'>Hos. 8:14</a>",
      "comment": "A divided heart (see <a href='/AIV/19/119/113'>Ps. 119:113</a>) is contrasted with the undivided devotion God requires. Their coming judgment is a direct response to unfaithfulness and idolatry."
    },
    {
      "pk": 35010003,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 3,
      "text": "Then they will say, 'We have no king, for we did not fear the Lord. And even if we had a king, what could he do for us?'",
      "links": "<a href='/AIV/28/3/4'>Hos. 3:4</a>; <a href='/AIV/28/13/10-11'>Hos. 13:10–11</a>",
      "comment": "Israel will experience political ruin as a direct result of spiritual failure. Human leadership cannot substitute for true fidelity to God, foreshadowing later teaching on Christ as the true King (<a href='/AIV/28/3/4'>Hos. 3:4</a>)."
    },
    {
      "pk": 35010004,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 4,
      "text": "They speak empty words, swearing false oaths while making covenants; so judgment springs up like poisonous weeds in the furrows of the field.",
      "links": "<a href='/AIV/19/12/2'>Ps. 12:2</a>; <a href='/AIV/24/17/6'>Jer. 17:6</a>",
      "comment": "Faithlessness in speech and violation of covenants leads to swift judgment. The imagery of weeds highlights the corruption that grows where God’s ways are ignored. Liturgical faithfulness and heart sincerity are both called for."
    },
    {
      "pk": 35010005,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 5,
      "text": "The inhabitants of Samaria tremble for the calf of Beth-aven. Its people mourn for it, and its priests wail over it—over its glory, because it has departed from it.",
      "links": "<a href='/AIV/11/12/28-30'>1 Kgs. 12:28–30</a>; <a href='/AIV/28/4/15'>Hos. 4:15</a>",
      "comment": "The 'calf of Beth-aven' refers to idolatrous worship begun by Jeroboam I (<a href='/AIV/11/12/28-30'>1 Kgs. 12:28–30</a>). Mourning for the loss of the idol reflects misplaced hope in false gods rather than the Lord."
    },
    {
      "pk": 35010006,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 6,
      "text": "Indeed, it shall be carried to Assyria as tribute for the great king. Ephraim will be put to shame, and Israel will be ashamed of his own counsel.",
      "links": "<a href='/AIV/28/5/13'>Hos. 5:13</a>; <a href='/AIV/12/17/3-6'>2 Kgs. 17:3–6</a>",
      "comment": "The idol, rather than saving Israel, will be carried away to Assyria, symbolizing defeat and humiliation. Reliance upon political schemes or false worship leads only to shame and exile."
    },
    {
      "pk": 35010007,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 7,
      "text": "Samaria’s king will disappear like a twig floating on the surface of the water.",
      "links": "<a href='/AIV/28/13/11'>Hos. 13:11</a>; <a href='/AIV/23/7/8'>Isa. 7:8</a>",
      "comment": "Israel’s king, powerless and transient, will vanish in the coming turmoil. Political instability results from failed trust in God’s sovereignty and foreshadows Jesus as the enduring King."
    },
    {
      "pk": 35010008,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 8,
      "text": "The high places of Aven, the sin of Israel, will be destroyed. Thorn and thistle will grow on their altars. Then they will say to the mountains, 'Cover us!' and to the hills, 'Fall on us!'",
      "links": "<a href='/AIV/28/4/15'>Hos. 4:15</a>; <a href='/AIV/42/23/30'>Luke 23:30</a>; <a href='/AIV/66/6/16'>Rev. 6:16</a>",
      "comment": "Jesus alludes to this in <a href='/AIV/42/23/30'>Luke 23:30</a>, and it recurs in Revelation (<a href='/AIV/66/6/16'>Rev. 6:16</a>). Physical destruction of idolatrous sites prefigures the ultimate judgment, with spiritual implications for rejection of the true faith."
    },
    {
      "pk": 35010009,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 9,
      "text": "Since the days of Gibeah, you have sinned, O Israel. There they have continued. Shall not war overtake them in Gibeah because of the wickedness of the people?",
      "links": "<a href='/AIV/07/19/22-30'>Judg. 19:22–30</a>; <a href='/AIV/09/9/9'>Hos. 9:9</a>",
      "comment": "Refers to the atrocity at Gibeah (<a href='/AIV/07/19/22-30'>Judg. 19</a>), a symbol of persistent sin in Israel’s history. God’s judgment is tied to continued national sinfulness."
    },
    {
      "pk": 35010010,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 10,
      "text": "When I please, I will discipline them. Nations will be gathered against them when they are bound for their double guilt.",
      "links": "<a href='/AIV/28/2/10'>Hos. 2:10</a>; <a href='/AIV/24/30/11'>Jer. 30:11</a>",
      "comment": "God’s sovereignty over judgment is highlighted. Double guilt refers to both idolatry and injustice. Discipline by foreign nations foreshadows God’s use of external means for chastening His people."
    },
    {
      "pk": 35010011,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 11,
      "text": "Ephraim was a trained heifer that loved to thresh, so I spared her fair neck. But I will put Ephraim to the yoke; Judah must plow; Jacob must break up the ground.",
      "links": "<a href='/AIV/05/25/4'>Deut. 25:4</a>; <a href='/AIV/28/6/11'>Hos. 6:11</a>",
      "comment": "Israel once benefited from ease (threshing), but now will face hardship (the yoke and the plow). The agricultural metaphors allude to the discipline God brings, but also hint at repentance and future hope."
    },
    {
      "pk": 35010012,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 12,
      "text": "Sow for yourselves righteousness; reap unfailing love. Break up your fallow ground, for it is time to seek the Lord, until He comes and showers righteousness upon you.",
      "links": "<a href='/AIV/24/4/3'>Jer. 4:3</a>; <a href='/AIV/28/2/19'>Hos. 2:19</a>; <a href='/AIV/40/6/33'>Matt. 6:33</a>",
      "comment": "The call to repentance is climactic here. True righteousness and mercy come from God. Spiritually, the imagery anticipates the outpouring of grace. The concept of sowing and reaping parallels Jesus' teachings about the kingdom and faithfulness."
    },
    {
      "pk": 35010013,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 13,
      "text": "You have plowed wickedness, you have reaped injustice, you have eaten the fruit of lies. Because you have trusted in your own way and in your many warriors,",
      "links": "<a href='/AIV/28/8/7'>Hos. 8:7</a>; <a href='/AIV/19/33/16-17'>Ps. 33:16–17</a>",
      "comment": "Israel’s reliance on self and military might instead of God reaps a bitter harvest. The pattern of sowing and reaping underscores individual and corporate consequences of sin."
    },
    {
      "pk": 35010014,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 14,
      "text": "therefore, the roar of battle will arise among your people, and all your strongholds will be destroyed, as Shalman destroyed Beth-arbel in the day of battle; mothers were dashed to pieces with their children.",
      "links": "<a href='/AIV/12/17/3'>2 Kgs. 17:3</a>; <a href='/AIV/19/137/9'>Ps. 137:9</a>",
      "comment": "Vivid imagery of judgment. The mention of Beth-arbel refers to a historical defeat, stressing the completeness and severity of coming destruction. This serves as a warning sign to remain steadfast in faith and avoid complacency."
    },
    {
      "pk": 35010015,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 10,
      "verse": 15,
      "text": "So it will be done to you, O Bethel, because of your great evil. At dawn the king of Israel will be utterly cut off.",
      "links": "<a href='/AIV/28/1/4'>Hos. 1:4</a>; <a href='/AIV/28/10/7'>Hos. 10:7</a>",
      "comment": "Final pronouncement of judgment. Bethel, once a place of encounter with God, became a source of idolatry. The sudden removal of Israel’s king points to a future longing for a true Shepherd-King who will never be cut off (see <a href='/AIV/40/2/6'>Matt. 2:6</a>)."
    }
  ],
  "translatedAt": "2025-12-24T09:38:39.693Z"
}