{
  "book": 35,
  "bookName": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 13,
  "verses": [
    {
      "pk": 35013001,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 1,
      "text": "When Ephraim spoke, people trembled; he was exalted in Israel. But he became guilty by worshiping Baal, and so he died.",
      "links": "<a href='/AIV/28/11/7'>Hos. 11:7</a>; <a href='/AIV/09/15/23'>1 Sam. 15:23</a>",
      "comment": "Ephraim represents the northern kingdom, whose apostasy led to its downfall. The language of 'death' reflects spiritual separation from God, which mirrors New Testament teachings on sin as death (Rom. 6:23)."
    },
    {
      "pk": 35013002,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 2,
      "text": "Now they keep on sinning and make cast images for themselves—idols skillfully crafted from their silver, which they all worship. They offer human sacrifices and kiss calf idols.",
      "links": "<a href='/AIV/02/32/4-6'>Exod. 32:4-6</a>; <a href='/AIV/11/17/30'>1 Kings 17:30</a>",
      "comment": "This verse exposes the ongoing idolatry, especially the worship of golden calves. The reference to sacrifices and kissing idols reveals both external rituals and inward attachment, contrasting with the true worship called for throughout Israel's history (Deut. 6:5)."
    },
    {
      "pk": 35013003,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 3,
      "text": "Therefore they will be like the morning mist, like dew that quickly disappears, like chaff blown away from the threshing floor, like smoke rising from a window.",
      "links": "<a href='/AIV/19/68/2'>Ps. 68:2</a>; <a href='/AIV/23/17/13'>Isa. 17:13</a>",
      "comment": "Their transience is emphasized. The images of mist, dew, chaff, and smoke all show the fleeting nature of life apart from God. See James 4:14 for a New Testament echo. The imagery invites reflection on the permanence found in true worship and communion with God."
    },
    {
      "pk": 35013004,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 4,
      "text": "Yet I am the LORD your God since the land of Egypt, and you shall acknowledge no god but Me. There is no savior besides Me.",
      "links": "<a href='/AIV/02/20/2-3'>Exod. 20:2-3</a>; <a href='/AIV/23/43/11'>Isa. 43:11</a>",
      "comment": "God recalls His exclusive covenant relationship. ‘No savior but Me’ foreshadows the unique role of Christ as the only mediator (1 Tim. 2:5), yet also invites awareness of how God saves through appointed means—see Acts 4:12."
    },
    {
      "pk": 35013005,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 5,
      "text": "I cared for you in the wilderness, in the dry and thirsty land.",
      "links": "<a href='/AIV/05/08/2'>Deut. 8:2</a>; <a href='/AIV/19/78/52'>Ps. 78:52</a>",
      "comment": "God's care for Israel in the wilderness highlights divine providence. Just as God provided manna and water, so He continues to provide spiritually through His Church and the sacraments (John 6:32-35)."
    },
    {
      "pk": 35013006,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 6,
      "text": "When they had pasture, they became satisfied; when they were satisfied, their hearts became proud, so they forgot Me.",
      "links": "<a href='/AIV/05/06/12'>Deut. 6:12</a>; <a href='/AIV/20/30/9'>Prov. 30:9</a>",
      "comment": "Israel’s forgetfulness is a warning about spiritual complacency. This theme recurs throughout Scripture (see Luke 12:19-21), teaching that gratitude and humility are antidotes to spiritual pride."
    },
    {
      "pk": 35013007,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 7,
      "text": "So I will become like a lion to them, like a leopard lurking by the path.",
      "links": "<a href='/AIV/23/31/4'>Isa. 31:4</a>; <a href='/AIV/25/3/10'>Lam. 3:10</a>",
      "comment": "God’s judgment is portrayed with animal imagery. The consequence of persistent sin is discipline, and these images reflect both justice and the need of repentance, which opens the way for mercy and restoration."
    },
    {
      "pk": 35013008,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 8,
      "text": "I will attack them like a bear robbed of her cubs, I will tear open their hearts. Like a lion I will devour them; wild animals will rip them apart.",
      "links": "<a href='/AIV/28/5/14'>Hos. 5:14</a>; <a href='/AIV/23/38/13'>Isa. 38:13</a>",
      "comment": "The graphic language of judgment reflects the severity of turning away from God. This serves as a call to contrition, a recurring invitation in Scripture, which later finds ultimate fulfillment in Christ’s sacrificial act opening the way to reconciliation."
    },
    {
      "pk": 35013009,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 9,
      "text": "You are destroyed, Israel, because you are against Me, against your helper.",
      "links": "<a href='/AIV/28/4/6'>Hos. 4:6</a>; <a href='/AIV/05/33/29'>Deut. 33:29</a>",
      "comment": "Destruction comes from rejecting God. The helper motif appears throughout Scripture, pointing to God’s ongoing intervention in history and culminating in the promise of the Holy Spirit (John 14:16)."
    },
    {
      "pk": 35013010,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 10,
      "text": "Where is your king now, that he may save you? Where are your rulers, all those you asked for? Let them deliver you in your time of trouble.",
      "links": "<a href='/AIV/09/08/19'>1 Sam. 8:19</a>; <a href='/AIV/28/10/3'>Hos. 10:3</a>",
      "comment": "Israel asked for human kings, rejecting God’s kingship (1 Sam. 8). Earthly leaders prove unable to save—a theme later echoed when Christ, the true King, arrives and fulfills God's promise of deliverance (John 18:36-37)."
    },
    {
      "pk": 35013011,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 11,
      "text": "I gave you a king in My anger, and in My wrath I took him away.",
      "links": "<a href='/AIV/09/15/26'>1 Sam. 15:26</a>; <a href='/AIV/28/10/7'>Hos. 10:7</a>",
      "comment": "God allowed kings as a concession to the people but removed them when they failed. This highlights the need for a divinely-appointed and faithful leadership, a concept reflected in apostolic succession."
    },
    {
      "pk": 35013012,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 12,
      "text": "Ephraim’s guilt is stored up; his sins are kept in record.",
      "links": "<a href='/AIV/19/130/3'>Ps. 130:3</a>; <a href='/AIV/40/12/36'>Matt. 12:36</a>",
      "comment": "Sin has consequences and is not forgotten unless repented of. The theme of a record of sins ties closely to the biblical teaching of confession and forgiveness (James 5:16)."
    },
    {
      "pk": 35013013,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 13,
      "text": "Labor pains will come for him, but he is an unwise son, for when the time comes, he does not position himself to be born.",
      "links": "<a href='/AIV/23/37/3'>Isa. 37:3</a>; <a href='/AIV/24/04/31'>Jer. 4:31</a>",
      "comment": "The birth image can be read spiritually as the need for conversion or spiritual rebirth, foreshadowing New Testament ideas (John 3:3-7) about being ‘born again’ into the kingdom."
    },
    {
      "pk": 35013014,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 14,
      "text": "Should I ransom them from the power of Sheol? Should I rescue them from death? O death, where are your plagues? O Sheol, where is your destruction? Compassion is hidden from My eyes.",
      "links": "<a href='/AIV/46/15/54-55'>1 Cor. 15:54-55</a>; <a href='/AIV/19/49/15'>Ps. 49:15</a>",
      "comment": "Paul quotes this in 1 Cor. 15, making this a key passage for resurrection hope. The tension between judgment and mercy is seen here. God’s willingness to ransom points to Christ’s redemption, where death is finally conquered."
    },
    {
      "pk": 35013015,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 15,
      "text": "Though he flourishes among brothers, an east wind will come—the wind of the LORD rising from the desert. His spring will dry up, his fountain will be emptied. It will strip away his treasury of every precious thing.",
      "links": "<a href='/AIV/28/12/1'>Hos. 12:1</a>; <a href='/AIV/24/13/24'>Jer. 13:24</a>",
      "comment": "The east wind represents Assyrian invasion and destruction. Material prosperity proves fleeting in the absence of faithfulness. The spiritual interpretation points toward seeking treasures that last (Matt. 6:19-21)."
    },
    {
      "pk": 35013016,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 13,
      "verse": 16,
      "text": "Samaria will bear her guilt, because she rebelled against her God. Her people will fall by the sword, their infants will be dashed to the ground, and pregnant women ripped open.",
      "links": "<a href='/AIV/12/08/12'>2 Kings 8:12</a>; <a href='/AIV/28/10/14'>Hos. 10:14</a>",
      "comment": "Graphic prophecy of judgment for rebellion. The severity intends to awaken repentance and the desire for restoration, foreshadowing the mercy extended in the new covenant through Christ's sacrifice and the promise of healing (Isa. 53:5)."
    }
  ],
  "translatedAt": "2025-12-24T09:39:40.179Z"
}