{
  "book": 35,
  "bookName": "Hosea",
  "bookAbbreviation": "Hos",
  "chapter": 6,
  "verses": [
    {
      "pk": 35006001,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 6,
      "verse": 1,
      "text": "Come, let us return to the LORD. For he has torn us, but he will heal us; he has struck us down, but he will bind up our wounds.",
      "links": "<a href='/AIV/23/1/18'>Isa. 1:18</a>; <a href='/AIV/19/147/3'>Ps. 147:3</a>; <a href='/AIV/28/5/13'>Hos. 5:13'</a>",
      "comment": "This verse opens with a call to communal repentance, recognizing God's disciplinary actions and his promise to restore. The healing and binding imagery anticipates spiritual renewal, foreshadowing Christ's ministry as healer and reconciler (see Isa 53:5)."
    },
    {
      "pk": 35006002,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 6,
      "verse": 2,
      "text": "After two days he will revive us; on the third day he will raise us up, that we may live before him.",
      "links": "<a href='/AIV/46/15/4'>1 Cor. 15:4</a>; <a href='/AIV/19/30/3'>Ps. 30:3</a>; <a href='/AIV/28/13/14'>Hos. 13:14</a>",
      "comment": "This verse is a remarkable anticipation of resurrection language, with 'the third day' pointing forward to Christ's resurrection (1 Cor. 15:4). It illustrates hope in God's power over death, offering both literal and spiritual application for individual and collective transformation."
    },
    {
      "pk": 35006003,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 6,
      "verse": 3,
      "text": "Let us know; let us strive to know the LORD. His coming is as sure as the dawn; he will come to us like the rain, like the spring rain that waters the earth.",
      "links": "<a href='/AIV/19/72/6'>Ps. 72:6</a>; <a href='/AIV/28/14/5'>Hos. 14:5'</a>; <a href='/AIV/23/55/6'>Isa. 55:6</a>",
      "comment": "Here, knowing God is emphasized as a continual pursuit. The imagery of refreshing rain and sunrise echoes promises of God's faithfulness and spiritual renewal (cf. Ps 72:6). It subtly suggests the importance of regular, ongoing relationship with God."
    },
    {
      "pk": 35006004,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 6,
      "verse": 4,
      "text": "Ephraim, what shall I do with you? Judah, what shall I do with you? Your loyalty is like a morning cloud, or like dew that quickly disappears.",
      "links": "<a href='/AIV/28/13/3'>Hos. 13:3</a>; <a href='/AIV/23/29/13'>Isa. 29:13</a>",
      "comment": "God laments the fickleness of his people’s devotion, which is fleeting. The contrast between divine steadfastness and human inconsistency hints at humanity's need for deeper formation and perseverance in faith."
    },
    {
      "pk": 35006005,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 6,
      "verse": 5,
      "text": "Therefore I have cut them by the prophets; I have slain them by the words of my mouth, and my judgment comes forth like the light.",
      "links": "<a href='/AIV/24/5/14'>Jer. 5:14</a>; <a href='/AIV/19/37/6'>Ps. 37:6</a>",
      "comment": "God's prophetic word carries both conviction and judgment, clarifying truth like light. The emphasis on the authority of divinely commissioned messengers underscores the enduring role of spiritual leadership and teaching in guiding God's people."
    },
    {
      "pk": 35006006,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 6,
      "verse": 6,
      "text": "For I desire loyalty and not sacrifice, and knowledge of God rather than burnt offerings.",
      "links": "<a href='/AIV/40/9/13'>Matt. 9:13</a>; <a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/23/1/11'>Isa. 1:11-17</a>",
      "comment": "This verse elevates interior devotion over mere ritual. Jesus directly cites it in his teaching (Matt. 9:13), emphasizing the necessity of heart transformation and knowledge of God over external religious practices, advocating for a deeper participation in divine life."
    },
    {
      "pk": 35006007,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 6,
      "verse": 7,
      "text": "But like Adam, they have broken the covenant; they have been unfaithful to me there.",
      "links": "<a href='/AIV/01/3/6'>Gen. 3:6</a>; <a href='/AIV/19/78/57'>Ps. 78:57</a>",
      "comment": "Israel's breach mirrors the earliest human covenant violation, reinforcing the universality of sin and the need for restoration. The idea of covenant-breaking points to the necessity of grace mediated through established sacred means."
    },
    {
      "pk": 35006008,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 6,
      "verse": 8,
      "text": "Gilead is a city of evildoers, tracked with blood.",
      "links": "<a href='/AIV/07/10/17'>Judg. 10:17</a>; <a href='/AIV/24/22/6'>Jer. 22:6</a>",
      "comment": "Gilead, though historically prominent, has become known for injustice. This condemnation shows that even places associated with sacred history can fall into corruption without continual conversion and reform."
    },
    {
      "pk": 35006009,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 6,
      "verse": 9,
      "text": "Like bands of robbers lying in wait, so priests murder on the way to Shechem; yes, they commit wicked deeds.",
      "links": "<a href='/AIV/28/4/2'>Hos. 4:2</a>; <a href='/AIV/06/20/7'>Josh. 20:7</a>",
      "comment": "The rebuke here extends even to priests, revealing severe moral failure among spiritual leaders. This verse points to the need for authentic holiness and continuous accountability among those entrusted with spiritual authority."
    },
    {
      "pk": 35006010,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 6,
      "verse": 10,
      "text": "In the house of Israel I have seen a horrible thing: Ephraim's infidelity is there; Israel is defiled.",
      "links": "<a href='/AIV/28/2/2'>Hos. 2:2</a>; <a href='/AIV/23/1/4'>Isa. 1:4</a>",
      "comment": "Israel’s spiritual adultery leads to defilement. This links back to covenantal faithfulness and the call for the people to embrace genuine interior conversion that leads to lasting holiness and unity."
    },
    {
      "pk": 35006011,
      "translation": "AIV",
      "book": 35,
      "bookName": "Hosea",
      "bookAbbreviation": "Hos",
      "chapter": 6,
      "verse": 11,
      "text": "Judah, I have also set a harvest for you, when I restore the fortunes of my people.",
      "links": "<a href='/AIV/29/3/1'>Joel 3:1</a>; <a href='/AIV/24/33/11'>Jer. 33:11</a>",
      "comment": "Though judgment is coming, there remains a promise of restoration for Judah. The harvest imagery links to both eschatological hope and the idea of spiritual renewal through divinely appointed seasons of grace (cf. Joel 3:1)."
    }
  ],
  "translatedAt": "2025-12-24T09:36:52.216Z"
}