{
  "book": 56,
  "bookName": "Ephesians",
  "bookAbbreviation": "Eph",
  "chapter": 1,
  "verses": [
    {
      "pk": 56001001,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 1,
      "text": "Paul, an apostle of Christ Jesus by the will of God, to the saints who are in Ephesus, and are faithful in Christ Jesus:",
      "links": "<a href='/AIV/44/9/15'>Acts 9:15</a>; <a href='/AIV/46/1/2'>1 Cor. 1:2</a>",
      "comment": "Paul introduces himself as an apostle, emphasizing his divine calling and the sanctity of Christian life. The word 'saints' refers to all baptized believers set apart for God."
    },
    {
      "pk": 56001002,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 2,
      "text": "Grace to you and peace from God our Father and the Lord Jesus Christ.",
      "links": "<a href='/AIV/45/1/7'>Rom. 1:7</a>; <a href='/AIV/47/1/2'>2 Cor. 1:2</a>",
      "comment": "Paul’s greeting joins grace and peace, coming from both the Father and the Son, underscoring the unity and divinity of Christ with God."
    },
    {
      "pk": 56001003,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 3,
      "text": "Blessed be the God and Father of our Lord Jesus Christ, who has blessed us in Christ with every spiritual blessing in the heavenly places.",
      "links": "<a href='/AIV/40/5/3'>Matt. 5:3</a>; <a href='/AIV/60/1/4'>1 Pet. 1:4</a>",
      "comment": "Every spiritual blessing is bestowed through union with Christ, pointing to the fullness of life in Christ—especially through sacraments and life in the Church."
    },
    {
      "pk": 56001004,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 4,
      "text": "Just as He chose us in Him before the foundation of the world, so that we would be holy and blameless before Him in love.",
      "links": "<a href='/AIV/40/25/34'>Matt. 25:34</a>; <a href='/AIV/19/139/16'>Ps. 139:16</a>",
      "comment": "The idea of being chosen before creation reveals God’s eternal plan; 'holy and blameless' refers to our being made righteous through Christ and nurtured in holiness as a community."
    },
    {
      "pk": 56001005,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 5,
      "text": "He predestined us for adoption as sons through Jesus Christ, according to the good pleasure of His will,",
      "links": "<a href='/AIV/45/8/15'>Rom. 8:15</a>; <a href='/AIV/43/1/12'>John 1:12</a>",
      "comment": "Predestination and adoption convey God’s initiative; we become God’s children through Christ, being united to the Son in concrete acts of faith and sacramental life."
    },
    {
      "pk": 56001006,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 6,
      "text": "to the praise of the glory of His grace, with which He has blessed us in the Beloved.",
      "links": "<a href='/AIV/43/17/24'>John 17:24</a>; <a href='/AIV/51/1/13'>Col. 1:13</a>",
      "comment": "'The Beloved' refers to Christ, whose unique relationship with the Father is mirrored in our adoption. Grace is a gift that brings us into communion with Christ."
    },
    {
      "pk": 56001007,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 7,
      "text": "In Him we have redemption through His blood, the forgiveness of our trespasses, according to the riches of His grace,",
      "links": "<a href='/AIV/40/26/28'>Matt. 26:28</a>; <a href='/AIV/51/1/14'>Col. 1:14</a>; <a href='/AIV/03/17/11'>Lev. 17:11</a>",
      "comment": "Redemption by Christ’s blood points to the atoning sacrifice, echoing Old Testament sacrifices and fulfilled perfectly in Christ’s unique offering. The fullness of grace is found in this act."
    },
    {
      "pk": 56001008,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 8,
      "text": "which He lavished upon us, in all wisdom and insight,",
      "links": "<a href='/AIV/45/5/5'>Rom. 5:5</a>; <a href='/AIV/19/51/6'>Ps. 51:6</a>",
      "comment": "God’s grace is given abundantly, and accompanied by wisdom, which guides believers deeper into mysteries of the faith through both Scripture and ongoing tradition."
    },
    {
      "pk": 56001009,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 9,
      "text": "making known to us the mystery of His will, according to His good pleasure which He purposed in Christ,",
      "links": "<a href='/AIV/45/16/25'>Rom. 16:25</a>; <a href='/AIV/51/1/26'>Col. 1:26-27</a>",
      "comment": "The revealing of God’s will is called a mystery—often understood as profound spiritual realities made visible through Christ and the community of faith."
    },
    {
      "pk": 56001010,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 10,
      "text": "to bring all things together in unity in Christ, things in heaven and things on earth, in the fullness of time.",
      "links": "<a href='/AIV/51/1/20'>Col. 1:20</a>; <a href='/AIV/44/3/21'>Acts 3:21</a>",
      "comment": "God’s plan is to unite and restore all creation in Christ, both heavenly and earthly realms, accomplished fully as history unfolds toward God’s appointed purpose."
    },
    {
      "pk": 56001011,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 11,
      "text": "In Him we were also chosen as an inheritance, having been predestined according to the purpose of Him who works all things after the counsel of His will,",
      "links": "<a href='/AIV/45/8/28'>Rom. 8:28-30</a>; <a href='/AIV/19/33/11'>Ps. 33:11</a>",
      "comment": "Believers are God’s special inheritance, chosen and predestined by His sovereign will. This underlines both divine initiative and the call to communal identity."
    },
    {
      "pk": 56001012,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 12,
      "text": "so that we, who were the first to hope in Christ, might live for the praise of His glory.",
      "links": "<a href='/AIV/60/2/9'>1 Pet. 2:9</a>; <a href='/AIV/45/15/8-9'>Rom. 15:8-9</a>",
      "comment": "Christians are called to bear witness to God’s glory. Living as praise implies a life formed by faith and worship, both privately and as a community."
    },
    {
      "pk": 56001013,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 13,
      "text": "In Him, you also, when you heard the word of truth, the gospel of your salvation, and believed in Him, were sealed with the promised Holy Spirit,",
      "links": "<a href='/AIV/47/1/22'>2 Cor. 1:22</a>; <a href='/AIV/44/2/38'>Acts 2:38</a>; <a href='/AIV/23/44/3'>Isa. 44:3</a>",
      "comment": "Sealing by the Spirit refers to a concrete mark of belonging, often understood as imparted through baptism and confirmation, providing spiritual assurance and incorporation into Christ."
    },
    {
      "pk": 56001014,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 14,
      "text": "who is the guarantee of our inheritance until the redemption of those who are God's possession, to the praise of His glory.",
      "links": "<a href='/AIV/47/5/5'>2 Cor. 5:5</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "The Spirit is a down payment—the first fruits—of full redemption, culminating in final resurrection and eternal union with Christ, which is experienced now in spiritual life."
    },
    {
      "pk": 56001015,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 15,
      "text": "For this reason, having heard of your faith in the Lord Jesus and your love for all the saints,",
      "links": "<a href='/AIV/51/1/4'>Col. 1:4</a>; <a href='/AIV/45/1/8'>Rom. 1:8</a>",
      "comment": "Faith and love are always joined in Christian life; love for the saints demonstrates a unity in the body of believers that is both spiritual and visible."
    },
    {
      "pk": 56001016,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 16,
      "text": "I do not cease to give thanks for you, remembering you in my prayers,",
      "links": "<a href='/AIV/51/1/3'>Col. 1:3</a>; <a href='/AIV/50/1/3-4'>Phil. 1:3-4</a>",
      "comment": "Paul’s unceasing prayers show the value of persistent intercession—praying for one another is seen as a vital ministry detailed throughout apostolic tradition."
    },
    {
      "pk": 56001017,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 17,
      "text": "so that the God of our Lord Jesus Christ, the Father of glory, may give you the Spirit of wisdom and revelation in knowing Him,",
      "links": "<a href='/AIV/23/11/2'>Isa. 11:2</a>; <a href='/AIV/43/17/3'>John 17:3</a>",
      "comment": "The Spirit grants wisdom and revelation, deepening personal relationship and knowledge of God—this often grows in prayer, study, and communal life."
    },
    {
      "pk": 56001018,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 18,
      "text": "having the eyes of your hearts enlightened, so that you may know the hope to which He has called you, the riches of His glorious inheritance among the saints,",
      "links": "<a href='/AIV/45/8/18'>Rom. 8:18</a>; <a href='/AIV/19/16/3'>Ps. 16:3</a>",
      "comment": "Spiritual enlightenment gives believers a vision of hope, centered not only on individual salvation but on the inheritance shared deeply within the community of faith."
    },
    {
      "pk": 56001019,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 19,
      "text": "and the exceeding greatness of His power toward us who believe, according to the working of His mighty strength,",
      "links": "<a href='/AIV/51/2/12'>Col. 2:12</a>; <a href='/AIV/19/68/35'>Ps. 68:35</a>",
      "comment": "God’s immense power is at work in believers, raising them spiritually and sustaining their growth—a reality made concrete in sacramental and liturgical celebration."
    },
    {
      "pk": 56001020,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 20,
      "text": "which He accomplished in Christ when He raised Him from the dead and seated Him at His right hand in the heavenly places,",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/44/2/32-33'>Acts 2:32-33</a>",
      "comment": "Christ’s resurrection and exaltation fulfills Old Testament prophecy (Psalm 110:1), establishing Him as Lord. Being seated at God's right hand signifies authority and ongoing mediation."
    },
    {
      "pk": 56001021,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 21,
      "text": "far above all rule and authority and power and dominion, and every name that is named, not only in this age but also in the one to come.",
      "links": "<a href='/AIV/50/2/9-10'>Phil. 2:9-10</a>; <a href='/AIV/19/8/6'>Ps. 8:6</a>",
      "comment": "Jesus’ rule surpasses all spiritual and earthly powers, placing Him at the highest position of authority now and for eternity."
    },
    {
      "pk": 56001022,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 22,
      "text": "And He subjected all things under His feet and gave Him as head over all things to the church,",
      "links": "<a href='/AIV/19/8/6'>Ps. 8:6</a>; <a href='/AIV/51/1/18'>Col. 1:18</a>",
      "comment": "Christ is appointed head over the church, fulfilling both prophetic and apostolic patterns: the church is not just a gathering but a stewardship of divine authority under Christ."
    },
    {
      "pk": 56001023,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 1,
      "verse": 23,
      "text": "which is His body, the fullness of Him who fills all in all.",
      "links": "<a href='/AIV/46/12/27'>1 Cor. 12:27</a>; <a href='/AIV/51/1/24'>Col. 1:24</a>",
      "comment": "The church as Christ’s body and fullness highlights a deeply organic and mystical union—Christ continues to operate through His people, joined together in faith, worship, and visible communion."
    }
  ],
  "translatedAt": "2025-12-24T12:01:06.879Z"
}