{
  "book": 56,
  "bookName": "Ephesians",
  "bookAbbreviation": "Eph",
  "chapter": 6,
  "verses": [
    {
      "pk": 56006001,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 1,
      "text": "Children, obey your parents in the Lord, for this is right.",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/5/5/16'>Deut. 5:16</a>",
      "comment": "Paul grounds the command for children to obey their parents in both natural law and divine command. Note the phrase \"in the Lord,\" which suggests obedience is ultimately directed to God and shapes the Christian understanding of family authority."
    },
    {
      "pk": 56006002,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 2,
      "text": "\"Honor your father and mother\"—which is the first commandment with a promise—",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/5/5/16'>Deut. 5:16</a>",
      "comment": "Paul quotes the Ten Commandments, affirming their continuing relevance. He emphasizes that honoring one’s parents carries a unique promise, highlighting the importance of familial relationships in Christian life. The reference to promise shows continuity between Old and New Covenants."
    },
    {
      "pk": 56006003,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 3,
      "text": "so that it may go well with you and you may live long on the earth.",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/5/5/16'>Deut. 5:16</a>",
      "comment": "Paul references the blessing attached to this commandment. The promise for well-being and longevity reflects the link between morality and God's providential care, connecting ancient Israel with the Church."
    },
    {
      "pk": 56006004,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 4,
      "text": "Fathers, do not provoke your children to anger, but bring them up in the discipline and instruction of the Lord.",
      "links": "<a href='/AIV/20/13/24'>Prov. 13:24</a>; <a href='/AIV/19/78/5-7'>Ps. 78:5-7</a>",
      "comment": "The instruction for fathers emphasizes balance—discipline and nurture in Christ. This reflects Christian wisdom for family leadership, aligning it with the moral and spiritual formation of children according to apostolic tradition."
    },
    {
      "pk": 56006005,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 5,
      "text": "Bondservants, obey your earthly masters with deep respect and sincerity of heart, as you would Christ.",
      "links": "<a href='/AIV/51/3/22'>Col. 3:22</a>; <a href='/AIV/1/16/16'>1 Chron. 16:16</a>",
      "comment": "Paul urges slaves to serve their masters sincerely, recognizing Christ as the ultimate Master. This teaching dignifies every form of work when done for the Lord and points to a spiritual understanding of obedience."
    },
    {
      "pk": 56006006,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 6,
      "text": "Not only when being watched, as people-pleasers, but as servants of Christ, doing the will of God from the heart.",
      "links": "<a href='/AIV/51/3/23'>Col. 3:23</a>; <a href='/AIV/40/6/4'>Matt. 6:4</a>",
      "comment": "Paul is concerned for integrity, suggesting that Christian service is ultimately toward God, not mere men. This interior spiritual transformation underpins all outward actions, pointing to a higher calling."
    },
    {
      "pk": 56006007,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 7,
      "text": "Serve with good will, as to the Lord and not to people,",
      "links": "<a href='/AIV/51/3/24'>Col. 3:24</a>; <a href='/AIV/19/100/2'>Ps. 100:2</a>",
      "comment": "Service is Christ-focused. Paul’s spiritual vision urges believers to view their earthly duties as a participation in God’s work and grace, bestowing meaning on even humble tasks."
    },
    {
      "pk": 56006008,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 8,
      "text": "because you know that whatever good anyone does, he will receive back from the Lord, whether slave or free.",
      "links": "<a href='/AIV/40/16/27'>Matt. 16:27</a>; <a href='/AIV/41/10/30'>Mark 10:30</a>",
      "comment": "Reward for faithfulness comes from Christ, regardless of status. The principle anticipates the final judgment and spiritual equality before God, reinforcing biblical teaching on merit and grace."
    },
    {
      "pk": 56006009,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 9,
      "text": "Masters, do the same to them, and stop threatening, knowing that both their Master and yours is in heaven, and there is no partiality with Him.",
      "links": "<a href='/AIV/19/75/7'>Ps. 75:7</a>; <a href='/AIV/44/10/34'>Acts 10:34</a>",
      "comment": "Paul's teaching creates a radical equality in Christ, transcending human divisions. Earthly authority must reflect God’s justice, and dignity is given to all, reflecting the apostolic ethic."
    },
    {
      "pk": 56006010,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 10,
      "text": "Finally, be strong in the Lord and in the power of His might.",
      "links": "<a href='/AIV/23/40/31'>Isa. 40:31</a>; <a href='/AIV/19/27/1'>Ps. 27:1</a>",
      "comment": "Paul’s exhortation draws on Old Testament motifs of God’s strength. The call to rely not on ourselves, but on divine power, sets the context for spiritual warfare and sanctity."
    },
    {
      "pk": 56006011,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 11,
      "text": "Put on the full armor of God, so that you may be able to stand against the schemes of the devil.",
      "links": "<a href='/AIV/52/5/8'>1 Thess. 5:8</a>; <a href='/AIV/23/59/17'>Isa. 59:17</a>",
      "comment": "Paul uses militaristic imagery from Isaiah, encouraging believers to be completely equipped by divine means. This armor is provided by God, integrated into a holistic Christian life and apostolic tradition."
    },
    {
      "pk": 56006012,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 12,
      "text": "For our struggle is not against flesh and blood, but against rulers, against authorities, against the powers of this dark world, and against spiritual forces of evil in the heavenly realms.",
      "links": "<a href='/AIV/51/2/15'>Col. 2:15</a>; <a href='/AIV/40/4/8-10'>Matt. 4:8-10</a>",
      "comment": "Paul clarifies that spiritual warfare is directed at supernatural evil, not humans. This view supports a theology of spiritual realities, spiritual warfare, and the need for divine assistance."
    },
    {
      "pk": 56006013,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 13,
      "text": "Therefore, take up the full armor of God, so that you may be able to withstand in the evil day, and having done everything, to stand firm.",
      "links": "<a href='/AIV/23/59/17'>Isa. 59:17</a>; <a href='/AIV/19/94/17'>Ps. 94:17</a>",
      "comment": "Reiterating the importance of spiritual preparedness, Paul calls for perseverance and readiness, reinforcing the necessity of grace, virtue, and the support of the Church for endurance."
    },
    {
      "pk": 56006014,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 14,
      "text": "Stand firm therefore, having fastened the belt of truth around your waist, and having put on the breastplate of righteousness,",
      "links": "<a href='/AIV/23/11/5'>Isa. 11:5</a>; <a href='/AIV/23/59/17'>Isa. 59:17</a>",
      "comment": "Paul’s imagery draws from Isaiah’s descriptions of the Messiah’s armor, hinting at participation in Christ’s righteousness and truth through communion with Him and apostolic teaching."
    },
    {
      "pk": 56006015,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 15,
      "text": "and having fitted your feet with readiness from the gospel of peace.",
      "links": "<a href='/AIV/23/52/7'>Isa. 52:7</a>; <a href='/AIV/45/10/15'>Rom. 10:15</a>",
      "comment": "Paul connects gospel readiness with Isaiah's vision of the one who brings good news. Proclaiming peace is both active and foundational for every believer sent forth in apostolic mission."
    },
    {
      "pk": 56006016,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 16,
      "text": "In addition to all this, take up the shield of faith, with which you can extinguish all the flaming arrows of the evil one.",
      "links": "<a href='/AIV/19/18/2'>Ps. 18:2</a>; <a href='/AIV/58/11/1'>Heb. 11:1</a>",
      "comment": "Faith is defensive and active, a trust in God that nullifies attacks from the enemy. Paul’s description recalls martyr stories and Old Testament heroes, encouraging perseverance in faith."
    },
    {
      "pk": 56006017,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 17,
      "text": "Take the helmet of salvation and the sword of the Spirit, which is the word of God.",
      "links": "<a href='/AIV/23/59/17'>Isa. 59:17</a>; <a href='/AIV/58/4/12'>Heb. 4:12</a>",
      "comment": "Salvation and the Spirit’s word together protect and empower believers. The sword is both defensive and offensive, and hints at the power of Scripture and apostolic preaching."
    },
    {
      "pk": 56006018,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 18,
      "text": "Pray at all times in the Spirit, with every prayer and petition. To that end, keep alert with all perseverance, making supplication for all the saints.",
      "links": "<a href='/AIV/51/4/2'>Col. 4:2</a>; <a href='/AIV/42/21/36'>Luke 21:36</a>",
      "comment": "Universal and unceasing prayer is central. Prayer in the Spirit is communal and liturgical, indicating reliance on spiritual resources found in the Church’s life and the communion of saints."
    },
    {
      "pk": 56006019,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 19,
      "text": "And pray also for me, that whenever I open my mouth, a message may be given to me to boldly make known the mystery of the gospel,",
      "links": "<a href='/AIV/51/4/3'>Col. 4:3</a>; <a href='/AIV/46/2/7'>1 Cor. 2:7</a>",
      "comment": "Paul asks for prayers as intercession for preaching. The \"mystery of the gospel\" points to the sacramental depth of the Christian message, which is revealed only through divine revelation and apostolic succession."
    },
    {
      "pk": 56006020,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 20,
      "text": "for which I am an ambassador in chains. Pray that I may declare it fearlessly, as I should.",
      "links": "<a href='/AIV/44/28/20'>Acts 28:20</a>; <a href='/AIV/47/5/20'>2 Cor. 5:20</a>",
      "comment": "Paul’s suffering is an extension of his apostolic ministry. His call to boldness and fidelity in proclaiming the gospel reflects the witness of the saints and the continuity of apostolic mission throughout history."
    },
    {
      "pk": 56006021,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 21,
      "text": "So that you also may know how I am and what I am doing, Tychicus, the beloved brother and faithful servant in the Lord, will tell you everything.",
      "links": "<a href='/AIV/51/4/7'>Col. 4:7</a>; <a href='/AIV/44/20/4'>Acts 20:4</a>",
      "comment": "Paul mentions Tychicus, who brings this letter. The personal connection underlines the importance of community, spiritual friendship, and the unity of believers under apostolic leadership."
    },
    {
      "pk": 56006022,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 22,
      "text": "I have sent him to you for this very reason, so that you may know our circumstances and that he may comfort your hearts.",
      "links": "<a href='/AIV/51/4/8'>Col. 4:8</a>; <a href='/AIV/52/3/2'>1 Thess. 3:2</a>",
      "comment": "Paul’s care for the church expresses a pastoral heart, emphasizing that the consoling presence and encouragement of the apostolic delegate is a ministry to the whole body."
    },
    {
      "pk": 56006023,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 23,
      "text": "Peace to the brothers, and love with faith, from God the Father and the Lord Jesus Christ.",
      "links": "<a href='/AIV/53/3/16'>2 Thess. 3:16</a>; <a href='/AIV/43/14/27'>John 14:27</a>",
      "comment": "The closing blessing invokes unity, love, and faith—all gifts from God the Father and Jesus Christ. The prayer for peace and love highlights the apostolic authority to bless and unify the Church."
    },
    {
      "pk": 56006024,
      "translation": "AIV",
      "book": 56,
      "bookName": "Ephesians",
      "bookAbbreviation": "Eph",
      "chapter": 6,
      "verse": 24,
      "text": "Grace be with all who love our Lord Jesus Christ with undying love.",
      "links": "<a href='/AIV/56/1/2'>Eph. 1:2</a>; <a href='/AIV/45/16/20'>Rom. 16:20</a>",
      "comment": "Paul’s final words are a prayer for sustaining grace. The emphasis on loving Christ \"with undying love\" points to fidelity, spiritual perseverance, and the gift of God's grace to all true disciples."
    }
  ],
  "translatedAt": "2025-12-24T12:03:46.154Z"
}