{
  "book": "Ephesians",
  "bookAbbreviation": "Eph",
  "chapter": 2,
  "verses": [
    {
      "pk": 2202001,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 1,
      "text": "And you were dead in your trespasses and sins,",
      "links": "<a href='/AIV/45/5/12'>Rom. 5:12</a>; <a href='/AIV/51/2/13'>Col. 2:13</a>",
      "comment": "Paul begins with the spiritual deadness in sin that all humans share before God’s grace. The term 'dead' here is a strong metaphor indicating total incapacity to save oneself."
    },
    {
      "pk": 2202002,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 2,
      "text": "in which you once walked, following the course of this world, following the prince of the power of the air, the spirit now at work in the sons of disobedience.",
      "links": "<a href='/AIV/62/5/19'>1 John 5:19</a>; <a href='/AIV/43/12/31'>John 12:31</a>",
      "comment": "'Prince of the power of the air' is a reference to Satan, highlighting the domination of evil in the world order opposed to God (cf. John 12:31)."
    },
    {
      "pk": 2202003,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 3,
      "text": "Among them we all once lived in the passions of our flesh, carrying out the desires of the body and the mind, and were by nature children of wrath, like the rest of mankind.",
      "links": "<a href='/AIV/19/51/5'>Ps. 51:5</a>; <a href='/AIV/45/1/18'>Rom. 1:18</a>",
      "comment": "Paul includes himself (and even the Jewish people) as sharers in humanity's sinful condition. The phrase 'children of wrath' refers to being subject to God’s just judgment due to original sin and personal transgressions."
    },
    {
      "pk": 2202004,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 4,
      "text": "But God, being rich in mercy, because of the great love with which he loved us,",
      "links": "<a href='/AIV/45/5/8'>Rom. 5:8</a>; <a href='/AIV/19/103/8'>Ps. 103:8</a>",
      "comment": "God’s initiative begins the work of salvation, underscoring that mercy and love are the impetus for the new life given to believers."
    },
    {
      "pk": 2202005,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 5,
      "text": "even when we were dead in our trespasses, made us alive together with Christ—by grace you have been saved—",
      "links": "<a href='/AIV/45/6/4'>Rom. 6:4</a>; <a href='/AIV/51/2/13'>Col. 2:13</a>",
      "comment": "This verse emphasizes that our salvation is entirely the result of God’s grace, not our actions. 'Made us alive together with Christ' implies participation in Christ’s resurrection."
    },
    {
      "pk": 2202006,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 6,
      "text": "and raised us up with him and seated us with him in the heavenly places in Christ Jesus,",
      "links": "<a href='/AIV/51/3/1'>Col. 3:1</a>; <a href='/AIV/49/1/20'>Eph. 1:20</a>",
      "comment": "Believers already share, in a real but spiritual way, in Christ’s exalted position. This speaks of a mystical union with Christ, an important theme for understanding Christian identity."
    },
    {
      "pk": 2202007,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 7,
      "text": "so that in the coming ages he might show the immeasurable riches of his grace in kindness toward us in Christ Jesus.",
      "links": "<a href='/AIV/45/9/23'>Rom. 9:23</a>",
      "comment": "The purpose of God’s salvific action is to reveal his grace, both now and forever. The phrase 'immeasurable riches' points ahead to the glory to be fully revealed."
    },
    {
      "pk": 2202008,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 8,
      "text": "For by grace you have been saved through faith. And this is not from yourselves; it is the gift of God,",
      "links": "<a href='/AIV/45/3/24'>Rom. 3:24</a>; <a href='/AIV/43/6/44'>John 6:44</a>",
      "comment": "Salvation is God's gift, given by grace and received through faith. The text does not exclude God using means of grace (see also John 6:44; God draws us to faith)."
    },
    {
      "pk": 2202009,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 9,
      "text": "not by works, so that no one may boast.",
      "links": "<a href='/AIV/45/3/27'>Rom. 3:27</a>; <a href='/AIV/48/2/16'>Gal. 2:16</a>",
      "comment": "'Works' here refers to works apart from grace. The whole context indicates that salvation is a divine initiative, yet does not exclude good works after being saved (see v.10)."
    },
    {
      "pk": 2202010,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 10,
      "text": "For we are his workmanship, created in Christ Jesus for good works, which God prepared beforehand that we should walk in them.",
      "links": "<a href='/AIV/40/5/16'>Matt. 5:16</a>; <a href='/AIV/56/2/14'>Titus 2:14</a>",
      "comment": "Salvation is meant to result in a life of good works, which God ordains. This shows that while works do not earn salvation, they are the expected fruit, prepared by God."
    },
    {
      "pk": 2202011,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 11,
      "text": "So then remember, that previously you, the Gentiles in the flesh, called 'the uncircumcised' by what is called 'the circumcised,' which is made in the flesh by hands—",
      "links": "<a href='/AIV/45/2/28-29'>Rom. 2:28–29</a>",
      "comment": "Paul addresses non-Jewish Christians, highlighting the division that once existed between Jews and Gentiles based on ritual practices."
    },
    {
      "pk": 2202012,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 12,
      "text": "that you were at that time separated from Christ, alienated from the commonwealth of Israel, and strangers to the covenants of promise, having no hope and without God in the world.",
      "links": "<a href='/AIV/01/12/3'>Gen. 12:3</a>; <a href='/AIV/19/147/20'>Ps. 147:20</a>",
      "comment": "Gentiles were formerly outside the promises and covenants made to Israel, but those in Christ are now included. The reference to 'covenants of promise' points to the patriarchal promises (Genesis 12:3)."
    },
    {
      "pk": 2202013,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 13,
      "text": "But now in Christ Jesus you who once were far off have been brought near by the blood of Christ.",
      "links": "<a href='/AIV/23/57/19'>Isa. 57:19</a>; <a href='/AIV/58/10/19'>Heb. 10:19</a>",
      "comment": "'Brought near' refers to access to God now made possible through Christ’s atoning sacrifice."
    },
    {
      "pk": 2202014,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 14,
      "text": "For he himself is our peace, who has made both one and has broken down the dividing wall, the hostility between us.",
      "links": "<a href='/AIV/23/9/6'>Isa. 9:6</a>; <a href='/AIV/51/1/20'>Col. 1:20</a>",
      "comment": "Christ is declared to be 'our peace,' fulfilling Old Testament prophecies (cf. Isaiah 9:6) and uniting both Jew and Gentile in Himself."
    },
    {
      "pk": 2202015,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 15,
      "text": "by abolishing in his flesh the law of commandments expressed in ordinances, that he might create in himself one new man in place of the two, making peace,",
      "links": "<a href='/AIV/51/2/14'>Col. 2:14</a>",
      "comment": "Christ fulfills and transcends the ceremonial laws that divided, creating a unified people, the new humanity in Christ."
    },
    {
      "pk": 2202016,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 16,
      "text": "and might reconcile both to God in one body through the cross, having put to death the hostility.",
      "links": "<a href='/AIV/51/1/22'>Col. 1:22</a>; <a href='/AIV/45/5/10'>Rom. 5:10</a>",
      "comment": "Through the cross, all are reconciled in 'one body,' an early reference to the unified Church as the locus of reconciliation."
    },
    {
      "pk": 2202017,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 17,
      "text": "And he came and preached peace to you who were far off and peace to those who were near.",
      "links": "<a href='/AIV/23/57/19'>Isa. 57:19</a>",
      "comment": "Fulfills the prophecy of Isaiah 57:19. The peace Jesus brings extends to both Jews ('near') and Gentiles ('far off')."
    },
    {
      "pk": 2202018,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 18,
      "text": "For through him we both have access in one Spirit to the Father.",
      "links": "<a href='/AIV/43/14/6'>John 14:6</a>; <a href='/AIV/45/8/15'>Rom. 8:15</a>",
      "comment": "'Access' is a term of liturgical privilege, now granted to all in Christ by the Spirit, who leads believers into deeper relationship with the Father."
    },
    {
      "pk": 2202019,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 19,
      "text": "So then you are no longer strangers and foreigners, but you are fellow citizens with the saints and members of the household of God,",
      "links": "<a href='/AIV/50/3/20'>Phil. 3:20</a>; <a href='/AIV/58/12/22'>Heb. 12:22–23</a>",
      "comment": "Gentile believers are made full members of God’s covenant family and citizens in the kingdom of heaven."
    },
    {
      "pk": 2202020,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 20,
      "text": "built on the foundation of the apostles and prophets, Christ Jesus himself being the cornerstone,",
      "links": "<a href='/AIV/23/28/16'>Isa. 28:16</a>; <a href='/AIV/40/16/18'>Matt. 16:18</a>",
      "comment": "The 'foundation' of apostles and prophets points to apostolic authority and tradition, with Christ as the essential 'cornerstone' (cf. Isa. 28:16, Matt. 16:18)."
    },
    {
      "pk": 2202021,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 21,
      "text": "in whom the whole building, being joined together, grows into a holy temple in the Lord.",
      "links": "<a href='/AIV/46/3/16'>1 Cor. 3:16</a>; <a href='/AIV/60/2/5'>1 Pet. 2:5</a>",
      "comment": "The Church is envisioned as a spiritual temple, with Christ as the unifying presence. This spiritual and visible community manifests God’s dwelling on earth."
    },
    {
      "pk": 2202022,
      "translation": "AIV",
      "book": 49,
      "chapter": 2,
      "verse": 22,
      "text": "In him you also are being built together into a dwelling place for God by the Spirit.",
      "links": "<a href='/AIV/43/14/17'>John 14:17</a>; <a href='/AIV/46/6/19'>1 Cor. 6:19</a>",
      "comment": "The Spirit actively makes believers—together—a dwelling for God, expressing both an individual and communal indwelling. The notion of ongoing spiritual construction points to the importance of unity, growth, and a tangible, visible people of God."
    }
  ],
  "translatedAt": "2025-12-23T03:53:48.351Z"
}