{
  "book": "Ephesians",
  "bookAbbreviation": "Eph",
  "chapter": 5,
  "verses": [
    {
      "pk": 2050051,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 1,
      "text": "Therefore, be imitators of God as beloved children.",
      "links": "<a href='/AIV/40/5/48'>Matt. 5:48</a>; <a href='/AIV/62/3/2'>1 John 3:2</a>",
      "comment": "Paul calls believers to imitate God, emphasizing both holiness and love. Imitation suggests a call to transformation by grace, preparing believers to reflect God's character."
    },
    {
      "pk": 2050052,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 2,
      "text": "And walk in love, just as Christ loved us and gave himself up for us—a fragrant offering and sacrifice to God.",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/03/2/9'>Leviticus 2:9</a>",
      "comment": "Christ's self-giving is described in sacrificial language, recalling Old Testament offerings. This verse teaches that our lives are intended to be a sacrifice pleasing to God, echoing both literal and spiritual dimensions of Christian life."
    },
    {
      "pk": 2050053,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 3,
      "text": "But sexual immorality and all impurity or covetousness must not even be named among you, as is fitting for saints.",
      "links": "<a href='/AIV/46/6/18'>1 Cor. 6:18</a>; <a href='/AIV/51/3/5'>Col. 3:5</a>",
      "comment": "Saints are called to radical moral purity, a theme that echoes throughout scripture. The high standard here points to the transformative work of grace shaping Christian behavior."
    },
    {
      "pk": 2050054,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 4,
      "text": "Let there be no filthiness, nor foolish talk, nor crude joking, which are out of place, but instead let there be thanksgiving.",
      "links": "<a href='/AIV/51/3/8'>Col. 3:8</a>; <a href='/AIV/40/12/36'>Matt. 12:36</a>",
      "comment": "Speech is as significant as actions; gratitude is held up as the proper attitude, contrasting corrupt language with a heart turned toward God."
    },
    {
      "pk": 2050055,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 5,
      "text": "For you can be sure of this: everyone who is sexually immoral or impure, or who is covetous—that is, an idolater—has no inheritance in the kingdom of Christ and of God.",
      "links": "<a href='/AIV/46/6/9'>1 Cor. 6:9-10</a>; <a href='/AIV/51/3/6'>Col. 3:6</a>",
      "comment": "Here the spiritual consequences of habitual sin are highlighted. Note the linking of covetousness and idolatry, showing how ultimate loyalty belongs to God alone."
    },
    {
      "pk": 2050056,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 6,
      "text": "Let no one deceive you with empty words, for because of these things the wrath of God comes upon the sons of disobedience.",
      "links": "<a href='/AIV/51/3/6'>Col. 3:6</a>; <a href='/AIV/49/2/2'>Eph. 2:2</a>",
      "comment": "Paul warns against minimizing sin. Divine judgment is real—a teaching consistent throughout Scripture. This reinforces the call to genuine repentance and faith."
    },
    {
      "pk": 2050057,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 7,
      "text": "Therefore do not become partners with them.",
      "links": "<a href='/AIV/46/6/14'>2 Cor. 6:14</a>",
      "comment": "A clear separation from sinful practices is commanded. True fellowship is based in shared fidelity to Christ."
    },
    {
      "pk": 2050058,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 8,
      "text": "For at one time you were darkness, but now you are light in the Lord. Walk as children of light—",
      "links": "<a href='/AIV/40/5/14'>Matt. 5:14</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "Believers undergo a real transformation from darkness to light through union with Christ, fulfilling the prophecy of the people dwelling in darkness seeing a great light (<a href='/AIV/23/9/2'>Isa. 9:2</a>)."
    },
    {
      "pk": 2050059,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 9,
      "text": "for the fruit of light is found in all that is good and right and true.",
      "links": "<a href='/AIV/48/5/22'>Gal. 5:22-23</a>",
      "comment": "Goodness, righteousness, and truth mark the believer's life, echoing the fruits of the Spirit and sanctification as an ongoing work."
    },
    {
      "pk": 2050060,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 10,
      "text": "And try to discern what is pleasing to the Lord.",
      "links": "<a href='/AIV/45/12/2'>Rom. 12:2</a>",
      "comment": "This instruction requires a process of spiritual discernment and growth, inviting believers into deeper relationship and obedience."
    },
    {
      "pk": 2050061,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 11,
      "text": "Take no part in the unfruitful works of darkness, but instead expose them.",
      "links": "<a href='/AIV/43/3/20'>John 3:20-21</a>",
      "comment": "The Church is called not just to avoid evil but to actively confront and reveal it, promoting accountability among believers."
    },
    {
      "pk": 2050062,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 12,
      "text": "For it is shameful even to speak of the things done by them in secret.",
      "links": "<a href='/AIV/45/1/24-27'>Rom. 1:24-27</a>",
      "comment": "Paul’s seriousness about sin is clear—some things are so evil that they should not even be discussed."
    },
    {
      "pk": 2050063,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 13,
      "text": "But when anything is exposed by the light, it becomes visible;",
      "links": "<a href='/AIV/43/1/5'>John 1:5</a>; <a href='/AIV/40/10/26'>Matt. 10:26</a>",
      "comment": "Light here represents truth—evil cannot hide when confronted by the holiness of God."
    },
    {
      "pk": 2050064,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 14,
      "text": "for anything that becomes visible is light. Therefore it says: Awake, O sleeper, and rise from the dead, and Christ will shine on you.",
      "links": "<a href='/AIV/23/60/1'>Isa. 60:1</a>; <a href='/AIV/45/13/11'>Rom. 13:11</a>",
      "comment": "A probable early hymn or liturgical saying rooted in Old Testament imagery of awakening and resurrection—hinting at the communal worship context of early believers."
    },
    {
      "pk": 2050065,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 15,
      "text": "Look carefully then how you walk, not as unwise but as wise,",
      "links": "<a href='/AIV/20/4/26'>Prov. 4:26</a>",
      "comment": "Christian living demands careful discernment—a mark of spiritual maturity and wisdom."
    },
    {
      "pk": 2050066,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 16,
      "text": "making the most of the time, because the days are evil.",
      "links": "<a href='/AIV/51/4/5'>Col. 4:5</a>",
      "comment": "Believers are called to intentional stewardship of time and opportunities; this has both communal and individual application in the life of the Church."
    },
    {
      "pk": 2050067,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 17,
      "text": "Therefore do not be foolish, but understand what the will of the Lord is.",
      "links": "<a href='/AIV/45/12/2'>Rom. 12:2</a>",
      "comment": "The Christian life is one of active discernment and submission to God's will—a process aided by the community."
    },
    {
      "pk": 2050068,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 18,
      "text": "And do not get drunk with wine, for that is recklessness, but be filled with the Spirit.",
      "links": "<a href='/AIV/44/2/13'>Acts 2:13</a>; <a href='/AIV/49/3/19'>Eph. 3:19</a>",
      "comment": "A contrast is drawn between worldly excess and spiritual fullness. Paul alludes to the outpouring of the Spirit, which frequently occurred in corporate gatherings."
    },
    {
      "pk": 2050069,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 19,
      "text": "Address one another with psalms, hymns, and spiritual songs, singing and making melody to the Lord with your heart,",
      "links": "<a href='/AIV/51/3/16'>Col. 3:16</a>; <a href='/AIV/19/33/1'>Ps. 33:1</a>",
      "comment": "Communal worship is emphasized here. Paul's instructions suggest an ordered, liturgical form of worship, continuing the tradition of psalms and spiritual songs from the Old Covenant."
    },
    {
      "pk": 2050070,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 20,
      "text": "giving thanks always and for everything to God the Father in the name of our Lord Jesus Christ,",
      "links": "<a href='/AIV/51/3/17'>Col. 3:17</a>; <a href='/AIV/19/100/4'>Ps. 100:4</a>",
      "comment": "Universal thanksgiving is a core spiritual practice, deepening the believer’s relationship with God the Father through Jesus Christ."
    },
    {
      "pk": 2050071,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 21,
      "text": "submitting to one another out of reverence for Christ.",
      "links": "<a href='/AIV/50/2/3'>Phil. 2:3</a>",
      "comment": "Mutual submission forms the foundation of Christian community, modeled on Christ’s humility."
    },
    {
      "pk": 2050072,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 22,
      "text": "Wives, submit to your own husbands as to the Lord.",
      "links": "<a href='/AIV/51/3/18'>Col. 3:18</a>",
      "comment": "Paul speaks to ordering relationship; see comments on 5:25 for mutuality and sacrificial love."
    },
    {
      "pk": 2050073,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 23,
      "text": "For the husband is the head of the wife, just as Christ is head of the church, his body, and is himself its Savior.",
      "links": "<a href='/AIV/46/11/3'>1 Cor. 11:3</a>; <a href='/AIV/49/1/22'>Eph. 1:22-23</a>",
      "comment": "The headship imagery emphasizes Christ’s leadership over the spiritual community. The marriage covenant models Christ’s relationship with the Church, rooted in unity and sacrificial love."
    },
    {
      "pk": 2050074,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 24,
      "text": "Now as the church submits to Christ, so also wives should submit in everything to their husbands.",
      "links": "<a href='/AIV/51/3/18'>Col. 3:18</a>",
      "comment": "Paul explores the analogy between marriage and Christ’s bond with His people. The Church’s submission is ultimately a loving response to Christ’s self-giving."
    },
    {
      "pk": 2050075,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 25,
      "text": "Husbands, love your wives, just as Christ loved the church and gave himself up for her,",
      "links": "<a href='/AIV/43/13/34'>John 13:34</a>; <a href='/AIV/49/5/2'>Eph. 5:2</a>",
      "comment": "Christ’s sacrificial love for the Church is the ultimate model. Marital love is elevated beyond human affection to a sanctifying, self-giving union."
    },
    {
      "pk": 2050076,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 26,
      "text": "that he might sanctify her, having cleansed her by the washing of water with the word,",
      "links": "<a href='/AIV/43/3/5'>John 3:5</a>; <a href='/AIV/56/3/5'>Titus 3:5</a>",
      "comment": "Paul uses sacramental language here—'washing of water' is traditionally linked to baptism. The spiritual reality is closely connected to an outward, communal act of incorporation into Christ’s body."
    },
    {
      "pk": 2050077,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 27,
      "text": "so that he might present the church to himself in splendor, without spot or wrinkle or any such thing, but holy and blameless.",
      "links": "<a href='/AIV/22/4/7'>Song 4:7</a>; <a href='/AIV/51/1/22'>Col. 1:22</a>",
      "comment": "This verse looks forward to the future glorification of the Church. The imagery parallels Old Testament wedding language applied to God’s people and hints at the eschatological fulfillment."
    },
    {
      "pk": 2050078,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 28,
      "text": "In the same way, husbands ought to love their wives as their own bodies. He who loves his wife loves himself.",
      "links": "<a href='/AIV/01/2/24'>Gen. 2:24</a>; <a href='/AIV/40/19/5'>Matt. 19:5</a>",
      "comment": "Marriage is portrayed as a mysterious unity, echoing Genesis. The self-giving love is both physical and spiritual."
    },
    {
      "pk": 2050079,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 29,
      "text": "For no one ever hated his own flesh, but nourishes and cherishes it, just as Christ does the church,",
      "links": "<a href='/AIV/49/4/16'>Eph. 4:16</a>",
      "comment": "Paul continues to affirm Christ’s deep care for the Church, reflected in marital love."
    },
    {
      "pk": 2050080,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 30,
      "text": "because we are members of his body.",
      "links": "<a href='/AIV/46/12/27'>1 Cor. 12:27</a>; <a href='/AIV/49/4/25'>Eph. 4:25</a>",
      "comment": "The notion of the Church as the body of Christ is central, emphasizing a mystical communion among fellow believers."
    },
    {
      "pk": 2050081,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 31,
      "text": "For this reason a man shall leave his father and mother and be joined to his wife, and the two shall become one flesh.",
      "links": "<a href='/AIV/01/2/24'>Gen. 2:24</a>; <a href='/AIV/40/19/5'>Matt. 19:5</a>",
      "comment": "Paul quotes Genesis, showing the deep biblical roots of marriage as a covenant and spiritual mystery."
    },
    {
      "pk": 2050082,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 32,
      "text": "This mystery is profound, and I am saying that it refers to Christ and the church.",
      "links": "<a href='/AIV/46/2/7'>1 Cor. 2:7</a>; <a href='/AIV/51/1/26-27'>Col. 1:26-27</a>",
      "comment": "Paul reveals the typology—marriage is a sign pointing to the union between Christ and His people. The term 'mystery' (Greek: musterion) often refers to hidden realities made known in Christ; here, it alludes to both sacramental and spiritual realities."
    },
    {
      "pk": 2050083,
      "translation": "AIV",
      "book": 49,
      "chapter": 5,
      "verse": 33,
      "text": "Nevertheless, let each one of you love his wife as himself, and let the wife see that she respects her husband.",
      "links": "<a href='/AIV/51/3/19'>Col. 3:19</a>; <a href='/AIV/01/2/24'>Gen. 2:24</a>",
      "comment": "The summary command captures the core of the previous verses—love and respect are pillars of marriage, reflecting a Christ-centered relationship and community."
    }
  ],
  "translatedAt": "2025-12-23T03:55:08.933Z"
}