{
  "book": "Ephesians",
  "bookAbbreviation": "Eph",
  "chapter": 6,
  "verses": [
    {
      "pk": 306100,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 1,
      "text": "Children, obey your parents in the Lord, for this is right.",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/5/5/16'>Deut. 5:16</a>",
      "comment": "Paul affirms the importance of obeying parents as rooted in God's commandment. This teaching upholds family order, reflecting God's design in the Law (cf. Ex. 20:12), and points to the importance of obeying rightful authority."
    },
    {
      "pk": 306101,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 2,
      "text": "Honor your father and mother”—this is the first commandment with a promise—",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>",
      "comment": "Paul quotes the commandment directly, emphasizing the unique blessing attached to honoring parents. This stresses the continuity between the Old and New Covenants and the enduring value of God's law."
    },
    {
      "pk": 306102,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 3,
      "text": "so that it may go well with you and that you may live long on the earth.",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/5/5/16'>Deut. 5:16</a>",
      "comment": "The promise linked to the commandment points to God’s providence in rewarding obedience. Traditionally, this verse is seen as a promise not only in the earthly sense but also spiritually interpreted as the fullness of life in Christ."
    },
    {
      "pk": 306103,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 4,
      "text": "Fathers, do not provoke your children to anger, but bring them up in the discipline and instruction of the Lord.",
      "links": "<a href='/AIV/51/3/21'>Col. 3:21</a>; <a href='/AIV/20/22/6'>Prov. 22:6</a>",
      "comment": "Fathers are urged to guide children both gently and firmly. This discipline is deeply rooted in God’s revelation, emphasizing the nurturing role of parents in faith."
    },
    {
      "pk": 306104,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 5,
      "text": "Slaves, obey your earthly masters with respect and fear, with sincerity of heart, as you would Christ;",
      "links": "<a href='/AIV/51/3/22'>Col. 3:22</a>; <a href='/AIV/54/6/1'>1 Tim. 6:1</a>",
      "comment": "While addressing the social situation of the time, Paul transforms the relationship, calling for service as service to Christ Himself. As with all commands, the ultimate reference is to the Lord."
    },
    {
      "pk": 306105,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 6,
      "text": "not by way of eye-service, as people-pleasers, but as slaves of Christ, doing the will of God from your heart,",
      "links": "<a href='/AIV/51/3/22'>Col. 3:22</a>; <a href='/AIV/40/6/1-4'>Matt. 6:1-4</a>",
      "comment": "Paul teaches sincere obedience, urging that all work is ultimately done for God. This deeper call to integrity is a spiritualization of daily life."
    },
    {
      "pk": 306106,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 7,
      "text": "serving with goodwill, as if you were serving the Lord and not men,",
      "links": "<a href='/AIV/40/25/40'>Matt. 25:40</a>",
      "comment": "By equating service to others with service to Christ, Paul highlights the sacramental view of Christian living, where even ordinary acts are transformed by grace."
    },
    {
      "pk": 306107,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 8,
      "text": "knowing that whatever good anyone does, he will receive the same back from the Lord, whether he is slave or free.",
      "links": "<a href='/AIV/40/16/27'>Matt. 16:27</a>; <a href='/AIV/51/3/24-25'>Col. 3:24-25</a>",
      "comment": "Paul assures ultimate justice from God, linking actions and reward. This echoes Jesus’ teaching about coming judgment and reward according to works."
    },
    {
      "pk": 306108,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 9,
      "text": "And masters, do the same toward them, and stop your threatening, for you know that both their Master and yours is in heaven, and there is no favoritism with him.",
      "links": "<a href='/AIV/51/4/1'>Col. 4:1</a>; <a href='/AIV/5/10/17'>Deut. 10:17</a>",
      "comment": "Paul's teaching subverts earthly hierarchies, emphasizing the equality of all before God, who judges impartially."
    },
    {
      "pk": 306109,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 10,
      "text": "Finally, be strong in the Lord and in the power of his might.",
      "links": "<a href='/AIV/23/40/29-31'>Isa. 40:29-31</a>; <a href='/AIV/50/4/13'>Phil. 4:13</a>",
      "comment": "Here, the Christian life is rooted in divine rather than human strength. This is an exhortation to rely not on self, but on God’s supernatural grace, which is a major theme of biblical spirituality."
    },
    {
      "pk": 306110,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 11,
      "text": "Put on the full armor of God, so that you will be able to stand against the schemes of the devil.",
      "links": "<a href='/AIV/23/59/17'>Isa. 59:17</a>; <a href='/AIV/52/5/8'>1 Thess. 5:8</a>",
      "comment": "Paul draws from Old Testament imagery (see Isa. 59:17) calling believers to spiritual readiness and defense against evil."
    },
    {
      "pk": 306111,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 12,
      "text": "For we are not wrestling against flesh and blood, but against rulers, against authorities, against the cosmic powers of this present darkness, against the spiritual forces of evil in the heavenly places.",
      "links": "<a href='/AIV/10/24/16'>2 Sam. 24:16</a>; <a href='/AIV/51/2/15'>Col. 2:15</a>",
      "comment": "The battle Paul describes is spiritual rather than merely worldly. Believers are called to engage in spiritual warfare, aware of unseen realities and disorders."
    },
    {
      "pk": 306112,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 13,
      "text": "Therefore, take up the full armor of God, so that you may be able to withstand in the evil day, and having done all, to stand firm.",
      "links": "<a href='/AIV/23/59/17'>Isa. 59:17</a>",
      "comment": "Knightly imagery urges readers to active resistance against evil using spiritual means. \"Armor\" is a symbol of virtue and reliance on God's power."
    },
    {
      "pk": 306113,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 14,
      "text": "Stand therefore, having fastened the belt of truth, and having put on the breastplate of righteousness,",
      "links": "<a href='/AIV/23/11/5'>Isa. 11:5</a>; <a href='/AIV/23/59/17'>Isa. 59:17</a>",
      "comment": "Paul borrows language from Isaiah. Truth and righteousness are essential for the Christian life both morally and spiritually."
    },
    {
      "pk": 306114,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 15,
      "text": "and, as shoes for your feet, having put on readiness given by the gospel of peace.",
      "links": "<a href='/AIV/23/52/7'>Isa. 52:7</a>; <a href='/AIV/45/10/15'>Rom. 10:15</a>",
      "comment": "Readiness to proclaim the Gospel mirrors Isaiah’s prophecy of the messenger of peace, reminding believers that mission and proclamation are essential."
    },
    {
      "pk": 306115,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 16,
      "text": "In all circumstances, take up the shield of faith, with which you can extinguish all the flaming arrows of the evil one.",
      "links": "<a href='/AIV/58/11/6'>Heb. 11:6</a>; <a href='/AIV/60/5/8-9'>1 Pet. 5:8-9</a>",
      "comment": "Faith is our defense against temptation. The imagery connects personal trust in God with victory over evil."
    },
    {
      "pk": 306116,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 17,
      "text": "And take the helmet of salvation, and the sword of the Spirit, which is the word of God.",
      "links": "<a href='/AIV/23/59/17'>Isa. 59:17</a>; <a href='/AIV/58/4/12'>Heb. 4:12</a>",
      "comment": "Salvation and the Word are both protection and weapon. The ‘word’ here is interpreted not only as Scripture but also as apostolic preaching and tradition, which were the means of transmitting the faith in the early Church."
    },
    {
      "pk": 306117,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 18,
      "text": "Pray at all times in the Spirit, with all prayer and pleading. To that end, keep alert with all perseverance, praying for all the saints,",
      "links": "<a href='/AIV/52/5/17'>1 Thess. 5:17</a>; <a href='/AIV/42/21/36'>Luke 21:36</a>",
      "comment": "Persistent prayer is a hallmark of Christian life. Intercession for others, especially the saints, illustrates the spiritual solidarity and communion among believers."
    },
    {
      "pk": 306118,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 19,
      "text": "and also for me, that words may be given to me in opening my mouth boldly to proclaim the mystery of the gospel,",
      "links": "<a href='/AIV/44/4/29'>Acts 4:29</a>; <a href='/AIV/51/4/3-4'>Col. 4:3-4</a>",
      "comment": "Paul asks for prayer for boldness and effective proclamation. The 'mystery' of the Gospel was a major theme in apostolic preaching, signifying truths once hidden and now made known through Christ."
    },
    {
      "pk": 306119,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 20,
      "text": "for which I am an ambassador in chains, that I may declare it boldly, as I ought to speak.",
      "links": "<a href='/AIV/44/28/20'>Acts 28:20</a>; <a href='/AIV/50/1/13-14'>Phil. 1:13-14</a>",
      "comment": "Paul’s suffering and imprisonment are presented as part of his apostolic mission. His role as 'ambassador' underscores the authority and responsibility given to the apostles."
    },
    {
      "pk": 306120,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 21,
      "text": "So that you also may know how I am and what I am doing, Tychicus the beloved brother and faithful minister in the Lord will tell you everything.",
      "links": "<a href='/AIV/51/4/7-8'>Col. 4:7-8</a>; <a href='/AIV/44/20/4'>Acts 20:4</a>",
      "comment": "Paul commends Tychicus, recognizing the value of personal relationships and ministry within the wider community of believers."
    },
    {
      "pk": 306121,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 22,
      "text": "I have sent him to you for this very reason, that you may know how we are and that he may encourage your hearts.",
      "links": "<a href='/AIV/51/4/8'>Col. 4:8</a>",
      "comment": "Paul’s concern for his fellow believers’ consolation and encouragement reveals the pastoral heart of early church leaders."
    },
    {
      "pk": 306122,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 23,
      "text": "Peace be to the brothers, and love with faith, from God the Father and the Lord Jesus Christ.",
      "links": "<a href='/AIV/48/1/3'>Gal. 1:3</a>; <a href='/AIV/45/1/7'>Rom. 1:7</a>",
      "comment": "Paul closes with a blessing that comes from God the Father and Christ Jesus—reflecting a high Christology that places the Son alongside the Father as source of blessing."
    },
    {
      "pk": 306123,
      "translation": "AIV",
      "book": 49,
      "chapter": 6,
      "verse": 24,
      "text": "Grace be with all who love our Lord Jesus Christ with incorruptible love.",
      "links": "<a href='/AIV/60/1/8'>1 Pet. 1:8</a>; <a href='/AIV/51/3/23'>Col. 3:23</a>",
      "comment": "‘Incorruptible love’ points to an enduring, faithful devotion to Christ, suggesting the virtue of perseverance and the fullness of grace for those truly in communion with Him."
    }
  ],
  "translatedAt": "2025-12-23T03:55:35.669Z"
}