{
  "book": "Ephesians",
  "bookAbbreviation": "Eph",
  "chapter": 3,
  "verses": [
    {
      "pk": 2503001,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 1,
      "text": "For this reason, I, Paul, a prisoner for Christ Jesus on behalf of you Gentiles—",
      "links": "<a href='/AIV/50/1/13'>Phil. 1:13</a>; <a href='/AIV/53/1/11-12'>2 Tim. 1:11-12</a>",
      "comment": "Paul presents himself as one suffering for the sake of bringing Gentiles into the mystery of Christ, prefiguring the universal outreach of God's plan."
    },
    {
      "pk": 2503002,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 2,
      "text": "assuming you have heard of the stewardship of God’s grace that was given to me for you,",
      "links": "<a href='/AIV/49/3/8'>Eph. 3:8</a>; <a href='/AIV/45/15/15-16'>Rom. 15:15-16</a>",
      "comment": "The stewardship (or 'dispensation') points to a particular ministry entrusted to Paul, highlighting the personal and ongoing transmission of divine grace."
    },
    {
      "pk": 2503003,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 3,
      "text": "that by revelation the mystery was made known to me, as I have written briefly.",
      "links": "<a href='/AIV/49/1/9'>Eph. 1:9</a>; <a href='/AIV/46/2/10'>1 Cor. 2:10</a>",
      "comment": "Paul refers to the 'mystery'—something hidden and now revealed—a core New Testament theme, with implications for church unity and apostolic revelation."
    },
    {
      "pk": 2503004,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 4,
      "text": "By reading this, you can perceive my insight into the mystery of Christ,",
      "links": "<a href='/AIV/49/1/17-18'>Eph. 1:17-18</a>",
      "comment": "Paul invites the church to apprehend his unique understanding, which strengthens the case for authoritative teaching through the apostles."
    },
    {
      "pk": 2503005,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 5,
      "text": "which was not made known to the sons of men in other generations as it has now been revealed to his holy apostles and prophets by the Spirit:",
      "links": "<a href='/AIV/45/16/25-26'>Rom. 16:25-26</a>; <a href='/AIV/49/2/20'>Eph. 2:20</a>",
      "comment": "Paul highlights the continuity yet development of revelation, laying stress on the apostles and prophets as divinely authorized interpreters."
    },
    {
      "pk": 2503006,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 6,
      "text": "that the Gentiles are fellow heirs, members of the same body, and partakers of the promise in Christ Jesus through the gospel.",
      "links": "<a href='/AIV/48/3/28-29'>Gal. 3:28-29</a>; <a href='/AIV/49/2/19'>Eph. 2:19</a>",
      "comment": "The mystery is that Gentiles become full members of God’s people through Christ, emphasizing unity and a visible community of faith."
    },
    {
      "pk": 2503007,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 7,
      "text": "Of this gospel I was made a servant according to the gift of God's grace, which was given to me by the working of his power.",
      "links": "<a href='/AIV/46/15/10'>1 Cor. 15:10</a>; <a href='/AIV/51/1/25'>Col. 1:25</a>",
      "comment": "Paul's ministry is not self-appointed but divinely empowered, a pattern for how grace is mediated through chosen instruments."
    },
    {
      "pk": 2503008,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 8,
      "text": "To me, though I am the very least of all the saints, this grace was given, to preach to the Gentiles the unsearchable riches of Christ,",
      "links": "<a href='/AIV/46/15/9'>1 Cor. 15:9</a>; <a href='/AIV/49/1/7'>Eph. 1:7</a>",
      "comment": "'Unsearchable riches' highlights the inexhaustible depths of Christ—inviting ongoing meditation on his mystery and grace."
    },
    {
      "pk": 2503009,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 9,
      "text": "and to bring to light for everyone what is the plan of the mystery hidden for ages in God, who created all things,",
      "links": "<a href='/AIV/51/1/26'>Col. 1:26</a>; <a href='/AIV/46/2/7'>1 Cor. 2:7</a>",
      "comment": "The divine plan is cosmic and ancient, rooted in the Creator’s intention from the beginning (see Gen. 1:1), integrating creation and redemption."
    },
    {
      "pk": 2503010,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 10,
      "text": "so that through the church the manifold wisdom of God might now be made known to the rulers and authorities in the heavenly places.",
      "links": "<a href='/AIV/49/1/21'>Eph. 1:21</a>; <a href='/AIV/51/2/15'>Col. 2:15</a>",
      "comment": "This verse suggests God’s wisdom is revealed through a single visible body of believers, which becomes the instrument of God’s revelation to all realms."
    },
    {
      "pk": 2503011,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 11,
      "text": "This was according to the eternal purpose that he accomplished in Christ Jesus our Lord,",
      "links": "<a href='/AIV/49/1/4'>Eph. 1:4</a>; <a href='/AIV/60/1/20'>1 Pet. 1:20</a>",
      "comment": "God’s plan is not reactionary; it is eternal and accomplished in Christ, underscoring the unity of Old and New Testament purposes."
    },
    {
      "pk": 2503012,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 12,
      "text": "in whom we have boldness and access with confidence through faith in him.",
      "links": "<a href='/AIV/49/2/18'>Eph. 2:18</a>; <a href='/AIV/58/4/16'>Heb. 4:16</a>",
      "comment": "Access to God is through Christ’s mediation, affirming the ongoing necessity of trusting in Christ’s person and work."
    },
    {
      "pk": 2503013,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 13,
      "text": "Therefore I ask you not to lose heart at my sufferings for you, which are your glory.",
      "links": "<a href='/AIV/47/1/6'>2 Cor. 1:6</a>; <a href='/AIV/50/1/29'>Phil. 1:29</a>",
      "comment": "Paul’s sufferings are participatory in the sufferings of Christ (see Col. 1:24), implying the value and significance of suffering for believers."
    },
    {
      "pk": 2503014,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 14,
      "text": "For this reason I bow my knees before the Father,",
      "links": "<a href='/AIV/49/1/15-16'>Eph. 1:15-16</a>",
      "comment": "Paul’s posture of kneeling reflects deep reverence and humility in prayer, a model for Christian worship."
    },
    {
      "pk": 2503015,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 15,
      "text": "from whom every family in heaven and on earth is named,",
      "links": "<a href='/AIV/44/17/24-28'>Acts 17:24-28</a>",
      "comment": "The text points to the Father as the source of all created order, emphasizing God’s providence and authority."
    },
    {
      "pk": 2503016,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 16,
      "text": "that he may grant you, according to the riches of his glory, to be strengthened with power through his Spirit in your inner being,",
      "links": "<a href='/AIV/49/1/18-19'>Eph. 1:18-19</a>; <a href='/AIV/50/2/13'>Phil. 2:13</a>",
      "comment": "Here Paul links spiritual strength to an internal transformation by the Holy Spirit, distinguishing between the external and inner realities of faith."
    },
    {
      "pk": 2503017,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 17,
      "text": "so that Christ may dwell in your hearts through faith—that you, being rooted and grounded in love,",
      "links": "<a href='/AIV/49/2/22'>Eph. 2:22</a>; <a href='/AIV/43/14/23'>John 14:23</a>",
      "comment": "'Grounded in love' indicates the necessity for charity and unity as a foundation for experiencing the indwelling presence of Christ."
    },
    {
      "pk": 2503018,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 18,
      "text": "may have strength to comprehend with all the saints what is the width and length and height and depth,",
      "links": "<a href='/AIV/51/2/2-3'>Col. 2:2-3</a>",
      "comment": "A corporate understanding is encouraged—believers grasp the full mystery of Christ together, not as isolated individuals."
    },
    {
      "pk": 2503019,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 19,
      "text": "and to know the love of Christ that surpasses knowledge, so that you may be filled with all the fullness of God.",
      "links": "<a href='/AIV/49/4/13'>Eph. 4:13</a>; <a href='/AIV/51/2/9-10'>Col. 2:9-10</a>",
      "comment": "To ‘be filled with all the fullness of God’ points to the ongoing deepening of communion with God, realized in and among the faithful."
    },
    {
      "pk": 2503020,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 20,
      "text": "Now to him who is able to do far more abundantly than all that we ask or think, according to the power at work within us,",
      "links": "<a href='/AIV/50/3/21'>Phil. 3:21</a>; <a href='/AIV/65/24'>Jude 24</a>",
      "comment": "Paul’s doxology acknowledges God’s active work in believers, surpassing human expectation and petition."
    },
    {
      "pk": 2503021,
      "translation": "AIV",
      "book": 49,
      "chapter": 3,
      "verse": 21,
      "text": "to him be glory in the church and in Christ Jesus throughout all generations, forever and ever. Amen.",
      "links": "<a href='/AIV/43/17/22-23'>John 17:22-23</a>; <a href='/AIV/65/25'>Jude 25</a>",
      "comment": "The glory of God is manifested in and through the church for all generations—a call to see the visible, united community as central to God’s redemptive plan."
    }
  ],
  "translatedAt": "2025-12-23T03:54:10.297Z"
}