{
  "book": 3,
  "bookName": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 18,
  "verses": [
    {
      "pk": 3018001,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 1,
      "text": "The LORD spoke to Moses, saying:",
      "links": "<a href='/AIV/3/4/1'>Lev. 4:1</a>; <a href='/AIV/4/1/1'>Num. 1:1</a>",
      "comment": "This introduction formula appears frequently in Leviticus, emphasizing God's direct communication and authority through Moses as the mediator. It prefigures later mediation through the priestly office, which is fulfilled perfectly in Christ, our eternal High Priest. (See Heb. 4:14-16)"
    },
    {
      "pk": 3018002,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 2,
      "text": "Speak to the people of Israel and say to them, 'I am the LORD your God.'",
      "links": "<a href='/AIV/2/3/6'>Ex. 3:6</a>; <a href='/AIV/3/11/44'>Lev. 11:44</a>",
      "comment": "God reiterates His unique relationship with Israel, laying the foundation for their moral conduct. The phrase 'I am the LORD your God' underlines the call to holiness, foreshadowing the new covenant where God's law is written on our hearts (cf. Jer. 31:33; Heb. 8:10)."
    },
    {
      "pk": 3018003,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 3,
      "text": "You shall not do as they do in the land of Egypt, where you lived; and you shall not do as they do in the land of Canaan, where I am bringing you. You shall not walk in their statutes.",
      "links": "<a href='/AIV/2/23/24'>Ex. 23:24</a>; <a href='/AIV/5/12/30-31'>Deut. 12:30-31</a>",
      "comment": "God calls Israel to be distinct from the pagan nations. This sets up the concept of being a set-apart people, a theme later echoed in the call to believers to live differently from the world (see 1 Pet. 2:9)."
    },
    {
      "pk": 3018004,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 4,
      "text": "You shall follow my rules and keep my statutes and walk in them. I am the LORD your God.",
      "links": "<a href='/AIV/3/19/37'>Lev. 19:37</a>; <a href='/AIV/3/20/8'>Lev. 20:8</a>",
      "comment": "The repeated call to obedience frames morality as participation in divine law. This direct link between statutes and personal relationship with God prefigures how grace leads the believer not just to faith, but to obedience motivated by love (cf. John 14:15)."
    },
    {
      "pk": 3018005,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 5,
      "text": "You shall therefore keep my statutes and my rules; if a person does them, he shall live by them. I am the LORD.",
      "links": "<a href='/AIV/26/20/11'>Ezek. 20:11</a>; <a href='/AIV/45/10/5'>Rom. 10:5</a>; <a href='/AIV/48/3/12'>Gal. 3:12</a>",
      "comment": "Obedience yields life. Paul later explains this points to the fullness of life found in Christ, who perfectly fulfills the law (Rom. 10:4-5), making it possible for us to participate in His righteousness—not by the law alone, but by faith working through love."
    },
    {
      "pk": 3018006,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 6,
      "text": "None of you shall approach any one of his close relatives to uncover nakedness. I am the LORD.",
      "links": "<a href='/AIV/3/20/17'>Lev. 20:17</a>",
      "comment": "'Uncover nakedness' is a euphemism for sexual relations. The commandment sustains the sanctity of family relationships, which mirrors God's ordered creation."
    },
    {
      "pk": 3018007,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 7,
      "text": "You shall not uncover the nakedness of your father, which is the nakedness of your mother; she is your mother, you shall not uncover her nakedness.",
      "links": "<a href='/AIV/3/20/11'>Lev. 20:11</a>; <a href='/AIV/1/9/22'>Gen. 9:22</a>",
      "comment": "This prohibition upholds sexual morality within the family and underscores the dignity of motherhood. The law also points to the family as the foundation for how humanity images God (cf. Eph. 5:31-32)."
    },
    {
      "pk": 3018008,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 8,
      "text": "You shall not uncover the nakedness of your father's wife; it is your father's nakedness.",
      "links": "<a href='/AIV/3/20/11'>Lev. 20:11</a>; <a href='/AIV/5/27/20'>Deut. 27:20</a>",
      "comment": "This command includes not only one's mother, but any other wife of one's father. The laws protect marriage and highlight its exclusive bond—a signpost of the unbreakable, faithful love between Christ and the Church (cf. Eph. 5:32)."
    },
    {
      "pk": 3018009,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 9,
      "text": "You shall not uncover the nakedness of your sister, your father's daughter or your mother's daughter, whether brought up in the family or another home.",
      "links": "<a href='/AIV/3/20/17'>Lev. 20:17</a>",
      "comment": "Prohibiting relations with all sisters, legitimate or not, further defines boundaries that ensure the wholeness and holiness of the family structure."
    },
    {
      "pk": 3018010,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 10,
      "text": "You shall not uncover the nakedness of your son's daughter or your daughter's daughter—their nakedness is your own.",
      "links": "<a href='/AIV/3/20/14'>Lev. 20:14</a>",
      "comment": "This continues prohibitions within the closest kin, outlining the extent of sexual boundaries for a holy community."
    },
    {
      "pk": 3018011,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 11,
      "text": "You shall not uncover the nakedness of your father's wife's daughter, brought up in your father's family, since she is your sister.",
      "links": "<a href='/AIV/3/20/17'>Lev. 20:17</a>",
      "comment": "Stepparent and stepsibling relationships are included here, affirming that holiness calls us to refrain not only from literal incest but from all relations that compromise familial dignity."
    },
    {
      "pk": 3018012,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 12,
      "text": "You shall not uncover the nakedness of your father's sister; she is your father's close relative.",
      "links": "<a href='/AIV/3/20/19'>Lev. 20:19</a>",
      "comment": "The law here also guards wider family bonds, teaching reverence for the generations who came before us."
    },
    {
      "pk": 3018013,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 13,
      "text": "You shall not uncover the nakedness of your mother's sister, for she is your mother's close relative.",
      "links": "<a href='/AIV/3/20/19'>Lev. 20:19</a>",
      "comment": "Again, all branches of the extended family are protected, safeguarding communal and generational integrity."
    },
    {
      "pk": 3018014,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 14,
      "text": "You shall not uncover the nakedness of your father's brother; you shall not approach his wife, she is your aunt.",
      "links": "<a href='/AIV/3/20/20'>Lev. 20:20</a>",
      "comment": "Respect for the marriages of one's uncles is urged here, further safeguarding the sanctity and structure of the extended family."
    },
    {
      "pk": 3018015,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 15,
      "text": "You shall not uncover the nakedness of your daughter-in-law; she is your son's wife, you shall not uncover her nakedness.",
      "links": "<a href='/AIV/3/20/12'>Lev. 20:12</a>",
      "comment": "Incest prohibitions carefully protect marital fidelity, a foreshadowing of the indissolubility that Christ later teaches regarding marriage (Matt. 19:6)."
    },
    {
      "pk": 3018016,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 16,
      "text": "You shall not uncover the nakedness of your brother's wife; it is your brother's nakedness.",
      "links": "<a href='/AIV/3/20/21'>Lev. 20:21</a>; <a href='/AIV/5/25/5-10'>Deut. 25:5-10</a>",
      "comment": "This excludes so-called Levirate marriages (cf. Deut. 25:5–10), where the exception points to the ultimate Messianic lineage (see Ruth 4:1-10; Matt. 1), fulfilled in Jesus."
    },
    {
      "pk": 3018017,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 17,
      "text": "You shall not uncover the nakedness of a woman and her daughter, and you shall not take her son's daughter or her daughter's daughter to uncover her nakedness; they are close relatives, it is wickedness.",
      "links": "<a href='/AIV/3/20/14'>Lev. 20:14</a>",
      "comment": "God's law here preserves purity across generations, highlighting the severity of disrupting God's ordained family order."
    },
    {
      "pk": 3018018,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 18,
      "text": "You shall not take a woman as a rival wife to her sister, uncovering her nakedness while her sister is still alive.",
      "links": "<a href='/AIV/3/20/14'>Lev. 20:14</a>; <a href='/AIV/1/29/21-30'>Gen. 29:21-30</a>",
      "comment": "Polygamy that causes family strife is forbidden here, referencing tensions seen with Leah and Rachel (Gen. 29). Christ later affirms the ideal of monogamous marriage (see Matt. 19:4-6)."
    },
    {
      "pk": 3018019,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 19,
      "text": "You shall not approach a woman to uncover her nakedness while she is in her menstrual impurity.",
      "links": "<a href='/AIV/3/20/18'>Lev. 20:18</a>; <a href='/AIV/3/15/24'>Lev. 15:24</a>",
      "comment": "This command underlines both ritual and moral purity, anticipating the depth of cleansing found in the new covenant sacraments."
    },
    {
      "pk": 3018020,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 20,
      "text": "And you shall not lie sexually with your neighbor’s wife and so make yourself unclean with her.",
      "links": "<a href='/AIV/2/20/14'>Ex. 20:14</a>; <a href='/AIV/3/20/10'>Lev. 20:10</a>",
      "comment": "Adultery is prohibited, recalling the commandment (Ex. 20:14). Jesus later raises the standard, touching the heart and intent (cf. Matt. 5:27-28)."
    },
    {
      "pk": 3018021,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 21,
      "text": "You shall not give any of your children to offer them to Molech, and so profane the name of your God: I am the LORD.",
      "links": "<a href='/AIV/5/18/10'>Deut. 18:10</a>; <a href='/AIV/24/32/35'>Jer. 32:35</a>",
      "comment": "Child sacrifice is utterly condemned, as it desecrates God’s name. This underscores the infinite value of every human life. The unique dignity of the human person is fulfilled in Christ, who gives Himself as the one sacrifice for all (Heb. 10:10)."
    },
    {
      "pk": 3018022,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 22,
      "text": "You shall not lie with a male as with a woman; it is an abomination.",
      "links": "<a href='/AIV/3/20/13'>Lev. 20:13</a>; <a href='/AIV/45/1/26-27'>Rom. 1:26-27</a>",
      "comment": "Homosexual acts are condemned here. The New Testament affirms and clarifies these boundaries, always with a call to conversion and the hope of mercy through Christ (see 1 Cor. 6:9-11)."
    },
    {
      "pk": 3018023,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 23,
      "text": "And you shall not lie with any animal and so make yourself unclean with it, neither shall any woman give herself to an animal to lie with it: it is perversion.",
      "links": "<a href='/AIV/3/20/15'>Lev. 20:15</a>",
      "comment": "Sexual acts with animals are strictly forbidden, as they fundamentally violate the created order. The holiness of the human body—destined for resurrection—is here protected (cf. 1 Cor. 15:42-44)."
    },
    {
      "pk": 3018024,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 24,
      "text": "Do not make yourselves unclean by any of these things, for by all these the nations I am driving out before you have become unclean.",
      "links": "<a href='/AIV/5/9/4-5'>Deut. 9:4-5</a>",
      "comment": "The separation of Israel is rooted in their call to purity. God's people are to be distinguished in conduct, anticipating the greater holiness to which Christ’s body, the Church, is called (cf. Eph. 5:27)."
    },
    {
      "pk": 3018025,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 25,
      "text": "And the land became unclean, so that I punished its iniquity, and the land vomited out its inhabitants.",
      "links": "<a href='/AIV/3/20/22'>Lev. 20:22</a>",
      "comment": "Moral corruption defiles creation itself. The idea that sin has cosmic consequences is deepened in Romans 8:22, where Paul explains all creation groans, awaiting redemption through Christ."
    },
    {
      "pk": 3018026,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 26,
      "text": "But you shall keep my statutes and my rules and do none of these abominations, neither the native nor the sojourner who lives among you.",
      "links": "<a href='/AIV/3/17/8-9'>Lev. 17:8-9</a>",
      "comment": "Obedience is for both Israelites and foreigners, foreshadowing the later inclusion of all nations through Christ (see Gal. 3:28; Eph. 2:14-19)."
    },
    {
      "pk": 3018027,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 27,
      "text": "(For all these abominations the men of the land did, who were before you, so the land became unclean.)",
      "links": "<a href='/AIV/18/15/34'>Job 15:34</a>",
      "comment": "The laws are not arbitrary, but respond to real historical corruption. Israel is warned to learn from the sins of those before them, much as the Church is called to ongoing conversion."
    },
    {
      "pk": 3018028,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 28,
      "text": "So the land will not vomit you out when you make it unclean, as it vomited out the nation that was before you.",
      "links": "<a href='/AIV/3/20/22'>Lev. 20:22</a>",
      "comment": "The theme of exile shows that moral decline has social and material consequences—a thread that runs all the way to the New Testament warnings about perseverance in the faith (Heb. 6:4-8)."
    },
    {
      "pk": 3018029,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 29,
      "text": "For everyone who does any of these abominations, the persons who do them shall be cut off from among their people.",
      "links": "<a href='/AIV/3/20/6'>Lev. 20:6</a>",
      "comment": "\"Cut off\" can imply divine judgment, exile, or even death. The seriousness of sin—and the necessity of repentance and reconciliation—points toward the need for restoration to communion, fulfilled in the sacraments and discipline of the Church (cf. Matt. 18:15-18, 1 Cor. 5:4-5)."
    },
    {
      "pk": 3018030,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 18,
      "verse": 30,
      "text": "So keep my charge, never to practice any of these abominable customs that were practiced before you, and never make yourselves unclean by them: I am the LORD your God.",
      "links": "<a href='/AIV/3/19/37'>Lev. 19:37</a>",
      "comment": "The chapter ends with the call to faithfulness, reaffirming the LORD as the one true God. The holiness demanded here prefigures the greater holiness required of all believers in Christ, who is the fulfillment of the law and the source of grace to live it out (cf. Matt. 5:17-20)."
    }
  ],
  "translatedAt": "2025-12-24T01:20:03.114Z"
}