{
  "book": 3,
  "bookName": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 16,
  "verses": [
    {
      "pk": 3016001,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 1,
      "text": "The LORD spoke to Moses after the death of the two sons of Aaron, when they drew near before the LORD and died.",
      "links": "<a href='/AIV/3/10/1-2'>Lev. 10:1-2</a>; <a href='/AIV/4/17/13'>Num. 17:13</a>",
      "comment": "This verse recalls the death of Nadab and Abihu, Aaron's sons, who offered unauthorized fire; it serves as a sober warning about approaching God's holiness (see Lev. 10:1-2)."
    },
    {
      "pk": 3016002,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 2,
      "text": "The LORD said to Moses, 'Tell your brother Aaron not to come at just any time into the Holy Place, inside the veil, before the mercy seat which is on the ark, so that he will not die. For I will appear in the cloud above the mercy seat.'",
      "links": "<a href='/AIV/2/25/22'>Ex. 25:22</a>; <a href='/AIV/58/9/7'>Heb. 9:7</a>",
      "comment": "The entry into the Holy of Holies (see Ex. 25:22) is strictly regulated to preserve reverence and protect life. Foreshadows Christ's unique access to God's presence (Heb. 9:7)."
    },
    {
      "pk": 3016003,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 3,
      "text": "This is how Aaron shall enter the Holy Place: with a young bull for a sin offering and a ram for a burnt offering.",
      "links": "<a href='/AIV/3/4/3'>Lev. 4:3</a>",
      "comment": "Aaron must bring sacrifices—symbolizing atonement for sin and dedication—when entering the holiest place. Sacrificial patterns prefigure Christ's own self-offering."
    },
    {
      "pk": 3016004,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 4,
      "text": "He must put on the holy linen tunic, have the linen undergarment on his body, tie the linen sash around his waist, and wear the linen turban; these are holy garments. He shall bathe his body in water and then put them on.",
      "links": "<a href='/AIV/2/28/39-42'>Ex. 28:39-42</a>; <a href='/AIV/58/10/22'>Heb. 10:22</a>",
      "comment": "Ritual washing and special garments represent purity before God. This external preparation points toward the inner purification realized in Christ (Heb. 10:22)."
    },
    {
      "pk": 3016005,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 5,
      "text": "He shall take from the congregation of the children of Israel two male goats for a sin offering and one ram for a burnt offering.",
      "links": "<a href='/AIV/3/9/3'>Lev. 9:3</a>",
      "comment": "The two goats introduce the concept of substitution and removal of sin, which is further developed as a type of Christ who takes away the sin of the world (John 1:29)."
    },
    {
      "pk": 3016006,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 6,
      "text": "Aaron shall offer the bull as a sin offering for himself and make atonement for himself and for his house.",
      "links": "<a href='/AIV/3/4/3'>Lev. 4:3</a>; <a href='/AIV/58/5/3'>Heb. 5:3</a>",
      "comment": "Even the high priest requires atonement, showing no person stands righteous before God without grace (see Heb. 5:3)."
    },
    {
      "pk": 3016007,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 7,
      "text": "Then he shall take the two goats and set them before the LORD at the entrance to the tent of meeting.",
      "links": "<a href='/AIV/3/8/9'>Lev. 8:9</a>",
      "comment": "The presence of the LORD at the entrance signifies public acknowledgement of atonement and the communal aspect of forgiveness."
    },
    {
      "pk": 3016008,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 8,
      "text": "Aaron shall cast lots for the two goats: one lot for the LORD and the other lot for the scapegoat.",
      "links": "<a href='/AIV/20/16/33'>Prov. 16:33</a>; <a href='/AIV/3/14/8'>Lev. 14:8</a>",
      "comment": "Casting lots introduces divine choice; the scapegoat (Hebrew 'Azazel') becomes a symbol for the complete removal of sin from the people."
    },
    {
      "pk": 3016009,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 9,
      "text": "Aaron shall present the goat on which the lot fell for the LORD and offer it as a sin offering.",
      "links": "<a href='/AIV/3/4/24'>Lev. 4:24</a>",
      "comment": "The first goat is sacrificed, typifying Christ's sacrificial death for sin (see Isaiah 53:7; Hebrews 9:12)."
    },
    {
      "pk": 3016010,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 10,
      "text": "But the goat on which the lot fell to be the scapegoat shall be presented alive before the LORD, to make atonement over it, that it may be sent away into the wilderness as the scapegoat.",
      "links": "<a href='/AIV/19/103/12'>Ps. 103:12</a>; <a href='/AIV/43/19/17'>John 19:17</a>",
      "comment": "The living goat bearing sin into the wilderness points to the complete removal and forgiveness of sins—prefiguring Christ as the sin-bearer (Ps. 103:12)."
    },
    {
      "pk": 3016011,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 11,
      "text": "Aaron shall bring the bull of the sin offering for himself and make atonement for himself and for his household. He shall slaughter the bull of the sin offering for himself.",
      "links": "<a href='/AIV/3/4/3'>Lev. 4:3</a>; <a href='/AIV/58/7/27'>Heb. 7:27</a>",
      "comment": "Repeated emphasis on the priest's need for atonement; in contrast, Christ, as our High Priest, had no such need (Heb. 7:27)."
    },
    {
      "pk": 3016012,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 12,
      "text": "He shall take a censer full of burning coals from the altar before the LORD, and two handfuls of finely ground sweet incense, and bring them inside the veil.",
      "links": "<a href='/AIV/2/30/6-9'>Ex. 30:6-9</a>; <a href='/AIV/66/8/3-4'>Rev. 8:3-4</a>",
      "comment": "Incense represents prayer and intercession (see Rev. 8:3-4), intimately associated with the work of atonement and approach to God."
    },
    {
      "pk": 3016013,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 13,
      "text": "He shall put the incense on the fire before the LORD, so that the cloud of the incense may cover the mercy seat that is on the ark of the testimony, lest he die.",
      "links": "<a href='/AIV/2/40/34-35'>Ex. 40:34-35</a>; <a href='/AIV/66/5/8'>Rev. 5:8</a>",
      "comment": "The cloud signifies God's glorious presence and protection. Shows the reverent mediation needed to approach divine holiness."
    },
    {
      "pk": 3016014,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 14,
      "text": "He shall take some of the blood of the bull and sprinkle it with his finger on the front of the mercy seat, and before the mercy seat he shall sprinkle the blood seven times with his finger.",
      "links": "<a href='/AIV/3/4/6'>Lev. 4:6</a>; <a href='/AIV/58/9/13'>Heb. 9:13'</a>",
      "comment": "Sevenfold sprinkling witnesses to completeness and perfection in atonement, fulfilled in Christ's perfect sacrifice (Heb. 9:13)."
    },
    {
      "pk": 3016015,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 15,
      "text": "Then he shall kill the goat of the sin offering that is for the people, and bring its blood inside the veil, and do with its blood as he did with the blood of the bull, sprinkling it on the mercy seat and before the mercy seat.",
      "links": "<a href='/AIV/3/4/16'>Lev. 4:16'; <a href='/AIV/58/9/7'>Heb. 9:7</a>",
      "comment": "The atonement for the people points to the necessity of blood for forgiveness and to Christ entering the true Holy of Holies (Heb. 9:7)."
    },
    {
      "pk": 3016016,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 16,
      "text": "Thus he shall make atonement for the Holy Place, because of the uncleanness of the children of Israel and because of their transgressions, even all their sins. He shall do the same for the tent of meeting, which remains among them in the midst of their uncleanness.",
      "links": "<a href='/AIV/3/15/31'>Lev. 15:31</a>; <a href='/AIV/45/3/23'>Rom. 3:23</a>",
      "comment": "The need for continual cleansing from sin points to universal human need for redemption and God dwelling among sinful people."
    },
    {
      "pk": 3016017,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 17,
      "text": "No one is to be in the tent of meeting when he enters to make atonement in the Holy Place, until he comes out and has made atonement for himself, for his household, and for all the assembly of Israel.",
      "links": "<a href='/AIV/58/9/7'>Heb. 9:7</a>",
      "comment": "The solitary action of the high priest foreshadows the unique, unrepeatable mediation of Christ on behalf of all people."
    },
    {
      "pk": 3016018,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 18,
      "text": "Then he shall go out to the altar that is before the LORD and make atonement for it. He shall take some of the blood of the bull and of the goat and put it on the horns of the altar all around.",
      "links": "<a href='/AIV/3/8/15'>Lev. 8:15</a>; <a href='/AIV/2/29/12'>Ex. 29:12</a>",
      "comment": "Blood is also applied to the outer altar, signifying the need for continual purification not just individually but corporately."
    },
    {
      "pk": 3016019,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 19,
      "text": "He shall sprinkle some of the blood on it with his finger seven times, and cleanse it, and consecrate it from the uncleanness of the children of Israel.",
      "links": "<a href='/AIV/3/4/6'>Lev. 4:6</a>",
      "comment": "Again the number seven—a symbol of completeness—emphasizes God's total action in cleansing and consecration."
    },
    {
      "pk": 3016020,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 20,
      "text": "When he has finished making atonement for the Holy Place, the tent of meeting, and the altar, he shall bring forward the live goat.",
      "links": "<a href='/AIV/3/16/10'>Lev. 16:10</a>",
      "comment": "The scapegoat returns as the agent for symbolically carrying away the nation's sins."
    },
    {
      "pk": 3016021,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 21,
      "text": "Aaron shall lay both his hands on the head of the live goat and confess over it all the iniquities of the children of Israel, all their transgressions, all their sins, putting them on the head of the goat, and shall send it away into the wilderness by the hand of a man appointed for the task.",
      "links": "<a href='/AIV/19/32/5'>Ps. 32:5</a>; <a href='/AIV/45/6/6'>Rom. 6:6</a>",
      "comment": "Laying hands and confessing sins transfers guilt, foreshadowing Christ taking our sins upon Himself."
    },
    {
      "pk": 3016022,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 22,
      "text": "The goat shall bear all their iniquities onto itself into a remote land; and he shall release the goat in the wilderness.",
      "links": "<a href='/AIV/23/53/6'>Isa. 53:6</a>; <a href='/AIV/19/103/12'>Ps. 103:12</a>",
      "comment": "A vivid image of sin being removed 'as far as the east is from the west,' pointing to the completeness of God's forgiveness."
    },
    {
      "pk": 3016023,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 23,
      "text": "Then Aaron shall come into the tent of meeting, take off the linen garments that he put on when he went into the Holy Place, and leave them there.",
      "links": "<a href='/AIV/3/6/11'>Lev. 6:11</a>",
      "comment": "Removing and leaving the holy garments symbolizes leaving behind the temporal requirements of the ritual, anticipating a greater spiritual reality."
    },
    {
      "pk": 3016024,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 24,
      "text": "He shall bathe his body with water in a holy place, put on his regular garments, and come out and offer his burnt offering and the burnt offering of the people, to make atonement for himself and for the people.",
      "links": "<a href='/AIV/2/29/4'>Ex. 29:4</a>; <a href='/AIV/58/10/22'>Heb. 10:22</a>",
      "comment": "Ritual washing and restoration to ordinary life point to the transition from ritual law to fulfillment in Christ's lasting cleansing."
    },
    {
      "pk": 3016025,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 25,
      "text": "He shall burn the fat of the sin offering on the altar.",
      "links": "<a href='/AIV/3/4/8-10'>Lev. 4:8-10</a>",
      "comment": "Burning the fat, considered the best portion, as an offering to God shows complete devotion and giving over to the LORD."
    },
    {
      "pk": 3016026,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 26,
      "text": "The man who releases the goat as the scapegoat shall wash his clothes and bathe his body in water; afterwards he may come into the camp.",
      "links": "<a href='/AIV/3/14/8'>Lev. 14:8</a>",
      "comment": "Contact with the scapegoat, which bore sin, required ritual cleansing before re-entering the community—emphasizing separation from uncleanness."
    },
    {
      "pk": 3016027,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 27,
      "text": "The bull and the goat for the sin offerings, whose blood was brought to make atonement in the Holy Place, shall be carried outside the camp. Their skins, flesh, and dung shall be burned with fire.",
      "links": "<a href='/AIV/3/4/12'>Lev. 4:12</a>; <a href='/AIV/58/13/11-12'>Heb. 13:11-12</a>",
      "comment": "Disposal outside the camp foreshadows Christ's crucifixion 'outside the city gate,' both literally and spiritually (Heb. 13:12)."
    },
    {
      "pk": 3016028,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 28,
      "text": "The one who burns them shall wash his clothes and bathe his body in water, and afterward he may come into the camp.",
      "links": "<a href='/AIV/3/6/28'>Lev. 6:28</a>; <a href='/AIV/58/10/22'>Heb. 10:22</a>",
      "comment": "Again, purification is required after contact with things associated with sin, maintaining separation and cleansing."
    },
    {
      "pk": 3016029,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 29,
      "text": "This shall be a statute forever for you: In the seventh month, on the tenth day of the month, you shall humble yourselves, and do no work, whether the native or the foreigner who sojourns among you.",
      "links": "<a href='/AIV/3/23/27'>Lev. 23:27</a>; <a href='/AIV/44/15/9'>Acts 15:9</a>",
      "comment": "The Day of Atonement is universal and requires self-denial, anticipating the practice of repentance and reconciliation, extended even to foreigners."
    },
    {
      "pk": 3016030,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 30,
      "text": "For on this day shall atonement be made for you to cleanse you; you shall be clean before the LORD from all your sins.",
      "links": "<a href='/AIV/19/51/2'>Ps. 51:2</a>; <a href='/AIV/62/1/7'>1 John 1:7</a>",
      "comment": "God's initiative for our cleansing is the central aspect of atonement; completeness and assurance echo New Testament promises of forgiveness (1 John 1:7)."
    },
    {
      "pk": 3016031,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 31,
      "text": "It is a Sabbath of solemn rest for you, and you shall humble yourselves. It is a statute forever.",
      "links": "<a href='/AIV/3/23/32'>Lev. 23:32</a>",
      "comment": "Humbling oneself elevates the spiritual significance of rest, pointing towards spiritual reflection and contrition as perpetual aspects of faith."
    },
    {
      "pk": 3016032,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 32,
      "text": "The priest who is anointed and consecrated to serve as priest in his father’s place shall make atonement; he shall put on the holy linen garments.",
      "links": "<a href='/AIV/4/20/28'>Num. 20:28</a>; <a href='/AIV/58/7/23-25'>Heb. 7:23-25</a>",
      "comment": "Priestly succession underscores the continuity of atonement; ultimately finds fulfillment in Christ's eternal priesthood (Heb. 7:25)."
    },
    {
      "pk": 3016033,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 33,
      "text": "He shall make atonement for the Holy Sanctuary, for the tent of meeting, and for the altar, and shall also make atonement for the priests and all the people of the assembly.",
      "links": "<a href='/AIV/3/4/20'>Lev. 4:20</a>; <a href='/AIV/58/9/23'>Heb. 9:23</a>",
      "comment": "Atonement includes all facets of worship and community—anticipates full reconciliation of all creation in the New Covenant."
    },
    {
      "pk": 3016034,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 16,
      "verse": 34,
      "text": "This shall be an everlasting statute for you, to make atonement for the children of Israel once a year because of all their sins. And Moses did as the LORD commanded him.",
      "links": "<a href='/AIV/3/23/28'>Lev. 23:28</a>; <a href='/AIV/58/9/25-26'>Heb. 9:25-26</a>",
      "comment": "Annual atonement was a recurring necessity. Christ's sacrifice surpasses this by offering eternal redemption through one act (Heb. 9:26)."
    }
  ],
  "translatedAt": "2025-12-24T01:19:02.412Z"
}