{
  "book": 3,
  "bookName": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 3,
  "verses": [
    {
      "pk": 3003001,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 1,
      "text": "If anyone presents a sacrifice of peace offering, and brings it from the herd, whether male or female, it must be without defect before the LORD.",
      "links": "<a href='/AIV/3/22/21-22'>Lev. 22:21-22</a>; <a href='/AIV/2/12/5'>Ex. 12:5</a>",
      "comment": "The peace offering (Hebrew: 'shelamim') emphasizes restored relationship with God. The requirement of a flawless animal points toward the purity required for true communion with God, prefiguring the perfect offering of Christ (Heb. 9:14)."
    },
    {
      "pk": 3003002,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 2,
      "text": "He shall lay his hand on the head of his offering and slaughter it at the entrance of the Tent of Meeting. Aaron's sons, the priests, shall sprinkle the blood around on the altar.",
      "links": "<a href='/AIV/3/1/4-5'>Lev. 1:4-5</a>; <a href='/AIV/3/17/11'>Lev. 17:11</a>",
      "comment": "The laying of hands symbolizes identification and transfer. The blood signifies life and atonement, anticipating Christ’s own blood poured for many (Matt. 26:28). The priestly mediation foreshadows Christ's priesthood."
    },
    {
      "pk": 3003003,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 3,
      "text": "He shall offer from the sacrifice of the peace offering as an offering made by fire to the LORD: the fat that covers the entrails and all the fat that is on the entrails,",
      "links": "<a href='/AIV/3/7/3-5'>Lev. 7:3-5</a>",
      "comment": "Fat was regarded as the best part and reserved solely for the LORD, highlighting that the best is given to God. This gesture expresses the need to offer our best to the Lord, a theme enduring in Christian worship."
    },
    {
      "pk": 3003004,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 4,
      "text": "and the two kidneys with the fat that is on them, which is by the loins, and the lobe of the liver, which he shall remove with the kidneys.",
      "links": "<a href='/AIV/3/7/4'>Lev. 7:4</a>",
      "comment": "These specific parts were considered the choicest and most vital, symbolizing the internal devotion and sincerity expected in those who approach God (cf. Ps. 51:6; Heb. 4:12)."
    },
    {
      "pk": 3003005,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 5,
      "text": "Aaron’s sons shall burn it on the altar on top of the burnt offering, which is on the wood that is on the fire; it is an offering made by fire, a pleasing aroma to the LORD.",
      "links": "<a href='/AIV/3/1/9'>Lev. 1:9</a>; <a href='/AIV/50/4/18'>Phil. 4:18</a>",
      "comment": "The 'pleasing aroma' language signifies acceptance by God. Sacrificial worship, continued by the Church in a spiritual and ritual sense, anticipates and finds its fulfillment in the self-offering of Jesus (Eph. 5:2)."
    },
    {
      "pk": 3003006,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 6,
      "text": "If his offering as a sacrifice of peace offering to the LORD is from the flock, he shall offer either a male or a female, but it must be without defect.",
      "links": "<a href='/AIV/3/1/10'>Lev. 1:10</a>",
      "comment": "The option for male or female animals shows the inclusion of all the faithful in the worship and sacrifice, yet reiterates the necessity of perfection, a foreshadowing of Christ’s unblemished nature (1 Pet. 1:19)."
    },
    {
      "pk": 3003007,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 7,
      "text": "If he offers a lamb as his offering, then he shall present it before the LORD.",
      "links": "<a href='/AIV/3/4/32'>Lev. 4:32</a>; <a href='/AIV/43/1/29'>John 1:29</a>",
      "comment": "The lamb as sacrificial victim directly points forward to Christ as the Lamb of God, who takes away the sins of the world (John 1:29)."
    },
    {
      "pk": 3003008,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 8,
      "text": "He shall lay his hand on the head of his offering and slaughter it before the Tent of Meeting, and Aaron's sons shall sprinkle its blood around on the altar.",
      "links": "<a href='/AIV/3/3/2'>Lev. 3:2</a>, <a href='/AIV/58/9/21-22'>Heb. 9:21-22</a>",
      "comment": "Again, the ritual of identification and atonement by blood is central, underlining the principle that without the shedding of blood there is no forgiveness—fulfilled fully in Christ’s sacrifice."
    },
    {
      "pk": 3003009,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 9,
      "text": "From the sacrifice of the peace offering he shall offer as an offering made by fire to the LORD its fat, the entire fat tail cut off close to the backbone, and the fat that covers the entrails and all the fat on the entrails,",
      "links": "<a href='/AIV/3/7/3'>Lev. 7:3</a>",
      "comment": "The fat tail, unique to some breeds, was a delicacy. Dedication of the best portion parallels the giving of our most valued offerings to God."
    },
    {
      "pk": 3003010,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 10,
      "text": "the two kidneys with the fat that is on them near the loins, and the lobe of the liver, which he shall remove with the kidneys.",
      "links": "<a href='/AIV/3/3/4'>Lev. 3:4</a>",
      "comment": "Reiterates the importance of offering the choice internal parts, signifying an interior surrender to God."
    },
    {
      "pk": 3003011,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 11,
      "text": "The priest shall burn them on the altar as food, an offering made by fire to the LORD.",
      "links": "<a href='/AIV/3/21/6'>Lev. 21:6</a>; <a href='/AIV/50/4/18'>Phil. 4:18</a>",
      "comment": "The sacrificial parts are described as 'food' for God, stressing fellowship and closeness in the offering, which in Christian liturgy finds its spiritual fulfillment in the Eucharistic sacrifice of thanksgiving."
    },
    {
      "pk": 3003012,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 12,
      "text": "If his offering is a goat, then he shall present it before the LORD.",
      "links": "<a href='/AIV/3/4/23'>Lev. 4:23</a>; <a href='/AIV/40/25/32-33'>Matt. 25:32-33</a>",
      "comment": "Goats too may be sacrificed, signifying the universal scope of reconciliation. Goats are also used in later sin offerings, hinting at the distinction between sheep and goats in Christ’s teaching (Matt. 25:32-33)."
    },
    {
      "pk": 3003013,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 13,
      "text": "He shall lay his hand on its head and slaughter it before the Tent of Meeting, and Aaron’s sons shall sprinkle its blood around on the altar.",
      "links": "<a href='/AIV/3/3/2'>Lev. 3:2</a>",
      "comment": "Repetition of sacrificial procedure reinforces the function of mediation by the priests, which prefigures the unique priesthood of Christ (Heb. 5:1-10), and the ongoing ministry of the Church."
    },
    {
      "pk": 3003014,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 14,
      "text": "He shall offer from it as his offering, an offering made by fire to the LORD, the fat that covers the entrails and all the fat that is on the entrails,",
      "links": "<a href='/AIV/3/3/3'>Lev. 3:3</a>",
      "comment": "The repetition underscores the importance of giving the best and most internal parts to God, symbolic of wholehearted devotion."
    },
    {
      "pk": 3003015,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 15,
      "text": "the two kidneys with the fat that is on them near the loins, and the lobe of the liver, which he shall remove with the kidneys.",
      "links": "<a href='/AIV/3/3/10'>Lev. 3:10</a>",
      "comment": "Repeats the prescribed ritual, reinforcing the principle of total inner offering."
    },
    {
      "pk": 3003016,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 16,
      "text": "The priest shall burn them on the altar as food, a pleasing aroma. All fat belongs to the LORD.",
      "links": "<a href='/AIV/3/3/5'>Lev. 3:5</a>; <a href='/AIV/3/7/25'>Lev. 7:25</a>",
      "comment": "Everything that is best belongs first to God. This principle shapes the Church’s understanding and tradition of consecration and sanctification in worship."
    },
    {
      "pk": 3003017,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 3,
      "verse": 17,
      "text": "It shall be a perpetual statute throughout your generations in all your dwelling places, that you shall eat neither fat nor blood.",
      "links": "<a href='/AIV/3/7/26-27'>Lev. 7:26-27</a>; <a href='/AIV/5/12/23'>Deut. 12:23</a>; <a href='/AIV/44/15/20'>Acts 15:20</a>",
      "comment": "This is understood both literally and spiritually: God reserves the highest for Himself, while blood (life) belongs to God alone. In the New Testament, the Apostles maintain the emphasis on reverence for blood (Acts 15:20). Spiritually, it lays groundwork for deep respect for what is holy in our worship and participation in the covenant."
    }
  ],
  "translatedAt": "2025-12-24T01:11:04.807Z"
}