{
  "book": 3,
  "bookName": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 15,
  "verses": [
    {
      "pk": 3015001,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 1,
      "text": "The LORD spoke to Moses and Aaron, saying:",
      "links": "<a href='/AIV/3/13/1'>Lev. 13:1</a>; <a href='/AIV/4/5/2'>Num. 5:2</a>",
      "comment": "This introductory formula highlights the divine source of the instructions, establishing their authority. It is similar to other passages where God gives direct commands to Moses and Aaron."
    },
    {
      "pk": 3015002,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 2,
      "text": "\"Speak to the Israelites and say to them: Any man who has a bodily discharge from his flesh is unclean.",
      "links": "<a href='/AIV/3/12/2'>Lev. 12:2</a>; <a href='/AIV/3/22/4'>Lev. 22:4</a>",
      "comment": "The concept of uncleanness here is ritual, not moral, showing the importance of purity in approaching God and His sanctuary."
    },
    {
      "pk": 3015003,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 3,
      "text": "This is how he will be unclean because of his discharge: whether his flesh runs with discharge or is stopped up from discharge, it brings uncleanness.",
      "links": "<a href='/AIV/3/15/19'>Lev. 15:19</a>; <a href='/AIV/2/6/11'>Ex. 6:11</a>",
      "comment": "Both active discharge and blocked flow make one ceremonially unclean, emphasizing thoroughness of ritual purity rules."
    },
    {
      "pk": 3015004,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 4,
      "text": "Every bed the man with the discharge lies on shall be unclean, and everything he sits on will be unclean.",
      "links": "<a href='/AIV/3/15/20'>Lev. 15:20</a>; <a href='/AIV/3/15/26'>Lev. 15:26</a>",
      "comment": "Uncleanness extends to objects in contact with the person, pointing to how sin and impurity are considered contagious and require community-wide vigilance."
    },
    {
      "pk": 3015005,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 5,
      "text": "Anyone who touches his bed must wash his clothes and bathe in water and will be unclean until evening.",
      "links": "<a href='/AIV/3/11/24-28'>Lev. 11:24-28</a>; <a href='/AIV/3/17/15'>Lev. 17:15</a>",
      "comment": "The repeated instruction to wash and wait until evening shows the process for restoring purity, prefiguring spiritual cleansing."
    },
    {
      "pk": 3015006,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 6,
      "text": "Anyone who sits on anything the man with the discharge sat on must wash his clothes and bathe in water and will be unclean until evening.",
      "links": "<a href='/AIV/3/15/4'>Lev. 15:4</a>; <a href='/AIV/3/15/22'>Lev. 15:22</a>",
      "comment": "Indirect contact also transfers uncleanness, showing that purity concerns went beyond just personal actions to community life."
    },
    {
      "pk": 3015007,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 7,
      "text": "Anyone who touches the body of the man with a discharge must wash his clothes and bathe in water and will be unclean until evening.",
      "links": "<a href='/AIV/3/22/6'>Lev. 22:6</a>; <a href='/AIV/3/11/31'>Lev. 11:31</a>",
      "comment": "Direct contact required the same cleansing process. The emphasis on bodily contact prefigures the spiritual reality that sin and impurity are spread in community."
    },
    {
      "pk": 3015008,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 8,
      "text": "If the man with the discharge spits on someone who is clean, then that person must wash his clothes and bathe in water and will be unclean until evening.",
      "links": "<a href='/AIV/3/15/11'>Lev. 15:11</a>; <a href='/AIV/4/19/19-22'>Num. 19:19-22</a>",
      "comment": "Even accidental contact like spitting is included, highlighting the need for vigilance and thoroughness in maintaining purity."
    },
    {
      "pk": 3015009,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 9,
      "text": "Every saddle or item the man with the discharge rides on will be unclean.",
      "links": "<a href='/AIV/3/11/32'>Lev. 11:32</a>; <a href='/AIV/3/15/26'>Lev. 15:26</a>",
      "comment": "The extension of uncleanness to vehicles and seats suggests the breadth of ritual purity and the need to cleanse even what is seemingly non-personal."
    },
    {
      "pk": 3015010,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 10,
      "text": "Anyone who touches anything under him will be unclean until evening. Anyone who carries those items must wash his clothes and bathe in water and will be unclean until evening.",
      "links": "<a href='/AIV/3/11/25'>Lev. 11:25</a>; <a href='/AIV/3/15/17'>Lev. 15:17</a>",
      "comment": "Cleansing requirements apply to all forms of contact, underlining the thoroughness and seriousness of remaining pure before God."
    },
    {
      "pk": 3015011,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 11,
      "text": "Whoever the man with the discharge touches without washing his hands in water must wash his clothes and bathe in water and will be unclean until evening.",
      "links": "<a href='/AIV/3/22/6'>Lev. 22:6</a>; <a href='/AIV/3/11/40'>Lev. 11:40</a>",
      "comment": "The role of washing hands before contact echoes themes later found in teachings on inner holiness and outward purity (cf. Mark 7:2-5)."
    },
    {
      "pk": 3015012,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 12,
      "text": "Any clay vessel the man with the discharge touches must be broken, and every wooden vessel must be washed with water.",
      "links": "<a href='/AIV/3/6/28'>Lev. 6:28</a>; <a href='/AIV/3/11/33'>Lev. 11:33</a>",
      "comment": "Clay vessels, being porous, were destroyed rather than washed, while wooden ones were washed. This underscores the cost of impurity and the seriousness of maintaining suitable vessels for holy purposes, hinting at the spiritual significance of vessels in the New Testament (2 Tim. 2:20-21)."
    },
    {
      "pk": 3015013,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 13,
      "text": "When the man with the discharge is cleansed from his flow, he must count seven days for his cleansing. He shall wash his clothes and bathe his body in fresh water, and he will be clean.",
      "links": "<a href='/AIV/3/14/8-9'>Lev. 14:8-9</a>; <a href='/AIV/4/19/11-13'>Num. 19:11-13</a>",
      "comment": "The seven days signify completeness in ritual restoration. This foreshadows the pattern of spiritual renewal found throughout Scripture."
    },
    {
      "pk": 3015014,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 14,
      "text": "On the eighth day, he shall take two turtledoves or two young pigeons and come before the LORD at the entrance of the meeting tent and give them to the priest.",
      "links": "<a href='/AIV/3/12/8'>Lev. 12:8</a>; <a href='/AIV/3/14/22'>Lev. 14:22</a>",
      "comment": "Sacrificial offerings on the eighth day highlight the priestly role in spiritual reconciliation and reentry into fellowship. The eighth day often symbolizes new beginnings (cf. Christ’s resurrection - Luke 24:1)."
    },
    {
      "pk": 3015015,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 15,
      "text": "The priest shall offer them, one as a sin offering and the other as a burnt offering. So the priest will make atonement for him before the LORD on account of his discharge.",
      "links": "<a href='/AIV/3/5/14'>Lev. 5:14</a>; <a href='/AIV/4/15/25'>Num. 15:25</a>",
      "comment": "Atonement and ritual purification are performed by the priest, pointing to the pattern of intercession and mediation on behalf of the people—a theme fulfilled in Christ, our High Priest (Heb. 7:25-27)."
    },
    {
      "pk": 3015016,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 16,
      "text": "If a man has an emission of semen, he must wash his whole body with water and will be unclean until evening.",
      "links": "<a href='/AIV/3/22/4'>Lev. 22:4</a>; <a href='/AIV/5/23/10'>Deut. 23:10</a>",
      "comment": "Sexual emissions, even natural, require ritual cleansing, demonstrating respect for the body and its functions as part of spiritual discipline."
    },
    {
      "pk": 3015017,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 17,
      "text": "Every garment and every leather that has semen on it must be washed with water and will be unclean until evening.",
      "links": "<a href='/AIV/3/11/32'>Lev. 11:32</a>",
      "comment": "Physical objects affected by sexual emissions also require cleansing, reflecting the holistic scope of ritual purity."
    },
    {
      "pk": 3015018,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 18,
      "text": "If a man has sexual relations with a woman and there is an emission of semen, both must bathe in water and will be unclean until evening.",
      "links": "<a href='/AIV/3/12/2'>Lev. 12:2</a>; <a href='/AIV/5/23/10'>Deut. 23:10</a>",
      "comment": "This regulation protects marital intimacy while preserving the sanctity of ritual purity. There's no condemnation, rather a process of restoration—a sign of God’s order."
    },
    {
      "pk": 3015019,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 19,
      "text": "When a woman has a discharge, and the discharge in her body is blood, she will be unclean for seven days. Anyone who touches her will be unclean until evening.",
      "links": "<a href='/AIV/3/12/2'>Lev. 12:2</a>; <a href='/AIV/3/15/24'>Lev. 15:24</a>",
      "comment": "This passage refers to menstruation and builds on previous regulations. The prescribed period mirrors other creation cycles, again expressing the sanctity of the rhythms of life."
    },
    {
      "pk": 3015020,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 20,
      "text": "Everything she lies on during her period will be unclean, and everything she sits on will be unclean.",
      "links": "<a href='/AIV/3/15/4'>Lev. 15:4</a>; <a href='/AIV/3/15/26'>Lev. 15:26</a>",
      "comment": "Objects in contact with the woman during her cycle also transmit uncleanness, keeping the community mindful of bodily processes and their spiritual dimension."
    },
    {
      "pk": 3015021,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 21,
      "text": "Anyone who touches her bed must wash his clothes and bathe in water and will be unclean until evening.",
      "links": "<a href='/AIV/3/15/22'>Lev. 15:22</a>; <a href='/AIV/3/11/24-28'>Lev. 11:24-28</a>",
      "comment": "Practical hygienic guidelines undergird ritual rules, protecting the wellbeing and purity of God’s people."
    },
    {
      "pk": 3015022,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 22,
      "text": "Anyone who touches any object she sits on must wash his clothes and bathe in water and will be unclean until evening.",
      "links": "<a href='/AIV/3/15/6'>Lev. 15:6</a>; <a href='/AIV/3/11/31'>Lev. 11:31</a>",
      "comment": "Repetition drives home the seriousness of maintaining purity of the community in attendance of holy things."
    },
    {
      "pk": 3015023,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 23,
      "text": "If anyone touches anything on her bed or anything she sat on, he will be unclean until evening.",
      "links": "<a href='/AIV/3/15/21'>Lev. 15:21</a>; <a href='/AIV/3/15/27'>Lev. 15:27</a>",
      "comment": "There is no distinction between direct and indirect contact; both ways necessitate cleansing."
    },
    {
      "pk": 3015024,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 24,
      "text": "If a man lies with her and her menstrual impurity is upon him, he will be unclean for seven days, and every bed he lies on will be unclean.",
      "links": "<a href='/AIV/3/20/18'>Lev. 20:18</a>; <a href='/AIV/3/15/19'>Lev. 15:19</a>",
      "comment": "Even marital relations during her cycle are regulated for ritual reasons, reinforcing the call to order and reverence."
    },
    {
      "pk": 3015025,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 25,
      "text": "If a woman’s discharge of blood continues for many days beyond her regular period, or if it runs outside her normal cycle, she will be unclean during the time of her abnormal discharge, just as she is during her period.",
      "links": "<a href='/AIV/3/15/19'>Lev. 15:19</a>; <a href='/AIV/4/12/12'>Num. 12:12</a>",
      "comment": "Unusual or persistent discharges receive special attention, showing that even atypical situations are addressed by God’s care for the holy people. This passage is directly referenced in the Gospels in the healing of the woman with the issue of blood (see <a href='/AIV/40/9/20-22'>Matt. 9:20-22</a>)."
    },
    {
      "pk": 3015026,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 26,
      "text": "Every bed she lies on during the days of her discharge will be as during her period, and everything she sits on will be unclean, as during her cycle.",
      "links": "<a href='/AIV/3/15/20'>Lev. 15:20</a>; <a href='/AIV/3/15/23'>Lev. 15:23</a>",
      "comment": "The rules for abnormal discharge mirror those for regular cycles, stressing consistency of purity laws."
    },
    {
      "pk": 3015027,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 27,
      "text": "Anyone who touches them will be unclean and must wash his clothes and bathe in water and will be unclean until evening.",
      "links": "<a href='/AIV/3/15/22'>Lev. 15:22</a>; <a href='/AIV/3/11/25'>Lev. 11:25</a>",
      "comment": "Again, ritual purity is maintained through cleansing and temporary separation, underscoring God’s concern for wholeness."
    },
    {
      "pk": 3015028,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 28,
      "text": "When her discharge stops, she must count for herself seven days, then she will be clean.",
      "links": "<a href='/AIV/3/15/13'>Lev. 15:13</a>; <a href='/AIV/3/14/8'>Lev. 14:8</a>",
      "comment": "The seven-day count is a ritual pattern marking full transition from impurity back to fellowship—a symbolic restoration."
    },
    {
      "pk": 3015029,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 29,
      "text": "On the eighth day, she must take two turtledoves or two young pigeons, bring them to the priest at the entrance to the meeting tent.",
      "links": "<a href='/AIV/3/15/14'>Lev. 15:14</a>; <a href='/AIV/3/12/8'>Lev. 12:8</a>",
      "comment": "The repetition of the eighth day ritual, with bird offerings and priestly mediation, echoes the process for men. The priest’s role is central, showing that restoration to holiness comes by sacramental mediation."
    },
    {
      "pk": 3015030,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 30,
      "text": "Then the priest shall offer one as a sin offering and the other as a burnt offering, and make atonement for her before the LORD for her discharge.",
      "links": "<a href='/AIV/3/5/14-19'>Lev. 5:14-19</a>; <a href='/AIV/3/15/15'>Lev. 15:15</a>",
      "comment": "The twin offerings restore the woman, confirming the connection between sacramental acts and atonement—a pattern fulfilled spiritually in the New Testament (cf. John 20:21-23)."
    },
    {
      "pk": 3015031,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 31,
      "text": "\"You must separate the Israelites from their uncleanness, so they do not die in their uncleanness by defiling my sanctuary, which is among them.\"",
      "links": "<a href='/AIV/3/16/16'>Lev. 16:16</a>; <a href='/AIV/4/5/3'>Num. 5:3</a>",
      "comment": "God dwells among His people, so ritual purity is crucial for survival and fellowship. This foreshadows spiritual purity and God’s presence in Christ and His Church (Eph. 2:21-22)."
    },
    {
      "pk": 3015032,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 32,
      "text": "This is the law for the one with a bodily discharge and for him who has an emission of semen, becoming unclean by it;",
      "links": "<a href='/AIV/3/15/2'>Lev. 15:2</a>; <a href='/AIV/3/15/16'>Lev. 15:16</a>",
      "comment": "Summary statements are common in Leviticus, underscoring the completeness of God’s instruction for the community."
    },
    {
      "pk": 3015033,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 15,
      "verse": 33,
      "text": "for the woman with a discharge, whether from her monthly period or any abnormal discharge, and for the man who lies with a woman who is unclean.",
      "links": "<a href='/AIV/3/15/25'>Lev. 15:25</a>; <a href='/AIV/3/15/24'>Lev. 15:24</a>",
      "comment": "The end of the chapter summarizes both men’s and women’s purity laws, reiterating the centrality of holiness and purification. These ancient rites foreshadow baptism and sacramental cleansing in Christian faith, which brings believers from uncleanness into grace and communion with God."
    }
  ],
  "translatedAt": "2025-12-24T01:18:26.305Z"
}