{
  "book": 3,
  "bookName": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 14,
  "verses": [
    {
      "pk": 3014001,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 1,
      "text": "The LORD spoke to Moses, saying:",
      "links": "<a href='/AIV/3/13/1'>Lev. 13:1</a>",
      "comment": "This begins the LORD’s instruction to Moses concerning the ceremonial cleansing for those healed from skin disease. Highlights divine revelation through Moses."
    },
    {
      "pk": 3014002,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 2,
      "text": "This shall be the law for the leper on the day of his cleansing. He shall be brought to the priest.",
      "links": "<a href='/AIV/3/13/2'>Lev. 13:2</a>; <a href='/AIV/40/8/4'>Matt. 8:4</a>",
      "comment": "Notice the importance of the priest’s role as intermediary for cleansing—a precursor to priestly mediation in the New Covenant. See Jesus sending cleansed lepers to the priests (Matt. 8:4)."
    },
    {
      "pk": 3014003,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 3,
      "text": "The priest shall go out of the camp, and the priest shall examine him. If the disease is healed in the leprous person,",
      "links": "<a href='/AIV/4/5/2-4'>Num. 5:2-4</a>",
      "comment": "The necessity to approach those excluded is a reminder of ministry to the outcast—a foreshadowing of Christ’s reaching out to the marginalized."
    },
    {
      "pk": 3014004,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 4,
      "text": "Then the priest shall command that two living clean birds be taken, and cedar wood, scarlet yarn, and hyssop, for him who is to be cleansed.",
      "links": "<a href='/AIV/3/14/49'>Lev. 14:49</a>; <a href='/AIV/4/19/6'>Num. 19:6</a>; <a href='/AIV/43/19/29'>John 19:29</a>",
      "comment": "The items chosen have deep symbolic meaning—wood, blood (scarlet), and hyssop—also present in Christ’s crucifixion. Hyssop is significant in sacrificial and cleansing rites."
    },
    {
      "pk": 3014005,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 5,
      "text": "The priest shall command that one of the birds be killed in an earthen vessel over running water.",
      "links": "<a href='/AIV/3/14/50'>Lev. 14:50</a>",
      "comment": "The use of an earthen vessel and living water prefigures cleansing by water and blood—see John 19:34 and the sacramental symbolism of baptism."
    },
    {
      "pk": 3014006,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 6,
      "text": "He shall take the living bird, with the cedar wood, scarlet yarn, and hyssop, and dip them and the living bird in the blood of the bird that was killed over the running water.",
      "links": "<a href='/AIV/2/12/22'>Ex. 12:22</a>; <a href='/AIV/3/14/51'>Lev. 14:51</a>",
      "comment": "Dipping into blood and water relates to sprinkling for purification; echoes Passover (Ex. 12:22)."
    },
    {
      "pk": 3014007,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 7,
      "text": "He shall sprinkle the blood seven times on him who is to be cleansed of the leprosy, and then he shall pronounce him clean, and shall let the living bird go into the open field.",
      "links": "<a href='/AIV/3/4/6'>Lev. 4:6</a>; <a href='/AIV/40/8/2-4'>Matt. 8:2-4</a>",
      "comment": "Sevenfold sprinkling symbolizes perfect purification and fullness of grace; the release of the living bird points toward restoration and freedom after cleansing."
    },
    {
      "pk": 3014008,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 8,
      "text": "He who is to be cleansed shall wash his clothes, shave off all his hair, and bathe himself in water. Then he shall be clean. After that he may come into the camp, but shall live outside his tent for seven days.",
      "links": "<a href='/AIV/3/8/6-7'>Lev. 8:6-7</a>; <a href='/AIV/4/12/14'>Num. 12:14</a>",
      "comment": "A threefold physical cleansing ritual reflects the importance of both inward and outward purity. The waiting period before full restoration emphasizes preparation for re-entering community."
    },
    {
      "pk": 3014009,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 9,
      "text": "On the seventh day he shall shave off all his hair from his head, his beard, and his eyebrows. He shall wash his clothes and bathe his body in water, and he shall be clean.",
      "links": "<a href='/AIV/3/14/8'>Lev. 14:8</a>",
      "comment": "Total shaving underscores a complete break with the former life marked by disease, and full restoration to purity."
    },
    {
      "pk": 3014010,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 10,
      "text": "On the eighth day he shall take two male lambs without blemish, one ewe lamb without blemish, three-tenths of an ephah of fine flour mixed with oil for a grain offering, and one log of oil.",
      "links": "<a href='/AIV/3/9/2'>Lev. 9:2</a>; <a href='/AIV/3/2/1'>Lev. 2:1</a>",
      "comment": "The eighth day is associated with new beginnings and consecration. Lambs without blemish draw parallels to Christ, the Lamb without spot (John 1:29)."
    },
    {
      "pk": 3014011,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 11,
      "text": "And the priest who cleanses him shall set the man who is to be cleansed, and these things, before the LORD at the entrance to the tent of meeting.",
      "links": "<a href='/AIV/2/29/11'>Ex. 29:11</a>",
      "comment": "Positioning at the entrance signifies the need to be presented before God’s presence to be restored into covenant life."
    },
    {
      "pk": 3014012,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 12,
      "text": "The priest shall take one of the male lambs and offer it as a guilt offering, along with the log of oil, and wave them as a wave offering before the LORD.",
      "links": "<a href='/AIV/3/5/6'>Lev. 5:6</a>; <a href='/AIV/3/7/7'>Lev. 7:7</a>",
      "comment": "The guilt offering acknowledges sin and restoration. The oil represents the Holy Spirit’s sanctifying work—note spiritual symbolism in anointing."
    },
    {
      "pk": 3014013,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 13,
      "text": "He shall slaughter the lamb in the place where they slaughter the sin offering and the burnt offering, in the holy place; for the guilt offering, like the sin offering, belongs to the priest. It is most holy.",
      "links": "<a href='/AIV/3/6/25'>Lev. 6:25</a>; <a href='/AIV/3/6/18'>Lev. 6:18</a>",
      "comment": "Emphasizes the priest’s role in handling sacrifices and the concept of ‘most holy’—reserved to God and His ordained agents."
    },
    {
      "pk": 3014014,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 14,
      "text": "The priest shall take some of the blood of the guilt offering, and put it on the lobe of the right ear of him who is to be cleansed, on the thumb of his right hand, and on the big toe of his right foot.",
      "links": "<a href='/AIV/2/29/20'>Ex. 29:20</a>; <a href='/AIV/3/8/23'>Lev. 8:23</a>",
      "comment": "Blood applied to key body parts symbolizes sanctification of hearing, service, and daily walk. Christ sanctifies the whole person in redemption."
    },
    {
      "pk": 3014015,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 15,
      "text": "Then the priest shall take some of the log of oil and pour it into the palm of his own left hand.",
      "links": "<a href='/AIV/3/8/30'>Lev. 8:30</a>",
      "comment": "Oil typically signifies consecration and the indwelling of the Spirit. Christ fulfills all rites as the Anointed One (Messiah)."
    },
    {
      "pk": 3014016,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 16,
      "text": "And the priest shall dip his right finger in the oil that is in his left hand, and sprinkle some of the oil with his finger seven times before the LORD.",
      "links": "<a href='/AIV/3/8/11'>Lev. 8:11</a>",
      "comment": "Sevenfold sprinkling again signifies fullness of sanctification and blessing from God; connects to spiritual perfection and completeness."
    },
    {
      "pk": 3014017,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 17,
      "text": "Some of the oil that is left in the priest’s hand, he shall put on the lobe of the right ear, on the thumb of the right hand, and on the big toe of the right foot of him who is to be cleansed, on top of the blood of the guilt offering.",
      "links": "<a href='/AIV/2/29/21'>Ex. 29:21</a>",
      "comment": "Combining oil with blood atop the earlier application prefigures the completeness of sacramental grace—a sign of total anointing through the Spirit after cleansing by Christ’s blood."
    },
    {
      "pk": 3014018,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 18,
      "text": "The rest of the oil in the priest’s hand he shall put on the head of him who is to be cleansed. Then the priest shall make atonement for him before the LORD.",
      "links": "<a href='/AIV/3/8/12'>Lev. 8:12</a>; <a href='/AIV/3/5/16'>Lev. 5:16</a>",
      "comment": "Anointing the cleansed person’s head is reminiscent of priestly and kingly consecration—anticipates Christ’s threefold office and the believer’s sanctification."
    },
    {
      "pk": 3014019,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 19,
      "text": "Then the priest shall offer the sin offering and make atonement for him who is to be cleansed from his uncleanness. After that he shall slaughter the burnt offering.",
      "links": "<a href='/AIV/3/4/26'>Lev. 4:26</a>; <a href='/AIV/3/1/3'>Lev. 1:3</a>",
      "comment": "The duality of sin and burnt offerings demonstrates full restoration: forgiveness and consecration, completed through priestly mediation."
    },
    {
      "pk": 3014020,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 20,
      "text": "And the priest shall offer the burnt offering and the grain offering on the altar. So the priest shall make atonement for him, and he shall be clean.",
      "links": "<a href='/AIV/3/5/10'>Lev. 5:10</a>; <a href='/AIV/3/6/14'>Lev. 6:14</a>",
      "comment": "Ultimate cleansing only comes through divinely instituted rites, administered by the priest. Prefigures once-for-all atonement through Christ as our eternal High Priest."
    },
    {
      "pk": 3014021,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 21,
      "text": "But if he is poor and cannot afford these, he shall take one male lamb for a guilt offering to be waved, to make atonement for him, and one-tenth of an ephah of fine flour mixed with oil for a grain offering, and a log of oil.",
      "links": "<a href='/AIV/3/5/7'>Lev. 5:7</a>",
      "comment": "God provides for the poor, allowing them access to atonement. The universality of grace available to all is a key biblical theme."
    },
    {
      "pk": 3014022,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 22,
      "text": "And two turtledoves or two young pigeons, such as he is able to afford. One shall be for a sin offering and the other for a burnt offering.",
      "links": "<a href='/AIV/3/5/11'>Lev. 5:11</a>; <a href='/AIV/42/2/24'>Luke 2:24</a>",
      "comment": "Offering birds reflects mercy to the lowly; recall this is the same offering Mary and Joseph gave after Jesus’ birth (Luke 2:24), tying the Law to Gospel events."
    },
    {
      "pk": 3014023,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 23,
      "text": "On the eighth day he shall bring them for his cleansing to the priest, to the entrance of the tent of meeting before the LORD.",
      "links": "<a href='/AIV/3/14/11'>Lev. 14:11</a>",
      "comment": "The eighth day for completion and renewal—time of circumcision and restoration, which finds spiritual fulfillment in new birth in Christ."
    },
    {
      "pk": 3014024,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 24,
      "text": "And the priest shall take the lamb of the guilt offering and the log of oil, and the priest shall wave them as a wave offering before the LORD.",
      "links": "<a href='/AIV/3/14/12'>Lev. 14:12</a>",
      "comment": "Wave offerings, displaying the objects before God, express dedication and thanksgiving—elements essential to sacramental worship."
    },
    {
      "pk": 3014025,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 25,
      "text": "And he shall slaughter the lamb of the guilt offering. Then the priest shall take some of the blood of the guilt offering and put it on the lobe of the right ear, thumb of the right hand, and big toe of the right foot of him who is to be cleansed.",
      "links": "<a href='/AIV/3/14/14'>Lev. 14:14</a>",
      "comment": "Repetition reinforces the sanctifying effect of the priestly ritual. Full restoration involves all facets of the person, body and mind."
    },
    {
      "pk": 3014026,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 26,
      "text": "And the priest shall pour some of the oil into the palm of his own left hand.",
      "links": "<a href='/AIV/3/14/15'>Lev. 14:15</a>",
      "comment": "Priestly action with oil remains a sign of conferral of grace and anointing—anticipates ritual sacraments."
    },
    {
      "pk": 3014027,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 27,
      "text": "He shall sprinkle with his right finger some of the oil that is in his left hand seven times before the LORD.",
      "links": "<a href='/AIV/3/14/16'>Lev. 14:16</a>",
      "comment": "Seven times again alludes to completeness, entire sanctification before God."
    },
    {
      "pk": 3014028,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 28,
      "text": "And the priest shall put some of the oil that is in his hand on the lobe of the right ear, on the thumb of the right hand, and on the big toe of the right foot of him who is to be cleansed, on top of the blood of the guilt offering.",
      "links": "<a href='/AIV/3/14/17'>Lev. 14:17</a>",
      "comment": "Both blood and oil applied together signify the dual action of redemption and sanctification—hinting at visible, enacted grace."
    },
    {
      "pk": 3014029,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 29,
      "text": "And the rest of the oil that is in the priest’s hand he shall put on the head of him who is to be cleansed, to make atonement for him before the LORD.",
      "links": "<a href='/AIV/3/14/18'>Lev. 14:18</a>",
      "comment": "Anointing the cleansed parallels priestly ordination; the centrality of that ritual is carried forward in the Church’s sacraments."
    },
    {
      "pk": 3014030,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 30,
      "text": "And he shall offer one of the turtledoves or young pigeons, such as he can afford,",
      "links": "<a href='/AIV/3/12/8'>Lev. 12:8</a>",
      "comment": "Accessibility in worship is maintained without eliminating the need for sacrifice; see Lev. 12:8 for similar provision."
    },
    {
      "pk": 3014031,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 31,
      "text": "One as a sin offering and the other as a burnt offering, along with the grain offering. So the priest shall make atonement before the LORD for him who is to be cleansed.",
      "links": "<a href='/AIV/3/14/19-20'>Lev. 14:19-20</a>",
      "comment": "Both sin and burnt offerings point to forgiveness and total devotion—a complete lifting of impurity and restoration to God."
    },
    {
      "pk": 3014032,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 32,
      "text": "This is the law for him in whom there is a case of leprosy who cannot afford the offerings for his cleansing.",
      "links": "<a href='/AIV/3/14/21-22'>Lev. 14:21-22</a>",
      "comment": "Again, God’s equitable approach ensures the poor are not excluded from sacramental grace however simple the gifts."
    },
    {
      "pk": 3014033,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 33,
      "text": "The LORD spoke to Moses and Aaron, saying:",
      "links": "<a href='/AIV/3/13/1'>Lev. 13:1</a>",
      "comment": "Now, a new section begins focusing on laws for defilement in houses—a broadening of the scope for communal and liturgical cleanliness."
    },
    {
      "pk": 3014034,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 34,
      "text": "When you enter the land of Canaan, which I give you as a possession, and I put a case of leprous disease in a house in the land you possess,",
      "links": "<a href='/AIV/3/14/35'>Lev. 14:35</a>; <a href='/AIV/3/13/47-59'>Lev. 13:47-59</a>",
      "comment": "Physical impurity in homes underscores danger of sin spreading in communal life—pointing to the necessity of ritual and moral vigilance."
    },
    {
      "pk": 3014035,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 35,
      "text": "then the owner of the house shall come and tell the priest, saying, ‘It seems to me that there is some kind of disease in my house.’",
      "links": "<a href='/AIV/3/13/49'>Lev. 13:49</a>",
      "comment": "The priest, again, is the mediator of cleansing, overseeing not just individuals but households—mirroring the apostolic office."
    },
    {
      "pk": 3014036,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 36,
      "text": "Then the priest shall command that they clear out the house before the priest goes in to examine the disease, so that nothing in the house may become unclean. Afterward the priest shall go in to inspect the house.",
      "links": "<a href='/AIV/3/11/33'>Lev. 11:33</a>",
      "comment": "Cleansing precedes examination so the contamination does not spread to what is holy—suggests spiritual preparation before church rites."
    },
    {
      "pk": 3014037,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 37,
      "text": "He shall examine the disease, and if the disease is in the walls of the house, with greenish or reddish spots that appear deeper than the surface,",
      "links": "<a href='/AIV/3/13/2'>Lev. 13:2</a>",
      "comment": "Visible corruption at the heart of a home means more than surface impurity—spiritual application warns against lukewarm faith."
    },
    {
      "pk": 3014038,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 38,
      "text": "then the priest shall go out of the house to the entrance, and shut up the house for seven days.",
      "links": "<a href='/AIV/3/13/4'>Lev. 13:4</a>",
      "comment": "A seven-day quarantine allows time for impurity to be discerned—echoes the patient discernment required in spiritual discipline."
    },
    {
      "pk": 3014039,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 39,
      "text": "And the priest shall come again on the seventh day, and look. If the disease has spread in the walls of the house,",
      "links": "<a href='/AIV/3/13/7'>Lev. 13:7</a>",
      "comment": "Repeated inspection mirrors the process of examination and pastoral care—community restoration is always a careful process."
    },
    {
      "pk": 3014040,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 40,
      "text": "then the priest shall command that they take out the stones in which the disease is and throw them into an unclean place outside the city.",
      "links": "<a href='/AIV/3/13/46'>Lev. 13:46</a>",
      "comment": "Unclean elements must be removed and exiled—a model not just for ritual purity but spiritual reform; the Church later institutes similar disciplines."
    },
    {
      "pk": 3014041,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 41,
      "text": "He shall have the inside of the house scraped all around, and the plaster that they scrape off shall be poured out into an unclean place outside the city.",
      "links": "<a href='/AIV/3/14/40'>Lev. 14:40</a>",
      "comment": "Scraping the walls signifies both thoroughness and the idea of confession: removing every trace of sin to restore wholeness."
    },
    {
      "pk": 3014042,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 42,
      "text": "Then they shall take other stones and put them in the place of those stones, and he shall take other plaster and plaster the house.",
      "links": "<a href='/AIV/23/58/12'>Isa. 58:12</a>",
      "comment": "New stones and fresh plaster symbolize the renewal and rebuilding of life after repentance—foreshadowing spiritual renewal in Christ (Isa. 58:12)."
    },
    {
      "pk": 3014043,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 43,
      "text": "If the disease returns and breaks out in the house, after he has taken out the stones and scraped the house and plastered it,",
      "links": "<a href='/AIV/3/13/56-57'>Lev. 13:56-57</a>",
      "comment": "Persistent corruption requires much deeper cleansing than outward remedies—speaks to the gravity of unrepented sin."
    },
    {
      "pk": 3014044,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 44,
      "text": "then the priest shall go and look. If the disease has spread in the house, it is a persistent leprous disease in the house: it is unclean.",
      "links": "<a href='/AIV/3/13/11'>Lev. 13:11</a>",
      "comment": "Spiritual application: where corruption is ingrained, the entire structure must be condemned—a call to radical conversion."
    },
    {
      "pk": 3014045,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 45,
      "text": "And he shall break down the house—its stones, timber, and all the plaster of the house—and he shall carry them out of the city to an unclean place.",
      "links": "<a href='/AIV/3/13/52'>Lev. 13:52</a>; <a href='/AIV/40/7/26-27'>Matt. 7:26-27</a>",
      "comment": "Total destruction signifies the seriousness of unrepentant impurity. Jesus likens spiritual houses built on sand to destruction (Matt. 7:26-27)."
    },
    {
      "pk": 3014046,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 46,
      "text": "Meanwhile, whoever goes into the house while it is shut up shall be unclean until the evening.",
      "links": "<a href='/AIV/3/11/25'>Lev. 11:25</a>",
      "comment": "Contact with impurity—even unwittingly—requires purification, including time and ritual; stresses how easily spiritual contamination can spread."
    },
    {
      "pk": 3014047,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 47,
      "text": "And whoever sleeps in the house shall wash his clothes, and whoever eats in the house shall wash his clothes.",
      "links": "<a href='/AIV/3/11/28'>Lev. 11:28</a>",
      "comment": "Even closer association with impurity requires washing—a lesson that fellowship should be marked by vigilance and self-examination."
    },
    {
      "pk": 3014048,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 48,
      "text": "But if the priest comes and examines, and the disease has not spread in the house after it was plastered, then the priest shall pronounce the house clean, for the disease is healed.",
      "links": "<a href='/AIV/3/12/7'>Lev. 12:7</a>",
      "comment": "Restoration is possible, even after disease—reflects hope for renewal and rehabilitation after trials, both physically and spiritually."
    },
    {
      "pk": 3014049,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 49,
      "text": "To cleanse the house, he shall take two birds, cedar wood, scarlet yarn, and hyssop.",
      "links": "<a href='/AIV/3/14/4'>Lev. 14:4</a>",
      "comment": "The ritual for houses mirrors the ritual for persons—unity between physical and spiritual cleansing in God’s plan."
    },
    {
      "pk": 3014050,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 50,
      "text": "He shall kill one of the birds in an earthen vessel over running water.",
      "links": "<a href='/AIV/3/14/5'>Lev. 14:5</a>",
      "comment": "Same ritual act—underscores liturgical continuity and the power of sacrifice to restore the impure to community life."
    },
    {
      "pk": 3014051,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 51,
      "text": "He shall take the cedar wood, hyssop, scarlet yarn, and the living bird, and dip them in the blood of the bird killed over running water, and sprinkle the house seven times.",
      "links": "<a href='/AIV/3/14/6-7'>Lev. 14:6-7</a>",
      "comment": "The sevenfold sprinkling purifies the entire dwelling—spiritual parallel to comprehensive cleansing and blessing."
    },
    {
      "pk": 3014052,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 52,
      "text": "He shall cleanse the house with the blood of the bird, with the running water, with the living bird, with the cedar wood, hyssop, and scarlet yarn.",
      "links": "<a href='/AIV/3/14/6'>Lev. 14:6</a>",
      "comment": "The union of blood and water again alludes to Christ’s death; purification by these elements has deep typological meaning later picked up in Christian sacramentology."
    },
    {
      "pk": 3014053,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 53,
      "text": "And he shall let the living bird go out of the city into the open field. So he shall make atonement for the house, and it shall be clean.",
      "links": "<a href='/AIV/3/14/7'>Lev. 14:7</a>",
      "comment": "Release of the living bird signals both atonement and freedom—a foreshadow of the liberty obtained in Christ’s sacrifice."
    },
    {
      "pk": 3014054,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 54,
      "text": "This is the law for any case of leprous disease: for an outbreak,",
      "links": "<a href='/AIV/3/13/1'>Lev. 13:1</a>",
      "comment": "Summary statement—Leprosy laws cover not just individuals, but outbreaks in clothes and houses, stressing the comprehensive nature of purity in God’s people."
    },
    {
      "pk": 3014055,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 55,
      "text": "and for leprous disease in a garment or in a house,",
      "links": "<a href='/AIV/3/13/47'>Lev. 13:47</a>",
      "comment": "For garments and homes, ritual and moral cleansing are alike—drawing out the spiritual message to cleanse every area of life from the taint of sin."
    },
    {
      "pk": 3014056,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 56,
      "text": "and for a swelling or an eruption or a spot,",
      "links": "<a href='/AIV/3/13/2-3'>Lev. 13:2-3</a>",
      "comment": "Each type of skin issue has significance: sin can manifest in various forms, but God provides a way for cleansing and restoration through rite and ritual."
    },
    {
      "pk": 3014057,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 14,
      "verse": 57,
      "text": "to show when it is unclean and when it is clean. This is the law for leprous disease.",
      "links": "<a href='/AIV/3/10/10'>Lev. 10:10</a>",
      "comment": "Final affirmation: only through divinely appointed rituals, administered by the priesthood, can one know true purity—prefigures Christ’s mediatorship and the Church’s safeguarding of spiritual health."
    }
  ],
  "translatedAt": "2025-12-24T01:17:53.759Z"
}