{
  "book": 3,
  "bookName": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 4,
  "verses": [
    {
      "pk": 3004001,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 1,
      "text": "The LORD spoke to Moses, saying:",
      "links": "<a href='/AIV/2/29/42'>Ex. 29:42</a>",
      "comment": "This introductory phrase is common throughout Leviticus, signifying the divine origin of the laws. The Lord personally communicates these laws to Moses, underscoring their sacred authority."
    },
    {
      "pk": 3004002,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 2,
      "text": "Speak to the people of Israel, saying, 'If anyone sins unintentionally against any of the LORD’s commandments, doing what ought not to be done,",
      "links": "<a href='/AIV/3/5/15'>Lev. 5:15</a>; <a href='/AIV/4/15/22-29'>Num. 15:22-29</a>",
      "comment": "The focus here is on unintentional sin—mistakes rather than willful disobedience, which merits a distinct sacrificial system. Spiritual interpretation: All sin, even accidental, separates from God, needing atonement—a concept later fulfilled in Christ (Heb. 9:7-14)."
    },
    {
      "pk": 3004003,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 3,
      "text": "if the anointed priest sins, bringing guilt on the people, then he shall offer for his sin that he has committed a young bull without blemish to the LORD for a sin offering.",
      "links": "<a href='/AIV/3/8/12'>Lev. 8:12</a>; <a href='/AIV/58/5/3'>Heb. 5:3</a>",
      "comment": "The priest represents the people before God; when he sins, he brings guilt on all, thus special atonement is required. Christologically, this points to Christ as the ultimate High Priest (Heb. 7:26-28), who is sinless yet offered himself for the sins of all."
    },
    {
      "pk": 3004004,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 4,
      "text": "He shall bring the bull to the entrance of the tent of meeting before the LORD and lay his hand on the head of the bull and kill the bull before the LORD.",
      "links": "<a href='/AIV/3/1/4'>Lev. 1:4</a>; <a href='/AIV/3/16/15'>Lev. 16:15</a>",
      "comment": "Laying hands symbolizes identification with the offering, transferring guilt. The priest mediates between God and people, a foreshadowing of sacramental mediation and Christ's unique priesthood."
    },
    {
      "pk": 3004005,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 5,
      "text": "And the anointed priest shall take some of the blood of the bull and bring it into the tent of meeting.",
      "links": "<a href='/AIV/3/16/14'>Lev. 16:14</a>",
      "comment": "Blood, symbolizing life, signifies atonement when presented before God (Heb. 9:22). The blood later points to the power of Christ’s blood in New Testament redemption."
    },
    {
      "pk": 3004006,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 6,
      "text": "And the priest shall dip his finger in the blood and sprinkle some of the blood seven times before the LORD in front of the veil of the sanctuary.",
      "links": "<a href='/AIV/3/16/15'>Lev. 16:15</a>; <a href='/AIV/58/9/24-26'>Heb. 9:24–26</a>",
      "comment": "Seven signifies completion and perfection. The ritual foreshadows the perfect and final atonement in Christ, whose blood tore the veil (Matt. 27:51)."
    },
    {
      "pk": 3004007,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 7,
      "text": "And the priest shall put some of the blood on the horns of the altar of fragrant incense before the LORD that is in the tent of meeting; and all the rest of the blood of the bull he shall pour out at the base of the altar of burnt offering at the entrance of the tent of meeting.",
      "links": "<a href='/AIV/2/30/10'>Ex. 30:10</a>; <a href='/AIV/3/8/15'>Lev. 8:15</a>",
      "comment": "The altar of incense is where prayers ascend to God; placing blood here symbolizes intercession. Pouring the rest at the altar's base connects sacrificial death with the place of continual offering, hinting at perpetual mediation."
    },
    {
      "pk": 3004008,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 8,
      "text": "And all the fat of the bull of the sin offering he shall remove: the fat that covers the entrails, and all the fat that is on the entrails,",
      "links": "<a href='/AIV/3/1/9'>Lev. 1:9</a>",
      "comment": "Fat is regarded as the best portion, reserved for God, signifying the giving of the most valuable to the Lord. This practice reinforced reverence and the idea of total surrender."
    },
    {
      "pk": 3004009,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 9,
      "text": "and the two kidneys with the fat that is on them at the loins, and the long lobe of the liver that he shall remove with the kidneys",
      "links": "<a href='/AIV/3/1/13'>Lev. 1:13</a>",
      "comment": "Specific organs and fat are always mentioned as the portions to be burned, highlighting ritual consistency and dedication."
    },
    {
      "pk": 3004010,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 10,
      "text": "just as these are taken from the ox of the sacrifice of peace offerings, and the priest shall burn them on the altar of burnt offering.",
      "links": "<a href='/AIV/3/3/5'>Lev. 3:5</a>",
      "comment": "The burning of fat and organs on the altar reflects giving the 'best' to God, comparable to peace offerings. The ritual details reinforce continuity in worship practice."
    },
    {
      "pk": 3004011,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 11,
      "text": "But the skin of the bull and all its flesh, along with its head, legs, entrails, and dung,",
      "links": "<a href='/AIV/3/16/27'>Lev. 16:27</a>",
      "comment": "The non-sacred parts are excluded from the altar, recognizing the separation of holy and common."
    },
    {
      "pk": 3004012,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 12,
      "text": "all the rest of the bull—he shall carry outside the camp to a clean place, to the ash heap, and shall burn it on a wood fire. It shall be burned at the ash heap.",
      "links": "<a href='/AIV/3/6/11'>Lev. 6:11</a>; <a href='/AIV/58/13/11-12'>Heb. 13:11-12</a>",
      "comment": "Carrying the remains outside the camp signifies the removal of sin, paralleling Christ’s passion outside Jerusalem (Heb. 13:12), reinforcing the pattern of atonement and sanctification."
    },
    {
      "pk": 3004013,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 13,
      "text": "If the whole congregation of Israel sins unintentionally, and the matter is hidden from the eyes of the assembly, and they do any of the things by which anyone sins against the LORD’s commandments, though they did not know it, then they are guilty.",
      "links": "<a href='/AIV/3/5/15'>Lev. 5:15</a>",
      "comment": "Even collective, unintentional sin makes the people guilty—a reminder that ignorance does not absolve guilt, which necessitates communal responsibility and atonement."
    },
    {
      "pk": 3004014,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 14,
      "text": "When the sin which they have committed becomes known, the assembly shall bring a young bull as a sin offering and bring it before the tent of meeting.",
      "links": "<a href='/AIV/3/9/15'>Lev. 9:15</a>",
      "comment": "The community's participation in atonement stresses corporate solidarity, a foundation for the New Testament concept of the Church as one body."
    },
    {
      "pk": 3004015,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 15,
      "text": "And the elders of the congregation shall lay their hands on the head of the bull before the LORD, and the bull shall be killed before the LORD.",
      "links": "<a href='/AIV/3/16/21'>Lev. 16:21</a>",
      "comment": "Elders act as representatives, laying hands to signify identification with the offering—prefiguring leadership and mediation in worship and governance."
    },
    {
      "pk": 3004016,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 16,
      "text": "Then the anointed priest shall bring some of the blood of the bull into the tent of meeting.",
      "links": "<a href='/AIV/3/4/5'>Lev. 4:5</a>",
      "comment": "Repeats the priest's unique role in mediation and sacrifice, indicating the centrality of priestly service in approaching God."
    },
    {
      "pk": 3004017,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 17,
      "text": "And the priest shall dip his finger in the blood and sprinkle it seven times before the LORD in front of the veil.",
      "links": "<a href='/AIV/3/4/6'>Lev. 4:6</a>",
      "comment": "Again, the sevenfold sprinkling signifies perfect atonement and ritual completion."
    },
    {
      "pk": 3004018,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 18,
      "text": "And he shall put some of the blood on the horns of the altar that is before the LORD in the tent of meeting, and all the rest of the blood he shall pour out at the base of the altar of burnt offering at the entrance of the tent of meeting.",
      "links": "<a href='/AIV/3/4/7'>Lev. 4:7</a>",
      "comment": "Identical to the priestly offering for his own sin; the ritual process emphasizes the importance of sanctified space and mediation."
    },
    {
      "pk": 3004019,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 19,
      "text": "And all its fat he shall remove and burn on the altar.",
      "links": "<a href='/AIV/3/4/8'>Lev. 4:8</a>",
      "comment": "Repeating the earlier regulation, again stressing the need to give the best to God in worship."
    },
    {
      "pk": 3004020,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 20,
      "text": "And he shall do with the bull as he did with the bull of the sin offering, so shall he do with this. So the priest shall make atonement for them, and they shall be forgiven.",
      "links": "<a href='/AIV/3/4/26'>Lev. 4:26</a>; <a href='/AIV/58/9/22'>Heb. 9:22</a>",
      "comment": "Atonement brings forgiveness. The priest’s action as mediating forgiveness foreshadows the role of confession and absolution found in the sacramental life (John 20:23)."
    },
    {
      "pk": 3004021,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 21,
      "text": "And he shall carry the bull outside the camp and burn it as he burned the first bull. It is the sin offering for the assembly.",
      "links": "<a href='/AIV/3/4/12'>Lev. 4:12</a>; <a href='/AIV/58/13/11-12'>Heb. 13:11-12</a>",
      "comment": "Carrying the sacrifice outside the camp removes uncleanness from the community—prefiguring Christ carrying the sin of the world outside Jerusalem."
    },
    {
      "pk": 3004022,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 22,
      "text": "When a leader sins and unintentionally does any of the things which are forbidden by the LORD’s commandments, he becomes guilty.",
      "links": "<a href='/AIV/3/4/2'>Lev. 4:2</a>",
      "comment": "Leaders carry special responsibility; their atonement is needed for good governance and purity among the people—a principle enduring in Christian leadership."
    },
    {
      "pk": 3004023,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 23,
      "text": "If his sin which he has committed becomes known to him, he shall bring as his offering a male goat without blemish.",
      "links": "<a href='/AIV/3/4/28'>Lev. 4:28</a>; <a href='/AIV/3/5/15'>Lev. 5:15</a>",
      "comment": "A male goat is the prescribed atonement, distinct from the bull for priests or congregation. The need for the offering ‘without blemish’ reinforces the necessity of purity."
    },
    {
      "pk": 3004024,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 24,
      "text": "He shall lay his hand on the head of the goat and kill it at the place where they kill the burnt offering before the LORD. It is a sin offering.",
      "links": "<a href='/AIV/3/1/4'>Lev. 1:4</a>",
      "comment": "Again, the symbolism of transferring guilt, and the sacrificial system’s pointing towards Christ’s offering (2 Cor. 5:21)."
    },
    {
      "pk": 3004025,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 25,
      "text": "The priest shall take some of the blood of the sin offering with his finger and put it on the horns of the altar of burnt offering, and the rest of its blood he shall pour out at the base of the altar of burnt offering.",
      "links": "<a href='/AIV/3/4/7'>Lev. 4:7</a>",
      "comment": "Process for leaders is similar but slightly less elaborate, yet suggests the importance of leadership purity as a function of communal sanctity."
    },
    {
      "pk": 3004026,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 26,
      "text": "And all its fat he shall burn on the altar like the fat of the sacrifice of peace offerings. So the priest shall make atonement for him for his sin, and he will be forgiven.",
      "links": "<a href='/AIV/3/3/5'>Lev. 3:5</a>",
      "comment": "The ritual mirrors previous offerings, affirming that forgiveness is accessible through priestly mediation and sacrifice—prefiguring the perpetual efficacy of sacramental absolution."
    },
    {
      "pk": 3004027,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 27,
      "text": "If any one of the common people sins unintentionally, by doing any of the things against the LORD’s commandments that must not be done, and comes to realize his guilt,",
      "links": "<a href='/AIV/3/5/17'>Lev. 5:17</a>",
      "comment": "Similar regulations apply to all, reflecting the inclusive nature of God’s provision for forgiveness, a theme fulfilled in universal redemption (Rom. 3:23-24)."
    },
    {
      "pk": 3004028,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 28,
      "text": "when his sin becomes known to him, he shall bring for his offering a female goat without blemish for his sin which he has committed.",
      "links": "<a href='/AIV/3/5/6'>Lev. 5:6</a>",
      "comment": "For the common people, the offering is less costly, demonstrating God's fairness and concern for accessibility to forgiveness for all."
    },
    {
      "pk": 3004029,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 29,
      "text": "He shall lay his hand on the head of the sin offering and kill the sin offering at the place of burnt offering.",
      "links": "<a href='/AIV/3/1/5'>Lev. 1:5</a>",
      "comment": "Repetition of hand laying and killing, reinforcing understanding of identification with sacrifice."
    },
    {
      "pk": 3004030,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 30,
      "text": "And the priest shall take some of its blood with his finger and put it on the horns of the altar of burnt offering, and pour out all the rest of its blood at the base of the altar.",
      "links": "<a href='/AIV/3/4/25'>Lev. 4:25</a>",
      "comment": "Unity and consistency of ritual process, demonstrating God’s unchanging desire for order in worship."
    },
    {
      "pk": 3004031,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 31,
      "text": "And all its fat he shall remove, just as the fat is removed from the peace offerings, and the priest shall burn it on the altar for a pleasing aroma to the LORD. So the priest shall make atonement for him, and he shall be forgiven.",
      "links": "<a href='/AIV/3/3/16'>Lev. 3:16</a>",
      "comment": "The priest's atonement brings forgiveness—a type for Christ's intercessory role and the necessity of priestly mediation even today."
    },
    {
      "pk": 3004032,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 32,
      "text": "If he brings a lamb as his sin offering, he shall bring a female without blemish.",
      "links": "<a href='/AIV/3/5/7'>Lev. 5:7</a>",
      "comment": "Alternate offering of a lamb reflects accessibility and variety; 'without blemish' foreshadows the sinless nature of Christ (1 Pet. 1:19)."
    },
    {
      "pk": 3004033,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 33,
      "text": "He shall lay his hand on the head of the sin offering and kill it as a sin offering at the place where they kill the burnt offering.",
      "links": "<a href='/AIV/3/1/4'>Lev. 1:4</a>",
      "comment": "Repetitive, emphasizing the details of sacrificial worship; portrays worship through prescribed forms and ritual."
    },
    {
      "pk": 3004034,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 34,
      "text": "Then the priest shall take some of the blood of the sin offering with his finger and put it on the horns of the altar of burnt offering, and pour out all the rest of its blood at the base of the altar.",
      "links": "<a href='/AIV/3/4/30'>Lev. 4:30</a>",
      "comment": "The repeated process reinforces theological patterns of atonement, purification, and forgiveness through priestly acts."
    },
    {
      "pk": 3004035,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 4,
      "verse": 35,
      "text": "And all its fat he shall remove, just as the fat is removed from the lamb of the peace offering, and the priest shall burn it on the altar with the offerings made by fire to the LORD. So the priest shall make atonement for him for the sin he has committed, and he will be forgiven.",
      "links": "<a href='/AIV/3/4/31'>Lev. 4:31</a>; <a href='/AIV/58/9/22'>Heb. 9:22</a>",
      "comment": "Priestly mediation effects forgiveness; worship through sacrifice is both literal and typological, pointing ultimately to Christ, and the ongoing sacramental means of grace."
    }
  ],
  "translatedAt": "2025-12-24T01:11:37.578Z"
}