{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 27,
  "verses": [
    {
      "pk": 27001,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 1,
      "text": "When morning came, all the chief priests and elders of the people took counsel against Jesus to put him to death.",
      "links": "<a href='/AIV/41/15/1'>Mark 15:1</a>; <a href='/AIV/42/22/66'>Luke 22:66</a>",
      "comment": "The religious leaders convene early in the morning, highlighting the urgency and unanimity of their decision. This aligns with prophetic passages about the suffering servant (Isaiah 53)."
    },
    {
      "pk": 27002,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 2,
      "text": "They bound him, led him away, and handed him over to Pilate the governor.",
      "links": "<a href='/AIV/43/18/28'>John 18:28</a>",
      "comment": "Jesus is shifted from religious to civil authorities, fulfilling his prediction of being handed over to the Gentiles (<a href='/AIV/40/20/18-19'>Matt. 20:18–19</a>)."
    },
    {
      "pk": 27003,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 3,
      "text": "Then Judas, who had betrayed him, seeing that Jesus was condemned, was filled with remorse and returned the thirty pieces of silver to the chief priests and elders,",
      "links": "<a href='/AIV/40/26/15'>Matt. 26:15</a>; <a href='/AIV/44/1/18'>Acts 1:18</a>",
      "comment": "Judas' remorse reveals an awareness of grave sin, echoing concepts of repentance and confession."
    },
    {
      "pk": 27004,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 4,
      "text": "\"I have sinned by betraying innocent blood,\" he said. But they replied, \"What is that to us? You see to it.\"",
      "links": "<a href='/AIV/5/27/25'>Deut. 27:25</a>",
      "comment": "Judas acknowledges his sin, but the leaders' response shows their spiritual blindness. The language of 'innocent blood' connects to Old Testament laws about bloodguilt."
    },
    {
      "pk": 27005,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 5,
      "text": "So he threw the silver into the temple and left. Then he went away and hanged himself.",
      "links": "<a href='/AIV/10/17/23'>2 Sam. 17:23</a>",
      "comment": "Judas’ tragedy stands as a powerful warning about the consequences of despair and rejecting God's mercy."
    },
    {
      "pk": 27006,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 6,
      "text": "The chief priests took the silver pieces and said, \"It is not lawful to put them into the temple treasury, since it is blood money.\"",
      "links": "<a href='/AIV/5/23/18'>Deut. 23:18</a>",
      "comment": "The priests’ legalism contrasts their prior complicity in Jesus’ condemnation, highlighting hypocrisy. Their concern over 'blood money' is ironically fulfilled prophecy."
    },
    {
      "pk": 27007,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 7,
      "text": "So they discussed it together and bought with them the potter’s field as a burial place for foreigners.",
      "links": "<a href='/AIV/38/11/13'>Zech. 11:13</a>",
      "comment": "The purchase of the potter’s field fulfills prophecy (<a href='/AIV/38/11/13'>Zechariah 11:13</a>), implicitly affirming the unity of Scripture."
    },
    {
      "pk": 27008,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 8,
      "text": "Therefore that field has been called the Field of Blood to this day.",
      "links": "<a href='/AIV/44/1/19'>Acts 1:19</a>",
      "comment": "The naming of the field stands as a continual witness to the betrayal and its tragic outcome."
    },
    {
      "pk": 27009,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 9,
      "text": "Then was fulfilled what was spoken by Jeremiah the prophet, saying, \"And they took the thirty pieces of silver, the price set on him by the sons of Israel,",
      "links": "<a href='/AIV/24/19/1-13'>Jer. 19:1–13</a>; <a href='/AIV/38/11/12-13'>Zech. 11:12–13</a>",
      "comment": "Matthew references prophecy, highlighting Jesus as the fulfillment of Scripture. The merging of Zechariah and Jeremiah demonstrates the deep typological connections in the Old Testament."
    },
    {
      "pk": 27010,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 10,
      "text": "and they gave them for the potter’s field, as the Lord commanded me.”",
      "links": "<a href='/AIV/38/11/13'>Zech. 11:13</a>",
      "comment": "The divine orchestration of these events shows God's sovereignty over salvation history."
    },
    {
      "pk": 27011,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 11,
      "text": "Now Jesus stood before the governor, and the governor asked him, \"Are you the King of the Jews?\" Jesus said to him, \"You say so.\"",
      "links": "<a href='/AIV/41/15/2'>Mark 15:2</a>; <a href='/AIV/43/18/33-37'>John 18:33–37</a>",
      "comment": "Jesus’ indirect answer is a regular way of affirming truth while provoking reflection. His messianic kingship is being revealed."
    },
    {
      "pk": 27012,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 12,
      "text": "But when he was accused by the chief priests and elders, he gave no answer.",
      "links": "<a href='/AIV/23/53/7'>Isaiah 53:7</a>",
      "comment": "Jesus’ silence fulfills prophecy about the suffering servant—He does not defend himself (<a href='/AIV/23/53/7'>Isaiah 53:7</a>)."
    },
    {
      "pk": 27013,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 13,
      "text": "Then Pilate said to him, \"Do you not hear how many things they testify against you?\"",
      "links": "<a href='/AIV/41/15/3-4'>Mark 15:3–4</a>",
      "comment": "Pilate is astonished at Jesus’ refusal to answer, a sign of the Lord’s inner authority and unique role."
    },
    {
      "pk": 27014,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 14,
      "text": "But he gave him no answer, not even to a single charge, so that the governor was greatly amazed.",
      "links": "<a href='/AIV/40/26/63'>Matt. 26:63</a>; <a href='/AIV/41/15/5'>Mark 15:5</a>",
      "comment": "Jesus' silence is a powerful display of meekness, recalling prophecy and showing a confidence in God’s will."
    },
    {
      "pk": 27015,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 15,
      "text": "Now at the feast, it was the governor’s custom to release to the crowd any one prisoner whom they wanted.",
      "links": "<a href='/AIV/41/15/6'>Mark 15:6</a>; <a href='/AIV/42/23/17'>Luke 23:17</a>",
      "comment": "This release tradition parallels the scapegoat concept (Leviticus 16:21), heightening the contrast between Jesus and Barabbas."
    },
    {
      "pk": 27016,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 16,
      "text": "At that time they had a notorious prisoner named Barabbas.",
      "links": "<a href='/AIV/41/15/7'>Mark 15:7</a>",
      "comment": "Barabbas’ name means 'son of the father,' ironically contrasted with Christ, the true Son of the Father."
    },
    {
      "pk": 27017,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 17,
      "text": "So when the crowd had gathered, Pilate said to them, \"Which do you want me to release for you: Barabbas, or Jesus who is called Christ?\"",
      "links": "<a href='/AIV/42/23/18-19'>Luke 23:18–19</a>",
      "comment": "Pilate places the decision before the people, drawing attention to the choice between worldly rebellion and divine kingship."
    },
    {
      "pk": 27018,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 18,
      "text": "He knew that they had handed him over out of envy.",
      "links": "<a href='/AIV/41/15/10'>Mark 15:10</a>",
      "comment": "Pilate discerns the deeper motives behind the leaders’ actions."
    },
    {
      "pk": 27019,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 19,
      "text": "While he was sitting on the judgment seat, his wife sent word to him, \"Have nothing to do with that righteous man, for I have suffered much today in a dream because of him.\"",
      "links": "<a href='/AIV/40/2/12-13'>Matt. 2:12-13</a>",
      "comment": "Dreams often signal divine warnings (cf. Joseph’s dreams in Matthew 2). Pilate receives supernatural testimony regarding Jesus’ innocence."
    },
    {
      "pk": 27020,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 20,
      "text": "But the chief priests and elders persuaded the crowds to ask for Barabbas and destroy Jesus.",
      "links": "<a href='/AIV/41/15/11'>Mark 15:11</a>",
      "comment": "Religious leaders manipulate the crowd, fulfilling Jesus’ prophecies of his unjust condemnation."
    },
    {
      "pk": 27021,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 21,
      "text": "The governor asked them again, \"Which of the two do you want me to release for you?\" And they said, \"Barabbas.\"",
      "links": "<a href='/AIV/43/18/40'>John 18:40</a>",
      "comment": "The crowd’s preference for Barabbas over Jesus highlights human rebellion and the gravity of rejecting the Messiah."
    },
    {
      "pk": 27022,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 22,
      "text": "Pilate said to them, \"Then what shall I do with Jesus who is called Christ?\" They all said, \"Let him be crucified!\"",
      "links": "<a href='/AIV/41/15/13'>Mark 15:13</a>",
      "comment": "Crucifixion was a most shameful death (Deuteronomy 21:23), and their unanimous call signified total rejection."
    },
    {
      "pk": 27023,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 23,
      "text": "He said, \"Why, what evil has he done?\" But they shouted all the more, \"Let him be crucified!\"",
      "links": "<a href='/AIV/42/23/22-23'>Luke 23:22–23</a>",
      "comment": "Pilate’s inquiry finds no guilt, demonstrating Jesus’ innocence, a key theme for understanding his sacrifice."
    },
    {
      "pk": 27024,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 24,
      "text": "When Pilate saw that he was accomplishing nothing, but that a riot was starting, he took water and washed his hands before the crowd, saying, \"I am innocent of this man’s blood; you see to it.\"",
      "links": "<a href='/AIV/5/21/6-9'>Deut. 21:6–9</a>",
      "comment": "Washing one’s hands symbolized innocence in Old Testament law. Pilate distances himself, but cannot escape responsibility."
    },
    {
      "pk": 27025,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 25,
      "text": "All the people answered, \"His blood be on us and on our children!\"",
      "links": "<a href='/AIV/44/5/28'>Acts 5:28</a>",
      "comment": "The people’s acceptance of responsibility is a sobering moment, with both literal and spiritual implications for future generations."
    },
    {
      "pk": 27026,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 26,
      "text": "Then he released Barabbas for them; but after having Jesus flogged, he handed him over to be crucified.",
      "links": "<a href='/AIV/41/15/15'>Mark 15:15</a>",
      "comment": "The suffering Messiah theme is completed as Jesus is scourged—the precursor to being the sacrificial Lamb."
    },
    {
      "pk": 27027,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 27,
      "text": "Then the governor’s soldiers took Jesus into the governor’s headquarters and gathered the whole battalion around him.",
      "links": "<a href='/AIV/41/15/16'>Mark 15:16</a>",
      "comment": "Public humiliation is added to Jesus’ physical suffering, fulfilling Psalm 22’s mockery motif."
    },
    {
      "pk": 27028,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 28,
      "text": "They stripped him and put a scarlet robe on him.",
      "links": "<a href='/AIV/41/15/17'>Mark 15:17</a>",
      "comment": "The scarlet robe is mockery of his kingship, yet in God’s providence it ironically reveals his true identity as King."
    },
    {
      "pk": 27029,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 29,
      "text": "After twisting together a crown of thorns, they put it on his head, and placed a reed in his right hand; and kneeling before him they mocked him, saying, \"Hail, King of the Jews!\"",
      "links": "<a href='/AIV/19/22/7-8'>Ps. 22:7–8</a>",
      "comment": "The crown of thorns fulfills the curse motif (Genesis 3:18), while the mocking worship indicates that Jesus truly is King, but not as understood by the world."
    },
    {
      "pk": 27030,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 30,
      "text": "They spat on him, took the reed, and struck him on the head.",
      "links": "<a href='/AIV/23/50/6'>Isaiah 50:6</a>",
      "comment": "Jesus submits to torture and humiliation, displaying the fullness of the suffering servant prophesied in Isaiah."
    },
    {
      "pk": 27031,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 31,
      "text": "When they had mocked him, they stripped him of the robe and put his own clothes on him, and led him away to crucify him.",
      "links": "<a href='/AIV/41/15/20'>Mark 15:20</a>",
      "comment": "Jesus’ journey to the cross fulfills the imagery of the suffering Messiah and the Lamb led to slaughter."
    },
    {
      "pk": 27032,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 32,
      "text": "As they were going out, they found a man of Cyrene, Simon by name. They forced this man to carry his cross.",
      "links": "<a href='/AIV/42/23/26'>Luke 23:26</a>",
      "comment": "Simon’s participation illustrates how disciples share in Christ’s sufferings, a theme expanded upon in later New Testament writings (<a href='/AIV/50/3/10'>Philippians 3:10</a>)."
    },
    {
      "pk": 27033,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 33,
      "text": "And when they came to a place called Golgotha, which means Place of a Skull,",
      "links": "<a href='/AIV/41/15/22'>Mark 15:22</a>",
      "comment": "Golgotha's grim name emphasizes the death’s bleakness, heightening the contrast with the resurrection."
    },
    {
      "pk": 27034,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 34,
      "text": "they offered him wine mixed with gall to drink, but when he tasted it, he would not drink it.",
      "links": "<a href='/AIV/19/69/21'>Ps. 69:21</a>",
      "comment": "Jesus’ refusal fulfills prophecy, indicating he consciously endures all suffering soberly."
    },
    {
      "pk": 27035,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 35,
      "text": "When they had crucified him, they divided his garments among them by casting lots.",
      "links": "<a href='/AIV/19/22/18'>Ps. 22:18</a>",
      "comment": "This act fulfills Psalm 22, affirming precise fulfillment of messianic prophecies."
    },
    {
      "pk": 27036,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 36,
      "text": "Then they sat down and kept watch over him there.",
      "links": "",
      "comment": "Roman practice was to guard the crucified, but spiritually it underscores the world’s watching as God's salvation is revealed."
    },
    {
      "pk": 27037,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 37,
      "text": "Above his head they put the written accusation against him: 'This is Jesus, the King of the Jews.'",
      "links": "<a href='/AIV/41/15/26'>Mark 15:26</a>; <a href='/AIV/43/19/19'>John 19:19</a>",
      "comment": "The inscription ironically proclaims Jesus’ royal identity for all nations to see (cf. John 19:20)."
    },
    {
      "pk": 27038,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 38,
      "text": "Two rebels were crucified with him, one on the right and one on the left.",
      "links": "<a href='/AIV/23/53/12'>Isaiah 53:12</a>",
      "comment": "Jesus is 'numbered with the transgressors'—a key messianic prophecy."
    },
    {
      "pk": 27039,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 39,
      "text": "Those who passed by hurled insults at him, shaking their heads",
      "links": "<a href='/AIV/19/22/7'>Ps. 22:7</a>",
      "comment": "Mockery fulfills Psalm 22, reinforcing the identification of Jesus as the prophesied sufferer."
    },
    {
      "pk": 27040,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 40,
      "text": "and saying, \"You who would destroy the temple and rebuild it in three days, save yourself! If you are the Son of God, come down from the cross!\"",
      "links": "<a href='/AIV/40/26/61'>Matt. 26:61</a>; <a href='/AIV/43/2/19'>John 2:19</a>",
      "comment": "'Son of God' is a title for divinity. Their irony points to Jesus' true identity; resurrection will prove his claim."
    },
    {
      "pk": 27041,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 41,
      "text": "So also the chief priests, with the scribes and elders, mocked him, saying,",
      "links": "<a href='/AIV/19/22/8'>Ps. 22:8</a>",
      "comment": "Religious authorities’ mockery fulfills prophecy, but also demonstrates their misunderstanding of messiahship."
    },
    {
      "pk": 27042,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 42,
      "text": "\"He saved others; he cannot save himself. He is the King of Israel; let him come down now from the cross, and we will believe in him.",
      "links": "<a href='/AIV/40/16/16'>Matt. 16:16</a>",
      "comment": "Their taunts reveal true kingship is self-sacrifice, not worldly power. Coming down from the cross would contradict his mission."
    },
    {
      "pk": 27043,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 43,
      "text": "\"He trusts in God; let God deliver him now, if he desires him. For he said, 'I am the Son of God.'\"",
      "links": "<a href='/AIV/19/22/8'>Ps. 22:8</a>",
      "comment": "Jesus' divine Sonship is again on display. The 'I am' claim (see John 8:58) is a statement used for God."
    },
    {
      "pk": 27044,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 44,
      "text": "The rebels who were crucified with him also insulted him in the same way.",
      "links": "<a href='/AIV/41/15/32'>Mark 15:32</a>",
      "comment": "At this point, even fellow sufferers mock Jesus, though in Luke one will later convert, prefiguring God’s mercy for sinners."
    },
    {
      "pk": 27045,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 45,
      "text": "Now from the sixth hour, darkness covered all the land until the ninth hour.",
      "links": "<a href='/AIV/30/8/9'>Amos 8:9</a>",
      "comment": "Cosmic signs accompany Jesus’ death, signaling a turning point in salvation history."
    },
    {
      "pk": 27046,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 46,
      "text": "About the ninth hour Jesus shouted with a loud voice, saying, “Eli, Eli, lema sabachthani?” That is, “My God, my God, why have you forsaken me?”",
      "links": "<a href='/AIV/19/22/1'>Ps. 22:1</a>",
      "comment": "Jesus quotes Psalm 22, identifying with the suffering righteous. Interpretation includes both literal human suffering and deeper spiritual mystery."
    },
    {
      "pk": 27047,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 47,
      "text": "Some of those standing there, when they heard this, said, “He is calling Elijah.”",
      "links": "<a href='/AIV/40/11/14'>Matt. 11:14</a>",
      "comment": "Confusion about Jesus' words reveals the crowd’s lack of understanding of Scripture’s fulfillment."
    },
    {
      "pk": 27048,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 48,
      "text": "Immediately one of them ran and took a sponge, filled it with sour wine, put it on a reed, and gave him to drink.",
      "links": "<a href='/AIV/19/69/21'>Ps. 69:21</a>",
      "comment": "This act fulfills Psalm 69, further connecting Jesus’ suffering to Old Testament prophecy."
    },
    {
      "pk": 27049,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 49,
      "text": "But the others said, \"Wait, let us see whether Elijah will come to save him.\"",
      "links": "<a href='/AIV/40/17/10'>Matt. 17:10</a>",
      "comment": "Expectation of Elijah’s return was common; the episode ironically shows the real deliverer is already present."
    },
    {
      "pk": 27050,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 50,
      "text": "And Jesus cried out again with a loud voice and gave up his spirit.",
      "links": "<a href='/AIV/43/19/30'>John 19:30</a>",
      "comment": "The Giver of life willingly lays down his life, an act only possible for one with divine authority (cf. John 10:18)."
    },
    {
      "pk": 27051,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 51,
      "text": "And behold, the curtain of the temple was torn in two from top to bottom; the earth shook, and the rocks were split.",
      "links": "<a href='/AIV/2/26/33'>Exodus 26:33</a>; <a href='/AIV/58/9/12'>Hebrews 9:12</a>",
      "comment": "The torn curtain signifies new access to God. Divine worship and sacrifice reach fulfillment."
    },
    {
      "pk": 27052,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 52,
      "text": "Tombs were opened, and many bodies of holy people who had fallen asleep were raised,",
      "links": "<a href='/AIV/26/37/12'>Ezek. 37:12</a>",
      "comment": "This miraculous sign points to the resurrection of the righteous and anticipates the final resurrection."
    },
    {
      "pk": 27053,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 53,
      "text": "and coming out of the tombs after his resurrection, they went into the holy city and appeared to many.",
      "links": "<a href='/AIV/44/26/23'>Acts 26:23</a>",
      "comment": "The saints’ resurrection confirms Jesus’ victory over death, foreshadowing the promise of eternal life."
    },
    {
      "pk": 27054,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 54,
      "text": "When the centurion and those with him, keeping watch over Jesus, saw the earthquake and what took place, they were filled with awe and said, \"Truly this was the Son of God.\"",
      "links": "<a href='/AIV/41/15/39'>Mark 15:39</a>",
      "comment": "A Gentile’s confession marks recognition of Jesus’ divine identity, encompassing all nations."
    },
    {
      "pk": 27055,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 55,
      "text": "Many women were there, watching from a distance. They had followed Jesus from Galilee to serve him.",
      "links": "<a href='/AIV/41/15/40-41'>Mark 15:40-41</a>",
      "comment": "The faithfulness of the women disciples is notable. Their service prefigures the ongoing role of the faithful in the church."
    },
    {
      "pk": 27056,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 56,
      "text": "Among them were Mary Magdalene, Mary the mother of James and Joseph, and the mother of the sons of Zebedee.",
      "links": "<a href='/AIV/40/20/20'>Matt. 20:20</a>",
      "comment": "Specific mention of these women reflects the importance of eyewitness testimony and memory in the Christian community."
    },
    {
      "pk": 27057,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 57,
      "text": "When it was evening, there came a rich man from Arimathea, named Joseph, who was also a disciple of Jesus.",
      "links": "<a href='/AIV/41/15/42-43'>Mark 15:42-43</a>",
      "comment": "Joseph fulfills prophecy that the Messiah would be buried with the rich (<a href='/AIV/23/53/9'>Isaiah 53:9</a>)."
    },
    {
      "pk": 27058,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 58,
      "text": "He went to Pilate and asked for the body of Jesus. Then Pilate ordered that it be given to him.",
      "links": "<a href='/AIV/41/15/45'>Mark 15:45</a>",
      "comment": "Joseph courageously requests Jesus’ body, a crucial witness to Jesus’ real death and burial."
    },
    {
      "pk": 27059,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 59,
      "text": "Joseph took the body, wrapped it in a clean linen shroud,",
      "links": "<a href='/AIV/41/15/46'>Mark 15:46</a>; <a href='/AIV/23/53/9'>Isaiah 53:9</a>",
      "comment": "Careful burial customs show fulfillment of prophecy and reverence for the body—an important principle in Christian tradition."
    },
    {
      "pk": 27060,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 60,
      "text": "and laid it in his own new tomb that he had cut from the rock. He rolled a great stone to the entrance of the tomb and went away.",
      "links": "<a href='/AIV/23/22/16'>Isaiah 22:16</a>",
      "comment": "The new, unused tomb highlights Jesus’ unique dignity. The stone’s sealing further ensures the reality of his resurrection."
    },
    {
      "pk": 27061,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 61,
      "text": "Mary Magdalene and the other Mary were there, sitting opposite the tomb.",
      "links": "<a href='/AIV/41/15/47'>Mark 15:47</a>",
      "comment": "Their presence at the burial foreshadows their role as the first witnesses to the resurrection."
    },
    {
      "pk": 27062,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 62,
      "text": "The next day, that is, after the day of Preparation, the chief priests and the Pharisees gathered before Pilate",
      "links": "<a href='/AIV/42/23/54'>Luke 23:54</a>",
      "comment": "Even after Jesus’ death, his opponents fear the power of his words and actions."
    },
    {
      "pk": 27063,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 63,
      "text": "and said, \"Sir, we remember how that impostor said, ‘After three days I will rise.’\"",
      "links": "<a href='/AIV/40/16/21'>Matt. 16:21</a>",
      "comment": "Jesus’ prophecies of his resurrection were public knowledge. Even adversaries bear witness to his predictions."
    },
    {
      "pk": 27064,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 64,
      "text": "\"Therefore order the tomb to be made secure until the third day, lest his disciples come and steal him away and tell the people, ‘He has risen from the dead,’ and the last deception will be worse than the first.”",
      "links": "<a href='/AIV/40/28/13'>Matt. 28:13</a>",
      "comment": "Fear of fraud underscores the importance of a guarded, occupied tomb for verifying Jesus’ rising."
    },
    {
      "pk": 27065,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 65,
      "text": "Pilate said to them, \"You have a guard; go, make it as secure as you know how.\"",
      "links": "<a href='/AIV/40/28/11'>Matt. 28:11</a>",
      "comment": "The official Roman guard adds credibility to the resurrection account by removing suspicion of tampering."
    },
    {
      "pk": 27066,
      "translation": "AIV",
      "book": 1,
      "chapter": 27,
      "verse": 66,
      "text": "So they went and made the tomb secure by sealing the stone and setting a guard.",
      "links": "<a href='/AIV/27/6/17'>Daniel 6:17</a>",
      "comment": "The stone is sealed and a guard posted, making the subsequent resurrection events all the more extraordinary and credible."
    }
  ],
  "translatedAt": "2025-12-23T02:22:15.731Z"
}