{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 3,
  "verses": [
    {
      "pk": 3717001,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 1,
      "text": "In those days John the Baptist came, preaching in the wilderness of Judea,",
      "links": "<a href='/ESV/41/1/4'>Mark 1:4</a>; <a href='/ESV/42/3/2'>Luke 3:2</a>",
      "comment": "John the Baptist prepares the way for Jesus, fulfilling prophecy about the messenger in the wilderness (see Isaiah 40:3)."
    },
    {
      "pk": 3717002,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 2,
      "text": "\"Repent, for the kingdom of heaven is at hand.\"",
      "links": "<a href='/ESV/40/4/17'>Matt. 4:17</a>",
      "comment": "John’s call to repentance emphasizes a turning of heart and mind, preparing for the imminent arrival of the Messiah and His reign."
    },
    {
      "pk": 3717003,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 3,
      "text": "For this is he who was spoken of by the prophet Isaiah when he said, \"The voice of one crying out in the wilderness: 'Prepare the way of the Lord; make his paths straight.'\"",
      "links": "<a href='/ESV/23/40/3'>Isaiah 40:3</a>; <a href='/ESV/43/1/23'>John 1:23</a>",
      "comment": "Matthew cites Isaiah 40:3, showing that John fulfills Old Testament prophecy as the forerunner to Jesus."
    },
    {
      "pk": 3717004,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 4,
      "text": "Now John wore a garment of camel’s hair and a leather belt around his waist, and his food was locusts and wild honey.",
      "links": "<a href='/ESV/12/1/8'>2 Kings 1:8</a>; <a href='/ESV/41/1/6'>Mark 1:6</a>",
      "comment": "John’s appearance recalls the prophet Elijah, suggesting continuity between the Old and New Testament prophetic traditions."
    },
    {
      "pk": 3717005,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 5,
      "text": "Then Jerusalem and all Judea and all the region around the Jordan were going out to him,",
      "links": "<a href='/ESV/41/1/5'>Mark 1:5</a>",
      "comment": "John’s widespread influence confirms his role as a significant prophetic voice, drawing the crowds for a ritual of repentance."
    },
    {
      "pk": 3717006,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 6,
      "text": "and they were being baptized by him in the Jordan River, confessing their sins.",
      "links": "<a href='/ESV/44/19/18'>Acts 19:18</a>",
      "comment": "Baptism here is closely linked with confession, a public sign of repentance and spiritual cleansing."
    },
    {
      "pk": 3717007,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 7,
      "text": "But when he saw many of the Pharisees and Sadducees coming to his baptism, he said to them, \"You brood of vipers! Who warned you to flee from the coming wrath?",
      "links": "<a href='/ESV/40/12/34'>Matt. 12:34</a>; <a href='/ESV/40/23/33'>Matt. 23:33</a>",
      "comment": "John boldly confronts religious leaders, challenging outward religion without genuine repentance."
    },
    {
      "pk": 3717008,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 8,
      "text": "Bear fruit in keeping with repentance.",
      "links": "<a href='/ESV/40/7/16-20'>Matt. 7:16-20</a>; <a href='/ESV/42/3/8'>Luke 3:8</a>",
      "comment": "True repentance results in a changed life, not just ritual."
    },
    {
      "pk": 3717009,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 9,
      "text": "And do not think to say to yourselves, 'We have Abraham as our father.' For I tell you, God is able from these stones to raise up children for Abraham.",
      "links": "<a href='/ESV/43/8/39'>John 8:39</a>; <a href='/ESV/45/4/16'>Rom. 4:16</a>",
      "comment": "Spiritual heritage does not guarantee salvation; God demands genuine faith and obedience."
    },
    {
      "pk": 3717010,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 10,
      "text": "Even now the axe is laid to the root of the trees. Every tree therefore that does not bear good fruit is cut down and thrown into the fire.",
      "links": "<a href='/ESV/40/7/19'>Matt. 7:19</a>; <a href='/ESV/43/15/6'>John 15:6</a>",
      "comment": "Urgency for true conversion is clear; without fruit, there is judgment. See also Jesus’ later teaching on abiding in Him and bearing fruit."
    },
    {
      "pk": 3717011,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 11,
      "text": "I baptize you with water for repentance, but he who is coming after me is mightier than I, whose sandals I am not worthy to carry. He will baptize you with the Holy Spirit and fire.",
      "links": "<a href='/ESV/41/1/8'>Mark 1:8</a>; <a href='/ESV/44/2/3-4'>Acts 2:3-4</a>",
      "comment": "John contrasts his preparation with the greater spiritual baptism of Christ. Jesus’ baptism with the Holy Spirit brings true inner transformation."
    },
    {
      "pk": 3717012,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 12,
      "text": "His winnowing fork is in his hand, and he will thoroughly clear his threshing floor and gather his wheat into the barn, but the chaff he will burn with unquenchable fire.",
      "links": "<a href='/ESV/40/13/30'>Matt. 13:30</a>; <a href='/ESV/19/1/4'>Psalm 1:4</a>",
      "comment": "The image of harvest and division echoes God’s final judgment, distinguishing true believers from the unrepentant."
    },
    {
      "pk": 3717013,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 13,
      "text": "Then Jesus came from Galilee to the Jordan to John, to be baptized by him.",
      "links": "<a href='/ESV/41/1/9'>Mark 1:9</a>; <a href='/ESV/42/3/21'>Luke 3:21</a>",
      "comment": "Jesus, though sinless, submits to baptism, identifying fully with humanity and exemplifying obedience."
    },
    {
      "pk": 3717014,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 14,
      "text": "But John tried to prevent him, saying, \"I need to be baptized by you, and do you come to me?\"",
      "links": "<a href='/ESV/40/3/11'>Matt. 3:11</a>",
      "comment": "John recognizes Jesus’ superior holiness and authority, hinting at Christ’s divine nature."
    },
    {
      "pk": 3717015,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 15,
      "text": "But Jesus answered him, \"Let it be so now, for thus it is fitting for us to fulfill all righteousness.\" Then he let him.",
      "links": "<a href='/ESV/40/5/17'>Matt. 5:17</a>",
      "comment": "Jesus fulfills all righteousness, signifying the importance of obedience to God’s plan and establishing an example for believers. ‘Fulfilling all righteousness’ reflects the depth and necessity of participating in holy rites instituted by God."
    },
    {
      "pk": 3717016,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 16,
      "text": "And when Jesus was baptized, immediately he went up from the water, and behold, the heavens were opened to him, and he saw the Spirit of God descending like a dove and coming to rest on him.",
      "links": "<a href='/ESV/23/42/1'>Isaiah 42:1</a>; <a href='/ESV/41/1/10'>Mark 1:10</a>",
      "comment": "The descent of the Spirit fulfills messianic prophecy (see Isaiah 42:1) and publicly marks Jesus as the chosen One, showing the distinct persons of the Trinity."
    },
    {
      "pk": 3717017,
      "translation": "AIV",
      "book": 40,
      "chapter": 3,
      "verse": 17,
      "text": "And behold, a voice from heaven said, \"This is my beloved Son, in whom I am well pleased.\"",
      "links": "<a href='/ESV/2/4/22'>Exodus 4:22</a>; <a href='/ESV/19/2/7'>Psalm 2:7</a>; <a href='/ESV/23/42/1'>Isaiah 42:1</a>",
      "comment": "The Father's voice affirms Jesus’ divine Sonship, fulfilling Psalm 2:7 and Isaiah 42:1. This is a foundational revelation of Jesus’ identity and public confirmation of His divine mission, showing the unity of Father, Son, and Spirit at the beginning of his ministry."
    }
  ],
  "translatedAt": "2025-12-23T02:09:41.295Z"
}