{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 1,
  "verses": [
    {
      "pk": 2001001,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 1,
      "text": "The book of the genealogy of Jesus Christ, the son of David, the son of Abraham.",
      "links": "<a href='/AIV/1/12/3'>Gen. 12:3</a>; <a href='/AIV/10/7/12'>2 Sam. 7:12</a>; <a href='/AIV/42/3/23-38'>Luke 3:23–38</a>",
      "comment": "This opening identifies Jesus as the promised Messiah (Christ), highlighting His direct descent from key Old Testament figures. In Jewish tradition, being called ‘son of David’ is a direct claim to the messianic kingship prophesied in the Old Testament."
    },
    {
      "pk": 2001002,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 2,
      "text": "Abraham was the father of Isaac, and Isaac the father of Jacob, and Jacob the father of Judah and his brothers,",
      "links": "<a href='/AIV/1/21/2-3'>Gen. 21:2-3</a>; <a href='/AIV/1/25/26'>Gen. 25:26</a>",
      "comment": "The genealogy roots Jesus in history, showing God’s continuous providence through generations. The twelve brothers refer to the founders of the tribes of Israel."
    },
    {
      "pk": 2001003,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 3,
      "text": "Judah was the father of Perez and Zerah by Tamar, and Perez the father of Hezron, and Hezron the father of Ram,",
      "links": "<a href='/AIV/1/38/29-30'>Gen. 38:29–30</a>; <a href='/AIV/8/4/18-22'>Ruth 4:18–22</a>",
      "comment": "Tamar’s presence illustrates God’s ability to bring salvation even out of difficult or sinful situations. This pattern continues in the genealogy, showing God’s plan inclusive of unexpected and morally complex figures."
    },
    {
      "pk": 2001004,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 4,
      "text": "Ram was the father of Amminadab, and Amminadab the father of Nahshon, and Nahshon the father of Salmon,",
      "links": "<a href='/AIV/4/1/7'>Num. 1:7</a>; <a href='/AIV/8/4/20'>Ruth 4:20</a>",
      "comment": "These names are preserved to show the continuity of God’s people leading up to Christ. Nahshon was a prominent leader during the Exodus."
    },
    {
      "pk": 2001005,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 5,
      "text": "Salmon was the father of Boaz by Rahab, and Boaz the father of Obed by Ruth, and Obed the father of Jesse,",
      "links": "<a href='/AIV/6/2/1'>Josh. 2:1</a>; <a href='/AIV/8/4/21'>Ruth 4:21</a>",
      "comment": "Rahab and Ruth, both non-Israelites, are included to show God’s mercy extends beyond Israel. Notably, these women are ancestors of King David and thus of Christ, reflecting an early sign of God’s plan to include all nations."
    },
    {
      "pk": 2001006,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 6,
      "text": "Jesse was the father of David the king. David was the father of Solomon by the wife of Uriah,",
      "links": "<a href='/AIV/9/16/1'>1 Sam. 16:1</a>; <a href='/AIV/10/11/27'>2 Sam. 11:27</a>",
      "comment": "Calling David ‘the king’ underscores both his messianic significance and the royal lineage leading to Christ. Mentioning 'the wife of Uriah' (Bathsheba) instead of her name draws attention to the story of sin and repentance, highlighting God's ability to bring good even from grave sin."
    },
    {
      "pk": 2001007,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 7,
      "text": "Solomon was the father of Rehoboam, and Rehoboam the father of Abijah, and Abijah the father of Asa,",
      "links": "<a href='/AIV/11/2/12'>1 Kings 2:12</a>; <a href='/AIV/14/12/16'>2 Chron. 12:16</a>",
      "comment": "These are kings of Judah, emphasizing the legitimate royal succession that leads to Christ."
    },
    {
      "pk": 2001008,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 8,
      "text": "Asa was the father of Jehoshaphat, and Jehoshaphat the father of Joram, and Joram the father of Uzziah,",
      "links": "<a href='/AIV/14/17/1'>2 Chron. 17:1</a>; <a href='/AIV/14/21/4'>2 Chron. 21:4</a>",
      "comment": "The genealogy at times omits generations (Ahaziah, Joash, and Amaziah), a common practice for genealogical lists, focusing on the most significant figures."
    },
    {
      "pk": 2001009,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 9,
      "text": "Uzziah was the father of Jotham, and Jotham the father of Ahaz, and Ahaz the father of Hezekiah,",
      "links": "<a href='/AIV/14/26/23'>2 Chron. 26:23</a>; <a href='/AIV/14/28/27'>2 Chron. 28:27</a>",
      "comment": "Hezekiah is known for his faithfulness to God, standing as a symbol of renewal and faith."
    },
    {
      "pk": 2001010,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 10,
      "text": "Hezekiah was the father of Manasseh, and Manasseh the father of Amon, and Amon the father of Josiah,",
      "links": "<a href='/AIV/14/33/1'>2 Chron. 33:1</a>; <a href='/AIV/14/33/21'>2 Chron. 33:21</a>",
      "comment": "Manasseh, though a wicked king, repented (2 Chron. 33:12-13), again illustrating God's mercy."
    },
    {
      "pk": 2001011,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 11,
      "text": "Josiah was the father of Jechoniah and his brothers, at the time of the deportation to Babylon.",
      "links": "<a href='/AIV/12/24/15'>2 Kings 24:15</a>; <a href='/AIV/14/36/10'>2 Chron. 36:10</a>",
      "comment": "The Babylonian exile was seen as a time of punishment and purification, but out of it comes hope for restoration, fulfilled in Christ."
    },
    {
      "pk": 2001012,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 12,
      "text": "After the deportation to Babylon, Jechoniah was the father of Shealtiel, and Shealtiel the father of Zerubbabel,",
      "links": "<a href='/AIV/15/3/2'>Ezra 3:2</a>; <a href='/AIV/37/1/12'>Hag. 1:12</a>",
      "comment": "Zerubbabel is notable as the leader of the return from exile, connecting Jesus to the hope of restoration."
    },
    {
      "pk": 2001013,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 13,
      "text": "Zerubbabel was the father of Abiud, and Abiud the father of Eliakim, and Eliakim the father of Azor,",
      "links": "<a href='/AIV/16/12/1'>Neh. 12:1</a>",
      "comment": "The genealogy continues through the post-exilic period, preserving continuity to the time of Christ."
    },
    {
      "pk": 2001014,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 14,
      "text": "Azor was the father of Zadok, and Zadok the father of Achim, and Achim the father of Eliud,",
      "links": "",
      "comment": "Details for these names are not recorded in the Old Testament but are preserved here, indicating the importance of tradition and carefully preserved lineages."
    },
    {
      "pk": 2001015,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 15,
      "text": "Eliud was the father of Eleazar, Eleazar the father of Matthan, and Matthan the father of Jacob,",
      "links": "",
      "comment": "Continuity of the genealogy up to the father of Joseph."
    },
    {
      "pk": 2001016,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 16,
      "text": "Jacob was the father of Joseph, the husband of Mary, by whom Jesus was born, who is called Christ.",
      "links": "<a href='/AIV/42/3/23'>Luke 3:23</a>; <a href='/AIV/1/3/15'>Gen. 3:15</a>",
      "comment": "Significantly, the genealogy changes form here: it does not say ‘Joseph was the father of Jesus,’ but stresses Mary’s role. This points to the virgin birth, emphasizing that Jesus’ conception was miraculous and unique, fulfilling Old Testament prophecy."
    },
    {
      "pk": 2001017,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 17,
      "text": "So all the generations from Abraham to David are fourteen generations, and from David to the deportation to Babylon fourteen generations, and from the deportation to Babylon to the Christ fourteen generations.",
      "links": "",
      "comment": "The grouping of generations as ‘fourteen’ each underscores the orderliness of God’s plan and underscores that Jesus comes at the fullness of time (Gal. 4:4). Fourteen may echo the numerical value of ‘David’ in Hebrew, underlining Jesus’ Davidic kingship."
    },
    {
      "pk": 2001018,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 18,
      "text": "Now the birth of Jesus Christ was like this: When his mother Mary had been betrothed to Joseph, before they came together she was found to be with child from the Holy Spirit.",
      "links": "<a href='/AIV/23/7/14'>Isa. 7:14</a>; <a href='/AIV/42/1/34-35'>Luke 1:34-35</a>",
      "comment": "This explicitly says the child was from the Holy Spirit, confirming the virgin birth and divine origin of Jesus—a foundational Christian truth that affirms both Christ’s humanity and divinity."
    },
    {
      "pk": 2001019,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 19,
      "text": "And Joseph, her husband, being a just man and unwilling to disgrace her publicly, intended to divorce her quietly.",
      "links": "<a href='/AIV/5/24/1'>Deut. 24:1</a>",
      "comment": "Joseph’s righteousness is shown by his mercy and his respect for the law. The quiet handling of the situation reflects a deep compassion."
    },
    {
      "pk": 2001020,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 20,
      "text": "But as he considered these things, behold, an angel of the Lord appeared to him in a dream, saying, “Joseph, son of David, do not be afraid to take Mary as your wife, for what is conceived in her is from the Holy Spirit.”",
      "links": "<a href='/AIV/1/28/12'>Gen. 28:12</a>; <a href='/AIV/42/1/35'>Luke 1:35</a>",
      "comment": "The angel’s address as ‘son of David’ affirms Joseph’s connection to the royal line. Dreams in the Old Testament usually convey divine instruction (see Joseph, son of Jacob), showing God continues to guide His people."
    },
    {
      "pk": 2001021,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 21,
      "text": "She will bear a son, and you shall call his name Jesus, for he will save his people from their sins.”",
      "links": "<a href='/AIV/19/130/8'>Ps. 130:8</a>; <a href='/AIV/23/53/11'>Isa. 53:11</a>; <a href='/AIV/42/2/21'>Luke 2:21</a>",
      "comment": "‘Jesus’ means ‘Yahweh saves.’ The name itself declares His mission as Savior. Only God can forgive sins; here Christ’s unique role is foreshadowed."
    },
    {
      "pk": 2001022,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 22,
      "text": "All this took place to fulfill what the Lord had spoken by the prophet:",
      "links": "<a href='/AIV/23/7/14'>Isa. 7:14</a>",
      "comment": "This connection to prophecy establishes the authority of Christ’s birth and God’s faithfulness to His promises."
    },
    {
      "pk": 2001023,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 23,
      "text": "“Behold, the virgin shall conceive and bear a son, and they shall call his name Immanuel” (which means, God with us).",
      "links": "<a href='/AIV/23/7/14'>Isa. 7:14</a>; <a href='/AIV/43/1/14'>John 1:14</a>",
      "comment": "‘Immanuel’ prophesied by Isaiah emphasizes that Jesus is not just a special prophet but God truly present among us (see John 1:14). Jesus’ unique birth and identity is affirmed as both fully God and fully man, foundational to all traditional Christianity."
    },
    {
      "pk": 2001024,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 24,
      "text": "When Joseph woke from sleep, he did as the angel of the Lord commanded him, and took his wife,",
      "links": "<a href='/AIV/1/6/22'>Gen. 6:22</a>",
      "comment": "Joseph’s prompt obedience demonstrates deep faith, mirroring other figures in salvation history who trust in God’s plan even when it is mysterious. His role models fidelity not merely in words but in action."
    },
    {
      "pk": 2001025,
      "translation": "AIV",
      "book": 40,
      "chapter": 1,
      "verse": 25,
      "text": "But he did not know her until she had given birth to a son. And he called his name Jesus.",
      "links": "<a href='/AIV/42/2/7'>Luke 2:7</a>; <a href='/AIV/1/4/1'>Gen. 4:1</a>",
      "comment": "‘Did not know her’ is a Hebrew idiom for marital relations. The scripture focuses on Jesus’ miraculous conception, leaving the perpetual state of their marriage open to sacred tradition and ancient Christian interpretation. Joseph’s faithful guardianship and naming of Jesus underlines legitimate, divinely approved family order and obedience to God’s will."
    }
  ],
  "translatedAt": "2025-12-23T02:08:53.749Z"
}