{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 10,
  "verses": [
    {
      "pk": 40101001,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 1,
      "text": "Jesus called his twelve disciples to himself and gave them authority over unclean spirits, to cast them out and to heal every disease and every sickness.",
      "links": "<a href='/AIV/41/3/14-15'>Mark 3:14-15</a>; <a href='/AIV/42/9/1'>Luke 9:1</a>;",
      "comment": "Here, Jesus imparts spiritual authority to the Twelve, foreshadowing apostolic succession and the continuing ministry of healing and exorcism through His chosen representatives. The granting of authority comes directly from Jesus, indicating His divine authority. See also Ex 7:1 regarding divine authority given to a representative."
    },
    {
      "pk": 40101002,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 2,
      "text": "Now these are the names of the twelve apostles: first, Simon, called Peter, and Andrew his brother; James the son of Zebedee, and John his brother;",
      "links": "<a href='/AIV/40/4/18-22'>Matt 4:18-22</a>; <a href='/AIV/41/3/16-19'>Mark 3:16-19</a>",
      "comment": "The twelve are listed by name, beginning with Simon Peter. Placing Peter first is significant for his leadership role among the apostles. The term 'apostles' (those sent) marks a formal commissioning."
    },
    {
      "pk": 40101003,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 3,
      "text": "Philip and Bartholomew; Thomas and Matthew the tax collector; James the son of Alphaeus, and Thaddaeus;",
      "links": "<a href='/AIV/42/6/14-16'>Luke 6:14-16</a>",
      "comment": "Matthew humbly identifies himself as 'the tax collector,' highlighting his unworthiness and the call of diverse backgrounds to apostleship."
    },
    {
      "pk": 40101004,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 4,
      "text": "Simon the Zealot, and Judas Iscariot, who also betrayed him.",
      "links": "<a href='/AIV/43/6/71'>John 6:71</a>; <a href='/AIV/42/6/16'>Luke 6:16</a>",
      "comment": "Judas' future betrayal is already noted, implying the foreknowledge of Christ, another hint at His divinity (see John 13:11)."
    },
    {
      "pk": 40101005,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 5,
      "text": "Jesus sent out these twelve and commanded them: 'Do not go among the Gentiles, and do not enter any town of the Samaritans.'",
      "links": "<a href='/AIV/44/13/46'>Acts 13:46</a>; <a href='/AIV/40/28/19'>Matt 28:19</a>",
      "comment": "The initial mission is limited to Israel, keeping with God's covenant promises and prophecy (Gen 22:18). Later, Jesus will command mission to all nations (see Matt 28:19)."
    },
    {
      "pk": 40101006,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 6,
      "text": "'But go rather to the lost sheep of the house of Israel.'",
      "links": "<a href='/AIV/26/34/16'>Ezek. 34:16</a>; <a href='/AIV/40/15/24'>Matt 15:24</a>",
      "comment": "Jesus’ ministry begins with Israel, fulfilling Ezekiel 34:16. The imagery of 'lost sheep' is a messianic reference (see also Jeremiah 50:6)."
    },
    {
      "pk": 40101007,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 7,
      "text": "'And as you go, preach, saying, ‘The kingdom of heaven is at hand.’'",
      "links": "<a href='/AIV/40/3/2'>Matt 3:2</a>; <a href='/AIV/40/4/17'>Matt 4:17</a>",
      "comment": "Like John the Baptist and Jesus Himself, the core message is the nearness of God's kingdom—a call to repentance and faith."
    },
    {
      "pk": 40101008,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 8,
      "text": "'Heal the sick, raise the dead, cleanse lepers, cast out demons. Freely you have received; freely give.'",
      "links": "<a href='/AIV/44/3/6'>Acts 3:6</a>; <a href='/AIV/42/7/22'>Luke 7:22</a>",
      "comment": "Miraculous works authenticate the apostles' mission and reflect Jesus’ own ministry. The instruction to give freely highlights the grace they’ve received."
    },
    {
      "pk": 40101009,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 9,
      "text": "'Do not acquire gold, silver, or copper for your money belts,'",
      "links": "<a href='/AIV/42/10/4'>Luke 10:4</a>; <a href='/AIV/41/6/8'>Mark 6:8</a>",
      "comment": "The apostles are told to rely on providence, not material preparation. Trust in God’s ongoing provision is central."
    },
    {
      "pk": 40101010,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 10,
      "text": "'No bag for your journey, or two tunics, or sandals, or a staff, for the worker deserves his food.'",
      "links": "<a href='/AIV/54/5/18'>1 Tim 5:18</a>; <a href='/AIV/05/25/4'>Deut 25:4</a>",
      "comment": "Apostles depend on the hospitality of believers—a spiritual principle of charitable support for ministers (see 1 Tim 5:18)."
    },
    {
      "pk": 40101011,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 11,
      "text": "'And into whatever town or village you enter, find out who is worthy in it, and stay there until you leave.'",
      "links": "<a href='/AIV/42/10/5-7'>Luke 10:5-7</a>",
      "comment": "'Worthy' indicates a faith-filled, hospitable household. This prefigures the importance of reception and support for those sent by Christ."
    },
    {
      "pk": 40101012,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 12,
      "text": "'As you enter the house, greet it with peace.'",
      "links": "<a href='/AIV/42/10/5'>Luke 10:5</a>",
      "comment": "The greeting of peace signifies both blessing and the beginning of a spiritual relationship. Peace in Hebrew, 'shalom', carries a deeper spiritual meaning."
    },
    {
      "pk": 40101013,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 13,
      "text": "'If the house is worthy, let your peace come upon it; but if it is not worthy, let your peace return to you.'",
      "links": "<a href='/AIV/42/10/6'>Luke 10:6</a>",
      "comment": "Peace is both a prayer and a real spiritual gift imparted through Christ’s representatives."
    },
    {
      "pk": 40101014,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 14,
      "text": "'And if anyone will not receive you or listen to your words, shake off the dust from your feet as you leave that house or that town.'",
      "links": "<a href='/AIV/41/6/11'>Mark 6:11</a>; <a href='/AIV/44/13/51'>Acts 13:51</a>",
      "comment": "Shaking off the dust is an ancient sign of disassociation with unbelief. Responsibility for rejection lies with the hearer, not the messenger."
    },
    {
      "pk": 40101015,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 15,
      "text": "'Truly, I say to you, it will be more tolerable on the day of judgment for the land of Sodom and Gomorrah than for that town.'",
      "links": "<a href='/AIV/01/19/24-25'>Gen 19:24-25</a>; <a href='/AIV/40/11/24'>Matt 11:24</a>",
      "comment": "Rejection of the gospel is a grave sin, with severe consequence. Jesus speaks of the day of judgment, underscoring His authority as the Judge—a divine prerogative (see Matt 25:31-46)."
    },
    {
      "pk": 40101016,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 16,
      "text": "'See, I am sending you out as sheep among wolves. So be as shrewd as serpents and innocent as doves.'",
      "links": "<a href='/AIV/42/10/3'>Luke 10:3</a>",
      "comment": "Christ’s followers must combine wisdom with purity. Early Christians faced persecution, much as predicted here."
    },
    {
      "pk": 40101017,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 17,
      "text": "'But beware of men, for they will deliver you up to councils and flog you in their synagogues.'",
      "links": "<a href='/AIV/44/5/40'>Acts 5:40</a>; <a href='/AIV/44/22/19'>Acts 22:19</a>",
      "comment": "Prophecy of persecutions to come; fulfilled in Acts (e.g., Peter and Paul facing synagogue leaders)."
    },
    {
      "pk": 40101018,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 18,
      "text": "'You will be brought before governors and kings for my sake, as a testimony to them and to the Gentiles.'",
      "links": "<a href='/AIV/44/9/15'>Acts 9:15</a>; <a href='/AIV/44/24/24-25'>Acts 24:24-25</a>",
      "comment": "The apostles’ witness extends to civil rulers and Gentiles—foreshadowing the gospel’s universal mission."
    },
    {
      "pk": 40101019,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 19,
      "text": "'But when they deliver you up, do not be anxious about how or what you are to say, for what you are to say will be given to you in that hour.'",
      "links": "<a href='/AIV/42/12/11-12'>Luke 12:11-12</a>",
      "comment": "The indwelling Spirit will inspire the right words. This hints at the Spirit’s work in the Church’s witness, especially through ordained ministers."
    },
    {
      "pk": 40101020,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 20,
      "text": "'For it is not you who speak, but the Spirit of your Father speaking through you.'",
      "links": "<a href='/AIV/44/4/8'>Acts 4:8</a>; <a href='/AIV/66/2/7'>Rev 2:7</a>",
      "comment": "The apostles’ teaching is Spirit-inspired, conveying God’s own authority—a basis for trusting the Church’s teaching."
    },
    {
      "pk": 40101021,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 21,
      "text": "'Brother will deliver brother to death, and a father his child; and children will rise up against parents and cause them to be put to death.'",
      "links": "<a href='/AIV/33/7/6'>Micah 7:6</a>; <a href='/AIV/42/21/16'>Luke 21:16</a>",
      "comment": "Family division echoes Micah 7:6, fulfilled as Christ becomes the ultimate sign of contradiction, sometimes dividing even households."
    },
    {
      "pk": 40101022,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 22,
      "text": "'And you will be hated by everyone for my name’s sake. But the one who endures to the end will be saved.'",
      "links": "<a href='/AIV/24/15/10'>Jer 15:10</a>; <a href='/AIV/66/2/10'>Rev 2:10</a>",
      "comment": "Perseverance in faith is essential; salvation is ultimately a matter of enduring in Christ. Implies ongoing cooperation with God’s grace."
    },
    {
      "pk": 40101023,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 23,
      "text": "'When they persecute you in one town, flee to the next. Truly, I say to you, you will not have gone through all the towns of Israel before the Son of Man comes.'",
      "links": "<a href='/AIV/27/7/13'>Dan 7:13</a>; <a href='/AIV/40/24/27'>Matt 24:27</a>",
      "comment": "Jesus refers to Himself as 'Son of Man', an explicit messianic, even divine, title from Daniel 7:13-14. The coming likely refers to His resurrection or judgment upon Jerusalem."
    },
    {
      "pk": 40101024,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 24,
      "text": "'A disciple is not above his teacher, nor a servant above his master.'",
      "links": "<a href='/AIV/42/6/40'>Luke 6:40</a>",
      "comment": "Discipleship means imitating Christ, even in suffering."
    },
    {
      "pk": 40101025,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 25,
      "text": "'It is enough for the disciple to become like his teacher, and the servant like his master. If they have called the master of the house Beelzebul, how much more those of his household!'",
      "links": "<a href='/AIV/40/12/24'>Matt 12:24</a>",
      "comment": "'Beelzebul' (a demon) was a slander applied to Jesus. Expecting slander and persecution is part of following Christ."
    },
    {
      "pk": 40101026,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 26,
      "text": "'So do not fear them, for nothing is concealed that will not be revealed, and nothing hidden that will not be known.'",
      "links": "<a href='/AIV/42/12/2'>Luke 12:2</a>",
      "comment": "Truth will ultimately prevail; encourages faith and courageous witness. This also applies to the full revelation of God’s plan in Christ."
    },
    {
      "pk": 40101027,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 27,
      "text": "'What I tell you in the dark, speak in the light; and what you hear whispered in your ear, proclaim on the rooftops.'",
      "links": "<a href='/AIV/42/12/3'>Luke 12:3</a>",
      "comment": "Christ’s gospel is not to be kept secret but boldly proclaimed. Tradition as well as Scripture are means by which Christ’s teachings are handed down."
    },
    {
      "pk": 40101028,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 28,
      "text": "'Do not fear those who kill the body but cannot kill the soul. Instead, fear him who can destroy both soul and body in hell.'",
      "links": "<a href='/AIV/23/8/12-13'>Isa 8:12-13</a>; <a href='/AIV/42/12/4-5'>Luke 12:4-5</a>",
      "comment": "This points to the reality of eternal judgment and the immortality of the soul—a reminder of spiritual realities beyond material life."
    },
    {
      "pk": 40101029,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 29,
      "text": "'Are not two sparrows sold for a penny? Yet not one of them falls to the ground without your Father knowing.'",
      "links": "<a href='/AIV/42/12/6'>Luke 12:6</a>",
      "comment": "God’s providence extends over even the smallest creatures; reminds us of His care for us."
    },
    {
      "pk": 40101030,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 30,
      "text": "'But even the hairs of your head are all counted.'",
      "links": "<a href='/AIV/42/12/7'>Luke 12:7</a>",
      "comment": "An expression of God’s intimate knowledge and care for each individual, highlighting personal dignity and worth."
    },
    {
      "pk": 40101031,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 31,
      "text": "'So do not be afraid; you are worth more than many sparrows.'",
      "links": "<a href='/AIV/19/8/4-5'>Ps 8:4-5</a>",
      "comment": "This echoes Psalm 8:4-5: human dignity rooted in being made in God’s image and being known by Him."
    },
    {
      "pk": 40101032,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 32,
      "text": "'Everyone who confesses me before others, I will also confess before my Father who is in heaven.'",
      "links": "<a href='/AIV/66/3/5'>Rev 3:5</a>; <a href='/AIV/42/12/8'>Luke 12:8</a>",
      "comment": "Public acknowledgment of Christ is necessary for final salvation. Early Church practice saw confession of faith linked to salvation (see Rom 10:9-10)."
    },
    {
      "pk": 40101033,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 33,
      "text": "'But whoever denies me before others, I will also deny before my Father who is in heaven.'",
      "links": "<a href='/AIV/55/2/12'>2 Tim 2:12</a>; <a href='/AIV/42/12/9'>Luke 12:9</a>",
      "comment": "A grave warning about apostasy. Salvation requires fidelity to Christ, even in persecution. See also Peter’s later repentance—demonstrates possibility of forgiveness after denial (see John 21:15-17)."
    },
    {
      "pk": 40101034,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 34,
      "text": "'Do not think that I have come to bring peace to the earth; I have not come to bring peace, but a sword.'",
      "links": "<a href='/AIV/42/12/51'>Luke 12:51</a>; <a href='/AIV/33/7/6'>Micah 7:6</a>",
      "comment": "The 'sword' means division; true peace comes only through following Christ, even when it divides households."
    },
    {
      "pk": 40101035,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 35,
      "text": "'For I have come to set a man against his father, a daughter against her mother, and a daughter-in-law against her mother-in-law.'",
      "links": "<a href='/AIV/33/7/6'>Micah 7:6</a>",
      "comment": "Quoting Micah 7:6, Jesus shows that his coming fulfills prophecy, causing some to choose the gospel even over familial ties."
    },
    {
      "pk": 40101036,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 36,
      "text": "'And a person’s enemies will be those of his own household.'",
      "links": "<a href='/AIV/33/7/6'>Micah 7:6</a>",
      "comment": "Christ’s message compels a choice that may set even close kin in opposition."
    },
    {
      "pk": 40101037,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 37,
      "text": "'Whoever loves father or mother more than me is not worthy of me; and whoever loves son or daughter more than me is not worthy of me.'",
      "links": "<a href='/AIV/05/6/5'>Deut 6:5</a>; <a href='/AIV/42/14/26'>Luke 14:26</a>",
      "comment": "The love and loyalty due to Christ surpass all earthly relationships, recalling the greatest commandment (Deut 6:5)."
    },
    {
      "pk": 40101038,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 38,
      "text": "'And whoever does not take his cross and follow me is not worthy of me.'",
      "links": "<a href='/AIV/40/16/24'>Matt 16:24</a>; <a href='/AIV/42/14/27'>Luke 14:27</a>",
      "comment": "Carrying the cross prefigures suffering and self-denial—an early call to Christian discipleship before Jesus’ crucifixion."
    },
    {
      "pk": 40101039,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 39,
      "text": "'Whoever finds his life will lose it, and whoever loses his life for my sake will find it.'",
      "links": "<a href='/AIV/16/9/21'>Neh 9:21</a>; <a href='/AIV/42/17/33'>Luke 17:33</a>",
      "comment": "A saying reflecting the paradox of true life through surrender to Christ. This also encourages martyrdom for Christ’s sake."
    },
    {
      "pk": 40101040,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 40,
      "text": "'Whoever receives you receives me, and whoever receives me receives the one who sent me.'",
      "links": "<a href='/AIV/43/13/20'>John 13:20</a>; <a href='/AIV/09/8/7'>1 Sam 8:7</a>",
      "comment": "Jesus equates reception of His apostles with reception of Himself and the Father, expressing the unity between Christ and His representatives and hinting at the sacramental presence of Christ through those He sends. See John 20:21-23 for further apostolic authority."
    },
    {
      "pk": 40101041,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 41,
      "text": "'Whoever receives a prophet because he is a prophet will receive a prophet’s reward, and whoever receives a righteous person because he is a righteous person will receive a righteous person’s reward.'",
      "links": "<a href='/AIV/12/4/8-37'>2 Kings 4:8-37</a>",
      "comment": "Dignity of Christ’s messengers is underscored; willing support of Christ’s apostles aligns one to the rewards of their ministry, hinting at the communion of saints."
    },
    {
      "pk": 40101042,
      "translation": "AIV",
      "book": 1,
      "chapter": 10,
      "verse": 42,
      "text": "'And whoever gives even a cup of cold water to one of these little ones because he is my disciple, truly, I say to you, he will never lose his reward.'",
      "links": "<a href='/AIV/40/25/40'>Matt 25:40</a>; <a href='/AIV/41/9/41'>Mark 9:41</a>",
      "comment": "Acts of charity done for Christ’s sake, even to the least disciple, are eternally significant. See Matthew 25:40, which expands this theme in the judgment of nations."
    }
  ],
  "translatedAt": "2025-12-23T07:45:30.891Z"
}