{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 6,
  "verses": [
    {
      "pk": 1990601,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 1,
      "text": "Be careful not to practice your righteousness before others to be seen by them. Otherwise, you will have no reward from your Father who is in heaven.",
      "links": "<a href='/AIV/23/1/12'>Isa. 1:12</a>; <a href='/AIV/40/5/16'>Matt. 5:16</a>",
      "comment": "Christ warns against seeking human approval for spiritual acts, emphasizing the sincere motive of seeking only God's reward. The Father is referred to as the source of heavenly reward, highlighting the personal relationship believers are called to have with God."
    },
    {
      "pk": 1990602,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 2,
      "text": "So when you give alms, do not sound a trumpet before you, as the hypocrites do in the synagogues and in the streets, that they may be honored by others. Truly, I tell you, they have received their reward.",
      "links": "<a href='/AIV/40/23/5'>Matt. 23:5</a>",
      "comment": "Giving alms is expected, but making a show of it for recognition forfeits true spiritual reward. The repetition of 'hypocrites' introduces Jesus’ critique of outward-only religion."
    },
    {
      "pk": 1990603,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 3,
      "text": "But when you give alms, do not let your left hand know what your right hand is doing,",
      "links": "",
      "comment": "The command means to give in secrecy and humility, avoiding even self-congratulation."
    },
    {
      "pk": 1990604,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 4,
      "text": "so that your giving may be in secret; and your Father who sees in secret will reward you.",
      "links": "<a href='/AIV/40/6/6'>Matt. 6:6</a>; <a href='/AIV/40/6/18'>Matt. 6:18</a>",
      "comment": "The repeated phrase 'your Father who sees in secret' introduces the personal and gracious relationship God offers, rewarding faithfulness done in private."
    },
    {
      "pk": 1990605,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 5,
      "text": "And when you pray, do not be like the hypocrites. For they love to stand and pray in the synagogues and at the street corners, so that they may be seen by others. Truly, I tell you, they have received their reward.",
      "links": "<a href='/AIV/40/23/6-7'>Matt. 23:6–7</a>",
      "comment": "Jesus criticizes public ostentation in prayer, emphasizing interior devotion over external display. This lays the groundwork for understanding prayer as intimate communion with God."
    },
    {
      "pk": 1990606,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 6,
      "text": "But when you pray, go into your room and shut the door and pray to your Father who is in secret, and your Father who sees in secret will reward you.",
      "links": "<a href='/AIV/2/33/7-11'>Exod. 33:7–11</a>",
      "comment": "Jesus affirms private prayer, modeling communion with the Father as both personal and transformative. The inner room suggests a meaningful retreat from the world, reminiscent of Old Testament leaders meeting God apart from the crowds."
    },
    {
      "pk": 1990607,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 7,
      "text": "And when you pray, do not heap up empty phrases as the Gentiles do, for they think that they will be heard for their many words.",
      "links": "<a href='/AIV/1/18/26'>1 Kgs. 18:26</a>",
      "comment": "Jesus contrasts the pagan practice of repetitive, formulaic praying with authentic relationship-based prayer. The focus is on heartfelt communion, not verbosity."
    },
    {
      "pk": 1990608,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 8,
      "text": "Do not be like them, for your Father knows what you need before you ask him.",
      "links": "<a href='/AIV/19/139/4'>Ps. 139:4</a>",
      "comment": "God's omniscience is highlighted; prayer is less about informing God and more about growing in trust and communion."
    },
    {
      "pk": 1990609,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 9,
      "text": "Therefore, pray like this: 'Our Father in heaven, hallowed be your name.'",
      "links": "<a href='/AIV/19/103/19'>Ps. 103:19</a>; <a href='/AIV/26/36/23'>Ezek. 36:23</a>",
      "comment": "Jesus introduces the Lord’s Prayer, a model for Christian prayer. The address 'Our Father' establishes a communal and familial relationship. The sanctification of God's name echoes deep Old Testament themes of holiness."
    },
    {
      "pk": 1990610,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 10,
      "text": "'Your kingdom come, your will be done, on earth as it is in heaven.'",
      "links": "<a href='/AIV/19/22/28'>Ps. 22:28</a>; <a href='/AIV/27/2/44'>Dan. 2:44</a>",
      "comment": "The prayer for the coming kingdom and divine will echoes Old Testament prophecy and messianic expectation. Jesus implies that His followers participate in bringing heaven to earth, both literally and spiritually."
    },
    {
      "pk": 1990611,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 11,
      "text": "'Give us this day our daily bread.'",
      "links": "<a href='/AIV/2/16/4'>Exod. 16:4</a>; <a href='/AIV/19/145/15'>Ps. 145:15</a>",
      "comment": "The request for daily bread connects to God’s provision of manna and implies not only physical needs but also spiritual nourishment. Early Christian commentary often saw foreshadowing of sacramental themes here."
    },
    {
      "pk": 1990612,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 12,
      "text": "'And forgive us our debts, as we also have forgiven our debtors.'",
      "links": "<a href='/AIV/19/32/1'>Ps. 32:1</a>; <a href='/AIV/40/18/21-35'>Matt. 18:21–35</a>",
      "comment": "Forgiveness is set as a reciprocal condition. Spiritual debts refer to sins, drawing deep connections with Old Testament atonement practices and fulfillment in Christ."
    },
    {
      "pk": 1990613,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 13,
      "text": "'And lead us not into temptation, but deliver us from evil.'",
      "links": "<a href='/AIV/19/141/4'>Ps. 141:4</a>; <a href='/AIV/40/26/41'>Matt. 26:41</a>",
      "comment": "Petition for divine protection from sin and the evil one reflects deep trust in God’s sovereignty to sustain and guide. Liturgically, this prayer became central to Christian worship."
    },
    {
      "pk": 1990614,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 14,
      "text": "For if you forgive others their trespasses, your heavenly Father will also forgive you.",
      "links": "<a href='/AIV/41/11/25'>Mark 11:25</a>",
      "comment": "Jesus emphasizes forgiveness as an essential part of spiritual life, making the practice of mercy foundational for fellowship with God."
    },
    {
      "pk": 1990615,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 15,
      "text": "But if you do not forgive others their trespasses, neither will your Father forgive your trespasses.",
      "links": "<a href='/AIV/18/27/4'>Job 27:4</a>",
      "comment": "The negative corollary—unforgiveness blocks divine pardon—shows the profound connection between what we receive from God and what we share with others."
    },
    {
      "pk": 1990616,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 16,
      "text": "And when you fast, do not look somber as the hypocrites do, for they disfigure their faces so that their fasting may be seen by others. Truly, I tell you, they have received their reward.",
      "links": "<a href='/AIV/23/58/5'>Isa. 58:5</a>",
      "comment": "Fasting is commended, but doing it for show voids its spiritual benefit. True fasting, as seen in the prophets, is about humility and repentance."
    },
    {
      "pk": 1990617,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 17,
      "text": "But when you fast, anoint your head and wash your face,",
      "links": "<a href='/AIV/10/12/20'>2 Sam. 12:20</a>",
      "comment": "Jesus teaches that fasting should be marked by joy and normalcy, so the focus remains on God, not on human praise."
    },
    {
      "pk": 1990618,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 18,
      "text": "so that your fasting may not be seen by others but by your Father who is in secret; and your Father who sees in secret will reward you.",
      "links": "<a href='/AIV/40/6/6'>Matt. 6:6</a>",
      "comment": "God values the secret sacrifice—the focus is again on divine approval rather than social recognition. Repetition underscores the importance of interior spiritual life."
    },
    {
      "pk": 1990619,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 19,
      "text": "Do not store up for yourselves treasures on earth, where moth and rust destroy and where thieves break in and steal.",
      "links": "<a href='/AIV/20/23/5'>Prov. 23:5</a>",
      "comment": "Jesus calls attention to the transitory nature of material goods, inviting discipleship that seeks lasting, spiritual treasure."
    },
    {
      "pk": 1990620,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 20,
      "text": "But store up for yourselves treasures in heaven, where neither moth nor rust destroys, and where thieves do not break in or steal.",
      "links": "<a href='/AIV/19/49/17'>Ps. 49:17</a>",
      "comment": "Eternal life and spiritual riches are contrasted with earthly goods, suggesting a clear spiritual priority."
    },
    {
      "pk": 1990621,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 21,
      "text": "For where your treasure is, there your heart will be also.",
      "links": "<a href='/AIV/20/4/23'>Prov. 4:23</a>",
      "comment": "Jesus ties external actions to interior disposition, making the spiritual heart the true locus of Christian commitment."
    },
    {
      "pk": 1990622,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 22,
      "text": "The eye is the lamp of the body. So if your eye is clear, your whole body will be full of light.",
      "links": "<a href='/AIV/19/119/18'>Ps. 119:18</a>",
      "comment": "Vision here symbolizes spiritual discernment; clarity of spiritual perspective brings light into one’s whole life."
    },
    {
      "pk": 1990623,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 23,
      "text": "But if your eye is bad, your whole body will be full of darkness. If then the light in you is darkness, how great is that darkness!",
      "links": "<a href='/AIV/23/5/20'>Isa. 5:20</a>",
      "comment": "The internal darkness resulting from spiritual blindness is likened to total corruption. Jesus pushes for self examination and spiritual integrity."
    },
    {
      "pk": 1990624,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 24,
      "text": "No one can serve two masters. For either he will hate the one and love the other, or he will be devoted to the one and despise the other. You cannot serve both God and money.",
      "links": "<a href='/AIV/42/16/13'>Luke 16:13</a>",
      "comment": "Jesus stresses exclusive loyalty to God. The dichotomy between God and money (Mammon) underpins the spiritual danger of divided allegiance."
    },
    {
      "pk": 1990625,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 25,
      "text": "Therefore I tell you, do not be anxious about your life, what you will eat or what you will drink, nor about your body, what you will put on. Is not life more than food, and the body more than clothing?",
      "links": "<a href='/AIV/19/55/22'>Ps. 55:22</a>; <a href='/AIV/40/10/19'>Matt. 10:19</a>",
      "comment": "Concern for daily needs must be subordinated to trust in God. Jesus places spiritual priorities above material concerns, echoing the teaching of divine providence."
    },
    {
      "pk": 1990626,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 26,
      "text": "Look at the birds of the air: they do not sow, nor reap, nor gather into barns, and yet your heavenly Father feeds them. Are you not of much more value than they?",
      "links": "<a href='/AIV/19/104/27-28'>Ps. 104:27–28</a>",
      "comment": "Jesus affirms God’s loving providence with natural imagery. The Father's care extends generously to His creation, and even more to His children."
    },
    {
      "pk": 1990627,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 27,
      "text": "And who among you by worrying can add a single hour to his lifespan?",
      "links": "<a href='/AIV/18/14/5'>Job 14:5</a>",
      "comment": "Anxiety is shown to be futile; God alone determines the number of our days."
    },
    {
      "pk": 1990628,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 28,
      "text": "And why are you anxious about clothing? Consider the lilies of the field, how they grow; they neither labor nor spin,",
      "links": "<a href='/AIV/28/14/5-6'>Hos. 14:5–6</a>",
      "comment": "The created beauty of lilies contrasts with human anxiety over external matters, pointing to divine generosity."
    },
    {
      "pk": 1990629,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 29,
      "text": "Yet I tell you, even Solomon in all his glory was not clothed like one of these.",
      "links": "<a href='/AIV/11/10/4-7'>1 Kgs. 10:4–7</a>",
      "comment": "Jesus elevates God’s provision above even the greatest human wealth and splendor, pointing to a higher standard of divine care."
    },
    {
      "pk": 1990630,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 30,
      "text": "But if God so clothes the grass of the field, which today exists and tomorrow is thrown into the oven, will he not much more clothe you, O you of little faith?",
      "links": "<a href='/AIV/19/90/5-6'>Ps. 90:5–6</a>; <a href='/AIV/40/8/26'>Matt. 8:26</a>",
      "comment": "'Little faith' underscores Jesus' call to deeper trust in God’s provision. This gentle rebuke encourages complete reliance on divine care."
    },
    {
      "pk": 1990631,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 31,
      "text": "So do not be anxious, saying, 'What shall we eat?' or 'What shall we drink?' or 'What shall we wear?'",
      "links": "<a href='/AIV/19/37/25'>Ps. 37:25</a>",
      "comment": "Jesus compassionately calls for trust, reiterating the assurance of providence found throughout the Old Testament."
    },
    {
      "pk": 1990632,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 32,
      "text": "For the Gentiles seek after all these things, but your heavenly Father knows that you need them all.",
      "links": "<a href='/AIV/19/145/15-16'>Ps. 145:15–16</a>",
      "comment": "Gentiles are depicted as driven by material pursuit, whereas faith in God is marked by confidence in His provision."
    },
    {
      "pk": 1990633,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 33,
      "text": "But seek first the kingdom of God and his righteousness, and all these things will be given to you as well.",
      "links": "<a href='/AIV/19/34/10'>Ps. 34:10</a>; <a href='/AIV/40/5/6'>Matt. 5:6</a>",
      "comment": "Jesus teaches spiritual priorities: pursuit of the kingdom and righteousness comes before earthly concerns. Early church teaching often stressed the communal and sacramental pursuit of righteousness."
    },
    {
      "pk": 1990634,
      "translation": "AIV",
      "book": 40,
      "chapter": 6,
      "verse": 34,
      "text": "So do not worry about tomorrow, for tomorrow will worry about itself. Each day has enough trouble of its own.",
      "links": "<a href='/AIV/19/84/11'>Ps. 84:11</a>",
      "comment": "Christ advocates daily surrender; freedom from anxiety comes from reliance on God’s providential care and living faithfully each day."
    }
  ],
  "translatedAt": "2025-12-23T07:43:21.494Z"
}