{
  "book": 47,
  "bookName": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 19,
  "verses": [
    {
      "pk": 47019001,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 1,
      "text": "When Jesus finished saying these things, he departed from Galilee and went into the region of Judea beyond the Jordan.",
      "links": "<a href='/AIV/47/16/1'>Matt. 16:1</a>; <a href='/AIV/41/10/1'>Mark 10:1</a>",
      "comment": "Jesus transitions from teaching in Galilee to Judea, highlighting a change in ministry focus and context. Mark's Gospel parallels this journey, pointing to the importance of this teaching moment."
    },
    {
      "pk": 47019002,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 2,
      "text": "Large crowds followed him, and he healed them there.",
      "links": "<a href='/AIV/40/12/15'>Matt. 12:15</a>; <a href='/AIV/44/10/38'>Acts 10:38</a>",
      "comment": "Jesus’ healing ministry continues as a sign of divine authority and compassion. His works fulfill Old Testament expectations of the Messiah’s healing power (Is. 35:5-6)."
    },
    {
      "pk": 47019003,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 3,
      "text": "Some Pharisees approached him, testing him by asking, 'Is it lawful for a man to divorce his wife for any reason?'",
      "links": "<a href='/AIV/05/24/1'>Deut. 24:1</a>; <a href='/AIV/41/10/2'>Mark 10:2</a>",
      "comment": "The Pharisees refer to Mosaic law on divorce, attempting to trap Jesus. The question revolves around interpreting Deuteronomy, but Jesus’ response will transcend mere legalism."
    },
    {
      "pk": 47019004,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 4,
      "text": "He answered, 'Have you not read that he who created them at the beginning made them male and female?'",
      "links": "<a href='/AIV/01/1/27'>Gen. 1:27</a>; <a href='/AIV/01/5/2'>Gen. 5:2</a>",
      "comment": "Jesus appeals to the original creation, grounding marriage in God’s design. This elevates the discussion from human legislation to divine intention, reaffirming the dignity of marriage."
    },
    {
      "pk": 47019005,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 5,
      "text": "And he said, 'For this reason a man shall leave his father and mother and be joined to his wife, and the two shall become one flesh.'",
      "links": "<a href='/AIV/01/2/24'>Gen. 2:24</a>; <a href='/AIV/49/5/31'>Eph. 5:31</a>",
      "comment": "Jesus quotes Genesis to show marriage is a divinely instituted union, reaffirmed by Paul as a mystery pointing to Christ and the Church. The spiritual meaning transcends its literal basis."
    },
    {
      "pk": 47019006,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 6,
      "text": "'So they are no longer two, but one flesh. Therefore what God has joined together, let no one separate.'",
      "links": "<a href='/AIV/41/10/9'>Mark 10:9</a>; <a href='/AIV/39/2/15-16'>Mal. 2:15-16</a>",
      "comment": "Here Jesus sanctifies marriage as irrevocable, elevating it to a sacramental union. This teaching affirms the permanence and spiritual depth of marital commitment."
    },
    {
      "pk": 47019007,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 7,
      "text": "They said to him, 'Why then did Moses command us to give a certificate of divorce and send her away?'",
      "links": "<a href='/AIV/05/24/1'>Deut. 24:1-4</a>",
      "comment": "The Pharisees refer to Mosaic allowances for divorce, highlighting tensions between the Law’s concessions and Jesus’ restoration of original divine purpose."
    },
    {
      "pk": 47019008,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 8,
      "text": "He replied, 'Moses allowed you to divorce your wives because of the hardness of your hearts, but from the beginning it was not so.'",
      "links": "<a href='/AIV/05/24/1'>Deut. 24:1</a>; <a href='/AIV/49/5/33'>Eph. 5:33</a>",
      "comment": "Jesus exposes that divorce was permitted as a concession for human sin, not God's original plan. He calls believers to a higher spiritual standard rooted in love and fidelity."
    },
    {
      "pk": 47019009,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 9,
      "text": "And I say to you, whoever divorces his wife, except for sexual immorality, and marries another, commits adultery.",
      "links": "<a href='/AIV/41/10/11'>Mark 10:11</a>; <a href='/AIV/40/5/32'>Matt. 5:32</a>",
      "comment": "Christ’s words assert the gravity of marital fidelity. He authoritatively reinterprets the Law as the divine legislator, hinting at his authority over Moses, a subtle allusion to divinity."
    },
    {
      "pk": 47019010,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 10,
      "text": "The disciples said to him, 'If this is the situation between a husband and wife, it is better not to marry.'",
      "links": "<a href='/AIV/46/7/1'>1 Cor. 7:1</a>",
      "comment": "The disciples recognize the high calling of marriage. Their reaction foreshadows Paul's teaching on celibacy and the unique witness of singleness for the kingdom."
    },
    {
      "pk": 47019011,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 11,
      "text": "But he said to them, 'Not everyone can accept this word, but only those to whom it has been given.'",
      "links": "<a href='/AIV/46/7/7'>1 Cor. 7:7</a>",
      "comment": "Jesus teaches that celibacy is a special vocation, a gift from God, not a universal command. This anticipates later spiritual disciplines and suggests holiness has diverse paths."
    },
    {
      "pk": 47019012,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 12,
      "text": "'For there are eunuchs who were born that way from birth, and there are eunuchs who have been made eunuchs by others, and there are those who have made themselves eunuchs for the sake of the kingdom of heaven. Whoever can accept this should accept it.'",
      "links": "<a href='/AIV/46/7/32'>1 Cor. 7:32-34</a>; <a href='/AIV/40/13/11'>Matt. 13:11</a>",
      "comment": "Jesus acknowledges varied states of life, elevating voluntary celibacy as a spiritual discipline for the kingdom. This hints at the exalted calling to undivided service to God."
    },
    {
      "pk": 47019013,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 13,
      "text": "Then children were brought to him so that he might lay his hands on them and pray. But the disciples rebuked those who brought them.",
      "links": "<a href='/AIV/41/10/13'>Mark 10:13</a>; <a href='/AIV/42/18/15'>Luke 18:15</a>",
      "comment": "Children are welcomed as objects of blessing and prayer, showing Jesus’ tenderness. Laying on of hands points to impartation of grace, hinting at sacramental themes."
    },
    {
      "pk": 47019014,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 14,
      "text": "But Jesus said, 'Let the children come to me, and do not hinder them, for the kingdom of heaven belongs to such as these.'",
      "links": "<a href='/AIV/40/18/3'>Matt. 18:3</a>; <a href='/AIV/41/10/14'>Mark 10:14</a>",
      "comment": "Jesus demonstrates that innocence and humility are key dispositions for receiving the kingdom. His openness to children models the inclusivity of divine grace."
    },
    {
      "pk": 47019015,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 15,
      "text": "And after laying his hands on them, he went away from there.",
      "links": "<a href='/AIV/41/10/16'>Mark 10:16</a>",
      "comment": "The act of laying hands is significant, used throughout scripture to impart blessing, authority, and grace (Num. 27:18; Acts 6:6); a foreshadowing of sacramental life."
    },
    {
      "pk": 47019016,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 16,
      "text": "And behold, a man came up and asked, 'Teacher, what good must I do to have eternal life?'",
      "links": "<a href='/AIV/41/10/17'>Mark 10:17</a>; <a href='/AIV/42/18/18'>Luke 18:18</a>",
      "comment": "The question is about inheriting eternal life, highlighting the relationship between grace and works. Jesus will point to the fullness of the law and the need for interior transformation."
    },
    {
      "pk": 47019017,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 17,
      "text": "He said to him, 'Why do you ask me about what is good? There is only One who is good. But if you want to enter life, keep the commandments.'",
      "links": "<a href='/AIV/05/6/4'>Deut. 6:4</a>; <a href='/AIV/02/20/1-17'>Ex. 20:1-17</a>",
      "comment": "Jesus redirects him to the goodness of God and reinforces obedience to God's commandments as foundational, implying the continuity of God's law and pointing to divine perfection."
    },
    {
      "pk": 47019018,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 18,
      "text": "He said to him, 'Which ones?' And Jesus replied, 'You shall not murder, you shall not commit adultery, you shall not steal, you shall not give false testimony,'",
      "links": "<a href='/AIV/02/20/13-16'>Ex. 20:13-16</a>",
      "comment": "Jesus lists commandments from the Decalogue, emphasizing moral and social dimensions of righteousness. Faithfulness to these duties is the ground for participating in God's life."
    },
    {
      "pk": 47019019,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 19,
      "text": "'Honor your father and mother; and, you shall love your neighbor as yourself.'",
      "links": "<a href='/AIV/02/20/12'>Ex. 20:12</a>; <a href='/AIV/03/19/18'>Lev. 19:18</a>; <a href='/AIV/40/22/39'>Matt. 22:39</a>",
      "comment": "Jesus brings together Mosaic commands and the summary of the Law in love for neighbor, offering a holistic vision of righteousness both relationally and spiritually."
    },
    {
      "pk": 47019020,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 20,
      "text": "The young man said to him, 'All these I have kept. What do I still lack?'",
      "links": "<a href='/AIV/41/10/20'>Mark 10:20</a>",
      "comment": "The man perceives a deficit, despite outward adherence to the Law, revealing the limitations of self-righteousness and the need for a deeper response to grace."
    },
    {
      "pk": 47019021,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 21,
      "text": "Jesus said to him, 'If you want to be perfect, go, sell your possessions and give to the poor, and you will have treasure in heaven; then come, follow me.'",
      "links": "<a href='/AIV/40/6/19-21'>Matt. 6:19-21</a>; <a href='/AIV/05/15/11'>Deut. 15:11</a>",
      "comment": "Perfection is identified with surrendering all for the sake of Christ and the poor; joining Jesus is more than moral observance – it’s entering a life of sacrificial discipleship."
    },
    {
      "pk": 47019022,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 22,
      "text": "When the young man heard this, he went away sad, for he had many possessions.",
      "links": "<a href='/AIV/41/10/22'>Mark 10:22</a>; <a href='/AIV/54/6/10'>1 Tim. 6:10</a>",
      "comment": "Attachment to wealth can hinder spiritual growth. True discipleship calls for detachment and greater trust in divine providence, echoed throughout the New Testament."
    },
    {
      "pk": 47019023,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 23,
      "text": "Then Jesus said to his disciples, 'Truly, I tell you, it is hard for a rich person to enter the kingdom of heaven.'",
      "links": "<a href='/AIV/41/10/23'>Mark 10:23</a>; <a href='/AIV/42/6/24'>Luke 6:24</a>",
      "comment": "Jesus teaches on spiritual poverty as a virtue. Those who possess earthly wealth must guard against placing their security outside of God."
    },
    {
      "pk": 47019024,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 24,
      "text": "Again I say to you, it is easier for a camel to go through the eye of a needle than for a rich person to enter the kingdom of God.",
      "links": "<a href='/AIV/41/10/25'>Mark 10:25</a>",
      "comment": "This hyperbole stresses the radical challenge wealth poses. Ultimate salvation is not achieved by human effort but is a gift that depends on divine grace."
    },
    {
      "pk": 47019025,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 25,
      "text": "When the disciples heard this, they were greatly astonished, saying, 'Who then can be saved?'",
      "links": "<a href='/AIV/41/10/26'>Mark 10:26</a>",
      "comment": "The disciples realize salvation requires more than human effort or merit, prompting them toward a deeper reliance on God’s initiative."
    },
    {
      "pk": 47019026,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 26,
      "text": "Jesus looked at them and said, 'With man this is impossible, but with God all things are possible.'",
      "links": "<a href='/AIV/01/18/14'>Gen. 18:14</a>; <a href='/AIV/42/1/37'>Luke 1:37</a>",
      "comment": "Jesus declares the omnipotence of God in the context of salvation, connecting Old Testament revelations of God’s power with the New Covenant, echoing his divine prerogatives."
    },
    {
      "pk": 47019027,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 27,
      "text": "Peter answered him, 'See, we have left everything and followed you. What then will there be for us?'",
      "links": "<a href='/AIV/40/4/20'>Matt. 4:20</a>; <a href='/AIV/41/10/28'>Mark 10:28</a>",
      "comment": "Peter expresses the sacrificial nature of discipleship, laying groundwork for Jesus to promise a unique reward to those who embrace radical commitment."
    },
    {
      "pk": 47019028,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 28,
      "text": "Jesus said to them, 'Truly, I say to you, in the new creation, when the Son of Man sits on his glorious throne, you who have followed me will also sit on twelve thrones, judging the twelve tribes of Israel.'",
      "links": "<a href='/AIV/42/22/30'>Luke 22:30</a>; <a href='/AIV/66/20/4'>Rev. 20:4</a>",
      "comment": "Jesus speaks of an eschatological renewal, promising his apostles special authority and participation in his reign. The Son of Man's throne is a clear claim to messianic and divine prerogatives."
    },
    {
      "pk": 47019029,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 29,
      "text": "And everyone who has left houses or brothers or sisters or father or mother or children or fields for my name’s sake will receive a hundred times as much and will inherit eternal life.",
      "links": "<a href='/AIV/41/10/29-30'>Mark 10:29-30</a>; <a href='/AIV/42/18/29-30'>Luke 18:29-30</a>",
      "comment": "Jesus promises abundant spiritual reward and eternal life for sacrificial dedication. This hints at the transformative grace given to all who follow Christ radically."
    },
    {
      "pk": 47019030,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 19,
      "verse": 30,
      "text": "But many who are first will be last, and the last first.",
      "links": "<a href='/AIV/40/20/16'>Matt. 20:16</a>; <a href='/AIV/42/13/30'>Luke 13:30</a>",
      "comment": "Jesus closes teaching with a paradox about divine justice and grace. External privilege does not guarantee spiritual precedence; humility and surrender undergird true greatness."
    }
  ],
  "translatedAt": "2025-12-24T10:12:59.472Z"
}