{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 25,
  "verses": [
    {
      "pk": 25001500,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 1,
      "text": "Then the kingdom of heaven will be like ten virgins who took their lamps and went out to meet the bridegroom.",
      "links": "<a href='/AIV/40/24/42'>Matt. 24:42</a>; <a href='/AIV/22/3/11'>Song 3:11</a>",
      "comment": "This parable sets the stage for being watchful and prepared for Christ’s coming. The use of 'virgins' emphasizes purity and readiness to receive the bridegroom—a clear image of the Church awaiting Christ."
    },
    {
      "pk": 25001501,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 2,
      "text": "Five of them were foolish, and five were wise.",
      "links": "<a href='/AIV/40/7/24-27'>Matt. 7:24-27</a>; <a href='/AIV/40/13/47-50'>Matt. 13:47-50</a>",
      "comment": "This division underscores the importance of discernment and wisdom in waiting for the Lord. Wisdom here points to a spiritual preparedness rooted in grace."
    },
    {
      "pk": 25001502,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 3,
      "text": "For when the foolish took their lamps, they took no oil with them;",
      "links": "<a href='/AIV/40/5/3'>Matt. 5:3</a>",
      "comment": "Oil is often interpreted as representing faith, charity, or the Holy Spirit—a spiritual resource to sustain the soul. The lack points to insufficient spiritual preparation."
    },
    {
      "pk": 25001503,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 4,
      "text": "but the wise took oil in their flasks with their lamps.",
      "links": "<a href='/AIV/40/13/12'>Matt. 13:12</a>",
      "comment": "The wise exemplify foresight and a spiritual readiness to persevere. This is a strong call to constant vigilance in living out one’s faith deeply."
    },
    {
      "pk": 25001504,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 5,
      "text": "As the bridegroom was delayed, they all became drowsy and slept.",
      "links": "<a href='/AIV/40/24/48'>Matt. 24:48</a>; <a href='/AIV/40/26/40-43'>Matt. 26:40-43</a>",
      "comment": "The delay of the bridegroom reflects the period of waiting for Christ's return—a theme recurring in early Christian expectation."
    },
    {
      "pk": 25001505,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 6,
      "text": "But at midnight there was a cry: ‘Behold, the bridegroom! Come out to meet him.’",
      "links": "<a href='/AIV/40/24/44'>Matt. 24:44</a>; <a href='/AIV/41/13/35'>Mark 13:35</a>",
      "comment": "The midnight hour symbolizes unexpectedness; readiness is necessary since Christ’s return will come suddenly."
    },
    {
      "pk": 25001506,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 7,
      "text": "Then all those virgins rose and trimmed their lamps.",
      "links": "<a href='/AIV/40/5/14-16'>Matt. 5:14-16</a>",
      "comment": "Trimming lamps signifies preparing ourselves to shine with the light of faith and good works."
    },
    {
      "pk": 25001507,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 8,
      "text": "And the foolish said to the wise, ‘Give us some of your oil, for our lamps are going out.’",
      "links": "<a href='/AIV/40/7/21-23'>Matt. 7:21-23</a>",
      "comment": "Spiritual resources, such as grace, cannot always be borrowed—they require personal cultivation. This echoes the need for perseverance in keeping faith alive."
    },
    {
      "pk": 25001508,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 9,
      "text": "But the wise answered, saying, ‘There may not be enough for us and for you; instead, go to the dealers and buy for yourselves.’",
      "links": "<a href='/AIV/40/13/30'>Matt. 13:30</a>",
      "comment": "This statement shows that preparation for the coming of Christ is a responsibility each person must undertake individually."
    },
    {
      "pk": 25001509,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 10,
      "text": "And while they were going to buy, the bridegroom came, and those who were ready went in with him to the wedding feast, and the door was shut.",
      "links": "<a href='/AIV/40/22/2-13'>Matt. 22:2-13</a>; <a href='/AIV/66/19/9'>Rev. 19:9</a>",
      "comment": "The wedding feast is a symbol of the heavenly banquet. The shut door shows finality—there’s a limit to the time for mercy and repentance."
    },
    {
      "pk": 25001510,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 11,
      "text": "Afterward the other virgins came also, saying, ‘Lord, Lord, open to us.’",
      "links": "<a href='/AIV/40/7/21-23'>Matt. 7:21-23</a>",
      "comment": "Crying out 'Lord, Lord' recalls the necessity of true relationship with Christ, beyond outward religious acts."
    },
    {
      "pk": 25001511,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 12,
      "text": "But he answered, ‘Truly, I say to you, I do not know you.’",
      "links": "<a href='/AIV/40/7/23'>Matt. 7:23</a>; <a href='/AIV/42/13/25-27'>Luke 13:25-27</a>",
      "comment": "‘I do not know you’ indicates more than lack of acquaintance—it points to judgment of those not united to Christ through faith and obedience."
    },
    {
      "pk": 25001512,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 13,
      "text": "Stay awake, therefore, for you do not know the day nor the hour.",
      "links": "<a href='/AIV/40/24/42'>Matt. 24:42</a>; <a href='/AIV/41/13/32-37'>Mark 13:32-37</a>",
      "comment": "Vigilance is necessary—a call to ongoing conversion and sanctification, living every day as if Christ could return at any moment."
    },
    {
      "pk": 25001513,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 14,
      "text": "For it will be like a man going on a journey, who called his servants and entrusted his possessions to them.",
      "links": "<a href='/AIV/40/21/33'>Matt. 21:33</a>; <a href='/AIV/42/19/12-27'>Luke 19:12-27</a>",
      "comment": "This introduces another parable, focusing on stewardship and accountability for the gifts entrusted by God."
    },
    {
      "pk": 25001514,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 15,
      "text": "To one he gave five talents, to another two, and to another one, each according to his own ability; then he went away.",
      "links": "<a href='/AIV/40/18/24'>Matt. 18:24</a>",
      "comment": "‘Talents’ here refers to a large amount of money, but spiritually they represent gifts, responsibilities, and graces God gives each person as He wills."
    },
    {
      "pk": 25001515,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 16,
      "text": "Immediately, the one who had received the five talents went and traded with them and made five more.",
      "links": "<a href='/AIV/40/13/23'>Matt. 13:23</a>",
      "comment": "This shows fruitfulness—the servant responds actively to God’s gifts, multiplying them through diligence."
    },
    {
      "pk": 25001516,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 17,
      "text": "Likewise, the one who had two talents gained two more.",
      "links": "",
      "comment": "All are called to be fruitful, regardless of the magnitude of what is given them."
    },
    {
      "pk": 25001517,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 18,
      "text": "But the servant who had received one talent went away, dug a hole in the ground, and hid his master’s money.",
      "links": "<a href='/AIV/40/5/13'>Matt. 5:13</a>",
      "comment": "Burying the talent suggests neglecting the graces and opportunities given, a failure of trust and diligence."
    },
    {
      "pk": 25001518,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 19,
      "text": "After a long time, the master of those servants came and settled accounts with them.",
      "links": "<a href='/AIV/40/24/48-51'>Matt. 24:48-51</a>; <a href='/AIV/66/20/12'>Rev. 20:12</a>",
      "comment": "This refers to the final judgment, when Christ will return and evaluate every person’s life and stewardship."
    },
    {
      "pk": 25001519,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 20,
      "text": "And the one who had received five talents came forward, bringing five more talents, saying, ‘Master, you delivered to me five talents; here, I have made five more talents.’",
      "links": "",
      "comment": "This joyful accountability reflects a relationship built on love and faithfulness."
    },
    {
      "pk": 25001520,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 21,
      "text": "His master said to him, ‘Well done, good and faithful servant. You have been faithful with a little; I will set you over much. Enter into the joy of your master.’",
      "links": "<a href='/AIV/42/16/10-12'>Luke 16:10-12</a>; <a href='/AIV/66/19/9'>Rev. 19:9</a>",
      "comment": "Faithfulness in the small things is rewarded with greater responsibility and eternal happiness—a promise of entering into God’s joy and communion."
    },
    {
      "pk": 25001521,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 22,
      "text": "And similarly, the one who had received two talents came forward and said, ‘Master, you gave me two talents; here, I have gained two more.’",
      "links": "",
      "comment": "All receive approval for faithfulness, regardless of the quantity entrusted. God rewards according to what each person is given."
    },
    {
      "pk": 25001522,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 23,
      "text": "His master said to him, ‘Well done, good and faithful servant. You have been faithful with a little; I will set you over much. Enter into the joy of your master.’",
      "links": "<a href='/AIV/66/19/9'>Rev. 19:9</a>",
      "comment": "Repeat of verse 21, showing that proportional fruitfulness is what God desires."
    },
    {
      "pk": 25001523,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 24,
      "text": "And the one who had received one talent also came forward, saying, ‘Master, I knew you to be a hard man, reaping where you did not sow, and gathering where you did not scatter seed;",
      "links": "",
      "comment": "A distorted view of God leads to inaction and fear—faith is essential to multiply the gifts we are given."
    },
    {
      "pk": 25001524,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 25,
      "text": "so I was afraid, and I went and hid your talent in the ground. Here, you have what is yours.’",
      "links": "",
      "comment": "Fearful self-preservation is condemned; faith must be active and courageous."
    },
    {
      "pk": 25001525,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 26,
      "text": "But his master answered, ‘You wicked and lazy servant! You knew that I reap where I have not sown and gather where I did not scatter.",
      "links": "<a href='/AIV/40/18/32'>Matt. 18:32</a>",
      "comment": "The lack of spiritual action is described as wickedness and laziness. Mere knowledge of God, without fruitful response, is not enough."
    },
    {
      "pk": 25001526,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 27,
      "text": "Then you ought to have invested my money with the bankers, and at my coming I would have received what was mine with interest.",
      "links": "",
      "comment": "Even minimal effort in growing the gifts God gives is recognized. The call is for active participation in the life of faith."
    },
    {
      "pk": 25001527,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 28,
      "text": "So take the talent from him and give it to the one who has ten talents.",
      "links": "<a href='/AIV/40/13/12'>Matt. 13:12</a>",
      "comment": "This reveals the principle that faithfulness brings more grace, while neglect leads to loss."
    },
    {
      "pk": 25001528,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 29,
      "text": "For to everyone who has, more will be given, and he will have an abundance. But from the one who does not have, even what he has will be taken away.",
      "links": "<a href='/AIV/40/13/12'>Matt. 13:12</a>; <a href='/AIV/42/8/18'>Luke 8:18</a>",
      "comment": "This echoes the teaching that merit accumulates through responding to God’s gifts; it’s an encouragement to perseverance."
    },
    {
      "pk": 25001529,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 30,
      "text": "And cast the worthless servant into the outer darkness. In that place there will be weeping and gnashing of teeth.’",
      "links": "<a href='/AIV/40/8/12'>Matt. 8:12</a>; <a href='/AIV/40/13/42'>Matt. 13:42</a>",
      "comment": "Outer darkness is an image of eternal separation from God—a warning about failing to respond to His gifts with faith and love."
    },
    {
      "pk": 25001530,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 31,
      "text": "When the Son of Man comes in his glory, and all the angels with him, then he will sit on his glorious throne.",
      "links": "<a href='/AIV/27/7/13-14'>Dan. 7:13-14</a>; <a href='/AIV/66/20/11-12'>Rev. 20:11-12</a>",
      "comment": "This identifies Jesus as divine—fulfilling Daniel 7’s prophecy of the Son of Man receiving authority and worship. 'Glory' and the host of angels indicate His divine kingship."
    },
    {
      "pk": 25001531,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 32,
      "text": "And all the nations will be gathered before him, and he will separate them one from another, as a shepherd separates the sheep from the goats.",
      "links": "<a href='/AIV/26/34/17'>Ezek. 34:17</a>",
      "comment": "Universal judgment is emphasized here—Christ judges all humanity with perfect righteousness."
    },
    {
      "pk": 25001532,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 33,
      "text": "And he will place the sheep on his right, but the goats on the left.",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>",
      "comment": "Allusion to Psalm 110:1; the right hand is the place of honor and blessing, pointing to Christ granting authority and eternal life to the righteous."
    },
    {
      "pk": 25001533,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 34,
      "text": "Then the King will say to those on his right, ‘Come, you who are blessed by my Father, inherit the kingdom prepared for you from the foundation of the world;",
      "links": "<a href='/AIV/40/5/3'>Matt. 5:3</a>; <a href='/AIV/40/13/43'>Matt. 13:43</a>",
      "comment": "Jesus calls Himself ‘King,’ a messianic title. The kingdom belongs to the blessed—those united with God in Christ, as planned from the world’s beginning."
    },
    {
      "pk": 25001534,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 35,
      "text": "For I was hungry and you gave me food, I was thirsty and you gave me drink, I was a stranger and you welcomed me,",
      "links": "<a href='/AIV/23/58/7'>Isa. 58:7</a>; <a href='/AIV/40/10/42'>Matt. 10:42</a>",
      "comment": "Love for neighbor, expressed concretely, is visible here as being deeply united to Christ through works of mercy."
    },
    {
      "pk": 25001535,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 36,
      "text": "I was naked and you clothed me, I was sick and you visited me, I was in prison and you came to me.’",
      "links": "<a href='/AIV/58/13/3'>Heb. 13:3</a>",
      "comment": "Corporal works of mercy are listed, connecting love of neighbor to eternal reward—a key teaching for the way Christians sanctify daily life."
    },
    {
      "pk": 25001536,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 37,
      "text": "Then the righteous will answer him, saying, ‘Lord, when did we see you hungry and feed you, or thirsty and give you drink?",
      "links": "",
      "comment": "The righteous act out of love, not calculation—reflecting a heart transformed by grace."
    },
    {
      "pk": 25001537,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 38,
      "text": "And when did we see you a stranger and welcome you, or naked and clothe you?",
      "links": "",
      "comment": "Their humility displays that true charity is selfless and follows Christ’s example."
    },
    {
      "pk": 25001538,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 39,
      "text": "And when did we see you sick or in prison and visit you?’",
      "links": "",
      "comment": "Again, Christ identifies Himself with the suffering and marginalized, making service of others a service to Himself."
    },
    {
      "pk": 25001539,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 40,
      "text": "And the King will answer them, ‘Truly, I say to you, as you did it to one of the least of these my brothers, you did it to me.’",
      "links": "<a href='/AIV/40/10/42'>Matt. 10:42</a>; <a href='/AIV/58/2/11'>Heb. 2:11</a>",
      "comment": "This teaching unites acts of mercy directly to Jesus—emphasizing incarnational theology and the mystical Body of Christ."
    },
    {
      "pk": 25001540,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 41,
      "text": "Then he will say to those on his left, ‘Away from me, you cursed, into the eternal fire prepared for the devil and his angels;",
      "links": "<a href='/AIV/40/13/41-42'>Matt. 13:41-42</a>; <a href='/AIV/66/20/10'>Rev. 20:10</a>",
      "comment": "Eternal separation from God awaits those who reject mercy and fail to respond in love—a warning addressing the reality of final judgment."
    },
    {
      "pk": 25001541,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 42,
      "text": "For I was hungry and you gave me no food, I was thirsty and you gave me no drink,",
      "links": "<a href='/AIV/23/58/7'>Isa. 58:7</a>",
      "comment": "Omission of acts of mercy is presented as a serious spiritual failure."
    },
    {
      "pk": 25001542,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 43,
      "text": "I was a stranger and you did not welcome me, naked and you did not clothe me, sick and in prison and you did not visit me.’",
      "links": "<a href='/AIV/58/13/3'>Heb. 13:3</a>",
      "comment": "Love’s absence becomes separation from Christ—reminding us that faith is lived authentically in charity."
    },
    {
      "pk": 25001543,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 44,
      "text": "Then they also will answer, saying, ‘Lord, when did we see you hungry or thirsty or a stranger or naked or sick or in prison, and did not minister to you?’",
      "links": "",
      "comment": "Their response shows a lack of awareness about the hidden ways Christ makes Himself present in others."
    },
    {
      "pk": 25001544,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 45,
      "text": "Then he will answer them, saying, ‘Truly, I say to you, as you did not do it to one of the least of these, you did not do it to me.’",
      "links": "<a href='/AIV/40/10/42'>Matt. 10:42</a>; <a href='/AIV/58/2/11'>Heb. 2:11</a>",
      "comment": "Neglect of charity toward others is neglect of Christ Himself, connecting salvation to living faith expressed in works."
    },
    {
      "pk": 25001545,
      "translation": "AIV",
      "book": 40,
      "chapter": 25,
      "verse": 46,
      "text": "And these will go away into eternal punishment, but the righteous into eternal life.",
      "links": "<a href='/AIV/40/13/43'>Matt. 13:43</a>; <a href='/AIV/66/22/14'>Rev. 22:14</a>",
      "comment": "The final fate of each person is determined by their response to God’s grace in charity and faith. This connects closely with the teaching that salvation involves a transformed life, both interiorly and outwardly."
    }
  ],
  "translatedAt": "2025-12-23T02:19:16.927Z"
}