{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 21,
  "verses": [
    {
      "pk": 2102101,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 1,
      "text": "When they approached Jerusalem and came to Bethphage, at the Mount of Olives, Jesus sent two disciples,",
      "links": "<a href='/AIV/41/11/1'>Mark 11:1</a>; <a href='/AIV/42/19/29'>Luke 19:29</a>",
      "comment": "The setting at the Mount of Olives has prophetic significance, echoing Zechariah 14:4 concerning the coming of the Lord."
    },
    {
      "pk": 2102102,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 2,
      "text": "saying to them, 'Go into the village ahead of you, and at once you will find a donkey tied, and a colt with her. Untie them and bring them to me.'",
      "links": "<a href='/AIV/38/9/9'>Zech. 9:9</a>",
      "comment": "Jesus' instructions fulfill prophecy from Zechariah 9:9, foreshadowing his humble yet royal entry."
    },
    {
      "pk": 2102103,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 3,
      "text": "If anyone says anything to you, say that the Lord needs them, and they will send them immediately.",
      "links": "",
      "comment": "The title 'Lord' (Greek: kurios) here is a strong claim of authority, pointing to Jesus' divinity and messianic status."
    },
    {
      "pk": 2102104,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 4,
      "text": "This took place so that what was spoken through the prophet might be fulfilled:",
      "links": "<a href='/AIV/38/9/9'>Zech. 9:9</a>",
      "comment": "Matthew regularly emphasizes fulfilled prophecy, highlighting Jesus as the true messianic king foretold in the Old Testament."
    },
    {
      "pk": 2102105,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 5,
      "text": "'Say to the daughter of Zion, \"Behold, your King is coming to you, humble and mounted on a donkey, and on a colt, the foal of a beast of burden.\"'",
      "links": "<a href='/AIV/38/9/9'>Zech. 9:9</a>",
      "comment": "Direct quotation from Zechariah 9:9. Jesus enters as the humble Messiah, fulfilling the expectation of a gentle yet authoritative ruler."
    },
    {
      "pk": 2102106,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 6,
      "text": "The disciples went and did just as Jesus had directed them.",
      "links": "",
      "comment": "The disciples’ obedience is noteworthy, reinforcing the importance of responding to Jesus’ word without hesitation."
    },
    {
      "pk": 2102107,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 7,
      "text": "They brought the donkey and the colt and put their cloaks on them, and he sat on them.",
      "links": "",
      "comment": "The placing of cloaks is a sign of honor and submission to Jesus as King. This gesture recalls Old Testament anointing narratives."
    },
    {
      "pk": 2102108,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 8,
      "text": "A very large crowd spread their cloaks on the road, and others cut branches from the trees and spread them on the road.",
      "links": "<a href='/AIV/12/9/13'>2 Kings 9:13</a>",
      "comment": "Spreading cloaks echoes 2 Kings 9:13 where Jehu is honored; palm branches signal victory and kingship."
    },
    {
      "pk": 2102109,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 9,
      "text": "The crowds who went ahead of him and those who followed shouted, 'Hosanna to the Son of David! Blessed is he who comes in the name of the Lord! Hosanna in the highest!'",
      "links": "<a href='/AIV/19/118/26'>Ps. 118:26</a>; <a href='/AIV/40/9/27'>Matt. 9:27</a>",
      "comment": "‘Son of David’ acknowledges Jesus as the Messianic heir. Psalm 118:26 is a pilgrimage blessing, now directed to Jesus, showing acceptance of his divine kingship."
    },
    {
      "pk": 2102110,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 10,
      "text": "When he entered Jerusalem, the whole city was stirred up, saying, 'Who is this?'",
      "links": "<a href='/AIV/40/16/13'>Matt. 16:13</a>",
      "comment": "Jesus’ entry causes a stir, as people face the question of his true identity—divine Son or mere teacher."
    },
    {
      "pk": 2102111,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 11,
      "text": "And the crowds said, 'This is Jesus, the prophet from Nazareth in Galilee.'",
      "links": "<a href='/AIV/40/21/46'>Matt. 21:46</a>; <a href='/AIV/43/6/14'>John 6:14</a>",
      "comment": "Though recognized as a prophet, Jesus’ identity extends beyond prophecy to messiahship and divinity (see Matt. 16:16)."
    },
    {
      "pk": 2102112,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 12,
      "text": "Jesus entered the temple and drove out all who were selling and buying in the temple. He overturned the tables of the money changers and the seats of those who sold pigeons.",
      "links": "<a href='/AIV/43/2/14'>John 2:14-16</a>; <a href='/AIV/24/7/11'>Jer. 7:11</a>",
      "comment": "Cleansing the temple fulfills Malachi 3:1-3 and demonstrates Jesus’ authority over sacred spaces, foreshadowing his role as high priest."
    },
    {
      "pk": 2102113,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 13,
      "text": "He said to them, 'It is written, \"My house shall be called a house of prayer,\" but you make it a den of robbers.'",
      "links": "<a href='/AIV/23/56/7'>Isa. 56:7</a>; <a href='/AIV/24/7/11'>Jer. 7:11</a>",
      "comment": "Jesus combines Isaiah 56:7 and Jeremiah 7:11. The rebuke points to right worship and the sanctity of God’s house, with implications for liturgical reverence."
    },
    {
      "pk": 2102114,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 14,
      "text": "The blind and the lame came to him in the temple, and he healed them.",
      "links": "<a href='/AIV/23/35/5-6'>Isa. 35:5-6</a>",
      "comment": "Healing in the temple echoes messianic predictions in Isaiah 35:5-6. Jesus acts with divine power, fulfilling the role of the Savior in the context of worship."
    },
    {
      "pk": 2102115,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 15,
      "text": "But when the chief priests and the scribes saw the wonderful things he did, and the children crying out in the temple, 'Hosanna to the Son of David!' they were indignant.",
      "links": "",
      "comment": "Children's praise acknowledges Jesus' kingship, a reference to Psalm 8:2 and the innocence that discerns truth, in contrast to hardened hearts."
    },
    {
      "pk": 2102116,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 16,
      "text": "They said to him, 'Do you hear what these are saying?' Jesus said to them, 'Yes; have you never read, \"Out of the mouths of infants and nursing babies you have prepared praise\"?'",
      "links": "<a href='/AIV/19/8/2'>Ps. 8:2</a>",
      "comment": "Jesus cites Psalm 8:2, showing that praise from the humble rightly proclaims God's presence, and affirming children’s spiritual insight."
    },
    {
      "pk": 2102117,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 17,
      "text": "And leaving them, he went out of the city to Bethany and spent the night there.",
      "links": "<a href='/AIV/41/11/11'>Mark 11:11</a>; <a href='/AIV/43/11/1'>John 11:1</a>",
      "comment": "Bethany becomes a place of retreat for Jesus; significant events soon unfold nearby, underscoring the tension with the religious authorities."
    },
    {
      "pk": 2102118,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 18,
      "text": "Early in the morning as he was returning to the city, he was hungry.",
      "links": "<a href='/AIV/41/11/12'>Mark 11:12</a>",
      "comment": "Jesus’ physical hunger highlights his true humanity, while the context points towards a spiritual lesson to come."
    },
    {
      "pk": 2102119,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 19,
      "text": "Seeing a lone fig tree by the road, he went up to it and found nothing on it except leaves. He said to it, 'May no fruit ever come from you again.' Immediately the fig tree withered.",
      "links": "<a href='/AIV/41/11/13-14'>Mark 11:13–14</a>",
      "comment": "The cursed fig tree serves as symbolic judgment on fruitless faith. The immediacy stresses the authority in Jesus’ words, linking to prophetic power."
    },
    {
      "pk": 2102120,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 20,
      "text": "When the disciples saw this, they marveled, saying, 'How did the fig tree wither instantly?'",
      "links": "",
      "comment": "Their astonishment shows recognition of Jesus' divine authority over creation, recalling miracles performed by God's prophets."
    },
    {
      "pk": 2102121,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 21,
      "text": "Jesus answered them, 'Truly, I say to you, if you have faith and do not doubt, you will not only do what was done to the fig tree, but even if you say to this mountain, \"Be taken up and thrown into the sea,\" it will happen.'",
      "links": "<a href='/AIV/40/17/20'>Matt. 17:20</a>",
      "comment": "'This mountain' may refer to obstacles to faith, or even the Temple Mount, symbolizing transformative power through genuine faith."
    },
    {
      "pk": 2102122,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 22,
      "text": "And whatever you ask in prayer, believing, you will receive.",
      "links": "<a href='/AIV/43/14/13'>John 14:13</a>; <a href='/AIV/59/1/6'>James 1:6</a>",
      "comment": "The promise of answered prayer highlights active relationship with God, through faith expressed in prayer rooted in belief and trust."
    },
    {
      "pk": 2102123,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 23,
      "text": "When he entered the temple, the chief priests and elders of the people came to him while he was teaching and said, 'By what authority are you doing these things, and who gave you this authority?'",
      "links": "<a href='/AIV/41/11/27'>Mark 11:27</a>; <a href='/AIV/42/20/1'>Luke 20:1–2</a>",
      "comment": "The temple leadership questions Jesus’ divine authority, recognizing the extraordinary nature of his deeds and teachings."
    },
    {
      "pk": 2102124,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 24,
      "text": "Jesus answered them, 'I also will ask you one question. If you tell me, I also will tell you by what authority I do these things.'",
      "links": "",
      "comment": "Jesus’ counter-question exposes their unwillingness to accept divine revelation, and tests their sincerity."
    },
    {
      "pk": 2102125,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 25,
      "text": "'Where was John’s baptism from? From heaven or from men?' They debated among themselves, saying, 'If we say, \"From heaven,\" he will say to us, \"Why then did you not believe him?\"'",
      "links": "<a href='/AIV/40/3/13'>Matt. 3:13</a>",
      "comment": "John's authority as a prophet and witness to Christ is a challenge to the leaders’ spiritual discernment. Belief in John's ministry reinforces faith in Jesus as Messiah."
    },
    {
      "pk": 2102126,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 26,
      "text": "But if we say, 'From men,' we fear the crowd, for they all regard John as a prophet.",
      "links": "",
      "comment": "The leaders are trapped between truth and popular opinion, highlighting their lack of integrity in spiritual matters."
    },
    {
      "pk": 2102127,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 27,
      "text": "So they answered Jesus, 'We do not know.' He replied, 'Neither will I tell you by what authority I do these things.'",
      "links": "",
      "comment": "Jesus withholds the answer, demonstrating that revelation comes to those with humble and open hearts."
    },
    {
      "pk": 2102128,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 28,
      "text": "'What do you think? A man had two sons. He went to the first and said, \"Son, go and work in the vineyard today.\"'",
      "links": "<a href='/AIV/23/5/1-7'>Isa. 5:1–7</a>",
      "comment": "The vineyard images recall Isaiah 5, representing God's people. The parable reveals the value of repentance and obedience."
    },
    {
      "pk": 2102129,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 29,
      "text": "'And he answered, \"I will not,\" but afterwards he changed his mind and went.'",
      "links": "",
      "comment": "A key theme is conversion—changing not only actions but hearts, reflecting authentic repentance."
    },
    {
      "pk": 2102130,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 30,
      "text": "'And he went to the second son and said the same. He answered, \"I go, sir,\" but did not go.'",
      "links": "",
      "comment": "The second son represents outward religiosity without true obedience, an indictment against empty profession."
    },
    {
      "pk": 2102131,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 31,
      "text": "'Which of the two did the will of his father?' They said, 'The first.' Jesus said to them, 'Truly, I say to you, tax collectors and prostitutes are going ahead of you into the kingdom of God.'",
      "links": "<a href='/AIV/40/5/20'>Matt. 5:20</a>; <a href='/AIV/42/7/29-30'>Luke 7:29-30</a>",
      "comment": "Jesus elevates genuine repentance over social status, while implying the transformative power of grace working within the sinner."
    },
    {
      "pk": 2102132,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 32,
      "text": "'For John came to you in the way of righteousness, and you did not believe him; but tax collectors and prostitutes believed him. Even when you saw it, you did not afterward change your minds and believe him.'",
      "links": "<a href='/AIV/40/11/18'>Matt. 11:18</a>",
      "comment": "True righteousness is followed by belief and conversion, not mere external ritual. The openness of sinners to grace is exalted."
    },
    {
      "pk": 2102133,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 33,
      "text": "'Listen to another parable. There was a landowner who planted a vineyard, put a fence around it, dug a winepress in it, and built a tower. Then he leased it to tenants and went away.'",
      "links": "<a href='/AIV/23/5/1-2'>Isa. 5:1–2</a>",
      "comment": "The vineyard motif again evokes Isaiah 5, with God as owner and Israel as the vineyard. The details point to divine care and preparation for his people."
    },
    {
      "pk": 2102134,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 34,
      "text": "'When the season for fruit drew near, he sent his servants to the tenants to collect his fruit.'",
      "links": "",
      "comment": "The servants represent the prophets; the owner’s expectation clarifies the need for spiritual fruitfulness."
    },
    {
      "pk": 2102135,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 35,
      "text": "'But the tenants seized his servants; they beat one, killed another, and stoned another.'",
      "links": "<a href='/AIV/16/9/26'>Neh. 9:26</a>; <a href='/AIV/40/23/37'>Matt. 23:37</a>",
      "comment": "The mistreatment of servants recalls Old Testament rejection of the prophets, and sets the pattern for Christ’s own death."
    },
    {
      "pk": 2102136,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 36,
      "text": "'Again he sent other servants, more than the first, and they did the same to them.'",
      "links": "",
      "comment": "Persistent sending highlights God’s patient mercy and relentless pursuit of his people before judgment ultimately comes."
    },
    {
      "pk": 2102137,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 37,
      "text": "'Finally, he sent his son to them, saying, “They will respect my son.”'",
      "links": "<a href='/AIV/40/3/17'>Matt. 3:17</a>; <a href='/AIV/27/7/13'>Dan. 7:13</a>",
      "comment": "The son is uniquely identified as the heir, foreshadowing Jesus as the beloved Son. This claim to sonship is directly tied to Christ's divinity and the Incarnation."
    },
    {
      "pk": 2102138,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 38,
      "text": "'But when the tenants saw the son, they said to themselves, \"This is the heir. Come, let us kill him and take his inheritance.\"'",
      "links": "",
      "comment": "The conspiracy mirrors the plot against Jesus, showing foreknowledge of his sacrificial death and its salvific effect."
    },
    {
      "pk": 2102139,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 39,
      "text": "'So they seized him, threw him out of the vineyard, and killed him.'",
      "links": "<a href='/AIV/58/13/12'>Heb. 13:12</a>",
      "comment": "Jesus is cast out and killed outside Jerusalem—Hebrews 13:12 confirms he suffered 'outside the gate,' fulfilling prophecy in the sacrificial system."
    },
    {
      "pk": 2102140,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 40,
      "text": "'Therefore, when the owner of the vineyard comes, what will he do to those tenants?'",
      "links": "",
      "comment": "Jesus asks for judgment. This sets the stage for the transfer of spiritual authority and leadership to new stewards."
    },
    {
      "pk": 2102141,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 41,
      "text": "They said to him, 'He will destroy those evil men and lease the vineyard to others who will give him the fruits in their season.'",
      "links": "<a href='/AIV/45/11/17-21'>Rom. 11:17-21</a>",
      "comment": "Transition to new stewards hints at the growth of the one universal and apostolic church, fulfilling God's covenant purposes."
    },
    {
      "pk": 2102142,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 42,
      "text": "Jesus said to them, 'Have you never read in the Scriptures: \"The stone that the builders rejected has become the cornerstone; this was the Lord’s doing, and it is marvelous in our eyes\"?'",
      "links": "<a href='/AIV/19/118/22-23'>Ps. 118:22-23</a>; <a href='/AIV/44/4/11'>Acts 4:11</a>",
      "comment": "Jesus applies Psalm 118:22–23 to himself, indicating his essential role as the foundation of faith, despite rejection."
    },
    {
      "pk": 2102143,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 43,
      "text": "'Therefore I tell you, the kingdom of God will be taken away from you and given to a people producing its fruits.'",
      "links": "<a href='/AIV/45/11/19-20'>Rom. 11:19-20</a>",
      "comment": "Emphasizes a new people of God rooted in obedience and bearing spiritual fruit, with one faith serving as foundation."
    },
    {
      "pk": 2102144,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 44,
      "text": "'And the one who falls on this stone will be broken to pieces; and when it falls on anyone, it will crush him.'",
      "links": "<a href='/AIV/23/8/14-15'>Isa. 8:14–15</a>; <a href='/AIV/27/2/34-35'>Dan. 2:34-35</a>",
      "comment": "Jesus as the stone is both a foundation and a stumbling stone, recalling Old Testament prophecies of judgment and grace."
    },
    {
      "pk": 2102145,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 45,
      "text": "When the chief priests and the Pharisees heard his parables, they perceived that he was speaking about them.",
      "links": "",
      "comment": "Recognition of the message leads to increased opposition, a pattern of revelation followed by resistance."
    },
    {
      "pk": 2102146,
      "translation": "AIV",
      "book": 40,
      "chapter": 21,
      "verse": 46,
      "text": "Although they wanted to arrest him, they feared the crowds, because they regarded him as a prophet.",
      "links": "<a href='/AIV/40/21/11'>Matt. 21:11</a>",
      "comment": "A closing note of tension, as popular recognition shields Jesus temporarily. His prophetic reputation is affirmed, but his divinity and kingship will soon be demonstrated in full through his Passion and Resurrection."
    }
  ],
  "translatedAt": "2025-12-23T02:16:16.451Z"
}