{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 18,
  "verses": [
    {
      "pk": 1818001,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 1,
      "text": "At that time the disciples came to Jesus and asked, \"Who is the greatest in the kingdom of heaven?\"",
      "links": "<a href='/AIV/41/9/33'>Mark 9:33-37</a>; <a href='/AIV/42/9/46'>Luke 9:46-48</a>",
      "comment": "The disciples’ question reflects their expectation of a hierarchical order in God’s kingdom. Their focus is still on positions and status."
    },
    {
      "pk": 1818002,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 2,
      "text": "He called a little child and put him in the midst of them,",
      "links": "<a href='/AIV/19/131/2'>Psalm 131:2</a>",
      "comment": "Jesus uses a child as a living illustration, challenging cultural ideas about greatness, which valued age and authority over humility and dependence."
    },
    {
      "pk": 1818003,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 3,
      "text": "\"Truly, I say to you, unless you turn and become like children, you will never enter the kingdom of heaven.",
      "links": "<a href='/AIV/43/3/3'>John 3:3</a>",
      "comment": "Entrance into the kingdom depends on a radical change—turning away from pride and becoming humble, trusting, and receptive, as a child."
    },
    {
      "pk": 1818004,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 4,
      "text": "Whoever humbles himself like this child is the greatest in the kingdom of heaven.",
      "links": "<a href='/AIV/23/57/15'>Isaiah 57:15</a>; <a href='/AIV/59/4/6'>James 4:6</a>",
      "comment": "Greatness in God’s eyes is measured by humility and lowliness, not by rank. See also the theme of humility in <a href='/AIV/50/2/5-8'>Phil. 2:5-8</a>."
    },
    {
      "pk": 1818005,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 5,
      "text": "And whoever receives one such child in my name receives me.",
      "links": "<a href='/AIV/40/10/40'>Matt. 10:40</a>; <a href='/AIV/42/9/48'>Luke 9:48</a>",
      "comment": "To receive the least is to receive Christ Himself—a pointer to the mystical union between Christ and His followers."
    },
    {
      "pk": 1818006,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 6,
      "text": "But whoever causes one of these little ones who believe in me to stumble, it would be better for him to have a great millstone hung around his neck and to be drowned in the depths of the sea.",
      "links": "<a href='/AIV/41/9/42'>Mark 9:42</a>; <a href='/AIV/17/7/9'>Esther 7:9-10</a>",
      "comment": "\"Little ones\" here refers both to children and to humble believers. The consequences for leading others astray are severe, underscoring the seriousness of scandal."
    },
    {
      "pk": 1818007,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 7,
      "text": "Woe to the world for temptations to sin! For temptations must come, but woe to the one by whom temptation comes!",
      "links": "<a href='/AIV/42/17/1'>Luke 17:1</a>",
      "comment": "This acknowledges human weakness and the fallen state of the world, yet individual culpability remains for causing others to sin."
    },
    {
      "pk": 1818008,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 8,
      "text": "If your hand or your foot causes you to sin, cut it off and throw it away. It is better for you to enter life crippled or lame than with two hands or two feet to be thrown into the everlasting fire.",
      "links": "<a href='/AIV/40/5/29-30'>Matt. 5:29-30</a>; <a href='/AIV/41/9/43-45'>Mark 9:43-45</a>",
      "comment": "Hyperbolic language stressing the urgency and radical nature of avoiding sin, even at great personal cost. Everlasting fire points to the reality of final judgment."
    },
    {
      "pk": 1818009,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 9,
      "text": "And if your eye causes you to sin, pluck it out and throw it away. It is better for you to enter life with one eye than with two eyes to be thrown into the fire of Gehenna.",
      "links": "<a href='/AIV/40/5/29'>Matt. 5:29</a>; <a href='/AIV/24/7/31'>Jer. 7:31</a>",
      "comment": "Gehenna was a valley outside Jerusalem associated with destruction and judgment. The teaching highlights the destructiveness of sin and the value of eternal life."
    },
    {
      "pk": 1818010,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 10,
      "text": "See that you do not despise one of these little ones. For I tell you that their angels in heaven always see the face of my Father who is in heaven.",
      "links": "<a href='/AIV/19/34/7'>Psalm 34:7</a>; <a href='/AIV/42/1/10'>Luke 1:10</a>",
      "comment": "This is a reference to angelic guardianship and the dignity of each believer. The implication is that divine care and mediation occurs for each soul, supporting the idea of spiritual protection."
    },
    {
      "pk": 1818011,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 11,
      "text": "[For the Son of Man came to save the lost.]",
      "links": "<a href='/AIV/42/19/10'>Luke 19:10</a>",
      "comment": "This verse is not included in many early manuscripts of Matthew but appears in Luke 19:10, summarizing Christ’s mission of salvation for the lost."
    },
    {
      "pk": 1818012,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 12,
      "text": "What do you think? If a man has a hundred sheep, and one of them goes astray, does he not leave the ninety-nine on the hills and go in search of the one that went astray?",
      "links": "<a href='/AIV/42/15/4-7'>Luke 15:4-7</a>; <a href='/AIV/26/34/11-12'>Ezekiel 34:11-12</a>",
      "comment": "God’s concern for each soul is personal and pastoral. The shepherd imagery recalls God’s role in seeking the lost (see Ezekiel 34)."
    },
    {
      "pk": 1818013,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 13,
      "text": "And if he finds it, truly I say to you, he rejoices over it more than over the ninety-nine that did not go astray.",
      "links": "<a href='/AIV/42/15/5-7'>Luke 15:5-7</a>",
      "comment": "The shepherd’s joy illustrates God’s delight over each sinner who repents—a central theme in Christ’s message of mercy and reconciliation."
    },
    {
      "pk": 1818014,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 14,
      "text": "So it is not the will of your Father in heaven that even one of these little ones should perish.",
      "links": "<a href='/AIV/61/3/9'>2 Peter 3:9</a>",
      "comment": "God’s will is for salvation, not destruction, for all who belong to Him."
    },
    {
      "pk": 1818015,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 15,
      "text": "If your brother sins against you, go and show him his fault, just between you and him alone. If he listens to you, you have gained your brother.",
      "links": "<a href='/AIV/3/19/17'>Leviticus 19:17</a>; <a href='/AIV/48/6/1'>Galatians 6:1</a>",
      "comment": "The process of correction is private and aims at restoration rather than punishment, reflecting the principle of fraternal correction."
    },
    {
      "pk": 1818016,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 16,
      "text": "But if he will not listen, take one or two others with you, so that every matter may be established by the testimony of two or three witnesses.",
      "links": "<a href='/AIV/5/19/15'>Deut. 19:15</a>",
      "comment": "The appeal to the testimonies of two or three witnesses is rooted in Mosaic law, ensuring truth and fairness in all accusations."
    },
    {
      "pk": 1818017,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 17,
      "text": "If he refuses to listen to them, tell it to the assembly. And if he refuses to listen even to the assembly, let him be to you as a Gentile and a tax collector.",
      "links": "<a href='/AIV/46/5/4-5'>1 Cor. 5:4-5</a>",
      "comment": "\"Assembly\" translates the Greek 'ekklesia,' or 'church,' referring to the community of believers. Final exclusion underscores the importance of communal authority and discipline."
    },
    {
      "pk": 1818018,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 18,
      "text": "Truly, I say to you, whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven.",
      "links": "<a href='/AIV/40/16/19'>Matt. 16:19</a>; <a href='/AIV/43/20/23'>John 20:23</a>",
      "comment": "This remarkable authority to 'bind and loose' echoes Jesus’ earlier words to Peter. The power to forgive sins and exercise spiritual discipline is entrusted to the community’s leaders, prefiguring the ongoing, visible authority given for unity and governance."
    },
    {
      "pk": 1818019,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 19,
      "text": "Again, truly I say to you, if two of you agree on earth about anything they ask, it will be done for them by my Father in heaven.",
      "links": "<a href='/AIV/43/14/13'>John 14:13</a>; <a href='/AIV/59/5/16'>James 5:16</a>",
      "comment": "Unity in prayer brings divine action. The promise presumes harmonious, faithful requests within the will of God, often facilitated in communal worship."
    },
    {
      "pk": 1818020,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 20,
      "text": "For where two or three are gathered in my name, there am I among them.\"",
      "links": "<a href='/AIV/2/25/8'>Exodus 25:8</a>",
      "comment": "Jesus promises His real presence in the midst of the gathered assembly—a significant statement of divinity since only God can be omnipresent and dwell among His people (see Exodus 25:8)."
    },
    {
      "pk": 1818021,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 21,
      "text": "Then Peter came up and said to Him, \"Lord, how many times shall my brother sin against me, and I forgive him? Up to seven times?\"",
      "links": "<a href='/AIV/42/17/4'>Luke 17:4</a>",
      "comment": "Peter considers seven—a generous number—as sufficient for unlimited forgiveness, showing the difference between human and divine mercy."
    },
    {
      "pk": 1818022,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 22,
      "text": "Jesus said to him, \"I do not say to you up to seven times, but up to seventy-seven times.\"",
      "links": "<a href='/AIV/1/4/24'>Genesis 4:24</a>",
      "comment": "Echoes Genesis 4:24, where unlimited vengeance is replaced by unlimited forgiveness—the standard for God’s family. True forgiveness knows no limit."
    },
    {
      "pk": 1818023,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 23,
      "text": "\"Therefore the kingdom of heaven may be compared to a king who wished to settle accounts with his servants.",
      "links": "<a href='/AIV/42/7/41-42'>Luke 7:41-42</a>",
      "comment": "Jesus often explains God’s kingdom through parables, making heavenly realities graspable through earthly stories."
    },
    {
      "pk": 1818024,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 24,
      "text": "When he began to settle, one was brought to him who owed ten thousand talents.",
      "links": "<a href='/AIV/13/29/7'>1 Chron. 29:7</a>",
      "comment": "Ten thousand talents was an unimaginably large sum—symbolic of an unpayable debt, setting up the need for mercy."
    },
    {
      "pk": 1818025,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 25,
      "text": "But since he could not pay, his master ordered him to be sold, along with his wife, children, and all that he had, and payment to be made.",
      "links": "<a href='/AIV/3/25/39'>Leviticus 25:39</a>",
      "comment": "Ancient legal custom allowed debt slavery. The harsh sentence underscores the severity of the servant’s situation."
    },
    {
      "pk": 1818026,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 26,
      "text": "So the servant fell on his knees, begging him, 'Have patience with me, and I will pay you everything.'",
      "links": "<a href='/AIV/42/18/13'>Luke 18:13</a>",
      "comment": "The servant’s plea is humble and desperate. Kneeling is a posture of submission and repentance."
    },
    {
      "pk": 1818027,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 27,
      "text": "The master of that servant had compassion, released him, and forgave him the debt.",
      "links": "<a href='/AIV/19/103/13'>Psalm 103:13</a>; <a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "Mercy is offered not on account of repayment, but out of compassion—an image of God's boundless forgiveness for those who repent."
    },
    {
      "pk": 1818028,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 28,
      "text": "But that same servant went out and found one of his fellow servants who owed him a hundred denarii; he grabbed him and began to choke him, saying, 'Pay what you owe!'",
      "links": "<a href='/AIV/45/13/8'>Romans 13:8</a>",
      "comment": "A hundred denarii is a small debt compared to what was just forgiven; the contrast is meant to provoke moral reflection."
    },
    {
      "pk": 1818029,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 29,
      "text": "So his fellow servant fell down and pleaded with him, 'Have patience with me, and I will pay you.'",
      "links": "<a href='/AIV/40/18/26'>Matt. 18:26</a>",
      "comment": "The plea precisely echoes the words of the first debtor, heightening the sense of irony and injustice."
    },
    {
      "pk": 1818030,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 30,
      "text": "But he refused and went and had him thrown into prison until he should pay the debt.",
      "links": "<a href='/AIV/40/5/25'>Matt. 5:25</a>",
      "comment": "The servant’s lack of mercy creates a contrast with the generous master and becomes an implicit warning to believers."
    },
    {
      "pk": 1818031,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 31,
      "text": "When his fellow servants saw what had happened, they were greatly distressed, and they went and told their master everything that had taken place.",
      "links": "<a href='/AIV/19/119/136'>Psalm 119:136</a>",
      "comment": "Witnesses to injustice have a role in upholding moral standards, reflecting the communal responsibility for holiness."
    },
    {
      "pk": 1818032,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 32,
      "text": "Then his master called him in and said, 'You wicked servant! I forgave you all that debt because you pleaded with me.",
      "links": "<a href='/AIV/40/6/12'>Matt. 6:12</a>",
      "comment": "The master’s rebuke draws attention back to the grace already received, echoing the Lord’s Prayer: 'Forgive us our debts as we forgive our debtors.'"
    },
    {
      "pk": 1818033,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 33,
      "text": "'Should you not also have had mercy on your fellow servant, just as I had mercy on you?'",
      "links": "<a href='/AIV/42/6/36'>Luke 6:36</a>",
      "comment": "God expects believers to extend the mercy they themselves have received to others—a central law of Christian life."
    },
    {
      "pk": 1818034,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 34,
      "text": "And in his anger, his master delivered him to the jailers, until he should pay all his debt.",
      "links": "<a href='/AIV/40/5/26'>Matt. 5:26</a>; <a href='/AIV/19/7/11'>Psalm 7:11</a>",
      "comment": "The consequence of unforgiveness is separation and punishment, presenting an implicit warning about refusing to extend mercy—also interpreted spiritually as purification or purification after judgment."
    },
    {
      "pk": 1818035,
      "translation": "AIV",
      "book": 40,
      "chapter": 18,
      "verse": 35,
      "text": "So also my heavenly Father will do to every one of you, unless you forgive your brother from your heart.\"",
      "links": "<a href='/AIV/40/6/14-15'>Matt. 6:14-15</a>; <a href='/AIV/59/2/13'>James 2:13</a>",
      "comment": "Forgiveness must be deep and authentic. Mercy is conditional on extending it to others, echoing key teachings in the Sermon on the Mount and affirming communal as well as personal responsibility for reconciliation."
    }
  ],
  "translatedAt": "2025-12-23T02:14:45.982Z"
}