{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 13,
  "verses": [
    {
      "pk": 40013001,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 1,
      "text": "That same day Jesus went out of the house and sat beside the sea.",
      "links": "<a href='/AIV/41/4/1'>Mark 4:1</a>; <a href='/AIV/42/8/4'>Luke 8:4</a>",
      "comment": "Setting shifts to the Sea of Galilee. Matthew groups parables by theme, which sometimes changes chronology."
    },
    {
      "pk": 40013002,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 2,
      "text": "And great crowds gathered around Him, so that He got into a boat and sat down, while the whole crowd stood on the shore.",
      "links": "<a href='/AIV/41/4/1'>Mark 4:1</a>",
      "comment": "Rabbis sat to teach. Jesus’ posture shows His authority. The boat acts as a natural amphitheater."
    },
    {
      "pk": 40013003,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 3,
      "text": "And He spoke many things to them in parables, saying, 'Behold, a sower went out to sow.'",
      "links": "<a href='/AIV/41/4/2'>Mark 4:2-9</a>; <a href='/AIV/42/8/5'>Luke 8:5-8</a>",
      "comment": "Parables are earthly stories with heavenly meanings. Jesus uses them to reveal and conceal truth."
    },
    {
      "pk": 40013004,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 4,
      "text": "As he sowed, some seeds fell along the path, and the birds came and devoured them.",
      "links": "<a href='/AIV/41/4/4'>Mark 4:4</a>",
      "comment": "The 'path' symbolizes hardened hearts where the word does not penetrate."
    },
    {
      "pk": 40013005,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 5,
      "text": "Other seeds fell on rocky ground, where they did not have much soil, and immediately they sprang up, since they had no depth of earth.",
      "links": "<a href='/AIV/41/4/5'>Mark 4:5</a>",
      "comment": "Rocky ground describes those who quickly embrace the word but have no deep roots."
    },
    {
      "pk": 40013006,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 6,
      "text": "But when the sun rose, they were scorched. And because they had no root, they withered away.",
      "links": "<a href='/AIV/41/4/6'>Mark 4:6</a>",
      "comment": "Sun here can be interpreted as trials and difficulties revealing the true nature of faith."
    },
    {
      "pk": 40013007,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 7,
      "text": "Other seeds fell among thorns, and the thorns grew up and choked them.",
      "links": "<a href='/AIV/41/4/7'>Mark 4:7</a>",
      "comment": "Thorns are symbolic of worldly cares and desires choking spiritual growth."
    },
    {
      "pk": 40013008,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 8,
      "text": "Other seeds fell on good soil and produced grain, some a hundredfold, some sixty, some thirty.",
      "links": "<a href='/AIV/41/4/8'>Mark 4:8</a>",
      "comment": "Fruitfulness depends on a receptive heart. Different yields show God’s sovereignty."
    },
    {
      "pk": 40013009,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 9,
      "text": "He who has ears, let him hear.'",
      "links": "<a href='/AIV/66/2/7'>Rev. 2:7</a>",
      "comment": "A call for spiritual attentiveness. Not everyone is open to the mysteries Jesus reveals."
    },
    {
      "pk": 40013010,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 10,
      "text": "Then the disciples came and said to Him, 'Why do You speak to them in parables?'",
      "links": "<a href='/AIV/41/4/10'>Mark 4:10</a>; <a href='/AIV/42/8/9'>Luke 8:9</a>",
      "comment": "The disciples seek understanding, showing the teacher-disciple relationship at the core of apostolic tradition."
    },
    {
      "pk": 40013011,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 11,
      "text": "He answered them, 'To you it has been given to know the secrets of the kingdom of heaven, but to them it has not been given.'",
      "links": "<a href='/AIV/41/4/11'>Mark 4:11</a>; <a href='/AIV/42/8/10'>Luke 8:10</a>",
      "comment": "Jesus grants exclusive knowledge to the disciples, preparing them for future leadership roles."
    },
    {
      "pk": 40013012,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 12,
      "text": "For whoever has, to him shall more be given, and he will have abundance. But whoever does not have, even what he has will be taken away from him.",
      "links": "<a href='/AIV/25/2/6'>Matt. 25:29</a>; <a href='/AIV/42/19/26'>Luke 19:26</a>",
      "comment": "Spiritual growth is dynamic—those open to God receive more; the unreceptive lose what little understanding they have."
    },
    {
      "pk": 40013013,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 13,
      "text": "That is why I speak to them in parables, because seeing they do not see, and hearing they do not hear, nor do they understand.",
      "links": "<a href='/AIV/23/6/9-10'>Isaiah 6:9–10</a>",
      "comment": "Jesus applies Isaiah’s prophecy to Israel, pointing out the spiritual blindness of many."
    },
    {
      "pk": 40013014,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 14,
      "text": "In them the prophecy of Isaiah is fulfilled that says: ‘You will indeed hear but never understand, and you will indeed see but never perceive.’",
      "links": "<a href='/AIV/23/6/9'>Isaiah 6:9</a>",
      "comment": "Jesus directly connects His ministry to fulfilled Old Testament prophecy."
    },
    {
      "pk": 40013015,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 15,
      "text": "For this people’s heart has grown dull, and with their ears they can barely hear, and their eyes they have closed; lest they should see with their eyes, and hear with their ears, and understand with their heart and turn, and I would heal them.",
      "links": "<a href='/AIV/23/6/10'>Isaiah 6:10</a>",
      "comment": "Persistent rejection leads to hardened hearts. Repentance brings healing—a recurring biblical theme."
    },
    {
      "pk": 40013016,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 16,
      "text": "But blessed are your eyes, for they see, and your ears, for they hear.",
      "links": "<a href='/AIV/42/10/23-24'>Luke 10:23-24</a>",
      "comment": "Disciples are privileged to witness the revelation of God’s plan, echoing Old Testament longing."
    },
    {
      "pk": 40013017,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 17,
      "text": "For truly, I say to you, many prophets and righteous people longed to see what you see and did not see it, and to hear what you hear and did not hear it.",
      "links": "<a href='/AIV/1/49/10-11'>Gen 49:10-11</a>; <a href='/AIV/23/29/18'>Isaiah 29:18</a>",
      "comment": "Jesus declares His ministry as the fulfillment of ancient hopes, hinting at His unique authority and identity."
    },
    {
      "pk": 40013018,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 18,
      "text": "Hear then the parable of the sower:",
      "links": "",
      "comment": "Jesus switches from story to interpretation, showing He alone fully explains God’s revelation."
    },
    {
      "pk": 40013019,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 19,
      "text": "When anyone hears the word of the kingdom and does not understand it, the evil one comes and snatches away what was sown in his heart. This is the seed sown along the path.",
      "links": "<a href='/AIV/41/4/15'>Mark 4:15</a>; <a href='/AIV/42/8/12'>Luke 8:12</a>",
      "comment": "The evil one (the devil) opposes the spread of the kingdom. Spiritual warfare is an unseen reality."
    },
    {
      "pk": 40013020,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 20,
      "text": "The seed sown on rocky ground—this is the one who hears the word and immediately receives it with joy,",
      "links": "<a href='/AIV/41/4/16'>Mark 4:16</a>",
      "comment": "Lack of depth leads to short-lived faith, as shown in persecution or hardship."
    },
    {
      "pk": 40013021,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 21,
      "text": "but he has no root in himself, and lasts only a short time. When tribulation or persecution comes because of the word, he immediately falls away.",
      "links": "<a href='/AIV/41/4/17'>Mark 4:17</a>",
      "comment": "Trials test genuine faith. Spiritual roots are deepened by participation in the life of the Church and sacraments."
    },
    {
      "pk": 40013022,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 22,
      "text": "The seed sown among thorns is the one who hears the word, but the cares of this world and the deceitfulness of riches choke the word, and it becomes unfruitful.",
      "links": "<a href='/AIV/41/4/18-19'>Mark 4:18-19</a>; <a href='/AIV/42/8/14'>Luke 8:14</a>",
      "comment": "Material distractions are obstacles to spiritual growth. The call to detachment is rooted in Jesus’ teachings."
    },
    {
      "pk": 40013023,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 23,
      "text": "The seed sown on good soil is the one who hears the word and understands it; he indeed bears fruit and yields, in one case a hundredfold, in another sixty, and in another thirty.",
      "links": "<a href='/AIV/41/4/20'>Mark 4:20</a>",
      "comment": "Fruitfulness results from understanding—implies the necessity of ongoing formation in the faith."
    },
    {
      "pk": 40013024,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 24,
      "text": "He put another parable before them, saying, 'The kingdom of heaven may be compared to a man who sowed good seed in his field,",
      "links": "",
      "comment": "A new parable deals with the mysterious growth of the kingdom. The sower represents Christ."
    },
    {
      "pk": 40013025,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 25,
      "text": "but while his men were sleeping, his enemy came and sowed weeds among the wheat and went away.",
      "links": "",
      "comment": "The enemy is the devil. The reality of evil within the visible community is acknowledged."
    },
    {
      "pk": 40013026,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 26,
      "text": "So when the plants came up and bore grain, then the weeds appeared also.",
      "links": "",
      "comment": "The weeds (darnel) look like wheat but reveal their true nature when mature, illustrating the difference between true and false disciples."
    },
    {
      "pk": 40013027,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 27,
      "text": "The servants of the owner came and said to him, ‘Master, did you not sow good seed in your field? How then does it have weeds?’",
      "links": "",
      "comment": "The presence of evil causes confusion—even among the servants (disciples)."
    },
    {
      "pk": 40013028,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 28,
      "text": "He said to them, ‘An enemy has done this.’ So the servants said to him, ‘Then do you want us to go and gather them?’",
      "links": "",
      "comment": "Premature judgment is discouraged. The full revelation of hearts is left for the end."
    },
    {
      "pk": 40013029,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 29,
      "text": "But he said, ‘No, lest while you gather the weeds you root up the wheat along with them.’",
      "links": "",
      "comment": "Separation must wait until the right time. Mercy and patience are central themes here."
    },
    {
      "pk": 40013030,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 30,
      "text": "‘Let both grow together until the harvest, and at harvest time I will tell the reapers, Gather the weeds first and bind them in bundles to be burned, but gather the wheat into my barn.’”",
      "links": "<a href='/AIV/66/20/12-15'>Rev. 20:12–15</a>",
      "comment": "The final judgment will be a clear separation of the righteous from the wicked. The Church remains mixed until the end."
    },
    {
      "pk": 40013031,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 31,
      "text": "He put another parable before them, saying, ‘The kingdom of heaven is like a grain of mustard seed that a man took and sowed in his field.’",
      "links": "<a href='/AIV/41/4/30-32'>Mark 4:30–32</a>; <a href='/AIV/42/13/18-19'>Luke 13:18-19</a>",
      "comment": "Small beginnings lead to great results; God’s kingdom starts humble."
    },
    {
      "pk": 40013032,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 32,
      "text": "'It is the smallest of all seeds, but when it has grown it is larger than all the garden plants and becomes a tree, so that the birds of the air come and make nests in its branches.'",
      "links": "<a href='/AIV/26/17/23'>Ezekiel 17:23</a>",
      "comment": "Imagery echoes Ezekiel’s prophecy about God’s kingdom. The Church’s universality is foreshadowed in this growth."
    },
    {
      "pk": 40013033,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 33,
      "text": "He told them another parable. 'The kingdom of heaven is like leaven that a woman took and hid in three measures of flour, till it was all leavened.'",
      "links": "<a href='/AIV/42/13/20-21'>Luke 13:20-21</a>",
      "comment": "Leaven works invisibly and transforms completely, like grace in the soul and in the Church."
    },
    {
      "pk": 40013034,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 34,
      "text": "All these things Jesus said to the crowds in parables; indeed, He said nothing to them without a parable.",
      "links": "",
      "comment": "Jesus’ public teaching was often veiled, requiring interpretation by those truly committed to follow Him."
    },
    {
      "pk": 40013035,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 35,
      "text": "This was to fulfill what was spoken by the prophet: 'I will open my mouth in parables; I will utter things hidden since the foundation of the world.'",
      "links": "<a href='/AIV/19/78/2'>Psalm 78:2</a>",
      "comment": "Jesus fulfills a messianic prophecy, revealing long-hidden mysteries."
    },
    {
      "pk": 40013036,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 36,
      "text": "Then He left the crowds and went into the house. And His disciples came to Him, saying, 'Explain to us the parable of the weeds of the field.'",
      "links": "",
      "comment": "Private instruction is for the disciples. The house is a place of intimacy, like the gathering of the faithful for deeper formation."
    },
    {
      "pk": 40013037,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 37,
      "text": "He answered, 'The one who sows the good seed is the Son of Man.'",
      "links": "<a href='/AIV/27/7/13'>Daniel 7:13</a>",
      "comment": "\"Son of Man\" is a messianic title from Daniel, indicating Jesus' divine authority."
    },
    {
      "pk": 40013038,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 38,
      "text": "'The field is the world, and the good seed stands for the sons of the kingdom. The weeds are the sons of the evil one,'",
      "links": "",
      "comment": "Distinction between those who belong to God and to the evil one. There is an objective reality to belonging to the kingdom."
    },
    {
      "pk": 40013039,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 39,
      "text": "'and the enemy who sowed them is the devil. The harvest is the end of the age, and the reapers are angels.'",
      "links": "<a href='/AIV/66/14/15'>Rev. 14:15</a>",
      "comment": "Final judgment and separation is a clear eschatological reality. Angels are involved in the final reckoning."
    },
    {
      "pk": 40013040,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 40,
      "text": "'Just as the weeds are gathered and burned in the fire, so shall it be at the end of the age.'",
      "links": "<a href='/AIV/66/20/15'>Rev. 20:15</a>",
      "comment": "Jesus uses the language of judgment, which affirms the reality of final accountability."
    },
    {
      "pk": 40013041,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 41,
      "text": "'The Son of Man will send out His angels, and they will gather out of His kingdom all things that cause sin and all lawbreakers,'",
      "links": "<a href='/AIV/49/5/5'>Eph. 5:5</a>",
      "comment": "Christ exercises authority (divine claim) over the whole kingdom and purges it of evil. This has implications for the Church’s call to holiness."
    },
    {
      "pk": 40013042,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 42,
      "text": "'and throw them into the fiery furnace. In that place there will be weeping and gnashing of teeth.'",
      "links": "<a href='/AIV/13/32/24'>Deut. 32:24</a>; <a href='/AIV/40/8/12'>Matt. 8:12</a>",
      "comment": "A vivid image of judgment, echoing Old Testament warnings. Jesus affirms the reality of eternal consequences."
    },
    {
      "pk": 40013043,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 43,
      "text": "'Then the righteous will shine like the sun in the kingdom of their Father. He who has ears, let him hear.'",
      "links": "<a href='/AIV/27/12/3'>Daniel 12:3</a>",
      "comment": "Using Daniel’s prophecy, Jesus promises glory for the faithful. The spiritual sense points to sanctification and union with God."
    },
    {
      "pk": 40013044,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 44,
      "text": "'The kingdom of heaven is like treasure hidden in a field, which a man found and covered up. Then in his joy he goes and sells all that he has and buys that field.'",
      "links": "",
      "comment": "The supreme value of the kingdom is worth any sacrifice—personal holiness and commitment."
    },
    {
      "pk": 40013045,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 45,
      "text": "'Again, the kingdom of heaven is like a merchant in search of fine pearls,'",
      "links": "",
      "comment": "Seeking the kingdom is an active pursuit, not merely passive acceptance."
    },
    {
      "pk": 40013046,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 46,
      "text": "'who, on finding one pearl of great value, went and sold all that he had and bought it.'",
      "links": "",
      "comment": "Intense devotion in the search for truth echoes the Church’s witness through the ages."
    },
    {
      "pk": 40013047,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 47,
      "text": "'Again, the kingdom of heaven is like a net that was thrown into the sea and gathered fish of every kind.'",
      "links": "<a href='/AIV/26/47/10'>Ezekiel 47:10</a>",
      "comment": "Inclusivity of the kingdom in the present age. The net is a common image for the apostolic mission."
    },
    {
      "pk": 40013048,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 48,
      "text": "'When it was full, men drew it ashore and sat down and sorted the good into containers but threw away the bad.'",
      "links": "",
      "comment": "Final separation at the end of time—only the truly faithful remain."
    },
    {
      "pk": 40013049,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 49,
      "text": "'So it will be at the end of the age. The angels will come out and separate the evil from the righteous,'",
      "links": "",
      "comment": "This directly teaches about the final judgment and the necessity of persevering in righteousness."
    },
    {
      "pk": 40013050,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 50,
      "text": "'and throw them into the fiery furnace. In that place there will be weeping and gnashing of teeth.'",
      "links": "<a href='/AIV/13/32/24'>Deut. 32:24</a>",
      "comment": "Repetition of the judgment theme stresses its seriousness. Traditional doctrine affirms a final separation."
    },
    {
      "pk": 40013051,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 51,
      "text": "Jesus said to them, 'Have you understood all these things?' They said to Him, 'Yes.'",
      "links": "",
      "comment": "Understanding (both literal and spiritual) is essential for those entrusted with teaching authority."
    },
    {
      "pk": 40013052,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 52,
      "text": "And He said to them, 'Therefore every scribe who has been trained for the kingdom of heaven is like a master of a house, who brings out of his treasure what is new and what is old.'",
      "links": "",
      "comment": "Jesus refers to those who are later to teach with authority, drawing on both the Old and New. Apostolic succession is quietly reinforced."
    },
    {
      "pk": 40013053,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 53,
      "text": "And when Jesus had finished these parables, He departed from there.",
      "links": "",
      "comment": "A transition; these teaching sections often end with Jesus moving to a new location."
    },
    {
      "pk": 40013054,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 54,
      "text": "And coming to His hometown, He taught them in their synagogue, so that they were astonished and said, 'Where did this man get this wisdom and these mighty works?'",
      "links": "<a href='/AIV/41/6/1-2'>Mark 6:1-2</a>; <a href='/AIV/42/4/16'>Luke 4:16</a>",
      "comment": "Jesus’ wisdom and miracles show His divine authority, referenced by the astonished listeners."
    },
    {
      "pk": 40013055,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 55,
      "text": "Isn’t this the carpenter’s son? Isn’t His mother called Mary? And aren’t His brothers James, Joseph, Simon, and Judas?",
      "links": "<a href='/AIV/41/6/3'>Mark 6:3</a>",
      "comment": "‘Brothers’ here refers to close relatives, not direct siblings—a meaning rooted in Semitic usage (<a href='/AIV/1/13/8'>Gen 13:8</a>). Jesus’ humble origins are noted."
    },
    {
      "pk": 40013056,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 56,
      "text": "And aren’t all His sisters with us? Where then did this man get all these things?'",
      "links": "",
      "comment": "Locals’ familiarity breeds contempt, but also highlights the true mystery of Jesus’ identity."
    },
    {
      "pk": 40013057,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 57,
      "text": "And they took offense at Him. But Jesus said to them, 'A prophet is not without honor except in his hometown and in his own house.'",
      "links": "<a href='/AIV/41/6/4'>Mark 6:4</a>; <a href='/AIV/43/4/44'>John 4:44</a>",
      "comment": "Jesus identifies Himself as a prophet—beyond an ordinary teacher. This clues readers to His special role in salvation history."
    },
    {
      "pk": 40013058,
      "translation": "AIV",
      "book": 1,
      "chapter": 13,
      "verse": 58,
      "text": "And He did not do many mighty works there because of their unbelief.",
      "links": "<a href='/AIV/41/6/5-6'>Mark 6:5-6</a>",
      "comment": "Lack of faith constrains the blessings people can receive. Openness to God’s grace is required to experience His power."
    }
  ],
  "translatedAt": "2025-12-23T02:12:02.549Z"
}