{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 9,
  "verses": [
    {
      "pk": 900901,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 1,
      "text": "And getting into a boat, Jesus crossed over and came to His own city.",
      "links": "<a href='/AIV/41/2/1'>Mark 2:1</a>; <a href='/AIV/42/5/17'>Luke 5:17</a>",
      "comment": "Jesus returns to Capernaum, demonstrating His commitment to ministering locally, where His miracles are widely witnessed."
    },
    {
      "pk": 900902,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 2,
      "text": "And behold, some people brought to Him a paralyzed man lying on a mat. Seeing their faith, Jesus said to the paralytic, 'Take heart, son; your sins are forgiven.'",
      "links": "<a href='/AIV/41/2/3'>Mark 2:3-5</a>; <a href='/AIV/42/5/18'>Luke 5:18-20</a>",
      "comment": "Note the connection between faith and forgiveness. Here, Jesus exercises divine authority by forgiving sins—an action reserved for God alone (see <a href='/AIV/19/103/3'>Psalm 103:3</a>)."
    },
    {
      "pk": 900903,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 3,
      "text": "And behold, some of the scribes said to themselves, 'This man blasphemes.'",
      "links": "<a href='/AIV/41/2/7'>Mark 2:7</a>; <a href='/AIV/42/5/21'>Luke 5:21</a>",
      "comment": "The scribes recognize Jesus' claim to divine authority, since only God can forgive sins."
    },
    {
      "pk": 900904,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 4,
      "text": "But Jesus, knowing their thoughts, said, 'Why do you think evil in your hearts?'",
      "links": "<a href='/AIV/19/139/2'>Psalm 139:2</a>",
      "comment": "Again, Jesus demonstrates divine omniscience by knowing their hearts and thoughts, fulfilling Old Testament descriptions of God."
    },
    {
      "pk": 900905,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 5,
      "text": "'Which is easier, to say, ‘Your sins are forgiven,’ or to say, ‘Get up and walk’?'",
      "links": "",
      "comment": "Jesus challenges the logic of those doubting His authority, setting up His miraculous act as proof."
    },
    {
      "pk": 900906,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 6,
      "text": "But so that you may know that the Son of Man has authority on earth to forgive sins—He then said to the paralytic—'Get up, pick up your mat, and go home.'",
      "links": "<a href='/AIV/27/7/13'>Daniel 7:13-14</a>; <a href='/AIV/41/2/10'>Mark 2:10-11</a>",
      "comment": "By calling Himself 'Son of Man,' Jesus references Daniel—a prophecy about the Messiah. His authority to forgive sins is a declaration of his divinity."
    },
    {
      "pk": 900907,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 7,
      "text": "And he got up and went to his home.",
      "links": "",
      "comment": "The healing validates Jesus' spiritual authority."
    },
    {
      "pk": 900908,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 8,
      "text": "When the crowds saw this, they were afraid and glorified God, who had given such authority to men.",
      "links": "<a href='/AIV/19/72/18'>Ps. 72:18</a>",
      "comment": "The crowd acknowledges that this level of authority is from God, marking an important recognition of divine intervention through the ministry of Jesus."
    },
    {
      "pk": 900909,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 9,
      "text": "As Jesus passed on from there, He saw a man named Matthew sitting at the tax booth, and He said to him, 'Follow Me.' And he rose and followed Him.",
      "links": "<a href='/AIV/41/2/14'>Mark 2:14</a>; <a href='/AIV/42/5/27'>Luke 5:27-28</a>",
      "comment": "The calling of Matthew shows Jesus’ openness to those considered sinners or outcasts, foreshadowing the inclusivity of the Church as a community for all repentant sinners."
    },
    {
      "pk": 900910,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 10,
      "text": "And as He reclined at the table in the house, behold, many tax collectors and sinners came and were reclining with Jesus and His disciples.",
      "links": "<a href='/AIV/41/2/15'>Mark 2:15</a>; <a href='/AIV/42/5/29'>Luke 5:29</a>",
      "comment": "Jesus shares table fellowship, an intimate act symbolizing communion and acceptance into a spiritual family, echoing covenant meals in the Old Testament."
    },
    {
      "pk": 900911,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 11,
      "text": "And when the Pharisees saw this, they said to His disciples, 'Why does your Teacher eat with tax collectors and sinners?'",
      "links": "",
      "comment": "Pharisees question Jesus' association with 'unclean' people, highlighting His mission to sinners."
    },
    {
      "pk": 900912,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 12,
      "text": "But when He heard it, He said, 'Those who are well do not need a physician, but those who are sick.'",
      "links": "<a href='/AIV/41/2/17'>Mark 2:17</a>; <a href='/AIV/42/5/31'>Luke 5:31</a>",
      "comment": "Jesus likens Himself to a physician, coming to restore those who are spiritually unwell."
    },
    {
      "pk": 900913,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 13,
      "text": "'Go and learn what this means: “I desire mercy, and not sacrifice.” For I came not to call the righteous, but sinners.'",
      "links": "<a href='/AIV/28/6/6'>Hosea 6:6</a>",
      "comment": "Jesus quotes Hosea, emphasizing interior conversion over mere ritual, a recurring theme later in the epistles and Church teaching."
    },
    {
      "pk": 900914,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 14,
      "text": "Then the disciples of John came to Him, saying, 'Why do we and the Pharisees fast, but Your disciples do not fast?'",
      "links": "<a href='/AIV/41/2/18'>Mark 2:18</a>; <a href='/AIV/42/5/33'>Luke 5:33</a>",
      "comment": "Fasting was seen as a sign of devotion. Questioning why Jesus' disciples didn’t fast like other religious groups."
    },
    {
      "pk": 900915,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 15,
      "text": "And Jesus said to them, 'Can the wedding guests mourn as long as the bridegroom is with them? But the days will come when the bridegroom is taken away from them, and then they will fast.'",
      "links": "<a href='/AIV/43/3/29'>John 3:29</a>",
      "comment": "Jesus identifies Himself as the bridegroom, signifying the intimate, covenantal relationship with His followers and foreshadowing His sacrificial death. The imagery points to the Church as the bride."
    },
    {
      "pk": 900916,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 16,
      "text": "'No one puts a piece of unshrunk cloth on an old garment, for the patch tears away from the garment, and a worse tear is made.'",
      "links": "",
      "comment": "Jesus illustrates the incompatibility between the old covenant practices and the new spiritual reality He brings."
    },
    {
      "pk": 900917,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 17,
      "text": "'Neither do people put new wine into old wineskins. If they do, the skins burst and the wine is spilled, and the skins are destroyed. But they put new wine into fresh wineskins, and both are preserved.'",
      "links": "",
      "comment": "Jesus' new teachings and grace cannot be contained by old structures; points to the necessity for renewal, echoed in the sacramental life of the Church."
    },
    {
      "pk": 900918,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 18,
      "text": "While He was saying these things, behold, a ruler came and knelt before Him, saying, 'My daughter has just died. But come and lay Your hand on her, and she will live.'",
      "links": "<a href='/AIV/41/5/22'>Mark 5:22</a>; <a href='/AIV/42/8/41'>Luke 8:41</a>",
      "comment": "This ruler's profound faith reflects belief in Jesus' divine authority over life and death."
    },
    {
      "pk": 900919,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 19,
      "text": "And Jesus rose and followed him, and so did His disciples.",
      "links": "",
      "comment": "The disciples’ obedience signifies the responsibility to follow Christ in ministering to others."
    },
    {
      "pk": 900920,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 20,
      "text": "And behold, a woman who had suffered a discharge of blood for twelve years came up behind Him and touched the fringe of His cloak.",
      "links": "<a href='/AIV/41/5/25'>Mark 5:25</a>; <a href='/AIV/42/8/43'>Luke 8:43</a>; <a href='/AIV/03/15/25'>Leviticus 15:25</a>",
      "comment": "The woman’s illness marked her as ritually unclean, excluded from worship—her approaching Jesus demonstrates faith in His power to heal and restore."
    },
    {
      "pk": 900921,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 21,
      "text": "For she said to herself, 'If I only touch His cloak, I will be healed.'",
      "links": "",
      "comment": "Her faith transcends ritual purity, trusting that even minimal contact with Jesus brings restoration."
    },
    {
      "pk": 900922,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 22,
      "text": "Jesus turned and saw her, and said, 'Daughter, take heart; your faith has made you well.' And immediately the woman was healed.",
      "links": "<a href='/AIV/41/5/34'>Mark 5:34</a>; <a href='/AIV/42/8/48'>Luke 8:48</a>",
      "comment": "Jesus affectionately calls her 'daughter,' welcoming her into a spiritual family. Faith in Christ brings both healing and adoption."
    },
    {
      "pk": 900923,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 23,
      "text": "And when Jesus came to the ruler’s house and saw the flute players and the crowd making a commotion,",
      "links": "",
      "comment": "The presence of mourners testifies to the certainty of the girl's death."
    },
    {
      "pk": 900924,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 24,
      "text": "He said, 'Go away, for the girl is not dead but sleeping.' And they laughed at Him.",
      "links": "",
      "comment": "Jesus uses 'sleep' to indicate that death is not final for those in Him; a concept echoed through resurrection teachings."
    },
    {
      "pk": 900925,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 25,
      "text": "But when the crowd had been put outside, He went in and took her by the hand, and the girl arose.",
      "links": "<a href='/AIV/41/5/41'>Mark 5:41-42</a>; <a href='/AIV/42/8/54'>Luke 8:54-55</a>",
      "comment": "Jesus' touch imparts life—a sign of Christ’s authority over death and foreshadowing the sacraments which convey grace through physical means."
    },
    {
      "pk": 900926,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 26,
      "text": "And news of this spread throughout that entire region.",
      "links": "",
      "comment": "A public acknowledgment of Christ’s divine power, laying the foundation for faith among the people."
    },
    {
      "pk": 900927,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 27,
      "text": "As Jesus passed on from there, two blind men followed Him, crying aloud, 'Have mercy on us, Son of David!'",
      "links": "<a href='/AIV/10/7/12'>2 Samuel 7:12-14</a>; <a href='/AIV/23/35/5'>Isaiah 35:5</a>",
      "comment": "Addressing Jesus as 'Son of David' acknowledges Him as the promised Messiah, linking to prophecies of God's chosen king who would heal."
    },
    {
      "pk": 900928,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 28,
      "text": "When He entered the house, the blind men came to Him, and Jesus said to them, 'Do you believe that I am able to do this?' They said to Him, 'Yes, Lord.'",
      "links": "",
      "comment": "Their faith and their address of Jesus as 'Lord' show submission to His divine power."
    },
    {
      "pk": 900929,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 29,
      "text": "Then He touched their eyes, saying, 'According to your faith, let it be done to you.'",
      "links": "",
      "comment": "The use of touch is significant—physical contact as a means of imparting grace and healing."
    },
    {
      "pk": 900930,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 30,
      "text": "And their eyes were opened. Jesus warned them sternly, 'See that no one knows about this.'",
      "links": "<a href='/AIV/41/1/44'>Mark 1:44</a>",
      "comment": "Jesus often commands secrecy about miracles to avoid premature misunderstanding of His mission."
    },
    {
      "pk": 900931,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 31,
      "text": "But they went out and spread the news about Him throughout that whole region.",
      "links": "",
      "comment": "Human excitement over divine intervention naturally leads to evangelization—a prelude to the coming apostolic mission."
    },
    {
      "pk": 900932,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 32,
      "text": "As they were going out, behold, a demon-oppressed man who could not speak was brought to Him.",
      "links": "",
      "comment": "Physical and spiritual ailments are both subject to Christ’s authority; the Church later continues this ministry through spiritual works."
    },
    {
      "pk": 900933,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 33,
      "text": "And when the demon had been cast out, the mute man spoke. And the crowds marveled, saying, 'Never has anything like this been seen in Israel.'",
      "links": "",
      "comment": "Jesus displays unique power over evil spirits and physical afflictions, surpassing all prior prophets."
    },
    {
      "pk": 900934,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 34,
      "text": "But the Pharisees said, 'He casts out demons by the prince of demons.'",
      "links": "<a href='/AIV/40/12/24'>Matthew 12:24</a>",
      "comment": "Hostility towards Jesus escalates; misattributing His power is a grave misunderstanding of His divine authority."
    },
    {
      "pk": 900935,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 35,
      "text": "And Jesus went throughout all the cities and villages, teaching in their synagogues and proclaiming the good news of the kingdom and healing every disease and every affliction.",
      "links": "<a href='/AIV/40/4/23'>Matthew 4:23</a>; <a href='/AIV/23/53/4'>Isaiah 53:4</a>",
      "comment": "The Gospel message is all-encompassing, addressing body and soul; Jesus sets a precedent for holistic ministry."
    },
    {
      "pk": 900936,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 36,
      "text": "When He saw the crowds, He had compassion on them, because they were harassed and helpless, like sheep without a shepherd.",
      "links": "<a href='/AIV/04/27/17'>Numbers 27:17</a>; <a href='/AIV/26/34/5'>Ezekiel 34:5-6</a>",
      "comment": "Jesus' compassion aligns Him with the shepherds in Israel’s history and foreshadows His ongoing care for His followers, reflected through His appointed leaders."
    },
    {
      "pk": 900937,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 37,
      "text": "Then He said to His disciples, 'The harvest is plentiful, but the laborers are few.'",
      "links": "<a href='/AIV/09/2/4'>1 Samuel 2:4</a>",
      "comment": "The need for more workers anticipates the Church’s missionary activity to all nations."
    },
    {
      "pk": 900938,
      "translation": "AIV",
      "book": 40,
      "chapter": 9,
      "verse": 38,
      "text": "'Therefore pray earnestly to the Lord of the harvest to send out laborers into His harvest.'",
      "links": "<a href='/AIV/42/10/2'>Luke 10:2</a>",
      "comment": "Prayer for vocations is essential. This verse points towards the establishment of an ongoing apostolic ministry with authority conferred from Christ—continuing His mission and care for His people, foundational to the Church’s structure."
    }
  ],
  "translatedAt": "2025-12-23T07:44:43.899Z"
}