{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 4,
  "verses": [
    {
      "pk": 4125001,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 1,
      "text": "Then Jesus was led by the Spirit into the wilderness to be tempted by the devil.",
      "links": "<a href='/AIV/02/34/28'>Ex. 34:28</a>; <a href='/AIV/42/4/1'>Luke 4:1</a>",
      "comment": "Here, Jesus willingly allows Himself to be tempted, reflecting obedience to the divine plan and the example of spiritual trial. The reference to being led by the Spirit signifies divine initiative."
    },
    {
      "pk": 4125002,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 2,
      "text": "And after fasting forty days and forty nights, He was hungry.",
      "links": "<a href='/AIV/02/34/28'>Ex. 34:28</a>; <a href='/AIV/11/19/8'>1 Kings 19:8</a>",
      "comment": "Forty days recalls the periods of Moses and Elijah, symbolizing preparation and testing. Jesus' true humanity is evident in His hunger."
    },
    {
      "pk": 4125003,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 3,
      "text": "And the tempter came and said to Him, \"If you are the Son of God, command these stones to become bread.\"",
      "links": "<a href='/AIV/19/78/19'>Ps. 78:19</a>; <a href='/AIV/42/4/3'>Luke 4:3</a>",
      "comment": "Satan challenges both Jesus' identity and His trust in the Father, echoing Israel's testing in the wilderness."
    },
    {
      "pk": 4125004,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 4,
      "text": "But He answered, \"It is written: 'Man shall not live by bread alone, but by every word that comes from the mouth of God.'\"",
      "links": "<a href='/AIV/05/8/3'>Deut. 8:3</a>",
      "comment": "Jesus quotes scripture, showing that spiritual nourishment is superior to physical. He models submission to God's word."
    },
    {
      "pk": 4125005,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 5,
      "text": "Then the devil took Him to the holy city and set Him on the pinnacle of the temple.",
      "links": "<a href='/AIV/62/2/18'>1 John 2:18</a>; <a href='/AIV/42/4/9'>Luke 4:9</a>",
      "comment": "The holy city (Jerusalem) and temple are significant as places of worship and divine presence."
    },
    {
      "pk": 4125006,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 6,
      "text": "And he said to Him, \"If you are the Son of God, throw yourself down, for it is written: 'He will command His angels concerning you,' and 'On their hands they will lift you up, so that you will not strike your foot against a stone.'\"",
      "links": "<a href='/AIV/19/91/11-12'>Ps. 91:11–12</a>",
      "comment": "Satan misuses scripture here, attempting to twist God's promises. This highlights a need for right interpretation of scripture safeguarded by tradition."
    },
    {
      "pk": 4125007,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 7,
      "text": "Jesus said to him, \"Again, it is written: 'You shall not test the Lord your God.'\"",
      "links": "<a href='/AIV/05/6/16'>Deut. 6:16</a>",
      "comment": "Jesus reinforces the proper use of scripture and acknowledges Himself as the Lord, responding with divine authority."
    },
    {
      "pk": 4125008,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 8,
      "text": "Again, the devil took Him to a very high mountain and showed Him all the kingdoms of the world and their glory.",
      "links": "<a href='/AIV/27/4/17'>Dan. 4:17</a>; <a href='/AIV/42/4/5'>Luke 4:5</a>",
      "comment": "This scene echoes the authority granted to rulers and the temptation for worldly power."
    },
    {
      "pk": 4125009,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 9,
      "text": "And he said to Him, \"All these I will give you, if you will fall down and worship me.\"",
      "links": "<a href='/AIV/05/6/13'>Deut. 6:13</a>",
      "comment": "The devil offers an easier path, tempting Jesus to bypass suffering. True worship is owed only to God."
    },
    {
      "pk": 4125010,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 10,
      "text": "Then Jesus said to him, \"Away with you, Satan! For it is written, 'You shall worship the Lord your God and serve Him only.'\"",
      "links": "<a href='/AIV/05/6/13'>Deut. 6:13</a>",
      "comment": "Jesus decisively rejects idolatry. His command embodies divine authority, and His victory foreshadows the defeat of evil."
    },
    {
      "pk": 4125011,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 11,
      "text": "Then the devil left Him, and behold, angels came and ministered to Him.",
      "links": "<a href='/AIV/19/91/11'>Ps. 91:11</a>; <a href='/AIV/41/1/13'>Mark 1:13</a>",
      "comment": "The angels’ ministry affirms Jesus’ unique role and God’s care. This echoes the heavenly support of righteous men in scripture."
    },
    {
      "pk": 4125012,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 12,
      "text": "Now when He heard that John had been arrested, He withdrew into Galilee.",
      "links": "<a href='/AIV/41/1/14'>Mark 1:14</a>; <a href='/AIV/42/4/14'>Luke 4:14</a>",
      "comment": "This marks a transition. With John’s ministry ending, Jesus begins His public mission."
    },
    {
      "pk": 4125013,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 13,
      "text": "And leaving Nazareth, He went and lived in Capernaum by the sea, in the territory of Zebulun and Naphtali.",
      "links": "<a href='/AIV/23/9/1-2'>Isa. 9:1–2</a>; <a href='/AIV/41/2/1'>Mark 2:1</a>",
      "comment": "Moving to Capernaum fulfills prophecy and sets Jesus at the crossroads of nations, ready to reach both Jews and Gentiles."
    },
    {
      "pk": 4125014,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 14,
      "text": "This happened to fulfill what was spoken through the prophet Isaiah:",
      "links": "<a href='/AIV/23/9/1-2'>Isa. 9:1–2</a>",
      "comment": "Matthew highlights fulfillment of Old Testament prophecy, reinforcing Jesus' messianic identity with precise geographic detail."
    },
    {
      "pk": 4125015,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 15,
      "text": "\"Land of Zebulun and land of Naphtali, way by the sea, beyond the Jordan, Galilee of the Gentiles—",
      "links": "<a href='/AIV/23/9/1'>Isa. 9:1</a>",
      "comment": "This prophetic line anticipates the light of salvation coming to regions marginalized in Israel’s history."
    },
    {
      "pk": 4125016,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 16,
      "text": "the people living in darkness have seen a great light; and for those dwelling in the region and shadow of death, light has dawned.\"",
      "links": "<a href='/AIV/23/9/2'>Isa. 9:2</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "Jesus fulfills and embodies the messianic 'light,' bringing hope and revelation. See also John 8:12, where He calls Himself the 'light of the world.'"
    },
    {
      "pk": 4125017,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 17,
      "text": "From that time Jesus began to preach, saying, \"Repent, for the kingdom of heaven is at hand.\"",
      "links": "<a href='/AIV/40/3/2'>Matt. 3:2</a>; <a href='/AIV/41/1/15'>Mark 1:15</a>",
      "comment": "Jesus' preaching mirrors John’s but centers now on His personal authority. The call to repentance is essential for citizenship in the kingdom He brings—a movement both internal and visible."
    },
    {
      "pk": 4125018,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 18,
      "text": "As He walked beside the Sea of Galilee, He saw two brothers—Simon, called Peter, and Andrew his brother—casting a net into the sea, for they were fishermen.",
      "links": "<a href='/AIV/41/1/16'>Mark 1:16</a>; <a href='/AIV/42/5/2'>Luke 5:2</a>",
      "comment": "Notable as the first calling of Peter, whom Jesus will later set as chief among the apostles (see Matthew 16:18)."
    },
    {
      "pk": 4125019,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 19,
      "text": "And He said to them, \"Follow Me, and I will make you fishers of men.\"",
      "links": "<a href='/AIV/41/1/17'>Mark 1:17</a>; <a href='/AIV/42/5/10'>Luke 5:10</a>",
      "comment": "Jesus calls disciples into a personal relationship and vocation, moving from ordinary livelihood to a spiritual mission."
    },
    {
      "pk": 4125020,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 20,
      "text": "Immediately they left their nets and followed Him.",
      "links": "<a href='/AIV/41/1/18'>Mark 1:18</a>",
      "comment": "The disciples' immediate obedience shows radical commitment, reflecting the surrender needed to follow Christ genuinely."
    },
    {
      "pk": 4125021,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 21,
      "text": "Going on from there, He saw two other brothers—James the son of Zebedee and John his brother—in the boat with Zebedee their father, mending their nets. He called them.",
      "links": "<a href='/AIV/41/1/19'>Mark 1:19</a>; <a href='/AIV/42/5/10'>Luke 5:10</a>",
      "comment": "Jesus calls James and John as well, indicating the formation of an apostolic band that prepares for the establishment of the Church."
    },
    {
      "pk": 4125022,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 22,
      "text": "Immediately they left the boat and their father and followed Him.",
      "links": "<a href='/AIV/41/1/20'>Mark 1:20</a>",
      "comment": "Total detachment from former ties signals a deeper spiritual dependency and familial relationship, later seen in the Church as family of God."
    },
    {
      "pk": 4125023,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 23,
      "text": "And Jesus went throughout all Galilee, teaching in their synagogues and proclaiming the gospel of the kingdom, and healing every disease and every sickness among the people.",
      "links": "<a href='/AIV/40/9/35'>Matt. 9:35</a>; <a href='/AIV/41/1/39'>Mark 1:39</a>",
      "comment": "Jesus’ threefold ministry—teaching, preaching, and healing—initiates the visible manifestation of the kingdom and prefigures sacramental life."
    },
    {
      "pk": 4125024,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 24,
      "text": "So His fame spread throughout all Syria, and they brought to Him all who were sick, suffering from various diseases and torments, those oppressed by demons, and epileptics and paralyzed. And He healed them.",
      "links": "<a href='/AIV/40/8/16'>Matt. 8:16</a>; <a href='/AIV/42/4/40'>Luke 4:40</a>",
      "comment": "Jesus' healing ministry demonstrates both divine compassion and authority, signs of the kingdom breaking in and a foreshadowing of sacramental grace."
    },
    {
      "pk": 4125025,
      "translation": "AIV",
      "book": 40,
      "chapter": 4,
      "verse": 25,
      "text": "And large crowds followed Him from Galilee and the Decapolis, Jerusalem, Judea, and from beyond the Jordan.",
      "links": "<a href='/AIV/40/8/1'>Matt. 8:1</a>; <a href='/AIV/41/3/7'>Mark 3:7-8</a>",
      "comment": "Jesus draws diverse multitudes, fulfilling the Old Testament vision of a universal people gathered around Him and foreshadowing the unity of all nations in His Church."
    }
  ],
  "translatedAt": "2025-12-23T02:10:05.007Z"
}