{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 19,
  "verses": [
    {
      "pk": 1935019,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 1,
      "text": "When Jesus had finished these words, he departed from Galilee and came into the region of Judea beyond the Jordan.",
      "links": "<a href='/AIV/41/10/1'>Mark 10:1</a>",
      "comment": "After His teachings in Galilee, Jesus moves toward Judea, approaching the final phase of His earthly ministry which leads to Jerusalem. The geographical reference grounds the narrative historically."
    },
    {
      "pk": 1935020,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 2,
      "text": "Large crowds followed Him, and He healed them there.",
      "links": "<a href='/AIV/9/7/14'>2 Kings 7:14</a>; <a href='/AIV/40/12/15'>Matt. 12:15</a>",
      "comment": "Jesus’ healing ministry was a sign of God’s compassion and a foretaste of the kingdom, fulfilling prophesies about the Messiah restoring wholeness (Isaiah 35:5-6)."
    },
    {
      "pk": 1935021,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 3,
      "text": "Pharisees approached Him, testing Him, and said, 'Is it lawful for a man to divorce his wife for any reason?'",
      "links": "<a href='/AIV/5/24/1'>Deut. 24:1</a>; <a href='/AIV/41/10/2'>Mark 10:2</a>",
      "comment": "The Pharisees seek to trap Jesus by referencing Mosaic Law on divorce. This sets the stage for Jesus’ authoritative interpretation beyond the law’s letter."
    },
    {
      "pk": 1935022,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 4,
      "text": "He answered, 'Have you not read that He who created them from the beginning made them male and female,'",
      "links": "<a href='/AIV/1/1/27'>Gen. 1:27</a>; <a href='/AIV/1/5/2'>Gen. 5:2</a>",
      "comment": "Jesus references Genesis, affirming marriage as a creation ordinance. His answer grounds marriage in God’s design, prior to any legal provisions."
    },
    {
      "pk": 1935023,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 5,
      "text": "'and said, \"For this reason a man shall leave his father and mother and be joined to his wife, and the two shall become one flesh\"?'",
      "links": "<a href='/AIV/1/2/24'>Gen. 2:24</a>; <a href='/AIV/46/6/16'>1 Cor. 6:16</a>",
      "comment": "By quoting Genesis, Jesus points to the deep sacramental union in marriage—one flesh—emphasizing permanence and exclusivity."
    },
    {
      "pk": 1935024,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 6,
      "text": "So they are no longer two, but one flesh. Therefore what God has joined together, let no one separate.",
      "links": "<a href='/AIV/41/10/9'>Mark 10:9</a>; <a href='/AIV/46/7/10'>1 Cor. 7:10-11</a>",
      "comment": "Jesus declares the indissolubility of marriage, teaching that it is God who unites. This phrase has been foundational for understanding marriage as a sacred, lifelong covenant."
    },
    {
      "pk": 1935025,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 7,
      "text": "They said to Him, 'Why then did Moses command us to give a certificate of divorce and send her away?'",
      "links": "<a href='/AIV/5/24/1'>Deut. 24:1</a>",
      "comment": "The Pharisees appeal to Mosaic Law permitting divorce, seeking to test Jesus on the Law’s authority versus His own."
    },
    {
      "pk": 1935026,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 8,
      "text": "He said to them, 'Because of your hardness of heart, Moses permitted you to divorce your wives. But from the beginning it was not so.'",
      "links": "<a href='/AIV/5/24/1'>Deut. 24:1</a>; <a href='/AIV/1/2/24'>Gen. 2:24</a>",
      "comment": "Jesus teaches that Old Testament concessions to divorce reflected fallen human nature, not God’s original will. The reference to 'the beginning' points back to the ideal intent established in Genesis."
    },
    {
      "pk": 1935027,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 9,
      "text": "And I say to you, whoever divorces his wife, except for sexual immorality, and marries another, commits adultery.",
      "links": "<a href='/AIV/5/22/22'>Deut. 22:22</a>; <a href='/AIV/41/10/11'>Mark 10:11</a>",
      "comment": "Jesus makes a solemn pronouncement, tightening the allowance for divorce to cases of sexual immorality. This shows His authority to interpret and even surpass the Law, reinforcing the sanctity of marriage."
    },
    {
      "pk": 1935028,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 10,
      "text": "The disciples said to Him, 'If this is the case between a man and his wife, it is better not to marry.'",
      "links": "<a href='/AIV/40/5/32'>Matt. 5:32</a>",
      "comment": "Recognizing the challenge of Jesus’ teaching, the disciples exclaim that lifelong fidelity is demanding, hinting at the value of celibacy for some."
    },
    {
      "pk": 1935029,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 11,
      "text": "He said to them, 'Not everyone can accept this word, but only those to whom it has been given.'",
      "links": "<a href='/AIV/46/7/7'>1 Cor. 7:7</a>",
      "comment": "Jesus acknowledges that both marriage and celibacy are vocations, received as gifts of grace. This points to a spiritual calling, not just a legal or social arrangement."
    },
    {
      "pk": 1935030,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 12,
      "text": "For there are eunuchs who were born that way from birth, and there are eunuchs made eunuchs by men, and there are eunuchs who have made themselves eunuchs for the sake of the kingdom of heaven. He who is able to accept this, let him accept it.",
      "links": "<a href='/AIV/23/56/3'>Isa. 56:3-4</a>",
      "comment": "Jesus affirms celibacy for the kingdom as a noble sacrifice. Historically, this passage has inspired lives wholly devoted to God in vows of celibacy, a higher calling within the faith."
    },
    {
      "pk": 1935031,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 13,
      "text": "Then little children were brought to Him so that He might lay His hands on them and pray. But the disciples rebuked those bringing them.",
      "links": "<a href='/AIV/41/10/13'>Mark 10:13</a>; <a href='/AIV/42/18/15'>Luke 18:15</a>",
      "comment": "The act of laying on hands shows blessing and spiritual impartation. The disciples’ initial response reflects an adult-centered view, which Jesus corrects."
    },
    {
      "pk": 1935032,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 14,
      "text": "But Jesus said, 'Let the children come to Me, and do not hinder them, for to such belongs the kingdom of heaven.'",
      "links": "<a href='/AIV/18/42/16'>Job 42:16</a>; <a href='/AIV/40/18/3'>Matt. 18:3</a>",
      "comment": "Jesus teaches that childlike openness and trust are essential for entry into the kingdom. This has been understood as an affirmation of the grace received even by the youngest."
    },
    {
      "pk": 1935033,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 15,
      "text": "And after laying His hands on them, He went on from there.",
      "links": "<a href='/AIV/41/10/16'>Mark 10:16</a>",
      "comment": "The act of laying on hands is a physical gesture of blessing, reminiscent of patriarchal blessings in the Old Testament."
    },
    {
      "pk": 1935034,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 16,
      "text": "And behold, a man came up to Him, saying, 'Teacher, what good deed must I do to have eternal life?'",
      "links": "<a href='/AIV/41/10/17'>Mark 10:17</a>; <a href='/AIV/42/18/18'>Luke 18:18</a>",
      "comment": "The ‘rich young ruler’ asks about the requirements for eternal life, revealing concern for both righteousness and salvation."
    },
    {
      "pk": 1935035,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 17,
      "text": "And He said to him, 'Why do you ask Me about what is good? There is only One who is good. If you want to enter life, keep the commandments.'",
      "links": "<a href='/AIV/5/6/4'>Deut. 6:4-5</a>; <a href='/AIV/5/5/32'>Deut. 5:32-33</a>",
      "comment": "Jesus redirects the question from human achievement to God as the source of goodness, then underlines obedience to the commandments as essential for entering life."
    },
    {
      "pk": 1935036,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 18,
      "text": "He said to Him, 'Which ones?' And Jesus answered, 'You shall not murder; You shall not commit adultery; You shall not steal; You shall not bear false witness;",
      "links": "<a href='/AIV/2/20/13-16'>Ex. 20:13-16</a>; <a href='/AIV/5/5/17-20'>Deut. 5:17-20</a>",
      "comment": "Jesus lists key moral commandments, drawn directly from the Decalogue, showing continuity with the Law’s moral demands."
    },
    {
      "pk": 1935037,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 19,
      "text": "'Honor your father and mother; and, \"You shall love your neighbor as yourself.\"'",
      "links": "<a href='/AIV/2/20/12'>Ex. 20:12</a>; <a href='/AIV/3/19/18'>Lev. 19:18</a>; <a href='/AIV/5/5/16'>Deut. 5:16</a>",
      "comment": "Jesus adds the fifth commandment and summarizes the rest with Leviticus 19:18, showing the heart of the law is love."
    },
    {
      "pk": 1935038,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 20,
      "text": "The young man said to Him, 'All these I have kept. What do I still lack?'",
      "links": "<a href='/AIV/41/10/20'>Mark 10:20</a>",
      "comment": "The man believes he has fulfilled the commandments, yet senses he lacks something deeper—a relation to God beyond moral observance."
    },
    {
      "pk": 1935039,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 21,
      "text": "Jesus said to him, 'If you would be perfect, go, sell your possessions and give to the poor, and you will have treasure in heaven; and come, follow Me.'",
      "links": "<a href='/AIV/6/18/1'>Prov. 18:1</a>; <a href='/AIV/40/6/19-21'>Matt. 6:19-21</a>",
      "comment": "Here Jesus invites the man to total discipleship and detachment from earthly goods. The concept of perfection points to deeper union with God and radical charity for others, which has historically formed the pattern of consecrated life."
    },
    {
      "pk": 1935040,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 22,
      "text": "But when the young man heard this, he went away sorrowful, for he had many possessions.",
      "links": "<a href='/AIV/41/10/22'>Mark 10:22</a>",
      "comment": "Attachment to material wealth can hinder full surrender to God. Jesus calls for sacrificial love and trust in heavenly reward."
    },
    {
      "pk": 1935041,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 23,
      "text": "And Jesus said to His disciples, 'Truly, I say to you, it is hard for a rich person to enter the kingdom of heaven.'",
      "links": "<a href='/AIV/41/10/23'>Mark 10:23</a>; <a href='/AIV/20/23/4-5'>Prov. 23:4-5</a>",
      "comment": "The paradox of wealth is its power to distract from ultimate dependence on God, echoing the wisdom literature warnings about riches."
    },
    {
      "pk": 1935042,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 24,
      "text": "Again I tell you, it is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of God.",
      "links": "<a href='/AIV/41/10/25'>Mark 10:25</a>; <a href='/AIV/42/18/25'>Luke 18:25</a>",
      "comment": "Jesus’ metaphor reveals the sheer impossibility of salvation by human efforts—especially for the materially comfortable. Entrance to the kingdom requires God’s grace, not earthly status."
    },
    {
      "pk": 1935043,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 25,
      "text": "When the disciples heard this, they were greatly astonished, saying, 'Who then can be saved?'",
      "links": "<a href='/AIV/41/10/26'>Mark 10:26</a>",
      "comment": "This question opens the way for Jesus to teach about the primacy of grace. The disciples’ astonishment reflects a worldview that assumed earthly blessing as a sign of favor."
    },
    {
      "pk": 1935044,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 26,
      "text": "But Jesus looked at them and said, 'With man this is impossible, but with God all things are possible.'",
      "links": "<a href='/AIV/1/18/14'>Gen. 18:14</a>; <a href='/AIV/27/2/21'>Dan. 2:21</a>",
      "comment": "Jesus makes a distinct claim of divine sovereignty and the necessity of God’s intervention—echoing Old Testament assurances of God’s unlimited power. Here, salvation is ultimately a gift from God."
    },
    {
      "pk": 1935045,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 27,
      "text": "Then Peter said in reply, 'Look, we have left everything and followed You. What then will we have?'",
      "links": "<a href='/AIV/41/10/28'>Mark 10:28</a>",
      "comment": "Peter’s question addresses the cost of discipleship and the expectation of reward. Jesus will affirm the future blessings for those who leave all for Him."
    },
    {
      "pk": 1935046,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 28,
      "text": "Jesus said to them, 'Truly I tell you, in the new world, when the Son of Man sits on His glorious throne, you who have followed Me will also sit on twelve thrones, judging the twelve tribes of Israel.'",
      "links": "<a href='/AIV/42/22/30'>Luke 22:30</a>; <a href='/AIV/27/7/9-14'>Dan. 7:9-14</a>",
      "comment": "Jesus speaks of the renewal (regeneration) of all things and future judgment, promising both spiritual and authoritative roles for the apostles. The reference to His throne signals His claim to divine kingship, fulfilling Daniel’s vision of the Son of Man."
    },
    {
      "pk": 1935047,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 29,
      "text": "And everyone who has left houses, or brothers, or sisters, or father, or mother, or children, or lands, for My name’s sake, will receive a hundredfold, and will inherit eternal life.",
      "links": "<a href='/AIV/41/10/29-30'>Mark 10:29-30</a>",
      "comment": "Jesus assures abundant spiritual rewards and eternal life for those who sacrifice worldly ties for Him, highlighting the all-surpassing value of devotion to Christ."
    },
    {
      "pk": 1935048,
      "translation": "AIV",
      "book": 40,
      "chapter": 19,
      "verse": 30,
      "text": "But many who are first will be last, and the last first.",
      "links": "<a href='/AIV/40/20/16'>Matt. 20:16</a>; <a href='/AIV/41/10/31'>Mark 10:31</a>",
      "comment": "Jesus ends with a paradox challenging human notions of status and reward, emphasizing humility and God’s justice in distributing grace."
    }
  ],
  "translatedAt": "2025-12-23T02:15:11.863Z"
}