{
  "book": 47,
  "bookName": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 18,
  "verses": [
    {
      "pk": 47018001,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 1,
      "text": "At that time the disciples came to Jesus and asked, 'Who is the greatest in the kingdom of heaven?'",
      "links": "<a href='/AIV/41/9/33-34'>Mark 9:33-34</a>; <a href='/AIV/42/9/46'>Luke 9:46</a>",
      "comment": "The disciples' question about greatness highlights earthly ambitions. In the Gospels, the 'kingdom of heaven' often refers to God's rule both now and in the life to come."
    },
    {
      "pk": 47018002,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 2,
      "text": "He called a little child to Himself and set him in the midst of them.",
      "links": "<a href='/AIV/41/9/36'>Mark 9:36</a>; <a href='/AIV/42/9/47'>Luke 9:47</a>",
      "comment": "Jesus uses a child as a living illustration. Children symbolize humility and dependence in ancient Jewish culture."
    },
    {
      "pk": 47018003,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 3,
      "text": "And He said, 'Truly I say to you, unless you turn and become like children, you will never enter the kingdom of heaven.'",
      "links": "<a href='/AIV/43/3/3-5'>John 3:3-5</a>; <a href='/AIV/19/131/2'>Ps. 131:2</a>",
      "comment": "Entering God's kingdom requires radical humility and spiritual dependence. This theme is echoed in the need for spiritual rebirth (John 3:3-5)."
    },
    {
      "pk": 47018004,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 4,
      "text": "Whoever humbles himself like this child is the greatest in the kingdom of heaven.",
      "links": "<a href='/AIV/23/57/15'>Isa. 57:15</a>; <a href='/AIV/20/29/23'>Prov. 29:23</a>",
      "comment": "Humility is in line with God's own exaltation of the lowly (Isaiah 57:15). This humility precedes true spiritual greatness."
    },
    {
      "pk": 47018005,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 5,
      "text": "And whoever receives one such child in My name receives Me.",
      "links": "<a href='/AIV/41/9/37'>Mark 9:37</a>; <a href='/AIV/40/10/40'>Matt. 10:40</a>",
      "comment": "To welcome and care for the humble is to welcome Christ Himself (see also Matt. 10:40), highlighting a spiritual mystery of Christ's presence among the 'least.'"
    },
    {
      "pk": 47018006,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 6,
      "text": "But whoever causes one of these little ones who believe in Me to stumble, it would be better for him to have a heavy millstone hung around his neck and to be drowned in the depths of the sea.",
      "links": "<a href='/AIV/41/9/42'>Mark 9:42</a>; <a href='/AIV/42/17/2'>Luke 17:2</a>",
      "comment": "Jesus offers a solemn warning about leading believers astray. The phrase 'little ones' can refer both to children and to believers who are humble or new in faith."
    },
    {
      "pk": 47018007,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 7,
      "text": "Woe to the world because of stumbling blocks! For stumbling blocks must come, but woe to the man through whom the stumbling block comes!",
      "links": "<a href='/AIV/46/11/19'>1 Cor. 11:19</a>; <a href='/AIV/19/119/165'>Ps. 119:165</a>",
      "comment": "'Stumbling blocks' means causes of spiritual downfall. Although temptation is inevitable in a fallen world, personal responsibility for leading others into sin is emphasized."
    },
    {
      "pk": 47018008,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 8,
      "text": "If your hand or your foot causes you to stumble, cut it off and throw it away. It is better for you to enter life crippled or lame than to have two hands or two feet and be thrown into the eternal fire.",
      "links": "<a href='/AIV/40/5/29-30'>Matt. 5:29-30</a>; <a href='/AIV/41/9/43-45'>Mark 9:43-45</a>",
      "comment": "Extreme language underlines the seriousness of sin. 'Eternal fire' (Gehenna) refers to final judgment. Early Christian thinkers saw in this a call to radical holiness, sometimes lived out in personal discipline."
    },
    {
      "pk": 47018009,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 9,
      "text": "And if your eye causes you to stumble, pluck it out and throw it away. It is better for you to enter life with one eye than to have two eyes and be thrown into the fiery hell.",
      "links": "<a href='/AIV/40/5/29'>Matt. 5:29</a>; <a href='/AIV/41/9/47'>Mark 9:47</a>",
      "comment": "Further intensifies the point about avoiding scandal and sin. 'Fiery hell' continues the image of a place of eternal separation from God."
    },
    {
      "pk": 47018010,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 10,
      "text": "See that you do not despise one of these little ones. For I tell you that their angels in heaven always see the face of My Father who is in heaven.",
      "links": "<a href='/AIV/19/34/7'>Ps. 34:7</a>; <a href='/AIV/58/1/14'>Heb. 1:14</a>",
      "comment": "A key verse for the belief in guardian angels. The phrase 'their angels' suggests the spiritual dignity and protection afforded to each believer, especially the humble and innocent."
    },
    {
      "pk": 47018011,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 11,
      "text": "[For the Son of Man came to save what was lost.]",
      "links": "<a href='/AIV/42/19/10'>Luke 19:10</a>; <a href='/AIV/26/34/16'>Ezek. 34:16</a>",
      "comment": "Some manuscripts do not include this verse. Where it occurs, it emphasizes Jesus’ mission to seek the lost. Echoes prophecies about the Shepherd rescuing lost sheep in the Old Testament."
    },
    {
      "pk": 47018012,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 12,
      "text": "'What do you think? If a man has a hundred sheep and one of them goes astray, does he not leave the ninety-nine on the mountains and go in search of the one that went astray?'",
      "links": "<a href='/AIV/42/15/4-7'>Luke 15:4-7</a>; <a href='/AIV/26/34/11-12'>Ezek. 34:11-12</a>",
      "comment": "The parable of the lost sheep reveals God's loving pursuit of each lost soul, connecting to shepherd imagery in the Old Testament."
    },
    {
      "pk": 47018013,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 13,
      "text": "And if he finds it, truly I say to you, he rejoices more over it than over the ninety-nine that did not go astray.",
      "links": "<a href='/AIV/42/15/6'>Luke 15:6</a>",
      "comment": "Jesus stresses the value of each individual. God's joy over the repentant sinner is a recurring biblical theme."
    },
    {
      "pk": 47018014,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 14,
      "text": "So it is not the will of your Father in heaven that even one of these little ones should perish.",
      "links": "<a href='/AIV/61/3/9'>2 Pet. 3:9</a>; <a href='/AIV/26/18/23'>Ezek. 18:23</a>",
      "comment": "Highlights the Father's universal salvific will. The spiritual reality here is the care God has for each soul."
    },
    {
      "pk": 47018015,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 15,
      "text": "If your brother sins against you, go and show him his fault, just between the two of you. If he listens to you, you have won your brother over.",
      "links": "<a href='/AIV/03/19/17'>Lev. 19:17</a>; <a href='/AIV/48/6/1'>Gal. 6:1</a>",
      "comment": "The process for reconciliation within the community begins with private correction first, emphasizing humility and restoration."
    },
    {
      "pk": 47018016,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 16,
      "text": "But if he will not listen, take one or two others along with you, so that 'every matter may be established by the testimony of two or three witnesses.'",
      "links": "<a href='/AIV/05/19/15'>Deut. 19:15</a>; <a href='/AIV/54/5/19'>1 Tim. 5:19</a>",
      "comment": "This pattern follows Old Testament legal principles. Such process protects against slander or injustice, ensuring all sides are heard."
    },
    {
      "pk": 47018017,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 17,
      "text": "If he refuses to listen to them, tell it to the assembly. If he refuses to listen even to the assembly, let him be to you as a Gentile and a tax collector.",
      "links": "<a href='/AIV/53/3/6'>2 Thess. 3:6</a>; <a href='/AIV/43/20/23'>John 20:23</a>",
      "comment": "The wording suggests a structured, authoritative community. The process even includes the possibility of exclusion for persistent unrepentance, a mark of maintaining the community's holiness."
    },
    {
      "pk": 47018018,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 18,
      "text": "Truly I say to you, whatever you bind on earth will be bound in heaven, and whatever you loose on earth will be loosed in heaven.",
      "links": "<a href='/AIV/40/16/19'>Matt. 16:19</a>; <a href='/AIV/43/20/23'>John 20:23</a>",
      "comment": "This statement confers real spiritual authority to the leaders of the assembly, echoing Jesus' earlier commission to Peter (Matt. 16:19). The ideas of 'binding and loosing' refer to the authority to forgive or retain sins and to make decisions regarding doctrine and discipline."
    },
    {
      "pk": 47018019,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 19,
      "text": "Again, truly I say to you, if two of you agree on earth about anything they ask, it will be done for them by My Father in heaven.",
      "links": "<a href='/AIV/43/14/13-14'>John 14:13-14</a>; <a href='/AIV/19/133/1'>Ps. 133:1</a>",
      "comment": "Christ emphasizes the power of agreement in prayer within the community, which is integral to communal worship."
    },
    {
      "pk": 47018020,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 20,
      "text": "For where two or three are gathered in My name, there am I among them.",
      "links": "<a href='/AIV/02/25/8'>Ex. 25:8</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "Jesus promises His real presence among His followers in their gatherings, a mystery deeply cherished in corporate worship. This assertion of 'I am among them' echoes divine self-revelation (cf. God's presence among Israel)."
    },
    {
      "pk": 47018021,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 21,
      "text": "Then Peter came and said to Him, 'Lord, how many times shall my brother sin against me and I forgive him? Up to seven times?'",
      "links": "<a href='/AIV/42/17/4'>Luke 17:4</a>",
      "comment": "Peter offers a generous-sounding limit, but Jesus challenges it even further."
    },
    {
      "pk": 47018022,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 22,
      "text": "Jesus said to him, 'I do not say to you seven times, but seventy-seven times.'",
      "links": "<a href='/AIV/01/4/24'>Gen. 4:24</a>; <a href='/AIV/40/6/14'>Matt. 6:14</a>",
      "comment": "Jesus calls for limitless forgiveness, reversing Lamech’s vengeful boasting (Genesis 4:24). This radical call parallels God's extravagant mercy to us."
    },
    {
      "pk": 47018023,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 23,
      "text": "'For this reason the kingdom of heaven may be compared to a king who wished to settle accounts with his servants.'",
      "links": "<a href='/AIV/42/7/41-42'>Luke 7:41-42</a>",
      "comment": "Typical of Jesus’ parables: a royal figure represents God, and the settling of accounts stands for judgment and mercy."
    },
    {
      "pk": 47018024,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 24,
      "text": "When he began to settle, one was brought to him who owed him ten thousand talents.",
      "links": "<a href='/AIV/14/9/13'>2 Chron. 9:13</a>; <a href='/AIV/16/3/22'>Neh. 3:22</a>",
      "comment": "Ten thousand talents: an astronomical sum—emphasizing the impossibility for us to repay our 'sin-debt' before God."
    },
    {
      "pk": 47018025,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 25,
      "text": "And since he could not pay, his master ordered that he be sold, with his wife and children and all that he had, to make repayment.",
      "links": "<a href='/AIV/03/25/39'>Lev. 25:39</a>",
      "comment": "Slavery for debt was standard in the ancient world, underscoring the dire consequences of spiritual debt."
    },
    {
      "pk": 47018026,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 26,
      "text": "So the servant fell on his knees before him, saying, 'Have patience with me, and I will pay you everything.'",
      "links": "<a href='/AIV/19/86/5'>Ps. 86:5</a>",
      "comment": "The servant’s desperate plea for mercy is met not with justice, but with grace—a reflection of God's mercy for repentant sinners."
    },
    {
      "pk": 47018027,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 27,
      "text": "And out of compassion, the master of that servant released him and forgave him the debt.",
      "links": "<a href='/AIV/19/130/3-4'>Ps. 130:3-4</a>; <a href='/AIV/45/5/8'>Rom. 5:8</a>",
      "comment": "This act represents complete forgiveness. The Greek emphasizes a total cancellation, not just a postponement."
    },
    {
      "pk": 47018028,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 28,
      "text": "But that same servant, as he went out, found one of his fellow servants who owed him a hundred denarii. Seizing him, he began to choke him, saying, 'Pay what you owe.'",
      "links": "<a href='/AIV/42/7/41-42'>Luke 7:41-42</a>",
      "comment": "A huge imbalance: the forgiven debt was immense, this one is trivial in comparison. Spiritual application: those who have received mercy must show mercy."
    },
    {
      "pk": 47018029,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 29,
      "text": "So his fellow servant fell down and pleaded with him, 'Have patience with me, and I will pay you.'",
      "links": "<a href='/AIV/18/19/21'>Job 19:21</a>",
      "comment": "The nearly identical plea highlights the hypocrisy of the first servant’s refusal to forgive."
    },
    {
      "pk": 47018030,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 30,
      "text": "But he refused and went and put him in prison until he should pay the debt.",
      "links": "",
      "comment": "Jesus draws a stark contrast to God's mercy; the unmerciful servant exercises justice only, not mercy."
    },
    {
      "pk": 47018031,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 31,
      "text": "When his fellow servants saw what had taken place, they were greatly distressed, and they went and reported to their master all that had happened.",
      "links": "<a href='/AIV/17/6/13'>Est. 6:13</a>",
      "comment": "God’s people are meant to notice such hypocrisy and injustice within the community."
    },
    {
      "pk": 47018032,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 32,
      "text": "Then his master summoned him and said, 'You wicked servant! I forgave you all that debt because you pleaded with me.'",
      "links": "",
      "comment": "A reminder that God’s forgiveness is contingent upon our willingness to forgive others."
    },
    {
      "pk": 47018033,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 33,
      "text": "'Should you not also have had mercy on your fellow servant, just as I had mercy on you?'",
      "links": "<a href='/AIV/40/6/12'>Matt. 6:12</a>; <a href='/AIV/59/2/13'>James 2:13</a>",
      "comment": "God's mercy is the model and measure for our own. Jesus’ words imply mercy is not optional for His followers."
    },
    {
      "pk": 47018034,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 34,
      "text": "And in anger his master handed him over to the jailers, until he should pay all that was owed.",
      "links": "<a href='/AIV/40/5/25-26'>Matt. 5:25-26</a>",
      "comment": "The consequences for unforgiveness are severe. This passage has been interpreted as referring to a spiritual purification before entering eternal reward."
    },
    {
      "pk": 47018035,
      "translation": "AIV",
      "book": 47,
      "bookName": "Matthew",
      "bookAbbreviation": "Matt",
      "chapter": 18,
      "verse": 35,
      "text": "So also My heavenly Father will do to every one of you, if you do not forgive your brother from your heart.",
      "links": "<a href='/AIV/40/6/15'>Matt. 6:15</a>; <a href='/AIV/41/11/25'>Mark 11:25</a>",
      "comment": "Jesus concludes by restating the necessity of wholehearted forgiveness, which is foundational for life in the community of the faithful. Note: the spiritual principle here points to the seriousness of our cooperation with God's mercy towards ourselves and others."
    }
  ],
  "translatedAt": "2025-12-24T10:12:30.534Z"
}