{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 16,
  "verses": [
    {
      "pk": 301601,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 1,
      "text": "The Pharisees and Sadducees came and, to test Jesus, asked Him to show them a sign from heaven.",
      "links": "<a href='/AIV/40/12/38'>Matt. 12:38</a>; <a href='/AIV/43/6/30'>John 6:30</a>",
      "comment": "This is another instance of the religious leaders demanding a miraculous sign, showing their lack of faith, as seen previously in Matthew 12:38."
    },
    {
      "pk": 301602,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 2,
      "text": "He replied, 'When evening comes you say, ‘It will be fair weather, for the sky is red.’",
      "links": "<a href='/AIV/42/12/54'>Luke 12:54-56</a>",
      "comment": "Jesus uses a common saying about predicting the weather as an analogy for spiritual discernment."
    },
    {
      "pk": 301603,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 3,
      "text": "And in the morning, ‘Today there will be a storm, for the sky is red and threatening.’ You know how to interpret the appearance of the sky, but you cannot interpret the signs of the times.",
      "links": "<a href='/AIV/42/12/56'>Luke 12:56</a>",
      "comment": "Jesus rebukes them for recognizing physical signs, but being blind to the spiritual significance of His coming."
    },
    {
      "pk": 301604,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 4,
      "text": "An evil and adulterous generation seeks for a sign, but no sign will be given to it except the sign of Jonah.' Then He left them and went away.",
      "links": "<a href='/AIV/40/12/39-41'>Matt. 12:39-41</a>; <a href='/AIV/32/1/17'>Jonah 1:17</a>",
      "comment": "The 'sign of Jonah' refers to Jesus' death and resurrection after three days, paralleling Jonah’s three days in the belly of the fish (Jonah 1:17). This is a clear foreshadowing of the resurrection—affirming Christ’s divinity."
    },
    {
      "pk": 301605,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 5,
      "text": "When the disciples reached the other side, they had forgotten to bring any bread.",
      "links": "<a href='/AIV/41/8/14'>Mark 8:14</a>",
      "comment": "A simple narrative transition leading to a spiritual lesson."
    },
    {
      "pk": 301606,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 6,
      "text": "Jesus said to them, 'Watch out and beware of the yeast of the Pharisees and Sadducees.'",
      "links": "<a href='/AIV/41/8/15'>Mark 8:15</a>; <a href='/AIV/42/12/1'>Luke 12:1</a>",
      "comment": "'Yeast' is symbolic of false teaching or hypocrisy. Jesus warns His disciples to guard the integrity of their faith."
    },
    {
      "pk": 301607,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 7,
      "text": "And they began to discuss among themselves, saying, 'We didn't bring any bread.'",
      "links": "",
      "comment": "The disciples misunderstood the spiritual meaning, thinking Jesus referred to literal bread."
    },
    {
      "pk": 301608,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 8,
      "text": "But Jesus, aware of this, said, 'Why are you discussing among yourselves that you have no bread? You of little faith!'",
      "links": "<a href='/AIV/40/8/26'>Matt. 8:26</a>; <a href='/AIV/40/14/31'>Matt. 14:31</a>",
      "comment": "Jesus rebukes their lack of faith. He had just multiplied bread before."
    },
    {
      "pk": 301609,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 9,
      "text": "Do you not yet understand? Do you not remember the five loaves for the five thousand, and how many baskets you gathered?",
      "links": "<a href='/AIV/40/14/17-21'>Matt. 14:17-21</a>",
      "comment": "Jesus recalls His previous miracles to remind them of His power and provision."
    },
    {
      "pk": 301610,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 10,
      "text": "Or the seven loaves for the four thousand, and how many baskets you collected?",
      "links": "<a href='/AIV/40/15/34-37'>Matt. 15:34-37</a>",
      "comment": "Again, Jesus highlights His miraculous feedings, inviting deeper trust."
    },
    {
      "pk": 301611,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 11,
      "text": "How is it that you do not understand that I was not talking about bread? But beware of the yeast of the Pharisees and Sadducees.'",
      "links": "<a href='/AIV/41/8/15'>Mark 8:15</a>",
      "comment": "Jesus presses them to move from literal to spiritual understanding, crucial for maturity in faith."
    },
    {
      "pk": 301612,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 12,
      "text": "Then they understood that He was not telling them to beware of the yeast in bread, but of the teaching of the Pharisees and Sadducees.",
      "links": "",
      "comment": "The leaven here is false doctrine, emphasizing the importance of pure teaching from the apostles."
    },
    {
      "pk": 301613,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 13,
      "text": "When Jesus came to the region of Caesarea Philippi, He asked His disciples, 'Who do people say that the Son of Man is?'",
      "links": "<a href='/AIV/40/8/20'>Matt. 8:20</a>; <a href='/AIV/27/7/13-14'>Dan. 7:13-14</a>",
      "comment": "‘Son of Man’ references Daniel 7:13-14, a messianic and divine title."
    },
    {
      "pk": 301614,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 14,
      "text": "They replied, 'Some say John the Baptist, others Elijah, and still others Jeremiah or one of the prophets.'",
      "links": "<a href='/AIV/40/14/2'>Matt. 14:2</a>",
      "comment": "The people recognized Jesus as a great prophet, but not yet as the Messiah or Son of God."
    },
    {
      "pk": 301615,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 15,
      "text": "'But who do you say that I am?' He asked them.",
      "links": "<a href='/AIV/41/8/29'>Mark 8:29</a>",
      "comment": "A deeply personal and foundational question; each Christian must answer for themselves."
    },
    {
      "pk": 301616,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 16,
      "text": "Simon Peter answered, 'You are the Christ, the Son of the living God.'",
      "links": "<a href='/AIV/43/6/69'>John 6:69</a>; <a href='/AIV/19/2/7'>Ps. 2:7</a>",
      "comment": "Peter confesses Jesus’ divinity and messiahship. Psalm 2:7 prophesies the Son’s relationship to God, now fulfilled in Jesus."
    },
    {
      "pk": 301617,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 17,
      "text": "And Jesus answered him, 'Blessed are you, Simon son of Jonah! For flesh and blood has not revealed this to you, but My Father who is in heaven.'",
      "links": "<a href='/AIV/48/1/11-12'>Gal. 1:11-12</a>; <a href='/AIV/46/2/10-14'>1 Cor. 2:10-14</a>",
      "comment": "Peter’s confession comes by divine revelation, not mere human reasoning. Jesus highlights that true understanding of His identity comes by God’s grace."
    },
    {
      "pk": 301618,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 18,
      "text": "And I tell you, you are Peter, and on this rock I will build My church, and the gates of Hades shall not overcome it.",
      "links": "<a href='/AIV/43/1/42'>John 1:42</a>; <a href='/AIV/49/2/20'>Eph. 2:20</a>",
      "comment": "‘Peter’ means ‘rock.’ Jesus makes Peter the foundation stone of His one, holy, apostolic Church, promising it will endure forever. Here Jesus institutes the visible headship of His Church, giving it unity and authority against the powers of hell."
    },
    {
      "pk": 301619,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 19,
      "text": "I will give you the keys of the kingdom of heaven; whatever you bind on earth will be bound in heaven, and whatever you loose on earth will be loosed in heaven.'",
      "links": "<a href='/AIV/23/22/22'>Isa. 22:22</a>; <a href='/AIV/18/42/2'>Job 42:2</a>; <a href='/AIV/40/18/18'>Matt. 18:18</a>",
      "comment": "Jesus invests Peter with the authority of the keys (see Isaiah 22:22), granting juridical and spiritual authority on earth that is ratified in heaven. This visible leadership points to a continuing office in the Church, grounded in Christ’s authority."
    },
    {
      "pk": 301620,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 20,
      "text": "Then He strictly charged the disciples not to tell anyone that He was the Christ.",
      "links": "<a href='/AIV/41/8/30'>Mark 8:30</a>",
      "comment": "Jesus implements the so-called ‘Messianic Secret,’ delaying public proclamation until after His resurrection, when His mission would be fully understood."
    },
    {
      "pk": 301621,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 21,
      "text": "From that time Jesus began to show His disciples that He must go to Jerusalem and suffer many things from the elders, chief priests, and scribes, and be killed, and on the third day be raised.",
      "links": "<a href='/AIV/40/17/22-23'>Matt. 17:22-23</a>; <a href='/AIV/23/53/3-5'>Isa. 53:3-5</a>",
      "comment": "Jesus begins to reveal His passion, death, and resurrection, fulfilling Old Testament prophecy (Isaiah 53). Here, Christ explicitly predicts His resurrection, confirming His divinity and authority over life and death."
    },
    {
      "pk": 301622,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 22,
      "text": "Peter took Him aside and began to rebuke Him, saying, 'Far be it from you, Lord! This shall never happen to You.'",
      "links": "<a href='/AIV/40/26/33-35'>Matt. 26:33-35</a>",
      "comment": "Peter, misunderstanding God’s plan, objects to Jesus’ suffering, showing both devotion and lack of understanding of the necessity of the cross."
    },
    {
      "pk": 301623,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 23,
      "text": "But Jesus turned and said to Peter, 'Get behind Me, Satan! You are a stumbling block to Me, for you are not setting your mind on the things of God, but on the things of man.'",
      "links": "<a href='/AIV/40/4/10'>Matt. 4:10</a>",
      "comment": "Jesus sternly rebukes Peter for opposing God's plan, associating this temptation with Satan. Even the chosen apostle can fall into error without divine guidance."
    },
    {
      "pk": 301624,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 24,
      "text": "Then Jesus told His disciples, 'If anyone would come after Me, let him deny himself and take up his cross and follow Me.'",
      "links": "<a href='/AIV/41/8/34'>Mark 8:34</a>; <a href='/AIV/42/9/23'>Luke 9:23</a>",
      "comment": "Every disciple must imitate Christ’s self-sacrifice, accepting suffering for the sake of the kingdom. This sets the pattern for heroic Christian holiness."
    },
    {
      "pk": 301625,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 25,
      "text": "For whoever wants to save his life will lose it, but whoever loses his life for My sake will find it.",
      "links": "<a href='/AIV/10/15/25'>2 Sam. 15:25</a>; <a href='/AIV/43/12/25'>John 12:25</a>",
      "comment": "The paradox of the gospel: self-giving leads to true life. This profound truth is both literal and spiritual."
    },
    {
      "pk": 301626,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 26,
      "text": "For what will it profit a man if he gains the whole world and forfeits his soul? Or what can a man give in exchange for his soul?",
      "links": "<a href='/AIV/19/49/7-8'>Ps. 49:7-8</a>",
      "comment": "Echoes Psalm 49:7-8. Eternal life outweighs any earthly gain; the soul’s value is infinite."
    },
    {
      "pk": 301627,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 27,
      "text": "For the Son of Man is going to come in the glory of His Father with His angels, and then He will repay each person according to his deeds.",
      "links": "<a href='/AIV/27/7/13'>Dan. 7:13</a>; <a href='/AIV/19/62/12'>Ps. 62:12</a>; <a href='/AIV/45/2/6'>Rom. 2:6</a>",
      "comment": "Christ promises judgment based on works, highlighting the necessity of both faith and obedience. The ‘Son of Man’ coming in glory (Daniel 7:13) again underlines Jesus’ divine authority."
    },
    {
      "pk": 301628,
      "translation": "AIV",
      "book": 1,
      "chapter": 16,
      "verse": 28,
      "text": "Truly I say to you, there are some standing here who will not taste death until they see the Son of Man coming in His kingdom.'",
      "links": "<a href='/AIV/40/17/1-2'>Matt. 17:1-2</a>; <a href='/AIV/42/9/27'>Luke 9:27</a>",
      "comment": "This often points to the Transfiguration (Matt. 17:1-2) or the Church’s establishment at Pentecost as a manifestation of the kingdom. Both events manifest Christ’s glory in history."
    }
  ],
  "translatedAt": "2025-12-23T02:13:41.681Z"
}