{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 22,
  "verses": [
    {
      "pk": 222001,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 1,
      "text": "And Jesus spoke to them again in parables, saying:",
      "links": "<a href='/AIV/41/12/1'>Mark 12:1</a>; <a href='/AIV/42/20/9'>Luke 20:9</a>",
      "comment": "This continues a series of parables addressed to the religious leaders. Parables are Jesus’ preferred way of veiling profound truths for those willing to listen."
    },
    {
      "pk": 222002,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 2,
      "text": "\"The kingdom of heaven may be compared to a king who prepared a wedding feast for his son.",
      "links": "<a href='/AIV/19/45/13-15'>Psalm 45:13–15</a>; <a href='/AIV/23/25/6'>Isaiah 25:6</a>",
      "comment": "The king represents God the Father; the son is Christ. The wedding feast is a traditional image for the Messianic banquet."
    },
    {
      "pk": 222003,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 3,
      "text": "He sent his servants to call those who had been invited to the feast, but they refused to come.",
      "links": "<a href='/AIV/40/21/34-36'>Matthew 21:34–36</a>; <a href='/AIV/44/13/46'>Acts 13:46</a>",
      "comment": "The servants symbolize the prophets sent to Israel. The repeated refusal prefigures Israel’s rejection of Christ."
    },
    {
      "pk": 222004,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 4,
      "text": "Again, he sent other servants, saying, 'Tell those who are invited, \"Look, I have prepared my banquet; my oxen and fattened calves are slaughtered, and everything is ready. Come to the wedding feast.\"'",
      "links": "<a href='/AIV/20/9/2-5'>Proverbs 9:2–5</a>",
      "comment": "A second appeal reveals God’s persistence and generosity, echoing Old Testament invitations to wisdom and covenant participation."
    },
    {
      "pk": 222005,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 5,
      "text": "But they paid no attention and went off, one to his farm, another to his business,",
      "links": "<a href='/AIV/40/13/22'>Matthew 13:22</a>",
      "comment": "Their indifference shows the distractions of worldly concerns. This reflects people who prioritize earthly things above responding to God’s call."
    },
    {
      "pk": 222006,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 6,
      "text": "and the rest seized his servants, treated them shamefully, and killed them.",
      "links": "<a href='/AIV/40/21/35'>Matthew 21:35</a>; <a href='/AIV/23/65/2-7'>Isaiah 65:2–7</a>",
      "comment": "The mistreatment of servants points ahead to the persecution of prophets and apostles. This paves the way for a new invitation to others."
    },
    {
      "pk": 222007,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 7,
      "text": "The king was angry, and he sent his armies, destroyed those murderers, and burned their city.",
      "links": "<a href='/AIV/27/9/26'>Daniel 9:26</a>; <a href='/AIV/40/24/2'>Matthew 24:2</a>",
      "comment": "A prophecy of Jerusalem’s destruction (fulfilled in 70 A.D.), underscoring the consequences of rejecting God’s Son."
    },
    {
      "pk": 222008,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 8,
      "text": "Then he said to his servants, 'The wedding is ready, but those who were invited were not worthy.'",
      "links": "<a href='/AIV/44/13/46'>Acts 13:46</a>",
      "comment": "The original guests—Israel’s leaders—prove themselves unworthy by their rejection."
    },
    {
      "pk": 222009,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 9,
      "text": "\"Go therefore to the roads and invite to the wedding feast as many as you find.\"",
      "links": "<a href='/AIV/40/28/19'>Matthew 28:19</a>; <a href='/AIV/45/11/17'>Romans 11:17</a>",
      "comment": "A universal call is made to all peoples, prefiguring the inclusion of the Gentiles into God’s people."
    },
    {
      "pk": 222010,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 10,
      "text": "So those servants went out into the roads and gathered all whom they found, both good and bad. So the wedding hall was filled with guests.",
      "links": "<a href='/AIV/40/13/47-50'>Matthew 13:47–50</a>",
      "comment": "Both good and bad are gathered, showing the church’s embrace of all kinds—yet purification comes later. See the parable of the net."
    },
    {
      "pk": 222011,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 11,
      "text": "But when the king came in to look at the guests, he saw there a man who was not wearing a wedding garment.",
      "links": "<a href='/AIV/66/19/8'>Revelation 19:8</a>",
      "comment": "A garment symbolizes righteousness or sanctifying grace necessary to remain in God’s presence (see Revelation)."
    },
    {
      "pk": 222012,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 12,
      "text": "He said to him, 'Friend, how did you get in here without a wedding garment?' And the man was speechless.",
      "links": "<a href='/AIV/45/3/19'>Romans 3:19</a>",
      "comment": "A lack of proper attire points to an inadequate response to God’s grace: outward acceptance without inner transformation."
    },
    {
      "pk": 222013,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 13,
      "text": "Then the king said to the attendants, 'Bind him hand and foot and cast him into the outer darkness; there will be weeping and gnashing of teeth.'",
      "links": "<a href='/AIV/40/8/12'>Matthew 8:12</a>; <a href='/AIV/42/13/28'>Luke 13:28</a>",
      "comment": "Judgment is real for those not properly clothed in righteousness—an implicit reminder of the necessity of ongoing sanctity."
    },
    {
      "pk": 222014,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 14,
      "text": "For many are called, but few are chosen.\"",
      "links": "<a href='/AIV/40/20/16'>Matthew 20:16</a>; <a href='/AIV/66/17/14'>Revelation 17:14</a>",
      "comment": "God’s invitation is broad, but perseverance and a faithful response are necessary. The distinction between called and chosen points to the mystery of grace and free will."
    },
    {
      "pk": 222015,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 15,
      "text": "Then the Pharisees went and plotted together how they might trap Jesus in his words.",
      "links": "<a href='/AIV/41/12/13'>Mark 12:13</a>",
      "comment": "The religious authorities seek to ensnare Jesus, fulfilling the Psalmist’s words about opposition to the Messiah (<a href='/AIV/19/2/2'>Psalm 2:2</a>)."
    },
    {
      "pk": 222016,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 16,
      "text": "And they sent their disciples to him, along with the Herodians, saying, \"Teacher, we know you are truthful and teach the way of God in truth. You are not swayed by anyone, for you do not look at people’s faces.",
      "links": "<a href='/AIV/42/20/20-21'>Luke 20:20–21</a>",
      "comment": "Herodians were supporters of Herod’s dynasty. Their flattery is strategic but ironic, as Jesus is indeed truthful."
    },
    {
      "pk": 222017,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 17,
      "text": "\"Tell us, then, what you think. Is it lawful to pay taxes to Caesar, or not?\"",
      "links": "<a href='/AIV/41/12/14'>Mark 12:14</a>",
      "comment": "A trap: if Jesus says yes, He risks alienating the Jews; if no, He risks arrest by Roman authorities."
    },
    {
      "pk": 222018,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 18,
      "text": "But Jesus, aware of their malice, said, \"Why do you test me, you hypocrites?",
      "links": "<a href='/AIV/40/9/4'>Matthew 9:4</a>",
      "comment": "Jesus discerns their hearts, revealing His divine knowledge (see also John 2:24–25)."
    },
    {
      "pk": 222019,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 19,
      "text": "\"Show me the coin used for the tax.\" And they brought him a denarius.",
      "links": "<a href='/AIV/42/20/24'>Luke 20:24</a>",
      "comment": "A denarius bore Caesar’s image, underscoring Jesus’ coming teaching about rightful authority."
    },
    {
      "pk": 222020,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 20,
      "text": "And he said to them, \"Whose image and inscription is this?\"",
      "links": "<a href='/AIV/1/1/26-27'>Genesis 1:26–27</a>",
      "comment": "“Image” recalls the biblical teaching of the image of God, hinting at the dual claims of Caesar and God."
    },
    {
      "pk": 222021,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 21,
      "text": "They said, \"Caesar’s.\" Then he said to them, \"So give to Caesar what is Caesar’s, and to God what is God’s.\"",
      "links": "<a href='/AIV/45/13/7'>Romans 13:7</a>",
      "comment": "Jesus affirms rightful civic duty but asserts God’s ultimate claim over all—especially people, who bear His image."
    },
    {
      "pk": 222022,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 22,
      "text": "When they heard this, they marveled. And they left him and went away.",
      "links": "",
      "comment": "Jesus responds with a wisdom that surpasses human cunning."
    },
    {
      "pk": 222023,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 23,
      "text": "That same day Sadducees, who say there is no resurrection, came to him, and they asked him a question,",
      "links": "<a href='/AIV/44/23/8'>Acts 23:8</a>",
      "comment": "Sadducees only accepted the first five books of Moses and denied resurrection."
    },
    {
      "pk": 222024,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 24,
      "text": "saying, \"Teacher, Moses said, 'If a man dies having no children, his brother must marry the widow and raise up offspring for his brother.'\"",
      "links": "<a href='/AIV/5/25/5'>Deuteronomy 25:5</a>",
      "comment": "Levirate marriage was commanded to preserve family lines and property within Israel."
    },
    {
      "pk": 222025,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 25,
      "text": "\"Now there were seven brothers among us. The first married and died, and having no children, left his wife to his brother.",
      "links": "",
      "comment": "The Sadducees pose a hypothetical dilemma to ridicule the resurrection."
    },
    {
      "pk": 222026,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 26,
      "text": "So too the second and third, all the way to the seventh.",
      "links": "",
      "comment": "Their scenario is deliberately exaggerated to challenge the idea of resurrection."
    },
    {
      "pk": 222027,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 27,
      "text": "Last of all, the woman died.",
      "links": "",
      "comment": "This sets up their intended theological puzzle."
    },
    {
      "pk": 222028,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 28,
      "text": "\"In the resurrection, therefore, whose wife will she be of the seven? For they all had her.\"",
      "links": "",
      "comment": "The question exposes their material misconceptions of eternal life."
    },
    {
      "pk": 222029,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 29,
      "text": "But Jesus answered them, \"You are mistaken, because you know neither the Scriptures nor the power of God.",
      "links": "<a href='/AIV/41/12/24'>Mark 12:24</a>",
      "comment": "Jesus asserts both the truth of Scripture and the reality of God’s power, correcting error—His authority stands above both."
    },
    {
      "pk": 222030,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 30,
      "text": "For in the resurrection they neither marry nor are given in marriage, but are like angels in heaven.",
      "links": "<a href='/AIV/66/21/4'>Revelation 21:4</a>",
      "comment": "Earthly institutions like marriage cease in the resurrection, as all are perfectly united to God."
    },
    {
      "pk": 222031,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 31,
      "text": "But as for the resurrection of the dead, have you not read what was spoken to you by God:",
      "links": "<a href='/AIV/2/3/6'>Exodus 3:6</a>",
      "comment": "Jesus anchors His answer in the Torah, which His opponents respect."
    },
    {
      "pk": 222032,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 32,
      "text": "\"I am the God of Abraham, and the God of Isaac, and the God of Jacob.' He is not the God of the dead, but of the living.\"",
      "links": "<a href='/AIV/2/3/6'>Exodus 3:6</a>; <a href='/AIV/40/17/3'>Matthew 17:3</a>",
      "comment": "Present tense (“I am”) argues for the patriarchs’ ongoing life—proof of resurrection and personal continuity after death."
    },
    {
      "pk": 222033,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 33,
      "text": "And when the crowd heard it, they were astonished at his teaching.",
      "links": "",
      "comment": "Jesus’ teaching reveals divine authority and new depth in the Scriptures."
    },
    {
      "pk": 222034,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 34,
      "text": "But when the Pharisees heard that he had silenced the Sadducees, they gathered together.",
      "links": "",
      "comment": "Different factions unite against Jesus, but He proves wiser than all."
    },
    {
      "pk": 222035,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 35,
      "text": "And one of them, a lawyer, asked him a question, to test him:",
      "links": "",
      "comment": "A lawyer was an expert in Old Testament law. The constant testing of Jesus reveals His growing opposition and their lack of understanding."
    },
    {
      "pk": 222036,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 36,
      "text": "\"Teacher, which is the greatest commandment in the Law?\"",
      "links": "<a href='/AIV/5/6/5'>Deuteronomy 6:5</a>; <a href='/AIV/3/19/18'>Leviticus 19:18</a>",
      "comment": "The rabbis often debated this. A summary could justify or challenge various legal interpretations."
    },
    {
      "pk": 222037,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 37,
      "text": "He said to him, \"You shall love the Lord your God with all your heart, with all your soul, and with all your mind.",
      "links": "<a href='/AIV/5/6/5'>Deuteronomy 6:5</a>",
      "comment": "Jesus cites the Shema, the core confession of Israel’s faith—love for God is the first and greatest commandment."
    },
    {
      "pk": 222038,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 38,
      "text": "This is the first and greatest commandment.",
      "links": "",
      "comment": "The primacy of love for God is affirmed."
    },
    {
      "pk": 222039,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 39,
      "text": "And a second is like it: You shall love your neighbor as yourself.",
      "links": "<a href='/AIV/3/19/18'>Leviticus 19:18</a>",
      "comment": "The unity between love of God and of neighbor is foundational, anticipating the Church’s later social teaching and practical charity."
    },
    {
      "pk": 222040,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 40,
      "text": "On these two commandments hang all the Law and the Prophets.\"",
      "links": "<a href='/AIV/40/7/12'>Matthew 7:12</a>",
      "comment": "Jesus summarizes the entire Old Testament in terms of love—fulfilling and transcending the law. This is echoed throughout the apostolic teaching."
    },
    {
      "pk": 222041,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 41,
      "text": "While the Pharisees were gathered, Jesus asked them a question:",
      "links": "",
      "comment": "Jesus now tests the questioners, taking the initiative to reveal a deeper truth about the Messiah."
    },
    {
      "pk": 222042,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 42,
      "text": "\"What do you think about the Christ? Whose son is he?\" They said to him, \"David’s.\"",
      "links": "<a href='/AIV/10/7/12'>2 Samuel 7:12</a>",
      "comment": "The Messiah’s sonship to David was a common expectation, rooted in God’s promise."
    },
    {
      "pk": 222043,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 43,
      "text": "He said to them, \"How is it then that David, in the Spirit, calls him Lord, saying,",
      "links": "<a href='/AIV/19/110/1'>Psalm 110:1</a>",
      "comment": "Jesus cites Psalm 110, considered a prophecy concerning the Messiah’s greater-than-David status. The Holy Spirit is source of true interpretation."
    },
    {
      "pk": 222044,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 44,
      "text": "\"‘The Lord said to my Lord, Sit at my right hand, until I put your enemies under your feet’?\"",
      "links": "<a href='/AIV/19/110/1'>Psalm 110:1</a>; <a href='/AIV/58/1/13'>Hebrews 1:13</a>",
      "comment": "The Messiah is more than a human descendent: He is David’s Lord—echoes of Christ’s divinity and heavenly kingship."
    },
    {
      "pk": 222045,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 45,
      "text": "If then David calls him Lord, how is he his son?\"",
      "links": "",
      "comment": "Asking forces his hearers to consider the Messiah’s heavenly origin and superior dignity to David."
    },
    {
      "pk": 222046,
      "translation": "AIV",
      "book": 40,
      "chapter": 22,
      "verse": 46,
      "text": "And no one was able to answer him a word, nor did anyone dare to ask him any more questions from that day on.",
      "links": "",
      "comment": "Jesus’ authority and wisdom silence His opponents; the Messiah is revealed as both son of David and divine Lord—the fullness of revelation. The interplay between scripture, tradition, and Jesus’ interpretations points ahead to the continuous role of the Church in illuminating the meaning of Christ."
    }
  ],
  "translatedAt": "2025-12-23T02:16:56.618Z"
}