{
  "book": "Matthew",
  "bookAbbreviation": "Matt",
  "chapter": 2,
  "verses": [
    {
      "pk": 4002001,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 1,
      "text": "After Jesus was born in Bethlehem of Judea in the days of King Herod, wise men from the east came to Jerusalem,",
      "links": "<a href='/AIV/33/5/2'>Micah 5:2</a>; <a href='/AIV/40/1/18-25'>Matt. 1:18–25</a>",
      "comment": "Bethlehem's mention ties Jesus to David's birthplace, fulfilling prophecy (Micah 5:2) and establishing Him as the long-awaited Messiah."
    },
    {
      "pk": 4002002,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 2,
      "text": "saying, 'Where is He who has been born king of the Jews? For we saw His star when it rose and have come to worship Him.'",
      "links": "<a href='/AIV/4/24/17'>Num. 24:17</a>; <a href='/AIV/19/72/10-11'>Ps. 72:10–11</a>",
      "comment": "The wise men seek to worship, recognizing Jesus' kingship—even as Gentiles. The star recalls Numbers 24:17, hinting at divine signs marking the Messiah's arrival."
    },
    {
      "pk": 4002003,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 3,
      "text": "When King Herod heard this, he was troubled, and all Jerusalem with him.",
      "links": "<a href='/AIV/40/21/10'>Matt. 21:10</a>",
      "comment": "Herod’s anxiety exposes a contrast between earthly kingship and Jesus’ spiritual kingship."
    },
    {
      "pk": 4002004,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 4,
      "text": "So he assembled all the chief priests and scribes of the people, and he inquired of them where the Christ was to be born.",
      "links": "<a href='/AIV/40/22/34-40'>Matt. 22:34–40</a>; <a href='/AIV/43/7/42'>John 7:42</a>",
      "comment": "The chief priests and scribes are consulted as authoritative interpreters of Scripture, hinting at the necessity of teaching authority in matters of faith."
    },
    {
      "pk": 4002005,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 5,
      "text": "They said to him, 'In Bethlehem of Judea, for so it is written by the prophet:",
      "links": "<a href='/AIV/33/5/2'>Micah 5:2</a>",
      "comment": "Direct quotation of Old Testament prophecy underlines fulfillment found in Jesus."
    },
    {
      "pk": 4002006,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 6,
      "text": "'And you, Bethlehem, in the land of Judah, are by no means least among the rulers of Judah; for from you shall come a ruler who will shepherd my people Israel.'",
      "links": "<a href='/AIV/33/5/2'>Micah 5:2</a>; <a href='/AIV/26/34/23'>Ezek. 34:23</a>",
      "comment": "Jesus as the shepherd evokes messianic leadership, a spiritual rather than political kingship."
    },
    {
      "pk": 4002007,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 7,
      "text": "Then Herod secretly called the wise men and learned from them the exact time the star appeared.",
      "links": "<a href='/AIV/40/2/16'>Matt. 2:16</a>",
      "comment": "Herod’s secrecy signals his intent to misuse revelation, unlike the Magi’s genuine search."
    },
    {
      "pk": 4002008,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 8,
      "text": "He sent them to Bethlehem, saying, 'Go and search carefully for the child. When you have found Him, bring me word, so that I too may come and worship Him.'",
      "links": "<a href='/AIV/40/2/13'>Matt. 2:13</a>",
      "comment": "Herod feigns desire to worship, revealing duplicity versus the sincerity of the Magi."
    },
    {
      "pk": 4002009,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 9,
      "text": "After hearing the king, they went on their way. And behold, the star they had seen when it rose went before them until it stopped over the place where the child was.",
      "links": "<a href='/AIV/40/2/2'>Matt. 2:2</a>",
      "comment": "Divine guidance is at work, confirming Jesus’ special status."
    },
    {
      "pk": 4002010,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 10,
      "text": "When they saw the star, they rejoiced with exceedingly great joy.",
      "links": "<a href='/AIV/19/67/4'>Ps. 67:4</a>",
      "comment": "The Magi’s joy prefigures the universal call to worship Christ."
    },
    {
      "pk": 4002011,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 11,
      "text": "And entering the house, they saw the child with Mary His mother, and they fell down and worshiped Him. Then, opening their treasures, they offered Him gifts of gold, frankincense, and myrrh.",
      "links": "<a href='/AIV/19/72/10-15'>Ps. 72:10–15</a>; <a href='/AIV/23/60/6'>Isa. 60:6</a>",
      "comment": "Their adoration before Jesus and His mother signals the reverence given to Christ in the presence of Mary and recalls prophetic gifts to the Messiah. Emphasizes Jesus' divinity by accepting worship."
    },
    {
      "pk": 4002012,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 12,
      "text": "And being warned in a dream not to return to Herod, they departed to their own country by another way.",
      "links": "<a href='/AIV/40/1/20'>Matt. 1:20</a>",
      "comment": "Divine revelation guides the Magi’s actions, revealing God’s active protection of Jesus."
    },
    {
      "pk": 4002013,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 13,
      "text": "Now after they had gone, behold, an angel of the Lord appeared to Joseph in a dream and said, 'Rise, take the child and His mother, flee to Egypt, and remain there until I tell you, for Herod is about to search for the child to destroy Him.'",
      "links": "<a href='/AIV/28/11/1'>Hos. 11:1</a>; <a href='/AIV/40/1/20'>Matt. 1:20</a>",
      "comment": "Joseph's obedience in taking Jesus and Mary echoes the Old Testament journeys to Egypt, linking Jesus’ story with Israel’s history. The role of dreams again shows God's supernatural direction."
    },
    {
      "pk": 4002014,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 14,
      "text": "So Joseph rose and took the child and His mother by night and departed for Egypt,",
      "links": "<a href='/AIV/28/11/1'>Hos. 11:1</a>; <a href='/AIV/2/12/41'>Exod. 12:41</a>",
      "comment": "Key emphasis is on prompt, obedient action and on the unity of the Holy Family."
    },
    {
      "pk": 4002015,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 15,
      "text": "and remained there until the death of Herod. This was to fulfill what the Lord had spoken by the prophet, 'Out of Egypt I called my Son.'",
      "links": "<a href='/AIV/28/11/1'>Hos. 11:1</a>",
      "comment": "This crucial typological fulfillment presents Jesus as the true Israel, God's Son, who brings the nation’s history to completion in Himself."
    },
    {
      "pk": 4002016,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 16,
      "text": "When Herod realized that he had been deceived by the wise men, he became furious, and he sent and killed all the male children in Bethlehem and all that region who were two years old or under, according to the time which he had determined from the wise men.",
      "links": "<a href='/AIV/2/1/16'>Exod. 1:16</a>; <a href='/AIV/24/31/15'>Jer. 31:15</a>",
      "comment": "Herod’s slaughter recalls Pharaoh’s killing of Israelite children (Exodus 1:16), underlining Jesus as a new and greater deliverer. The innocent martyrs here prefigure the cost of following Jesus' path."
    },
    {
      "pk": 4002017,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 17,
      "text": "Then was fulfilled what was spoken by the prophet Jeremiah:",
      "links": "<a href='/AIV/24/31/15'>Jer. 31:15</a>",
      "comment": "Citation of prophecy shows God’s plan being worked out in salvation history."
    },
    {
      "pk": 4002018,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 18,
      "text": "'A voice was heard in Ramah, weeping and great mourning, Rachel weeping for her children; she refused to be comforted, because they are no more.'",
      "links": "<a href='/AIV/24/31/15'>Jer. 31:15</a>",
      "comment": "The lament is both literal and symbolic, connecting Old Testament sorrow to redemptive hope realized in Jesus."
    },
    {
      "pk": 4002019,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 19,
      "text": "But when Herod died, behold, an angel of the Lord appeared in a dream to Joseph in Egypt,",
      "links": "<a href='/AIV/40/1/20'>Matt. 1:20</a>; <a href='/AIV/40/2/13'>Matt. 2:13</a>",
      "comment": "God’s special guidance of Joseph continues, reinforcing Mary and Joseph as active, obedient instruments in God’s plan."
    },
    {
      "pk": 4002020,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 20,
      "text": "saying, 'Rise, take the child and His mother, and go to the land of Israel, for those who sought the child's life are dead.'",
      "links": "<a href='/AIV/2/4/19'>Exod. 4:19</a>; <a href='/AIV/40/2/13'>Matt. 2:13</a>",
      "comment": "Mirrors Moses’ return from Egypt, further portraying Jesus as fulfilling the pattern of a new Exodus."
    },
    {
      "pk": 4002021,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 21,
      "text": "So he rose and took the child and His mother, and went to the land of Israel.",
      "links": "<a href='/AIV/2/4/19-20'>Exod. 4:19–20</a>",
      "comment": "Joseph’s careful obedience continues, showing faith’s practical outworking in the Holy Family."
    },
    {
      "pk": 4002022,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 22,
      "text": "But when he heard that Archelaus was reigning over Judea in place of his father Herod, he was afraid to go there, and being warned in a dream, he withdrew to the region of Galilee.",
      "links": "<a href='/AIV/40/2/12'>Matt. 2:12</a>; <a href='/AIV/40/2/19'>Matt. 2:19</a>",
      "comment": "God’s ongoing communication in dreams shows His providence and the Holy Family’s receptiveness to His will."
    },
    {
      "pk": 4002023,
      "translation": "AIV",
      "book": 1,
      "chapter": 2,
      "verse": 23,
      "text": "And he went and lived in a city called Nazareth, so that what was spoken by the prophets might be fulfilled, that He would be called a Nazarene.",
      "links": "<a href='/AIV/13/6/24-27'>Judg. 13:5</a>; <a href='/AIV/11/4/1'>2 Kgs. 4:1</a>",
      "comment": "Nazareth’s obscurity speaks to the humility of Christ’s earthly beginnings, a theme carried through His ministry. The prophetic motif recurs, stressing how Jesus uniquely fulfills God's plan, in both explicit and implicit Old Testament promises."
    }
  ],
  "translatedAt": "2025-12-23T02:09:24.004Z"
}