{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 30,
  "verses": [
    {
      "pk": 4030001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 1,
      "text": "Moses spoke to the leaders of the tribes of Israel, saying, \"This is what the Lord has commanded:",
      "links": "<a href='/AIV/3/27/34'>Lev. 27:34</a>; <a href='/AIV/5/23/21'>Deut. 23:21'</a>",
      "comment": "This introductory verse establishes Moses as the speaker to the tribal leaders, reinforcing the importance of hierarchical leadership, which foreshadows the continuity of authoritative guidance in God's people."
    },
    {
      "pk": 4030002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 2,
      "text": "\"If a man makes a vow to the Lord or swears an oath to bind himself by a pledge, he must not break his word; he must do all that has come out of his mouth.\"",
      "links": "<a href='/AIV/5/23/21'>Deut. 23:21</a>; <a href='/AIV/19/15/4'>Ps. 15:4</a>",
      "comment": "The divine expectation of integrity in promises made to God points to the high standard for covenant faithfulness, prefiguring Christ’s fulfillment of all vows and oaths (cf. Matt. 5:33–37)."
    },
    {
      "pk": 4030003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 3,
      "text": "\"If a woman makes a vow to the Lord and binds herself by a pledge while living in her father's house in her youth,",
      "links": "<a href='/AIV/7/11/30'>Judg. 11:30-31</a>",
      "comment": "Here, vows made by women are subject to familial authority, reflecting a principle of spiritual headship that finds fulfillment in the New Testament in spiritual oversight (cf. Eph. 5:22–24)."
    },
    {
      "pk": 4030004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 4,
      "text": "and her father hears her vow and pledge she has bound upon herself, yet keeps silent, then all her vows will stand, and every pledge she has bound herself to will stand.",
      "links": "<a href='/AIV/8/1/11'>Ruth 1:11</a>",
      "comment": "The silence of the father is construed as acceptance, reinforcing the principle that authority can affirm spiritual decisions, suggesting the wisdom of discerning spiritual vows in community."
    },
    {
      "pk": 4030005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 5,
      "text": "But if her father opposes her on the day he hears, none of her vows or pledges she has bound upon herself shall stand. The Lord will forgive her, because her father has opposed her.",
      "links": "<a href='/AIV/5/5/31'>Num. 5:31</a>",
      "comment": "Parental authority is seen as a protective measure. It's notable that spiritual commitments can be subject to the wisdom of elders, hinting at the need for spiritual guidance and orderly discernment in vows."
    },
    {
      "pk": 4030006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 6,
      "text": "\"If she marries while her vows or rash promises are upon her,",
      "links": "<a href='/AIV/5/5/29'>Num. 5:29</a>; <a href='/AIV/19/56/12'>Ps. 56:12</a>",
      "comment": "Marriage entails a change in spiritual authority structure, echoing the idea that spiritual obligations can be overseen by appointed guardians within the faith community."
    },
    {
      "pk": 4030007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 7,
      "text": "and her husband hears her vows and pledge she has bound upon herself, and he keeps silent on the day he hears, then her vows will stand and the pledges she has bound herself to will stand.",
      "links": "<a href='/AIV/5/5/6'>Num. 5:6</a>",
      "comment": "The power of affirmation through the silence of the husband mirrors the father’s role, underlining the scriptural emphasis on an authoritative stewardship and unity in spiritual matters."
    },
    {
      "pk": 4030008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 8,
      "text": "But if, when he hears, her husband opposes her, then he makes her vow or rash pledge she has bound upon herself null and void. The Lord will forgive her.",
      "links": "<a href='/AIV/19/103/10-12'>Ps. 103:10-12</a>",
      "comment": "Forgiveness is available where appropriate authority overrules, reflecting the merciful nature of God and suggesting a spiritual principle of accountability and absolution through proper channels."
    },
    {
      "pk": 4030009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 9,
      "text": "\"But any vow of a widow or a divorced woman, which she has bound upon herself, stands against her.",
      "links": "<a href='/AIV/5/24/1'>Deut. 24:1</a>; <a href='/AIV/19/41/1-2'>Ps. 41:1-2</a>",
      "comment": "When women are no longer under male family authority, their personal spiritual obligations are binding, emphasizing individual responsibility and the dignity of personal vocation."
    },
    {
      "pk": 4030010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 10,
      "text": "\"If a woman in her husband's house makes a vow or binds herself by a pledge with an oath,",
      "links": "<a href='/AIV/5/5/19'>Num. 5:19</a>",
      "comment": "This scenario reiterates the pattern of authority through marriage, showing the enduring nature of the faith community's structure and respect for spiritual order."
    },
    {
      "pk": 4030011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 11,
      "text": "if her husband hears it and keeps silent, and does not oppose her, all her vows and each pledge she has bound herself to will stand.",
      "links": "<a href='/AIV/5/5/20'>Num. 5:20</a>",
      "comment": "Silence is equivalent to consent, reinforcing that spiritual commitments are overseen and affirmed by proper authority—a principle later seen practiced throughout the early church."
    },
    {
      "pk": 4030012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 12,
      "text": "But if her husband clearly nullifies them on the day he hears, then whatever proceeds from her lips regarding her vows and the pledge that binds her will not stand. Her husband has made them void, and the Lord will forgive her.",
      "links": "<a href='/AIV/19/32/1-2'>Ps. 32:1-2</a>",
      "comment": "Divine forgiveness is linked to the order of authority, suggesting that spiritual commitments—especially those connected to vows and oaths—are not isolated acts, but communal and relational."
    },
    {
      "pk": 4030013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 13,
      "text": "\"Her husband may confirm or nullify any vow or any binding oath to humble herself.",
      "links": "<a href='/AIV/19/61/8'>Ps. 61:8</a>",
      "comment": "The power to confirm or nullify shows spiritual headship serving the purpose of guiding and protecting, ultimately preserving the unity of the family within God’s covenant."
    },
    {
      "pk": 4030014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 14,
      "text": "But if he keeps silent about them from day to day, then he confirms all her vows or pledges that bind her; he has confirmed them because he has not opposed her on the day he heard.",
      "links": "<a href='/AIV/19/66/13-14'>Ps. 66:13-14</a>",
      "comment": "Repeated silence equals affirmation, emphasizing the gravity of spoken and unspoken authority—a pattern that fosters trust and obedience within the believing community."
    },
    {
      "pk": 4030015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 15,
      "text": "But if he nullifies them after he has heard, then he shall bear her guilt.\"",
      "links": "<a href='/AIV/3/5/1'>Lev. 5:1</a>; <a href='/AIV/23/53/6'>Isa. 53:6</a>",
      "comment": "The transference of guilt if authority is exercised too late points toward substitutionary atonement—a principle fulfilled perfectly in Christ who bears the infirmity and guilt on behalf of others (cf. Isa. 53:6)."
    },
    {
      "pk": 4030016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 30,
      "verse": 16,
      "text": "These are the statutes that the Lord commanded Moses concerning a man and his wife, and a father and his daughter, while she is young and living in her father’s house.",
      "links": "<a href='/AIV/3/27/34'>Lev. 27:34</a>",
      "comment": "The concluding verse underlines the divinely instituted statutes for orderly spiritual life. This structure of authority and obedience within God’s people prefigures the ordered unity of the body of Christ, where vows and duties are overseen with wisdom and charity, fostering holiness and communion."
    }
  ],
  "translatedAt": "2025-12-24T01:52:03.171Z"
}