{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 27,
  "verses": [
    {
      "pk": 4027001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 1,
      "text": "Then the daughters of Zelophehad, son of Hepher, son of Gilead, son of Machir, son of Manasseh, from the clans of Manasseh, the son of Joseph, approached. The names of the daughters were: Mahlah, Noah, Hoglah, Milcah, and Tirzah.",
      "links": "<a href='/AIV/4/26/33'>Num. 26:33</a>; <a href='/AIV/6/17/3'>Josh. 17:3</a>",
      "comment": "This verse establishes the lineage of Zelophehad, connecting Manasseh to Joseph, which shows the deep roots of Israel's tribal system. The daughters' names are repeated in the census previously, reinforcing the significance of their family line."
    },
    {
      "pk": 4027002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 2,
      "text": "They stood before Moses and Eleazar the priest, and before the leaders and all the congregation, at the entrance to the Tent of Meeting, and said:",
      "links": "<a href='/AIV/2/29/42'>Ex. 29:42</a>; <a href='/AIV/4/16/19'>Num. 16:19</a>",
      "comment": "The mention of Moses and Eleazar indicates a transition in priestly authority, as Eleazar has taken the role after Aaron. The public setting suggests a judicial and communal approach to the issue, anticipating ecclesiastical structures."
    },
    {
      "pk": 4027003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 3,
      "text": "\"Our father died in the wilderness. He was not among the group who gathered against the LORD, with Korah, but he died for his own sin and had no sons.\"",
      "links": "<a href='/AIV/4/14/35'>Num. 14:35</a>; <a href='/AIV/4/16/1-35'>Num. 16:1-35</a>",
      "comment": "They clarify that their father's death was not due to rebellion, setting a precedent for mercy and justice—not collective guilt. The issue of inheritance emerges because he had no male heirs, an important point for Old Testament law."
    },
    {
      "pk": 4027004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 4,
      "text": "\"Why should the name of our father be taken away from his clan simply because he had no son? Give us a possession among our father’s brothers.\"",
      "links": "<a href='/AIV/6/17/4'>Josh. 17:4</a>; <a href='/AIV/4/36/2'>Num. 36:2</a>",
      "comment": "Their plea presses on the concept of honor and legacy. Allowing inheritance through daughters foreshadows a law that values all children, previewing greater inclusion in salvation history."
    },
    {
      "pk": 4027005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 5,
      "text": "Moses brought their case before the LORD.",
      "links": "<a href='/AIV/5/9/8'>Lev. 24:12</a>; <a href='/AIV/6/7/22'>Josh. 7:22</a>",
      "comment": "Moses acts as mediator, interceding before God—a role later fulfilled perfectly in Christ (Hebrews 7:25). The priestly mediation foreshadows the work of Christ as the eternal High Priest."
    },
    {
      "pk": 4027006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 6,
      "text": "And the LORD said to Moses:",
      "links": "<a href='/AIV/2/25/22'>Ex. 25:22</a>",
      "comment": "Direct divine instruction continues the pattern of God guiding His people through appointed leaders."
    },
    {
      "pk": 4027007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 7,
      "text": "\"What Zelophehad’s daughters are saying is right. You must certainly give them property as an inheritance among their father's brothers. Transfer their father’s inheritance to them.\"",
      "links": "<a href='/AIV/4/36/1-12'>Num. 36:1-12</a>; <a href='/AIV/6/17/3-6'>Josh. 17:3-6</a>",
      "comment": "God confirms the justice of the request, expanding the law to include women under specific circumstances. This reflects the unfolding revelation, hinting at full dignity and participation later affirmed in Christian teaching."
    },
    {
      "pk": 4027008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 8,
      "text": "\"Speak to the Israelites and say: If a man dies and has no son, then transfer his inheritance to his daughter.\"",
      "links": "<a href='/AIV/4/36/7'>Num. 36:7</a>; <a href='/AIV/4/26/33'>Num. 26:33</a>",
      "comment": "A new law is codified showing God’s concern for justice and continuity. The principle of inheritance and transmission is crucial for understanding the concept of spiritual inheritance (Gal. 3:28-29)."
    },
    {
      "pk": 4027009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 9,
      "text": "\"If he has no daughter, give his inheritance to his brothers.\"",
      "links": "<a href='/AIV/4/36/9'>Num. 36:9</a>",
      "comment": "Order is established within the clan for inheritance. This structured delegation anticipates orderly governance in the later faith community (Acts 6:1-7)."
    },
    {
      "pk": 4027010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 10,
      "text": "\"If he has no brothers, give his inheritance to his father's brothers.\"",
      "links": "<a href='/AIV/4/36/10'>Num. 36:10</a>",
      "comment": "The inclusion of extended family forms a deeper communal bond, stressing the place of kinship, shared responsibilities, and authority—a presage of the ordered community established by Christ."
    },
    {
      "pk": 4027011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 11,
      "text": "\"If the father’s brothers are not there, then give his inheritance to the nearest relative in his clan, so that the inheritance may remain among the Israelites. This shall be a legal statute for the Israelites, as the LORD commanded Moses.\"",
      "links": "<a href='/AIV/4/36/11'>Num. 36:11</a>; <a href='/AIV/3/18/8'>Lev. 18:8</a>",
      "comment": "The permanence and integrity of inheritance are protected within the people of God. Legal statutes, given through a divinely appointed leader, connect to scriptural authority, tradition, and the maintenance of spiritual legacy."
    },
    {
      "pk": 4027012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 12,
      "text": "The LORD said to Moses, \"Go up to this mountain of Abarim and look at the land which I have given to the Israelites.\"",
      "links": "<a href='/AIV/4/33/47'>Num. 33:47</a>; <a href='/AIV/5/32/49'>Deut. 32:49</a>",
      "comment": "Moses is shown the promised land but not allowed to enter, signifying leadership transition and the continual movement toward fulfillment. The mountaintop experience often symbolizes revelation and anticipation of a greater inheritance (Matt. 17:1-3)."
    },
    {
      "pk": 4027013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 13,
      "text": "\"After you have seen it, you will be gathered to your people, just as your brother Aaron was.\"",
      "links": "<a href='/AIV/4/20/24'>Num. 20:24</a>; <a href='/AIV/5/32/50'>Deut. 32:50</a>",
      "comment": "‘Gathered to your people’ expresses continuity beyond death, anticipating fellowship of the faithful and the communion of saints—a spiritual connection Christians hold in hope."
    },
    {
      "pk": 4027014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 14,
      "text": "\"For in the wilderness of Zin, during the strife of the congregation, you disobeyed my order to glorify me by the water before their eyes.\" (These were the waters of Meribah at Kadesh, in the wilderness of Zin.)",
      "links": "<a href='/AIV/4/20/12-13'>Num. 20:12-13</a>; <a href='/AIV/19/106/32'>Ps. 106:32</a>",
      "comment": "Moses is reminded of his failure to fully honor God at Meribah. Leadership demands obedience and humility—principles pivotal in any apostolic tradition and spiritual authority."
    },
    {
      "pk": 4027015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 15,
      "text": "Then Moses spoke to the LORD, saying:",
      "links": "<a href='/AIV/2/33/12'>Ex. 33:12</a>; <a href='/AIV/4/12/13'>Num. 12:13</a>",
      "comment": "Moses prays for the succession of leadership, showing that leadership is divinely appointed and must be prayerfully sought."
    },
    {
      "pk": 4027016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 16,
      "text": "\"Let the LORD, the God of the spirits of all flesh, appoint a man over the congregation,\"",
      "links": "<a href='/AIV/4/16/22'>Num. 16:22</a>; <a href='/AIV/5/3/18'>Deut. 3:18</a>",
      "comment": "God’s sovereignty over humanity is affirmed. The request that God appoint a leader foreshadows the notion of succession and divinely instituted authority (Acts 1:24-26)."
    },
    {
      "pk": 4027017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 17,
      "text": "\"Who will go out before them and come in before them, and who will lead them out and bring them in; so that the congregation of the LORD may not be like sheep that have no shepherd.\"",
      "links": "<a href='/AIV/26/34/23'>Ezek. 34:23</a>; <a href='/AIV/43/10/11'>John 10:11</a>",
      "comment": "Moses expresses the need for a shepherd over Israel, anticipating Christ, the Good Shepherd (John 10:11). Good order and guidance are essential for God’s people."
    },
    {
      "pk": 4027018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 18,
      "text": "So the LORD said to Moses, \"Take Joshua son of Nun, a man in whom is the spirit, and lay your hand on him.\"",
      "links": "<a href='/AIV/6/1/1'>Josh. 1:1</a>; <a href='/AIV/54/4/14'>1 Tim. 4:14</a>",
      "comment": "Laying on of hands signifies the rite of commissioning and spiritual authority, a clear type of sacramental ordination. Joshua is filled with the Spirit, a model for Spirit-led leaders (Acts 6:6)."
    },
    {
      "pk": 4027019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 19,
      "text": "\"Have him stand before Eleazar the priest and the whole congregation, and commission him in their sight.\"",
      "links": "<a href='/AIV/6/1/1-9'>Josh. 1:1-9</a>; <a href='/AIV/54/5/22'>1 Tim. 5:22</a>",
      "comment": "Public commissioning preserves transparency and unity. The church later preserves such apostolic succession through orderly rite—a mark of spiritual continuity (2 Tim. 2:2)."
    },
    {
      "pk": 4027020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 20,
      "text": "\"Give some of your authority to him, so that all the congregation of the Israelites may obey him.\"",
      "links": "<a href='/AIV/6/4/14'>Josh. 4:14</a>; <a href='/AIV/54/4/14'>1 Tim. 4:14</a>",
      "comment": "Power and office are transferred through appointed means, emphasizing visible leadership. This foreshadows how grace and authority are conferred in the new covenant community."
    },
    {
      "pk": 4027021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 21,
      "text": "\"He is to stand before Eleazar the priest, who will inquire for him by the judgment of the Urim before the LORD. At his command they shall go out, and at his command they shall come in, he and all the Israelites with him, even the whole congregation.\"",
      "links": "<a href='/AIV/3/8/8'>Lev. 8:8</a>; <a href='/AIV/6/9/14'>Josh. 9:14</a>",
      "comment": "This connects spiritual leadership with sacramental mediation through priesthood and divinely instituted rites, such as the Urim. Discernment is always exercised in community and in communion with God’s appointed leaders."
    },
    {
      "pk": 4027022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 22,
      "text": "Moses did as the LORD commanded him. He took Joshua and made him stand before Eleazar the priest and the entire congregation.",
      "links": "<a href='/AIV/6/1/1-9'>Josh. 1:1-9</a>; <a href='/AIV/4/20/27'>Num. 20:27</a>",
      "comment": "Obedience to God brings order and blessing. The gathering of the whole congregation for this ceremony shows the community’s unity under divinely appointed leadership."
    },
    {
      "pk": 4027023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 27,
      "verse": 23,
      "text": "He laid his hands on him and commissioned him, just as the LORD had spoken through Moses.",
      "links": "<a href='/AIV/5/34/9'>Deut. 34:9</a>; <a href='/AIV/54/4/14'>1 Tim. 4:14</a>",
      "comment": "The transmission of authority through laying on of hands is an enduring example for the faith community. This gesture signifies passing on office and Spirit for ordered leadership—a principle continued in the apostolic and episcopal succession."
    }
  ],
  "translatedAt": "2025-12-24T01:50:23.500Z"
}