{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 16,
  "verses": [
    {
      "pk": 4016001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 1,
      "text": "Now Korah, the son of Izhar, son of Kohath, son of Levi, and Dathan and Abiram, sons of Eliab, and On, the son of Peleth, sons of Reuben, took action.",
      "links": "<a href='/AIV/04/26/9-11'>Num. 26:9-11</a>; <a href='/AIV/20/20/3'>Prov. 20:3</a>",
      "comment": "Notice Korah’s lineage from Levi; this plays into the theme of priestly authority established already in Leviticus. The inclusion of Reubenites signals the dangerous spread of rebellion through the tribes."
    },
    {
      "pk": 4016002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 2,
      "text": "They rose up before Moses, along with two hundred and fifty men of the people of Israel, chiefs of the congregation, chosen from the assembly, men of renown.",
      "links": "<a href='/AIV/02/18/25'>Ex. 18:25</a>; <a href='/AIV/04/1/16'>Num. 1:16</a>",
      "comment": "Here the narrative highlights organized opposition, not just from outsiders but from renowned leaders themselves. This opposition challenging divinely given structure will have consequences."
    },
    {
      "pk": 4016003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 3,
      "text": "They assembled together against Moses and against Aaron and said to them: 'You have gone too far! For all the congregation is holy, every one of them, and the LORD is among them. Why then do you exalt yourselves above the assembly of the LORD?'",
      "links": "<a href='/AIV/02/19/6'>Ex. 19:6</a>; <a href='/AIV/46/1/26'>1 Cor. 1:26</a>",
      "comment": "Korah's accusation reflects a misunderstanding of the Lord’s order, as God chooses specific leaders for roles. There is an echo here with later challenges to ecclesiastical hierarchy. The claim that 'all are holy' is used to deny the necessity of distinct leadership."
    },
    {
      "pk": 4016004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 4,
      "text": "When Moses heard this, he fell on his face.",
      "links": "<a href='/AIV/04/14/5'>Num. 14:5</a>; <a href='/AIV/04/20/6'>Num. 20:6</a>",
      "comment": "The response of humility by Moses underlines the proper response to opposition: rather than defend himself, he turns to God. This foreshadows Christ’s humility in the face of accusation."
    },
    {
      "pk": 4016005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 5,
      "text": "He spoke to Korah and all his company, saying, 'In the morning the LORD will show who is his, and who is holy, and will bring him near to him; the one whom he chooses he will bring near to him.'",
      "links": "<a href='/AIV/04/17/5'>Num. 17:5</a>; <a href='/AIV/55/2/19'>2 Tim. 2:19</a>",
      "comment": "Moses reveals the principle of divine choice—the LORD alone appoints those who serve Him in a special way. This prefigures the selection of apostles by Jesus Himself (cf. John 15:16)."
    },
    {
      "pk": 4016006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 6,
      "text": "'Do this: Take censers, Korah and all his company,'",
      "links": "<a href='/AIV/03/10/1'>Lev. 10:1</a>; <a href='/AIV/66/8/3'>Rev. 8:3</a>",
      "comment": "The use of censers connects to ritual worship, reinforcing that only those truly called may approach God’s altar, as seen also with Nadab and Abihu (Lev. 10:1)."
    },
    {
      "pk": 4016007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 7,
      "text": "'Put fire in them and put incense on them before the LORD tomorrow, and the man whom the LORD chooses shall be holy. You have gone too far, sons of Levi!'",
      "links": "<a href='/AIV/04/16/35'>Num. 16:35</a>; <a href='/AIV/58/5/4'>Heb. 5:4</a>",
      "comment": "Who may offer incense is determined by God. Spiritual authority is a matter of divine, not popular, selection—a lesson for the nature of true Church leadership."
    },
    {
      "pk": 4016008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 8,
      "text": "Then Moses said to Korah, 'Hear now, you sons of Levi,",
      "links": "<a href='/AIV/02/16/2'>Ex. 16:2</a>",
      "comment": "Moses appeals directly to the Levites, calling them to recognize their privileged role, similar to the later calling of bishops in the new covenant."
    },
    {
      "pk": 4016009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 9,
      "text": "'Is it too little for you that the God of Israel has separated you from the congregation of Israel, to bring you near to himself to do the service of the tabernacle of the LORD, and to stand before the congregation to minister to them?'",
      "links": "<a href='/AIV/04/3/6-10'>Num. 3:6-10</a>; <a href='/AIV/04/8/14-19'>Num. 8:14-19</a>",
      "comment": "Being set apart for priestly ministry is a sacred privilege. Seeking more than what God has assigned reflects pride and leads to division."
    },
    {
      "pk": 4016010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 10,
      "text": "'And that he has brought you near, and all your brothers, the sons of Levi, with you? And do you seek the priesthood also?'",
      "links": "<a href='/AIV/58/5/4'>Heb. 5:4</a>",
      "comment": "Moses points out the error of aspiring to the priesthood without being called. In the new covenant, ministerial calling is also not self-appointed but conferred through proper succession."
    },
    {
      "pk": 4016011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 11,
      "text": "'Therefore it is against the LORD that you and all your company have gathered together. What is Aaron that you grumble against him?'",
      "links": "<a href='/AIV/04/12/8'>Num. 12:8</a>; <a href='/AIV/42/10/16'>Luke 10:16</a>",
      "comment": "Opposing God’s appointed leader is the same as opposing God Himself, just as Jesus later taught regarding the apostles."
    },
    {
      "pk": 4016012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 12,
      "text": "Then Moses sent to call Dathan and Abiram, the sons of Eliab, but they said, 'We will not come up.'",
      "links": "<a href='/AIV/04/14/4'>Num. 14:4</a>",
      "comment": "A refusal to come before God’s mediator reveals hardened hearts, a theme reappearing in later Israelite history."
    },
    {
      "pk": 4016013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 13,
      "text": "'Is it a small thing that you have brought us up out of a land flowing with milk and honey, to kill us in the wilderness, that you must also make yourself a prince over us?'",
      "links": "<a href='/AIV/02/16/3'>Ex. 16:3</a>; <a href='/AIV/04/14/2'>Num. 14:2</a>",
      "comment": "This accusation distorts the truth. Egypt is sarcastically called a land of 'milk and honey,' showing ingratitude for God's real deliverance—a temptation common in all generations."
    },
    {
      "pk": 4016014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 14,
      "text": "'Moreover, you have not brought us into a land flowing with milk and honey, nor given us inheritance of fields and vineyards. Will you put out the eyes of these men? We will not come up.'",
      "links": "<a href='/AIV/04/20/5'>Num. 20:5</a>; <a href='/AIV/15/9/12'>Ezra 9:12</a>",
      "comment": "Dathan and Abiram’s demands for material promises reflect a faith grounded in physical blessings, not in trusting God’s plan."
    },
    {
      "pk": 4016015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 15,
      "text": "Moses was very angry and said to the LORD, 'Do not respect their offering! I have not taken one donkey from them, nor have I done harm to any of them.'",
      "links": "<a href='/AIV/09/12/3'>1 Sam. 12:3</a>",
      "comment": "Moses defends his integrity, echoing Samuel’s similar defense later. True elders should be blameless in service."
    },
    {
      "pk": 4016016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 16,
      "text": "And Moses said to Korah, 'You and all your company, be present before the LORD, you and they, and Aaron, tomorrow.'",
      "links": "<a href='/AIV/04/16/6-7'>Num. 16:6-7</a>",
      "comment": "The LORD Himself will judge the dispute through an objective test—reflecting the importance of divine confirmation of leadership."
    },
    {
      "pk": 4016017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 17,
      "text": "'And let every one take his censer and put incense on it, each of you brings before the LORD his censer, two hundred and fifty censers; you also, and Aaron, each his censer.'",
      "links": "<a href='/AIV/03/10/1-2'>Lev. 10:1-2</a>",
      "comment": "Those who illegitimately seek the priesthood are exposed through their offering. This hints at later discipline in the early Church for false teaching."
    },
    {
      "pk": 4016018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 18,
      "text": "So every man took his censer, put fire in them, and laid incense on them, and stood at the entrance of the tent of meeting with Moses and Aaron.",
      "links": "<a href='/AIV/04/16/35'>Num. 16:35</a>",
      "comment": "This public challenge before the sanctuary is a dramatic moment, anticipating divine judgment."
    },
    {
      "pk": 4016019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 19,
      "text": "Korah assembled all the congregation against them at the entrance of the tent of meeting. And the glory of the LORD appeared to all the congregation.",
      "links": "<a href='/AIV/03/9/23'>Lev. 9:23</a>; <a href='/AIV/04/14/10'>Num. 14:10</a>",
      "comment": "The visible manifestation of God’s presence parallels events at Sinai, reminding Israel that God Himself is the true judge."
    },
    {
      "pk": 4016020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 20,
      "text": "And the LORD spoke to Moses and to Aaron, saying,",
      "links": "<a href='/AIV/04/14/26-27'>Num. 14:26-27</a>",
      "comment": "Direct communication shows continued validation of Moses and Aaron’s authority by God."
    },
    {
      "pk": 4016021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 21,
      "text": "'Separate yourselves from among this congregation, that I may consume them in a moment.'",
      "links": "<a href='/AIV/02/32/10'>Ex. 32:10</a>; <a href='/AIV/04/14/12'>Num. 14:12</a>",
      "comment": "God’s threat recalls the earlier golden calf incident (Ex. 32:10). Divine wrath is restrained regularly through mediatorship."
    },
    {
      "pk": 4016022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 22,
      "text": "Then they fell on their faces and said, 'O God, the God of the spirits of all flesh, shall one man sin, and will you be angry with all the congregation?'",
      "links": "<a href='/AIV/04/27/16'>Num. 27:16</a>; <a href='/AIV/01/18/23-32'>Gen. 18:23-32</a>",
      "comment": "Moses and Aaron act as intercessors, foreshadowing Christ’s mediatorship for His people. Their prayer restrains God’s wrath."
    },
    {
      "pk": 4016023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 23,
      "text": "And the LORD spoke to Moses, saying,",
      "links": "<a href='/AIV/04/14/20'>Num. 14:20</a>",
      "comment": "God listens to the intercessor, again affirming the mediation role established through the chosen leadership."
    },
    {
      "pk": 4016024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 24,
      "text": "'Say to the congregation, \"Get away from the dwelling of Korah, Dathan, and Abiram.\"'",
      "links": "<a href='/AIV/04/16/26'>Num. 16:26</a>; <a href='/AIV/66/18/4'>Rev. 18:4</a>",
      "comment": "Separation from sin preserves the congregation; later, Christians are likewise called to separate from persistent rebellion and heresy."
    },
    {
      "pk": 4016025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 25,
      "text": "Then Moses rose and went to Dathan and Abiram, and the elders of Israel followed him.",
      "links": "<a href='/AIV/02/3/16'>Ex. 3:16</a>",
      "comment": "Moses approaches with the elders, showing the gravity of communal, not merely individual, sin and its consequences."
    },
    {
      "pk": 4016026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 26,
      "text": "And he spoke to the congregation, saying, 'Depart, please, from the tents of these wicked men, and touch nothing of theirs, lest you be swept away with all their sins.'",
      "links": "<a href='/AIV/04/16/24'>Num. 16:24</a>; <a href='/AIV/66/18/4'>Rev. 18:4</a>",
      "comment": "Purity requires distance from persistent rebellion. Touching the accursed means sharing their fate."
    },
    {
      "pk": 4016027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 27,
      "text": "So they got away from the dwelling of Korah, Dathan, and Abiram. And Dathan and Abiram came out and stood at the door of their tents, with their wives, their sons, and their little ones.",
      "links": "<a href='/AIV/06/7/24-25'>Josh. 7:24-25</a>",
      "comment": "The involvement of entire households reminds us that actions of leaders affect even the innocent—echoing biblical principles on generational consequence."
    },
    {
      "pk": 4016028,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 28,
      "text": "And Moses said, 'By this you shall know that the LORD has sent me to do all these works, and that it has not been of my own accord.'",
      "links": "<a href='/AIV/43/5/36'>John 5:36</a>",
      "comment": "Moses clarifies his authority is divinely appointed, not self-assumed—a necessary element of true spiritual leadership."
    },
    {
      "pk": 4016029,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 29,
      "text": "'If these men die as all men die, or if they are visited by the fate of all mankind, then the LORD has not sent me.'",
      "links": "<a href='/AIV/04/14/37'>Num. 14:37</a>",
      "comment": "Moses calls for a supernatural sign. This kind of test occurs throughout Scripture to validate true prophets over against false."
    },
    {
      "pk": 4016030,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 30,
      "text": "'But if the LORD creates something new, and the ground opens its mouth and swallows them up with all that belongs to them, and they go down alive into Sheol, then you shall know that these men have despised the LORD.'",
      "links": "<a href='/AIV/04/26/10'>Num. 26:10</a>; <a href='/AIV/19/55/15'>Ps. 55:15</a>",
      "comment": "Such a miraculous judgment proves God’s choice of Moses’ leadership and warns against despising God’s plan for spiritual order."
    },
    {
      "pk": 4016031,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 31,
      "text": "And as soon as he finished speaking all these words, the ground that was under them split open.",
      "links": "<a href='/AIV/04/16/32-33'>Num. 16:32-33</a>",
      "comment": "God’s instantaneous response leaves no doubt about His will."
    },
    {
      "pk": 4016032,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 32,
      "text": "The earth opened its mouth and swallowed them up, with their households and all the people who belonged to Korah and all their goods.",
      "links": "<a href='/AIV/19/106/17'>Ps. 106:17</a>",
      "comment": "The fate of Korah and his followers is cited elsewhere as a warning—a pivotal example for later generations on the consequences of divisive rebellion."
    },
    {
      "pk": 4016033,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 33,
      "text": "So they and all that belonged to them went down alive into Sheol, and the earth closed over them, and they perished from the midst of the assembly.",
      "links": "<a href='/AIV/19/55/15'>Ps. 55:15</a>; <a href='/AIV/06/7/26'>Josh. 7:26</a>",
      "comment": "Physical destruction here pointed to a greater spiritual reality: separation from the community as a result of grave sin."
    },
    {
      "pk": 4016034,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 34,
      "text": "And all Israel who were around them fled at their cry, for they said, 'Lest the earth swallow us up also!'",
      "links": "<a href='/AIV/04/17/12'>Num. 17:12</a>",
      "comment": "God’s judgments instill holy fear, seen again in the judgments in Acts 5:5-11 with Ananias and Sapphira."
    },
    {
      "pk": 4016035,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 35,
      "text": "And fire came out from the LORD and consumed the two hundred and fifty men offering the incense.",
      "links": "<a href='/AIV/03/10/2'>Lev. 10:2</a>; <a href='/AIV/19/106/18'>Ps. 106:18</a>",
      "comment": "Improper approach to God’s altar brings destruction. Only those appointed by God can lawfully perform such ministry, highlighting apostolic succession and the dangers of self-appointed leadership."
    },
    {
      "pk": 4016036,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 36,
      "text": "Then the LORD spoke to Moses, saying,",
      "links": "<a href='/AIV/04/16/23'>Num. 16:23</a>",
      "comment": "The continued communication between God and Moses highlights his role as chosen intercessor."
    },
    {
      "pk": 4016037,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 37,
      "text": "'Tell Eleazar the son of Aaron the priest to take up the censers out of the burning, and scatter the fire far away, for they have become holy.'",
      "links": "<a href='/AIV/04/4/16'>Num. 4:16</a>",
      "comment": "The censers, though misused, were sanctified by being offered to God—objects set apart for worship must be treated as sacred, even if offered in rebellion."
    },
    {
      "pk": 4016038,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 38,
      "text": "'As for the censers of these men who sinned at the cost of their lives, let them be hammered into plates as a covering for the altar, for they offered them before the LORD and they became holy. Thus they shall be a sign to the people of Israel.'",
      "links": "<a href='/AIV/04/17/10'>Num. 17:10</a>; <a href='/AIV/19/19/9'>Ps. 19:9</a>",
      "comment": "The transformed censers become a memorial against improper ministry—a visible warning tied to the altar’s sanctity."
    },
    {
      "pk": 4016039,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 39,
      "text": "So Eleazar the priest took the bronze censers which those who were burned had offered, and they were hammered out as a covering for the altar.",
      "links": "<a href='/AIV/04/16/38'>Num. 16:38</a>",
      "comment": "A physical memorial—liturgical reminders are important as visible teaching for the assembly."
    },
    {
      "pk": 4016040,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 40,
      "text": "To be a reminder to the people of Israel, so that no one outside the offspring of Aaron should approach to burn incense before the LORD, lest he become like Korah and his company—as the LORD said to him through Moses.",
      "links": "<a href='/AIV/58/5/4'>Heb. 5:4</a>; <a href='/AIV/04/18/7'>Num. 18:7</a>",
      "comment": "This verse underlines the necessity for legitimate priestly succession and the dangers of ignoring divinely established order."
    },
    {
      "pk": 4016041,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 41,
      "text": "But on the next day all the congregation of the people of Israel grumbled against Moses and against Aaron, saying, 'You have killed the people of the LORD.'",
      "links": "<a href='/AIV/04/14/2'>Num. 14:2</a>; <a href='/AIV/43/8/44'>John 8:44</a>",
      "comment": "The people’s persistent murmuring shows the human tendency to scapegoat leaders for consequences of sin—a pattern continued in the rejection of Christ and His apostles."
    },
    {
      "pk": 4016042,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 42,
      "text": "And when the congregation had assembled against Moses and against Aaron, they turned toward the tent of meeting. And behold, the cloud covered it, and the glory of the LORD appeared.",
      "links": "<a href='/AIV/03/9/23'>Lev. 9:23</a>",
      "comment": "The cloud represents God’s presence, which still abides with Moses and Aaron, confirming their role even amidst popular rejection."
    },
    {
      "pk": 4016043,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 43,
      "text": "And Moses and Aaron came to the front of the tent of meeting.",
      "links": "<a href='/AIV/04/16/18-19'>Num. 16:18-19</a>",
      "comment": "Leadership again is seen meeting God at His dwelling, standing as mediators for the people."
    },
    {
      "pk": 4016044,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 44,
      "text": "And the LORD spoke to Moses, saying,",
      "links": "<a href='/AIV/04/14/26'>Num. 14:26</a>",
      "comment": "Repeated divine address to Moses shows the continuity of true leadership."
    },
    {
      "pk": 4016045,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 45,
      "text": "'Get away from among this congregation, that I may consume them in a moment!' And they fell on their faces.",
      "links": "<a href='/AIV/04/16/21'>Num. 16:21</a>",
      "comment": "Again, intercessory prayer averts disaster, paralleling Jesus’ mediation in the New Testament."
    },
    {
      "pk": 4016046,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 46,
      "text": "And Moses said to Aaron, 'Take your censer, put fire on it from the altar, and lay incense on it; and carry it quickly to the congregation and make atonement for them, for wrath has gone out from the LORD; the plague has begun.'",
      "links": "<a href='/AIV/04/8/19'>Num. 8:19</a>; <a href='/AIV/02/30/7'>Ex. 30:7</a>",
      "comment": "Aaron’s act of atonement as high priest foreshadows Christ’s greater act of atonement. Note how only the appointed priest can make effective intercession with the sacred elements."
    },
    {
      "pk": 4016047,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 47,
      "text": "So Aaron took it as Moses said and ran into the midst of the assembly. And behold, the plague had begun among the people. And he put on the incense and made atonement for the people.",
      "links": "<a href='/AIV/04/25/8-13'>Num. 25:8-13</a>; <a href='/AIV/58/7/25'>Heb. 7:25</a>",
      "comment": "The high priest intercedes at the cost of his own action, standing between the living and the dead. This is a type of Christ’s unique mediation."
    },
    {
      "pk": 4016048,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 48,
      "text": "And he stood between the dead and the living, and the plague was stopped.",
      "links": "<a href='/AIV/04/25/13'>Num. 25:13</a>; <a href='/AIV/62/2/1-2'>1 John 2:1-2</a>",
      "comment": "Aaron’s intercession brings life out of death—pointing to the priestly work established by God for the salvation of the community."
    },
    {
      "pk": 4016049,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 49,
      "text": "Now those who died in the plague were fourteen thousand seven hundred, besides those who died in the affair of Korah.",
      "links": "<a href='/AIV/04/25/9'>Num. 25:9</a>",
      "comment": "This great loss underscores both the seriousness of rebellion and the necessity of intercessory priesthood."
    },
    {
      "pk": 4016050,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 16,
      "verse": 50,
      "text": "And Aaron returned to Moses at the entrance of the tent of meeting, when the plague was stopped.",
      "links": "<a href='/AIV/19/106/30'>Ps. 106:30</a>",
      "comment": "Divine mediation, priesthood, and obedience converge here. Physical and spiritual wellbeing depend on proper order and God’s ordained ministry, a reality more fully revealed in the new covenant."
    }
  ],
  "translatedAt": "2025-12-24T01:40:09.026Z"
}