{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 20,
  "verses": [
    {
      "pk": 4020001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 1,
      "text": "In the first month, the entire congregation of the people of Israel came into the Wilderness of Zin, and the people stayed at Kadesh. Miriam died there and was buried.",
      "links": "<a href='/AIV/6/24/29-30'>Josh. 24:29-30</a>; <a href='/AIV/2/15/20'>Ex. 15:20</a>",
      "comment": "Miriam's death marks the end of an era, as she was one of the key leaders of the Exodus. Her burial in the wilderness reminds us of the consequences of unbelief for that generation (see Heb. 3:16-19)."
    },
    {
      "pk": 4020002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 2,
      "text": "Now there was no water for the congregation, so they gathered themselves together against Moses and Aaron.",
      "links": "<a href='/AIV/2/17/1'>Ex. 17:1</a>; <a href='/AIV/4/16/41'>Num. 16:41</a>",
      "comment": "Once again, lack of water tests the faith of Israel in the wilderness, similar to Exodus 17. This sets the stage for a profound demonstration of God's providence."
    },
    {
      "pk": 4020003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 3,
      "text": "The people argued with Moses and said, 'If only we had died when our brothers died before the LORD!'",
      "links": "<a href='/AIV/4/14/2'>Num. 14:2</a>; <a href='/AIV/4/16/32-35'>Num. 16:32-35</a>",
      "comment": "Their complaint is rooted in despair and forgetfulness of God's past deliverance, a recurring theme in Israel's desert journey."
    },
    {
      "pk": 4020004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 4,
      "text": "'Why have you brought the LORD’s assembly into this wilderness, that we should die here, both we and our livestock?'",
      "links": "<a href='/AIV/2/16/3'>Ex. 16:3</a>; <a href='/AIV/4/14/2-3'>Num. 14:2-3</a>",
      "comment": "Notice the language: 'the LORD's assembly,' hinting at the concept of God's people being a called-out body, later fully realized in the Church (see Acts 7:38)."
    },
    {
      "pk": 4020005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 5,
      "text": "'And why did you make us come up out of Egypt to bring us to this evil place? It is no place for grain, or figs, or vines, or pomegranates, and there is no water to drink.'",
      "links": "<a href='/AIV/4/16/13'>Num. 16:13</a>",
      "comment": "The people lament the lack of abundance, longing for the fruitfulness promised by God, but miss the lesson of trust and obedience needed before entering the promised land."
    },
    {
      "pk": 4020006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 6,
      "text": "Then Moses and Aaron went from the presence of the assembly to the entrance of the Tent of Meeting and fell on their faces. The glory of the LORD appeared to them.",
      "links": "<a href='/AIV/3/9/23'>Lev. 9:23</a>; <a href='/AIV/4/16/19'>Num. 16:19</a>",
      "comment": "The leaders seek God's direction through humility and worship before the tent of meeting, a model for spiritual leadership."
    },
    {
      "pk": 4020007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 7,
      "text": "The LORD spoke to Moses, saying,",
      "links": "<a href='/AIV/2/17/5'>Ex. 17:5</a>",
      "comment": "Direct communication from God continues, highlighting Moses' unique prophetic office."
    },
    {
      "pk": 4020008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 8,
      "text": "'Take the staff, and gather the assembly, you and Aaron your brother, and tell the rock before their eyes to yield its water. So you shall bring water out of the rock for them and give drink to the congregation and their livestock.'",
      "links": "<a href='/AIV/2/17/6'>Ex. 17:6</a>; <a href='/AIV/19/78/15-16'>Ps. 78:15-16</a>; <a href='/AIV/19/105/41'>Ps. 105:41</a>; <a href='/AIV/46/10/4'>1 Cor. 10:4</a>",
      "comment": "God calls Moses to a new act: speaking to the rock rather than striking it. Paul later sees the rock as a figure of Christ (1 Cor. 10:4), who gives living water (Jn. 7:37-38)."
    },
    {
      "pk": 4020009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 9,
      "text": "So Moses took the staff from before the LORD, just as he had commanded him.",
      "links": "<a href='/AIV/2/4/3'>Ex. 4:3</a>; <a href='/AIV/4/17/10'>Num. 17:10</a>",
      "comment": "The staff, once used for judgment and mercy, remains a sign of divine authority."
    },
    {
      "pk": 4020010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 10,
      "text": "Then Moses and Aaron gathered the assembly before the rock, and he said to them, 'Hear now, you rebels! Shall we bring water for you out of this rock?'",
      "links": "<a href='/AIV/5/9/23'>Deut. 9:23</a>; <a href='/AIV/19/106/32-33'>Ps. 106:32-33</a>",
      "comment": "Moses' words reveal human frustration. He identifies himself and Aaron as agents in God's work, subtly shifting focus from God’s power."
    },
    {
      "pk": 4020011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 11,
      "text": "And Moses raised his hand and struck the rock with his staff twice, and water came out abundantly, and the congregation and their livestock drank.",
      "links": "<a href='/AIV/2/17/6'>Ex. 17:6</a>; <a href='/AIV/19/78/20'>Ps. 78:20</a>",
      "comment": "Although Moses disobeys God's command (to speak, not strike), God still provides water. This prefigures Christ, the true Rock, struck for our salvation (see Jn. 19:34; 1 Cor. 10:4)."
    },
    {
      "pk": 4020012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 12,
      "text": "The LORD said to Moses and Aaron, 'Because you did not trust in Me, to uphold Me as holy in the eyes of the people of Israel, therefore you shall not bring this assembly into the land that I have given them.'",
      "links": "<a href='/AIV/4/27/14'>Num. 27:14</a>; <a href='/AIV/5/32/51-52'>Deut. 32:51-52</a>",
      "comment": "Moses and Aaron's failure illustrates the importance of obedience in leadership. Their exclusion from the land foreshadows the necessity of complete trust, reminding us of the necessity of grace and mediation for entering God's promise."
    },
    {
      "pk": 4020013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 13,
      "text": "These are the waters of Meribah, where the people of Israel quarreled with the LORD, and through them He showed Himself holy.",
      "links": "<a href='/AIV/19/81/7'>Ps. 81:7</a>; <a href='/AIV/19/106/32'>Ps. 106:32</a>",
      "comment": "'Meribah' means 'quarreling.' Even in human failure, God sanctifies His name, a central theme linking God’s holiness with both judgment and mercy."
    },
    {
      "pk": 4020014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 14,
      "text": "Moses sent messengers from Kadesh to the king of Edom: 'This is what your brother Israel says: You know all the hardship that we have met.'",
      "links": "<a href='/AIV/4/20/21'>Num. 20:21</a>; <a href='/AIV/1/36/1'>Gen. 36:1</a>",
      "comment": "'Brother Israel' references kinship between Israel and Edom (descendants of Jacob and Esau), underlining the familial ties despite hostilities."
    },
    {
      "pk": 4020015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 15,
      "text": "'How our ancestors went down to Egypt, and we lived in Egypt a long time, and the Egyptians mistreated us and our fathers.'",
      "links": "<a href='/AIV/1/46/6'>Gen. 46:6</a>; <a href='/AIV/2/1/8-14'>Ex. 1:8-14</a>",
      "comment": "Israel appeals to their shared ancestry and suffering, modeling negotiation rooted in shared history."
    },
    {
      "pk": 4020016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 16,
      "text": "'When we cried out to the LORD, he heard our voice and sent an angel and brought us out of Egypt. Now behold, we are at Kadesh, a city on the edge of your territory.'",
      "links": "<a href='/AIV/2/3/7'>Ex. 3:7</a>; <a href='/AIV/2/14/19'>Ex. 14:19</a>",
      "comment": "The 'angel' here can refer to the Angel of the LORD, who often appears as a theophany (see Ex. 23:20; Judges 2:1), foreshadowing God’s saving interventions."
    },
    {
      "pk": 4020017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 17,
      "text": "'Please let us pass through your land. We will not pass through field or vineyard, or drink water from a well. We will go along the King's Highway. We will not turn aside to the right or to the left until we have passed through your territory.'",
      "links": "<a href='/AIV/5/2/27-29'>Deut. 2:27-29</a>",
      "comment": "Israel’s promise demonstrates respect for Edom’s property and law, a principle echoed in the Christian respect for just authority."
    },
    {
      "pk": 4020018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 18,
      "text": "But Edom said to him, 'You shall not pass through, lest I come out with the sword against you.'",
      "links": "<a href='/AIV/4/21/4'>Num. 21:4</a>",
      "comment": "Edom's refusal, with threat of force, underscores the ongoing tension between the descendants of Esau and Jacob."
    },
    {
      "pk": 4020019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 19,
      "text": "The people of Israel said to him, 'We will go up by the highway, and if we or our livestock drink any of your water, we will pay for it. Only let us pass through on foot, nothing more.'",
      "links": "<a href='/AIV/5/2/28'>Deut. 2:28</a>",
      "comment": "Further effort to keep peace at Israel’s initiative highlights good-will and a willingness to be held accountable."
    },
    {
      "pk": 4020020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 20,
      "text": "But he said, 'You shall not pass through.' So Edom came out against them with a large army and with a strong hand.",
      "links": "<a href='/AIV/4/20/18'>Num. 20:18</a>",
      "comment": "Edom’s aggressive posture, despite Israel's peaceful intentions, prefigures recurring opposition to the people of God."
    },
    {
      "pk": 4020021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 21,
      "text": "Thus Edom refused to give Israel passage through his territory, so Israel turned away from him.",
      "links": "<a href='/AIV/4/21/4'>Num. 21:4</a>",
      "comment": "Israel’s decision to turn away, rather than fight, points to desired peacefulness, a theme echoed by Christ’s teachings (see Matt. 5:9)."
    },
    {
      "pk": 4020022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 22,
      "text": "They set out from Kadesh, and the people of Israel, the whole congregation, came to Mount Hor.",
      "links": "<a href='/AIV/4/33/37-38'>Num. 33:37-38</a>",
      "comment": "Mount Hor becomes the setting for a major leadership transition in Israel's journey."
    },
    {
      "pk": 4020023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 23,
      "text": "And the LORD said to Moses and Aaron at Mount Hor, on the border of the land of Edom,",
      "links": "<a href='/AIV/4/27/13'>Num. 27:13</a>",
      "comment": "God again directly instructs Moses and Aaron, underscoring their prophetic and priestly authority."
    },
    {
      "pk": 4020024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 24,
      "text": "'Aaron shall be gathered to his people, for he shall not enter the land that I have given to the people of Israel, because you both rebelled against My command at the waters of Meribah.'",
      "links": "<a href='/AIV/4/27/13-14'>Num. 27:13-14</a>; <a href='/AIV/5/32/50-51'>Deut. 32:50-51</a>",
      "comment": "Aaron’s exclusion from the Promised Land links leadership responsibility with obedience. 'Gathered to his people' hints at faith in life after death, a hope later made explicit."
    },
    {
      "pk": 4020025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 25,
      "text": "'Take Aaron and Eleazar his son and bring them up to Mount Hor.'",
      "links": "<a href='/AIV/4/33/38'>Num. 33:38</a>",
      "comment": "The transition from Aaron to Eleazar prefigures the succession of priestly authority by divinely-established means."
    },
    {
      "pk": 4020026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 26,
      "text": "'Strip Aaron of his garments and put them on Eleazar his son. Aaron shall be gathered to his people and shall die there.'",
      "links": "<a href='/AIV/4/33/39'>Num. 33:39</a>; <a href='/AIV/2/29/29'>Ex. 29:29</a>",
      "comment": "The priestly garments signify official, hereditary transfer of priestly ministry, symbolizing orderly apostolic succession and continuity."
    },
    {
      "pk": 4020027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 27,
      "text": "Moses did as the LORD commanded. They went up Mount Hor in the sight of all the congregation.",
      "links": "<a href='/AIV/4/3/32'>Num. 3:32</a>",
      "comment": "Public transfer of priestly office reinforces the foundational principle of visible and recognized spiritual leadership."
    },
    {
      "pk": 4020028,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 28,
      "text": "Moses stripped Aaron of his garments and put them on Eleazar his son. Aaron died there on the top of the mountain. Then Moses and Eleazar came down from the mountain.",
      "links": "<a href='/AIV/4/33/38-39'>Num. 33:38-39</a>",
      "comment": "The peaceful death of Aaron after transmission of his office serves as a model for orderly transition in church leadership and communion of saints across generations."
    },
    {
      "pk": 4020029,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 20,
      "verse": 29,
      "text": "When all the congregation saw that Aaron had died, all the house of Israel mourned for Aaron for thirty days.",
      "links": "<a href='/AIV/5/34/8'>Deut. 34:8</a>",
      "comment": "The prescribed mourning period reflects reverence for those who serve God's people in a priestly role, paralleling later customs of honoring departed leaders and saints."
    }
  ],
  "translatedAt": "2025-12-24T01:42:18.027Z"
}