{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 26,
  "verses": [
    {
      "pk": 4026001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 1,
      "text": "After the plague, the LORD spoke to Moses and to Eleazar the son of Aaron the priest, saying:",
      "links": "<a href='/AIV/4/25/9'>Num. 25:9</a>; <a href='/AIV/4/1/1'>Num. 1:1</a>",
      "comment": "The context here follows immediately after the plague because of Israel's sin with Baal-peor (see Numbers 25). Notice also the divine initiative in renewal after judgment, a pattern echoed in later salvation history."
    },
    {
      "pk": 4026002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 2,
      "text": "\"Take a census of all the congregation of the people of Israel, from twenty years old and upward, by their fathers' houses, all in Israel who are able to go to war.\"",
      "links": "<a href='/AIV/4/1/2'>Num. 1:2-3</a>; <a href='/AIV/4/14/29'>Num. 14:29</a>",
      "comment": "This census mirrors the one in Numbers 1, but here it is for the new generation after the wilderness judgments. The emphasis on tribal/family inheritance points to the importance of continuity and ordered leadership—a theme that develops into structured apostolic succession in later revelation."
    },
    {
      "pk": 4026003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 3,
      "text": "So Moses and Eleazar the priest spoke with them in the plains of Moab by the Jordan across from Jericho, saying:",
      "links": "<a href='/AIV/4/22/1'>Num. 22:1</a>; <a href='/AIV/6/1/1'>Josh. 1:1-2</a>",
      "comment": "The setting near the Jordan anticipates Israel’s entry into the promised land, as fulfillment of God’s covenant. The leadership of Moses and Eleazar demonstrates continuity from generation to generation—foreshadowing the handing on of authority."
    },
    {
      "pk": 4026004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 4,
      "text": "\"Take a census of the people, from twenty years old and upward,\" as the LORD commanded Moses. The people of Israel who came out of the land of Egypt were:",
      "links": "<a href='/AIV/4/1/3'>Num. 1:3</a>",
      "comment": "‘As the LORD commanded’ is a repeated phrase, emphasizing obedience and divine authority. The ongoing record of those who came out of Egypt connects the new generation to their salvific past (cf. Luke 22:19 in the NT for remembrance)."
    },
    {
      "pk": 4026005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 5,
      "text": "Reuben, the firstborn of Israel. The sons of Reuben: of Hanoch, the family of the Hanochites; of Pallu, the family of the Palluites;",
      "links": "<a href='/AIV/1/46/9'>Gen. 46:9</a>; <a href='/AIV/2/6/14'>Exod. 6:14</a>",
      "comment": "Genealogical detail affirms historical continuity and God’s faithfulness to the patriarchs. Family lines are crucial for inheritance and covenant identity."
    },
    {
      "pk": 4026006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 6,
      "text": "Of Hezron, the family of the Hezronites; of Carmi, the family of the Carmites.",
      "links": "<a href='/AIV/1/46/9'>Gen. 46:9</a>",
      "comment": "Hezron and Carmi belonged to the main clans of Reuben. Keeping tribal identity demonstrates God’s order and preparation for later salvation history."
    },
    {
      "pk": 4026007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 7,
      "text": "These are the families of the Reubenites. Their numbered males were 43,730.",
      "links": "<a href='/AIV/4/1/21'>Num. 1:21</a>",
      "comment": "Reuben’s numbers have decreased since the first census (Numbers 1:21). Symbolically, decline comes from disobedience—an implicit lesson about fidelity."
    },
    {
      "pk": 4026008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 8,
      "text": "The son of Pallu was Eliab.",
      "links": "<a href='/AIV/4/16/1'>Num. 16:1</a>",
      "comment": "Eliab’s line is later associated with rebellion (see Korah’s rebellion). God’s covenant faithfulness persists even amid unfaithfulness."
    },
    {
      "pk": 4026009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 9,
      "text": "The sons of Eliab: Nemuel, Dathan, and Abiram. These are the Dathan and Abiram who were called by the congregation, who contended against Moses and Aaron in the company of Korah, when they contended against the LORD.",
      "links": "<a href='/AIV/4/16/1-35'>Num. 16:1-35</a>",
      "comment": "Dathan and Abiram's rebellion serves as a warning against schism and the grave consequences of defying God-ordained leadership."
    },
    {
      "pk": 4026010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 10,
      "text": "And the earth opened its mouth and swallowed them up together with Korah, when that company died, when the fire devoured 250 men; and they became a warning.",
      "links": "<a href='/AIV/4/16/31-35'>Num. 16:31-35</a>; <a href='/AIV/65/1/11'>Jude 1:11</a>",
      "comment": "Divine judgment validates legitimate authority. This episode foreshadows New Testament teaching on church order and schism (cf. Jude 1:11)."
    },
    {
      "pk": 4026011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 11,
      "text": "But the sons of Korah did not die.",
      "links": "<a href='/AIV/19/84/1'>Ps. 84:title</a>; <a href='/AIV/4/16/32'>Num. 16:32</a>",
      "comment": "Korah’s descendants become keepers of temple worship (see Psalms of the sons of Korah). God’s mercy preserves a remnant through which worship continues."
    },
    {
      "pk": 4026012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 12,
      "text": "The sons of Simeon according to their families: of Nemuel, the family of the Nemuelites; of Jamin, the family of the Jaminites; of Jachin, the family of the Jachinites;",
      "links": "<a href='/AIV/1/46/10'>Gen. 46:10</a>",
      "comment": "Simeon's lower numbers in this census indicate consequences for disobedience (see Genesis 49:5-7), suggesting that sin has generational effects."
    },
    {
      "pk": 4026013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 13,
      "text": "of Zerah, the family of the Zerahites; of Shaul, the family of the Shaulites.",
      "links": "<a href='/AIV/1/46/10'>Gen. 46:10</a>",
      "comment": "Genealogical precision highlights every member’s covenant importance—anticipating the New Testament's attention to spiritual family (cf. Matthew 1:2)."
    },
    {
      "pk": 4026014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 14,
      "text": "These are the families of the Simeonites, 22,200 men.",
      "links": "<a href='/AIV/4/1/23'>Num. 1:23</a>",
      "comment": "A halving of Simeon’s strength compared to Numbers 1, implying discipline but continued presence in the people of God."
    },
    {
      "pk": 4026015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 15,
      "text": "The sons of Gad according to their families: of Zephon, the family of the Zephonites; of Haggi, the family of the Haggites; of Shuni, the family of the Shunites;",
      "links": "<a href='/AIV/1/46/16'>Gen. 46:16</a>",
      "comment": "Gad’s tribes are associated with the borderlands and demonstrate Israel’s diversity; every clan has a role in God’s plan."
    },
    {
      "pk": 4026016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 16,
      "text": "of Ozni, the family of the Oznites; of Eri, the family of the Erites;",
      "links": "<a href='/AIV/1/46/16'>Gen. 46:16</a>",
      "comment": "Personal names representing clan founders reinforce covenantal legacies sustained by God."
    },
    {
      "pk": 4026017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 17,
      "text": "of Arod, the family of the Arodites; of Areli, the family of the Arelites.",
      "links": "<a href='/AIV/1/46/16'>Gen. 46:16</a>",
      "comment": "See the coherence between Genesis and Numbers in maintaining genealogical records, demonstrating God’s unbroken promise."
    },
    {
      "pk": 4026018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 18,
      "text": "These are the families of the sons of Gad according to those who were numbered of them, 40,500 men.",
      "links": "<a href='/AIV/4/1/25'>Num. 1:25</a>",
      "comment": "Slight decline since the first census, reinforcing dependence on God for fruitfulness."
    },
    {
      "pk": 4026019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 19,
      "text": "The sons of Judah were Er and Onan; but Er and Onan died in the land of Canaan.",
      "links": "<a href='/AIV/1/38/7-10'>Gen. 38:7-10</a>",
      "comment": "Er and Onan’s deaths reflect God’s judgment for grave sin. However, Judah remains the royal line (see Matthew 1:2-3; Christ’s genealogy)."
    },
    {
      "pk": 4026020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 20,
      "text": "The sons of Judah according to their families were: of Shelah, the family of the Shelanites; of Perez, the family of the Perezites; of Zerah, the family of the Zerahites.",
      "links": "<a href='/AIV/1/46/12'>Gen. 46:12</a>; <a href='/AIV/40/1/3'>Matt. 1:3</a>",
      "comment": "Perez becomes the ancestor of King David and Christ (see Ruth 4:18-22; Matthew 1:3–6). God brings new beginnings from human failure."
    },
    {
      "pk": 4026021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 21,
      "text": "The sons of Perez: of Hezron, the family of the Hezronites; of Hamul, the family of the Hamulites.",
      "links": "<a href='/AIV/1/46/12'>Gen. 46:12</a>; <a href='/AIV/8/2/5'>Ruth 4:18-19</a>",
      "comment": "The genealogical track from Perez, Hezron, and Hamul to David (and Christ) is notable for the precision in God’s providence."
    },
    {
      "pk": 4026022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 22,
      "text": "These are the families of Judah according to those who were numbered of them, 76,500 men.",
      "links": "<a href='/AIV/4/1/27'>Num. 1:27</a>",
      "comment": "Judah grows larger, underscoring the tribe’s prominence in God’s redemptive plan."
    },
    {
      "pk": 4026023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 23,
      "text": "The sons of Issachar according to their families: of Tola, the family of the Tolaites; of Puvah, the family of the Puvahites;",
      "links": "<a href='/AIV/1/46/13'>Gen. 46:13</a>",
      "comment": "God’s faithfulness extends to less prominent tribes, showing His inclusive covenant."
    },
    {
      "pk": 4026024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 24,
      "text": "of Jashub, the family of the Jashubites; of Shimron, the family of the Shimronites.",
      "links": "<a href='/AIV/1/46/13'>Gen. 46:13</a>",
      "comment": "All the tribes are preserved, anticipating the unity in diversity fulfilled in Christ’s gathering of the Church (cf. Revelation 7:4–8 for tribal imagery in eschatological fulfillment)."
    },
    {
      "pk": 4026025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 25,
      "text": "These are the families of Issachar according to those who were numbered of them, 64,300 men.",
      "links": "<a href='/AIV/4/1/29'>Num. 1:29</a>",
      "comment": "Issachar’s increase reinforces that faithfulness bears fruit."
    },
    {
      "pk": 4026026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 26,
      "text": "The sons of Zebulun according to their families: of Sered, the family of the Seredites; of Elon, the family of the Elonites; of Jahleel, the family of the Jahleelites.",
      "links": "<a href='/AIV/1/46/14'>Gen. 46:14</a>",
      "comment": "Zebulun's inclusion highlights the role of every tribe in the greater whole."
    },
    {
      "pk": 4026027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 27,
      "text": "These are the families of the Zebulunites according to those who were numbered of them, 60,500 men.",
      "links": "<a href='/AIV/4/1/31'>Num. 1:31</a>",
      "comment": "Zebulun’s size also testifies to God’s provision for His people."
    },
    {
      "pk": 4026028,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 28,
      "text": "The sons of Joseph according to their families: Manasseh and Ephraim.",
      "links": "<a href='/AIV/1/48/5'>Gen. 48:5</a>",
      "comment": "Joseph, given a double portion through Manasseh and Ephraim, prefigures the Lord’s own superabundant generosity (cf. John 6:12–13)."
    },
    {
      "pk": 4026029,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 29,
      "text": "The sons of Manasseh: of Machir, the family of the Machirites; and Machir fathered Gilead; of Gilead, the family of the Gileadites.",
      "links": "<a href='/AIV/1/50/23'>Gen. 50:23</a>",
      "comment": "Manasseh’s descendants settle on trans-Jordan land (see Numbers 32), foreshadowing the Church’s universal reach (catholicity in the true sense)."
    },
    {
      "pk": 4026030,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 30,
      "text": "These are the sons of Gilead: of Iezer, the family of the Iezrites; of Helek, the family of the Helekites;",
      "links": "<a href='/AIV/1/50/23'>Gen. 50:23</a>",
      "comment": "Subdivision within tribes reminds the reader that God calls communities and individuals to belonging."
    },
    {
      "pk": 4026031,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 31,
      "text": "of Asriel, the family of the Asrielites; of Shechem, the family of the Shechemites;",
      "links": "<a href='/AIV/1/46/20'>Gen. 46:20</a>",
      "comment": "God’s faithfulness to individual families extends His covenant promises."
    },
    {
      "pk": 4026032,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 32,
      "text": "of Shemida, the family of the Shemidaites; of Hepher, the family of the Hepherites.",
      "links": "<a href='/AIV/6/17/2-3'>Josh. 17:2-3</a>",
      "comment": "Hepher’s descendants include the daughters of Zelophehad, whose story soon illustrates the dignity of each member within God’s people."
    },
    {
      "pk": 4026033,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 33,
      "text": "Now Zelophehad the son of Hepher had no sons, but only daughters. The names of Zelophehad’s daughters were: Mahlah, Noah, Hoglah, Milcah, and Tirzah.",
      "links": "<a href='/AIV/4/27/1'>Num. 27:1</a>; <a href='/AIV/6/17/3'>Josh. 17:3</a>",
      "comment": "Zelophehad’s daughters’ later appeal for inheritance (Numbers 27) affirms the principle that every member has a place, foreshadowing the NT spiritual inheritance open to all believers (cf. Galatians 3:28-29)."
    },
    {
      "pk": 4026034,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 34,
      "text": "These are the families of Manasseh, and those who were numbered of them were 52,700.",
      "links": "<a href='/AIV/4/1/35'>Num. 1:35</a>",
      "comment": "Manasseh’s increase in numbers shows God’s blessing for the new generation."
    },
    {
      "pk": 4026035,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 35,
      "text": "These are the sons of Ephraim according to their families: of Shuthelah, the family of the Shuthelahites; of Becher, the family of the Becherites; of Tahan, the family of the Tahanites.",
      "links": "<a href='/AIV/1/46/20'>Gen. 46:20</a>",
      "comment": "Ephraim likewise receives a substantial inheritance, recalling the theme of blessing passed on through the laying on of hands (see Gen. 48:14-20)."
    },
    {
      "pk": 4026036,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 36,
      "text": "And these are the sons of Shuthelah: of Eran, the family of the Eranites.",
      "links": "<a href='/AIV/4/26/35'>Num. 26:35</a>",
      "comment": "Eran’s name only appears here, but each name perpetuates the promise to Abraham’s offspring."
    },
    {
      "pk": 4026037,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 37,
      "text": "These are the families of the sons of Ephraim according to those who were numbered of them, 32,500. These are the sons of Joseph according to their families.",
      "links": "<a href='/AIV/4/1/33'>Num. 1:33</a>",
      "comment": "A reduction of Ephraim’s size since the first census, though he retains double significance through Manasseh. Like grace, God’s economy does not depend on numbers alone."
    },
    {
      "pk": 4026038,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 38,
      "text": "The sons of Benjamin according to their families: of Bela, the family of the Belaites; of Ashbel, the family of the Ashbelites; of Ahiram, the family of the Ahiramites;",
      "links": "<a href='/AIV/1/46/21'>Gen. 46:21</a>",
      "comment": "Benjamin will become the tribe of Saul and Paul, showing that God raises up leaders from all tribes."
    },
    {
      "pk": 4026039,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 39,
      "text": "of Shephupham, the family of the Shuphamites; of Hupham, the family of the Huphamites.",
      "links": "<a href='/AIV/1/46/21'>Gen. 46:21</a>",
      "comment": "Details like these support the accuracy and historicity of Israel’s records."
    },
    {
      "pk": 4026040,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 40,
      "text": "The sons of Bela were Ard and Naaman: of Ard, the family of the Ardites; of Naaman, the family of the Naamites.",
      "links": "<a href='/AIV/1/46/21'>Gen. 46:21</a>",
      "comment": "Even within the smallest details, all are accounted for in God’s plan—foreshadowing the NT language that every member of the Church is indispensable (1 Corinthians 12:12-26)."
    },
    {
      "pk": 4026041,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 41,
      "text": "These are the sons of Benjamin according to their families, and those who were numbered of them were 45,600.",
      "links": "<a href='/AIV/4/1/37'>Num. 1:37</a>",
      "comment": "Benjamin’s increase parallels grace and perseverance."
    },
    {
      "pk": 4026042,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 42,
      "text": "These are the sons of Dan according to their families: of Shuham, the family of the Shuhamites. These are the families of Dan according to their families.",
      "links": "<a href='/AIV/1/46/23'>Gen. 46:23</a>",
      "comment": "Dan’s only main family is Shuham, yet the tribe remains substantial. Diversity of circumstance within unity of grace."
    },
    {
      "pk": 4026043,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 43,
      "text": "All the families of the Shuhamites, according to those who were numbered of them, were 64,400.",
      "links": "<a href='/AIV/4/1/39'>Num. 1:39</a>",
      "comment": "Dan remains large in number. Collective faithfulness is honored by God."
    },
    {
      "pk": 4026044,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 44,
      "text": "The sons of Asher according to their families: of Imnah, the family of the Imnites; of Ishvi, the family of the Ishvites; of Beriah, the family of the Beriites.",
      "links": "<a href='/AIV/1/46/17'>Gen. 46:17</a>",
      "comment": "Asher becomes one of the most fertile tribes (see Deut. 33:24), symbolizing blessing."
    },
    {
      "pk": 4026045,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 45,
      "text": "Of the sons of Beriah: of Heber, the family of the Heberites; of Malchiel, the family of the Malchielites.",
      "links": "<a href='/AIV/1/46/17'>Gen. 46:17</a>",
      "comment": "Malchiel’s presence reinforces that each family, no matter how small, is included."
    },
    {
      "pk": 4026046,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 46,
      "text": "The name of Asher's daughter was Serah.",
      "links": "<a href='/AIV/1/46/17'>Gen. 46:17</a>",
      "comment": "Serah is one of the few women named directly, anticipating women’s important roles in the later community of faith (cf. Luke 8:1-3)."
    },
    {
      "pk": 4026047,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 47,
      "text": "These are the families of the sons of Asher according to those who were numbered of them, 53,400.",
      "links": "<a href='/AIV/4/1/41'>Num. 1:41</a>",
      "comment": "Asher’s growth is emblematic of God’s promise to prosper His people (Deut. 33:24)."
    },
    {
      "pk": 4026048,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 48,
      "text": "The sons of Naphtali according to their families: of Jahzeel, the family of the Jahzeelites; of Guni, the family of the Gunites;",
      "links": "<a href='/AIV/1/46/24'>Gen. 46:24</a>",
      "comment": "Naphtali is often associated with the Galilee region, where Jesus later ministers (see Matthew 4:13–15)."
    },
    {
      "pk": 4026049,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 49,
      "text": "of Jezer, the family of the Jezerites; of Shillem, the family of the Shillemites.",
      "links": "<a href='/AIV/1/46/24'>Gen. 46:24</a>",
      "comment": "Naphtali’s structure—like all the tribes—is an image of divinely ordered community."
    },
    {
      "pk": 4026050,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 50,
      "text": "These are the families of Naphtali according to their families, and those who were numbered of them were 45,400.",
      "links": "<a href='/AIV/4/1/43'>Num. 1:43</a>",
      "comment": "Naphtali’s numbers illustrate God’s continued presence across generations."
    },
    {
      "pk": 4026051,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 51,
      "text": "These were those who were numbered of the people of Israel: 601,730.",
      "links": "<a href='/AIV/2/12/37'>Exod. 12:37</a>; <a href='/AIV/4/1/46'>Num. 1:46</a>",
      "comment": "The total is almost identical to the previous census. God preserves His people, despite the judgments—demonstrating mercy and fidelity to His covenant."
    },
    {
      "pk": 4026052,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 52,
      "text": "The LORD spoke to Moses, saying:",
      "links": "<a href='/AIV/4/1/1'>Num. 1:1</a>",
      "comment": "Once again, every directive comes from the Lord, underlining the necessity of obedience to divinely ordained leadership in the people of God."
    },
    {
      "pk": 4026053,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 53,
      "text": "\"Among these the land shall be divided as an inheritance according to the number of names.",
      "links": "<a href='/AIV/6/14/1'>Josh. 14:1</a>",
      "comment": "Land inheritance prefigures the New Testament promise of sharing in the inheritance of Christ (Romans 8:17; Col. 1:12). Distribution is based on membership in the community, not merit."
    },
    {
      "pk": 4026054,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 54,
      "text": "To a larger tribe you shall give a larger inheritance, and to a smaller tribe you shall give a smaller inheritance; each tribe shall receive its inheritance according to those who were numbered of it.",
      "links": "<a href='/AIV/4/33/54'>Num. 33:54</a>",
      "comment": "Proportional inheritance points to fairness and order. This reveals God’s justice and His care to provide for each according to their need—a pattern reflected in the distribution of spiritual gifts and responsibilities in the NT."
    },
    {
      "pk": 4026055,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 55,
      "text": "But the land shall be divided by lot. According to the names of the tribes of their fathers they shall inherit.",
      "links": "<a href='/AIV/6/18/6-10'>Josh. 18:6-10</a>; <a href='/AIV/20/16/33'>Prov. 16:33</a>",
      "comment": "The use of lots shows that God is ultimately in control of the inheritance. None can claim merit, but all is from God’s providential hand."
    },
    {
      "pk": 4026056,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 56,
      "text": "Their inheritance shall be divided according to lot, whether small or great, among the families.",
      "links": "<a href='/AIV/4/33/54'>Num. 33:54</a>",
      "comment": "Inheritance is regulated both by size and by divine determination, echoing the NT theme that every member receives gifts according to God's will (1 Cor. 12:11)."
    },
    {
      "pk": 4026057,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 57,
      "text": "These are those who were numbered of the Levites according to their families: of Gershon, the family of the Gershonites; of Kohath, the family of the Kohathites; of Merari, the family of the Merarites.",
      "links": "<a href='/AIV/4/3/17'>Num. 3:17</a>",
      "comment": "The Levites are counted separately, as they serve sacred functions. God calls and sets apart individuals for service for the sake of the whole people—a principle fulfilled in ordained ministry in the NT."
    },
    {
      "pk": 4026058,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 58,
      "text": "These are the families of Levi: the family of the Libnites, the family of the Hebronites, the family of the Mahlites, the family of the Mushites, the family of the Korahites. And Kohath fathered Amram.",
      "links": "<a href='/AIV/2/6/16-20'>Exod. 6:16-20</a>",
      "comment": "Levite sub-families serve distinct roles in worship and sanctuary care, reflecting a divinely structured hierarchy."
    },
    {
      "pk": 4026059,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 59,
      "text": "The name of Amram’s wife was Jochebed, the daughter of Levi, who was born to Levi in Egypt. She bore to Amram: Aaron and Moses, and Miriam their sister.",
      "links": "<a href='/AIV/2/6/20'>Exod. 6:20</a>",
      "comment": "Aaron (priesthood), Moses (prophet), and Miriam (prophetess) together highlight God’s means of mediating His covenant—anticipating Christ’s offices."
    },
    {
      "pk": 4026060,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 60,
      "text": "To Aaron were born Nadab, Abihu, Eleazar, and Ithamar.",
      "links": "<a href='/AIV/3/10/1-6'>Lev. 10:1-6</a>",
      "comment": "Aaron’s sons continue the priestly line, but see previous judgment on Nadab and Abihu for unauthorized worship, emphasizing the gravity of sacred ministry."
    },
    {
      "pk": 4026061,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 61,
      "text": "But Nadab and Abihu died when they offered unauthorized fire before the LORD.",
      "links": "<a href='/AIV/3/10/1-2'>Lev. 10:1-2</a>",
      "comment": "Their tragic deaths act as a warning that divine worship is not taken lightly. This underscores the principle of sacred order."
    },
    {
      "pk": 4026062,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 62,
      "text": "Those who were numbered of the Levites, all the males from a month old and upward, were 23,000. They were not numbered among the people of Israel, because there was no inheritance given to them among the people of Israel.",
      "links": "<a href='/AIV/4/3/39'>Num. 3:39</a>; <a href='/AIV/5/18/20'>Deut. 18:1-2</a>",
      "comment": "Levites have a special vocation: their inheritance is the Lord Himself. This is a unique example of total dedication seen later in those who devote their whole lives to God’s service in the Church."
    },
    {
      "pk": 4026063,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 63,
      "text": "These were those numbered by Moses and Eleazar the priest, who numbered the people of Israel in the plains of Moab by the Jordan across from Jericho.",
      "links": "<a href='/AIV/4/26/3'>Num. 26:3</a>",
      "comment": "The numbering on the verge of the promised land closes the wilderness generation, as the new generation is prepared to inherit."
    },
    {
      "pk": 4026064,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 64,
      "text": "But among these there was not a man from those numbered by Moses and Aaron the priest, who had numbered the people of Israel in the wilderness of Sinai.",
      "links": "<a href='/AIV/4/14/29-30'>Num. 14:29-30</a>",
      "comment": "All the older generation except Joshua and Caleb have died, fulfilling God’s word due to Israel’s unbelief. God’s promises stand, but the unfaithful are not part of the inheritance."
    },
    {
      "pk": 4026065,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 26,
      "verse": 65,
      "text": "For the LORD had said of them, \"They shall surely die in the wilderness.\" Not one of them was left, except Caleb the son of Jephunneh and Joshua the son of Nun.",
      "links": "<a href='/AIV/4/14/30'>Num. 14:30</a>; <a href='/AIV/6/14/6-9'>Josh. 14:6-9</a>",
      "comment": "Caleb and Joshua alone remain as faithful witnesses. Their perseverance prefigures the promise of entering the eternal inheritance through faithfulness and obedience—shadows of Christ’s perfect obedience and inheritance for His people (<a href='/AIV/58/4/8-9'>Hebrews 4:8-9</a>)."
    }
  ],
  "translatedAt": "2025-12-24T01:49:56.868Z"
}