{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 18,
  "verses": [
    {
      "pk": 4018001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 1,
      "text": "The LORD said to Aaron, 'You, your sons, and your father's house with you shall bear the responsibility for offenses against the sanctuary, and you and your sons with you shall bear the responsibility for offenses against your priesthood.'",
      "links": "<a href='/AIV/2/28/43'>Exod. 28:43</a>; <a href='/AIV/4/3/6-10'>Num. 3:6-10</a>",
      "comment": "Aaron and his sons are held accountable for the sanctuary, highlighting the seriousness and authority given to the priesthood. There is a clear sense of succession and guardianship, which foreshadows later developments of priestly succession in the history of the faith."
    },
    {
      "pk": 4018002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 2,
      "text": "Also, bring your brothers, the tribe of Levi, the tribe of your father, to join you and serve you, while you and your sons with you serve before the tent of the testimony.",
      "links": "<a href='/AIV/2/6/18'>Exod. 6:18</a>; <a href='/AIV/4/1/50-53'>Num. 1:50-53</a>",
      "comment": "Only the Levites are set apart for direct service to the priests, which lays groundwork for the distinction between priest and assistant, later seen as essential in the Church's organizational structure."
    },
    {
      "pk": 4018003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 3,
      "text": "They shall attend to your needs and to all the duties of the tent, but they must not come near the vessels of the sanctuary or to the altar, lest they and you die.",
      "links": "<a href='/AIV/2/30/20'>Exod. 30:20</a>",
      "comment": "The Levites have important duties, but separation from the holiest items is preserved for the priests alone. This emphasizes the sacred order and discipline in worship, echoing the concept of set-apart holy offices."
    },
    {
      "pk": 4018004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 4,
      "text": "They shall be joined with you and perform the duties of the tent of meeting; no outsider may come near you.",
      "links": "<a href='/AIV/2/29/44'>Exod. 29:44</a>; <a href='/AIV/4/1/51'>Num. 1:51</a>",
      "comment": "Access to the sanctuary is strictly limited, foreshadowing the necessity of proper mediation between God and His people, a foundational idea leading to later sacramental theology."
    },
    {
      "pk": 4018005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 5,
      "text": "You shall perform the duties of the sanctuary and the altar, so that wrath may not fall again on the children of Israel.",
      "links": "<a href='/AIV/4/16/46-48'>Num. 16:46-48</a>",
      "comment": "Priestly service averts divine wrath, showing the power of proper mediation. Christ fulfills this perfectly as our High Priest (<a href='/AIV/58/7/24-27'>Heb. 7:24-27</a>), yet the priesthood remains necessary for ongoing sacramental mediation."
    },
    {
      "pk": 4018006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 6,
      "text": "See, I myself have taken your brothers the Levites from among the Israelites; they are a gift to you, dedicated to the LORD, to perform the service of the tent of meeting.",
      "links": "<a href='/AIV/4/3/9'>Num. 3:9</a>",
      "comment": "The Levites are set apart as a dedicated group for holy service, revealing God's initiative in appointing ministers for His worship."
    },
    {
      "pk": 4018007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 7,
      "text": "But only you and your sons with you shall attend to your priesthood for everything at the altar and behind the veil, and you shall serve. I give your priesthood to you as a gift, but any outsider who comes near shall be put to death.",
      "links": "<a href='/AIV/3/23/6-7'>Lev. 16:12</a>; <a href='/AIV/4/16/40'>Num. 16:40</a>",
      "comment": "Priesthood is described as a divine gift and privilege. The reference to 'behind the veil' points toward the future fulfillment when Christ enters the Holy of Holies (<a href='/AIV/58/9/12'>Heb. 9:12</a>)."
    },
    {
      "pk": 4018008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 8,
      "text": "The LORD spoke to Aaron, 'Behold, I have given you charge of the offerings that are consecrated to me, all the holy contributions of the Israelites; I have given them to you and your sons as a portion forever.'",
      "links": "<a href='/AIV/3/2/3'>Lev. 2:3</a>; <a href='/AIV/4/18/19'>Num. 18:19</a>",
      "comment": "Priestly support from offerings is instituted by God Himself. The concept of a continuing portion for priests underlines the principle of material support for those who serve at the altar (<a href='/AIV/46/9/13'>1 Cor. 9:13</a>)."
    },
    {
      "pk": 4018009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 9,
      "text": "'This shall be yours from the most holy things, reserved from the fire: every offering of theirs, every grain offering, every sin offering and every guilt offering of theirs, which they bring to me as most holy things, shall be yours and for your sons.'",
      "links": "<a href='/AIV/3/7/6'>Lev. 7:6</a>; <a href='/AIV/3/24/9'>Lev. 24:9</a>",
      "comment": "Partaking of the most holy offerings marks out the priests' participation in the divine service, indicating a real sharing in holy things—prefiguring the nature of sacramental participation."
    },
    {
      "pk": 4018010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 10,
      "text": "You shall eat it as most holy things. Every male shall eat it; it shall be holy to you.",
      "links": "<a href='/AIV/3/6/16'>Lev. 6:16</a>",
      "comment": "The requirement that only males eat of these offerings reflects the ancient priesthood's boundaries, but also the seriousness of handling holy things."
    },
    {
      "pk": 4018011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 11,
      "text": "This also is yours: the contribution of their gift, all the wave offerings of the Israelites. I have given them to you and to your sons and daughters with you, as a perpetual due; everyone in your house who is clean may eat it.",
      "links": "<a href='/AIV/3/10/14-15'>Lev. 10:14-15</a>",
      "comment": "Unlike the 'most holy things', these offerings can be shared with priestly families, pointing to the generosity of God’s provision for his ministers."
    },
    {
      "pk": 4018012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 12,
      "text": "All the best of the oil, all the best of the wine and of the grain, the firstfruits which they give to the LORD, I have given them to you.",
      "links": "<a href='/AIV/2/23/19'>Exod. 23:19</a>; <a href='/AIV/5/18/4'>Deut. 18:4</a>",
      "comment": "The first and best belong to God and are given to His ministers for their sustenance."
    },
    {
      "pk": 4018013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 13,
      "text": "The first ripe fruits of all that is in their land, which they bring to the LORD, shall be yours; everyone in your house who is clean may eat it.",
      "links": "<a href='/AIV/3/22/12'>Lev. 22:12</a>",
      "comment": "This passage continues the theme of priestly provision, with the note of cleanness indicating readiness to partake of holy things."
    },
    {
      "pk": 4018014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 14,
      "text": "'Every devoted thing in Israel shall be yours.'",
      "links": "<a href='/AIV/3/27/28'>Lev. 27:28</a>",
      "comment": "Here, items fully dedicated to God pass to the priests, emphasizing the link between consecration and ministry."
    },
    {
      "pk": 4018015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 15,
      "text": "Every firstborn of all flesh, whether human or animal, which the Israelites bring as an offering to the LORD, shall be yours; nevertheless, the firstborn of humans you shall surely redeem, and the firstborn of unclean animals you shall redeem.",
      "links": "<a href='/AIV/2/13/2'>Exod. 13:2</a>",
      "comment": "Redemption of the firstborn points to substitution and ransom, preparing the way for Christ’s redemptive sacrifice (<a href='/AIV/42/2/22-23'>Luke 2:22-23</a>)."
    },
    {
      "pk": 4018016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 16,
      "text": "And their redemption price—from a month old you shall redeem them, by your valuation, five shekels of silver, by the shekel of the sanctuary (twenty gerahs).",
      "links": "<a href='/AIV/3/27/6'>Lev. 27:6</a>",
      "comment": "The specific ransom price for the firstborn shows the importance of order and consistency in worship and redemption."
    },
    {
      "pk": 4018017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 17,
      "text": "But the firstborn of cows, the firstborn of sheep, or the firstborn of goats, you shall not redeem; they are holy. You shall sprinkle their blood on the altar and burn their fat as an offering by fire for a pleasing aroma to the LORD.",
      "links": "<a href='/AIV/2/13/12-13'>Exod. 13:12-13</a>",
      "comment": "Animals devoted to God by their firstborn status are fully consecrated, a foreshadowing of the unblemished offering of Christ (<a href='/AIV/43/1/29'>John 1:29</a>)."
    },
    {
      "pk": 4018018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 18,
      "text": "But their meat shall be yours, as the breast of the wave offering and the right thigh are yours.",
      "links": "<a href='/AIV/3/7/34'>Lev. 7:34</a>",
      "comment": "Priests receive a share of the sacrificial meal, a fellowship with God which later finds new depth in the Supper of the Lord."
    },
    {
      "pk": 4018019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 19,
      "text": "All the holy contributions that the Israelites present to the LORD I have given to you and your sons and daughters with you, as a perpetual due. It is a covenant of salt forever before the LORD for you and for your descendants with you.",
      "links": "<a href='/AIV/3/2/13'>Lev. 2:13</a>; <a href='/AIV/14/13/5'>2 Chr. 13:5</a>",
      "comment": "A 'covenant of salt' is a symbol of permanence and fidelity. The perpetual priestly covenant continues in Christ’s high priesthood and its ministers."
    },
    {
      "pk": 4018020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 20,
      "text": "And the LORD said to Aaron, 'You shall have no inheritance in their land, neither shall you have any portion among them. I am your portion and your inheritance among the Israelites.'",
      "links": "<a href='/AIV/5/10/9'>Deut. 10:9</a>; <a href='/AIV/19/16/5'>Ps. 16:5</a>",
      "comment": "Priests have a special relationship with God as their inheritance, distinct from temporal possessions—a model for spiritual service."
    },
    {
      "pk": 4018021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 21,
      "text": "To the people of Levi I have given every tithe in Israel for an inheritance, in return for the service that they perform, the service of the tent of meeting.",
      "links": "<a href='/AIV/3/27/30'>Lev. 27:30</a>",
      "comment": "The tithe system provides for those who serve at the altar—and the principle of supporting ministers continues into the New Covenant (<a href='/AIV/46/9/14'>1 Cor. 9:14</a>)."
    },
    {
      "pk": 4018022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 22,
      "text": "The Israelites shall no longer come near the tent of meeting, or they will bear sin and die.",
      "links": "<a href='/AIV/4/1/51'>Num. 1:51</a>",
      "comment": "Direct approach to God remains restricted, showing the ongoing need for mediation—a theme fulfilled in Christ, the one mediator, whose representatives continue His ministry."
    },
    {
      "pk": 4018023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 23,
      "text": "But the Levites shall perform the service of the tent of meeting, and they shall bear their iniquity. It shall be a statute forever throughout your generations: among the Israelites they shall have no inheritance.",
      "links": "<a href='/AIV/4/18/20'>Num. 18:20</a>",
      "comment": "The Levites' service and lack of land connects their livelihood to sacred ministry, separate from worldly concerns."
    },
    {
      "pk": 4018024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 24,
      "text": "For the tithe of the Israelites, which they present as an offering to the LORD, I have given to the Levites as their inheritance. Therefore, I have said of them that they shall have no inheritance among the Israelites.",
      "links": "<a href='/AIV/5/18/1'>Deut. 18:1</a>",
      "comment": "The Levites depend fully on their sacred calling for sustenance, much as the ministers of the Gospel rely on the spiritual family."
    },
    {
      "pk": 4018025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 25,
      "text": "The LORD spoke to Moses, saying,",
      "links": "",
      "comment": "Marks a new word of instruction, dividing the prior laws from the next section."
    },
    {
      "pk": 4018026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 26,
      "text": "'Speak to the Levites, and say to them, When you receive from the Israelites the tithe which I have given you from them for your inheritance, you shall present a tenth of the tithe as a contribution to the LORD.'",
      "links": "<a href='/AIV/16/10/38'>Neh. 10:38</a>",
      "comment": "Even the Levites, themselves recipients of tithes, are to tithe as well, highlighting the universal principle of offering from what we receive."
    },
    {
      "pk": 4018027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 27,
      "text": "And your contribution shall be reckoned to you as though it were grain from the threshing floor and as the fullness of the winepress.",
      "links": "<a href='/AIV/2/23/16'>Exod. 23:16</a>",
      "comment": "The Levites’ offerings are regarded as fully valid before God, like Israel’s firstfruits."
    },
    {
      "pk": 4018028,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 28,
      "text": "So you shall also present a contribution to the LORD from all your tithes, which you receive from the Israelites; and from them you shall give the LORD's contribution to Aaron the priest.",
      "links": "<a href='/AIV/4/18/8'>Num. 18:8</a>",
      "comment": "The highest portion of the Levites’ tithe is for the priest, showing the primacy of the priestly office."
    },
    {
      "pk": 4018029,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 29,
      "text": "Out of all the gifts to you, you shall present every contribution due to the LORD, from all the best part, the consecrated portion.",
      "links": "<a href='/AIV/3/2/14'>Lev. 2:14</a>",
      "comment": "Only the best is offered to God and His ministers, calling for self-giving, not leftovers."
    },
    {
      "pk": 4018030,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 30,
      "text": "And you shall say to them, When you have offered the best of it, then the rest shall be accounted to the Levites as produce of the threshing floor, and as produce of the winepress.",
      "links": "<a href='/AIV/4/18/27'>Num. 18:27</a>",
      "comment": "Once the best is given, the remainder is for the Levites’ own use, a just and charitable provision."
    },
    {
      "pk": 4018031,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 31,
      "text": "You may eat it in any place, you and your households, for it is your reward in return for your service in the tent of meeting.",
      "links": "<a href='/AIV/5/12/17-19'>Deut. 12:17-19</a>",
      "comment": "The Levites’ share is presented as both reward and provision, dignifying the sacred service."
    },
    {
      "pk": 4018032,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 18,
      "verse": 32,
      "text": "And you shall bear no sin by reason of it, when you have offered the best of it. But you shall not profane the holy gifts of the Israelites, lest you die.",
      "links": "<a href='/AIV/3/22/2'>Lev. 22:2</a>",
      "comment": "Strictness in handling holy things safeguards the sanctity of worship. Contempt for what is sacred brings death, a warning echoed in the stricter judgment for those who treat the sacred mysteries lightly (<a href='/AIV/46/11/27-29'>1 Cor. 11:27-29</a>)."
    }
  ],
  "translatedAt": "2025-12-24T01:41:20.902Z"
}