{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 32,
  "verses": [
    {
      "pk": 4032001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 1,
      "text": "Now the tribes of Reuben and Gad had very large herds and flocks, and they saw that the land of Jazer and the land of Gilead were suitable for livestock.",
      "links": "<a href='/AIV/4/21/32'>Num. 21:32</a>; <a href='/AIV/6/13/8'>Josh. 13:8</a>",
      "comment": "The text highlights the practical concerns of Reuben and Gad as they seek out provision for their flocks. The request for suitable land sets up a lesson in stewardship of blessings, reflecting biblical principles of caring for creation and responsible use of resources."
    },
    {
      "pk": 4032002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 2,
      "text": "So the people of Gad and Reuben came and spoke to Moses, Eleazar the priest, and the leaders of the congregation, saying:",
      "links": "<a href='/AIV/4/27/21'>Num. 27:21</a>",
      "comment": "Approaching Moses, Eleazar, and the leaders is significant; it shows a recognition of the need for proper authority and mediation, which later typifies the way the Church is governed—through apostolic succession and the laying on of hands (see Acts 6:6)."
    },
    {
      "pk": 4032003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 3,
      "text": "\"Ataroth, Dibon, Jazer, Nimrah, Heshbon, Elealeh, Sebam, Nebo, and Beon,",
      "links": "<a href='/AIV/4/21/27'>Num. 21:27</a>; <a href='/AIV/6/13/17'>Josh. 13:17</a>",
      "comment": "The request lists cities recently conquered, showing how the Israelites are inheriting the promises of God. The possession of land is both physical and spiritual, anticipating how believers inherit the heavenly Jerusalem (Heb. 13:14)."
    },
    {
      "pk": 4032004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 4,
      "text": "the land that the LORD struck down before the congregation of Israel, is a land for livestock, and your servants have livestock.\"",
      "links": "<a href='/AIV/4/21/24'>Num. 21:24</a>",
      "comment": "Their appeal rests on the Lord's conquest, recognizing divine providence in their victories. This is a model of acknowledging God’s active role in providing for His people."
    },
    {
      "pk": 4032005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 5,
      "text": "They said, \"If we have found favor in your eyes, let this land be given to your servants as a possession. Do not make us cross over the Jordan.\"",
      "links": "<a href='/AIV/6/22/4'>Josh. 22:4</a>",
      "comment": "The concept of 'favor' here resembles the request for grace (cf. Luke 1:28). Asking not to cross the Jordan shows a tension between comfort and obedience. Spiritual commentary often sees the Jordan as a symbol of death and new life, and crossing it as entering the fullness of God's promises."
    },
    {
      "pk": 4032006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 6,
      "text": "But Moses said to the people of Gad and Reuben, \"Shall your brothers go into battle while you sit here?",
      "links": "<a href='/AIV/4/14/4'>Num. 14:4</a>; <a href='/AIV/5/3/18'>Deut. 3:18</a>",
      "comment": "Moses rebukes their request, emphasizing unity and shared responsibility. This reflects New Testament teachings on the body of Christ laboring together (1 Cor. 12:12)."
    },
    {
      "pk": 4032007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 7,
      "text": "Why will you discourage the Israelites from going over into the land that the LORD has given them?",
      "links": "<a href='/AIV/4/13/31'>Num. 13:31</a>",
      "comment": "Their hesitation could undermine the faith of others—note the responsibility each believer has for the spiritual journey of the community, paralleling Jesus’ warning against causing others to stumble (Matt. 18:6)."
    },
    {
      "pk": 4032008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 8,
      "text": "Your fathers did this when I sent them from Kadesh Barnea to see the land.",
      "links": "<a href='/AIV/4/13/26'>Num. 13:26</a>; <a href='/AIV/4/14/1'>Num. 14:1</a>",
      "comment": "Moses recalls Israel's previous failure, drawing a direct line from history to current obedience and warning against repeating past mistakes in faith."
    },
    {
      "pk": 4032009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 9,
      "text": "For when they went up to the Valley of Eshcol and saw the land, they discouraged the Israelites from entering the land the LORD had given them.",
      "links": "<a href='/AIV/4/13/24'>Num. 13:24</a>",
      "comment": "Discouragement and lack of faith delayed the fulfillment of God's promise. The pattern of testing and passing through trial is echoed in Jesus’ temptation and later teaching (Matt. 4:1-11)."
    },
    {
      "pk": 4032010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 10,
      "text": "And the LORD’s anger was kindled at that time, and he swore, ‘None of the men who came up out of Egypt, from twenty years old and upward, shall see the land that I swore to give to Abraham, Isaac, and Jacob, because they did not follow me fully,’",
      "links": "<a href='/AIV/4/14/29'>Num. 14:29</a>; <a href='/AIV/4/14/23'>Num. 14:23</a>",
      "comment": "Faithfulness to God is crucial for inheritance of promise, a theme fulfilled spiritually in Christ—through whom, by faithful union, believers enter the eternal inheritance (Heb. 4:6-10)."
    },
    {
      "pk": 4032011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 11,
      "text": "except Caleb son of Jephunneh the Kenizzite and Joshua son of Nun, for they wholly followed the LORD.",
      "links": "<a href='/AIV/4/14/30'>Num. 14:30</a>; <a href='/AIV/6/14/9'>Josh. 14:9</a>",
      "comment": "The perseverance of Caleb and Joshua reveals how individual faithfulness can benefit the entire community. Later Christian tradition sees this as a model for the saints who remain steadfast."
    },
    {
      "pk": 4032012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 12,
      "text": "So the LORD’s anger was kindled against Israel, and he made them wander in the wilderness forty years, until all the generation that had done evil in his sight was gone.",
      "links": "<a href='/AIV/4/14/33'>Num. 14:33</a>",
      "comment": "The 40 years represents a generation lost to disobedience—see how wilderness is often a metaphor for purification or spiritual trial, as in Christ’s 40 days in the wilderness (Luke 4:1-2)."
    },
    {
      "pk": 4032013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 13,
      "text": "And look! You have arisen in the place of your fathers, a brood of sinful men, to add still more to the fierce anger of the LORD against Israel.",
      "links": "<a href='/AIV/4/32/14'>Num. 32:14</a>",
      "comment": "Moses uses strong language to warn against repeating history. This reinforces the biblical pattern of generational accountability and communal responsibility, foundations for later teachings about the Church’s ongoing sanctification."
    },
    {
      "pk": 4032014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 14,
      "text": "For if you turn away from him, he will again leave them in the wilderness, and you will destroy all these people.\"",
      "links": "<a href='/AIV/4/14/32'>Num. 14:32</a>",
      "comment": "The consequences of disobedience are severe. This calls to mind the need for ongoing conversion, a lifelong turning towards God—a theme echoed in New Testament passages urging perseverance (Heb. 12:1-2)."
    },
    {
      "pk": 4032015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 15,
      "text": "They came near to him and said, \"We will build sheepfolds here for our flocks, and cities for our little ones.",
      "links": "<a href='/AIV/4/32/24'>Num. 32:24</a>",
      "comment": "Their plan reflects an orderly provision for family and livestock, and an intention to settle responsibly. Building cities is an act of establishing community, which broadly corresponds to the biblical model of the people gathering in unity."
    },
    {
      "pk": 4032016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 16,
      "text": "But we ourselves will arm ourselves, ready to go before the Israelites, until we have brought them to their place. Our little ones will stay in the fortified cities because of the inhabitants of the land.",
      "links": "<a href='/AIV/6/1/14'>Josh. 1:14</a>",
      "comment": "They demonstrate willingness to share in the mission and struggle of the whole nation, paralleling Christian teachings about service and sacrifice for the good of the Church (Rom. 12:1)."
    },
    {
      "pk": 4032017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 17,
      "text": "We will not return to our homes until each of the Israelites has received his inheritance.",
      "links": "<a href='/AIV/6/22/3'>Josh. 22:3</a>",
      "comment": "Self-sacrifice and delaying personal comfort for communal good points to the idea of corporate salvation, highlighted in the New Testament's image of working towards fullness in Christ together (Col. 1:24)."
    },
    {
      "pk": 4032018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 18,
      "text": "We will not inherit with them on the other side of the Jordan and beyond, because our inheritance has come to us on this eastern side of the Jordan.\"",
      "links": "<a href='/AIV/4/34/14'>Num. 34:14</a>",
      "comment": "Division of inheritance recalls distinct callings within the one people of God, and the diversity of roles within the Church, while maintaining fundamental unity."
    },
    {
      "pk": 4032019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 19,
      "text": "So Moses said to them, \"If you will do what you have said, if you will arm yourselves before the LORD for war,",
      "links": "<a href='/AIV/4/32/29'>Num. 32:29</a>",
      "comment": "Moses encourages obedience as a requirement for blessing—a motif carried through salvation history, even into Christ’s call for radical commitment."
    },
    {
      "pk": 4032020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 20,
      "text": "and each of your armed men crosses the Jordan before the LORD, until he has driven out his enemies from before him",
      "links": "<a href='/AIV/4/32/32'>Num. 32:32</a>",
      "comment": "Participation in spiritual warfare foreshadows later Christian understanding of fighting evil, standing together, and relying on God for victory (Eph. 6:10-18)."
    },
    {
      "pk": 4032021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 21,
      "text": "and the land is subdued before the LORD; then after that you may return and be free from obligation before the LORD and before Israel. And this land will be your possession before the LORD.",
      "links": "<a href='/AIV/5/3/20'>Deut. 3:20</a>",
      "comment": "Completion of the mission grants rest and inheritance—paralleling the Christian pursuit of the 'rest' found in Christ, and the spiritual reality of reward after faithful service."
    },
    {
      "pk": 4032022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 22,
      "text": "But if you do not do so, you have sinned against the LORD; and be sure your sin will find you out.",
      "links": "<a href='/AIV/4/16/26'>Num. 16:26</a>",
      "comment": "This is a powerful warning about the consequences of sin, reminiscent of New Testament admonitions that nothing is hidden from God (Heb. 4:13)."
    },
    {
      "pk": 4032023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 23,
      "text": "Build cities for your little ones and sheepfolds for your flocks. Do what you have promised.\"",
      "links": "<a href='/AIV/4/32/24'>Num. 32:24</a>",
      "comment": "Obligation to fulfill promises anticipates Jesus’ teaching about letting one's yes be yes (Matt. 5:37), and the value of faithfulness in stewardship."
    },
    {
      "pk": 4032024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 24,
      "text": "So the people of Gad and Reuben said to Moses, \"Your servants will do as my lord commands.",
      "links": "<a href='/AIV/4/32/31'>Num. 32:31</a>",
      "comment": "Their obedience to Moses reflects the proper relationship to divinely appointed leadership, an echo of the New Testament apostles’ authority by divine commission (Matt. 16:19; Acts 15:6-7)."
    },
    {
      "pk": 4032025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 25,
      "text": "Our little ones, our wives, our flocks, and all our cattle will stay here in the cities of Gilead.",
      "links": "<a href='/AIV/6/13/15'>Josh. 13:15</a>",
      "comment": "The focus on care for the family while participating in mission shows balance between personal duties and the communal calling of God’s people."
    },
    {
      "pk": 4032026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 26,
      "text": "But your servants will cross over, everyone armed for war, before the LORD to battle, as my lord says.\"",
      "links": "<a href='/AIV/4/32/17'>Num. 32:17</a>",
      "comment": "The intent to obey Moses complements the biblical theme of obedience to spiritual leaders and the value placed on unity of purpose in the people of God."
    },
    {
      "pk": 4032027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 27,
      "text": "So Moses gave command concerning them to Eleazar the priest, to Joshua son of Nun, and to the heads of the fathers’ houses of the Israelite tribes.",
      "links": "<a href='/AIV/6/1/2'>Josh. 1:2</a>",
      "comment": "Orders are given through Moses and trusted leaders, setting a pattern for apostolic delegation—a principle foundational for Church governance structures that ensure faithfulness to divine command."
    },
    {
      "pk": 4032028,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 28,
      "text": "And Moses said to them, \"If the people of Gad and Reuben, every one armed for battle, will cross over the Jordan with you before the LORD, and the land is subdued before you, then you shall give them the land of Gilead as a possession.",
      "links": "<a href='/AIV/6/12/6'>Josh. 12:6</a>",
      "comment": "The promise given upon obedience highlights the importance of communal covenant and the land as a symbol of God’s kingdom."
    },
    {
      "pk": 4032029,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 29,
      "text": "But if they do not cross over armed with you, they shall have possessions among you in Canaan.\"",
      "links": "<a href='/AIV/4/34/15'>Num. 34:15</a>",
      "comment": "Retaining the unity of the people’s inheritance, Moses ensures no tribe is left isolated—a reflection of the Church’s spiritual and visible unity."
    },
    {
      "pk": 4032030,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 30,
      "text": "The people of Gad and Reuben answered, \"As the LORD has said to your servants, so we will do.",
      "links": "<a href='/AIV/4/32/31'>Num. 32:31</a>",
      "comment": "Their humility and submission to God’s will are virtues commended throughout scripture, showing perfect obedience as the model for God’s people—a Christ-like attitude."
    },
    {
      "pk": 4032031,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 31,
      "text": "We will cross over armed before the LORD into the land of Canaan as the LORD has commanded us.\"",
      "links": "<a href='/AIV/4/32/21'>Num. 32:21</a>",
      "comment": "Obedience to the prescribed pattern of battle prefigures Christian virtues of courage, discipline, and faith in divine promises."
    },
    {
      "pk": 4032032,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 32,
      "text": "So Moses gave to them—to the people of Gad, the people of Reuben, and to the half-tribe of Manasseh son of Joseph—the kingdom of Sihon king of the Amorites and the kingdom of Og king of Bashan, the land with its cities and the territory around them.",
      "links": "<a href='/AIV/4/21/33'>Num. 21:33</a>",
      "comment": "Distribution of land conveys the nature of inheritance, both physical and spiritual, which is fulfilled in Christ’s kingdom and the fellowship of believers."
    },
    {
      "pk": 4032033,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 33,
      "text": "The people of Gad built Dibon, Ataroth, Aroer,",
      "links": "<a href='/AIV/4/21/30'>Num. 21:30</a>",
      "comment": "Building up cities fulfills God’s intent for an ordered, settled community, which anticipates the New Jerusalem in Revelation (Rev. 21:2)."
    },
    {
      "pk": 4032034,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 34,
      "text": "Atroth Shophan, Jazer, Jogbehah,",
      "links": "<a href='/AIV/6/13/18'>Josh. 13:18</a>",
      "comment": "The careful listing of cities records the fulfillment of promise, and serves as a reminder of God’s faithfulness in establishing His people."
    },
    {
      "pk": 4032035,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 35,
      "text": "Beth Nimrah and Beth Haran—fortified cities—and built fold for sheep.",
      "links": "<a href='/AIV/4/32/24'>Num. 32:24</a>",
      "comment": "Fortifying cities and building folds for sheep echoes the biblical motif of protection and pastoral care, which Christ fulfills as the Good Shepherd (John 10:11)."
    },
    {
      "pk": 4032036,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 36,
      "text": "The people of Reuben built Heshbon, Elealeh, Kiriathaim,",
      "links": "<a href='/AIV/6/13/19'>Josh. 13:19</a>",
      "comment": "Reuben’s building continues the theme of establishing lasting places for worship and habitation, harmonious with the concept of the Church as the spiritual house (1 Pet. 2:5)."
    },
    {
      "pk": 4032037,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 37,
      "text": "Nebo and Baal Meon, with their names changed, and Sibmah. They rebuilt the cities and gave them new names.",
      "links": "<a href='/AIV/6/13/17'>Josh. 13:17</a>",
      "comment": "Renaming the cities reflects sanctifying what was previously pagan, transforming it for God’s use—a recurring theme as the Church redeems cultures for Christ."
    },
    {
      "pk": 4032038,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 38,
      "text": "The descendants of Machir son of Manasseh went to Gilead, captured it, and drove out the Amorites who were there.",
      "links": "<a href='/AIV/6/17/1'>Josh. 17:1</a>",
      "comment": "Machir’s conquest demonstrates the ongoing fulfillment of God’s promise and the victory of faithful obedience."
    },
    {
      "pk": 4032039,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 39,
      "text": "So Moses gave Gilead to Machir son of Manasseh, and he lived there.",
      "links": "<a href='/AIV/6/13/31'>Josh. 13:31</a>",
      "comment": "Possession and dwelling in the land emphasizes physical fulfillment of a spiritual promise, echoing the believer's promised rest in Christ."
    },
    {
      "pk": 4032040,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 40,
      "text": "Jair, a descendant of Manasseh, went and captured their villages, and named them Havvoth Jair.",
      "links": "<a href='/AIV/5/3/14'>Deut. 3:14</a>",
      "comment": "Taking possession and naming the villages marks establishing authority and stewardship, which Christians are called to exercise through spiritual leadership."
    },
    {
      "pk": 4032041,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 41,
      "text": "Nobah went and captured Kenath and its villages and called it Nobah after his own name.",
      "links": "<a href='/AIV/5/3/14'>Deut. 3:14</a>",
      "comment": "Naming the city after Nobah highlights the lasting personal legacy tied to responsible stewardship, linking Old Testament inheritance to New Testament spiritual heritage."
    },
    {
      "pk": 4032042,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 32,
      "verse": 42,
      "text": "These are the cities that the people of Gad, Reuben, and Manasseh built and settled, east of the Jordan in the land conquered by the Israelites.",
      "links": "<a href='/AIV/6/13/29'>Josh. 13:29</a>",
      "comment": "The completion of settlement closes the chapter with a reminder of God’s covenant faithfulness, the necessity of obedience, and the hope of rest. The ordered establishment anticipates the unity and communion of future believers in one family, called to work together in faith."
    }
  ],
  "translatedAt": "2025-12-24T01:53:33.203Z"
}