{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 4,
  "verses": [
    {
      "pk": 4004001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 1,
      "text": "The Lord spoke to Moses and Aaron, saying,",
      "links": "<a href='/AIV/3/1/1'>Lev. 1:1</a>;<a href='/AIV/2/40/34'>Ex. 40:34</a>",
      "comment": "The Lord continues to give instructions directly to Moses and Aaron, reaffirming their leadership role and the divine origin of the commands."
    },
    {
      "pk": 4004002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 2,
      "text": "\"Take a census of the sons of Kohath from among the sons of Levi, by their clans, by their fathers' houses,",
      "links": "<a href='/AIV/4/3/17'>Num. 3:17</a>",
      "comment": "This census is specific to the Levites, particularly the Kohathites, indicating their unique duties in worship and service to God at the tabernacle."
    },
    {
      "pk": 4004003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 3,
      "text": "from thirty years old and up to fifty years old, all who come to do the work in the tent of meeting.",
      "links": "<a href='/AIV/4/8/24'>Num. 8:24-25</a>",
      "comment": "Only men ages 30-50 were set apart for the heavier duties, demonstrating God’s careful ordering of worship. This anticipates how God calls and sets apart ministers for His service."
    },
    {
      "pk": 4004004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 4,
      "text": "This is the service of the sons of Kohath in the tent of meeting: the most holy things.",
      "links": "<a href='/AIV/2/25/10'>Ex. 25:10</a>;<a href='/AIV/3/16/2'>Lev. 16:2</a>",
      "comment": "The Kohathites were entrusted with the most sacred items, showing that not everyone has the same function in God's worship structure. The 'most holy things' point to the centrality of God's presence."
    },
    {
      "pk": 4004005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 5,
      "text": "When the camp sets out, Aaron and his sons shall go in and take down the veil of the screen and cover the ark of the testimony with it.",
      "links": "<a href='/AIV/2/40/3'>Ex. 40:3</a>;<a href='/AIV/3/16/2'>Lev. 16:2</a>",
      "comment": "Only the priests were allowed to handle the holiest objects directly, emphasizing the need for mediation in approaching God. The veil imagery points forward to Christ’s own body as the veil (see Heb. 10:20)."
    },
    {
      "pk": 4004006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 6,
      "text": "Then they shall put on it a covering of goatskin, and spread over it a cloth all of blue, and shall put its poles in place.",
      "links": "<a href='/AIV/2/25/14'>Ex. 25:14</a>",
      "comment": "The use of blue symbolizes heaven and divinity. The care in covering and handling these objects reinforces the idea of reverence—and that not all may approach the holiest things directly, which is fulfilled in Christ as the perfect High Priest (<a href='/AIV/58/9/11'>Heb. 9:11</a>)."
    },
    {
      "pk": 4004007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 7,
      "text": "Over the table of the bread of the Presence they shall spread a blue cloth, and put on it the plates, the dishes for incense, the bowls, and the flagons for drink offerings; the regular bread shall also be on it.",
      "links": "<a href='/AIV/2/25/30'>Ex. 25:30</a>",
      "comment": "The bread of the Presence hints at the ongoing communion between God and His people. The care in handling these sacred things foreshadows the New Testament understanding of Christ as the true bread from heaven (<a href='/AIV/43/6/35'>John 6:35</a>)."
    },
    {
      "pk": 4004008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 8,
      "text": "They shall spread over them a cloth of scarlet, and cover the same with a covering of goatskin, and shall put its poles in place.",
      "links": "<a href='/AIV/2/26/14'>Ex. 26:14</a>",
      "comment": "Scarlet represents sacrifice and atonement. These layers of covering show the hidden mystery and holiness of the instruments of worship, later unveiled in Christ’s sacrifice."
    },
    {
      "pk": 4004009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 9,
      "text": "They shall take a blue cloth and cover the lampstand for the light, with its lamps, its tongs, its trays, and all the vessels for oil with which it is supplied.",
      "links": "<a href='/AIV/2/25/31'>Ex. 25:31</a>",
      "comment": "The lampstand signifies the light and guidance of God. In the Christian tradition, Jesus is the 'light of the world' (<a href='/AIV/43/8/12'>John 8:12</a>)."
    },
    {
      "pk": 4004010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 10,
      "text": "They shall put it and all its utensils inside a covering of goatskin, and put it on the carrying frame.",
      "links": "<a href='/AIV/2/27/20-21'>Ex. 27:20-21</a>",
      "comment": "Every item is to be carefully handled, showing God’s order and holiness, and prefiguring the reverence due in Christian liturgy."
    },
    {
      "pk": 4004011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 11,
      "text": "Over the golden altar they shall spread a blue cloth, and cover it with a covering of goatskin, and shall put its poles in place.",
      "links": "<a href='/AIV/2/30/1'>Ex. 30:1</a>",
      "comment": "The golden altar is for burning incense, symbolizing the prayers of the saints (<a href='/AIV/66/5/8'>Rev. 5:8</a>), pointing to the heavenly worship Christians participate in."
    },
    {
      "pk": 4004012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 12,
      "text": "They shall take all the vessels of the service that are used in the sanctuary and put them in a blue cloth, and cover them with a covering of goatskin, and put them on the carrying frame.",
      "links": "<a href='/AIV/2/39/33'>Ex. 39:33</a>",
      "comment": "The set-apart nature of these vessels stresses proper preparation in worship, reminding Christians that their worship and sacraments are to be treated with reverence."
    },
    {
      "pk": 4004013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 13,
      "text": "They shall take away the ashes from the altar and spread a purple cloth over it.",
      "links": "<a href='/AIV/2/27/1-8'>Ex. 27:1-8</a>",
      "comment": "The altar, covered in purple—a royal color—signifies sacrifice and future kingship, foretelling Christ’s royal priesthood."
    },
    {
      "pk": 4004014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 14,
      "text": "They shall put on it all its utensils, with which they serve there—the fire pans, the forks, the shovels, the basins, all the vessels of the altar—and spread a covering of goatskin over it, and shall put its poles in place.",
      "links": "<a href='/AIV/3/6/9-10'>Lev. 6:9-10</a>",
      "comment": "The careful handling of these priestly tools reinforces that true worship involves both externals and spiritual reverence."
    },
    {
      "pk": 4004015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 15,
      "text": "When Aaron and his sons have finished covering the sanctuary and all the furnishings of the sanctuary, as the camp sets out, after that, the sons of Kohath shall come to carry these, but they must not touch the holy things, lest they die. These are the things of the tent of meeting that the sons of Kohath are to carry.",
      "links": "<a href='/AIV/4/7/9'>Num. 7:9</a>;<a href='/AIV/5/10/21'>Deut. 10:21</a>",
      "comment": "Only after the priests prepare everything may the Kohathites carry the objects, preserving the chain of sacred authority. It underscores the need for proper mediation in access to God, fulfilled in the New Covenant’s priesthood and discipline."
    },
    {
      "pk": 4004016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 16,
      "text": "Eleazar the son of Aaron the priest shall have charge of the oil for the light, the fragrant incense, the regular grain offering, and the anointing oil. He shall have oversight of all the tabernacle and all that is in it, of the sanctuary and its furnishings.",
      "links": "<a href='/AIV/2/27/20-21'>Ex. 27:20-21</a>;<a href='/AIV/3/24/1-2'>Lev. 24:1-2</a>",
      "comment": "Eleazar’s role is a model of stewardship for liturgical worship, pointing to the office of the high priest as a spiritual leader with authority over the sacred mysteries."
    },
    {
      "pk": 4004017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 17,
      "text": "The Lord spoke to Moses and Aaron, saying,",
      "links": "<a href='/AIV/4/4/1'>Num. 4:1</a>",
      "comment": "The repetition underscores the seriousness and divine origin of these commands."
    },
    {
      "pk": 4004018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 18,
      "text": "\"Do not let the tribe of the clans of the Kohathites be cut off from among the Levites.",
      "links": "<a href='/AIV/6/21/4'>Josh. 21:4</a>",
      "comment": "God makes special provision to protect the Kohathites, revealing that every role in God’s service is precious."
    },
    {
      "pk": 4004019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 19,
      "text": "But do this for them, that they may live and not die when they approach the most holy things: Aaron and his sons shall go in and appoint each to his service and to his burden;",
      "links": "<a href='/AIV/3/16/2'>Lev. 16:2</a>",
      "comment": "The priests must intercede even in practical matters, anticipating the New Testament requirement for order in worship and the necessity of mediation."
    },
    {
      "pk": 4004020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 20,
      "text": "but they shall not go in to look on the holy things even for a moment, lest they die.\"",
      "links": "<a href='/AIV/9/6/7'>2 Sam. 6:7</a>",
      "comment": "Access to God’s most holy presence is limited. It prepares for the mystery revealed only in Christ, who opens the sanctuary to all believers (see <a href='/AIV/58/10/19-22'>Heb. 10:19-22</a>)."
    },
    {
      "pk": 4004021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 21,
      "text": "The Lord spoke to Moses, saying,",
      "links": "<a href='/AIV/4/4/1'>Num. 4:1</a>",
      "comment": "Repetitions of God’s speech signify importance and certainty."
    },
    {
      "pk": 4004022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 22,
      "text": "\"Take a census of the sons of Gershon also, by their fathers' houses and by their clans.",
      "links": "<a href='/AIV/4/3/21'>Num. 3:21</a>",
      "comment": "The Levites are divided into particular families, each with distinct responsibilities, showing both diversity and unity in service—an image of the church’s diversity of gifts."
    },
    {
      "pk": 4004023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 23,
      "text": "From thirty years old and up to fifty years old, you shall number them, all who come to do duty, to serve in the tent of meeting.",
      "links": "<a href='/AIV/4/8/24'>Num. 8:24</a>",
      "comment": "As with the Kohathites, only mature men are chosen for this sacred work, a precedent for spiritual maturity in ministry."
    },
    {
      "pk": 4004024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 24,
      "text": "This is the service of the clans of the Gershonites, in serving and bearing burdens:",
      "links": "<a href='/AIV/4/26/57'>Num. 26:57</a>",
      "comment": "Each family received divinely appointed tasks, no role is unimportant in God’s purposes."
    },
    {
      "pk": 4004025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 25,
      "text": "They shall carry the curtains of the tabernacle and the tent of meeting, its covering and the covering of goatskin that is on top of it, and the screen for the entrance of the tent of meeting,",
      "links": "<a href='/AIV/2/26/7,14,36'>Ex. 26:7,14,36</a>",
      "comment": "The Gershonites are responsible for the tabernacle’s outer layers, ensuring the place of God’s meeting is protected and respected."
    },
    {
      "pk": 4004026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 26,
      "text": "and the hangings of the court, and the screen for the entrance of the court that is around the tabernacle and the altar, and their cords, all the equipment for their service, and whatever is to be done with them; they shall do.",
      "links": "<a href='/AIV/2/27/9-19'>Ex. 27:9-19</a>",
      "comment": "The external elements of the sanctuary point to the visible, structured aspect of worship. Structure ensures unity and order in communal worship."
    },
    {
      "pk": 4004027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 27,
      "text": "All the service of the sons of the Gershonites, in all their loads and in all their work, shall be according to the command of Aaron and his sons. You shall assign to them all their duties as their loads.",
      "links": "<a href='/AIV/4/3/9'>Num. 3:9</a>",
      "comment": "The orders come through the priestly line. This models a hierarchical structure in worship life, which is consistently seen in biblical revelation."
    },
    {
      "pk": 4004028,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 28,
      "text": "This is the service of the clans of the sons of Gershon at the tent of meeting, and their duties shall be under the direction of Ithamar the son of Aaron the priest.",
      "links": "<a href='/AIV/2/6/23'>Ex. 6:23</a>",
      "comment": "Ithamar, another priestly son, oversees the Gershonites. God's precise order reinforces the idea of apostolic succession and authority in the ministry."
    },
    {
      "pk": 4004029,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 29,
      "text": "As for the sons of Merari, you shall number them by their clans and by their fathers' houses.",
      "links": "<a href='/AIV/4/3/33'>Num. 3:33</a>",
      "comment": "Merarites have their own distinct role, portraying the importance of different charisms within the believing community."
    },
    {
      "pk": 4004030,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 30,
      "text": "From thirty years old and up to fifty years old, you shall number them, everyone who comes to do the service to carry the load in the tent of meeting.",
      "links": "<a href='/AIV/4/4/3'>Num. 4:3</a>",
      "comment": "The consistent age requirement suggests a standard of maturity and strength for sacred tasks—service is a privilege and responsibility."
    },
    {
      "pk": 4004031,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 31,
      "text": "And this is what they are entrusted to carry, as their entire service in the tent of meeting: the frames of the tabernacle, its bars, its pillars, and its bases,",
      "links": "<a href='/AIV/2/26/15-25'>Ex. 26:15-25</a>",
      "comment": "The Merarites bear the structural elements, vital yet hidden, a reminder that even the least visible service is essential in God's house."
    },
    {
      "pk": 4004032,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 32,
      "text": "and the pillars around the court with their bases, pegs, and cords, with all their equipment and all their accessories; and you shall list by name the objects that they are required to carry.",
      "links": "<a href='/AIV/2/27/17-19'>Ex. 27:17-19</a>",
      "comment": "Detailed records and responsibilities are kept, laying a foundation for ordered worship and the safeguarding of tradition."
    },
    {
      "pk": 4004033,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 33,
      "text": "This is the service of the clans of the sons of Merari, the whole of their service at the tent of meeting, under the direction of Ithamar the son of Aaron the priest.\"",
      "links": "<a href='/AIV/4/4/28'>Num. 4:28</a>",
      "comment": "The Merarites too are under priestly direction, signifying the unity and authority structure of God's people."
    },
    {
      "pk": 4004034,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 34,
      "text": "Moses and Aaron and the chiefs of the congregation numbered the sons of the Kohathites, by their clans and by their fathers' houses,",
      "links": "<a href='/AIV/4/4/2'>Num. 4:2</a>",
      "comment": "Moses and Aaron act on God’s instructions, displaying the relationship between leadership and obedience to God’s order."
    },
    {
      "pk": 4004035,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 35,
      "text": "from thirty years old and up to fifty years old, everyone who could come on duty for service in the tent of meeting.",
      "links": "<a href='/AIV/4/8/24'>Num. 8:24</a>",
      "comment": "Repetition emphasizes that divine service requires both discipline and vocation. The continuity of sacred ministry is vital."
    },
    {
      "pk": 4004036,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 36,
      "text": "And those listed by their clans were 2,750.",
      "links": "<a href='/AIV/4/3/28'>Num. 3:28</a>",
      "comment": "The census results show the care with which the sacred tasks were organized, paralleling accountability in ministry."
    },
    {
      "pk": 4004037,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 37,
      "text": "This was the number of the clans of the Kohathites, all who served in the tent of meeting, whom Moses and Aaron listed according to the commandment of the Lord by Moses.",
      "links": "<a href='/AIV/4/3/19'>Num. 3:19</a>",
      "comment": "Scripture carefully records each detail of service, showing God values order and faithfulness in even administrative aspects."
    },
    {
      "pk": 4004038,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 38,
      "text": "Those listed of the sons of Gershon, by their clans and by their fathers' houses,",
      "links": "<a href='/AIV/4/4/22'>Num. 4:22</a>",
      "comment": "Gershonites are recorded next, upholding the structure and unity among Israel’s ministers."
    },
    {
      "pk": 4004039,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 39,
      "text": "from thirty years old and up to fifty years old, everyone who could come on duty for service in the tent of meeting—",
      "links": "<a href='/AIV/4/4/23'>Num. 4:23</a>",
      "comment": "The age range again underscores fitness and proven character for sacred service."
    },
    {
      "pk": 4004040,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 40,
      "text": "those listed by their clans and by their fathers' houses were 2,630.",
      "links": "<a href='/AIV/4/3/22'>Num. 3:22</a>",
      "comment": "Accurate records are a mark of diligence in ministry."
    },
    {
      "pk": 4004041,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 41,
      "text": "This was the number of the clans of the sons of Gershon, all who served in the tent of meeting, whom Moses and Aaron listed according to the commandment of the Lord.",
      "links": "<a href='/AIV/4/4/27'>Num. 4:27</a>",
      "comment": "The ministries of the various Levitical groups all contribute to the one worship of the Lord."
    },
    {
      "pk": 4004042,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 42,
      "text": "Those listed of the clans of the sons of Merari, by their clans and by their fathers' houses,",
      "links": "<a href='/AIV/4/4/29'>Num. 4:29</a>",
      "comment": "The Merarite records show total participation and order."
    },
    {
      "pk": 4004043,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 43,
      "text": "from thirty years old and up to fifty years old, everyone who could come on duty for service in the tent of meeting—",
      "links": "<a href='/AIV/4/4/30'>Num. 4:30</a>",
      "comment": "Again the qualified, mature men are singled out."
    },
    {
      "pk": 4004044,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 44,
      "text": "those listed by their clans were 3,200.",
      "links": "<a href='/AIV/4/3/34'>Num. 3:34</a>",
      "comment": "Numbers matter, as every service and person is precious to God."
    },
    {
      "pk": 4004045,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 45,
      "text": "This was the number of the clans of the sons of Merari, whom Moses and Aaron listed according to the commandment of the Lord by Moses.",
      "links": "<a href='/AIV/4/4/33'>Num. 4:33</a>",
      "comment": "Final tally preserves the unity and accountability in the Lord’s house."
    },
    {
      "pk": 4004046,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 46,
      "text": "All those who were listed of the Levites, whom Moses and Aaron and the chiefs of Israel listed, by their clans and by their fathers' houses,",
      "links": "<a href='/AIV/4/3/39'>Num. 3:39</a>",
      "comment": "All the Levites are included, showing the completeness of the organization for worship."
    },
    {
      "pk": 4004047,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 47,
      "text": "from thirty years old and up to fifty years old, everyone who could come to do the service of ministry and the service of bearing burdens in the tent of meeting,",
      "links": "<a href='/AIV/4/4/3'>Num. 4:3</a>",
      "comment": "This summary reinforces that all service, both ceremonial and practical, is considered ministry in God’s eyes."
    },
    {
      "pk": 4004048,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 48,
      "text": "those listed were 8,580.",
      "links": "<a href='/AIV/4/3/39'>Num. 3:39</a>",
      "comment": "The final tally displays the scale and importance of organized, ordered liturgical life in ancient Israel, a model for structured and reverent worship today."
    },
    {
      "pk": 4004049,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 4,
      "verse": 49,
      "text": "According to the commandment of the Lord through Moses, they were listed, each one with his appointed service and his burden; thus they were listed by him, as the Lord commanded Moses.",
      "links": "<a href='/AIV/4/3/51'>Num. 3:51</a>",
      "comment": "Every role is divinely appointed and carefully recorded, affirming that all ministry, big or small, is God-ordained within the unity of God’s people. This anticipates New Testament teaching on the unity and diversity of spiritual gifts and the order of Christian worship (<a href='/AIV/46/12/4-28'>1 Cor. 12:4-28</a>)."
    }
  ],
  "translatedAt": "2025-12-24T01:30:39.733Z"
}