{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 35,
  "verses": [
    {
      "pk": 4035001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 1,
      "text": "The Lord spoke to Moses in the plains of Moab by the Jordan at Jericho, saying,",
      "links": "<a href='/AIV/4/33/50'>Num. 33:50</a>; <a href='/AIV/6/1/1'>Josh. 1:1</a>",
      "comment": "Moses receives instructions from God on the threshold of the Promised Land, emphasizing the completion of Israel's journey and establishing order before entering Canaan."
    },
    {
      "pk": 4035002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 2,
      "text": "\"Command the people of Israel to give to the Levites, from the inheritance of their possession, cities in which to dwell. And you shall also give the Levites pasturelands around the cities.\"",
      "links": "<a href='/AIV/6/21/2'>Josh. 21:2</a>; <a href='/AIV/13/6/54'>1 Chr. 6:54</a>",
      "comment": "God directs that the Levites, set apart for religious service, are to have cities and pasturelands among all the tribes, showing the importance of spiritual leadership within the community."
    },
    {
      "pk": 4035003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 3,
      "text": "\"They shall have the cities to dwell in, and their pasturelands shall be for their cattle, their livestock, and all their animals.\"",
      "links": "<a href='/AIV/4/35/2'>v. 2</a>",
      "comment": "The practical provision for the Levites points to the principle that those who serve the people in holy things are provided for by the wider community (<a href='/AIV/46/9/13'>1 Cor. 9:13-14</a>)."
    },
    {
      "pk": 4035004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 4,
      "text": "\"The pasturelands of the cities, which you shall give to the Levites, shall extend from the wall of the city outward a thousand cubits all around.\"",
      "links": "<a href='/AIV/6/21/8'>Josh. 21:8</a>",
      "comment": "God’s specific instructions for setting apart sacred space around each city highlight the need for boundaries between sacred and secular functions within the life of faith."
    },
    {
      "pk": 4035005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 5,
      "text": "\"You shall measure outside the city on the east side two thousand cubits, on the south side two thousand cubits, on the west side two thousand cubits, and on the north side two thousand cubits, with the city in the middle. This shall belong to them as pasturelands for their cities.\"",
      "links": "<a href='/AIV/4/35/4'>v. 4</a>",
      "comment": "This detailed measurement underscores both order and provision, modeling God’s design for structure and community (see <a href='/AIV/19/48/2'>Ps. 48:2</a> for the importance of holy space)."
    },
    {
      "pk": 4035006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 6,
      "text": "\"Among the cities that you give to the Levites, there shall be six cities of refuge, where you shall permit the manslayer to flee. And besides them you shall give forty-two cities.\"",
      "links": "<a href='/AIV/4/35/11'>v. 11</a>; <a href='/AIV/6/20/2'>Josh. 20:2</a>",
      "comment": "The cities of refuge symbolize God’s mercy and justice, and foreshadow sanctuary and forgiveness found in Christ (see <a href='/AIV/58/6/18'>Heb. 6:18</a>)."
    },
    {
      "pk": 4035007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 7,
      "text": "\"All the cities that you give to the Levites shall be forty-eight, both them and their pasturelands.\"",
      "links": "<a href='/AIV/6/21/41'>Josh. 21:41</a>",
      "comment": "The number 48 provides for widespread presence, integrating those set apart for spiritual office among all the tribes—an early model of unity, order, and authority in faith."
    },
    {
      "pk": 4035008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 8,
      "text": "\"As for the cities you shall give from the possession of the Israelites, from the larger tribes you shall give many, and from the smaller tribes you shall give few. Each, in proportion to its inheritance which it inherits, shall give of its cities to the Levites.\"",
      "links": "<a href='/AIV/4/26/54'>Num. 26:54</a>",
      "comment": "Each tribe’s contribution is based on its size—depicting equity in responsibility and a pattern for shared stewardship."
    },
    {
      "pk": 4035009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 9,
      "text": "The Lord spoke to Moses, saying,",
      "links": "<a href='/AIV/4/35/1'>v. 1</a>",
      "comment": "A new section begins, indicating the special revelation regarding justice and mercy in the land."
    },
    {
      "pk": 4035010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 10,
      "text": "\"Speak to the people of Israel and say to them, When you cross over the Jordan into the land of Canaan,",
      "links": "<a href='/AIV/6/3/17'>Josh. 3:17</a>",
      "comment": "The promise of justice and sanctuary is anchored to the fulfillment of entering the promised land."
    },
    {
      "pk": 4035011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 11,
      "text": "\"then you shall designate cities to be cities of refuge for you, so that the manslayer who kills any person unintentionally may flee there.\"",
      "links": "<a href='/AIV/5/19/4'>Deut. 19:4</a>; <a href='/AIV/6/20/2'>Josh. 20:2</a>",
      "comment": "These cities illustrate the principle of sanctuary—reserving judgment and offering protection, foreshadowing spiritual refuge realized in Christ."
    },
    {
      "pk": 4035012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 12,
      "text": "\"These cities shall be for you a refuge from the avenger, that the manslayer may not die until he stands before the congregation for judgment.\"",
      "links": "<a href='/AIV/6/20/6'>Josh. 20:6</a>",
      "comment": "Judicial due process is emphasized: punishment is not arbitrary. The congregation as judge foreshadows the Church’s role in discernment (<a href='/AIV/40/18/17'>Matt. 18:17</a>)."
    },
    {
      "pk": 4035013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 13,
      "text": "\"The cities which you give shall be your six cities of refuge.\"",
      "links": "<a href='/AIV/4/35/6'>v. 6</a>;<a href='/AIV/6/20/7'>Josh. 20:7</a>",
      "comment": "The six cities form an accessible network of sanctuary, signifying comprehensive mercy available across the land."
    },
    {
      "pk": 4035014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 14,
      "text": "\"You shall give three cities across the Jordan, and three cities in the land of Canaan, as cities of refuge.\"",
      "links": "<a href='/AIV/5/4/41'>Deut. 4:41-43</a>",
      "comment": "Salvation and justice are accessible to all Israelites, regardless of location—pointing to the inclusive scope of God’s plan."
    },
    {
      "pk": 4035015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 15,
      "text": "\"These six cities shall be a refuge for the people of Israel, and for the stranger and for the sojourner among them, that anyone who kills a person unintentionally may flee there.\"",
      "links": "<a href='/AIV/4/9/14'>Num. 9:14</a>",
      "comment": "The law grants refuge not only for Israelites, but also for foreigners, showing the universality of God’s justice and mercy—an anticipation of the inclusion of the Gentiles (<a href='/AIV/49/2/13'>Eph. 2:13-19</a>)."
    },
    {
      "pk": 4035016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 16,
      "text": "\"But if he struck him with an iron object, and he dies, he is a murderer; the murderer shall surely be put to death.\"",
      "links": "<a href='/AIV/3/24/17'>Lev. 24:17</a>",
      "comment": "Deliberate murder receives the highest penalty. Justice here is both a deterrent and a means of protecting community holiness."
    },
    {
      "pk": 4035017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 17,
      "text": "\"And if he struck him with a stone in the hand, by which a person could die, and he dies, he is a murderer; the murderer shall surely be put to death.\"",
      "links": "<a href='/AIV/3/24/21'>Lev. 24:21</a>",
      "comment": "The law specifies instruments of death to clarify intentionality and uphold righteous standards of justice."
    },
    {
      "pk": 4035018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 18,
      "text": "\"Or if he struck him with a wooden object in the hand, by which a person could die, and he dies, he is a murderer; the murderer shall surely be put to death.\"",
      "links": "<a href='/AIV/4/35/16'>v. 16</a>",
      "comment": "Similar judgment for other murderous acts—emphasizing equal justice for all."
    },
    {
      "pk": 4035019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 19,
      "text": "\"The avenger of blood himself shall put the murderer to death; when he meets him, he shall put him to death.\"",
      "links": "<a href='/AIV/3/25/48-49'>Lev. 25:48-49</a>",
      "comment": "The responsibility of the avenger reaffirms the importance of kin in ancient Israel and anticipates later teaching of mercy over vengeance in the New Covenant (<a href='/AIV/45/12/19'>Rom. 12:19</a>)."
    },
    {
      "pk": 4035020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 20,
      "text": "\"If he pushed him out of hatred, or hurled something at him lying in wait, so that he dies,",
      "links": "<a href='/AIV/5/19/11'>Deut. 19:11</a>",
      "comment": "Intention matters in God's eyes; hatred is the root of murder. Jesus deepens this principle in <a href='/AIV/40/5/21-22'>Matt. 5:21-22</a>."
    },
    {
      "pk": 4035021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 21,
      "text": "or in enmity struck him down with his hand so that he dies, then he who struck him shall surely be put to death; he is a murderer. The avenger of blood shall put the murderer to death when he meets him.",
      "links": "<a href='/AIV/4/35/19'>v. 19</a>",
      "comment": "Premeditated violence is condemned. The imagery of 'enmity' links to the deeper spiritual roots of sin."
    },
    {
      "pk": 4035022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 22,
      "text": "\"But if he pushed him suddenly without enmity, or threw anything on him without lying in wait,",
      "links": "<a href='/AIV/4/35/11'>v. 11</a>",
      "comment": "This passage distinguishes accidental killing from murder, introducing the principle of mercy and gradations of sin—prefiguring the need for grace and reconciliation."
    },
    {
      "pk": 4035023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 23,
      "text": "or with any stone, by which a person could die, and without seeing him, dropped it on him so that he dies, though he was not his enemy and did not seek his harm,",
      "links": "<a href='/AIV/4/35/22'>v. 22</a>",
      "comment": "Further clarifies what constitutes unintentional killing—pointing toward both personal conscience and the discernment of the community in sin and reconciliation."
    },
    {
      "pk": 4035024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 24,
      "text": "then the congregation shall judge between the manslayer and the avenger of blood, according to these rules.",
      "links": "<a href='/AIV/4/27/2'>Num. 27:2'>Num. 27:2</a>",
      "comment": "The corporate community acts as judge; this authority to bind and loose is echoed in the New Testament (<a href='/AIV/40/18/18'>Matt. 18:18</a>)."
    },
    {
      "pk": 4035025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 25,
      "text": "The congregation shall rescue the manslayer from the hand of the avenger of blood, and the congregation shall return him to his city of refuge where he had fled. And he shall stay in it until the death of the high priest who was anointed with the holy oil.",
      "links": "<a href='/AIV/3/4/3'>Lev. 4:3</a>; <a href='/AIV/6/20/6'>Josh. 20:6</a>",
      "comment": "Release is tied to the death of the high priest—prefiguring Christ’s role as eternal High Priest (<a href='/AIV/58/9/12'>Heb. 9:12</a>), whose atoning death brings final release and reconciliation."
    },
    {
      "pk": 4035026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 26,
      "text": "\"But if the manslayer shall at any time go beyond the boundaries of his city of refuge to which he fled,",
      "links": "<a href='/AIV/4/35/25'>v. 25</a>",
      "comment": "Safety was conditional upon remaining within the city of refuge—reflecting the limits and obligations of the law prior to the grace of Christ."
    },
    {
      "pk": 4035027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 27,
      "text": "and the avenger of blood finds him outside the boundary of his city of refuge, and the avenger of blood kills the manslayer, he shall not be guilty of blood.",
      "links": "<a href='/AIV/4/35/19'>v. 19</a>",
      "comment": "Protection depends on remaining within the sanctuary—an image that points toward the importance of abiding within God's provision and grace."
    },
    {
      "pk": 4035028,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 28,
      "text": "For the manslayer must remain in his city of refuge until the death of the high priest; but after the death of the high priest the manslayer may return to the land of his own possession.",
      "links": "<a href='/AIV/4/35/25'>v. 25</a>; <a href='/AIV/6/20/6'>Josh. 20:6</a>",
      "comment": "Liberty and restoration are connected to the high priest's death. This symbolically anticipates full reconciliation through the final High Priest, Christ."
    },
    {
      "pk": 4035029,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 29,
      "text": "\"And these things shall be for a statute and rule for you throughout your generations in all your dwelling places.\"",
      "links": "<a href='/AIV/4/10/8'>Num. 10:8</a>",
      "comment": "A perpetual statute shows the enduring nature of God’s justice and mercy; the principle remains relevant across time and place."
    },
    {
      "pk": 4035030,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 30,
      "text": "\"If anyone kills a person, the murderer shall be put to death at the evidence of witnesses. But one witness is not enough to put a person to death.\"",
      "links": "<a href='/AIV/5/17/6'>Deut. 17:6</a>; <a href='/AIV/40/18/16'>Matt. 18:16</a>",
      "comment": "Due process and confirmation by multiple witnesses are rooted in the law and echoed in the Church’s process of discernment."
    },
    {
      "pk": 4035031,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 31,
      "text": "\"Moreover, you shall accept no ransom for the life of a murderer, who is guilty of death, but he shall surely be put to death.\"",
      "links": "<a href='/AIV/4/35/16'>v. 16</a>",
      "comment": "Life is sacred and cannot be bought with money, emphasizing the dignity of every person."
    },
    {
      "pk": 4035032,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 32,
      "text": "\"And you shall accept no ransom for him who has fled to his city of refuge, that he may return to dwell in the land before the death of the high priest.\"",
      "links": "<a href='/AIV/4/35/25'>v. 25</a>",
      "comment": "Release is tied to the high priest, not to human arrangements; the high priest’s significance points toward spiritual mediation."
    },
    {
      "pk": 4035033,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 33,
      "text": "\"You shall not pollute the land in which you live, for blood pollutes the land, and there can be no atonement for the land for the blood that is shed in it, except by the blood of the one who shed it.\"",
      "links": "<a href='/AIV/1/4/10'>Gen. 4:10</a>; <a href='/AIV/3/18/25'>Lev. 18:25</a>",
      "comment": "Bloodguilt affects the whole community and land; ultimate atonement for sin is only found in the shedding of blood—a reality fulfilled in Christ’s atoning sacrifice (<a href='/AIV/58/9/22'>Heb. 9:22</a>)."
    },
    {
      "pk": 4035034,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 35,
      "verse": 34,
      "text": "\"You shall not defile the land in which you live, in the midst of which I dwell; for I the LORD dwell in the midst of the people of Israel.\"",
      "links": "<a href='/AIV/2/29/45'>Ex. 29:45</a>; <a href='/AIV/3/26/12'>Lev. 26:12</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "God’s presence sanctifies the land and nation; purity of life among God’s people is necessary for genuine fellowship with Him, prefiguring the principle of the indwelling Spirit and holy temple (<a href='/AIV/46/3/16'>1 Cor. 3:16</a>)."
    }
  ],
  "translatedAt": "2025-12-24T01:55:31.750Z"
}