{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 10,
  "verses": [
    {
      "pk": 4010001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 1,
      "text": "The LORD spoke to Moses, saying,",
      "links": "",
      "comment": "God initiating direct communication with Moses is a recurring pattern (cf. Ex. 25:1), emphasizing the authority through a chosen mediator."
    },
    {
      "pk": 4010002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 2,
      "text": "\"Make two silver trumpets for yourself; you shall make them of hammered work. They will be for summoning the congregation and for directing the movement of the camps.\"",
      "links": "<a href='/AIV/2/25/10-22'>Ex. 25:10–22</a>; <a href='/AIV/3/23/24'>Lev. 23:24</a>",
      "comment": "The use of silver and precise craftsmanship points toward ceremonial and sacred usage. Silver often signifies purity and redemption (cf. Ex. 30:13). Trumpets are later symbolic in Christian liturgy (cf. 1 Cor. 15:52; Rev. 8:2)."
    },
    {
      "pk": 4010003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 3,
      "text": "\"When both are blown, all the congregation will gather before you at the entrance to the Tent of Meeting.\"",
      "links": "<a href='/AIV/2/33/7'>Ex. 33:7</a>; <a href='/AIV/3/8/9'>Lev. 8:9</a>",
      "comment": "All of God's people are summoned together through a sacred sign. This prefigures the gathering of believers by divine call, an assembly unified under spiritual authority."
    },
    {
      "pk": 4010004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 4,
      "text": "\"But if only one is blown, then the leaders, the heads of the thousands of Israel, will gather to you.\"",
      "links": "<a href='/AIV/2/18/25'>Ex. 18:25</a>",
      "comment": "A single trumpet calls leadership specifically, distinguishing between the whole assembly and its leaders. The structure hints at a church hierarchy, where specific calls are given to those with spiritual oversight."
    },
    {
      "pk": 4010005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 5,
      "text": "\"When you sound the alarm, the camps on the east side must set out.\"",
      "links": "<a href='/AIV/4/2/3-9'>Num. 2:3-9</a>",
      "comment": "Order and obedience mark the movements of God's people. The alarm blast is distinct from the assembly blast, showing God’s concern for clear organization."
    },
    {
      "pk": 4010006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 6,
      "text": "\"When you sound the alarm a second time, the camps on the south side must set out. Alarms must be sounded whenever they are to set out.\"",
      "links": "<a href='/AIV/4/2/10-16'>Num. 2:10-16</a>",
      "comment": "Order and unity through distinct signals reinforce the need for one central authority directing God's people."
    },
    {
      "pk": 4010007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 7,
      "text": "\"But when the assembly is to be gathered together, you shall blow, but not with the sound of alarm.\"",
      "links": "<a href='/AIV/3/23/24'>Lev. 23:24</a>",
      "comment": "Different occasions call for different actions; ritual actions in worship must be distinct from military or procedural signals, showing God's attention to precise order (cf. 1 Cor. 14:40)."
    },
    {
      "pk": 4010008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 8,
      "text": "\"The sons of Aaron, the priests, shall blow the trumpets. This shall be a statute forever throughout your generations.\"",
      "links": "<a href='/AIV/3/6/22-27'>Lev. 6:22–27</a>; <a href='/AIV/4/16/40'>Num. 16:40</a>",
      "comment": "Priests alone are permitted these sacred rituals, marking an exclusive role for the priesthood in leading worship—a pattern later fulfilled in ordained ministry."
    },
    {
      "pk": 4010009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 9,
      "text": "\"When you go out to war in your land against an enemy who oppresses you, then you shall sound the alarm with the trumpets, that you may be remembered before the LORD your God, and you shall be saved from your enemies.\"",
      "links": "<a href='/AIV/6/6/20'>Josh. 6:20</a>; <a href='/AIV/19/106/4'>Ps. 106:4</a>",
      "comment": "Sounding the trumpet is both a practical call and an invocation for divine intervention. The remembrance by God prefigures the power of liturgical remembrance in worship, especially the role of sacrifice and prayer in salvation history."
    },
    {
      "pk": 4010010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 10,
      "text": "\"On the day of your gladness also, and at your appointed feasts and at the beginnings of your months, you shall blow the trumpets over your burnt offerings and over the sacrifices of your peace offerings; they shall be a memorial before your God: I am the LORD your God.\"",
      "links": "<a href='/AIV/3/23/2'>Lev. 23:2</a>; <a href='/AIV/4/28/11'>Num. 28:11</a>",
      "comment": "Sacrifice, feasting, and sacred music are united in worship. The idea of memorial is foundational for Christian worship, anticipating the memorial of Christ’s sacrifice (cf. Luke 22:19; 1 Cor. 11:24-25)."
    },
    {
      "pk": 4010011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 11,
      "text": "In the second year, in the second month, on the twentieth day of the month, the cloud was lifted from above the Tabernacle of the Testimony.",
      "links": "<a href='/AIV/2/40/36'>Ex. 40:36</a>; <a href='/AIV/4/9/15-23'>Num. 9:15-23</a>",
      "comment": "The movement of the cloud is the movement of God's manifest presence. The reliance on signs echoes the way God still guides His people."
    },
    {
      "pk": 4010012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 12,
      "text": "So the people of Israel set out from the Wilderness of Sinai, and the cloud rested in the Wilderness of Paran.",
      "links": "<a href='/AIV/5/1/19'>Deut. 1:19</a>",
      "comment": "The movement is at God’s initiative, not the people’s. Spiritual progress depends on God’s timing, not merely human initiative."
    },
    {
      "pk": 4010013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 13,
      "text": "They set out for the first time at the command of the LORD by Moses.",
      "links": "<a href='/AIV/4/9/23'>Num. 9:23</a>",
      "comment": "Obedience to divinely appointed leadership is again highlighted, an early image of the need for the faithful to follow God’s chosen leaders."
    },
    {
      "pk": 4010014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 14,
      "text": "The standard of the camp of the people of Judah moved out first by their divisions, with Nahshon the son of Amminadab as commander.",
      "links": "<a href='/AIV/4/2/3'>Num. 2:3</a>; <a href='/AIV/5/33/7'>Deut. 33:7</a>",
      "comment": "Judah leads, consistent with the promise of leadership through Judah’s line (cf. Gen. 49:10; Matt. 1:2-3). Ultimately, Christ comes from this line."
    },
    {
      "pk": 4010015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 15,
      "text": "Nethanel the son of Zuar was over the division of the tribe of Issachar.",
      "links": "<a href='/AIV/4/2/5'>Num. 2:5</a>",
      "comment": "Tribal leaders are specifically named, underlining the integrity and continuity within God’s ordained structure."
    },
    {
      "pk": 4010016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 16,
      "text": "Eliab the son of Helon was over the division of the tribe of Zebulun.",
      "links": "<a href='/AIV/4/2/7'>Num. 2:7</a>",
      "comment": "Each tribe is under leadership, reflecting the unity yet diversity of God’s people gathered in one body."
    },
    {
      "pk": 4010017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 17,
      "text": "Then the Tabernacle was taken down, and the sons of Gershon and the sons of Merari, who carried the Tabernacle, set out.",
      "links": "<a href='/AIV/4/3/17-27'>Num. 3:17–27</a>",
      "comment": "The Levites’ service in carrying the sanctuary points to designated roles within the worshiping community—liturgical service is not arbitrary but given to a dedicated group."
    },
    {
      "pk": 4010018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 18,
      "text": "The standard of the camp of Reuben set out by their divisions, with Elizur the son of Shedeur as commander.",
      "links": "<a href='/AIV/4/2/10'>Num. 2:10</a>",
      "comment": "The clear order continues. All tribes proceed under arranged order, reminding believers of the need for discipline and unity in community."
    },
    {
      "pk": 4010019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 19,
      "text": "Shelumiel the son of Zurishaddai was over the division of the tribe of Simeon.",
      "links": "<a href='/AIV/4/2/12'>Num. 2:12</a>",
      "comment": "Naming the leaders upholds the importance of historical continuity. Their service is remembered in sacred Scripture."
    },
    {
      "pk": 4010020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 20,
      "text": "Eliasaph the son of Deuel was over the division of the tribe of Gad.",
      "links": "<a href='/AIV/4/2/14'>Num. 2:14</a>",
      "comment": "All tribes are accountable and known by name. Leadership is always personal, not just a structural necessity."
    },
    {
      "pk": 4010021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 21,
      "text": "Then the Kohathites set out, carrying the holy things, and the Tabernacle was set up before their arrival.",
      "links": "<a href='/AIV/4/3/27-32'>Num. 3:27–32</a>",
      "comment": "Transporting the sacred objects is a high and holy role reserved for a chosen family. Sacred things should be handled with reverence—anticipating the reverence in Christian liturgy."
    },
    {
      "pk": 4010022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 22,
      "text": "The standard of the camp of the people of Ephraim set out by their divisions, with Elishama the son of Ammihud as commander.",
      "links": "<a href='/AIV/4/2/18'>Num. 2:18</a>",
      "comment": "Placement of the camp is intentional, reflecting both spiritual and practical concerns. Order in worship leads to order in life."
    },
    {
      "pk": 4010023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 23,
      "text": "Gamaliel the son of Pedahzur was over the division of the tribe of Manasseh.",
      "links": "<a href='/AIV/4/2/20'>Num. 2:20</a>",
      "comment": "These details affirm historical accuracy, as well as God’s concern for each portion of His people."
    },
    {
      "pk": 4010024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 24,
      "text": "Abidan the son of Gideoni was over the division of the tribe of Benjamin.",
      "links": "<a href='/AIV/4/2/22'>Num. 2:22</a>",
      "comment": "Benjamin’s inclusion with Ephraim and Manasseh foreshadows their future roles in salvation history."
    },
    {
      "pk": 4010025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 25,
      "text": "Then the standard of the camp of the people of Dan, forming the rear guard for all the camps, set out by their divisions, with Ahiezer the son of Ammishaddai as commander.",
      "links": "<a href='/AIV/4/2/25'>Num. 2:25</a>",
      "comment": "The rear guard is both an honor and a responsibility, ensuring unity and protection for the community."
    },
    {
      "pk": 4010026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 26,
      "text": "Pahiel the son of Ochran was over the division of the tribe of Asher.",
      "links": "<a href='/AIV/4/2/27'>Num. 2:27</a>",
      "comment": "All tribes are coordinated, emphasizing the unity of one people of God, much like the many members in one body (cf. 1 Cor. 12:12)."
    },
    {
      "pk": 4010027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 27,
      "text": "Ahira the son of Enan was over the division of the tribe of Naphtali.",
      "links": "<a href='/AIV/4/2/29'>Num. 2:29</a>",
      "comment": "Naphtali’s position in the order reminds believers all parts of the community are significant in the divine plan."
    },
    {
      "pk": 4010028,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 28,
      "text": "This was the order of march for the people of Israel by their armies, when they set out.",
      "links": "<a href='/AIV/4/2/34'>Num. 2:34</a>",
      "comment": "Repetition confirms the importance of divine order and discipline—marks of faithful worship and service."
    },
    {
      "pk": 4010029,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 29,
      "text": "Moses said to Hobab the son of Reuel the Midianite, Moses’s father-in-law, \"We are setting out for the place of which the LORD said, 'I will give it to you.' Come with us, and we will treat you well, for the LORD has promised good to Israel.\"",
      "links": "<a href='/AIV/2/2/18'>Ex. 2:18</a>; <a href='/AIV/1/12/2-3'>Gen. 12:2–3</a>",
      "comment": "Hospitality and invitation to join God’s people foreshadow future inclusion of outsiders into the covenant community, anticipating broader mission (cf. Acts 10:34-35)."
    },
    {
      "pk": 4010030,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 30,
      "text": "But he said to him, \"I will not go; I will return to my own land and to my relatives.\"",
      "links": "",
      "comment": "The tension between attachment to origins and call to join God’s people—a spiritual struggle mirrored in every conversion journey."
    },
    {
      "pk": 4010031,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 31,
      "text": "But Moses said, \"Please do not leave us, for you know where we should camp in the wilderness, and you will act as eyes for us.\"",
      "links": "",
      "comment": "Moses values wisdom and experience from outside the immediate community. The humility to seek help foreshadows the Church’s use of tradition and reason, along with revelation."
    },
    {
      "pk": 4010032,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 32,
      "text": "\"And if you go with us, whatever good the LORD will do to us, we will do the same to you.\"",
      "links": "<a href='/AIV/1/12/3'>Gen. 12:3</a>",
      "comment": "The blessings of God’s people are generously offered to others—early evidence of the universal call to salvation."
    },
    {
      "pk": 4010033,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 33,
      "text": "So they set out from the mount of the LORD three days’ journey; and the Ark of the Covenant of the LORD went before them for the three days’ journey, to seek out a place for them to rest.",
      "links": "<a href='/AIV/2/25/22'>Ex. 25:22</a>; <a href='/AIV/5/1/33'>Deut. 1:33</a>",
      "comment": "The centrality of the Ark, the sign of God’s presence, going before them to prepare rest, prefigures Christ who goes before us to prepare a place (cf. John 14:2-3; Heb. 4:8-10)."
    },
    {
      "pk": 4010034,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 34,
      "text": "And the cloud of the LORD was over them by day, when they set out from the camp.",
      "links": "<a href='/AIV/2/13/21-22'>Ex. 13:21–22</a>",
      "comment": "The divine cloud assures protection and guidance. The visible presence foreshadows the real spiritual presence in God’s continued guidance for His people."
    },
    {
      "pk": 4010035,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 35,
      "text": "Whenever the Ark set out, Moses said, \"Rise up, O LORD! Let your enemies be scattered, and let those who hate you flee before you!\"",
      "links": "<a href='/AIV/19/68/1'>Ps. 68:1</a>",
      "comment": "Moses’ invocation highlights the need for God’s leadership in battle, prefiguring Christ’s victory over sin and evil (cf. 1 Cor. 15:25). Moses acts in a mediating role—both leader and intercessor."
    },
    {
      "pk": 4010036,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 10,
      "verse": 36,
      "text": "And when it rested, he said, \"Return, O LORD, to the countless thousands of Israel!\"",
      "links": "<a href='/AIV/3/26/51'>Lev. 26:51</a>",
      "comment": "A prayer for God’s abiding presence upon rest—foreshadows the Church’s invocation for God to dwell continually among His people, especially through sacred signs and prayers."
    }
  ],
  "translatedAt": "2025-12-24T01:35:02.855Z"
}