{
  "book": 4,
  "bookName": "Numbers",
  "bookAbbreviation": "Num",
  "chapter": 34,
  "verses": [
    {
      "pk": 4034001,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 1,
      "text": "Then the LORD spoke to Moses, saying:",
      "links": "<a href='/AIV/4/33/50'>Num. 33:50</a>",
      "comment": "This introduction marks another direct speech from God to Moses, like previous sections establishing Israel’s covenantal inheritance. See similar pattern in Num. 33:50."
    },
    {
      "pk": 4034002,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 2,
      "text": "\"Command the children of Israel, and say to them: 'When you enter the land of Canaan, the territory which will fall to you as an inheritance—the land of Canaan with its boundaries—",
      "links": "<a href='/AIV/4/13/2'>Num. 13:2</a>; <a href='/AIV/6/13/6'>Josh. 13:6</a>",
      "comment": "God emphasizes divine authority over the allocation of land, seen in inheritance language. This points to Church’s understanding of divine gift and promise in spiritual inheritance. Compare Num. 13:2 and Josh. 13:6."
    },
    {
      "pk": 4034003,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 3,
      "text": "\"'Your southern border will be from the Wilderness of Zin alongside Edom. Your southern boundary will start at the end of the Salt Sea on the east.",
      "links": "<a href='/AIV/6/15/1'>Josh. 15:1</a>",
      "comment": "The detailed land boundaries show God’s concern for order and established tradition. The enumeration of borders recalls the significance of tradition and apostolic foundation in spiritual life. See also Josh. 15:1."
    },
    {
      "pk": 4034004,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 4,
      "text": "And your boundary will turn south of the Ascent of Akrabbim, pass through Zin, continue south of Kadesh-barnea, go to Hazar-addar, and pass along to Azmon.",
      "links": "<a href='/AIV/6/15/3'>Josh. 15:3</a>",
      "comment": "Border language echoes the Church’s teaching of spiritual journey, just as Israelites progress through designated places toward the Promised Land. See Josh. 15:3."
    },
    {
      "pk": 4034005,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 5,
      "text": "The border will turn from Azmon to the Brook of Egypt, and end at the sea.",
      "links": "<a href='/AIV/1/15/18'>Gen. 15:18</a>",
      "comment": "The Brook of Egypt marks the southwestern extent. The detailed attention highlights the lasting, visible sign of the covenant—symbolic of the visible nature of the Church. See Gen. 15:18’s promise to Abraham."
    },
    {
      "pk": 4034006,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 6,
      "text": "\"'For the western border, you will have the Great Sea as a boundary; this will be your western boundary.",
      "links": "<a href='/AIV/6/15/47'>Josh. 15:47</a>",
      "comment": "The western limit is the Mediterranean, setting a physical and symbolic end that echoes both the finality and unity of the Church as God’s people. See Josh. 15:47."
    },
    {
      "pk": 4034007,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 7,
      "text": "\"'This will be your northern border: From the Great Sea you will mark your border to Mount Hor;",
      "links": "<a href='/AIV/4/20/22'>Num. 20:22</a>",
      "comment": "Mount Hor’s mention invokes memory of spiritual milestones, such as Moses’ journey. These prescribed boundaries demonstrate God’s desire for order and unity among his people. See Num. 20:22."
    },
    {
      "pk": 4034008,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 8,
      "text": "From Mount Hor you will draw a line to Lebo-Hamath, and the border will reach to Zedad.",
      "links": "<a href='/AIV/6/13/5'>Josh. 13:5</a>",
      "comment": "The tracing from Hor to Lebo-Hamath reinforces the principle of a divinely given inheritance, as echoed in Josh. 13:5. Spiritual boundaries are also defined and safeguarded by God’s authority."
    },
    {
      "pk": 4034009,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 9,
      "text": "The border continues to Ziphron and Hazar-enan. This will be your northern border.",
      "links": "<a href='/AIV/26/47/17'>Ezek. 47:17</a>",
      "comment": "The precise description preserves Israel’s distinct identity, foreshadowing the call for the Church to maintain the faith entrusted by Christ without alteration. See Ezek. 47:17."
    },
    {
      "pk": 4034010,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 10,
      "text": "\"'You will delineate the eastern border from Hazar-enan to Shepham.",
      "links": "<a href='/AIV/4/34/9'>Num. 34:9</a>",
      "comment": "The establishment of clear borders reflects the need for clarity in doctrine and community life—a principle extended to spiritual boundaries for God’s people."
    },
    {
      "pk": 4034011,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 11,
      "text": "The border will go down from Shepham to Riblah on the east side of Ain, descend and reach the eastern edge of the Sea of Chinnereth.",
      "links": "<a href='/AIV/5/3/17'>Deut. 3:17</a>",
      "comment": "The Sea of Chinnereth (Galilee) foreshadows the centrality of this region in Jesus’ ministry, providing a subtle link between Old Testament inheritance and New Testament fulfillment. See Deut. 3:17."
    },
    {
      "pk": 4034012,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 12,
      "text": "Then the border will go down to the Jordan, and end at the Salt Sea. This will be your land with its boundaries all around.'\"",
      "links": "<a href='/AIV/6/15/5'>Josh. 15:5</a>",
      "comment": "The boundaries include Jordan and the Salt Sea (Dead Sea), setting a territory that will become the stage for Israel’s spiritual history and Christ’s mission. Josh. 15:5 reflects these same limits."
    },
    {
      "pk": 4034013,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 13,
      "text": "So Moses commanded the Israelites: \"This is the land you will divide by lot, which the LORD has commanded to give to the nine and a half tribes.",
      "links": "<a href='/AIV/4/26/55'>Num. 26:55</a>; <a href='/AIV/6/14/2'>Josh. 14:2</a>",
      "comment": "Dividing the land by lot stresses God’s sovereignty and guidance, echoing the practice of appointment by divine authority, comparable to apostolic succession. See Num. 26:55 and Josh. 14:2."
    },
    {
      "pk": 4034014,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 14,
      "text": "For the tribe of the descendants of Reuben and the tribe of Gad received their inheritance according to their families, and half the tribe of Manasseh have received their inheritance.",
      "links": "<a href='/AIV/4/32/33'>Num. 32:33</a>",
      "comment": "East of Jordan inheritance represents God’s inclusive plan while holding to tradition. The familial aspect highlights the importance of spiritual lineage and continuity. See Num. 32:33."
    },
    {
      "pk": 4034015,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 15,
      "text": "The two and a half tribes have received their inheritance beyond the Jordan, east of Jericho, toward the sunrise.\"",
      "links": "<a href='/AIV/6/13/8'>Josh. 13:8</a>",
      "comment": "The eastern territories, though separated by Jordan, are not outside the Promised Land—God’s fidelity extends beyond boundaries. See Josh. 13:8 for further division details."
    },
    {
      "pk": 4034016,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 16,
      "text": "And the LORD spoke to Moses, saying:",
      "links": "<a href='/AIV/4/34/1'>Num. 34:1</a>",
      "comment": "Marks transition to the subject of leadership for land distribution. Direct communication from God reinforces the importance of fidelity to divine instruction."
    },
    {
      "pk": 4034017,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 17,
      "text": "\"These are the names of the men who shall divide the land for you: Eleazar the priest and Joshua son of Nun.",
      "links": "<a href='/AIV/6/19/51'>Josh. 19:51</a>; <a href='/AIV/4/27/22'>Num. 27:22</a>",
      "comment": "Divine appointment of a priest and a leader for this sacred task points to the necessity of ordered ministry and apostolic authority in the life of God’s people. See Josh. 19:51."
    },
    {
      "pk": 4034018,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 18,
      "text": "You shall appoint one leader from each tribe to divide the land for inheritance.",
      "links": "<a href='/AIV/4/1/4'>Num. 1:4</a>",
      "comment": "The role of tribal leaders demonstrates the principle of united authority under God, foreshadowing the collegiality seen later in Church governance. Compare Num. 1:4."
    },
    {
      "pk": 4034019,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 19,
      "text": "These are the names of the men: from the tribe of Judah, Caleb son of Jephunneh;",
      "links": "<a href='/AIV/6/14/6'>Josh. 14:6</a>",
      "comment": "The selection of recognized faithful leaders, such as Caleb, ties earthly inheritance to spiritual faithfulness. See Josh. 14:6."
    },
    {
      "pk": 4034020,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 20,
      "text": "From the tribe of Simeon, Shemuel son of Ammihud;",
      "links": "<a href='/AIV/6/19/1'>Josh. 19:1</a>",
      "comment": "Every tribe’s leader is listed, showing the necessity of representation and unity in community. This mirrors the spiritual principle of unity through appointed shepherds. See Josh. 19:1."
    },
    {
      "pk": 4034021,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 21,
      "text": "From the tribe of Benjamin, Elidad son of Chislon;",
      "links": "<a href='/AIV/6/18/21'>Josh. 18:21</a>",
      "comment": "Benjamin’s territory becomes the site of Jerusalem, further foreshadowing the center of God’s dwelling among his people. See Josh. 18:21."
    },
    {
      "pk": 4034022,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 22,
      "text": "From the tribe of Dan, Bukki son of Jogli;",
      "links": "<a href='/AIV/6/19/40'>Josh. 19:40</a>",
      "comment": "Note the attention to every tribe, reinforcing the inclusion of all who share in the covenant promises. See Josh. 19:40."
    },
    {
      "pk": 4034023,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 23,
      "text": "From the descendants of Joseph, for the tribe of Manasseh, Hanniel son of Ephod;",
      "links": "<a href='/AIV/6/17/2'>Josh. 17:2</a>",
      "comment": "Division continues through the Joseph tribes by name—underscoring respect for tradition and spiritual lineage. See Josh. 17:2."
    },
    {
      "pk": 4034024,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 24,
      "text": "And for the tribe of Ephraim, Kemuel son of Shiphtan;",
      "links": "<a href='/AIV/6/16/3'>Josh. 16:5</a>",
      "comment": "The continuous tribal listing highlights the role of appointed leaders in distributing spiritual inheritance."
    },
    {
      "pk": 4034025,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 25,
      "text": "From the tribe of Zebulun, Elizaphan son of Parnach;",
      "links": "<a href='/AIV/6/19/10'>Josh. 19:10</a>",
      "comment": "Zebulun’s mention is notable for its association with prophecy of the Messiah’s ministry in Galilee. See Isa. 9:1, Matt. 4:15."
    },
    {
      "pk": 4034026,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 26,
      "text": "From the tribe of Issachar, Paltiel son of Azzan;",
      "links": "<a href='/AIV/6/19/17'>Josh. 19:17</a>",
      "comment": "Issachar’s inclusion contains hints at messianic expectations, as this tribe is linked to prophetic insight (Gen. 49:14-15)."
    },
    {
      "pk": 4034027,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 27,
      "text": "From the tribe of Asher, Ahihud son of Shelomi;",
      "links": "<a href='/AIV/6/19/24'>Josh. 19:24</a>",
      "comment": "Asher’s mention carries forward the theme of unity among God’s people, each tribe holding a part of the Promise."
    },
    {
      "pk": 4034028,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 28,
      "text": "From the tribe of Naphtali, Pedahel son of Ammihud.\"",
      "links": "<a href='/AIV/6/19/32'>Josh. 19:32</a>",
      "comment": "Naphtali had a future connection to Jesus’ ministry (see Matt. 4:13-15), reinforcing the prophetic unity from Old to New Testament."
    },
    {
      "pk": 4034029,
      "translation": "AIV",
      "book": 4,
      "bookName": "Numbers",
      "bookAbbreviation": "Num",
      "chapter": 34,
      "verse": 29,
      "text": "These are those whom the LORD commanded to divide the inheritance among the children of Israel in the land of Canaan.",
      "links": "<a href='/AIV/4/34/17'>Num. 34:17</a>; <a href='/AIV/6/18/1'>Josh. 18:1</a>",
      "comment": "This concluding verse affirms that leadership and divine command are essential for the faithful transmission of spiritual inheritance. New Testament fulfillment is seen in the apostolic authority given by Christ for the guiding of the whole Church. See Josh. 18:1."
    }
  ],
  "translatedAt": "2025-12-24T01:54:41.224Z"
}