{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 14,
  "verses": [
    {
      "pk": 1014001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 1,
      "text": "In the days of Amraphel king of Shinar, Arioch king of Ellasar, Chedorlaomer king of Elam, and Tidal king of Goiim,",
      "links": "<a href='/AIV/27/1/1'>Dan. 1:1</a>; <a href='/AIV/01/10/10'>Gen. 10:10</a>",
      "comment": "This sets the historical scene for the upcoming battle in the region Abraham inhabits. The names and places have echoes throughout biblical history, linking to prophecies of nations and future spiritual conflicts."
    },
    {
      "pk": 1014002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 2,
      "text": "they made war with Bera king of Sodom, Birsha king of Gomorrah, Shinab king of Admah, Shemeber king of Zeboiim, and the king of Bela (also called Zoar).",
      "links": "<a href='/AIV/01/19/22'>Gen. 19:22</a>",
      "comment": "Verse lists the kings opposing the invaders. Notably, Bela (Zoar) will later figure in the story of Lot. This sets up the concept of intercessory mediation, which echoes throughout Scripture."
    },
    {
      "pk": 1014003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 3,
      "text": "All these joined forces in the Valley of Siddim (that is, the Salt Sea).",
      "links": "<a href='/AIV/05/29/23'>Deut. 29:23</a>",
      "comment": "The Valley of Siddim is identified as the area around the Dead Sea. The unity among the kings shows collaboration against evil, a recurring biblical theme."
    },
    {
      "pk": 1014004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 4,
      "text": "Twelve years they had served Chedorlaomer, but in the thirteenth year they rebelled.",
      "links": "<a href='/AIV/01/15/13'>Gen. 15:13</a>",
      "comment": "The motif of bondage and rebellion is significant here and prefigures Israel’s later experience in Egypt. The number twelve has biblical echoes of tribes and completeness."
    },
    {
      "pk": 1014005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 5,
      "text": "In the fourteenth year, Chedorlaomer and the kings with him attacked the Rephaim in Ashteroth-Karnaim, the Zuzim in Ham, the Emim in Shaveh-Kiriathaim,",
      "links": "<a href='/AIV/05/02/10-11'>Deut. 2:10-11</a>",
      "comment": "These nations, often linked to giants, signify opposition to God’s people. The conquering of them foreshadows future spiritual victories and an ongoing warfare motif."
    },
    {
      "pk": 1014006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 6,
      "text": "and the Horites in their hill country of Seir as far as El-Paran, which is by the wilderness.",
      "links": "<a href='/AIV/01/36/20-21'>Gen. 36:20-21</a>",
      "comment": "The Horites become associated with the land of Edom. The details here reinforce the theme of dispossession of the land, a principle connecting to spiritual inheritance."
    },
    {
      "pk": 1014007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 7,
      "text": "Then they turned back and came to En-Mishpat (that is, Kadesh), and subdued all the territory of the Amalekites, and also the Amorites living in Hazazon-Tamar.",
      "links": "<a href='/AIV/04/20/1'>Num. 20:1</a>; <a href='/AIV/19/83/7'>Ps. 83:7</a>",
      "comment": "Hazazon-Tamar is later called Engedi. The defeat of the Amalekites and Amorites prefigures later struggles with these tribes. It sets the stage for the idea of spiritual battle and the need for perseverance."
    },
    {
      "pk": 1014008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 8,
      "text": "Then the king of Sodom, the king of Gomorrah, the king of Admah, the king of Zeboiim, and the king of Bela (that is, Zoar) went out and joined battle against them in the Valley of Siddim:",
      "links": "<a href='/AIV/01/19/22'>Gen. 19:22</a>",
      "comment": "The alliance goes to war, foreshadowing the frequent joining together of nations in later biblical conflicts. The Valley of Siddim (Salt Sea) is an image of death and judgment."
    },
    {
      "pk": 1014009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 9,
      "text": "against Chedorlaomer king of Elam, Tidal king of Goiim, Amraphel king of Shinar, and Arioch king of Ellasar—four kings against five.",
      "links": "<a href='/AIV/27/1/1'>Dan. 1:1</a>; <a href='/AIV/01/10/10'>Gen. 10:10</a>",
      "comment": "A four versus five king conflict highlights the imbalance of power, yet God’s providence is greater than any earthly arrangement."
    },
    {
      "pk": 1014010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 10,
      "text": "Now the Valley of Siddim was full of tar pits, and the kings of Sodom and Gomorrah fled, and some fell there, and those who survived fled to the hills.",
      "links": "<a href='/AIV/01/19/17'>Gen. 19:17</a>",
      "comment": "The fleeing from the valley to the hills foreshadows the flight of Lot from Sodom. Tar pits symbolize a trap for sin and judgment—spiritual warnings abound."
    },
    {
      "pk": 1014011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 11,
      "text": "So the victorious kings took all the possessions of Sodom and Gomorrah, and all their food, and went their way.",
      "links": "<a href='/AIV/01/19/25'>Gen. 19:25</a>",
      "comment": "The conquering and looting of the cities foreshadows the judgment of Sodom and Gomorrah. Material wealth is fleeting; spiritual treasure is enduring."
    },
    {
      "pk": 1014012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 12,
      "text": "They also took Lot, Abram’s nephew, who lived in Sodom, and his possessions, and departed.",
      "links": "<a href='/AIV/01/13/12'>Gen. 13:12</a>; <a href='/AIV/01/19/29'>Gen. 19:29</a>",
      "comment": "Lot’s captivity is a direct consequence of his choice to live near Sodom. The theme of intercession and rescue becomes central, ultimately fulfilled by Christ, the Greater Redeemer."
    },
    {
      "pk": 1014013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 13,
      "text": "Then one who had escaped came and told Abram the Hebrew, who was living by the oaks of Mamre the Amorite, brother of Eshcol and Aner. These were allies of Abram.",
      "links": "<a href='/AIV/01/13/18'>Gen. 13:18</a>; <a href='/AIV/01/14/24'>Gen. 14:24</a>",
      "comment": "‘Hebrew’ is first mentioned here—pointing to Abram’s distinct identity. Allies suggest a pattern for community among believers."
    },
    {
      "pk": 1014014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 14,
      "text": "When Abram heard that his nephew Lot had been taken captive, he mobilized his trained men, born in his house—three hundred and eighteen—and pursued as far as Dan.",
      "links": "<a href='/AIV/07/18/29'>Judg. 18:29</a>; <a href='/AIV/01/18/19'>Gen. 18:19</a>",
      "comment": "Abram’s household is well established. Notice the formation of a faithful community, reminiscent of future spiritual leadership. The specific number highlights God’s providential math."
    },
    {
      "pk": 1014015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 15,
      "text": "He divided his men against them by night and attacked them, and defeated them, and pursued them to Hobah, north of Damascus.",
      "links": "<a href='/AIV/44/9/2'>Acts 9:2</a>",
      "comment": "Abram uses wisdom and tactical skill. North of Damascus — an important link given later New Testament relevance. Victory by faith and obedience is stressed."
    },
    {
      "pk": 1014016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 16,
      "text": "He brought back all the possessions, and also restored his nephew Lot and his goods, and the women and the people.",
      "links": "<a href='/AIV/01/18/23-32'>Gen. 18:23-32</a>; <a href='/AIV/42/15/4-6'>Luke 15:4-6</a>",
      "comment": "Abram’s act of rescue mirrors the redemptive mission of Christ. The full restoration points to a holistic delivering of body, soul, and community, subtly hinting at sacramental theology."
    },
    {
      "pk": 1014017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 17,
      "text": "After his return from defeating Chedorlaomer and the kings who were with him, the king of Sodom went out to meet him at the Valley of Shaveh (that is, the King’s Valley).",
      "links": "<a href='/AIV/10/18/18'>2 Sam. 18:18</a>",
      "comment": "The King’s Valley becomes a site of royal and priestly interaction. This foreshadows the meeting with Melchizedek, an important typological figure for Christ."
    },
    {
      "pk": 1014018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 18,
      "text": "And Melchizedek king of Salem brought out bread and wine. He was priest of God Most High.",
      "links": "<a href='/AIV/19/110/4'>Ps. 110:4</a>; <a href='/AIV/58/7/1-3'>Heb. 7:1-3</a>; <a href='/AIV/40/26/26-28'>Matt. 26:26-28</a>",
      "comment": "The offering of bread and wine by Melchizedek, a priest-king, prefigures the Eucharistic themes fulfilled in Christ’s priesthood and Last Supper. The reference to ‘God Most High’ highlights universal sovereignty. The linking of priesthood and kingship points to unity and sacramental life."
    },
    {
      "pk": 1014019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 19,
      "text": "And he blessed Abram and said, 'Blessed be Abram by God Most High, Creator of heaven and earth;'",
      "links": "<a href='/AIV/01/24/3'>Gen. 24:3</a>; <a href='/AIV/19/121/2'>Ps. 121:2</a>",
      "comment": "Melchizedek’s blessing is a liturgical act, speaking of mediation and intercessory prayer. Priestly blessing reinforces themes seen throughout both Testaments."
    },
    {
      "pk": 1014020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 20,
      "text": "and blessed be God Most High, who has delivered your enemies into your hand.' And Abram gave him a tenth of everything.",
      "links": "<a href='/AIV/01/28/22'>Gen. 28:22</a>; <a href='/AIV/58/7/4-10'>Heb. 7:4-10</a>",
      "comment": "The giving of the tithe foreshadows the perpetual principle of honoring God with firstfruits. Melchizedek’s priesthood and the tithe prefigure Christ’s eternal high priesthood and the importance of visible, sacrificial acts of faith."
    },
    {
      "pk": 1014021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 21,
      "text": "Then the king of Sodom said to Abram, 'Give me the people, but keep the goods for yourself.'",
      "links": "<a href='/AIV/01/14/11'>Gen. 14:11</a>",
      "comment": "The request for the people points to themes of stewardship and the difference between material and spiritual priorities."
    },
    {
      "pk": 1014022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 22,
      "text": "But Abram said to the king of Sodom, 'I have lifted my hand to the LORD, God Most High, Creator of heaven and earth,",
      "links": "<a href='/AIV/19/121/2'>Ps. 121:2</a>",
      "comment": "Abram swearing by the LORD shows total dedication and trust in God’s providence, underscoring that spiritual virtue is preferable to material gain."
    },
    {
      "pk": 1014023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 23,
      "text": "'that I will take nothing, not a thread or a strap of a sandal, or anything that is yours, lest you should say, “I have made Abram rich.”'",
      "links": "<a href='/AIV/01/24/3'>Gen. 24:3</a>",
      "comment": "Abram’s refusal to accept even the smallest gift models a fitting detachment from worldly possessions—a theme foundational to many Christian practices of charity and humility."
    },
    {
      "pk": 1014024,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 14,
      "verse": 24,
      "text": "'Except only what the young men have eaten and the share of the men who went with me—Aner, Eshcol, and Mamre. Let them take their share.'",
      "links": "<a href='/AIV/01/14/13'>Gen. 14:13</a>",
      "comment": "Abram’s justice and generosity towards his allies establish the communal value of fair reward. His personal refusal and allowance for others models responsible stewardship and communal sharing—principles deeply embedded in later Christian teaching."
    }
  ],
  "translatedAt": "2025-12-24T00:17:12.488Z"
}