{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 43,
  "verses": [
    {
      "pk": 1043001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 1,
      "text": "Now the famine was severe in the land.",
      "links": "<a href='/AIV/1/41/56'>Gen. 41:56</a>; <a href='/AIV/1/42/5'>Gen. 42:5</a>",
      "comment": "The repeated emphasis on the severity of the famine highlights God's providence in using suffering for a greater purpose. This suffering sets the stage for reconciliation (see Gen. 50:20)."
    },
    {
      "pk": 1043002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 2,
      "text": "When they had eaten all the grain which they had brought from Egypt, their father said to them, 'Go back and buy us a little more food.'",
      "links": "<a href='/AIV/1/42/2'>Gen. 42:2</a>",
      "comment": "Jacob, referred to here as 'their father', shows his humanity and dependence. His concern for his family's physical survival foreshadows the role of a spiritual father caring for his children’s well-being."
    },
    {
      "pk": 1043003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 3,
      "text": "But Judah said to him, 'The man solemnly warned us, saying, “You will not see my face unless your brother is with you.”'",
      "links": "<a href='/AIV/1/42/15'>Gen. 42:15</a>",
      "comment": "Judah, who later becomes the ancestor of kings (see Gen. 49:10), takes leadership here, showing sacrifice and responsibility—qualities fulfilled completely in Christ."
    },
    {
      "pk": 1043004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 4,
      "text": "'If you send our brother with us, we will go down and buy you food.'",
      "links": "<a href='/AIV/1/42/34'>Gen. 42:34</a>",
      "comment": "The brother, Benjamin, is a necessary figure in their approach to 'the man' (Joseph). This condition foreshadows God requiring unity and the full household to be present for blessing (see Luke 15:32)."
    },
    {
      "pk": 1043005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 5,
      "text": "'But if you will not send him, we will not go down, for the man said to us, “You will not see my face unless your brother is with you.”'",
      "links": "<a href='/AIV/1/42/20'>Gen. 42:20</a>",
      "comment": "Repetition of the requirement underlines the importance of obedience in receiving favor. Without the full family, there is no access—hinting at the necessity of all believers being united (cf. John 17:21)."
    },
    {
      "pk": 1043006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 6,
      "text": "Israel said, 'Why did you treat me so badly by telling the man you had another brother?'",
      "links": "<a href='/AIV/1/42/13'>Gen. 42:13</a>",
      "comment": "The name Israel is used here instead of Jacob, highlighting the covenantal aspect—the father of the people of God. His response is deeply human, yet also reflects the tension in divine providence."
    },
    {
      "pk": 1043007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 7,
      "text": "They said, 'The man questioned us closely about ourselves and our kindred, saying, “Is your father still alive? Do you have another brother?” We answered him according to these words. Could we in any way know that he would say, “Bring your brother down”?'",
      "links": "<a href='/AIV/1/42/20'>Gen. 42:20</a>",
      "comment": "The questioning of identity and kinship mirrors God searching hearts and bringing family truth to light (see John 4:16-19)."
    },
    {
      "pk": 1043008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 8,
      "text": "Judah said to Israel his father, 'Send the boy with me, and we will arise and go, so that we may live and not die, both we and you and also our little ones.'",
      "links": "<a href='/AIV/1/44/31'>Gen. 44:31</a>",
      "comment": "Judah's intercession for Benjamin recalls Christ’s sacrificial role as intercessor for humanity (Heb. 7:25; Rom. 8:34)."
    },
    {
      "pk": 1043009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 9,
      "text": "'I will be surety for him; from my hand you may require him. If I do not bring him back to you and set him before you, then let me bear the blame forever.'",
      "links": "<a href='/AIV/1/42/37'>Gen. 42:37</a>; <a href='/AIV/1/44/32-34'>Gen. 44:32-34</a>",
      "comment": "Judah pledges himself as a guarantee for Benjamin’s life, a strong prefiguration of substitutionary atonement, pointing forward to Christ’s redemptive act (Isa. 53:5-6; 2 Cor. 5:21)."
    },
    {
      "pk": 1043010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 10,
      "text": "'For if we had not lingered, surely by now we could have returned twice.'",
      "links": "",
      "comment": "Judah here shows initiative and practical wisdom. Delay in obedience often leads to greater suffering."
    },
    {
      "pk": 1043011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 11,
      "text": "Then their father Israel said to them, 'If it must be so, then do this: take some of the best fruits of the land in your bags, and carry a present down to the man—a little balm, a little honey, spices, myrrh, pistachio nuts, and almonds.'",
      "links": "<a href='/AIV/1/37/25'>Gen. 37:25</a>, <a href='/AIV/20/17/8'>Prov. 17:8</a>",
      "comment": "Israel’s instruction to give gifts hints at the practice of approaching great authority with offerings, an ancient sign of respect and a foreshadowing of the gifts presented to the true King (cf. Matthew 2:11)."
    },
    {
      "pk": 1043012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 12,
      "text": "'And take double the money with you; carry back in your hand the money that was returned in the mouth of your sacks; perhaps it was a mistake.'",
      "links": "<a href='/AIV/1/42/25'>Gen. 42:25</a>",
      "comment": "Honesty and restitution are emphasized here. Returning what was not theirs models the virtue of integrity, aligned with God’s standards for right conduct."
    },
    {
      "pk": 1043013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 13,
      "text": "'Also take your brother, and arise, go again to the man.'",
      "links": "<a href='/AIV/1/42/38'>Gen. 42:38</a>",
      "comment": "This is an act of obedience and trust. The father releases his beloved son, reminiscent of the Father sending the beloved Son into the world (John 3:16)."
    },
    {
      "pk": 1043014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 14,
      "text": "'And may God Almighty grant you mercy before the man, that he may release your other brother and Benjamin. And as for me, if I am bereaved of my children, I am bereaved.'",
      "links": "<a href='/AIV/1/17/1'>Gen. 17:1</a>, <a href='/AIV/1/42/36'>Gen. 42:36</a>",
      "comment": "Jacob invokes God’s mercy, recognizing dependence on divine providence. The surrender here is a deep trust in God’s plan, foreshadowing Christian surrender to God’s will (Luke 22:42)."
    },
    {
      "pk": 1043015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 15,
      "text": "So the men took this present, and they took double the money in their hand, and Benjamin. Then they arose and went down to Egypt, and stood before Joseph.",
      "links": "<a href='/AIV/1/42/35'>Gen. 42:35</a>",
      "comment": "The brothers’ obedience leads to the audience with Joseph—obedience opens the way to reconciliation and blessing."
    },
    {
      "pk": 1043016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 16,
      "text": "When Joseph saw Benjamin with them, he said to the steward of his house, 'Bring the men into the house, slaughter an animal and prepare it, for these men will dine with me at noon.'",
      "links": "<a href='/AIV/1/18/6-8'>Gen. 18:6-8</a>, <a href='/AIV/1/43/25'>Gen. 43:25</a>",
      "comment": "Preparing a meal anticipates deep fellowship, echoing the theme of table fellowship as a sign of reconciliation and peace."
    },
    {
      "pk": 1043017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 17,
      "text": "The man did as Joseph told him, and brought the men to Joseph’s house.",
      "links": "",
      "comment": "The obedience of the steward highlights the role of servants in carrying out their master’s will, which finds spiritual resonance in faithful discipleship."
    },
    {
      "pk": 1043018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 18,
      "text": "Now the men were afraid, because they were brought to Joseph’s house; and they said, 'It is because of the money which was returned in our sacks the first time, that we are brought in, that he may find something against us and fall upon us, to make us slaves and take our donkeys.'",
      "links": "<a href='/AIV/1/42/28'>Gen. 42:28</a>",
      "comment": "Fear of judgment for hidden guilt foreshadows the human conscience before God. The anxiety about being enslaved corresponds to the consequence of sin unless mercy is shown."
    },
    {
      "pk": 1043019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 19,
      "text": "So they went up to the steward of Joseph's house and spoke with him at the entrance of the house,",
      "links": "",
      "comment": "Speaking at the door signals humility and a plea for mercy, a theme that recurs throughout salvation history."
    },
    {
      "pk": 1043020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 20,
      "text": "and said, 'Oh my lord, we came down the first time to buy food.'",
      "links": "<a href='/AIV/1/42/3'>Gen. 42:3</a>",
      "comment": "Their respectful address and honesty express a desire for justice and righteousness."
    },
    {
      "pk": 1043021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 21,
      "text": "'And when we came to the lodging place, we opened our sacks, and there was each man's money in the mouth of his sack, our money in full weight. So we have brought it again with us.'",
      "links": "<a href='/AIV/1/42/27-28'>Gen. 42:27-28</a>",
      "comment": "Their willingness to restitute money shows their transformation and integrity in dealing with unrighteous gain, a principle seen in Zacchaeus’s repentance (Luke 19:8)."
    },
    {
      "pk": 1043022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 22,
      "text": "'We have also brought down other money in our hands to buy food. We do not know who put our money in our sacks.'",
      "links": "",
      "comment": "Again, making things right in material dealings signals interior spiritual conversion."
    },
    {
      "pk": 1043023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 23,
      "text": "He said, 'Peace be to you, do not be afraid. Your God and the God of your father has given you treasure in your sacks; I received your money.' Then he brought Simeon out to them.",
      "links": "<a href='/AIV/1/42/24'>Gen. 42:24</a>, <a href='/AIV/19/65/9-13'>Ps. 65:9-13</a>",
      "comment": "The steward’s reassurance and reference to divine provision echoes divine peace after the confession of guilt, and the release of Simeon signals reconciliation through mercy."
    },
    {
      "pk": 1043024,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 24,
      "text": "The man brought the men into Joseph's house and gave them water, and they washed their feet, and he gave their donkeys feed.",
      "links": "<a href='/AIV/1/18/4'>Gen. 18:4</a>; <a href='/AIV/43/13/5'>John 13:5</a>",
      "comment": "The act of washing feet prefigures service and hospitality—ultimately perfected by Jesus in the washing of the disciples’ feet (John 13:1-15)."
    },
    {
      "pk": 1043025,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 25,
      "text": "Then they prepared the present for Joseph’s coming at noon, for they had heard that they would eat bread there.",
      "links": "<a href='/AIV/1/43/16'>Gen. 43:16</a>",
      "comment": "Anticipation of sharing a meal marks readiness for fellowship. Eating bread was a sign of covenant and peace in ancient Israel, pointing to greater spiritual meals in salvation history."
    },
    {
      "pk": 1043026,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 26,
      "text": "When Joseph came home, they brought him the present which was in their hand into the house, and bowed to him to the earth.",
      "links": "<a href='/AIV/1/37/7'>Gen. 37:7</a>; <a href='/AIV/1/42/6'>Gen. 42:6</a>",
      "comment": "Their bowing fulfills Joseph’s earlier dreams and is a visible sign of reconciliation and humble worship—shadows of every knee bowing ultimately to Christ (Phil. 2:10)."
    },
    {
      "pk": 1043027,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 27,
      "text": "He asked them about their welfare, and said, 'Is your father well, the old man of whom you spoke? Is he still alive?'",
      "links": "<a href='/AIV/1/37/35'>Gen. 37:35</a>",
      "comment": "Joseph’s concern for their father shows a model of filial piety and memory of his family. True reconciliation involves concern for others’ well-being."
    },
    {
      "pk": 1043028,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 28,
      "text": "They answered, 'Your servant our father is well; he is still alive.' And they bowed their heads and prostrated themselves.",
      "links": "<a href='/AIV/1/42/6'>Gen. 42:6</a>",
      "comment": "Their humility before Joseph is again emphasized, modeling proper respect and reverence before God’s chosen representatives."
    },
    {
      "pk": 1043029,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 29,
      "text": "He lifted up his eyes and saw his brother Benjamin, his mother’s son, and said, 'Is this your youngest brother of whom you spoke to me?' And he said, 'God be gracious to you, my son.'",
      "links": "<a href='/AIV/1/35/18'>Gen. 35:18</a>, <a href='/AIV/1/42/20'>Gen. 42:20</a>",
      "comment": "Benjamin, the beloved youngest son, echoes later figures of innocence and blessing, and Joseph’s blessing invokes grace—anticipating the gracious gifts given in Christ (Eph. 1:6)."
    },
    {
      "pk": 1043030,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 30,
      "text": "Joseph hurried out, for his compassion grew warm for his brother; and he sought a place to weep, and he entered his chamber and wept there.",
      "links": "<a href='/AIV/1/42/24'>Gen. 42:24</a>, <a href='/AIV/43/11/35'>John 11:35</a>",
      "comment": "Joseph’s deep emotion and tears display authentic human compassion. Weeping in scripture is often a prelude to restoration (cf. Luke 19:41)."
    },
    {
      "pk": 1043031,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 31,
      "text": "Then he washed his face and came out; and controlling himself, he said, 'Serve the meal.'",
      "links": "",
      "comment": "Self-mastery and readiness for fellowship display virtue. The meal anticipates a banquet of reconciliation—a theme culminating in the Messianic feast (Isa. 25:6; Rev. 19:9)."
    },
    {
      "pk": 1043032,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 32,
      "text": "They served him by himself, and them by themselves, and the Egyptians who ate with him by themselves, because the Egyptians could not eat bread with the Hebrews, for that is an abomination to the Egyptians.",
      "links": "<a href='/AIV/1/46/34'>Gen. 46:34</a>; <a href='/AIV/2/8/26'>Ex. 8:26</a>",
      "comment": "The separation at the table underscores barriers set by man, which are overcome in true worship and unity. The fullness of spiritual life breaks such divisions (Gal. 3:28)."
    },
    {
      "pk": 1043033,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 33,
      "text": "They sat before him, the firstborn according to his birthright and the youngest according to his youth; and the men looked at one another in astonishment.",
      "links": "<a href='/AIV/1/42/7'>Gen. 42:7</a>",
      "comment": "Joseph’s knowledge amazes his brothers. Order and recognition of status here prefigures the divine wisdom which sets all things in their proper place."
    },
    {
      "pk": 1043034,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 43,
      "verse": 34,
      "text": "He took and gave portions to them from before him, but Benjamin’s portion was five times as much as any of theirs. And they drank and were merry with him.",
      "links": "<a href='/AIV/1/45/22'>Gen. 45:22</a>",
      "comment": "Benjamin’s favored portion hints at grace bestowed abundantly without jealousy—a sign that God’s blessings are given according to His providence, inviting all to rejoice together (see Rom. 12:15). The banquet itself prefigures the full unity and joy found in the Kingdom."
    }
  ],
  "translatedAt": "2025-12-24T00:39:13.478Z"
}