{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 8,
  "verses": [
    {
      "pk": 1008001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 1,
      "text": "But God remembered Noah and all the animals and all the cattle that were with him in the ark. And God made a wind blow over the earth, and the waters subsided.",
      "links": "<a href='/AIV/1/19/29'>Gen. 19:29</a>;<a href='/AIV/2/14/21'>Ex. 14:21</a>",
      "comment": "The phrase 'God remembered' means that God acted on behalf of Noah after a period of waiting, showing His faithfulness. The use of wind parallels the Spirit moving over the waters in Genesis 1:2, symbolizing new creation."
    },
    {
      "pk": 1008002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 2,
      "text": "The fountains of the deep and the windows of heaven were closed; and the rain from heaven was restrained.",
      "links": "<a href='/AIV/1/7/11'>Gen. 7:11</a>",
      "comment": "'Fountains of the deep' and 'windows of heaven' refer to the cosmic waters of creation being closed, signaling the end of judgment and a return to order. This supports the theme of God restoring creation through Noah."
    },
    {
      "pk": 1008003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 3,
      "text": "The waters receded from the earth continually. After one hundred and fifty days, the waters had subsided.",
      "links": "<a href='/AIV/1/7/24'>Gen. 7:24</a>",
      "comment": "The precise timeframe emphasizes God's perfect control and order. The repetition of 150 days connects with other symbolic periods of waiting in Scripture (e.g., Jesus in the tomb for three days as the new Noah)."
    },
    {
      "pk": 1008004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 4,
      "text": "In the seventh month, on the seventeenth day of the month, the ark came to rest on the mountains of Ararat.",
      "links": "<a href='/AIV/1/7/19-20'>Gen. 7:19-20</a>",
      "comment": "The resting of the ark signals salvation and new life. Ararat is a symbol of hope, prefiguring salvation through a place and a people set apart by God."
    },
    {
      "pk": 1008005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 5,
      "text": "The waters continued to decrease until the tenth month; in the tenth month, on the first day of the month, the tops of the mountains were seen.",
      "links": "",
      "comment": "The steady retreat of the waters shows the process of God restoring creation gradually, much as sanctification is a process over time."
    },
    {
      "pk": 1008006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 6,
      "text": "At the end of forty days, Noah opened the window of the ark that he had made.",
      "links": "<a href='/AIV/1/6/16'>Gen. 6:16</a>",
      "comment": "The period of forty days is often used for times of testing or preparation (cf. Moses, Israel, Jesus in the wilderness), symbolizing a time set apart for God’s work."
    },
    {
      "pk": 1008007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 7,
      "text": "He sent out a raven, and it went to and fro until the waters were dried up from the earth.",
      "links": "",
      "comment": "The raven’s roaming shows the ongoing danger outside the ark. The bird’s action contrasts with the dove’s later mission, symbolizing different responses to God’s judgment and mercy."
    },
    {
      "pk": 1008008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 8,
      "text": "Then he sent out a dove from him, to see if the waters had subsided from the face of the ground.",
      "links": "",
      "comment": "The dove often represents the Spirit and peace (see Matthew 3:16 at Jesus’ baptism), foreshadowing God’s promise of reconciliation."
    },
    {
      "pk": 1008009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 9,
      "text": "But the dove found no place to set its foot, and she returned to him to the ark, because the waters were still on the face of all the earth. So he put out his hand and took her and brought her into the ark with him.",
      "links": "",
      "comment": "Noah's act shows care and stewardship, prefiguring pastoral leadership where the obedient return for protection and care. The dove’s return anticipates the peace that has not yet come, but is awaited."
    },
    {
      "pk": 1008010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 10,
      "text": "He waited another seven days, and again he sent out the dove from the ark.",
      "links": "",
      "comment": "Seven days signify completion and God’s divine order (cf. creation week in Genesis 1). This cycle shows patient waiting on God’s timing."
    },
    {
      "pk": 1008011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 11,
      "text": "And the dove came back to him in the evening, and behold, in her mouth was a freshly plucked olive leaf. So Noah knew that the waters had subsided from the earth.",
      "links": "<a href='/AIV/19/52/8'>Ps. 52:8</a>",
      "comment": "The olive leaf has become a universal symbol of peace and reconciliation. As the waters of judgment subside, a new creation dawns and God’s peace is extended. This foreshadows the Spirit’s peace after Christ’s resurrection."
    },
    {
      "pk": 1008012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 12,
      "text": "Then he waited another seven days and sent out the dove, but she did not return to him anymore.",
      "links": "",
      "comment": "The dove’s departure marks the end of the waiting period—God’s will is accomplished, and a new beginning is ready. It shows the completion of the process for new life outside the ark."
    },
    {
      "pk": 1008013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 13,
      "text": "In the six hundred and first year, in the first month, on the first day of the month, the waters were dried from the earth. And Noah removed the covering of the ark and looked, and behold, the face of the ground was dry.",
      "links": "",
      "comment": "Full restoration has come; the cycle is complete. The narrative’s detail shows the historical nature and the deliberate process of God’s salvation and recreation."
    },
    {
      "pk": 1008014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 14,
      "text": "In the second month, on the twenty-seventh day of the month, the earth was completely dry.",
      "links": "",
      "comment": "The exact timing in the text highlights how God’s intervention is measured and timely, reinforcing the trustworthiness of God's promises."
    },
    {
      "pk": 1008015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 15,
      "text": "Then God spoke to Noah, saying,",
      "links": "<a href='/AIV/1/7/1'>Gen. 7:1</a>",
      "comment": "God’s direct address to Noah is a motif of divine commissioning, showing that right relationship with God involves hearing and obedience to His voice."
    },
    {
      "pk": 1008016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 16,
      "text": "Go out of the ark, you and your wife, and your sons and your sons’ wives with you.",
      "links": "<a href='/AIV/1/7/13'>Gen. 7:13</a>",
      "comment": "Here God sends Noah and his family as a new beginning for the human family, signifying the restoration of humanity and its role as caretakers of creation."
    },
    {
      "pk": 1008017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 17,
      "text": "Bring out with you every living thing that is with you of all flesh—birds, animals, and every creeping thing that creeps on the earth—so that they may breed abundantly on the earth, and be fruitful and multiply on the earth.",
      "links": "<a href='/AIV/1/1/22'>Gen. 1:22</a>;<a href='/AIV/1/9/1'>Gen. 9:1</a>",
      "comment": "This echoes the blessing in Genesis 1, showing God’s intent for life and abundance. The command to 'be fruitful and multiply' later will be key in salvation history."
    },
    {
      "pk": 1008018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 18,
      "text": "So Noah went out, along with his sons, his wife, and his sons’ wives with him.",
      "links": "",
      "comment": "Noah’s obedience models the necessity of following God’s commands for restoration and blessing. This sets the pattern for faithfulness that marks the people of God."
    },
    {
      "pk": 1008019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 19,
      "text": "Every animal, every creeping thing, every bird, whatever moves on the earth, went out by families from the ark.",
      "links": "",
      "comment": "The emphasis on ‘by families’ suggests order and structure in God’s creation and points to the continued importance of the family unit in God’s redemptive plan."
    },
    {
      "pk": 1008020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 20,
      "text": "Then Noah built an altar to the LORD and took some of every clean animal and some of every clean bird and offered burnt offerings on the altar.",
      "links": "<a href='/AIV/1/4/3-4'>Gen. 4:3-4</a>;<a href='/AIV/3/1/3-9'>Lev. 1:3-9</a>",
      "comment": "Noah’s first act is worship through sacrifice, a pattern for relationship with God. The distinction of 'clean' animals points forward to later laws on sacrifice and worship, showing that right worship is ordered by God."
    },
    {
      "pk": 1008021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 21,
      "text": "When the LORD smelled the pleasing aroma, the LORD said in His heart, 'I will never again curse the ground because of man, for the intention of man’s heart is evil from his youth. Nor will I again destroy every living thing as I have done.'",
      "links": "<a href='/AIV/1/6/5'>Gen. 6:5</a>;<a href='/AIV/23/54/9'>Isa. 54:9</a>",
      "comment": "God’s internal dialogue marks a turning point from judgment to mercy, despite humanity’s sinfulness. The acceptance of a sacrificial offering prefigures Christ’s one perfect sacrifice which truly reconciles God and man (see Heb. 10:12-14)."
    },
    {
      "pk": 1008022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 8,
      "verse": 22,
      "text": "'While the earth remains, seedtime and harvest, cold and heat, summer and winter, day and night, shall not cease.'",
      "links": "<a href='/AIV/19/104/19'>Ps. 104:19</a>;<a href='/AIV/24/33/20-21'>Jer. 33:20-21</a>",
      "comment": "The divine promise of order in creation foreshadows God’s faithfulness in upholding the universe. God will not abandon the world, promising a continued cycle until fulfilled redemption (Romans 8:21-22)."
    }
  ],
  "translatedAt": "2025-12-24T00:14:19.090Z"
}