{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 39,
  "verses": [
    {
      "pk": 1039001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 1,
      "text": "Now Joseph was taken down to Egypt, and Potiphar, an officer of Pharaoh, the captain of the guard, an Egyptian, bought him from the Ishmaelites who had brought him down there.",
      "links": "<a href='/AIV/1/37/36'>Gen. 37:36</a>; <a href='/AIV/1/41/12'>Gen. 41:12</a>",
      "comment": "Joseph's journey to Egypt marks the beginning of God's providential plan to save many people. Note the role of the Ishmaelites as intermediaries, tying together different parts of Abraham's family line."
    },
    {
      "pk": 1039002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 2,
      "text": "The LORD was with Joseph, and he became a successful man. He was in the house of his Egyptian master.",
      "links": "<a href='/AIV/1/21/22'>Gen. 21:22</a>; <a href='/AIV/44/7/9'>Acts 7:9</a>",
      "comment": "Even as a slave, Joseph's blessings come from the Lord's presence—foreshadowing how God's grace can exalt the humble (Luke 1:52)."
    },
    {
      "pk": 1039003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 3,
      "text": "His master saw that the LORD was with him and that the LORD made all that he did succeed in his hand.",
      "links": "<a href='/AIV/1/30/27'>Gen. 30:27</a>; <a href='/AIV/18/29/3'>Job 29:3</a>",
      "comment": "Potiphar recognizes God's action in Joseph's life. Sometimes God's presence is so evident that even unbelievers notice it."
    },
    {
      "pk": 1039004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 4,
      "text": "So Joseph found favor in his sight and ministered to him. He made him overseer of his house and put all that he owned under his authority.",
      "links": "<a href='/AIV/1/24/2'>Gen. 24:2</a>; <a href='/AIV/1/41/40'>Gen. 41:40</a>",
      "comment": "The Hebrew for 'ministered' (sharat) often refers to priestly service; this hints at Joseph's future as a leader who mediates blessings."
    },
    {
      "pk": 1039005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 5,
      "text": "From the time that he made him overseer in his house and over all that he owned, the LORD blessed the Egyptian's house for Joseph's sake; the blessing of the LORD was on all that he had, in the house and in the field.",
      "links": "<a href='/AIV/1/30/27'>Gen. 30:27</a>; <a href='/AIV/1/12/3'>Gen. 12:3</a>",
      "comment": "God's blessings overflow from Joseph to Potiphar's entire household, fulfilling the promise to Abraham that his descendants would be a blessing to others (Gen. 12:3)."
    },
    {
      "pk": 1039006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 6,
      "text": "So he left all that he had in Joseph's hand. He did not concern himself with anything except the food that he ate. Now Joseph was handsome in form and appearance.",
      "links": "<a href='/AIV/1/29/17'>Gen. 29:17</a>; <a href='/AIV/1/41/46'>Gen. 41:46</a>",
      "comment": "Joseph's beauty is described similarly to Rachel (Gen. 29:17), setting the scene for temptation. Potiphar's trust highlights Joseph's integrity and stewardship, themes central to later teachings about faithfulness (Luke 16:10)."
    },
    {
      "pk": 1039007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 7,
      "text": "And after these things, his master's wife fixed her eyes on Joseph and said, 'Lie with me.'",
      "links": "<a href='/AIV/1/2/24'>Gen. 2:24</a>; <a href='/AIV/20/7/21'>Prov. 7:21</a>",
      "comment": "Joseph faces serious temptation, echoing early warnings against adultery (Prov. 7). Compare with Adam and Eve, this shows how temptation enters even the most trustworthy environments."
    },
    {
      "pk": 1039008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 8,
      "text": "But he refused and said to his master's wife, 'See, with me here, my master does not concern himself with anything in the house, and he has put all that he has into my hand.'",
      "links": "<a href='/AIV/1/39/6'>Gen. 39:6</a>; <a href='/AIV/54/6/20'>1 Tim. 6:20</a>",
      "comment": "Joseph's response demonstrates both gratitude and a firm moral conscience; stewardship is not only about material property, but also spiritual responsibility."
    },
    {
      "pk": 1039009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 9,
      "text": "'He is not greater in this house than I am, nor has he kept back anything from me except you, because you are his wife. How then could I do this great evil and sin against God?'",
      "links": "<a href='/AIV/1/20/6'>Gen. 20:6</a>; <a href='/AIV/19/51/4'>Ps. 51:4</a>",
      "comment": "Joseph recognizes that sin is ultimately against God (Ps. 51:4). His standard of righteousness goes beyond human loyalty, foreshadowing the call to holiness fulfilled in Christ (Matt. 5:28)."
    },
    {
      "pk": 1039010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 10,
      "text": "As she spoke to Joseph day after day, he did not listen to her, to lie beside her or to be with her.",
      "links": "<a href='/AIV/20/1/10'>Prov. 1:10</a>; <a href='/AIV/59/4/7'>James 4:7</a>",
      "comment": "Persistent temptation requires perseverance and grace. Joseph shows that resisting sin is both a daily struggle and a continual choosing of God above all."
    },
    {
      "pk": 1039011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 11,
      "text": "But one day, when he went into the house to do his work, and none of the men of the house was there inside,",
      "links": "<a href='/AIV/1/39/7'>Gen. 39:7</a>",
      "comment": "The situation intensifies—the lack of witnesses increases the danger. Temptation often seeks us in times of isolation, demonstrating the need for vigilance, which later Christian tradition would call 'avoiding occasions of sin.'"
    },
    {
      "pk": 1039012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 12,
      "text": "she caught him by his garment, saying, 'Lie with me!' But he left his garment in her hand, and fled outside.",
      "links": "<a href='/AIV/54/6/11'>1 Tim. 6:11</a>; <a href='/AIV/55/2/22'>2 Tim. 2:22</a>",
      "comment": "Joseph's flight from sin becomes a model for later Christians to 'flee youthful passions'. Symbolically, stripping off the garment foreshadows the unjust suffering of the righteous."
    },
    {
      "pk": 1039013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 13,
      "text": "When she saw that he had left his garment in her hand and had fled outside,",
      "links": "<a href='/AIV/1/39/15'>Gen. 39:15</a>",
      "comment": "Joseph’s loss of his garment at the hands of his accusers echoes the suffering servant motif (see Isa. 53), pointing ahead to Christ being falsely accused and stripped before his crucifixion."
    },
    {
      "pk": 1039014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 14,
      "text": "she called to the men of her house and spoke to them, saying, 'See, he has brought us a Hebrew to mock us! He came in to lie with me, but I cried out with a loud voice.'",
      "links": "<a href='/AIV/1/39/17'>Gen. 39:17</a>; <a href='/AIV/19/35/11'>Ps. 35:11</a>",
      "comment": "Potiphar’s wife appeals to racial prejudice and slanders Joseph. False accusation is a recurring theme for God’s servants, as seen in Daniel (Dan. 6:13), and for Christ himself."
    },
    {
      "pk": 1039015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 15,
      "text": "'As soon as he heard that I lifted up my voice and cried out, he left his garment beside me and fled outside.'",
      "links": "<a href='/AIV/1/39/12'>Gen. 39:12</a>",
      "comment": "Repetition of her accusation for emphasis; this verse highlights how false testimony can destroy reputations, underlining the importance of bearing truthful witness—a commandment found later in the Law (Exod. 20:16)."
    },
    {
      "pk": 1039016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 16,
      "text": "She kept his garment beside her until his master came home.",
      "links": "<a href='/AIV/1/39/7'>Gen. 39:7</a>",
      "comment": "The garment becomes the key evidence in her accusation, reminiscent of Joseph’s bloodied coat shown to Jacob (Gen. 37:31–33). In both cases, clothing symbolizes betrayal and falsehood."
    },
    {
      "pk": 1039017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 17,
      "text": "She spoke to him with these words, saying, 'The Hebrew servant whom you brought among us came in to mock me.'",
      "links": "<a href='/AIV/1/39/14'>Gen. 39:14</a>",
      "comment": "Repeats her accusation before Potiphar, fueling distrust. The phrase 'whom you brought among us' shifts the blame to Potiphar, as Adam did with Eve (Gen. 3:12)."
    },
    {
      "pk": 1039018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 18,
      "text": "'But as soon as I lifted up my voice and cried, he left his garment beside me and fled outside.'",
      "links": "<a href='/AIV/1/39/15'>Gen. 39:15</a>",
      "comment": "Her repeated lie cements Joseph’s supposed guilt. Sin tends to be self-reinforcing, requiring the innocent to suffer as a means of God's greater plan (Rom. 8:28)."
    },
    {
      "pk": 1039019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 19,
      "text": "When his master heard the words his wife spoke to him, saying, 'This is what your servant did to me,' his anger was kindled.",
      "links": "<a href='/AIV/1/39/14'>Gen. 39:14</a>",
      "comment": "Potiphar’s anger is directed toward the perceived affront and possibly the predicament. The text does not say he inquired after the truth, showing the peril of rash judgment."
    },
    {
      "pk": 1039020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 20,
      "text": "Joseph's master took him and put him into the prison, the place where the king's prisoners were confined. And he was there in the prison.",
      "links": "<a href='/AIV/1/40/3'>Gen. 40:3</a>; <a href='/AIV/19/105/18'>Ps. 105:18</a>",
      "comment": "Despite Joseph’s innocence, he is imprisoned—the suffering righteous servant motif. The place of confinement is prepared for future divine encounters (Gen. 40)."
    },
    {
      "pk": 1039021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 21,
      "text": "But the LORD was with Joseph and showed him steadfast love and gave him favor in the sight of the keeper of the prison.",
      "links": "<a href='/AIV/1/39/2'>Gen. 39:2</a>; <a href='/AIV/19/105/19'>Ps. 105:19</a>",
      "comment": "God’s faithfulness is unbroken, His love steadfast (chesed). Joseph finds favor again, emphasizing God’s providence. Divine love and favor sustain the righteous through suffering (Rom. 8:35-39)."
    },
    {
      "pk": 1039022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 22,
      "text": "And the keeper of the prison put Joseph in charge of all the prisoners who were in the prison; whatever was done there, he was the one who did it.",
      "links": "<a href='/AIV/1/39/4'>Gen. 39:4</a>; <a href='/AIV/1/41/40'>Gen. 41:40</a>",
      "comment": "Just as in Potiphar’s household, Joseph is entrusted with authority, reflecting the way God elevates and prepares his chosen servant for greater tasks."
    },
    {
      "pk": 1039023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 39,
      "verse": 23,
      "text": "The keeper of the prison paid no attention to anything that was in Joseph’s care, because the LORD was with him. And whatever he did, the LORD made it prosper.",
      "links": "<a href='/AIV/1/39/2'>Gen. 39:2</a>; <a href='/AIV/1/39/6'>Gen. 39:6</a>",
      "comment": "The recurring theme: God’s presence brings blessing and success. Even in prison, Joseph acts with faithfulness—foreshadowing Christ, who suffered unjustly but was ultimately glorified. Note here the implicit connection to the sacredness of suffering, and how God uses both success and adversity to prepare His servants for saving missions."
    }
  ],
  "translatedAt": "2025-12-24T00:36:29.553Z"
}