{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 9,
  "verses": [
    {
      "pk": 1009001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 1,
      "text": "Then God blessed Noah and his sons and said to them, 'Be fruitful and multiply, and fill the earth.'",
      "links": "<a href='/AIV/1/1/28'>Gen. 1:28</a>; <a href='/AIV/1/8/17'>Gen. 8:17</a>",
      "comment": "The blessing given to Noah closely echoes the original blessing given to Adam and Eve (Gen. 1:28). This establishes Noah as a new beginning for humanity after the flood, a significant moment in salvation history, showing God's continuing desire to work through a family for the restoration of humanity."
    },
    {
      "pk": 1009002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 2,
      "text": "The fear and dread of you shall fall on every beast of the earth, and on every bird of the sky, on everything that moves on the ground, and on all the fish of the sea. Into your hand they are given.",
      "links": "<a href='/AIV/1/1/26'>Gen. 1:26</a>; <a href='/AIV/19/8/6-8'>Ps. 8:6-8</a>",
      "comment": "Dominion over the animals is re-established, but now with the added sense of fear and distance—showing the effects of sin on creation. This begins a typology of stewardship and priestly mediation for mankind."
    },
    {
      "pk": 1009003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 3,
      "text": "Every living creature that moves shall be food for you; just as I gave you the green plants, I now give you everything.",
      "links": "<a href='/AIV/1/1/29'>Gen. 1:29-30</a>; <a href='/AIV/3/11/7-9'>Acts 10:11-13</a>",
      "comment": "God expands the diet permitted for humanity, making all animal life available for food, anticipating later Mosaic dietary laws. The verse prefigures the lifting of food restrictions found in Acts 10:11-13, which symbolizes the opening of salvation to all nations."
    },
    {
      "pk": 1009004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 4,
      "text": "But you shall not eat flesh with its lifeblood that is in it.",
      "links": "<a href='/AIV/3/17/10-14'>Lev. 17:10-14</a>; <a href='/AIV/5/12/23'>Deut. 12:23</a>",
      "comment": "The command to refrain from eating blood points to the sacredness of life. Blood represents life and is reserved for sacrifice in later worship practices, which is foundational for understanding the theology of covenant and sacrifice."
    },
    {
      "pk": 1009005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 5,
      "text": "Surely I will require your lifeblood; from every beast I will require it, and from every human being. From the hand of every person, from his brother, I will require the life of man.",
      "links": "<a href='/AIV/1/4/10-11'>Gen. 4:10-11</a>; <a href='/AIV/3/24/17'>Ex. 21:28</a>",
      "comment": "God affirms the value of human life and the principle of accountability for violence. This foreshadows later biblical justice systems, emphasizing the dignity of the human person."
    },
    {
      "pk": 1009006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 6,
      "text": "Whoever sheds man's blood, by man his blood shall be shed; for in the image of God He made mankind.",
      "links": "<a href='/AIV/1/1/27'>Gen. 1:27</a>; <a href='/AIV/19/82/6'>Ps. 82:6</a>",
      "comment": "The basis for this principle is the unique creation of humans in God's image. The sanctity of life is rooted in this theological truth, preparing the way for Christ’s redemptive shedding of blood. The early Christian community’s rejection of murder is rooted in this understanding."
    },
    {
      "pk": 1009007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 7,
      "text": "But as for you, be fruitful and multiply; increase abundantly in the earth, and multiply in it.",
      "links": "<a href='/AIV/1/1/28'>Gen. 1:28</a>; <a href='/AIV/1/8/17'>Gen. 8:17</a>",
      "comment": "This repetition emphasizes God’s command for life and family growth. Christian teaching deeply values openness to life, echoing this directive from the very beginning."
    },
    {
      "pk": 1009008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 8,
      "text": "Then God spoke to Noah and to his sons with him, saying:",
      "links": "<a href='/AIV/1/6/18'>Gen. 6:18</a>",
      "comment": "God now establishes the importance of family in the divine plan, with Noah's sons as joint recipients of the covenant."
    },
    {
      "pk": 1009009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 9,
      "text": "'As for Me, behold, I establish My covenant with you and with your descendants after you,'",
      "links": "<a href='/AIV/1/6/18'>Gen. 6:18</a>; <a href='/AIV/48/3/15-16'>Gal. 3:15-16</a>",
      "comment": "The formal establishment of a covenant is a key theme in salvation history and is fulfilled in later covenants, culminating in the new and everlasting covenant through Christ. The concept of a lasting, visible covenant community begins to take shape here."
    },
    {
      "pk": 1009010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 10,
      "text": "'and with every living creature that is with you: the birds, the livestock, and every animal of the earth with you, of all that go out of the ark, every animal of the earth.'",
      "links": "<a href='/AIV/19/36/6'>Ps. 36:6</a>",
      "comment": "God’s covenant includes all creation, illustrating the universal scope of His mercy and foreshadowing a new creation in Christ, where all of creation is reconciled."
    },
    {
      "pk": 1009011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 11,
      "text": "'I establish My covenant with you: never again shall all flesh be cut off by the waters of a flood, nor shall there ever again be a flood to destroy the earth.'",
      "links": "<a href='/AIV/1/8/21'>Gen. 8:21-22</a>",
      "comment": "This is a promise of stability to the world and is a foundation for hope in God’s fidelity, which finds its ultimate expression in Christ's promises to His Church."
    },
    {
      "pk": 1009012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 12,
      "text": "Then God said: 'This is the sign of the covenant that I make between Me and you and every living creature that is with you, for all future generations.'",
      "links": "<a href='/AIV/6/4/6-7'>Josh. 4:6-7</a>",
      "comment": "The giving of a visible sign to seal the covenant foreshadows the use of visible signs in later covenants, such as circumcision and, ultimately, sacraments instituted by Christ."
    },
    {
      "pk": 1009013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 13,
      "text": "'I have set My rainbow in the cloud, and it shall be a sign of the covenant between Me and the earth.'",
      "links": "<a href='/AIV/26/1/28'>Ezek. 1:28</a>; <a href='/AIV/66/4/3'>Rev. 4:3</a>",
      "comment": "The rainbow as a physical and public sign of God's promise points ahead to the Church’s use of visible signs in God’s relationship with humanity."
    },
    {
      "pk": 1009014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 14,
      "text": "'Whenever I bring clouds over the earth and the rainbow is seen in the clouds,'",
      "links": "<a href='/AIV/1/9/16'>Gen. 9:16</a>",
      "comment": "God’s signs have a recurring and perpetual significance. Visible reminders aid faith across generations—an idea that will become central in the visible life of worship in later revelation."
    },
    {
      "pk": 1009015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 15,
      "text": "'I will remember My covenant that is between Me and you and every living creature of all flesh; and the waters shall never again become a flood to destroy all flesh.'",
      "links": "<a href='/AIV/1/8/21-22'>Gen. 8:21-22</a>",
      "comment": "The act of God ‘remembering’ is a biblical way of saying He will be faithful to His promises. This faithfulness is at the heart of salvation history."
    },
    {
      "pk": 1009016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 16,
      "text": "'When the rainbow is in the cloud, I will look upon it and remember the everlasting covenant between God and every living creature of all flesh that is on the earth.'",
      "links": "<a href='/AIV/1/17/7'>Gen. 17:7</a>",
      "comment": "The language of 'everlasting covenant' will echo throughout the rest of Scripture, eventually finding its most perfect expression in the eternal new covenant established by Christ."
    },
    {
      "pk": 1009017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 17,
      "text": "So God said to Noah, 'This is the sign of the covenant that I have established between Me and all flesh that is on the earth.'",
      "links": "<a href='/AIV/1/9/13'>Gen. 9:13</a>",
      "comment": "The covenant is universal, for all people and creation. This universality becomes foreshadowing for God's ultimate plan to unite all people in Christ."
    },
    {
      "pk": 1009018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 18,
      "text": "The sons of Noah who went out of the ark were Shem, Ham, and Japheth. Ham was the father of Canaan.",
      "links": "<a href='/AIV/1/5/32'>Gen. 5:32</a>",
      "comment": "The genealogy that follows divides all humanity, setting the stage for the nations. Mention of Canaan hints at future narrative developments regarding the Promised Land."
    },
    {
      "pk": 1009019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 19,
      "text": "These three were the sons of Noah, and from them the whole earth was populated.",
      "links": "<a href='/AIV/1/10/32'>Gen. 10:32</a>",
      "comment": "Noah’s family is the source of all post-flood humanity. This is a clear statement about the unity of the human race—a concept upheld in the universal call to salvation."
    },
    {
      "pk": 1009020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 20,
      "text": "Noah began to be a man of the soil, and he planted a vineyard.",
      "links": "<a href='/AIV/23/5/1-2'>Isa. 5:1-2</a>",
      "comment": "Noah’s role as a cultivator echoes Adam’s role in the garden. The vineyard will become a symbol widely used by Christ in his parables (e.g., John 15:1)."
    },
    {
      "pk": 1009021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 21,
      "text": "He drank of the wine, became drunk, and lay uncovered inside his tent.",
      "links": "<a href='/AIV/20/23/31-32'>Prov. 23:31-32</a>",
      "comment": "Noah’s fall into drunkenness and shame recalls Adam’s fall. Even the righteous are susceptible to weakness, which signals the need for ongoing grace and restoration."
    },
    {
      "pk": 1009022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 22,
      "text": "Ham, the father of Canaan, saw the nakedness of his father and told his two brothers outside.",
      "links": "<a href='/AIV/3/20/12'>Lev. 20:12</a>",
      "comment": "Ham’s action was a grave breach of respect and reverence. Honoring one’s parents is a theme later formalized in the Ten Commandments and remains foundational in Christian morality."
    },
    {
      "pk": 1009023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 23,
      "text": "But Shem and Japheth took a garment, laid it on both their shoulders, and walked backward, and covered the nakedness of their father. Their faces were turned away so they did not see their father's nakedness.",
      "links": "<a href='/AIV/3/18/7'>Lev. 18:7</a>",
      "comment": "The respectful conduct of Shem and Japheth foreshadows the principle of covering shame rather than exposing it. This principle finds its highest spiritual fulfillment in Christ, who covers the shame of humanity."
    },
    {
      "pk": 1009024,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 24,
      "text": "When Noah awoke from his wine and learned what his youngest son had done to him,",
      "links": "<a href='/AIV/1/9/22'>Gen. 9:22</a>",
      "comment": "Noah’s realization sets up a pronouncement that will shape biblical history, especially regarding the destiny of Canaan."
    },
    {
      "pk": 1009025,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 25,
      "text": "he said: 'Cursed be Canaan; a servant of servants he shall be to his brothers.'",
      "links": "<a href='/AIV/1/27/29'>Gen. 27:29</a>",
      "comment": "The curse on Canaan is related to Ham’s dishonor. It lays foundations for later developments in salvation history regarding Israel’s relationship to Canaan. Notice the generational impact of sin—a principle Christ will ultimately heal (cf. Gal. 3:13)."
    },
    {
      "pk": 1009026,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 26,
      "text": "He also said: 'Blessed be the Lord, the God of Shem; and let Canaan be his servant.'",
      "links": "<a href='/AIV/1/10/21'>Gen. 10:21</a>",
      "comment": "The special blessing upon Shem’s line points forward to Abraham and, ultimately, to Christ. The worship of the one true God will come through this chosen line."
    },
    {
      "pk": 1009027,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 27,
      "text": "May God enlarge Japheth, and let him dwell in the tents of Shem, and let Canaan be his servant.'",
      "links": "<a href='/AIV/1/10/2-5'>Gen. 10:2-5</a>",
      "comment": "Japheth’s descendants dwelling in Shem’s tents prophetically hints at the inclusion of Gentiles into the people of God, as fulfilled in Christ."
    },
    {
      "pk": 1009028,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 28,
      "text": "Noah lived after the flood three hundred and fifty years.",
      "links": "<a href='/AIV/1/5/32'>Gen. 5:32</a>",
      "comment": "The extraordinary lifespan of Noah is a reminder of the ancient world transitioning to post-flood times, echoing pre-flood genealogies."
    },
    {
      "pk": 1009029,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 9,
      "verse": 29,
      "text": "All the days of Noah were nine hundred and fifty years; and he died.",
      "links": "<a href='/AIV/1/5/5'>Gen. 5:5</a>",
      "comment": "The phrase 'and he died' punctuates the genealogy, recalling the mortality brought about by sin, and underscoring the hope that one day death will be conquered (cf. 1 Cor. 15:22)."
    }
  ],
  "translatedAt": "2025-12-24T00:14:52.368Z"
}