{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 26,
  "verses": [
    {
      "pk": 1026001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 1,
      "text": "There was a famine in the land, in addition to the first famine that had occurred during the days of Abraham. And Isaac went to Abimelech, king of the Philistines, in Gerar.",
      "links": "<a href='/AIV/1/12/10'>Gen. 12:10</a>; <a href='/AIV/1/20/1-2'>Gen. 20:1-2</a>",
      "comment": "This echoes the earlier famine in Abraham’s time (Gen. 12:10), showing God’s testing of each generation. The setting in Gerar connects Isaac’s life with his father’s, demonstrating continuity in God's plan."
    },
    {
      "pk": 1026002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 2,
      "text": "The LORD appeared to him and said, 'Do not go down to Egypt. Live in the land where I tell you to stay.'",
      "links": "<a href='/AIV/1/12/1'>Gen. 12:1</a>; <a href='/AIV/1/46/3-4'>Gen. 46:3-4</a>",
      "comment": "God’s direct command mirrors His earlier guidance to Abraham. The call to dwell in the promised land is a sign of obedience and trust in God’s provision rather than reliance on political powers like Egypt."
    },
    {
      "pk": 1026003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 3,
      "text": "Stay in this land as a foreigner, and I will be with you and bless you. For to you and your descendants I will give all these lands, and I will fulfill the oath which I swore to your father Abraham.",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/1/22/16-18'>Gen. 22:16-18</a>",
      "comment": "The repetition of the covenant promise highlights God's faithfulness through generations, pointing to a people, a land, and a blessing, which find their ultimate fulfillment in Christ (Gal. 3:16)."
    },
    {
      "pk": 1026004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 4,
      "text": "I will make your descendants as numerous as the stars of the sky, and I will give them all these lands. Through your offspring all the nations of the earth will be blessed,",
      "links": "<a href='/AIV/1/15/5'>Gen. 15:5</a>; <a href='/AIV/1/22/18'>Gen. 22:18</a>; <a href='/AIV/48/3/16'>Gal. 3:16</a>",
      "comment": "This verse repeats Abraham’s promise and points directly to the Messiah (cf. Gal. 3:16), showing that salvation for all nations comes through this line."
    },
    {
      "pk": 1026005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 5,
      "text": "because Abraham obeyed my voice and kept my requirements, my commandments, my statutes, and my laws.",
      "links": "<a href='/AIV/1/18/19'>Gen. 18:19</a>; <a href='/AIV/3/18/5'>Lev. 18:5</a>",
      "comment": "Abraham's obedience becomes the foundation for subsequent blessings, showing the importance of faith acting through obedience. Early mention of divine statutes foreshadows later covenants and the giving of the Law."
    },
    {
      "pk": 1026006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 6,
      "text": "So Isaac stayed in Gerar.",
      "links": "<a href='/AIV/1/20/1'>Gen. 20:1</a>",
      "comment": "Isaac’s obedience echoes his father Abraham’s practice of trusting and acting on God’s word, setting a pattern for future faithfulness."
    },
    {
      "pk": 1026007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 7,
      "text": "When the men of the place asked about his wife, he said, 'She is my sister.' He was afraid to say, 'She is my wife,' because he thought, 'The men of this place might kill me because of Rebekah,' since she was very beautiful.",
      "links": "<a href='/AIV/1/12/13'>Gen. 12:13</a>; <a href='/AIV/1/20/2'>Gen. 20:2</a>",
      "comment": "Isaac repeats the mistake of Abraham (Gen. 12:13, 20:2), revealing human frailty even among chosen individuals. God’s grace and plan persist despite these failures."
    },
    {
      "pk": 1026008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 8,
      "text": "After he had been there a long time, Abimelech king of the Philistines looked out of a window and saw Isaac caressing Rebekah his wife.",
      "links": "<a href='/AIV/1/20/10-14'>Gen. 20:10-14</a>",
      "comment": "The exposure of Isaac’s deception parallels the earlier stories of Abraham’s interaction with Abimelech; the theme of truth and marital fidelity is central here."
    },
    {
      "pk": 1026009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 9,
      "text": "Abimelech called Isaac and said, 'Surely, she is your wife. How could you say, “She is my sister”?' Isaac answered him, 'Because I thought I might die on account of her.'",
      "links": "<a href='/AIV/1/12/18-19'>Gen. 12:18-19</a>; <a href='/AIV/1/20/9-10'>Gen. 20:9-10</a>",
      "comment": "Isaac’s fear and lack of trust contrasts with the steadfast faith to which believers are called. Repetition highlights recurring patterns in salvation history."
    },
    {
      "pk": 1026010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 10,
      "text": "Abimelech said, 'What is this you have done to us? One of the people might easily have slept with your wife, and you would have brought guilt upon us.'",
      "links": "<a href='/AIV/1/20/9-10'>Gen. 20:9-10</a>",
      "comment": "Similar language to Abimelech's rebuke of Abraham. It highlights the impact of personal sin on the wider community—a theme later seen in the Law."
    },
    {
      "pk": 1026011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 11,
      "text": "So Abimelech charged all the people, saying, 'Whoever touches this man or his wife will surely be put to death.'",
      "links": "<a href='/AIV/1/20/7'>Gen. 20:7</a>; <a href='/AIV/2/20/14'>Ex. 20:14</a>",
      "comment": "Pagan king protects God’s covenant couple, underscoring God’s sovereignty and protection, sometimes even through unexpected means."
    },
    {
      "pk": 1026012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 12,
      "text": "Isaac sowed seed in that land and reaped in the same year a hundredfold, and the LORD blessed him.",
      "links": "<a href='/AIV/19/67/6'>Ps. 67:6</a>; <a href='/AIV/19/107/37-38'>Ps. 107:37-38</a>",
      "comment": "The abundant harvest is a visible sign of God’s blessing for obedience, prefiguring the theme of divine reward for faithfulness."
    },
    {
      "pk": 1026013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 13,
      "text": "The man became rich and kept on prospering until he became very wealthy.",
      "links": "<a href='/AIV/1/24/35'>Gen. 24:35</a>",
      "comment": "Material prosperity is shown as a result of God’s blessing on the patriarchs, though ultimate fulfillment points to spiritual blessing for those who walk in faith."
    },
    {
      "pk": 1026014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 14,
      "text": "He had flocks and herds and many servants, so the Philistines were jealous of him.",
      "links": "<a href='/AIV/1/30/43'>Gen. 30:43</a>; <a href='/AIV/1/37/11'>Gen. 37:11</a>",
      "comment": "Prosperity leads to jealousy, setting up later conflicts. Prefigures how God’s people will be opposed by the world, yet remain under God’s care."
    },
    {
      "pk": 1026015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 15,
      "text": "So all the wells that his father’s servants had dug in the days of Abraham were stopped up by the Philistines and filled with earth.",
      "links": "<a href='/AIV/1/21/25-30'>Gen. 21:25-30</a>",
      "comment": "Wells symbolize life and blessing; their opposition to Isaac foreshadows the recurring struggles over sacred institutions and inheritance across salvation history."
    },
    {
      "pk": 1026016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 16,
      "text": "Abimelech said to Isaac, 'Move away from us, for you have become much mightier than we are.'",
      "links": "<a href='/AIV/2/1/10'>Ex. 1:10</a>",
      "comment": "Parallels Egypt’s later fear of Israel's prosperity, showing how God's blessing can evoke worldly opposition, yet His plan prevails."
    },
    {
      "pk": 1026017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 17,
      "text": "So Isaac departed from there and camped in the Valley of Gerar and settled there.",
      "links": "<a href='/AIV/1/13/9'>Gen. 13:9</a>",
      "comment": "Isaac’s peaceful withdrawal prefigures the call for peacemaking among God’s people, prioritizing harmony over conflict over material goods."
    },
    {
      "pk": 1026018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 18,
      "text": "Isaac reopened the wells that had been dug in the time of his father Abraham, which the Philistines had stopped up after Abraham’s death. He gave them the same names his father had given them.",
      "links": "<a href='/AIV/1/21/30-31'>Gen. 21:30-31</a>",
      "comment": "Restoring the wells and their names connects Isaac’s faith with Abraham’s, upholding sacred tradition and showing the value of continuity in worship and faith practice."
    },
    {
      "pk": 1026019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 19,
      "text": "Isaac’s servants dug in the valley and found there a well of fresh, flowing water.",
      "links": "<a href='/AIV/1/21/19'>Gen. 21:19</a>; <a href='/AIV/43/4/10-14'>John 4:10-14</a>",
      "comment": "The living water motif later finds a spiritual meaning in Christ (John 4:10-14), the source of living water."
    },
    {
      "pk": 1026020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 20,
      "text": "But the herdsmen of Gerar quarreled with Isaac’s herdsmen and said, 'The water is ours.' So he named the well Esek, because they argued with him.",
      "links": "",
      "comment": "The name Esek ('contention') reflects strife over the blessings God gives. Isaac’s non-retaliation prefigures New Testament calls for peacemaking."
    },
    {
      "pk": 1026021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 21,
      "text": "Then they dug another well, and they quarreled over that one also, so he named it Sitnah.",
      "links": "",
      "comment": "Sitnah means ‘hostility’ or ‘opposition’. Repeated opposition prepares the way for God's eventual vindication of His servant."
    },
    {
      "pk": 1026022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 22,
      "text": "He moved away from there and dug another well. No one quarreled over it, so he called it Rehoboth, saying, 'Now the LORD has made room for us, and we shall be fruitful in the land.'",
      "links": "<a href='/AIV/1/17/6'>Gen. 17:6</a>; <a href='/AIV/1/41/52'>Gen. 41:52</a>",
      "comment": "‘Rehoboth’ means ‘broad places’ or ‘room’. The sequence culminates in peace and fruitfulness, echoing God’s desire to establish His people in abundance."
    },
    {
      "pk": 1026023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 23,
      "text": "From there he went up to Beersheba.",
      "links": "<a href='/AIV/1/21/31'>Gen. 21:31</a>",
      "comment": "Beersheba is an important location in the life of the patriarchs, serving as a place of divine encounter and covenant."
    },
    {
      "pk": 1026024,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 24,
      "text": "That night the LORD appeared to him and said, 'I am the God of your father Abraham. Do not be afraid, for I am with you. I will bless you and multiply your descendants for my servant Abraham’s sake.'",
      "links": "<a href='/AIV/1/15/1'>Gen. 15:1</a>; <a href='/AIV/1/22/17'>Gen. 22:17</a>",
      "comment": "A reaffirmation of the covenant, God’s presence dispels fear. God’s faithfulness bridges generations, rooted in relationship and covenant."
    },
    {
      "pk": 1026025,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 25,
      "text": "So Isaac built an altar there and called on the name of the LORD. He pitched his tent there, and his servants dug a well.",
      "links": "<a href='/AIV/1/12/8'>Gen. 12:8</a>; <a href='/AIV/1/21/33'>Gen. 21:33</a>",
      "comment": "Building an altar and invoking God’s name is an act of public worship, signifying faith in the LORD and sanctifying the land. The pattern of altar-building indicates the importance of worship at sacred places."
    },
    {
      "pk": 1026026,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 26,
      "text": "Then Abimelech came to him from Gerar with his adviser Ahuzzath and his army commander Phicol.",
      "links": "<a href='/AIV/1/21/22'>Gen. 21:22</a>",
      "comment": "Parallel to Abraham’s story, these official emissaries indicate the respect and perhaps fear that Isaac commands as God’s chosen one."
    },
    {
      "pk": 1026027,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 27,
      "text": "Isaac asked them, 'Why have you come to me, since you hated me and sent me away from you?'",
      "links": "",
      "comment": "Isaac directly addresses the past injustice, yet the story proceeds to reconciliation, modeled by a spirit of forgiveness."
    },
    {
      "pk": 1026028,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 28,
      "text": "They answered, 'We plainly see that the LORD has been with you. So we said, “Let us make a sworn agreement between us—between us and you. Let us make a covenant with you",
      "links": "<a href='/AIV/1/21/22-23'>Gen. 21:22-23</a>",
      "comment": "Acknowledgment of God’s presence by outsiders demonstrates the visible nature of divine blessing. Covenants of peace echo the value of right relationship inside and outside God's people."
    },
    {
      "pk": 1026029,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 29,
      "text": "so that you will do us no harm, just as we have not touched you, and have done nothing but good and sent you away in peace. Now you are blessed by the LORD.”'",
      "links": "",
      "comment": "The pursuit of peace and blessing, and the formalizing of relationship through covenant, reflect the biblical principle that God’s people are called to be a blessing to all."
    },
    {
      "pk": 1026030,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 30,
      "text": "Isaac made a feast for them, and they ate and drank.",
      "links": "<a href='/AIV/1/21/8'>Gen. 21:8</a>; <a href='/AIV/2/24/9-11'>Ex. 24:9-11</a>",
      "comment": "Feasting is the sign of peace and covenant fellowship, prefiguring the communal meals commemorating God’s mercy and covenant blessings."
    },
    {
      "pk": 1026031,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 31,
      "text": "They rose early the next morning and swore an oath to one another. Isaac sent them on their way, and they departed from him in peace.",
      "links": "<a href='/AIV/1/21/31-32'>Gen. 21:31-32</a>",
      "comment": "The ratification of peace by solemn oath reflects the foundational biblical concern for justice and peace in human relationships."
    },
    {
      "pk": 1026032,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 32,
      "text": "That same day Isaac’s servants came and told him about the well they had dug. They said to him, 'We have found water!'",
      "links": "<a href='/AIV/1/21/19'>Gen. 21:19</a>",
      "comment": "Finding water right after the covenant signifies divine blessing, corresponding to the peace and fruitfulness expected when living according to God’s way."
    },
    {
      "pk": 1026033,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 33,
      "text": "He called it Shibah. Therefore the name of the city is Beersheba to this day.",
      "links": "<a href='/AIV/1/21/31'>Gen. 21:31</a>",
      "comment": "‘Shibah’ is related to ‘oath’ and ‘seven’, emphasizing covenant faithfulness and finality. Naming places recalls God’s ongoing faithfulness and the sacredness of history."
    },
    {
      "pk": 1026034,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 34,
      "text": "When Esau was forty years old, he married Judith daughter of Beeri the Hittite, and Basemath daughter of Elon the Hittite.",
      "links": "<a href='/AIV/1/36/2'>Gen. 36:2</a>",
      "comment": "Esau’s marriage outside the covenant family underscores the importance of faithfulness to God’s plan and the dangers of syncretism, prefiguring later warnings to God’s people."
    },
    {
      "pk": 1026035,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 26,
      "verse": 35,
      "text": "They made life bitter for Isaac and Rebekah.",
      "links": "<a href='/AIV/1/27/46'>Gen. 27:46</a>",
      "comment": "The marriage’s outcome shows the practical consequences of spiritual choices. Unity and holiness within the people of God are constant biblical emphases for true fruitfulness and peace."
    }
  ],
  "translatedAt": "2025-12-24T00:24:33.799Z"
}