{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 33,
  "verses": [
    {
      "pk": 1033001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 1,
      "text": "Jacob looked up and saw Esau coming, and four hundred men with him. So he divided the children among Leah, Rachel, and the two maidservants.",
      "links": "<a href='/AIV/1/32/6'>Gen. 32:6</a>",
      "comment": "Jacob approaches his brother, anxious about their reunion. Note the importance of familial structure, which sets a pattern later developed in salvation history."
    },
    {
      "pk": 1033002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 2,
      "text": "He placed the maidservants with their children in front, then Leah with her children behind them, and Rachel with Joseph last of all.",
      "links": "<a href='/AIV/1/29/24'>Gen. 29:24</a>; <a href='/AIV/1/30/22-24'>Gen. 30:22-24</a>",
      "comment": "Jacob arranges his family by order of importance and affection. This foreshadows the role of favored sons and the future prominence of Joseph."
    },
    {
      "pk": 1033003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 3,
      "text": "He himself went ahead of them and bowed to the ground seven times as he approached his brother.",
      "links": "<a href='/AIV/1/18/2'>Gen. 18:2</a>; <a href='/AIV/1/42/6'>Gen. 42:6</a>",
      "comment": "Jacob’s sevenfold bow is a significant gesture of humility and reconciliation, displaying an underlying reverence that will be echoed in later acts of penance and honor."
    },
    {
      "pk": 1033004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 4,
      "text": "But Esau ran to meet him, embraced him, threw his arms around his neck, and kissed him. And they wept.",
      "links": "<a href='/AIV/1/45/14-15'>Gen. 45:14-15</a>; <a href='/AIV/42/15/20'>Luke 15:20</a>",
      "comment": "This moving scene anticipates later biblical themes of forgiveness and reconciliation, especially visible in the parable of the Prodigal Son (Luke 15)."
    },
    {
      "pk": 1033005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 5,
      "text": "When Esau looked up and saw the women and children, he asked, 'Who are these with you?' Jacob answered, 'They are the children whom God has graciously given your servant.'",
      "links": "<a href='/AIV/1/48/9'>Gen. 48:9</a>; <a href='/AIV/19/127/3'>Ps. 127:3</a>",
      "comment": "Jacob acknowledges God as the giver of life, playing into broader biblical themes about God's providence and blessing upon generations."
    },
    {
      "pk": 1033006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 6,
      "text": "Then the maidservants approached with their children and bowed down.",
      "links": "<a href='/AIV/1/37/10'>Gen. 37:10</a>",
      "comment": "The act of bowing is a physical sign of respect and submission, a gesture found in many biblical worship contexts that foreshadows reverent liturgical acts."
    },
    {
      "pk": 1033007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 7,
      "text": "Leah also came with her children, and they bowed down. Finally, Joseph and Rachel came and they bowed.",
      "links": "<a href='/AIV/1/37/9'>Gen. 37:9</a>",
      "comment": "Again, the repeated bowing underscores honor properly shown within family and social order, paralleling practices found throughout the Scriptures."
    },
    {
      "pk": 1033008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 8,
      "text": "Esau asked, 'What do you mean by all this company that I met?' Jacob replied, 'To find favor in the sight of my lord.'",
      "links": "<a href='/AIV/1/32/13-20'>Gen. 32:13-20</a>",
      "comment": "Jacob’s gift is a gesture of atonement. These patterns of seeking and finding favor have deep biblical roots, ultimately fulfilled in the seeking of God's grace."
    },
    {
      "pk": 1033009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 9,
      "text": "But Esau said, 'I have plenty, my brother. Keep what you have for yourself.'",
      "links": "<a href='/AIV/5/15/4'>Deut. 15:4</a>",
      "comment": "Esau displays generosity and contentment, a virtue lauded throughout Scripture as foundational for peace and unity."
    },
    {
      "pk": 1033010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 10,
      "text": "But Jacob insisted, 'No, please! If I have found favor with you, then accept my present from my hand. For to see your face is like seeing the face of God, now that you have accepted me.'",
      "links": "<a href='/AIV/1/32/20'>Gen. 32:20</a>; <a href='/AIV/1/32/30'>Gen. 32:30</a>",
      "comment": "Jacob’s language reflects a deep truth: reconciliation with others mirrors reconciliation with God. Early Church writers saw in this a call to sacramental charity."
    },
    {
      "pk": 1033011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 11,
      "text": "'Please accept the gift I have brought you, because God has dealt graciously with me, and I have all I need.' And because Jacob insisted, Esau accepted it.",
      "links": "<a href='/AIV/1/24/35'>Gen. 24:35</a>; <a href='/AIV/1/32/5'>Gen. 32:5</a>",
      "comment": "The exchange of gifts as a token of restored relationship prefigures future covenants and offerings—a motif fulfilled in later sacramental practice."
    },
    {
      "pk": 1033012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 12,
      "text": "Then Esau said, 'Let us be on our way. I will go ahead of you.'",
      "links": "",
      "comment": "Esau’s offer highlights brotherly companionship and unity after strife, foreshadowing later biblical calls to concord among believers."
    },
    {
      "pk": 1033013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 13,
      "text": "But Jacob said to him, 'My lord knows that the children are frail, and that the flocks and herds nursing are with me. If they are driven hard for one day, all the flocks will die.'",
      "links": "<a href='/AIV/1/33/14'>Gen. 33:14</a>",
      "comment": "Jacob’s care for the weakest reminds us of the spiritual imperative to protect and nurture the vulnerable within the community."
    },
    {
      "pk": 1033014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 14,
      "text": "'Please let my lord go on ahead of his servant, while I move along slowly at the pace of the livestock and at the pace of the children, until I come to my lord in Seir.'",
      "links": "<a href='/AIV/1/32/3'>Gen. 32:3</a>",
      "comment": "Jacob's humility and deference here reflect a longstanding biblical value: humility before those in authority or seniority."
    },
    {
      "pk": 1033015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 15,
      "text": "Then Esau said, 'Let me leave some of my men with you.' But Jacob said, 'Why do that? Let me find favor in the sight of my lord.'",
      "links": "",
      "comment": "The idea of traveling with a protective company prefigures the later importance of faithful companionship and spiritual guardianship."
    },
    {
      "pk": 1033016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 16,
      "text": "So Esau returned that day on his way to Seir.",
      "links": "<a href='/AIV/1/36/8-9'>Gen. 36:8-9</a>",
      "comment": "Esau’s path to Seir shows the establishment of distinct destinies for the two brothers’ descendants, which will become key in biblical history."
    },
    {
      "pk": 1033017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 17,
      "text": "But Jacob traveled to Succoth, where he built himself a house and made shelters for his livestock. That is why the place is called Succoth.",
      "links": "<a href='/AIV/1/32/17'>Gen. 32:17</a>; <a href='/AIV/6/13/27-28'>Josh. 13:27-28</a>",
      "comment": "The naming of Succoth reflects the biblical motif of commemorating God’s providence by marking significant locations, later manifesting in sacred sites."
    },
    {
      "pk": 1033018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 18,
      "text": "Jacob came safely to the city of Shechem, in the land of Canaan, when he came from Paddan-aram, and pitched his tent before the city.",
      "links": "<a href='/AIV/1/12/6'>Gen. 12:6</a>; <a href='/AIV/6/24/32'>Josh. 24:32</a>",
      "comment": "Arrival at Shechem marks the fulfillment of God’s promises to Jacob for safe travel and signals the sanctity of this land for later generations."
    },
    {
      "pk": 1033019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 19,
      "text": "He bought the piece of land where he had pitched his tent from the sons of Hamor, Shechem's father, for a hundred pieces of silver.",
      "links": "<a href='/AIV/1/23/16'>Gen. 23:16</a>; <a href='/AIV/43/4/5-6'>John 4:5-6</a>",
      "comment": "Acquiring land prefigures the inheritance of God's people, and the reference to Shechem will feature again when Joseph’s bones are brought there (Josh. 24:32; John 4)."
    },
    {
      "pk": 1033020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 33,
      "verse": 20,
      "text": "There he set up an altar and called it El-Elohe-Israel.",
      "links": "<a href='/AIV/1/12/7-8'>Gen. 12:7-8</a>; <a href='/AIV/1/35/7'>Gen. 35:7</a>",
      "comment": "Jacob’s building of the altar marks his acknowledgment of God’s covenant fidelity, a pattern for worship and commemoration that becomes formalized throughout Scripture."
    }
  ],
  "translatedAt": "2025-12-24T00:29:33.682Z"
}