{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 49,
  "verses": [
    {
      "pk": 1049001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 1,
      "text": "Then Jacob called his sons and said, 'Gather yourselves together, so that I may tell you what will happen to you in days to come.'",
      "links": "<a href='/AIV/04/24/14'>Num. 24:14</a>; <a href='/AIV/23/2/2'>Isa. 2:2</a>",
      "comment": "Jacob acts as a prophetic patriarch, assembling his sons for a blessing and forecast of their futures. This moment is often seen as a prefiguration of Christ gathering His own for teaching and blessing, echoing the importance of family and tradition in transmitting God's plan."
    },
    {
      "pk": 1049002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 2,
      "text": "'Assemble yourselves and listen, sons of Jacob, listen to Israel your father.'",
      "links": "<a href='/AIV/05/6/4'>Deut. 6:4</a>",
      "comment": "The act of assembly and attentive listening prefigures the communal worship celebrated by God’s people. Jacob is referred to both by his old name and new, signifying transformation and continuity of God’s promise."
    },
    {
      "pk": 1049003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 3,
      "text": "'Reuben, you are my firstborn, my strength, and the beginning of my manhood; excelling in honor, excelling in power.'",
      "links": "<a href='/AIV/13/5/1'>1 Chron. 5:1</a>",
      "comment": "Firstborn status held special privileges, but later verses explain Reuben forfeited these. Spiritual tradition sometimes sees this as an allegory: not all who are first biologically retain spiritual primacy."
    },
    {
      "pk": 1049004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 4,
      "text": "'Unstable as water, you will not excel, because you went up to your father's bed; then you defiled it—he went up to my couch.'",
      "links": "<a href='/AIV/01/35/22'>Gen. 35:22</a>",
      "comment": "Jacob directly rebukes Reuben for his past sin. This serves as a reminder of the serious consequences of sin on leadership and inheritance, suggesting the need for repentance and grace."
    },
    {
      "pk": 1049005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 5,
      "text": "'Simeon and Levi are brothers; their swords are weapons of violence.'",
      "links": "<a href='/AIV/01/34/25'>Gen. 34:25</a>",
      "comment": "Jacob references the violent episode at Shechem. The critique given here reflects a call for restraint and the transformation of human nature by God’s grace."
    },
    {
      "pk": 1049006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 6,
      "text": "'Let me not enter their council; let my soul not join their assembly. For in their anger they killed men, and in their willfulness they hamstrung oxen.'",
      "links": "<a href='/AIV/19/26/4'>Ps. 26:4</a>",
      "comment": "Jacob distances himself from his sons' violent acts, underlining the rejection of sinful collaboration. Ultimately, Levi will be set apart in a unique priestly role, showing God’s ability to transform even troubled beginnings."
    },
    {
      "pk": 1049007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 7,
      "text": "'Cursed be their anger, for it is fierce, and their wrath, for it is cruel! I will divide them in Jacob and scatter them in Israel.'",
      "links": "<a href='/AIV/06/19/1'>Josh. 19:1</a>; <a href='/AIV/06/21/1-2'>Josh. 21:1-2</a>",
      "comment": "The consequences of Simeon and Levi’s wrath are exile and scattering. Notably, Levi’s later selection for priestly service emerges from this discipline, illustrating the redemptive transformation of a tribe initially condemned (Num. 3:6-13)."
    },
    {
      "pk": 1049008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 8,
      "text": "'Judah, your brothers will praise you; your hand will be on the neck of your enemies; your father's sons will bow down before you.'",
      "links": "<a href='/AIV/19/18/40'>Ps. 18:40</a>; <a href='/AIV/01/37/7-9'>Gen. 37:7-9</a>",
      "comment": "Judah receives a messianic promise, pointing ahead to David’s kingship and Christ as lion of Judah (Rev. 5:5). Note the spiritual and literal fulfillment in the New Testament."
    },
    {
      "pk": 1049009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 9,
      "text": "'Judah is a lion's cub; from the prey, my son, you have gone up. He stooped down, he crouched as a lion and as a lioness; who dares to rouse him?'",
      "links": "<a href='/AIV/04/24/9'>Num. 24:9</a>; <a href='/AIV/66/5/5'>Rev. 5:5</a>",
      "comment": "The lion imagery symbolizes royalty, courage, and strength—characteristics later ascribed to the Messiah. The Lion of Judah motif has deep ties into Christian doctrine about Christ’s kingship and victory."
    },
    {
      "pk": 1049010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 10,
      "text": "'The scepter will not depart from Judah, nor the ruler's staff from between his feet, until he to whom it belongs comes; and to him shall be the obedience of the peoples.'",
      "links": "<a href='/AIV/19/2/8'>Ps. 2:8</a>; <a href='/AIV/66/19/16'>Rev. 19:16</a>",
      "comment": "A direct prophecy of the coming king—interpreted as the Messiah by both Jewish and Christian traditions. Christ fulfills this, sovereignly ruling all nations, alluding to apostolic succession and the visible, unified leadership of the Church."
    },
    {
      "pk": 1049011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 11,
      "text": "'Binding his foal to the vine, and his colt to the choice vine, he washes his garments in wine and his robes in the blood of grapes.'",
      "links": "<a href='/AIV/23/63/1-4'>Isa. 63:1-4</a>; <a href='/AIV/40/21/2'>Matt. 21:2</a>",
      "comment": "Images of wine and blood foreshadow sacramental language later seen in Christ. The prophecy finds fulfillment in the New Covenant’s sacramental wine, symbolizing abundance and salvation."
    },
    {
      "pk": 1049012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 12,
      "text": "'His eyes are darker than wine, and his teeth whiter than milk.'",
      "links": "<a href='/AIV/19/45/2'>Ps. 45:2</a>",
      "comment": "A poetic gesture to Judah’s vitality and prosperity, symbolizing spiritual richness. Later Christian interpretation sees in this a foreshadowing of the perfect nature of Christ, pure and peerless."
    },
    {
      "pk": 1049013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 13,
      "text": "'Zebulun will settle by the seashore; he will become a haven for ships, and his border will be toward Sidon.'",
      "links": "<a href='/AIV/06/19/10-11'>Josh. 19:10-11</a>",
      "comment": "Zebulun’s prophecy promises economic blessing and outward influence, reflecting the expansion of God’s chosen people and their blessing to the nations."
    },
    {
      "pk": 1049014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 14,
      "text": "'Issachar is a strong donkey, lying down between two burdens.'",
      "links": "<a href='/AIV/07/5/15'>Judg. 5:15</a>",
      "comment": "Issachar's role as a laborer is pictured here, highlighting humble service. Servanthood becomes a virtue in the spiritual tradition, anticipating Christ, the Servant King (Mark 10:45)."
    },
    {
      "pk": 1049015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 15,
      "text": "'He saw that rest was good and that the land was pleasant, so he bowed his shoulder to bear, and became a servant to forced labor.'",
      "links": "<a href='/AIV/01/43/18'>Gen. 43:18</a>",
      "comment": "Issachar’s willingness to serve underlines both material and spiritual lessons—those who serve faithfully receive reward. Church tradition likewise upholds humble service as a spiritual privilege."
    },
    {
      "pk": 1049016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 16,
      "text": "'Dan will judge his people as one of the tribes of Israel.'",
      "links": "<a href='/AIV/07/13/2'>Judg. 13:2</a>",
      "comment": "Dan’s name means 'judge.' Later, Samson comes from Dan, bringing deliverance, prefiguring the need for just judgment—a role Christ fulfills in perfection."
    },
    {
      "pk": 1049017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 17,
      "text": "'Dan will be a serpent by the roadside, a viper along the path, that bites the horse’s heels so that its rider falls backward.'",
      "links": "<a href='/AIV/07/18/27'>Judg. 18:27</a>",
      "comment": "Dan’s methods are described as cunning and sometimes problematic. This reflects the struggle between good and evil within Israel, and hints at the spiritual battle outlined in New Testament teachings."
    },
    {
      "pk": 1049018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 18,
      "text": "'I wait for your salvation, O LORD.'",
      "links": "<a href='/AIV/19/25/5'>Ps. 25:5</a>; <a href='/AIV/42/2/25'>Luke 2:25</a>",
      "comment": "Jacob's sudden prayer shows hope for redemption and deliverance. It stands as an early expression of faith awaiting the promised Messiah, echoed throughout salvation history."
    },
    {
      "pk": 1049019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 19,
      "text": "'Gad will be attacked by a band of raiders, but he will attack them at their heels.'",
      "links": "<a href='/AIV/13/5/18'>1 Chron. 5:18</a>",
      "comment": "Gad's tribe is marked by resilience in conflict. Spiritual interpretation highlights the reward of perseverance, resonating with Christ's endurance under suffering."
    },
    {
      "pk": 1049020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 20,
      "text": "'Asher’s food will be rich, and he will yield royal delicacies.'",
      "links": "<a href='/AIV/05/33/24'>Deut. 33:24'>",
      "comment": "Material abundance is promised to Asher, prefiguring the spiritual abundance found in following God's way. Divine providence is a theme commonly reflected in Christian tradition."
    },
    {
      "pk": 1049021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 21,
      "text": "'Naphtali is a deer let loose; he gives beautiful words.'",
      "links": "<a href='/AIV/05/33/23'>Deut. 33:23</a>",
      "comment": "Naphtali is praised for freedom and eloquence. His blessing anticipates evangelization and the proclamation of the Gospel—the spreading of God’s message with beauty and grace."
    },
    {
      "pk": 1049022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 22,
      "text": "'Joseph is a fruitful branch, a fruitful branch by a spring; his branches run over the wall.'",
      "links": "<a href='/AIV/01/30/22-24'>Gen. 30:22-24</a>; <a href='/AIV/19/1/3'>Ps. 1:3</a>",
      "comment": "Joseph is connected to images of fruitfulness and blessing. His story foreshadows Christ’s suffering, elevation, and provision for all nations—an important pattern for the Church's universal mission."
    },
    {
      "pk": 1049023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 23,
      "text": "'The archers bitterly attacked him, shot at him, and harassed him,'",
      "links": "<a href='/AIV/01/37/23-28'>Gen. 37:23-28</a>",
      "comment": "Joseph’s experience with persecution resembles the suffering servant motif, ultimately fulfilled in Christ’s passion. Faithfulness amid adversity is a central Christian teaching."
    },
    {
      "pk": 1049024,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 24,
      "text": "'but his bow remained steady; his arms were made strong by the hands of the Mighty One of Jacob (by the name of the Shepherd, the Rock of Israel),'",
      "links": "<a href='/AIV/19/23/1'>Ps. 23:1</a>; <a href='/AIV/46/10/4'>1 Cor. 10:4</a>",
      "comment": "Divine strength supports the faithful. The titles 'Shepherd' and 'Rock' recur throughout Scripture, being attributed to Christ, the Church’s foundation and source of spiritual sustenance."
    },
    {
      "pk": 1049025,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 25,
      "text": "'by the God of your father who will help you, and by the Almighty who will bless you with blessings of heaven above, blessings of the deep beneath, blessings of the breasts and womb.'",
      "links": "<a href='/AIV/01/27/28'>Gen. 27:28</a>; <a href='/AIV/01/22/17'>Gen. 22:17</a>",
      "comment": "Echoes of earlier blessings suggest fullness and abundance. These blessings point to both temporal and eternal rewards, as seen in the Church’s teaching on the harmony of creation and grace."
    },
    {
      "pk": 1049026,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 26,
      "text": "'The blessings of your father surpass the blessings of the ancient mountains, the bounty of the everlasting hills; may they be upon the head of Joseph, on the brow of him who was set apart from his brothers.'",
      "links": "<a href='/AIV/05/33/13-16'>Deut. 33:13-16</a>",
      "comment": "Joseph’s separation foreshadows one set apart for God’s purpose. This echoes biblical election, highlighted in both the Old and New Testaments, and realized fully in Christ’s redemptive mission."
    },
    {
      "pk": 1049027,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 27,
      "text": "'Benjamin is a ravenous wolf; in the morning he devours the prey, and at evening divides the spoil.'",
      "links": "<a href='/AIV/07/3/15'>Judg. 3:15</a>; <a href='/AIV/45/11/1'>Rom. 11:1</a>",
      "comment": "Benjamin’s fierce character predicts his tribe’s militancy and valor—traits seen in Saul and in the apostle Paul. In Church history, many zealous defenders of the faith come from unexpected places."
    },
    {
      "pk": 1049028,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 28,
      "text": "All these are the twelve tribes of Israel, and this is what their father said to them as he blessed them, each one with the blessing appropriate to him.",
      "links": "<a href='/AIV/01/35/23-26'>Gen. 35:23-26</a>",
      "comment": "Jacob’s words are both a summary and a prophetic giving of identity and future roles to the tribes. The concept of spiritual inheritance is cemented here, later echoed in the establishment of apostolic succession."
    },
    {
      "pk": 1049029,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 29,
      "text": "Then he instructed them and said, 'I am to be gathered to my people. Bury me with my fathers in the cave that is in the field of Ephron the Hittite,'",
      "links": "<a href='/AIV/01/23/9'>Gen. 23:9</a>; <a href='/AIV/01/47/30'>Gen. 47:30</a>",
      "comment": "Jacob demonstrates faith in resurrection by requesting burial with the patriarchs. This prefigures the Christian hope of eternal life with the communion of saints."
    },
    {
      "pk": 1049030,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 30,
      "text": "'in the cave that is in the field at Machpelah, near Mamre, in the land of Canaan, which Abraham bought along with the field from Ephron the Hittite as a burial place.'",
      "links": "<a href='/AIV/01/23/17-20'>Gen. 23:17-20</a>",
      "comment": "Connecting to earlier promises, Jacob’s burial at Machpelah reflects continuity in God’s covenant and the importance of sacred places in spiritual tradition."
    },
    {
      "pk": 1049031,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 31,
      "text": "'There Abraham and his wife Sarah were buried, there Isaac and his wife Rebekah were buried, and there I buried Leah.'",
      "links": "<a href='/AIV/01/25/9-10'>Gen. 25:9-10</a>; <a href='/AIV/01/35/29'>Gen. 35:29</a>",
      "comment": "Jacob recalls the burial traditions of the patriarchs, reinforcing the family’s unity in faith and promise. This tradition is often connected with reverence for holy ancestors and continuity of God’s people."
    },
    {
      "pk": 1049032,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 32,
      "text": "'The field and the cave that are in it were bought from the Hittites.'",
      "links": "<a href='/AIV/01/23/16'>Gen. 23:16</a>",
      "comment": "The emphasis on the legitimate purchase of the burial site demonstrates proper stewardship and the value of holy ground prepared for generations. Sacred tradition calls for honoring those who have gone before."
    },
    {
      "pk": 1049033,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 49,
      "verse": 33,
      "text": "When Jacob finished instructing his sons, he drew his feet up into the bed, breathed his last, and was gathered to his people.",
      "links": "<a href='/AIV/01/25/8'>Gen. 25:8</a>; <a href='/AIV/58/11/13'>Heb. 11:13</a>",
      "comment": "Jacob’s peaceful death and gathering to his people reflects the faithful completion of life and the hope of reunion with believers—an early foundation for the Church’s teaching on union beyond death."
    }
  ],
  "translatedAt": "2025-12-24T00:46:06.061Z"
}