{
  "book": 1,
  "bookName": "Genesis",
  "bookAbbreviation": "Gen",
  "chapter": 50,
  "verses": [
    {
      "pk": 1050001,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 1,
      "text": "Then Joseph fell upon his father’s face and wept over him and kissed him.",
      "links": "<a href='/AIV/01/46/4'>Gen. 46:4</a>; <a href='/AIV/44/7/15'>Acts 7:15</a>",
      "comment": "Joseph honors his father Jacob with love and reverence at his death. This foreshadows Christian practices of honoring the dead, which emphasizes both respect for the body and hope of resurrection (cf. 1 Thess. 4:13-14)."
    },
    {
      "pk": 1050002,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 2,
      "text": "Joseph commanded his servants the physicians to embalm his father. So the physicians embalmed Israel.",
      "links": "<a href='/AIV/01/49/33'>Gen. 49:33</a>",
      "comment": "The custom of embalming shows the respect given to the body, a theme continued in Christian burial, reflecting belief in bodily resurrection. Note Jacob is called Israel here, indicating the continuation of God's promises through him."
    },
    {
      "pk": 1050003,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 3,
      "text": "Forty days were required for him, for such is the time required for embalming. And the Egyptians mourned for him seventy days.",
      "links": "<a href='/AIV/01/27/41'>Gen. 27:41</a>",
      "comment": "The lengthy period of mourning and embalming for Jacob reveals his great status. Egypt’s mourning signifies the importance of Israel and foreshadows how God’s people are to be honored even among the nations."
    },
    {
      "pk": 1050004,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 4,
      "text": "And when the days of mourning for him were past, Joseph spoke to the household of Pharaoh, saying, 'If now I have found favor in your eyes, speak, I pray you, in the ears of Pharaoh, saying,'",
      "links": "<a href='/AIV/01/41/46'>Gen. 41:46</a>",
      "comment": "Joseph approaches Pharaoh’s house respectfully, in accordance with court protocol. His humility and obedience to authority are reminders of Christian virtues (cf. Rom. 13:1)."
    },
    {
      "pk": 1050005,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 5,
      "text": "'My father made me swear, saying, “Behold, I am about to die; in my grave that I dug for myself in the land of Canaan, there you shall bury me.” Now therefore, let me go up and bury my father; then I will return.'",
      "links": "<a href='/AIV/01/47/29-31'>Gen. 47:29-31</a>",
      "comment": "Joseph’s fidelity to his father’s oath underlines the seriousness of vows and the sanctity of burial places, a practice maintained throughout the history of God’s people."
    },
    {
      "pk": 1050006,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 6,
      "text": "And Pharaoh said, 'Go up and bury your father, as he made you swear.'",
      "links": "<a href='/AIV/01/45/16'>Gen. 45:16</a>",
      "comment": "Pharaoh’s gracious response highlights Joseph’s reputation and the trust accorded him. The king supports the honoring of Joseph’s vow without hesitation."
    },
    {
      "pk": 1050007,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 7,
      "text": "So Joseph went up to bury his father. With him went up all the servants of Pharaoh, the elders of his house, and all the elders of the land of Egypt,",
      "links": "<a href='/AIV/01/50/3'>Gen. 50:3</a>",
      "comment": "The Egyptian leadership joining the procession demonstrates the influence of Israel through Joseph and hints at the universality of God’s blessings (cf. Gen. 12:3)."
    },
    {
      "pk": 1050008,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 8,
      "text": "and all the house of Joseph, his brothers, and his father’s house. Only their little ones, their flocks, and their herds they left in the land of Goshen.",
      "links": "<a href='/AIV/01/46/27'>Gen. 46:27</a>",
      "comment": "Even as they honor their dead, the family keeps its children and livestock in Goshen, signifying stewardship and rootedness in the promised region."
    },
    {
      "pk": 1050009,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 9,
      "text": "Both chariots and horsemen went up with him; it was a very great company.",
      "links": "<a href='/AIV/01/14/14'>Gen. 14:14</a>",
      "comment": "A grand procession accompanies Joseph, symbolizing honor and unity among nations. This foreshadows later images in Scripture of the nations gathered in honor of God’s people (cf. Isa. 60:3-4)."
    },
    {
      "pk": 1050010,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 10,
      "text": "When they came to the threshing floor of Atad, which is beyond the Jordan, they lamented there with a very great and severe lamentation. And he observed seven days of mourning for his father.",
      "links": "<a href='/AIV/09/31/13'>1 Sam. 31:13</a>",
      "comment": "Traditional mourning practices—seven days—show continuity in customs of Israel. The collective lamentation underlines the communal aspect of grieving, reflected in later Christian communal worship and commemorations for the departed."
    },
    {
      "pk": 1050011,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 11,
      "text": "When the inhabitants of the land, the Canaanites, saw the mourning at the threshing floor of Atad, they said, 'This is a grievous mourning for the Egyptians.' Therefore its name was called Abel-mizraim, which is beyond the Jordan.",
      "links": "<a href='/AIV/01/50/3'>Gen. 50:3</a>",
      "comment": "The local people recognize the deep mourning, which unites both Egyptians and Israelites. The term 'Abel-mizraim' means 'meadow of Egypt,' showing the integration of cultures even in death."
    },
    {
      "pk": 1050012,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 12,
      "text": "Thus his sons did for him just as he had commanded them.",
      "links": "<a href='/AIV/01/49/29'>Gen. 49:29</a>",
      "comment": "Obedience to the wishes of the deceased is shown as a sign of filial piety. Such fidelity to the patriarch is echoed in Christian tradition, where honoring parents fulfills the commandment (cf. Eph. 6:2)."
    },
    {
      "pk": 1050013,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 13,
      "text": "For his sons carried him into the land of Canaan and buried him in the cave of the field of Machpelah, which Abraham bought along with the field for a burial site, from Ephron the Hittite, before Mamre.",
      "links": "<a href='/AIV/01/23/19'>Gen. 23:19</a>; <a href='/AIV/01/49/30-31'>Gen. 49:30-31</a>",
      "comment": "Burying Jacob in Canaan continues the promises made to Abraham, showing faith in God’s plan. The site becomes a physical sign of the hope of future fulfillment—much as traditions maintain reverence for sacred burial places (see Heb. 11:13-16)."
    },
    {
      "pk": 1050014,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 14,
      "text": "After he had buried his father, Joseph returned to Egypt, he and his brothers and all who went up with him to bury his father.",
      "links": "<a href='/AIV/01/50/7'>Gen. 50:7</a>",
      "comment": "Joseph’s return underlines faithfulness to his duty in Egypt after fulfilling his obligations to his father. This dual loyalty points to living responsibly in the earthly city while hoping for the heavenly one (cf. Phil. 3:20)."
    },
    {
      "pk": 1050015,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 15,
      "text": "When Joseph’s brothers saw that their father was dead, they said, 'What if Joseph bears a grudge against us and repays us in full for all the evil we did to him?'",
      "links": "<a href='/AIV/01/37/28'>Gen. 37:28</a>; <a href='/AIV/40/18/21-22'>Matt. 18:21-22</a>",
      "comment": "The brothers’ fear reflects awareness of their guilt. Joseph becomes a figure of Christ by offering forgiveness for grave wrongs—foreshadowing the forgiveness and mercy central to the New Covenant."
    },
    {
      "pk": 1050016,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 16,
      "text": "So they sent a message to Joseph, saying, 'Your father gave this command before he died,'",
      "links": "<a href='/AIV/01/45/5'>Gen. 45:5</a>",
      "comment": "The brothers here invoke their father’s authority. This indirect request for forgiveness underscores humility and the importance of seeking reconciliation, a key Gospel theme."
    },
    {
      "pk": 1050017,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 17,
      "text": "'Say to Joseph, “Please forgive the transgression of your brothers and their sin, for they did evil to you.” Now, please forgive the transgression of the servants of the God of your father.' Joseph wept when they spoke to him.",
      "links": "<a href='/AIV/42/23/34'>Luke 23:34</a>; <a href='/AIV/01/45/1-15'>Gen. 45:1-15</a>",
      "comment": "Joseph’s weeping demonstrates compassion and heartfelt forgiveness, reminding Christians of the call to forgive from the heart (Matt. 18:35). He imitates God’s mercy and anticipates the ministry of reconciliation (2 Cor. 5:18-19)."
    },
    {
      "pk": 1050018,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 18,
      "text": "His brothers also went and fell down before him and said, 'Behold, we are your servants.'",
      "links": "<a href='/AIV/01/37/7-8'>Gen. 37:7-8</a>",
      "comment": "The fulfillment of Joseph’s earlier dreams is realized here, as his brothers bow before him. This parallels prophecies and foreshadowings of Christ’s lordship, where every knee shall bow (Phil. 2:10)."
    },
    {
      "pk": 1050019,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 19,
      "text": "But Joseph said to them, 'Do not fear, for am I in the place of God?'",
      "links": "<a href='/AIV/45/12/19'>Rom. 12:19</a>",
      "comment": "Joseph refuses to take the place of God in judgment—he entrusts justice to God alone. This aligns with the Christian call not to seek vengeance but to entrust all things to the divine Judge."
    },
    {
      "pk": 1050020,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 20,
      "text": "As for you, you meant evil against me, but God meant it for good, to bring it about that many people should be kept alive, as they are today.",
      "links": "<a href='/AIV/45/8/28'>Rom. 8:28</a>; <a href='/AIV/01/45/5-8'>Gen. 45:5-8</a>",
      "comment": "This verse is pivotal for a theology of providence—God brings good out of evil, as He does most fully in Christ’s Passion and Resurrection. Joseph’s suffering for others mirrors the redemptive suffering and mediation found throughout salvation history."
    },
    {
      "pk": 1050021,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 21,
      "text": "So do not fear; I will provide for you and your little ones.' Thus he comforted them and spoke kindly to them.",
      "links": "<a href='/AIV/40/6/33'>Matt. 6:33</a>",
      "comment": "Joseph’s mercy is not only spiritual but practical—he provides for the physical needs of his brothers and their families. This prefigures Christ’s care for both soul and body, seen in the spiritual and corporal works of mercy."
    },
    {
      "pk": 1050022,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 22,
      "text": "So Joseph remained in Egypt, he and his father’s house. And Joseph lived one hundred and ten years.",
      "links": "<a href='/AIV/01/41/46'>Gen. 41:46</a>; <a href='/AIV/06/24/29'>Josh. 24:29</a>",
      "comment": "A long life is a blessing and sign of God’s favor (see Ps. 91:16). Joseph’s presence in Egypt ensures the preservation of God’s people in a foreign land."
    },
    {
      "pk": 1050023,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 23,
      "text": "And Joseph saw Ephraim’s children to the third generation; the children also of Machir, the son of Manasseh, were born on Joseph’s knees.",
      "links": "<a href='/AIV/01/48/16'>Gen. 48:16</a>",
      "comment": "To see multiple generations is a biblical sign of blessing and hope for the future. Joseph’s embrace of these descendants means the promise continues through his line."
    },
    {
      "pk": 1050024,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 24,
      "text": "And Joseph said to his brothers, 'I am about to die, but God will surely visit you and bring you up out of this land to the land that he promised to Abraham, Isaac, and Jacob.'",
      "links": "<a href='/AIV/01/12/7'>Gen. 12:7</a>; <a href='/AIV/02/3/16-17'>Ex. 3:16-17</a>",
      "comment": "Joseph’s prophecy affirms faith in God’s promises and prefigures the Exodus. This anticipation of deliverance and entry into the promised land points typologically to salvation in Christ (cf. Heb. 11:22)."
    },
    {
      "pk": 1050025,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 25,
      "text": "Then Joseph made the sons of Israel swear, saying, 'God will surely visit you, and you shall carry up my bones from here.'",
      "links": "<a href='/AIV/02/13/19'>Ex. 13:19</a>; <a href='/AIV/06/24/32'>Josh. 24:32</a>",
      "comment": "Joseph’s request to have his bones carried to the promised land is an act of faith in resurrection and the completion of God’s plan. Reverence for relics and the completion of promises are implied in this action."
    },
    {
      "pk": 1050026,
      "translation": "AIV",
      "book": 1,
      "bookName": "Genesis",
      "bookAbbreviation": "Gen",
      "chapter": 50,
      "verse": 26,
      "text": "So Joseph died, being one hundred and ten years old. And they embalmed him, and he was put in a coffin in Egypt.",
      "links": "<a href='/AIV/06/24/32'>Josh. 24:32</a>; <a href='/AIV/44/7/16'>Acts 7:16</a>",
      "comment": "Though Joseph dies in Egypt, his hope is set on God’s promises and on being gathered with his ancestors’ remains in the promised land. The care of his body until the fulfillment of this hope anticipates the final bodily resurrection."
    }
  ],
  "translatedAt": "2025-12-24T00:46:41.225Z"
}