{
  "book": "Zephaniah",
  "bookAbbreviation": "Zeph",
  "chapter": 2,
  "verses": [
    {
      "pk": 720201,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 1,
      "text": "Gather yourselves together, yes, gather, O shameless nation,",
      "links": "<a href='/AIV/34/3/1'>Nah. 3:1</a>; <a href='/AIV/23/34/1'>Isa. 34:1</a>",
      "comment": "The call to gather is a summons to repentance. Similar language of judgment and gathering can be found in other prophetic books."
    },
    {
      "pk": 720202,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 2,
      "text": "before the decree takes effect—before the day passes away like chaff—before there comes upon you the burning anger of the LORD, before the day of the LORD’s anger comes upon you.",
      "links": "<a href='/AIV/23/13/9'>Isa. 13:9</a>; <a href='/AIV/26/7/7-12'>Ezek. 7:7–12</a>; <a href='/AIV/36/1/15'>Zeph. 1:15</a>",
      "comment": "The 'decree' likely refers to the judgment God has set in motion. The 'day of the LORD' is a common prophetic theme, echoing ultimate judgment but also the hope of a future restoration."
    },
    {
      "pk": 720203,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 3,
      "text": "Seek the LORD, all you humble of the land, who do his commands; seek righteousness, seek humility; perhaps you may be hidden in the day of the LORD’s anger.",
      "links": "<a href='/AIV/23/1/19'>Isa. 1:19</a>; <a href='/AIV/19/76/9'>Ps. 76:9</a>; <a href='/AIV/40/5/5'>Matt. 5:5</a>",
      "comment": "The humble are called to seek the LORD, with echoes of the Beatitudes (“Blessed are the meek” - Matt. 5:5). The idea of being ‘hidden’ implies a remnant preserved through obedience—a concept fulfilled more perfectly in the Body of Christ. Obedience is a sign of true faith."
    },
    {
      "pk": 720204,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 4,
      "text": "For Gaza will be abandoned, and Ashkelon will become a desolation; Ashdod will be driven out at noon, and Ekron will be uprooted.",
      "links": "<a href='/AIV/24/47/5-7'>Jer. 47:5–7</a>; <a href='/AIV/30/1/7-8'>Amos 1:7–8</a>",
      "comment": "The Philistine cities will face swift judgment. This demonstrates God's sovereignty over all nations. Historically, these cities were destroyed in subsequent invasions."
    },
    {
      "pk": 720205,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 5,
      "text": "Woe to the inhabitants of the seacoast, you nation of the Cherethites! The word of the LORD is against you, O Canaan, land of the Philistines; I will destroy you until none remain.",
      "links": "<a href='/AIV/09/30/14'>1 Sam. 30:14</a>; <a href='/AIV/26/25/16'>Ezek. 25:16</a>",
      "comment": "The Cherethites were closely associated with the Philistines. The judgment here prefigures the final destruction of all opposing powers when the Messiah comes in glory."
    },
    {
      "pk": 720206,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 6,
      "text": "The seacoast will become pastures, with meadows for shepherds and sheepfolds for flocks.",
      "links": "<a href='/AIV/23/17/2'>Isa. 17:2</a>; <a href='/AIV/26/25/5'>Ezek. 25:5</a>",
      "comment": "The once-proud cities will become humble grazing lands. This reversal hints at how God exalts the lowly and brings down the proud—a theme consistent throughout salvation history."
    },
    {
      "pk": 720207,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 7,
      "text": "The seacoast will belong to the remnant of the house of Judah; there they will pastor their flocks. In the houses of Ashkelon they will lie down at evening; for the LORD their God will care for them and restore their fortunes.",
      "links": "<a href='/AIV/30/9/14'>Amos 9:14</a>; <a href='/AIV/24/29/14'>Jer. 29:14</a>; <a href='/AIV/38/10/6'>Zech. 10:6</a>",
      "comment": "God’s promise to restore His people after judgment alludes to the gathering of a faithful remnant. The restoration foreshadows the ultimate shepherding of God's people by Christ (John 10:11)."
    },
    {
      "pk": 720208,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 8,
      "text": "I have heard the insults of Moab and the taunts of the Ammonites, how they have mocked my people and boasted against their territory.",
      "links": "<a href='/AIV/24/48/27'>Jer. 48:27</a>; <a href='/AIV/04/21/29'>Num. 21:29</a>",
      "comment": "The opposition of Moab and Ammon illustrates the consequences for those who scorn God's people. Their pride and mockery contrast with the humility called for in verse 3."
    },
    {
      "pk": 720209,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 9,
      "text": "Therefore, as I live, declares the LORD of hosts, the God of Israel, Moab will become like Sodom, and the Ammonites like Gomorrah—a place of weeds and salt pits, a perpetual wasteland. The remnant of my people will plunder them; the survivors of my nation will inherit them.",
      "links": "<a href='/AIV/01/19/25'>Gen. 19:25</a>; <a href='/AIV/26/25/10'>Ezek. 25:10</a>",
      "comment": "This severe judgment references the utter destruction of Sodom and Gomorrah (Gen. 19:25). Humble and faithful Israel—the remnant—will be heirs to the promises, a pattern fulfilled in the New Covenant."
    },
    {
      "pk": 720210,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 10,
      "text": "This they will receive for their pride, because they taunted and boasted against the people of the LORD of hosts.",
      "links": "<a href='/AIV/20/16/18'>Prov. 16:18</a>; <a href='/AIV/23/37/23'>Isa. 37:23</a>",
      "comment": "God opposes the proud but gives grace to the humble (see James 4:6). The fate of God’s enemies stands as a warning to every generation."
    },
    {
      "pk": 720211,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 11,
      "text": "The LORD will be awesome against them; for he will make all the gods of the earth fade away, and to him will bow down, each in its place, all the lands of the nations.",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>; <a href='/AIV/45/14/11'>Rom. 14:11</a>; <a href='/AIV/50/2/10'>Phil. 2:10</a>",
      "comment": "This looks forward to the universal worship of the one true God—a vision realized in the gathering in of all nations to worship the LORD (see Phil. 2:10). This has both an immediate and ultimate fulfillment in Christ’s reign."
    },
    {
      "pk": 720212,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 12,
      "text": "You, too, O Cushites, will be slain by my sword.",
      "links": "<a href='/AIV/23/18/1'>Isa. 18:1</a>; <a href='/AIV/26/30/4-5'>Ezek. 30:4–5</a>",
      "comment": "The Cushites (Ethiopians) represent even distant nations under God’s judgment. This verse underscores the universality of God’s justice."
    },
    {
      "pk": 720213,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 13,
      "text": "He will stretch out his hand against the north and destroy Assyria, and he will make Nineveh a desolation, dry as the desert.",
      "links": "<a href='/AIV/34/2/10-13'>Nah. 2:10–13</a>; <a href='/AIV/23/10/12'>Isa. 10:12</a>",
      "comment": "Nineveh, once a mighty city, will become barren. This prophecy was fulfilled historically; spiritually, it points to the final defeat of every power opposed to God’s Kingdom."
    },
    {
      "pk": 720214,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 14,
      "text": "Herds will lie down in its midst, every kind of animal; the owl and the raven will perch on its columns. The voice of the owl will hoot at the window; desolation will be on the threshold; the cedar wood has been stripped bare.",
      "links": "<a href='/AIV/23/13/21-22'>Isa. 13:21–22</a>; <a href='/AIV/34/2/11-13'>Nah. 2:11–13</a>",
      "comment": "Imagery of wild animals living among ruins demonstrates the thoroughness of God’s judgment. The proud are brought low so that God’s glory may be revealed."
    },
    {
      "pk": 720215,
      "translation": "AIV",
      "book": 36,
      "chapter": 2,
      "verse": 15,
      "text": "This is the exultant city that lived securely, that said in her heart, 'I am, and there is no one else.' What a ruin she has become, a resting place for wild beasts! Everyone who passes by her hisses and shakes his fist.",
      "links": "<a href='/AIV/23/47/8-10'>Isa. 47:8–10</a>; <a href='/AIV/34/3/19'>Nah. 3:19</a>",
      "comment": "The self-sufficient city's downfall is linked to her pride and self-exaltation—language that echoes both Babylon’s downfall and anticipates the final judgment in Revelation. The theme of humility and repentance as the path to restoration is unmistakable, prefiguring the humility of Christ."
    }
  ],
  "translatedAt": "2025-12-23T07:35:42.391Z"
}