{
  "book": 43,
  "bookName": "Zephaniah",
  "bookAbbreviation": "Zeph",
  "chapter": 1,
  "verses": [
    {
      "pk": 43001001,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 1,
      "text": "The word of the LORD that came to Zephaniah son of Cushi, son of Gedaliah, son of Amariah, son of Hezekiah, in the days of Josiah, son of Amon, king of Judah:",
      "links": "<a href='/AIV/12/22/1'>2 Kings 22:1</a>; <a href='/AIV/36/1/1'>Zeph. 1:1</a>",
      "comment": "This introduction establishes Zephaniah's lineage, which connects him to royal lineage (Hezekiah), pointing to the prophet's authority and the seriousness of his message. The reference to Josiah situates this prophecy in a time of reform, suggesting both promise and warning for God's people."
    },
    {
      "pk": 43001002,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 2,
      "text": "\"I will utterly sweep away everything from the face of the earth,\" declares the LORD.",
      "links": "<a href='/AIV/01/6/7'>Gen. 6:7</a>; <a href='/AIV/23/24/3'>Isa. 24:3</a>",
      "comment": "This echoes the language of the flood ([Gen. 6:7](#)), highlighting God's authority over all creation and the seriousness of judgment for persistent sin. It points to the ultimate purification that God will bring—both literal and spiritual."
    },
    {
      "pk": 43001003,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 3,
      "text": "\"I will sweep away man and beast; I will sweep away the birds of the heavens, and the fish of the sea, and the stumbling blocks along with the wicked. I will cut off mankind from the face of the earth,\" declares the LORD.",
      "links": "<a href='/AIV/01/7/23'>Gen. 7:23</a>; <a href='/AIV/19/104/29'>Ps. 104:29</a>",
      "comment": "The thoroughness of coming judgment is emphasized, affecting all creation. The inclusion of 'stumbling blocks' may point to idols or things causing sin, suggesting the need for deeper purification from what leads people astray."
    },
    {
      "pk": 43001004,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 4,
      "text": "\"I will stretch out my hand against Judah and against all the inhabitants of Jerusalem. I will cut off from this place every remnant of Baal, the names of the idolatrous priests along with the priests,",
      "links": "<a href='/AIV/12/23/4'>2 Kings 23:4</a>; <a href='/AIV/28/2/17'>Hos. 2:17</a>",
      "comment": "Here, God specifically targets the centre of worship and spiritual leadership. The removal of Baal-worship and idolatrous priests signals a call to restore pure worship, which prefigures a deep renewal of God's people."
    },
    {
      "pk": 43001005,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 5,
      "text": "Those who bow down on the roofs to the stars of heaven, and those who bow down and swear to the LORD but also swear by Milcom;",
      "links": "<a href='/AIV/12/17/16'>2 Kings 17:16</a>; <a href='/AIV/24/19/13'>Jer. 19:13</a>",
      "comment": "Indictment is given to syncretism—worshipping the LORD mixed with pagan practices. This highlights the necessity for exclusive devotion and the dangers of divided spiritual allegiance."
    },
    {
      "pk": 43001006,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 6,
      "text": "those who have turned back from following the LORD, and have not sought the LORD or inquired of him.",
      "links": "<a href='/AIV/24/2/13'>Jer. 2:13</a>; <a href='/AIV/19/14/2'>Ps. 14:2</a>",
      "comment": "Spiritual indifference and neglect are shown as roots of judgment. Seeking God continually is emphasized—themes later picked up in the call of Christ to 'seek first the kingdom' ([Matt. 6:33](#)), inviting a renewed commitment."
    },
    {
      "pk": 43001007,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 7,
      "text": "Be silent before the Lord GOD! For the day of the LORD is near; the LORD has prepared a sacrifice and has consecrated his guests.",
      "links": "<a href='/AIV/23/13/6'>Isa. 13:6</a>; <a href='/AIV/29/2/1'>Joel 2:1</a>",
      "comment": "The call to silence reflects awe before God's action. The imagery of God preparing a sacrifice prefigures messianic sacrifice, later fulfilled in Christ’s offering—see [Heb. 9:26](#). Guests being consecrated subtly evoke the concept of set-apart people, reminiscent of liturgical participation."
    },
    {
      "pk": 43001008,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 8,
      "text": "\"On the day of the LORD’s sacrifice, I will punish the officials and the king’s sons, and all who array themselves in foreign garments.",
      "links": "<a href='/AIV/12/10/22'>2 Kings 10:22</a>; <a href='/AIV/23/3/14'>Isa. 3:14</a>",
      "comment": "Leaders are singled out, emphasizing accountability for spiritual corruption. 'Foreign garments' may refer to adopting pagan practices, calling for an unwavering identity in God’s covenant community."
    },
    {
      "pk": 43001009,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 9,
      "text": "On that day, I will punish all who leap over the threshold, who fill their master's house with violence and deceit.",
      "links": "<a href='/AIV/09/5/5'>1 Sam. 5:5</a>; <a href='/AIV/19/10/7'>Ps. 10:7</a>",
      "comment": "'Leaping over the threshold' recalls pagan superstitions, while violence and deceit are broad indictments of moral decay. The judgment highlights God's desire for justice, truth, and authentic worship."
    },
    {
      "pk": 43001010,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 10,
      "text": "\"On that day,\" declares the LORD, \"a cry will be heard from the Fish Gate, wailing from the Second Quarter, and loud crashing from the hills.",
      "links": "<a href='/AIV/16/3/3'>Neh. 3:3</a>; <a href='/AIV/14/33/14'>2 Chr. 33:14</a>",
      "comment": "The mention of Jerusalem’s districts makes the impending judgment concrete and local; it is not abstract but will affect real people and places."
    },
    {
      "pk": 43001011,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 11,
      "text": "Wail, O inhabitants of the Mortar! For all the merchants are cut off; all who weigh out silver are wiped out.",
      "links": "<a href='/AIV/26/27/27'>Ezek. 27:27</a>; <a href='/AIV/19/135/17'>Ps. 135:17</a>",
      "comment": "'Mortar' likely refers to a marketplace. Judgment touches economic life, warning against material reliance and calling for spiritual priorities. It subtly points toward detachment from worldly goods, which is a theme accentuated in apostolic teaching."
    },
    {
      "pk": 43001012,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 12,
      "text": "At that time I will search Jerusalem with lamps, and I will punish those who are complacent, who say in their hearts, 'The LORD will not do good, nor will he do evil.'",
      "links": "<a href='/AIV/19/139/23'>Ps. 139:23</a>; <a href='/AIV/23/29/13'>Isa. 29:13</a>",
      "comment": "Divine searching exposes hidden attitudes. Complacency and skepticism towards God’s justice are rebuked, urging all to embrace genuine faith and vigilance. The idea of 'searching with lamps' hints at thorough spiritual examination."
    },
    {
      "pk": 43001013,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 13,
      "text": "Therefore their wealth will become plunder, and their houses will be laid waste. Though they build houses, they will not dwell in them; though they plant vineyards, they will not drink their wine.",
      "links": "<a href='/AIV/05/28/30'>Deut. 28:30</a>; <a href='/AIV/23/65/22'>Isa. 65:22</a>",
      "comment": "The curses echo previous covenant warnings from Deuteronomy, showing persistent relevance. Earthly security is fleeting; true fulfillment comes from spiritual faithfulness."
    },
    {
      "pk": 43001014,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 14,
      "text": "The great day of the LORD is near, near and hastening fast. The sound of the day of the LORD is bitter; the mighty man cries aloud there.",
      "links": "<a href='/AIV/29/2/11'>Joel 2:11</a>; <a href='/AIV/23/13/9'>Isa. 13:9</a>",
      "comment": "The urgency and gravity of the coming day recall apocalyptic themes that foreshadow ultimate fulfillment in Christ's return. Even the 'mighty man' is shown powerless, reinforcing the need for humble trust in God's mercy."
    },
    {
      "pk": 43001015,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 15,
      "text": "That day is a day of wrath, a day of distress and anguish, a day of ruin and devastation, a day of darkness and gloom, a day of clouds and thick darkness,",
      "links": "<a href='/AIV/29/2/2'>Joel 2:2</a>; <a href='/AIV/23/8/22'>Isa. 8:22</a>",
      "comment": "The severe imagery emphasizes total judgment. Figuratively, this points to spiritual darkness that only Christ, the Light of the World ([John 8:12](#)), can dispel."
    },
    {
      "pk": 43001016,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 16,
      "text": "a day of trumpet blast and battle cry against the fortified cities and against the lofty battlements.",
      "links": "<a href='/AIV/06/6/20'>Josh. 6:20</a>; <a href='/AIV/29/2/1'>Joel 2:1</a>",
      "comment": "'Trumpet blast' echoes themes of warning for repentance, foreshadowing the call to conversion and readiness when Christ comes again. Fortified defenses cannot stand before divine judgment."
    },
    {
      "pk": 43001017,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 17,
      "text": "I will bring distress on mankind, so that they shall walk like the blind, because they have sinned against the LORD; their blood shall be poured out like dust, and their flesh like dung.",
      "links": "<a href='/AIV/19/146/8'>Ps. 146:8</a>; <a href='/AIV/23/59/10'>Isa. 59:10</a>",
      "comment": "Sin leads to spiritual blindness—a theme approached by Jesus when he heals the blind and calls for repentance ([Mark 8:18](#)). The graphic imagery underscores sin’s seriousness and the need for sacramental transformation."
    },
    {
      "pk": 43001018,
      "translation": "AIV",
      "book": 43,
      "bookName": "Zephaniah",
      "bookAbbreviation": "Zeph",
      "chapter": 1,
      "verse": 18,
      "text": "Neither their silver nor their gold will be able to deliver them on the day of the LORD’s wrath. In the fire of his jealousy, all the earth shall be consumed; for he will make a complete, sudden end of all the inhabitants of the earth.",
      "links": "<a href='/AIV/20/11/4'>Prov. 11:4</a>; <a href='/AIV/23/66/16'>Isa. 66:16</a>",
      "comment": "Material wealth does not save (see [Prov. 11:4](#)). The finality of judgment points to the need for spiritual readiness and the hope of being purified by divine fire—a foreshadowing of new life promised through the Messiah."
    }
  ],
  "translatedAt": "2025-12-24T09:52:21.895Z"
}