{
  "book": "Zephaniah",
  "bookAbbreviation": "Zeph",
  "chapter": 3,
  "verses": [
    {
      "pk": 1933001,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 1,
      "text": "Woe to the rebellious, polluted city, full of oppression!",
      "links": "<a href='/AIV/23/1/4'>Isa. 1:4</a>; <a href='/AIV/34/3/1'>Nah. 3:1</a>",
      "comment": "Zephaniah addresses Jerusalem's spiritual corruption and oppression. The word 'polluted' carries both moral and ritual impurity, anticipating later emphasis on purification and holiness (see Isa. 1:18)."
    },
    {
      "pk": 1933002,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 2,
      "text": "She has not listened to anyone, she has not accepted correction. She does not trust in the LORD, she does not draw near to her God.",
      "links": "<a href='/AIV/20/1/7'>Prov. 1:7</a>; <a href='/AIV/19/73/28'>Ps. 73:28</a>",
      "comment": "There's a spiritual deafness here, not just a political one; Zephaniah highlights the necessity of drawing near to God, a theme that continues into the promises of new covenant in Hebrews 10:22."
    },
    {
      "pk": 1933003,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 3,
      "text": "Her leaders within her are roaring lions; her judges are evening wolves who leave nothing until morning.",
      "links": "<a href='/AIV/26/22/27'>Ezek. 22:27</a>; <a href='/AIV/23/56/11'>Isa. 56:11</a>",
      "comment": "The imagery of wild beasts represents corrupt leadership. This contrasts sharply with the good shepherd imagery applied to Christ (John 10:11), who models sacrificial care for the flock."
    },
    {
      "pk": 1933004,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 4,
      "text": "Her prophets are reckless, treacherous men; her priests desecrate what is holy, they do violence to the Law.",
      "links": "<a href='/AIV/24/6/13'>Jer. 6:13</a>; <a href='/AIV/26/22/26'>Ezek. 22:26</a>",
      "comment": "Here, spiritual leaders corrupt worship and teaching, foreshadowing Christ's restoration of true worship and authoritative teaching (see Matt. 5:17-19)."
    },
    {
      "pk": 1933005,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 5,
      "text": "The LORD in her midst is righteous; He does no injustice. Morning by morning He brings His justice to light; He never fails. Yet the unjust know no shame.",
      "links": "<a href='/AIV/19/92/15'>Ps. 92:15</a>; <a href='/AIV/19/101/1'>Ps. 101:1</a>",
      "comment": "Despite the corruption, God remains perfectly just in Jerusalem. The presence of the LORD 'in her midst' looks forward to God's dwelling with His people in a more profound way (see John 1:14; Rev. 21:3)."
    },
    {
      "pk": 1933006,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 6,
      "text": "I have cut off nations; their strongholds are ruined. I have made their streets desolate, without anyone passing by. Their cities are destroyed, left without a single inhabitant.",
      "links": "<a href='/AIV/23/10/13'>Isa. 10:13</a>; <a href='/AIV/24/4/7'>Jer. 4:7</a>",
      "comment": "This verse demonstrates God's sovereignty over nations, both in judgment and mercy. He purifies not only Israel, but the whole world for a coming restoration."
    },
    {
      "pk": 1933007,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 7,
      "text": "I said, ‘Surely you will fear Me; you will accept correction.’ Then your dwelling would not be cut off, according to all that I have appointed against you. But they were eager to corrupt all their deeds.",
      "links": "<a href='/AIV/23/1/19-20'>Isa. 1:19-20</a>; <a href='/AIV/19/81/11-12'>Ps. 81:11-12</a>",
      "comment": "Repentance is presented as the path to protection, but the people's persistent rebellion continues. The notion of 'appointed' judgments anticipates God's sovereignty and the discipline needed for restoration."
    },
    {
      "pk": 1933008,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 8,
      "text": "'Therefore wait for Me,' declares the LORD, 'for the day when I rise up to seize the prey. For My decision is to gather nations, to assemble kingdoms, to pour out upon them My indignation, all My burning anger; for all the earth will be consumed by the fire of My jealousy.'",
      "links": "<a href='/AIV/23/66/15-16'>Isa. 66:15-16</a>; <a href='/AIV/19/102/22'>Ps. 102:22</a>",
      "comment": "This eschatological warning sets up the coming day of the LORD, when judgment and purification extend to all nations. The 'fire of My jealousy' hints at God's zeal not just for retribution, but for loving possession of His people (see Exod. 34:14)."
    },
    {
      "pk": 1933009,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 9,
      "text": "For at that time I will restore pure speech to the peoples, that all of them may call on the name of the LORD and serve Him together.",
      "links": "<a href='/AIV/01/11/1-9'>Gen. 11:1-9</a>; <a href='/AIV/42/11/13'>Luke 11:13</a>",
      "comment": "This reversal of Babel (Gen. 11) signals a worldwide unity of worship. The idea of a 'pure speech' foreshadows the spiritual renewal and the one worship among all peoples (see Acts 2:4)."
    },
    {
      "pk": 1933010,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 10,
      "text": "From beyond the rivers of Cush, My worshipers, the daughter of My dispersed ones, shall bring My offering.",
      "links": "<a href='/AIV/19/68/31'>Ps. 68:31</a>; <a href='/AIV/44/8/27'>Acts 8:27</a>",
      "comment": "God draws worshipers from the farthest nations, showing a vision for worldwide gathering and universal worship, a precursor to the church's universal mission."
    },
    {
      "pk": 1933011,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 11,
      "text": "On that day you shall not be put to shame for any of the deeds by which you have rebelled against Me; for then I will remove from your midst the proud, arrogant people, and you will never again be haughty on My holy mountain.",
      "links": "<a href='/AIV/01/22/14'>Gen. 22:14</a>; <a href='/AIV/19/15/1'>Ps. 15:1</a>",
      "comment": "God promises cleansing, removing arrogance from worship. The reference to 'holy mountain' ties into Zion theology and the idea of God's dwelling place among a humble people."
    },
    {
      "pk": 1933012,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 12,
      "text": "But I will leave in your midst a meek and humble people, and they shall trust in the name of the LORD.",
      "links": "<a href='/AIV/40/5/3-5'>Matt. 5:3-5</a>; <a href='/AIV/19/37/11'>Ps. 37:11</a>",
      "comment": "A remnant of 'meek and humble' is preserved, which echoes the Beatitudes and Christ’s teaching on humility as essential for entry into His kingdom."
    },
    {
      "pk": 1933013,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 13,
      "text": "The remnant of Israel will do no wrong and speak no lies, nor will a deceitful tongue be found in their mouths; for they shall feed and lie down, and no one shall make them afraid.",
      "links": "<a href='/AIV/23/11/6-9'>Isa. 11:6-9</a>; <a href='/AIV/43/10/27-28'>John 10:27-28</a>",
      "comment": "This study in integrity and peace looks ahead to the New Testament's declarations of the spotless Church. The image of feeding and lying down recalls the Good Shepherd’s protection."
    },
    {
      "pk": 1933014,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 14,
      "text": "Sing aloud, daughter of Zion! Shout, O Israel! Be glad and rejoice with all your heart, daughter of Jerusalem!",
      "links": "<a href='/AIV/23/12/6'>Isa. 12:6</a>; <a href='/AIV/19/47/1'>Ps. 47:1</a>",
      "comment": "Joy and praise are called for in anticipation of God's salvation, reflecting the New Testament call to rejoice in the Lord always (Phil. 4:4)."
    },
    {
      "pk": 1933015,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 15,
      "text": "The LORD has taken away your judgments, He has turned away your enemies. The King of Israel, the LORD, is in your midst; you shall never again fear evil.",
      "links": "<a href='/AIV/43/12/15'>John 12:15</a>; <a href='/AIV/23/33/22'>Isa. 33:22</a>",
      "comment": "'King of Israel, the LORD, is in your midst' foreshadows the Incarnation, where Christ (God with us, Matt. 1:23) personally dwells among His people."
    },
    {
      "pk": 1933016,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 16,
      "text": "On that day it shall be said to Jerusalem: 'Do not fear, Zion; do not let your hands grow weak.'",
      "links": "<a href='/AIV/23/35/4'>Isa. 35:4</a>; <a href='/AIV/19/27/1'>Ps. 27:1</a>",
      "comment": "God’s command to fear not and be strong is repeated visionary encouragement, connecting to Christ’s assurance to His followers (see John 14:27)."
    },
    {
      "pk": 1933017,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 17,
      "text": "The LORD your God is in your midst, a mighty Savior; He will rejoice over you with gladness. He will quiet you with His love; He will exult over you with singing.",
      "links": "<a href='/AIV/23/62/5'>Isa. 62:5</a>; <a href='/AIV/19/147/11'>Ps. 147:11</a>",
      "comment": "This beautiful verse pictures God as rejoicing over His people, foreshadowing the intimate relationship Christ brings, and the spiritual renewal found in the Spirit’s indwelling presence."
    },
    {
      "pk": 1933018,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 18,
      "text": "I will gather those who mourn for the appointed times, those who were far from you; they will no longer bear reproach.",
      "links": "<a href='/AIV/19/102/20'>Ps. 102:20</a>; <a href='/AIV/03/23/4'>Lev. 23:4</a>",
      "comment": "The restoration of worship is highlighted here. ‘Appointed times’ likely refers to sacred festivals (see Lev. 23), which find deeper fulfillment in the new covenant worship."
    },
    {
      "pk": 1933019,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 19,
      "text": "See, at that time I will deal with all who oppress you; and I will save the lame and gather the outcast, and I will make them a praise and a name in every land where they were shamed.",
      "links": "<a href='/AIV/23/35/5-6'>Isa. 35:5-6</a>; <a href='/AIV/40/21/14'>Matt. 21:14</a>",
      "comment": "Inclusion of the marginalized is a hallmark of God’s redemptive work. Christ’s healing ministry fulfills this prophecy, showing the embrace of all, especially the humble and broken."
    },
    {
      "pk": 1933020,
      "translation": "AIV",
      "book": 36,
      "chapter": 3,
      "verse": 20,
      "text": "At that time I will bring you in, at the time when I gather you together; for I will make you a name and a praise among all peoples of the earth, when I restore your fortunes before your eyes,' says the LORD.",
      "links": "<a href='/AIV/24/33/11'>Jer. 33:11</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "A final promise of restoration and being exalted among all nations. This image is deeply rooted in the prophetic hope and culminates in the church’s universal presence and call to holiness among all peoples (see 1 Pet. 2:9)."
    }
  ],
  "translatedAt": "2025-12-23T07:36:09.255Z"
}