{
  "book": "Zephaniah",
  "bookAbbreviation": "Zeph",
  "chapter": 1,
  "verses": [
    {
      "pk": 4401001,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 1,
      "text": "The word of the LORD that came to Zephaniah son of Cushi, son of Gedaliah, son of Amariah, son of Hezekiah, in the days of Josiah son of Amon, king of Judah:",
      "links": "<a href='/AIV/12/22/1'>2 Kings 22:1</a>, <a href='/AIV/24/1/2'>Jeremiah 1:2</a>",
      "comment": "Introduces Zephaniah’s prophetic lineage and historical setting. The mention of Josiah signals the time of religious reform, echoing themes of renewal and purification."
    },
    {
      "pk": 4401002,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 2,
      "text": "I will completely sweep away everything from the face of the earth, declares the LORD.",
      "links": "<a href='/AIV/01/6/7'>Genesis 6:7</a>, <a href='/AIV/23/24/1'>Isaiah 24:1</a>",
      "comment": "A pronouncement of total judgment reminiscent of the Flood (Gen. 6:7), showing the seriousness of sin and foreshadowing a coming renewal."
    },
    {
      "pk": 4401003,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 3,
      "text": "I will sweep away man and beast; I will sweep away the birds of the sky and the fish of the sea, and the ruins with the wicked. I will cut off mankind from the face of the earth, declares the LORD.",
      "links": "<a href='/AIV/01/7/21'>Gen. 7:21</a>, <a href='/AIV/19/104/29'>Ps. 104:29</a>",
      "comment": "Echoes the language of Genesis Flood narrative (Gen. 7). Signifies the universality of God’s judgment due to widespread corruption."
    },
    {
      "pk": 4401004,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 4,
      "text": "I will stretch out my hand against Judah and against all the inhabitants of Jerusalem. I will cut off every remnant of Baal from this place, the names of the priests with the pagan priests.",
      "links": "<a href='/AIV/12/23/4-5'>2 Kings 23:4–5</a>, <a href='/AIV/28/2/17'>Hos. 2:17</a>",
      "comment": "Shows judgment beginning with God’s own people and a purifying of worship. The removal of false priests recalls Josiah’s reforms and anticipates restoration of true worship."
    },
    {
      "pk": 4401005,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 5,
      "text": "Those who bow down on the roofs to the host of the heavens, those who bow down and swear to the LORD but also swear by Milcom;",
      "links": "<a href='/AIV/12/21/3'>2 Kings 21:3</a>, <a href='/AIV/11/11/5'>1 Kings 11:5</a>",
      "comment": "Condemns syncretism—attempting to worship the LORD alongside false gods. Emphasizes undivided devotion, with implications for the purity and unity of the faith community."
    },
    {
      "pk": 4401006,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 6,
      "text": "Those who have turned back from following the LORD, and those who have not sought the LORD or inquired of him.",
      "links": "<a href='/AIV/19/14/2'>Ps. 14:2</a>, <a href='/AIV/19/53/2'>Ps. 53:2</a>",
      "comment": "Addresses both open abandonment and spiritual neglect. There is a call to genuinely seek and pursue God, not just in private but with earnestness and full commitment."
    },
    {
      "pk": 4401007,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 7,
      "text": "Be silent before the Lord GOD! For the day of the LORD is near; the LORD has prepared a sacrifice and consecrated his invited guests.",
      "links": "<a href='/AIV/23/34/6'>Isaiah 34:6</a>, <a href='/AIV/66/19/7-9'>Rev. 19:7–9</a>",
      "comment": "The sacrifice imagery connects to solemn worship and judgment. Christologically, this foreshadows the ultimate sacrifice and the gathering for the wedding feast (Rev. 19)."
    },
    {
      "pk": 4401008,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 8,
      "text": "On the day of the LORD’s sacrifice, I will punish the officials and the king’s sons and all who dress in foreign attire.",
      "links": "<a href='/AIV/26/23/15-17'>Ezek. 23:15-17</a>, <a href='/AIV/10/15/12'>2 Samuel 15:12</a>",
      "comment": "Judgment on leaders and adoption of foreign customs highlights accountability and calls for holiness in every aspect of life."
    },
    {
      "pk": 4401009,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 9,
      "text": "On that day I will punish all who leap over the threshold, who fill their master’s house with violence and deceit.",
      "links": "<a href='/AIV/09/5/5'>1 Samuel 5:5</a>, <a href='/AIV/19/27/6'>Ps. 27:6</a>",
      "comment": "Reference to pagan practices and corruption. Highlights the need for integrity in worship and conduct."
    },
    {
      "pk": 4401010,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 10,
      "text": "On that day, declares the LORD, a cry will go up from the Fish Gate, and wailing from the Second Quarter, and a loud crash from the hills.",
      "links": "<a href='/AIV/16/3/3'>Nehemiah 3:3</a>, <a href='/AIV/24/39/3'>Jeremiah 39:3</a>",
      "comment": "The lament from different districts signals widespread calamity. It paints a vivid picture of the consequence of rejecting God’s order."
    },
    {
      "pk": 4401011,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 11,
      "text": "Wail, residents of the Mortar, for all the merchants are cut off; all who trade with silver are destroyed.",
      "links": "<a href='/AIV/26/7/27'>Ezekiel 7:27</a>, <a href='/AIV/59/5/1-3'>James 5:1-3</a>",
      "comment": "Economic judgment reinforces that no aspect of life is untouched by sin, and that misplaced trust in riches leads to ruin."
    },
    {
      "pk": 4401012,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 12,
      "text": "At that time I will search Jerusalem with lamps, and I will punish those who are complacent, who say in their hearts, 'The LORD will not do good nor will he do harm.'",
      "links": "<a href='/AIV/19/139/23'>Ps. 139:23</a>, <a href='/AIV/66/3/15-16'>Rev. 3:15-16</a>",
      "comment": "Divine scrutiny exposes hidden sin. The imagery foreshadows God’s searching and refining work, urging believers to avoid spiritual indifference."
    },
    {
      "pk": 4401013,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 13,
      "text": "Their wealth will become plunder and their houses a desolation. They will build houses but not inhabit them; they will plant vineyards but not drink their wine.",
      "links": "<a href='/AIV/05/28/30'>Deuteronomy 28:30</a>, <a href='/AIV/23/65/21-22'>Isaiah 65:21-22</a>",
      "comment": "Reflects the curse for covenant disobedience (Deut. 28:30) and foreshadows hope for reversal through restoration."
    },
    {
      "pk": 4401014,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 14,
      "text": "The great day of the LORD is near, near and coming quickly. The sound of the day of the LORD is bitter; the mighty man cries out there.",
      "links": "<a href='/AIV/29/2/1'>Joel 2:1</a>, <a href='/AIV/66/6/17'>Rev. 6:17</a>",
      "comment": "Announces the imminent arrival of God’s judgment, urging repentance and spiritual readiness, reminiscent of apocalyptic warnings in Joel and Revelation."
    },
    {
      "pk": 4401015,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 15,
      "text": "That day is a day of wrath, a day of distress and anguish, a day of ruin and devastation, a day of darkness and gloom, a day of clouds and thick darkness.",
      "links": "<a href='/AIV/29/2/2'>Joel 2:2</a>, <a href='/AIV/23/8/22'>Isaiah 8:22</a>",
      "comment": "The vivid description intensifies the seriousness of God’s wrath. Also points ahead to the need for merciful deliverance—a theme developed in the coming of Christ."
    },
    {
      "pk": 4401016,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 16,
      "text": "A day of trumpet and battle cries against the fortified cities and against the high towers.",
      "links": "<a href='/AIV/06/6/5'>Joshua 6:5</a>, <a href='/AIV/66/8/13'>Rev. 8:13</a>",
      "comment": "Trumpet imagery features in both judgment and the announcement of salvation (cf. Joshua, Revelation). The theme calls believers to be watchful and alert."
    },
    {
      "pk": 4401017,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 17,
      "text": "I will bring distress on mankind, and they will walk like the blind because they have sinned against the LORD. Their blood will be poured out like dust and their flesh like dung.",
      "links": "<a href='/AIV/05/28/29'>Deut. 28:29</a>, <a href='/AIV/19/79/3'>Ps. 79:3</a>",
      "comment": "Blindness is symbolic of spiritual lostness. Echoes consequences of rejecting God, with strong calls to turn to Him for guidance and mercy."
    },
    {
      "pk": 4401018,
      "translation": "AIV",
      "book": 36,
      "chapter": 1,
      "verse": 18,
      "text": "Neither their silver nor their gold will be able to deliver them on the day of the LORD’s wrath. In the fire of his jealousy all the earth will be consumed; for he will make a sudden end of all the inhabitants of the earth.",
      "links": "<a href='/AIV/26/7/19'>Ezekiel 7:19</a>, <a href='/AIV/66/18/17'>Rev. 18:17</a>",
      "comment": "Material wealth is powerless before God’s judgment. Points to the need for a right relationship with God, emphasizing faith over material security, and also anticipates total renewal—a key theme of hope seen in later prophecy and fulfilled in Christ’s redemptive work."
    }
  ],
  "translatedAt": "2025-12-23T07:35:15.357Z"
}