{
  "book": 65,
  "bookName": "Hebrews",
  "bookAbbreviation": "Heb",
  "chapter": 13,
  "verses": [
    {
      "pk": 65013001,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 1,
      "text": "Let brotherly love continue.",
      "links": "<a href='/AIV/19/133/1'>Ps. 133:1</a>; <a href='/AIV/43/13/34'>John 13:34</a>",
      "comment": "The author urges steadfastness in love for fellow believers. This recurring command links back to Jesus urging His followers to love one another, highlighting the ongoing call for unity in the community of faith."
    },
    {
      "pk": 65013002,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 2,
      "text": "Do not neglect to show hospitality to strangers, for by doing so some have entertained angels without knowing it.",
      "links": "<a href='/AIV/01/18/1'>Gen. 18:1–3</a>; <a href='/AIV/07/13/15-20'>Judg. 13:15-20</a>",
      "comment": "Hospitality is more than courtesy—it opens a space for divine encounters, as seen in Abraham’s story. This underscores the idea that God continues to reveal Himself through the communion of believers with one another."
    },
    {
      "pk": 65013003,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 3,
      "text": "Remember those who are imprisoned, as though you were in prison with them, and those who are mistreated, since you yourselves are in the body also.",
      "links": "<a href='/AIV/40/25/36'>Matt. 25:36</a>; <a href='/AIV/46/12/26'>1 Cor. 12:26</a>",
      "comment": "Solidarity with those suffering for their faith is stressed. The imagery of being 'in the body' alludes to the mystical unity among believers. Practically, this reflects charity rooted in Christ’s own suffering community."
    },
    {
      "pk": 65013004,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 4,
      "text": "Let marriage be honored among all, and let the marriage bed be undefiled, for God will judge the sexually immoral and adulterers.",
      "links": "<a href='/AIV/02/20/14'>Ex. 20:14</a>; <a href='/AIV/40/19/6'>Matt. 19:6</a>",
      "comment": "This verse emphasizes the sanctity of marriage, a covenant that reflects Christ’s relationship to the Church. Purity is linked both to personal holiness and the health of the faith community."
    },
    {
      "pk": 65013005,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 5,
      "text": "Keep your life free from the love of money, and be content with what you have. For he himself has said, 'I will never leave you nor forsake you.'",
      "links": "<a href='/AIV/05/31/6'>Deut. 31:6</a>; <a href='/AIV/19/37/25'>Ps. 37:25</a>",
      "comment": "A warning against greed is reminded by God’s promise of His enduring presence. The call to trust God’s providence over possessions echoes Christ’s teaching to seek first God’s kingdom."
    },
    {
      "pk": 65013006,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 6,
      "text": "So we can confidently say, 'The Lord is my helper; I will not be afraid. What can man do to me?'",
      "links": "<a href='/AIV/19/118/6'>Ps. 118:6</a>; <a href='/AIV/45/08/31'>Rom. 8:31</a>",
      "comment": "Drawing from the Psalms, the author assures believers of God’s supreme protection. Trust in the Lord dispels fear, reinforcing reliance on God in the face of persecution."
    },
    {
      "pk": 65013007,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 7,
      "text": "Remember your leaders, those who spoke the word of God to you. Consider the outcome of their way of life, and imitate their faith.",
      "links": "<a href='/AIV/52/05/12'>1 Thess. 5:12</a>; <a href='/AIV/58/13/17'>Heb. 13:17</a>",
      "comment": "Believers are called to honor spiritual leaders and imitate their faithfulness. This points to a spiritual lineage in the Church based on apostolic succession and fidelity to the Gospel."
    },
    {
      "pk": 65013008,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 8,
      "text": "Jesus Christ is the same yesterday and today and forever.",
      "links": "<a href='/AIV/19/102/27'>Ps. 102:27</a>; <a href='/AIV/43/01/1-3'>John 1:1-3</a>",
      "comment": "Christ's unchanging nature affirms His divinity and eternal priesthood. This underlines the reliability of His promises and teaching for all generations."
    },
    {
      "pk": 65013009,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 9,
      "text": "Do not be carried away by all kinds of strange teachings, for it is good for the heart to be strengthened by grace, not by foods, which have not benefited those who observe them.",
      "links": "<a href='/AIV/51/2/8'>Col. 2:8</a>; <a href='/AIV/45/14/17'>Rom. 14:17</a>",
      "comment": "Believers are warned against deceptive doctrines. The emphasis is on grace received through faith and the spiritual nourishment found at the altar, contrasting with mere ritual observances."
    },
    {
      "pk": 65013010,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 10,
      "text": "We have an altar from which those who serve in the tabernacle have no right to eat.",
      "links": "<a href='/AIV/46/10/16-18'>1 Cor. 10:16-18</a>; <a href='/AIV/03/16/27'>Lev. 16:27</a>",
      "comment": "The reference to a new 'altar' hints at a unique, ongoing sacrifice, distinguishing the new covenant's sacramental worship from the Old Testament rites."
    },
    {
      "pk": 65013011,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 11,
      "text": "For the bodies of those animals whose blood is brought into the holy places by the high priest as a sacrifice for sin are burned outside the camp.",
      "links": "<a href='/AIV/03/16/27'>Lev. 16:27</a>",
      "comment": "This links the Levitical sacrifices with Christ’s own suffering 'outside the gate'. The disposal of the sacrifice prefigures Christ’s atoning death."
    },
    {
      "pk": 65013012,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 12,
      "text": "Therefore Jesus also suffered outside the gate, in order to sanctify the people through his own blood.",
      "links": "<a href='/AIV/43/19/17'>John 19:17</a>; <a href='/AIV/58/09/13-14'>Heb. 9:13-14</a>",
      "comment": "Christ’s suffering outside Jerusalem fulfills what the Old Testament sacrifices pointed to. His blood sanctifies in a once-for-all atoning action."
    },
    {
      "pk": 65013013,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 13,
      "text": "Therefore let us go out to him outside the camp, bearing the disgrace he endured.",
      "links": "<a href='/AIV/40/10/38'>Matt. 10:38</a>; <a href='/AIV/45/08/17'>Rom. 8:17</a>",
      "comment": "The believer is invited to share in Christ's suffering—living the call to bear our own cross, following Jesus, even outside the safe bounds of the community."
    },
    {
      "pk": 65013014,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 14,
      "text": "For here we do not have a lasting city, but we are seeking the one that is to come.",
      "links": "<a href='/AIV/50/3/20-21'>Phil. 3:20-21</a>; <a href='/AIV/58/11/10'>Heb. 11:10</a>",
      "comment": "This verse points to a hope beyond this world—a heavenly home. This captures both the literal and spiritual longing for the fullness of God’s kingdom."
    },
    {
      "pk": 65013015,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 15,
      "text": "Through him then, let us continually offer up a sacrifice of praise to God, that is, the fruit of lips that acknowledge his name.",
      "links": "<a href='/AIV/19/50/23'>Ps. 50:23</a>; <a href='/AIV/28/14/2'>Hos. 14:2</a>",
      "comment": "The true sacrifice now is continual praise and confession, made possible through Jesus’ mediation. The spiritual worship of Christians fulfills the prophecy of constant praise to God."
    },
    {
      "pk": 65013016,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 16,
      "text": "Do not neglect to do good and to share what you have, for with such sacrifices God is well pleased.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>; <a href='/AIV/40/25/40'>Matt. 25:40</a>",
      "comment": "Acts of charity and generosity are described as pleasing sacrifices to God. The work of mercy is shown as intrinsic to the Christian life of worship."
    },
    {
      "pk": 65013017,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 17,
      "text": "Obey your leaders and submit to them, for they are keeping watch over your souls as those who will have to give an account. Let them do this with joy and not with grief, for that would be of no advantage to you.",
      "links": "<a href='/AIV/58/13/7'>Heb. 13:7</a>; <a href='/AIV/44/20/28'>Acts 20:28</a>",
      "comment": "The authority of the spiritual shepherds is emphasized, revealing the structure of leadership and accountability established by Christ for His Church. Submission and obedience here are key to the order and unity of the community."
    },
    {
      "pk": 65013018,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 18,
      "text": "Pray for us, for we are convinced that we have a clear conscience, desiring to act honorably in all things.",
      "links": "<a href='/AIV/49/06/19'>Eph. 6:19</a>; <a href='/AIV/52/05/25'>1 Thess. 5:25</a>",
      "comment": "A request for prayer links the spiritual welfare of leaders and the faithful. Intercessory prayer upholds the apostles and their mission."
    },
    {
      "pk": 65013019,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 19,
      "text": "I urge you especially to do this, so that I may be restored to you the sooner.",
      "links": "<a href='/AIV/45/15/30-32'>Rom. 15:30-32</a>",
      "comment": "Personal appeals display apostolic humility and love, reinforcing familial ties between spiritual leaders and congregations."
    },
    {
      "pk": 65013020,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 20,
      "text": "Now may the God of peace, who brought up our Lord Jesus from the dead, the great Shepherd of the sheep, by the blood of the everlasting covenant,",
      "links": "<a href='/AIV/19/23/1'>Ps. 23:1</a>; <a href='/AIV/26/37/24-26'>Ezek. 37:24-26</a>; <a href='/AIV/58/09/20'>Heb. 9:20</a>",
      "comment": "Christ is identified as the Shepherd, a messianic allusion. His resurrection and eternal covenant are the foundation of our hope, showing the fulfillment of Old Testament prophecy in Jesus."
    },
    {
      "pk": 65013021,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 21,
      "text": "equip you with every good thing to do his will, working in us what is pleasing in his sight, through Jesus Christ, to whom be glory forever and ever. Amen.",
      "links": "<a href='/AIV/50/2/13'>Phil. 2:13</a>; <a href='/AIV/60/5/10-11'>1 Pet. 5:10-11</a>",
      "comment": "God's grace enables believers to fulfill His will. The cooperation with divine grace reflects Christ’s own work through us—a spiritual reality at the heart of Christian transformation."
    },
    {
      "pk": 65013022,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 22,
      "text": "I urge you, brothers, bear with this word of exhortation, for I have written to you briefly.",
      "links": "<a href='/AIV/58/13/19'>Heb. 13:19</a>",
      "comment": "The tone is pastoral, reminding readers that although the letter is brief, its teachings are to be received earnestly. Apostolic exhortation carries enduring authority for the Church."
    },
    {
      "pk": 65013023,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 23,
      "text": "Know that our brother Timothy has been set free, with whom, if he comes soon, I will see you.",
      "links": "<a href='/AIV/54/1/2'>1 Tim. 1:2</a>; <a href='/AIV/55/4/9'>2 Tim. 4:9</a>",
      "comment": "The mention of Timothy reveals the close relationships among early Church leaders and the apostolic continuity in leadership and mission."
    },
    {
      "pk": 65013024,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 24,
      "text": "Greet all your leaders and all the saints. Those from Italy send you greetings.",
      "links": "<a href='/AIV/50/4/21-22'>Phil. 4:21-22</a>",
      "comment": "The reference to leaders and saints together underlines both hierarchical and communal aspects of the faith community. Sending greetings from another region reflects the universal and united nature of the Church."
    },
    {
      "pk": 65013025,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 13,
      "verse": 25,
      "text": "Grace be with you all.",
      "links": "<a href='/AIV/54/6/21'>1 Tim. 6:21</a>; <a href='/AIV/55/4/22'>2 Tim. 4:22</a>",
      "comment": "The apostolic blessing concludes the letter, emphasizing the centrality of grace in the Christian life—the gift of God that sustains His people until the end."
    }
  ],
  "translatedAt": "2025-12-24T12:23:44.005Z"
}