{
  "book": 65,
  "bookName": "Hebrews",
  "bookAbbreviation": "Heb",
  "chapter": 2,
  "verses": [
    {
      "pk": 65002001,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 1,
      "text": "Therefore, we must pay much closer attention to what we have heard, so that we do not drift away.",
      "links": "<a href='/AIV/40/7/24-27'>Matt 7:24-27</a>; <a href='/AIV/58/3/12'>Heb 3:12</a>",
      "comment": "This call to diligence underscores the danger of spiritual neglect. The language implies active listening and obedience to apostolic teaching. Links connect to Christ's warning about building on the rock and the need for perseverance in faith."
    },
    {
      "pk": 65002002,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 2,
      "text": "For if the message declared by angels was confirmed, and every transgression and disobedience received a just penalty,",
      "links": "<a href='/AIV/02/20/1'>Ex 20:1</a>; <a href='/AIV/05/33/2'>Deut 33:2</a>; <a href='/AIV/44/7/53'>Acts 7:53</a>",
      "comment": "Refers to the Mosaic Law, said to be delivered by angels (see Acts 7:53). The implication is that God's warnings through angels had binding consequences, setting up the greater responsibility for the message of Christ."
    },
    {
      "pk": 65002003,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 3,
      "text": "how will we escape if we ignore such a great salvation? It was first declared by the Lord, and it was confirmed to us by those who heard Him,",
      "links": "<a href='/AIV/40/4/17'>Matt 4:17</a>; <a href='/AIV/41/1/14-15'>Mark 1:14-15</a>; <a href='/AIV/42/1/2'>Luke 1:2</a>",
      "comment": "Salvation was first announced by Jesus Himself, then affirmed by His direct hearers (apostles). This highlights both the divine origin and apostolic succession in teaching authority. Note the implicit encouragement to trust authentic witnesses."
    },
    {
      "pk": 65002004,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 4,
      "text": "while God also bore witness by signs and wonders and various miracles and by gifts of the Holy Spirit distributed according to His will.",
      "links": "<a href='/AIV/44/2/22'>Acts 2:22</a>; <a href='/AIV/46/12/4-11'>1 Cor 12:4-11</a>",
      "comment": "God’s confirmation comes through miracles and spiritual gifts, reflecting the work of the Spirit in the early Church. Note how gifts are given according to the divine will, subtly affirming the importance of receiving and perpetuating these gifts in a visible body."
    },
    {
      "pk": 65002005,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 5,
      "text": "For it was not to angels that He subjected the world to come, of which we are speaking.",
      "links": "<a href='/AIV/19/8/4-6'>Ps 8:4-6</a>; <a href='/AIV/46/6/2-3'>1 Cor 6:2-3</a>",
      "comment": "The coming kingdom is not ruled by angels but is prepared for mankind, especially in Christ. This echoes Psalm 8 and Paul’s teaching on future authority of believers, pointing toward Christ’s unique mediatorial role."
    },
    {
      "pk": 65002006,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 6,
      "text": "But someone has testified somewhere, saying, \"What is man, that You are mindful of him, or the son of man, that You care for him?\"",
      "links": "<a href='/AIV/19/8/4'>Ps 8:4</a>",
      "comment": "Quotes Psalm 8, marveling at God’s concern for humanity and especially for ‘the Son of Man.’ Early Christians recognize prophetic reference to Jesus, who fulfills this exalted status on behalf of all."
    },
    {
      "pk": 65002007,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 7,
      "text": "You made him a little lower than the angels; You crowned him with glory and honor, and put everything under his feet.",
      "links": "<a href='/AIV/19/8/5-6'>Ps 8:5-6</a>; <a href='/AIV/19/110/1'>Ps 110:1</a>; <a href='/AIV/46/15/27'>1 Cor 15:27</a>",
      "comment": "Psalm 8 points to both mankind’s vocation and prophetically anticipates Jesus, who was humbled yet exalted above all. Crowned with glory hints at the resurrection and ascension. Linked with Psalm 110:1, used by Jesus to indicate his messianic authority."
    },
    {
      "pk": 65002008,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 8,
      "text": "You put all things in subjection under his feet.\" Now in subjecting all things to him, He left nothing outside his authority. But at present, we do not yet see all things subjected to him.",
      "links": "<a href='/AIV/19/8/6'>Ps 8:6</a>; <a href='/AIV/46/15/25-27'>1 Cor 15:25-27</a>",
      "comment": "Recognizes the tension between the fullness of Christ’s authority and the current condition of the world. Christ’s reign is real, awaiting final consummation. Shows a dynamic understanding of kingdom already and not yet."
    },
    {
      "pk": 65002009,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 9,
      "text": "But we see Jesus, who for a little while was made lower than the angels, crowned with glory and honor because of suffering death, so that by the grace of God He might taste death for everyone.",
      "links": "<a href='/AIV/19/8/5'>Ps 8:5</a>; <a href='/AIV/40/20/28'>Matt 20:28</a>; <a href='/AIV/45/5/18'>Rom 5:18</a>",
      "comment": "Jesus fulfills Psalm 8, taking on human weakness, conquering by sacrificial death. Dying ‘for all’ communicates a universal scope of atonement, a central and ancient Christian understanding."
    },
    {
      "pk": 65002010,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 10,
      "text": "For it was fitting that He, for whom and through whom all things exist, in bringing many sons to glory, should make the founder of their salvation perfect through suffering.",
      "links": "<a href='/AIV/43/1/3'>John 1:3</a>; <a href='/AIV/45/8/17'>Rom 8:17</a>",
      "comment": "Speaks of the necessity and suitableness of Christ’s suffering for redemption, and bringing believers to glory. The language of ‘founder’ and perfection through suffering underlines Jesus’ priestly office and the value of redemptive suffering."
    },
    {
      "pk": 65002011,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 11,
      "text": "For he who sanctifies and those who are sanctified all have one origin. That is why he is not ashamed to call them brothers,",
      "links": "<a href='/AIV/43/17/19'>John 17:19</a>; <a href='/AIV/40/28/10'>Matt 28:10</a>",
      "comment": "This reveals deep solidarity between Jesus and His people. Sanctification—the believer’s growth in holiness—is a shared work. The familial language points to a real union with Christ, not just a legal or symbolic one."
    },
    {
      "pk": 65002012,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 12,
      "text": "saying, \"I will proclaim Your name to my brothers; in the midst of the assembly I will sing Your praise.\"",
      "links": "<a href='/AIV/19/22/22'>Ps 22:22</a>",
      "comment": "Quoting Psalm 22, a messianic psalm often applied to Jesus’ suffering and victory. The image of Christ actively participating in worship with believers affirms visible, communal praise as a real encounter with the risen Lord."
    },
    {
      "pk": 65002013,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 13,
      "text": "And again, \"I will put my trust in Him.\" And again, \"Behold, I and the children God has given me.\"",
      "links": "<a href='/AIV/23/8/17-18'>Isa 8:17-18</a>",
      "comment": "Isaiah’s prophecy here shapes the Church’s understanding of collective identity under Christ. The reference to ‘children God has given me’ foreshadows the Church as Christ’s spiritual family, unified by trust in God."
    },
    {
      "pk": 65002014,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 14,
      "text": "Since therefore the children share in flesh and blood, He himself likewise partook of the same, so that through death He might destroy the one who has the power of death, that is, the devil,",
      "links": "<a href='/AIV/45/8/3'>Rom 8:3</a>; <a href='/AIV/62/3/8'>1 John 3:8</a>",
      "comment": "Christ’s full participation in human nature is emphasized, affirming the incarnation. By dying, He conquers death and the devil—a cosmic victory that also points to the necessity of a real, physical redemption."
    },
    {
      "pk": 65002015,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 15,
      "text": "and deliver those who through fear of death were subject to lifelong slavery.",
      "links": "<a href='/AIV/43/8/34-36'>John 8:34-36</a>",
      "comment": "Freedom from the fear and bondage of death is a key aspect of Christian salvation. Christ's work liberates humanity for true spiritual life, hinting at both a spiritual and physical resurrection."
    },
    {
      "pk": 65002016,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 16,
      "text": "For surely it is not to angels that He gives aid, but He helps the offspring of Abraham.",
      "links": "<a href='/AIV/01/22/17-18'>Gen 22:17-18</a>; <a href='/AIV/48/3/29'>Gal 3:29</a>",
      "comment": "Salvation is particular to humanity, the offspring of Abraham—a promise of blessing fulfilled in Christ and accessible to all who belong to Him (see Galatians 3:29, the spiritual family of faith)."
    },
    {
      "pk": 65002017,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 17,
      "text": "Therefore he had to be made like his brothers in every respect, so that he might become a merciful and faithful high priest in service to God, to make atonement for the sins of the people.",
      "links": "<a href='/AIV/03/16/6'>Lev 16:6</a>; <a href='/AIV/19/110/4'>Ps 110:4</a>; <a href='/AIV/58/4/15'>Heb 4:15</a>",
      "comment": "Christ’s priesthood is both merciful and effective, rooted in His real human nature and His self-offering. The role of high priest and atonement strongly points toward the continuation of sacrificial ministry, a deep and central Christian concept."
    },
    {
      "pk": 65002018,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 2,
      "verse": 18,
      "text": "For because He Himself suffered when tempted, He is able to help those who are being tempted.",
      "links": "<a href='/AIV/40/4/1'>Matt 4:1</a>; <a href='/AIV/58/4/15'>Heb 4:15</a>",
      "comment": "Jesus’ empathy and aid in temptation derives from His real experience of suffering. This grounds Christian confidence not just in Christ’s sovereignty, but also His priestly compassion and personal understanding."
    }
  ],
  "translatedAt": "2025-12-24T12:17:03.290Z"
}