{
  "book": 65,
  "bookName": "Hebrews",
  "bookAbbreviation": "Heb",
  "chapter": 11,
  "verses": [
    {
      "pk": 65011001,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 1,
      "text": "Now faith is the assurance of things hoped for, the conviction of things not seen.",
      "links": "<a href='/AIV/41/11/24'>Mark 11:24</a>; <a href='/AIV/45/8/24-25'>Romans 8:24-25</a>",
      "comment": "The definition of faith given here focuses on confidence and conviction. The Greek word for 'assurance' can also mean 'substance' or 'foundation,' highlighting faith as something real and enduring. Faith in this sense is not merely intellectual assent, but trusting obedience. Notice how faith is considered a response to God's promises, even when their fulfillment is not yet visible."
    },
    {
      "pk": 65011002,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 2,
      "text": "For by this, the people of old received approval.",
      "links": "<a href='/AIV/58/11/39'>Hebrews 11:39</a>; <a href='/AIV/1/15/6'>Genesis 15:6</a>",
      "comment": "'The people of old' refers to ancient believers who, by their faith, were commended by God. This underscores the importance of faith throughout salvation history."
    },
    {
      "pk": 65011003,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 3,
      "text": "By faith, we understand that the universe was formed by the word of God, so that what is seen was not made from visible things.",
      "links": "<a href='/AIV/1/1/1'>Genesis 1:1-3</a>; <a href='/AIV/19/33/6'>Psalm 33:6</a>; <a href='/AIV/43/1/3'>John 1:3</a>",
      "comment": "This verse teaches that creation is the work of God’s word, ex nihilo (out of nothing). Faith is needed to perceive this truth, connecting it to the role of God’s spoken word throughout Scripture (e.g., creation, the Word made flesh)."
    },
    {
      "pk": 65011004,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 4,
      "text": "By faith Abel offered to God a more acceptable sacrifice than Cain, through which he was commended as righteous, God testifying about his gifts. Through faith, though he died, he still speaks.",
      "links": "<a href='/AIV/1/4/3-10'>Genesis 4:3-10</a>; <a href='/AIV/40/23/35'>Matthew 23:35</a>",
      "comment": "Abel’s faith made his sacrifice pleasing to God and his example continues to teach us. The text implies the importance of right intention and obedience in worship."
    },
    {
      "pk": 65011005,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 5,
      "text": "By faith Enoch was taken up so that he would not see death, and he was not found because God took him. For before he was taken he was commended as having pleased God.",
      "links": "<a href='/AIV/1/5/21-24'>Genesis 5:21-24</a>; <a href='/AIV/58/11/2'>Hebrews 11:2</a>",
      "comment": "Enoch’s translation to heaven is a sign of communion between God and those who walk in faith. Implies God’s ability to reward perseverance even before Christ’s coming."
    },
    {
      "pk": 65011006,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 6,
      "text": "And without faith it is impossible to please him, for whoever would draw near to God must believe that he exists and that he rewards those who seek him.",
      "links": "<a href='/AIV/19/34/9-10'>Psalm 34:9-10</a>; <a href='/AIV/24/29/13'>Jeremiah 29:13</a>",
      "comment": "The necessity of faith is underscored here. The reward for seeking God implies both earthly and eternal blessings. Notice the emphasis on an active, trusting search for God rather than a merely intellectual belief."
    },
    {
      "pk": 65011007,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 7,
      "text": "By faith Noah, being warned by God about things not yet seen, moved with reverent fear, built an ark to save his household. By this he condemned the world and became an heir of the righteousness that comes by faith.",
      "links": "<a href='/AIV/1/6/13-22'>Genesis 6:13-22</a>; <a href='/AIV/60/3/20'>1 Peter 3:20</a>",
      "comment": "Noah responded with obedient action when warned by God, serving as an example of faith that brings salvation. His 'condemnation' of the world points to the contrast between faithful obedience and the disobedience around him."
    },
    {
      "pk": 65011008,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 8,
      "text": "By faith Abraham obeyed when he was called to go out to a place that he would receive as an inheritance. He set out, not knowing where he was going.",
      "links": "<a href='/AIV/1/12/1-4'>Genesis 12:1-4</a>; <a href='/AIV/44/7/2-4'>Acts 7:2-4</a>",
      "comment": "Abraham’s obedient journey into the unknown is an example of radical trust. Obedience and faith cooperate together in salvation history."
    },
    {
      "pk": 65011009,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 9,
      "text": "By faith he stayed as a foreigner in the land of promise, as in a foreign land, living in tents with Isaac and Jacob, heirs with him of the same promise.",
      "links": "<a href='/AIV/1/26/3'>Genesis 26:3</a>; <a href='/AIV/1/28/4'>Genesis 28:4</a>",
      "comment": "Living in tents shows Abraham’s hope was in a greater, permanent promise. The shared inheritance between Abraham, Isaac, and Jacob highlights the continuity in God’s plan."
    },
    {
      "pk": 65011010,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 10,
      "text": "For he was looking forward to the city with foundations, whose designer and builder is God.",
      "links": "<a href='/AIV/66/21/2'>Revelation 21:2</a>; <a href='/AIV/58/12/22'>Hebrews 12:22</a>",
      "comment": "Abraham sought a heavenly fulfillment beyond the earthly land, anticipating the new Jerusalem. This points to the ultimate hope in God’s eternal kingdom."
    },
    {
      "pk": 65011011,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 11,
      "text": "By faith even Sarah herself received power to conceive, even when she was past age, since she considered him faithful who had promised.",
      "links": "<a href='/AIV/1/18/11-14'>Genesis 18:11-14</a>; <a href='/AIV/1/21/2'>Genesis 21:2</a>",
      "comment": "Sarah’s faith overcame her initial doubt, showing that God fulfills promises even in impossible circumstances. Trust in God’s faithfulness is central here."
    },
    {
      "pk": 65011012,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 12,
      "text": "Therefore from one man, and him as good as dead, descendants were born as numerous as the stars of heaven and as countless as the sand by the seashore.",
      "links": "<a href='/AIV/1/15/5'>Genesis 15:5</a>; <a href='/AIV/1/22/17'>Genesis 22:17</a>",
      "comment": "Abraham’s miraculous fatherhood fulfills the promise to multiply God’s people. This foreshadows the inclusion of all believers in God’s family."
    },
    {
      "pk": 65011013,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 13,
      "text": "All these died in faith, not having received the promises, but having seen them and greeted them from afar, and having confessed that they were strangers and pilgrims on the earth.",
      "links": "<a href='/AIV/1/23/4'>Genesis 23:4</a>; <a href='/AIV/60/2/11'>1 Peter 2:11</a>",
      "comment": "The patriarchs’ faith did not depend on tangible fulfillment in their lifetimes. Christians also are pilgrims, awaiting the fulfillment of God's promises."
    },
    {
      "pk": 65011014,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 14,
      "text": "For those who say such things make it clear that they are seeking a homeland.",
      "links": "<a href='/AIV/50/3/20'>Philippians 3:20</a>",
      "comment": "Seeking a homeland points forward to the heavenly inheritance. The desire for a better country remains central to faith."
    },
    {
      "pk": 65011015,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 15,
      "text": "And if they had been remembering that land from which they had gone out, they could have had opportunity to return.",
      "links": "<a href='/AIV/1/24/6-7'>Genesis 24:6-7</a>",
      "comment": "The faithful did not desire to return to their former lives. Their singular focus on God's future is a model for all believers."
    },
    {
      "pk": 65011016,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 16,
      "text": "But as it is, they desire a better country, that is, a heavenly one. Therefore God is not ashamed to be called their God, for he has prepared a city for them.",
      "links": "<a href='/AIV/66/21/2'>Revelation 21:2</a>; <a href='/AIV/2/3/8'>Exodus 3:8</a>",
      "comment": "God’s preparation of a city for the faithful references the heavenly Jerusalem. The desire for heaven motivates a holy way of life."
    },
    {
      "pk": 65011017,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 17,
      "text": "By faith Abraham, when he was tested, offered up Isaac. He who had received the promises was in the act of offering up his only son.",
      "links": "<a href='/AIV/1/22/1-19'>Genesis 22:1-19</a>; <a href='/AIV/59/2/21'>James 2:21</a>",
      "comment": "Abraham's willingness to offer Isaac prefigures the ultimate sacrifice of Christ. Faith here means trusting God even when we cannot understand his ways."
    },
    {
      "pk": 65011018,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 18,
      "text": "He to whom it was said, 'Through Isaac your offspring shall be named.'",
      "links": "<a href='/AIV/1/21/12'>Genesis 21:12</a>; <a href='/AIV/45/9/7'>Romans 9:7</a>",
      "comment": "Citing the promise about Isaac, the text shows the tension between God’s promise and command. Faith patiently waits to see how God will fulfill his Word."
    },
    {
      "pk": 65011019,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 19,
      "text": "He considered that God was able even to raise him from the dead, from which, figuratively speaking, he did receive him back.",
      "links": "<a href='/AIV/1/22/5-13'>Genesis 22:5-13</a>; <a href='/AIV/45/4/17'>Romans 4:17</a>",
      "comment": "Abraham’s faith anticipated resurrection. The text sees the near-sacrifice as a type, prefiguring God’s power to raise the dead—fulfilled in Christ’s resurrection."
    },
    {
      "pk": 65011020,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 20,
      "text": "By faith Isaac blessed Jacob and Esau, concerning things to come.",
      "links": "<a href='/AIV/1/27/27-40'>Genesis 27:27-40</a>",
      "comment": "Isaac’s blessing is prophetic, showing faith in God’s unseen future. Blessings carry spiritual authority in the unfolding of God’s plan."
    },
    {
      "pk": 65011021,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 21,
      "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons, bowing in worship over the head of his staff.",
      "links": "<a href='/AIV/1/48/1-20'>Genesis 48:1-20</a>",
      "comment": "Jacob’s act demonstrates faith in God's promises for the next generation and connects worship with blessing and prophetic action."
    },
    {
      "pk": 65011022,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 22,
      "text": "By faith Joseph, at the end of his life, spoke about the departure of the Israelites and gave instructions concerning his bones.",
      "links": "<a href='/AIV/1/50/24-25'>Genesis 50:24-25</a>; <a href='/AIV/2/13/19'>Exodus 13:19</a>",
      "comment": "Joseph’s faith looked forward to the fulfillment of God’s plan, trusting in the covenant even as he died."
    },
    {
      "pk": 65011023,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 23,
      "text": "By faith Moses, when he was born, was hidden for three months by his parents because they saw that the child was beautiful and they were not afraid of the king’s command.",
      "links": "<a href='/AIV/2/2/2-3'>Exodus 2:2-3</a>; <a href='/AIV/44/7/20'>Acts 7:20</a>",
      "comment": "The faith of Moses’ parents in defying Pharaoh’s order set the stage for the deliverance of Israel."
    },
    {
      "pk": 65011024,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 24,
      "text": "By faith Moses, when he grew up, refused to be called the son of Pharaoh’s daughter.",
      "links": "<a href='/AIV/2/2/10-15'>Exodus 2:10-15</a>",
      "comment": "Moses chose his true identity among God's people rather than the prestige of Egypt, valuing spiritual inheritance over earthly riches."
    },
    {
      "pk": 65011025,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 25,
      "text": "Choosing rather to suffer affliction with the people of God than to enjoy the fleeting pleasures of sin.",
      "links": "<a href='/AIV/45/8/17-18'>Romans 8:17-18</a>",
      "comment": "Suffering for righteousness unites the believer more closely with God’s purposes than temporary enjoyment of sin."
    },
    {
      "pk": 65011026,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 26,
      "text": "He considered the disgrace for the sake of Christ greater riches than the treasures of Egypt, for he was looking ahead to the reward.",
      "links": "<a href='/AIV/40/5/11-12'>Matthew 5:11-12</a>; <a href='/AIV/50/3/8'>Philippians 3:8</a>",
      "comment": "'For the sake of Christ' connects Moses to the messianic hope. The text reads Moses’ suffering as united with Christ, implying belief in a future redeemer. This places the old testament faithful in the mystery of Christ’s plan (see 1 Peter 1:10-11)."
    },
    {
      "pk": 65011027,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 27,
      "text": "By faith he left Egypt, not fearing the anger of the king, for he endured as seeing him who is invisible.",
      "links": "<a href='/AIV/2/12/37'>Exodus 12:37</a>; <a href='/AIV/58/3/5'>Hebrews 3:5</a>",
      "comment": "Moses’ perseverance was based on a spiritual vision of God. Endurance is rooted in awareness of the unseen."
    },
    {
      "pk": 65011028,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 28,
      "text": "By faith he kept the Passover and sprinkled the blood, so that the destroyer of the firstborn might not touch them.",
      "links": "<a href='/AIV/2/12/21-29'>Exodus 12:21-29</a>; <a href='/AIV/46/5/7'>1 Corinthians 5:7</a>",
      "comment": "The Passover prefigures Christ’s sacrifice, whose blood protects from judgment (cf. 1 Corinthians 5:7). Sacramental actions remain central in the life of faith."
    },
    {
      "pk": 65011029,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 29,
      "text": "By faith they crossed the Red Sea as on dry land, but when the Egyptians tried to do the same, they were swallowed up.",
      "links": "<a href='/AIV/2/14/21-29'>Exodus 14:21-29</a>; <a href='/AIV/46/10/1-2'>1 Corinthians 10:1-2</a>",
      "comment": "Passing through the sea is a symbol of deliverance and cleansing—a type of baptism (see 1 Corinthians 10:1-2)."
    },
    {
      "pk": 65011030,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 30,
      "text": "By faith the walls of Jericho fell down after they had been encircled for seven days.",
      "links": "<a href='/AIV/6/6/12-21'>Joshua 6:12-21</a>",
      "comment": "Obedience to God's unusual command brought miraculous victory. Faith often calls us to trust God's ways above human reasoning."
    },
    {
      "pk": 65011031,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 31,
      "text": "By faith Rahab the prostitute did not perish with those who were disobedient, because she had welcomed the spies in peace.",
      "links": "<a href='/AIV/6/2/1-21'>Joshua 2:1-21</a>; <a href='/AIV/59/2/25'>James 2:25</a>",
      "comment": "Rahab’s faith saved herself and her family. God can use even unlikely people when they respond in faith."
    },
    {
      "pk": 65011032,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 32,
      "text": "And what more shall I say? Time would fail me to tell of Gideon, Barak, Samson, Jephthah, David and Samuel and the prophets—",
      "links": "<a href='/AIV/7/6/11'>Judges 6:11</a>; <a href='/AIV/9/16/13'>1 Samuel 16:13</a>",
      "comment": "The author mentions a series of Old Testament figures, inviting us to consider their different, sometimes flawed lives, but noting faith as their common thread."
    },
    {
      "pk": 65011033,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 33,
      "text": "who by faith conquered kingdoms, administered justice, obtained promises, shut the mouths of lions,",
      "links": "<a href='/AIV/27/6/22'>Daniel 6:22</a>; <a href='/AIV/9/8/1-7'>1 Samuel 8:1-7</a>",
      "comment": "Faith works in both deeds of valor and service. 'Shut the mouths of lions' refers to Daniel (Daniel 6), showing God's miraculous help."
    },
    {
      "pk": 65011034,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 34,
      "text": "quenched the power of fire, escaped the edge of the sword, were made strong out of weakness, became mighty in war, put foreign armies to flight.",
      "links": "<a href='/AIV/27/3/27'>Daniel 3:27</a>; <a href='/AIV/7/7/21-22'>Judges 7:21-22</a>",
      "comment": "Miracles followed faith—deliverance from fire (Daniel’s friends), and victory in battle through divine strength."
    },
    {
      "pk": 65011035,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 35,
      "text": "Women received their dead by resurrection. Some were tortured, refusing to accept release, so that they might rise again to a better life.",
      "links": "<a href='/AIV/11/17/22-24'>1 Kings 17:22-24</a>; <a href='/AIV/12/4/36-37'>2 Kings 4:36-37</a>",
      "comment": "Resurrection is foreshadowed in the Old Testament. Suffering for faith with hope for a better resurrection alludes to an eternal reward, a belief in bodily resurrection and the hope beyond this life."
    },
    {
      "pk": 65011036,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 36,
      "text": "Others suffered mocking and flogging, and even chains and imprisonment.",
      "links": "<a href='/AIV/12/22/13'>2 Kings 22:13</a>; <a href='/AIV/24/20/2'>Jeremiah 20:2</a>",
      "comment": "Martyrdom and suffering for faith is a recurring theme, showing ultimate trust in God. The call to endure suffering unites believers of all ages."
    },
    {
      "pk": 65011037,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 37,
      "text": "They were stoned, they were sawn in two, they were killed with the sword; they went about in sheepskins and goatskins, destitute, afflicted, mistreated—",
      "links": "<a href='/AIV/12/1/8-10'>2 Kings 1:8-10</a>; <a href='/AIV/23/37/1'>Isaiah 37:1</a>",
      "comment": "Suffering for faith sometimes leads to death, as with the prophets. The tradition says Isaiah was sawn in two. Martyrdom is seen as a witness to hope in God greater than earthly gain."
    },
    {
      "pk": 65011038,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 38,
      "text": "of whom the world was not worthy—wandering in deserts and mountains, in dens and caves of the earth.",
      "links": "<a href='/AIV/11/19/9'>1 Kings 19:9</a>",
      "comment": "God's faithful often live as strangers, not fitting the current world, but being fit for the world to come. The spiritual life embraces this pilgrimage."
    },
    {
      "pk": 65011039,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 39,
      "text": "And all these, though commended through their faith, did not receive what was promised,",
      "links": "<a href='/AIV/58/11/2'>Hebrews 11:2</a>",
      "comment": "The saints of old trusted God even though they died before the full realization of the promises—showing salvation history moves toward a consummation."
    },
    {
      "pk": 65011040,
      "translation": "AIV",
      "book": 65,
      "bookName": "Hebrews",
      "bookAbbreviation": "Heb",
      "chapter": 11,
      "verse": 40,
      "text": "since God had provided something better for us, so that apart from us they should not be made perfect.",
      "links": "<a href='/AIV/58/12/23'>Hebrews 12:23</a>; <a href='/AIV/45/11/32'>Romans 11:32</a>",
      "comment": "Believers after Christ receive the fullness of God's promise, but the unity of all God’s people is necessary. Salvation is communal and comes to completion together—a truth that points to the mystical union of all the faithful, both living and dead."
    }
  ],
  "translatedAt": "2025-12-24T12:22:37.406Z"
}