{
  "book": "3 John",
  "bookAbbreviation": "3John",
  "chapter": 1,
  "verses": [
    {
      "pk": 4029301,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 1,
      "text": "The elder, to the beloved Gaius, whom I love in truth.",
      "links": "<a href='/AIV/62/2/1'>2 John 1:1</a>",
      "comment": "John addresses himself as 'the elder,' emphasizing apostolic authority rooted in the tradition handed down from Christ and the Apostles (see Matt. 16:19). The phrase 'whom I love in truth' highlights the importance of authentic Christian love, grounded in the truth of Christ."
    },
    {
      "pk": 4029302,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 2,
      "text": "Beloved, I pray that you may prosper in all things and be in good health, just as your soul prospers.",
      "links": "<a href='/AIV/19/35/27'>Psalm 35:27</a>",
      "comment": "John prays for Gaius' well-being, both spiritually and physically, reflecting a holistic view of salvation and blessing. This parallels the concept that grace transforms body and soul together (see 1 Thess. 5:23)."
    },
    {
      "pk": 4029303,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 3,
      "text": "For I rejoiced greatly when brothers came and testified to your truth, that you are walking in the truth.",
      "links": "<a href='/AIV/19/26/3'>Psalm 26:3</a>; <a href='/AIV/43/8/31'>John 8:31-32</a>",
      "comment": "The theme of 'walking in the truth' involves both right belief and living faithfully in God's commandments—a continuity of the faith 'once for all delivered' (Jude 1:3)."
    },
    {
      "pk": 4029304,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 4,
      "text": "I have no greater joy than this: to hear that my children are walking in the truth.",
      "links": "<a href='/AIV/66/2/2'>Revelation 2:2</a>",
      "comment": "John calls believers his 'children,' signifying spiritual fatherhood and apostolic care, reflecting the unity and continuity of the one true Church's shepherding ministry."
    },
    {
      "pk": 4029305,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 5,
      "text": "Beloved, you are acting faithfully in whatever you do for the brothers and strangers;",
      "links": "<a href='/AIV/40/25/40'>Matthew 25:40</a>",
      "comment": "Christian hospitality, especially to believers and strangers, is a hallmark of authentic faith. This reflects the corporal works of mercy taught by Christ. The term 'faithfully' also connects to perseverance in tradition."
    },
    {
      "pk": 4029306,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 6,
      "text": "They have testified to your love before the church. You will do well to help them on their journey in a manner worthy of God.",
      "links": "<a href='/AIV/58/13/2'>Hebrews 13:2</a>; <a href='/AIV/44/9/43'>Acts 9:43</a>",
      "comment": "Here, the 'church' is referenced as a visible gathering—a sign of unity and order. Helping fellow laborers is seen as fulfilling God's command and contributing to the mission entrusted to the Church."
    },
    {
      "pk": 4029307,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 7,
      "text": "For they have gone out for the sake of the Name, accepting nothing from the Gentiles.",
      "links": "<a href='/AIV/40/10/10'>Matthew 10:10</a>",
      "comment": "The term 'the Name' refers to Jesus, indicating a willingness to suffer and work solely for Christ's glory. The refusal to take support from gentiles demonstrates purity of mission and reliance on Christian community."
    },
    {
      "pk": 4029308,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 8,
      "text": "Therefore, we ought to support such people, so that we may become coworkers for the truth.",
      "links": "<a href='/AIV/46/3/9'>1 Corinthians 3:9</a>",
      "comment": "The call for support emphasizes communion and cooperation within the Church, underscoring the shared mission and responsibility for truth and teaching."
    },
    {
      "pk": 4029309,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 9,
      "text": "I wrote something to the church, but Diotrephes, who loves to be first among them, does not accept us.",
      "links": "<a href='/AIV/57/1/19'>Philemon 1:19</a>; <a href='/AIV/40/23/6'>Matthew 23:6</a>",
      "comment": "Diotrephes' rejection of apostolic authority exhibits the dangers of schism and pride. The verse warns against breaking fellowship with the apostolic tradition, suggesting the necessity of visible unity."
    },
    {
      "pk": 4029310,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 10,
      "text": "Therefore, if I come, I will bring up what he is doing, accusing us with evil words. And not content with that, he himself does not welcome the brothers, and those who wish to, he prevents and throws them out of the church.",
      "links": "<a href='/AIV/62/1/10'>1 John 1:10</a>; <a href='/AIV/43/9/34'>John 9:34</a>",
      "comment": "John's authority to rebuke Diotrephes highlights the importance of apostolic oversight. Expelling others from the church for desiring communion shows the seriousness of division from the body—a theme deeply rooted in early Christian practice."
    },
    {
      "pk": 4029311,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 11,
      "text": "Beloved, do not imitate evil, but imitate good. Whoever does good is from God; whoever does evil has not seen God.",
      "links": "<a href='/AIV/40/7/17'>Matthew 7:17</a>; <a href='/AIV/62/3/6'>1 John 3:6</a>",
      "comment": "The practice of good over evil is proof of fellowship with God, implying that faith is lived out in actions, as taught by the apostles and demonstrated by Christ's own example."
    },
    {
      "pk": 4029312,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 12,
      "text": "Demetrius has received a good testimony from everyone, and from the truth itself. We also testify, and you know that our testimony is true.",
      "links": "<a href='/AIV/43/19/35'>John 19:35</a>; <a href='/AIV/62/5/20'>1 John 5:20</a>",
      "comment": "The reliability of apostolic testimony about Demetrius points to the importance of recognizing true witnesses and role models, in line with tradition and verification of doctrine."
    },
    {
      "pk": 4029313,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 13,
      "text": "I have much to write to you, but I do not wish to write with pen and ink.",
      "links": "<a href='/AIV/62/2/12'>2 John 1:12</a>",
      "comment": "John's preference for face-to-face communication reflects the value placed on personal fellowship and the transmission of apostolic teaching in living tradition, not just written text."
    },
    {
      "pk": 4029314,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 14,
      "text": "But I hope to see you soon, and we will speak face to face.",
      "links": "<a href='/AIV/52/3/10'>1 Thessalonians 3:10</a>",
      "comment": "The desire for physical presence highlights the incarnational aspect of Christian community—truth is best conveyed through embodied tradition."
    },
    {
      "pk": 4029315,
      "translation": "AIV",
      "book": 64,
      "chapter": 1,
      "verse": 15,
      "text": "Peace to you. The friends greet you. Greet the friends by name.",
      "links": "<a href='/AIV/45/16/16'>Romans 16:16</a>",
      "comment": "The closing greeting emphasizes peace and the personal bonds within the Church, reinforcing unity and mutual recognition among believers as a mark of true fellowship in Christ."
    }
  ],
  "translatedAt": "2025-12-23T04:20:13.842Z"
}