{
  "book": "Titus",
  "bookAbbreviation": "Titus",
  "chapter": 1,
  "verses": [
    {
      "pk": 2007001,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 1,
      "text": "Paul, a servant of God and an apostle of Jesus Christ, for the faith of God's chosen people, and the knowledge of the truth that leads to godliness,",
      "links": "<a href='/AIV/45/1/1'>Rom. 1:1</a>; <a href='/AIV/54/2/7'>1 Tim. 2:7</a>",
      "comment": "Paul introduces himself as both servant and apostle, highlighting his authority and mission to guide the faithful towards godliness—a key theme throughout the pastoral letters. The connection to 'God’s chosen people' echoes themes from the Old Testament (see Deut. 7:6), but here explicitly centers Christ as fulfillment."
    },
    {
      "pk": 2007002,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 2,
      "text": "in hope of eternal life, which God, who cannot lie, promised before the ages began,",
      "links": "<a href='/AIV/54/6/12'>1 Tim. 6:12</a>; <a href='/AIV/56/3/7'>Titus 3:7</a>; <a href='/AIV/04/23/19'>Num. 23:19</a>",
      "comment": "Eternal life is a promise rooted in God’s unchanging nature and eternal plan, assuring Christians of salvation through Christ (see John 17:3). The phrase ‘cannot lie’ reinforces God’s absolute truthfulness, a foundation for trust and faith."
    },
    {
      "pk": 2007003,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 3,
      "text": "and at the proper time revealed his word through the preaching entrusted to me by the command of God our Savior.",
      "links": "<a href='/AIV/54/2/7'>1 Tim. 2:7</a>; <a href='/AIV/56/2/11'>Titus 2:11</a>",
      "comment": "God’s word is made known through preaching, pointing to the necessity of apostolic teaching and public proclamation. Note the emphasis on divine appointment and succession of authority, a subtle affirmation of structured leadership in the faith community."
    },
    {
      "pk": 2007004,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 4,
      "text": "To Titus, a true child in our common faith: Grace and peace from God the Father and Christ Jesus our Savior.",
      "links": "<a href='/AIV/54/1/2'>1 Tim. 1:2</a>; <a href='/AIV/55/1/2'>2 Tim. 1:2</a>",
      "comment": "Paul refers to Titus as his spiritual child—a model of mentoring and spiritual lineage within the Church. The dual greeting from ‘God the Father and Christ Jesus our Savior’ affirms Christ’s divinity and unity with the Father."
    },
    {
      "pk": 2007005,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 5,
      "text": "This is why I left you in Crete, so that you might set right what remained unfinished, and appoint elders in every city as I directed you—",
      "links": "<a href='/AIV/44/14/23'>Acts 14:23</a>; <a href='/AIV/54/3/1'>1 Tim. 3:1–7</a>",
      "comment": "Paul entrusts Titus with appointing elders, illustrating the importance of leadership and apostolic authority within the Church. It also shows the concept of succession—whereby authority to teach and guide is passed on, an enduring principle in Christian tradition (see Acts 1:20–26)."
    },
    {
      "pk": 2007006,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 6,
      "text": "if anyone is blameless, the husband of one wife, with children who believe and are not accused of wild living or disobedience.",
      "links": "<a href='/AIV/54/3/2'>1 Tim. 3:2</a>; <a href='/AIV/54/3/4'>1 Tim. 3:4</a>",
      "comment": "Qualifications for Church elders focus on moral integrity and faithful family life. The emphasis on a ‘husband of one wife’ and well-behaved children points to the need for order and fidelity both in church and home."
    },
    {
      "pk": 2007007,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 7,
      "text": "For an overseer, as God's steward, must be blameless—not arrogant, not quick-tempered, not given to drunkenness, not violent, not greedy for dishonest gain.",
      "links": "<a href='/AIV/54/3/3'>1 Tim. 3:3</a>",
      "comment": "‘Overseer’ indicates a position of pastoral authority, conveying responsibility to care for and guide the community. The list of virtues underscores the spiritual and practical standards leaders must embody."
    },
    {
      "pk": 2007008,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 8,
      "text": "Instead, he must be hospitable, a lover of good, self-controlled, upright, holy, and disciplined.",
      "links": "<a href='/AIV/54/3/2'>1 Tim. 3:2</a>; <a href='/AIV/60/4/9'>1 Pet. 4:9</a>",
      "comment": "Positive virtues are emphasized: hospitality, goodness, and holiness. The ideal overseer models both virtue and piety, reflecting Christ’s own example for all believers (see Matt. 5:48)."
    },
    {
      "pk": 2007009,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 9,
      "text": "He must hold firmly to the trustworthy word as taught, so that he may be able to instruct with sound teaching and also to correct those who contradict it.",
      "links": "<a href='/AIV/54/6/3'>1 Tim. 6:3</a>; <a href='/AIV/56/2/1'>Titus 2:1</a>",
      "comment": "Faithfulness to apostolic teaching is key, showing that Church leaders are not to innovate but preserve the truth handed down. The ‘word as taught’ suggests a living tradition and oral teaching alongside Scripture (see 2 Thess. 2:15)."
    },
    {
      "pk": 2007010,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 10,
      "text": "For there are many rebellious people, especially those of the circumcision, who are empty talkers and deceivers.",
      "links": "<a href='/AIV/54/1/6'>1 Tim. 1:6</a>; <a href='/AIV/55/3/8'>2 Tim. 3:8</a>",
      "comment": "Paul warns against false teachers who disturb the community. ‘Of the circumcision’ refers to those insisting on old covenant requirements over the new reality in Christ, a major controversy addressed also in Acts 15."
    },
    {
      "pk": 2007011,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 11,
      "text": "They must be silenced, since they are turning whole families away by teaching things they ought not to, for the sake of dishonest gain.",
      "links": "<a href='/AIV/54/4/7'>1 Tim. 4:7</a>; <a href='/AIV/60/5/2'>1 Pet. 5:2</a>",
      "comment": "Correction of false doctrine is a duty of spiritual leaders. ‘Turning families away’ shows the communal impact of error, setting the stage for the Church’s consistent call to guard the unity of faith."
    },
    {
      "pk": 2007012,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 12,
      "text": "One of their own prophets has said, ‘Cretans are always liars, evil beasts, lazy gluttons.’",
      "links": "<a href='/AIV/44/17/28'>Acts 17:28</a>",
      "comment": "Paul quotes Epimenides, highlighting stereotypes that Titus must be wary of. The broader lesson underscores the need for spiritual vigilance against cultural faults."
    },
    {
      "pk": 2007013,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 13,
      "text": "This testimony is true. Therefore, rebuke them sharply, so that they may be sound in the faith,",
      "links": "<a href='/AIV/54/5/20'>1 Tim. 5:20</a>; <a href='/AIV/56/2/15'>Titus 2:15</a>",
      "comment": "Strong correction is needed for the community’s good. The aim is not condemnation but restoration to sound faith, demonstrating the spiritual discipline and pastoral care required in Church leadership."
    },
    {
      "pk": 2007014,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 14,
      "text": "not paying attention to Jewish myths or to commandments of men who turn away from the truth.",
      "links": "<a href='/AIV/54/1/4'>1 Tim. 1:4</a>; <a href='/AIV/56/3/9'>Titus 3:9</a>",
      "comment": "Paul distinguishes apostolic teaching from mere human traditions and legends. The text contrasts divinely revealed truth with human inventions, emphasizing fidelity to the faith delivered by the apostles."
    },
    {
      "pk": 2007015,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 15,
      "text": "To the pure, all things are pure; but to those who are defiled and unbelieving, nothing is pure, but both their minds and their consciences are defiled.",
      "links": "<a href='/AIV/45/14/20'>Rom. 14:20</a>; <a href='/AIV/54/4/2'>1 Tim. 4:2</a>",
      "comment": "Paul uses a moral principle: inward purity determines how one sees the world. This passage underscores the spiritual transformation effected in believers, linking clean conscience to true faith—rooted in ongoing sanctification."
    },
    {
      "pk": 2007016,
      "translation": "AIV",
      "book": 56,
      "chapter": 1,
      "verse": 16,
      "text": "They claim to know God, but by their deeds they deny him, being detestable, disobedient, and unfit for any good work.",
      "links": "<a href='/AIV/40/7/21'>Matt. 7:21–23</a>; <a href='/AIV/54/1/19'>1 Tim. 1:19</a>",
      "comment": "True knowledge of God is revealed not just by confession but by righteous living. This echoes Jesus’ teaching that true disciples are known by their fruits (Matt. 7:16–20). Both faith and works are inseparable for genuine believers—a theme developed throughout the epistles."
    }
  ],
  "translatedAt": "2025-12-23T04:05:07.734Z"
}