{
  "book": "Titus",
  "bookAbbreviation": "Titus",
  "chapter": 3,
  "verses": [
    {
      "pk": 3203011,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 1,
      "text": "Remind them to submit to rulers and authorities, to obey, to be ready for every good work,",
      "links": "<a href='/AIV/45/13/1'>Rom 13:1</a>; <a href='/AIV/60/2/13'>1 Pet 2:13</a>",
      "comment": "Paul instructs believers to recognize rightful authority and cooperate with legitimate governance. This demonstrates respect for order, reflecting biblical teachings on honoring those in leadership."
    },
    {
      "pk": 3203012,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 2,
      "text": "To speak no evil of anyone, to avoid quarreling, to be gentle, showing perfect courtesy to all people.",
      "links": "<a href='/AIV/60/3/9'>1 Pet 3:9</a>; <a href='/AIV/40/5/44'>Matt 5:44</a>",
      "comment": "The call for gentleness and courtesy echoes Jesus’ teaching on loving enemies and blessing those who curse you. Paul emphasizes interpersonal relationships rooted in virtue and grace."
    },
    {
      "pk": 3203013,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 3,
      "text": "For we ourselves were once foolish, disobedient, led astray, serving various passions and pleasures, living in malice and envy, hated by others and hating one another.",
      "links": "<a href='/AIV/49/2/1-4'>Eph 2:1-4</a>",
      "comment": "Paul reminds believers of their former sinful condition, highlighting the universal need for salvation. The change from hatred to love recalls Old Testament promises of new hearts (Ezek. 36:26)."
    },
    {
      "pk": 3203014,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 4,
      "text": "But when the kindness and love of God our Savior appeared,",
      "links": "<a href='/AIV/43/1/14'>John 1:14</a>; <a href='/AIV/56/2/11'>Titus 2:11</a>",
      "comment": "The appearance of God’s love identifies Christ’s Incarnation as the concrete demonstration of divine mercy. This verse ties God’s saving initiative directly to Jesus’ coming."
    },
    {
      "pk": 3203015,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 5,
      "text": "He saved us, not because of works we had done in righteousness, but according to his mercy, through the washing of rebirth and renewal by the Holy Spirit,",
      "links": "<a href='/AIV/49/2/8-9'>Eph 2:8-9</a>; <a href='/AIV/44/2/38'>Acts 2:38</a>; <a href='/AIV/43/3/5'>John 3:5</a>",
      "comment": "Salvation is by God’s mercy, not human merit. The ‘washing of rebirth’ and renewal by the Spirit points to baptism and spiritual transformation. This harmonizes with John 3:5 and Acts 2:38, suggesting God uses physical means to impart grace."
    },
    {
      "pk": 3203016,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 6,
      "text": "whom he poured out on us abundantly through Jesus Christ our Savior,",
      "links": "<a href='/AIV/44/10/44-45'>Acts 10:44–45</a>; <a href='/AIV/45/5/5'>Rom 5:5</a>",
      "comment": "The Holy Spirit is given generously through Christ. This underscores Jesus’ unique role as the mediator of salvation and the means by which the Spirit is received."
    },
    {
      "pk": 3203017,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 7,
      "text": "so that, having been justified by his grace, we might become heirs according to the hope of eternal life.",
      "links": "<a href='/AIV/45/8/17'>Rom 8:17</a>; <a href='/AIV/48/4/7'>Gal 4:7</a>",
      "comment": "Believers are adopted as heirs through God’s grace, receiving the promise of eternal life. Salvation is a divine gift leading to familial status with God, fulfilling spiritual and covenantal promises."
    },
    {
      "pk": 3203018,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 8,
      "text": "This saying is trustworthy, and I want you to insist on these things, so that those who have believed in God may be careful to devote themselves to good works. These things are excellent and beneficial for people.",
      "links": "<a href='/AIV/59/2/17'>James 2:17</a>; <a href='/AIV/56/2/14'>Titus 2:14</a>",
      "comment": "Paul affirms the necessity of good works for believers—not as the basis for salvation, but as its outworking. Faith, expressed through charity, is emphasized here as evidence of genuine transformation."
    },
    {
      "pk": 3203019,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 9,
      "text": "But avoid foolish controversies, genealogies, dissensions, and quarrels about the law, for they are unprofitable and worthless.",
      "links": "<a href='/AIV/54/6/4'>1 Tim 6:4</a>; <a href='/AIV/56/1/14'>Titus 1:14</a>",
      "comment": "Paul warns against fruitless disputes that divide the community. The focus is placed on unity and peace rather than legalistic arguments. True doctrine fosters harmony, not discord."
    },
    {
      "pk": 3203020,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 10,
      "text": "As for someone who stirs up division, after warning him once and then a second time, have nothing more to do with him,",
      "links": "<a href='/AIV/40/18/15-17'>Matt 18:15-17</a>; <a href='/AIV/54/5/20'>1 Tim 5:20</a>",
      "comment": "Paul instructs the same pattern as Jesus taught for community discipline—warnings followed by separation if unheeded (see Matthew 18). Maintaining the integrity of the Church is essential."
    },
    {
      "pk": 3203021,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 11,
      "text": "knowing that such a person is warped and sinful; he is self-condemned.",
      "links": "<a href='/AIV/54/1/19-20'>1 Tim 1:19-20</a>; <a href='/AIV/60/2/15'>1 Pet 2:15</a>",
      "comment": "Persistent division leads to spiritual harm and self-exclusion from the faith community. Separation here is medicinal, meant for repentance and restoration, echoing apostolic discipline."
    },
    {
      "pk": 3203022,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 12,
      "text": "When I send Artemas or Tychicus to you, make every effort to come to me at Nicopolis, for I have decided to spend the winter there.",
      "links": "<a href='/AIV/44/20/4'>Acts 20:4</a>; <a href='/AIV/55/4/12'>2 Tim 4:12</a>",
      "comment": "Paul’s mention of helpers and his travel plans reflects the real-life connections and apostolic authority in guiding local congregations. The network of leadership reveals the importance of visible, unified governance."
    },
    {
      "pk": 3203023,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 13,
      "text": "Do your best to speed Zenas the lawyer and Apollos on their way; see that they lack nothing.",
      "links": "<a href='/AIV/44/18/24'>Acts 18:24</a>; <a href='/AIV/45/12/13'>Rom 12:13</a>",
      "comment": "Supporting traveling servants of the Word is actively encouraged. Early Christians met tangible needs, displaying a familial love and shared responsibility—hallmarks of the body of Christ."
    },
    {
      "pk": 3203024,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 14,
      "text": "Our people must learn to devote themselves to good works, meeting urgent needs, so that they may not be unfruitful.",
      "links": "<a href='/AIV/59/1/27'>James 1:27</a>; <a href='/AIV/56/2/7'>Titus 2:7</a>",
      "comment": "The Christian life is meant to bear fruit through acts of mercy. There is an implicit connection between faith and loving action, fleshing out belief through visible service, resonating with apostolic tradition."
    },
    {
      "pk": 3203025,
      "translation": "AIV",
      "book": 56,
      "chapter": 3,
      "verse": 15,
      "text": "All who are with me send greetings to you. Greet those who love us in the faith. Grace be with you all.",
      "links": "<a href='/AIV/49/6/24'>Eph 6:24</a>; <a href='/AIV/54/6/21'>1 Tim 6:21</a>",
      "comment": "Paul closes with a communal blessing, emphasizing unity, shared love in the faith, and the grace that sustains the believers. These marks of fellowship hint at visible unity and sacramental life among the body of Christ."
    }
  ],
  "translatedAt": "2025-12-23T04:05:47.560Z"
}