{
  "book": 53,
  "bookName": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 5,
  "verses": [
    {
      "pk": 53005001,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 1,
      "text": "It is widely reported that among you there is sexual immorality, and a kind that is not even found among the Gentiles—a man has his father’s wife.",
      "links": "<a href='/AIV/3/18/8'>Lev. 18:8</a>; <a href='/AIV/46/5/9-10'>1Cor. 5:9-10</a>",
      "comment": "Paul confronts an especially scandalous situation of immorality within the Corinthian church, highlighting that even pagan societies shun such acts. This demonstrates the need for strong communal discipline and highlights the authority of the Church to govern moral affairs among believers."
    },
    {
      "pk": 53005002,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 2,
      "text": "And you are proud! Should you not rather have mourned, so that he who has done this might be removed from among you?",
      "links": "<a href='/AIV/40/5/4'>Matt. 5:4</a>; <a href='/AIV/16/13/17'>Neh. 13:17</a>",
      "comment": "Instead of grieving over the sin, some Corinthians seem arrogant or tolerant about it. Genuine sorrow over sin is a mark of a spiritually healthy community. It also points to the necessity of excommunication as a corrective discipline, illustrating the seriousness of unrepentant grave sin."
    },
    {
      "pk": 53005003,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 3,
      "text": "For though I am absent in body, I am present in spirit; and as if present, I have already passed judgment on the one who did this.",
      "links": "<a href='/AIV/51/2/5'>Col. 2:5</a>; <a href='/AIV/40/18/18'>Matt. 18:18</a>",
      "comment": "Paul asserts apostolic authority to judge spiritual matters even from afar. This demonstrates the guiding role of apostolic leadership in maintaining church discipline and order, and underscores the necessity of a visible authority to safeguard doctrine and morals."
    },
    {
      "pk": 53005004,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 4,
      "text": "When you are assembled in the name of our Lord Jesus, and my spirit is with you, with the power of our Lord Jesus—",
      "links": "<a href='/AIV/40/18/20'>Matt. 18:20</a>; <a href='/AIV/44/2/42'>Acts 2:42</a>",
      "comment": "Paul insists that the judgment is to be executed when the community gathers. The invocation of Jesus' name and apostolic authority stresses the spiritual legitimacy and efficacious nature of decisions made by the Church in an official, prayerful assembly."
    },
    {
      "pk": 53005005,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 5,
      "text": "You are to hand this man over to Satan for the destruction of the flesh, so that his spirit may be saved in the day of the Lord.",
      "links": "<a href='/AIV/54/1/20'>1Tim. 1:20</a>; <a href='/AIV/47/2/6'>2Cor. 2:6</a>",
      "comment": "Excommunication is intended not as final condemnation but as a medicinal penalty, for the man's ultimate salvation. This reveals the concept of corrective discipline with the hope of repentance and restoration, echoing the Church’s temporal authority over spiritual matters."
    },
    {
      "pk": 53005006,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 6,
      "text": "Your boasting is not good. Do you not know that a little yeast leavens the whole batch of dough?",
      "links": "<a href='/AIV/40/16/6-12'>Matt. 16:6-12</a>; <a href='/AIV/2/12/15-20'>Ex. 12:15-20</a>",
      "comment": "Paul uses the metaphor of leaven to illustrate how tolerating sin corrupts the entire community. This image ties back to the Passover tradition, inviting reflection on spiritual purity and the necessity of removing evil from among the faithful."
    },
    {
      "pk": 53005007,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 7,
      "text": "Clean out the old yeast, so that you may be a new batch, as you really are unleavened. For Christ, our Passover lamb, has been sacrificed.",
      "links": "<a href='/AIV/2/12/5-11'>Ex. 12:5-11</a>; <a href='/AIV/43/1/29'>John 1:29</a>",
      "comment": "Drawing direct parallel between Christ and the Passover lamb underscores Christ's fulfillment of Old Testament typology. Believers are called to live in spiritual purity. The sacrificial language helps believers see the Eucharistic and redemptive dimensions to Christ’s death."
    },
    {
      "pk": 53005008,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 8,
      "text": "Therefore, let us keep the festival, not with the old yeast—the yeast of malice and wickedness—but with unleavened bread of sincerity and truth.",
      "links": "<a href='/AIV/2/12/17'>Ex. 12:17</a>; <a href='/AIV/47/1/12'>2Cor. 1:12</a>",
      "comment": "Paul spiritualizes the Passover feast as an ongoing celebration in the Christian life, emphasizing interior holiness. Ancient Christian practice interpreted such feasts sacramentally, linking purity and the communal celebration of Christ’s victory."
    },
    {
      "pk": 53005009,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 9,
      "text": "I wrote to you in my letter not to associate with sexually immoral people—",
      "links": "<a href='/AIV/53/6/18'>1Cor. 6:18</a>; <a href='/AIV/53/15/33'>1Cor. 15:33</a>",
      "comment": "Paul refers to an earlier letter, underscoring consistent apostolic instruction regarding moral separation. The Church’s purity relies both on individual morality and communal vigilance—an enduring principle guiding Christian fellowship."
    },
    {
      "pk": 53005010,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 10,
      "text": "Not at all meaning the sexually immoral of this world, or the greedy and swindlers, or idolaters—otherwise you would have to leave the world.",
      "links": "<a href='/AIV/43/17/15'>John 17:15</a>; <a href='/AIV/19/1/1'>Ps. 1:1</a>",
      "comment": "Paul points out the distinction between the Church and the outside world. Christians must interact with nonbelievers while maintaining integrity. Separation here is not avoidance of all sinners, but discipline of unrepentant sin within the community."
    },
    {
      "pk": 53005011,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 11,
      "text": "But now I am writing to you not to associate with anyone who claims to be a brother or sister and is sexually immoral or greedy, an idolater, reviler, drunkard, or swindler. Do not even eat with such a person.",
      "links": "<a href='/AIV/40/18/17'>Matt. 18:17</a>; <a href='/AIV/61/2/20-21'>2Pet. 2:20-21</a>",
      "comment": "Paul commands exclusion of persistently sinful 'believers' to safeguard the Church’s holiness. The restriction on eating points to communal and sacramental fellowship and implies real consequences for those persisting in grave sin within the body."
    },
    {
      "pk": 53005012,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 12,
      "text": "For what have I to do with judging outsiders? Is it not those who are inside that you are to judge?",
      "links": "<a href='/AIV/40/7/1'>Matt. 7:1</a>; <a href='/AIV/16/13/23-27'>Neh. 13:23-27</a>",
      "comment": "Paul makes clear that the Church’s discipline is for its own members, not the world. This passage teaches an approach to spiritual judgment, entrusted to leaders for the sake of internal holiness—an authoritative governance over believers."
    },
    {
      "pk": 53005013,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 5,
      "verse": 13,
      "text": "God will judge those outside. 'Expel the wicked person from among you.'",
      "links": "<a href='/AIV/5/13/5'>Deut. 13:5</a>; <a href='/AIV/19/1/6'>Ps. 1:6</a>",
      "comment": "Paul quotes the Old Testament (Deut. 13:5) to stress the Church’s responsibility to remove evil from its midst. The repeated theme of communal purity, based on authoritative decisions, anticipates how the visible Church guards doctrine and discipline for the salvation of souls."
    }
  ],
  "translatedAt": "2025-12-24T11:45:53.375Z"
}