{
  "book": 53,
  "bookName": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 7,
  "verses": [
    {
      "pk": 53007001,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 1,
      "text": "Now concerning the matters you wrote about: It is good for a man not to touch a woman.",
      "links": "<a href='/AIV/46/7/8-9'>1Cor 7:8-9</a>",
      "comment": "Paul begins to address their questions about marriage and singleness. The phrase 'not to touch a woman' is a Jewish idiom for sexual relations. Note that Paul is not commanding celibacy but acknowledging its goodness, anticipating his following contextual instructions."
    },
    {
      "pk": 53007002,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 2,
      "text": "But because of sexual immorality, each man should have his own wife, and each woman her own husband.",
      "links": "<a href='/AIV/40/19/4-6'>Matt 19:4-6</a>; <a href='/AIV/1/2/24'>Gen 2:24</a>",
      "comment": "Paul balances the good of abstinence with the practical need for marriage to avoid immorality. Marriage is presented as honorable, reflecting God's design in Genesis. The teaching supports the exclusive, faithful bond between a husband and wife."
    },
    {
      "pk": 53007003,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 3,
      "text": "The husband should give to his wife her conjugal rights, and likewise the wife to her husband.",
      "links": "<a href='/AIV/49/5/25-28'>Eph 5:25-28</a>",
      "comment": "Mutual giving is emphasized, showing equality in marital responsibilities. Paul frames marriage as a partnership of love and duty, echoing the self-giving love Christ has for the Church (cf. Eph 5)."
    },
    {
      "pk": 53007004,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 4,
      "text": "The wife does not have authority over her own body, but the husband does. Likewise, the husband does not have authority over his own body, but the wife does.",
      "links": "<a href='/AIV/49/5/21'>Eph 5:21</a>",
      "comment": "This mutuality is radical for ancient times. Each gives themselves as a gift; marriage is not one-sided, but reciprocal. This foreshadows Christian understanding of self-donation and unity."
    },
    {
      "pk": 53007005,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 5,
      "text": "Do not deprive one another, except perhaps by agreement for a time, so that you may devote yourselves to prayer. Then come together again, so that Satan may not tempt you because of your lack of self-control.",
      "links": "<a href='/AIV/40/6/13'>Matt 6:13</a>; <a href='/AIV/41/14/38'>Mark 14:38</a>",
      "comment": "Temporary marital abstinence for prayer is allowed by mutual agreement. Marriage and prayer are not opposed but can work together, as in times of solemn devotion. Paul warns against extended separation lest it open a door to temptation."
    },
    {
      "pk": 53007006,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 6,
      "text": "But this I say as a concession, not as a command.",
      "links": "<a href='/AIV/50/4/5'>Phil 4:5</a>",
      "comment": "Paul is clear—abstinence for prayer is allowed, not required. The underlying principle is charity and good order rather than a universal rule."
    },
    {
      "pk": 53007007,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 7,
      "text": "I wish that all were as I myself am. But each has his own gift from God, one of one kind and one of another.",
      "links": "<a href='/AIV/40/19/11-12'>Matt 19:11-12</a>",
      "comment": "Paul refers to his celibate state as a gift (charism), not as superior but as one of many gifts from God. God calls each according to his purpose, highlighting the diversity in Christian vocations."
    },
    {
      "pk": 53007008,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 8,
      "text": "To the unmarried and the widows I say that it is good for them to remain as I am.",
      "links": "<a href='/AIV/42/2/37'>Luke 2:37</a>",
      "comment": "Continuing the theme, Paul advises singleness as good, especially for those able to live it, reflecting Christ’s example and the prophetic life of figures like Anna (Luke 2)."
    },
    {
      "pk": 53007009,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 9,
      "text": "But if they cannot exercise self-control, they should marry; for it is better to marry than to burn with passion.",
      "links": "<a href='/AIV/58/13/4'>Heb 13:4</a>",
      "comment": "Marriage is a holy remedy for Incarnate weaknesses. Rather than causing guilt, marriage is presented as sanctifying when approached rightly."
    },
    {
      "pk": 53007010,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 10,
      "text": "To the married I give this command—not I but the Lord—that the wife should not separate from her husband.",
      "links": "<a href='/AIV/40/19/6'>Matt 19:6</a>; <a href='/AIV/41/10/9'>Mark 10:9</a>",
      "comment": "Paul appeals directly to the Lord’s teaching on the permanence of marriage, as in Matt 19 and Mark 10, where Jesus upholds the inseparability of husband and wife."
    },
    {
      "pk": 53007011,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 11,
      "text": "But if she does separate, she should remain unmarried or else be reconciled to her husband—and the husband should not divorce his wife.",
      "links": "<a href='/AIV/40/5/32'>Matt 5:32</a>",
      "comment": "Paul upholds the Lord’s words: after separation, reconciliation is encouraged over remarriage. It affirms the sacred bond of marriage and echoes Jesus’ teaching on divorce."
    },
    {
      "pk": 53007012,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 12,
      "text": "To the rest I say—I, not the Lord—that if any brother has a wife who is not a believer, and she consents to live with him, he should not divorce her.",
      "links": "<a href='/AIV/60/3/1'>1 Pet 3:1</a>",
      "comment": "Here Paul offers inspired guidance on mixed marriages not directly addressed by Jesus. Peace and unity within marriage are still priorities, even when faith differs."
    },
    {
      "pk": 53007013,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 13,
      "text": "If any woman has a husband who is not a believer, and he consents to live with her, she should not divorce him.",
      "links": "<a href='/AIV/45/15/7'>Rom 15:7</a>",
      "comment": "The principle of remaining together applies both to men and women. Paul promotes marital stability and the sanctifying influence of the believing spouse."
    },
    {
      "pk": 53007014,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 14,
      "text": "For the unbelieving husband is made holy because of his wife, and the unbelieving wife is made holy because of her husband. Otherwise your children would be unclean, but as it is, they are holy.",
      "links": "<a href='/AIV/44/16/31'>Acts 16:31</a>",
      "comment": "The faith of one spouse has a sanctifying effect—pointing to the mysterious power of grace and the household’s participation in Christian blessing (cf. household baptisms in Acts). Children are brought into a state of holiness."
    },
    {
      "pk": 53007015,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 15,
      "text": "But if the unbeliever departs, let it be so. In such cases the brother or sister is not bound. God has called you to peace.",
      "links": "<a href='/AIV/45/12/18'>Rom 12:18</a>",
      "comment": "When an unbelieving partner leaves, the believer is not enslaved to the marriage bond. Paul sets a path for peace and freedom from unnecessary conflict, emphasizing the importance of harmony in Christian life."
    },
    {
      "pk": 53007016,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 16,
      "text": "For how do you know, wife, whether you will save your husband? Or how do you know, husband, whether you will save your wife?",
      "links": "<a href='/AIV/60/3/1-2'>1 Pet 3:1-2</a>",
      "comment": "Paul encourages hope for the potential conversion of the spouse but acknowledges uncertainty, urging patience, intercession, and the influence of Christian witness."
    },
    {
      "pk": 53007017,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 17,
      "text": "Only let each one lead the life that the Lord has assigned to him, and to which God has called him. This is my rule in all the churches.",
      "links": "<a href='/AIV/49/4/1'>Eph 4:1</a>",
      "comment": "Paul highlights vocational calling. Contentment and obedience within one’s station are stressed—unity in diversity, foundational for the apostolic tradition."
    },
    {
      "pk": 53007018,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 18,
      "text": "Was anyone at the time of his call already circumcised? Let him not seek to remove the marks of circumcision. Was anyone at the time of his call uncircumcised? Let him not seek circumcision.",
      "links": "<a href='/AIV/44/15/1-2'>Acts 15:1-2</a>",
      "comment": "Physical conditions (Jewish or Gentile) are secondary—the inward call is foremost. Paul upholds freedom from ritual obligations as saving faith is now open to all, Jew or Gentile."
    },
    {
      "pk": 53007019,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 19,
      "text": "Circumcision is nothing, and uncircumcision is nothing, but keeping the commandments of God is what counts.",
      "links": "<a href='/AIV/48/5/6'>Gal 5:6</a>; <a href='/AIV/45/2/25-29'>Rom 2:25-29</a>",
      "comment": "External signs give way to inner obedience. Faith expressed in love fulfills the law (see Gal 5:6; Rom 2)."
    },
    {
      "pk": 53007020,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 20,
      "text": "Each one should remain in the condition in which he was called.",
      "links": "<a href='/AIV/54/6/6'>1 Tim 6:6</a>",
      "comment": "Social status is not a bar to grace. Contentment in one’s vocation is a theme in later apostolic instruction as well."
    },
    {
      "pk": 53007021,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 21,
      "text": "Were you a slave when called? Do not be concerned about it. But if you can gain your freedom, avail yourself of the opportunity.",
      "links": "<a href='/AIV/57/16'>Phlm 16</a>",
      "comment": "Paul acknowledges social realities without prescribing revolution yet values human dignity—echoes of treating all in Christ as brethren (cf. Philemon)."
    },
    {
      "pk": 53007022,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 22,
      "text": "For the one who was a slave when called to the Lord is a freedman of the Lord. Likewise, the one who was free when called is a slave of Christ.",
      "links": "<a href='/AIV/55/2/9'>2 Tim 2:9</a>; <a href='/AIV/45/6/22'>Rom 6:22</a>",
      "comment": "Paul reverses social hierarchies: union with Christ is the true freedom, and service to Christ is the only true servanthood."
    },
    {
      "pk": 53007023,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 23,
      "text": "You were bought with a price; do not become slaves of men.",
      "links": "<a href='/AIV/46/6/20'>1Cor 6:20</a>; <a href='/AIV/60/1/18-19'>1 Pet 1:18-19</a>",
      "comment": "Christ’s redemptive sacrifice sets the believer free from all forms of human bondage. Paul alludes to the precious redemption (cf. 1 Pet 1:18-19)."
    },
    {
      "pk": 53007024,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 24,
      "text": "Brothers, in whatever condition each was called, there let him remain with God.",
      "links": "<a href='/AIV/50/4/11-12'>Phil 4:11-12</a>",
      "comment": "Sanctity is possible in any condition of life. Remaining with God in the present state is sufficient for holiness."
    },
    {
      "pk": 53007025,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 25,
      "text": "Now concerning virgins, I have no command from the Lord, but I give my opinion as one who by the Lord’s mercy is trustworthy.",
      "links": "<a href='/AIV/47/11/17'>2Cor 11:17</a>",
      "comment": "Paul distinguishes this advice from a direct command, yet his apostolic wisdom is still authoritative for practical guidance."
    },
    {
      "pk": 53007026,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 26,
      "text": "Because of the present distress, I think it good for a person to remain as he is.",
      "links": "<a href='/AIV/13/12/32'>1 Chr 12:32</a>",
      "comment": "‘The present distress’ may refer to persecution or trials facing the church. Prudence in these circumstances preserves the faith community, similar to the Old Testament’s calls for discernment in troubled times."
    },
    {
      "pk": 53007027,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 27,
      "text": "Are you bound to a wife? Do not seek to be free. Are you free from a wife? Do not seek a wife.",
      "links": "<a href='/AIV/40/19/12'>Matt 19:12</a>",
      "comment": "Paul commends contentment and fidelity within one’s current state—in or out of marriage—especially given the challenging circumstances."
    },
    {
      "pk": 53007028,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 28,
      "text": "But if you do marry, you have not sinned, and if a virgin marries, she has not sinned. Yet those who marry will have worldly troubles, and I wish to spare you that.",
      "links": "<a href='/AIV/40/24/19'>Matt 24:19</a>",
      "comment": "Paul upholds the sanctity of marriage, while recognizing that added responsibilities can bring challenges, especially in times of tribulation. This is part of the Christian realism encouraged throughout the New Testament."
    },
    {
      "pk": 53007029,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 29,
      "text": "This is what I mean, brothers: the appointed time has grown very short. From now on, let those who have wives live as though they had none,",
      "links": "<a href='/AIV/45/13/11-12'>Rom 13:11-12</a>",
      "comment": "Paul points to the urgency of the era—living in the light of eternity. All Christians are to have an undivided devotion to the Lord, whatever their earthly status."
    },
    {
      "pk": 53007030,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 30,
      "text": "and those who mourn as though they were not mourning, and those who rejoice as though they were not rejoicing, and those who buy as though they had no goods,",
      "links": "<a href='/AIV/42/6/21-22'>Luke 6:21-22</a>",
      "comment": "Earthly sorrows and joys are passing. Christians are called to keep their eyes on the eternal, living as sojourners (cf. Beatitudes)."
    },
    {
      "pk": 53007031,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 31,
      "text": "and those who deal with the world as though they had no dealings with it. For the form of this world is passing away.",
      "links": "<a href='/AIV/62/2/17'>1 Jn 2:17</a>",
      "comment": "Paul invites detachment from worldly concerns, echoing Christ’s teaching that believers are ‘in the world, but not of it.’"
    },
    {
      "pk": 53007032,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 32,
      "text": "I want you to be free from anxieties. The unmarried man is anxious about the things of the Lord, how to please the Lord.",
      "links": "<a href='/AIV/40/6/25-34'>Matt 6:25-34</a>",
      "comment": "Paul describes the blessings of undivided devotion for those called to the consecrated single life, aligning with Jesus’ call to seek first God’s kingdom."
    },
    {
      "pk": 53007033,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 33,
      "text": "But the married man is anxious about worldly things, how to please his wife,",
      "links": "<a href='/AIV/49/5/28-29'>Eph 5:28-29</a>",
      "comment": "The duties of marriage are worthy and good, but they involve necessary cares; the apostle contrasts devotion in marriage with the special freedom for service of God outside of it."
    },
    {
      "pk": 53007034,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 34,
      "text": "and his interests are divided. And the unmarried woman or virgin is anxious about the things of the Lord, how to be holy in body and spirit. But the married woman is anxious about worldly things, how to please her husband.",
      "links": "<a href='/AIV/42/2/36-37'>Luke 2:36-37</a>",
      "comment": "The single vocation allows for focused holiness, with some drawing a spiritual parallel to Christ’s own undivided focus. The dignity of both marriage and singleness is upheld."
    },
    {
      "pk": 53007035,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 35,
      "text": "I say this for your own benefit, not to lay any restraint upon you, but to promote good order and undivided devotion to the Lord.",
      "links": "<a href='/AIV/58/13/5'>Heb 13:5</a>",
      "comment": "Paul is not commanding, but encouraging the state of life most conducive to holiness and the worship of God."
    },
    {
      "pk": 53007036,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 36,
      "text": "If anyone thinks that he is not behaving properly toward his betrothed, if her passions are strong, and it must be so, let him do as he wishes: let them marry—it is no sin.",
      "links": "<a href='/AIV/40/5/32'>Matt 5:32</a>",
      "comment": "Practicality and conscience guide decisions about marriage. The goodness of marriage is reaffirmed, with no shame for those who choose it."
    },
    {
      "pk": 53007037,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 37,
      "text": "But whoever is firmly established in his heart, being under no necessity but has control over his own desire and has determined this in his heart, to keep her as his betrothed, he will do well.",
      "links": "<a href='/AIV/40/19/12'>Matt 19:12</a>",
      "comment": "Voluntary, chaste singleness is commendable for those called to it, echoing similar teaching from Jesus in Matthew 19 about the 'eunuchs for the sake of the kingdom.'"
    },
    {
      "pk": 53007038,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 38,
      "text": "So then he who marries his betrothed does well, and he who refrains from marriage will do even better.",
      "links": "<a href='/AIV/40/19/12'>Matt 19:12</a>",
      "comment": "Both marriage and consecrated singleness are good, but the single life, freely chosen for the Lord, is called the 'better part' here—for those specially gifted to live it."
    },
    {
      "pk": 53007039,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 39,
      "text": "A wife is bound to her husband as long as he lives. But if her husband dies, she is free to marry whomever she wishes, only in the Lord.",
      "links": "<a href='/AIV/45/7/2-3'>Rom 7:2-3</a>",
      "comment": "Marriage is lifelong, and remarriage after death is honorable so long as it is within the Christian faith. Marital faithfulness until death echoes the covenant fidelity God models with his people."
    },
    {
      "pk": 53007040,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 7,
      "verse": 40,
      "text": "Yet in my judgment she is happier if she remains as she is. And I believe that I too have the Spirit of God.",
      "links": "<a href='/AIV/54/5/14'>1 Tim 5:14</a>",
      "comment": "Paul gently reiterates the advantage of the dedicated single life, trusting the Spirit's guidance in such practical counsel. He models discernment, humility, and reliance on God’s Spirit for vocational decisions."
    }
  ],
  "translatedAt": "2025-12-24T11:47:00.949Z"
}