{
  "book": 53,
  "bookName": "1 Corinthians",
  "bookAbbreviation": "1Cor",
  "chapter": 12,
  "verses": [
    {
      "pk": 53012001,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 1,
      "text": "Now concerning spiritual gifts, brothers, I do not want you to be ignorant.",
      "links": "<a href='/AIV/45/1/11'>Rom. 1:11</a>; <a href='/AIV/54/4/14'>1 Tim. 4:14</a>",
      "comment": "Paul is addressing the topic of spiritual gifts, making it clear he desires the church to be well-informed. The term 'spiritual gifts' ('pneumatikōn' in Greek) refers to things of the Spirit given for the benefit of the assembly. Knowledge, not ignorance, is crucial to unity and effective ministry."
    },
    {
      "pk": 53012002,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 2,
      "text": "You know that when you were pagans, you were led astray to mute idols, however you were led.",
      "links": "<a href='/AIV/19/115/4-7'>Ps. 115:4-7</a>; <a href='/AIV/44/14/15'>Acts 14:15</a>",
      "comment": "Paul reminds them of their former state, highlighting their past worship of speechless idols. This contrasts with the living and active Spirit now present among them. The Christian life is not just a human philosophy but a life empowered and directed by God."
    },
    {
      "pk": 53012003,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 3,
      "text": "Therefore I make known to you that no one speaking by the Spirit of God says, 'Jesus is accursed,' and no one can say, 'Jesus is Lord,' except by the Holy Spirit.",
      "links": "<a href='/AIV/40/16/16-17'>Matt. 16:16-17</a>; <a href='/AIV/46/12/9'>1 Cor. 12:9</a>",
      "comment": "Paul sets a clear mark of true spiritual inspiration: confession of Jesus as Lord. Early Christians recognized this as an acknowledgment of Christ's divinity (compare Philippians 2:11). Authenticity of faith must involve the Spirit's work, who confesses the true lordship and deity of Jesus."
    },
    {
      "pk": 53012004,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 4,
      "text": "Now there are different gifts, but the same Spirit.",
      "links": "<a href='/AIV/45/12/6'>Rom. 12:6</a>",
      "comment": "Though the gifts are diverse, their source is one Spirit. This unity-in-diversity is foundational to Christian community, reflecting God's design for cooperation within the one body."
    },
    {
      "pk": 53012005,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 5,
      "text": "And there are different ministries, but the same Lord.",
      "links": "<a href='/AIV/49/4/5'>Eph. 4:5</a>",
      "comment": "Paul refers to varied ways of serving ('ministries'), but all under the authority of Christ the Lord. Service in the community takes many forms but shares this common headship."
    },
    {
      "pk": 53012006,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 6,
      "text": "And there are different kinds of workings, but it is the same God who works all things in all.",
      "links": "<a href='/AIV/50/2/13'>Phil. 2:13</a>; <a href='/AIV/49/1/23'>Eph. 1:23</a>",
      "comment": "‘Workings’ points to the ways God energizes or acts through believers. This trinitarian pattern (Spirit, Lord, God) shows different persons of the divine work together for the building up of the community."
    },
    {
      "pk": 53012007,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 7,
      "text": "But to each one is given the manifestation of the Spirit for the common good.",
      "links": "<a href='/AIV/49/4/12'>Eph. 4:12</a>",
      "comment": "The gifts of the Spirit are not just for personal display but for the benefit and growth of the whole community. Here Paul roots spiritual gifts within the communal, liturgical life of the believers."
    },
    {
      "pk": 53012008,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 8,
      "text": "For to one is given through the Spirit a word of wisdom, and to another a word of knowledge according to the same Spirit;",
      "links": "<a href='/AIV/49/1/17'>Eph. 1:17</a>; <a href='/AIV/18/28/28'>Job 28:28</a>",
      "comment": "‘Word of wisdom’ and ‘word of knowledge’ likely refer to inspired insight and understanding for the good of the Church. Operating through different people, these gifts reveal God's wisdom in practical and doctrinal matters."
    },
    {
      "pk": 53012009,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 9,
      "text": "to another faith by the same Spirit, to another gifts of healing by the one Spirit,",
      "links": "<a href='/AIV/40/17/20'>Matt. 17:20</a>; <a href='/AIV/59/5/14-15'>Jas. 5:14-15</a>",
      "comment": "Some receive a supernatural gift of faith, beyond ordinary saving faith. ‘Gifts of healing’ point to miraculous acts for the restoration of health, carrying echoes of Jesus’ healing ministry."
    },
    {
      "pk": 53012010,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 10,
      "text": "to another the working of miracles, to another prophecy, to another distinguishing of spirits, to another various kinds of tongues, to another the interpretation of tongues.",
      "links": "<a href='/AIV/44/2/4'>Acts 2:4</a>; <a href='/AIV/52/5/20-21'>1 Thess. 5:20-21</a>",
      "comment": "Here Paul lists more charisms: miracles, prophecy, discernment, tongues, and interpretation. These gifts highlight both the supernatural work of God and the importance of order and understanding within worship."
    },
    {
      "pk": 53012011,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 11,
      "text": "But one and the same Spirit works all these things, distributing to each one individually as He wills.",
      "links": "<a href='/AIV/58/2/4'>Heb. 2:4</a>",
      "comment": "The Spirit sovereignly apportions gifts. Spiritual gifts are not acquired by human effort but given by divine decision, emphasizing humility and trust in God’s plan."
    },
    {
      "pk": 53012012,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 12,
      "text": "For just as the body is one and has many members, and all the members of the body, though they are many, are one body, so also is Christ.",
      "links": "<a href='/AIV/45/12/4-5'>Rom. 12:4-5</a>; <a href='/AIV/51/1/18'>Col. 1:18</a>",
      "comment": "Paul uses the human body as a metaphor for Christ’s community. Individual believers are united into one mystical body through Christ, each retaining distinct roles."
    },
    {
      "pk": 53012013,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 13,
      "text": "For by one Spirit we were all baptized into one body—whether Jews or Greeks, whether slaves or free—and all were made to drink of one Spirit.",
      "links": "<a href='/AIV/48/3/27-28'>Gal. 3:27-28</a>; <a href='/AIV/43/7/37-39'>John 7:37-39</a>",
      "comment": "Baptism and the Spirit unite all believers in Christ, overcoming every social or ethnic barrier. Participation in sacramental life brings a real communion that transcends divisions."
    },
    {
      "pk": 53012014,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 14,
      "text": "For the body is not one member, but many.",
      "links": "<a href='/AIV/45/12/5'>Rom. 12:5</a>",
      "comment": "Paul highlights the necessity of diversity within unity. Each member is essential; no one exists in isolation within the Church."
    },
    {
      "pk": 53012015,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 15,
      "text": "If the foot should say, 'Because I am not a hand, I do not belong to the body,' that would not make it any less a part of the body.",
      "links": "",
      "comment": "The body metaphor continues to stress that different roles and gifts do not make anyone less a part of the Church."
    },
    {
      "pk": 53012016,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 16,
      "text": "And if the ear should say, 'Because I am not an eye, I do not belong to the body,' it does not for that reason cease to be part of the body.",
      "links": "",
      "comment": "Paul addresses potential feelings of inferiority, teaching that all roles are necessary and valuable in the Church."
    },
    {
      "pk": 53012017,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 17,
      "text": "If the whole body were an eye, where would the hearing be? If the whole were hearing, where would the sense of smell be?",
      "links": "",
      "comment": "Unity does not mean uniformity. Each member’s uniqueness is necessary for the health and function of the body of Christ."
    },
    {
      "pk": 53012018,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 18,
      "text": "But now God has arranged the members, each one of them in the body, just as He desired.",
      "links": "<a href='/AIV/19/139/13-16'>Ps. 139:13-16</a>",
      "comment": "Each person’s place in the Church is God’s intention. There is divine purpose and design in the structure and hierarchy of the body."
    },
    {
      "pk": 53012019,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 19,
      "text": "And if they were all one member, where would the body be?",
      "links": "",
      "comment": "Diversity is vital. Unity is not achieved by sameness, but by different members acting together as one."
    },
    {
      "pk": 53012020,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 20,
      "text": "But now there are many members, but one body.",
      "links": "",
      "comment": "Reiteration that the Church, though composed of many individuals, is ultimately one body in a spiritual and mysterious sense."
    },
    {
      "pk": 53012021,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 21,
      "text": "And the eye cannot say to the hand, 'I have no need of you,' nor again the head to the feet, 'I have no need of you.'",
      "links": "",
      "comment": "No member can discard another. Real interdependence defines the body of Christ, reminding us of the need for mutual support."
    },
    {
      "pk": 53012022,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 22,
      "text": "On the contrary, those members of the body which seem to be weaker are more necessary.",
      "links": "<a href='/AIV/40/25/40'>Matt. 25:40</a>",
      "comment": "Those who appear less significant are especially vital. This upholds the dignity and importance of every role in the Church, especially the humble and hidden ones."
    },
    {
      "pk": 53012023,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 23,
      "text": "And those parts of the body which we think less honorable, we treat with greater honor, and our unpresentable parts have greater modesty,",
      "links": "",
      "comment": "Paul encourages compassion and special care for the vulnerable in the community. The body metaphor also foreshadows the physical, sacramental dimension of Christian worship."
    },
    {
      "pk": 53012024,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 24,
      "text": "whereas our presentable parts have no such need. But God has so composed the body, giving more abundant honor to that part which lacked,",
      "links": "",
      "comment": "God’s design elevates the humble and brings balance and dignity to all. The Church is to reflect God's justice and charity in how it honors every member."
    },
    {
      "pk": 53012025,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 25,
      "text": "so that there may be no division in the body, but that the members may have the same care for one another.",
      "links": "<a href='/AIV/46/1/10'>1 Cor. 1:10</a>",
      "comment": "The goal is deep unity, avoiding division and fostering mutual care. This mirrors Christ’s own prayer for his followers to be perfectly one (John 17:21)."
    },
    {
      "pk": 53012026,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 26,
      "text": "And if one member suffers, all the members suffer with it; if one member is honored, all the members rejoice with it.",
      "links": "<a href='/AIV/45/12/15'>Rom. 12:15</a>",
      "comment": "Genuine spiritual unity means sharing in one another’s joys and sorrows—an image of deep spiritual and sacramental solidarity."
    },
    {
      "pk": 53012027,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 27,
      "text": "Now you are the body of Christ, and individually members of it.",
      "links": "<a href='/AIV/49/5/30'>Eph. 5:30</a>",
      "comment": "Paul makes it explicit: the believers together—across time and place—form Christ's body. This mystical reality is especially emphasized in the community’s sacramental worship and life."
    },
    {
      "pk": 53012028,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 28,
      "text": "And God has appointed in the church first apostles, second prophets, third teachers, then miracles, then gifts of healings, helps, administrations, and various kinds of tongues.",
      "links": "<a href='/AIV/49/4/11'>Eph. 4:11</a>",
      "comment": "Paul outlines a divine order or structure in the Church, with specific roles and ministries. The emphasis on apostleship and ordered ministry has strong implications for leadership and authority within the Church body."
    },
    {
      "pk": 53012029,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 29,
      "text": "Are all apostles? Are all prophets? Are all teachers? Do all work miracles?",
      "links": "",
      "comment": "Paul asks rhetorical questions showing not everyone has the same role. Diversity of gifts points toward the need for a unifying structure and common doctrine."
    },
    {
      "pk": 53012030,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 30,
      "text": "Do all have gifts of healings? Do all speak with tongues? Do all interpret?",
      "links": "",
      "comment": "No one person possesses all gifts. This highlights communal dependence on one another and the collective nature of the Church's spiritual life."
    },
    {
      "pk": 53012031,
      "translation": "AIV",
      "book": 53,
      "bookName": "1 Corinthians",
      "bookAbbreviation": "1Cor",
      "chapter": 12,
      "verse": 31,
      "text": "But eagerly desire the greater gifts. And I will show you a still more excellent way.",
      "links": "<a href='/AIV/46/13/1-13'>1 Cor. 13:1-13</a>",
      "comment": "Paul encourages the pursuit of the higher gifts, but signals that love is yet more excellent—a prelude to the famous teaching on charity in the next chapter. Within the Christian community, sacrificial love is the foundation and fulfillment of all spiritual gifts."
    }
  ],
  "translatedAt": "2025-12-24T11:50:01.597Z"
}