{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 21,
  "verses": [
    {
      "pk": 2102101,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 1,
      "text": "Jesus looked up and saw the rich putting their gifts into the offering box.",
      "links": "<a href='/AIV/41/12/41'>Mark 12:41</a>",
      "comment": "This sets the scene for Jesus contrasting true generosity with outward show. See also Mark's parallel account."
    },
    {
      "pk": 2102102,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 2,
      "text": "He also saw a poor widow putting in two small copper coins.",
      "links": "<a href='/AIV/42/21/3'>Luke 21:3</a>",
      "comment": "The 'small copper coins' (Greek: lepta) were the smallest denomination, emphasizing her poverty and sacrifice."
    },
    {
      "pk": 2102103,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 3,
      "text": "He said, 'Truly I tell you, this poor widow has given more than all the others.'",
      "links": "<a href='/AIV/41/12/43'>Mark 12:43</a>",
      "comment": "Jesus points out the true value of her gift lies not in the amount, but in her self-sacrifice. This passage encourages trust in God and generosity, regardless of material wealth."
    },
    {
      "pk": 2102104,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 4,
      "text": "For they all gave out of their abundance, but she out of her poverty put in all she had to live on.",
      "links": "<a href='/AIV/42/18/22'>Luke 18:22</a>",
      "comment": "Giving sacrificially is prized by God. The widow's total gift foreshadows complete self-giving, as Christ exemplifies on the cross."
    },
    {
      "pk": 2102105,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 5,
      "text": "While some were speaking about the temple, how it was adorned with beautiful stones and gifts dedicated to God, he said,",
      "links": "<a href='/AIV/40/24/1'>Matthew 24:1</a>; <a href='/AIV/41/13/1'>Mark 13:1</a>",
      "comment": "The focus shifts from human generosity to the grandeur of the temple, setting up Jesus’ prophecy about its destruction."
    },
    {
      "pk": 2102106,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 6,
      "text": "'As for these things you see here—the days will come when not one stone will be left on another; every one of them will be thrown down.'",
      "links": "<a href='/AIV/33/3/12'>Micah 3:12</a>; <a href='/AIV/42/19/44'>Luke 19:44</a>",
      "comment": "Jesus foretells the destruction of the temple (fulfilled in AD 70). The reference hints at the transition from the old covenant centered on the temple to the new reality centered on Christ and his followers."
    },
    {
      "pk": 2102107,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 7,
      "text": "They asked him, 'Teacher, when will these things happen? And what will be the sign that they are about to take place?'",
      "links": "<a href='/AIV/41/13/4'>Mark 13:4</a>",
      "comment": "The disciples want to know about the timing of these events, prompting Jesus’ prophetic discourse."
    },
    {
      "pk": 2102108,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 8,
      "text": "He replied, 'See that you are not led astray. For many will come in my name, saying, “I am he!” and, “The time is near!” Do not go after them.'",
      "links": "<a href='/AIV/40/24/4'>Matthew 24:4</a>; <a href='/AIV/41/13/5'>Mark 13:5</a>",
      "comment": "Jesus warns against false messiahs and deception. The command to remain steadfast aligns with the apostolic tradition."
    },
    {
      "pk": 2102109,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 9,
      "text": "'And when you hear of wars and revolutions, do not be terrified. For these things must happen first, but the end will not come immediately.'",
      "links": "<a href='/AIV/40/24/6'>Matthew 24:6</a>",
      "comment": "Jesus describes chaotic times but cautions against panic, underscoring God’s sovereign timing."
    },
    {
      "pk": 2102110,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 10,
      "text": "Then he said to them: 'Nation will rise against nation, and kingdom against kingdom.'",
      "links": "<a href='/AIV/39/2/14'>Joel 2:14</a>; <a href='/AIV/40/24/7'>Matthew 24:7</a>",
      "comment": "A prophecy of widespread turmoil, echoing the Old Testament’s depictions of judgment and upheaval."
    },
    {
      "pk": 2102111,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 11,
      "text": "'There will be great earthquakes, famines, and plagues in various places, and there will be terrifying sights and great signs from heaven.'",
      "links": "<a href='/AIV/20/11/10'>Proverbs 11:10</a>; <a href='/AIV/44/16/26'>Acts 16:26</a>",
      "comment": "Natural disasters as divine signs accompany Messianic expectations, a theme found in prophetic writings."
    },
    {
      "pk": 2102112,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 12,
      "text": "'But before all this, they will seize you and persecute you. They will hand you over to synagogues and prisons, and you will be brought before kings and governors for my name’s sake.'",
      "links": "<a href='/AIV/44/5/41'>Acts 5:41</a>; <a href='/AIV/44/22/19'>Acts 22:19</a>",
      "comment": "Persecution of the early disciples is predicted. This anticipates Acts, where apostles witness bravely under opposition."
    },
    {
      "pk": 2102113,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 13,
      "text": "'This will be your opportunity to bear witness.'",
      "links": "<a href='/AIV/44/4/8'>Acts 4:8</a>; <a href='/AIV/44/26/1'>Acts 26:1</a>",
      "comment": "Suffering becomes a platform for Christian testimony; suffering for the truth has value."
    },
    {
      "pk": 2102114,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 14,
      "text": "'Therefore make up your minds not to prepare beforehand how to defend yourselves,'",
      "links": "<a href='/AIV/42/12/11'>Luke 12:11-12</a>",
      "comment": "Jesus calls for trust in his ongoing guidance and the Holy Spirit’s inspiration for his followers."
    },
    {
      "pk": 2102115,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 15,
      "text": "'For I will give you words and wisdom, which none of your opponents will be able to withstand or contradict.'",
      "links": "<a href='/AIV/44/6/10'>Acts 6:10</a>; <a href='/AIV/42/12/12'>Luke 12:12</a>",
      "comment": "Jesus promises to impart wisdom—another affirmation of Jesus’ divine authority to equip his followers."
    },
    {
      "pk": 2102116,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 16,
      "text": "'You will even be betrayed by parents and siblings, relatives and friends, and some of you they will put to death.'",
      "links": "<a href='/AIV/33/7/6'>Micah 7:6</a>; <a href='/AIV/40/10/21'>Matthew 10:21</a>",
      "comment": "Persecution will sometimes come from within families, echoing Old Testament prophecy and Jesus’ own teaching on the radical demands of discipleship."
    },
    {
      "pk": 2102117,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 17,
      "text": "'You will be hated by all for my name’s sake.'",
      "links": "<a href='/AIV/40/10/22'>Matthew 10:22</a>",
      "comment": "Being hated for allegiance to Jesus is a mark of authentic discipleship."
    },
    {
      "pk": 2102118,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 18,
      "text": "'But not a hair of your head will perish.'",
      "links": "<a href='/AIV/42/12/7'>Luke 12:7</a>; <a href='/AIV/44/27/34'>Acts 27:34</a>",
      "comment": "Despite trials, God’s providence protects his faithful; see spiritual interpretation as ultimate salvation."
    },
    {
      "pk": 2102119,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 19,
      "text": "'By your endurance you will gain your souls.'",
      "links": "<a href='/AIV/45/2/7'>Romans 2:7</a>; <a href='/AIV/66/3/10'>Revelation 3:10</a>",
      "comment": "Perseverance is necessary for salvation. This verse supports the understanding of salvation as both a present and ongoing reality."
    },
    {
      "pk": 2102120,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 20,
      "text": "'But when you see Jerusalem surrounded by armies, then know that its desolation has drawn near.'",
      "links": "<a href='/AIV/27/9/26'>Daniel 9:26</a>; <a href='/AIV/42/19/43'>Luke 19:43</a>",
      "comment": "A clear prophecy fulfilled in AD 70. The fall of Jerusalem marked a dramatic turning point in redemptive history and shifted focus from the temple to a new covenant community."
    },
    {
      "pk": 2102121,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 21,
      "text": "'Then let those who are in Judea flee to the mountains, and let those inside the city depart, and let not those who are out in the country enter it.'",
      "links": "<a href='/AIV/42/17/31'>Luke 17:31</a>; <a href='/AIV/24/6/1'>Jeremiah 6:1</a>",
      "comment": "Practical instructions for believers in Jerusalem at the time. Acts as a historical anchor for these prophecies."
    },
    {
      "pk": 2102122,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 22,
      "text": "'For these are days of vengeance, to fulfill all that is written.'",
      "links": "<a href='/AIV/23/61/2'>Isaiah 61:2</a>; <a href='/AIV/28/9/7'>Hosea 9:7</a>",
      "comment": "References judgment and the fulfillment of prophecy, underscoring God’s faithfulness to His word."
    },
    {
      "pk": 2102123,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 23,
      "text": "'Woe to those who are pregnant and to those who are nursing infants in those days! For there will be great distress upon the land and wrath against this people.'",
      "links": "<a href='/AIV/40/24/19'>Matthew 24:19</a>",
      "comment": "A vivid warning of suffering during Jerusalem’s siege, especially for the vulnerable."
    },
    {
      "pk": 2102124,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 24,
      "text": "'They will fall by the edge of the sword and be led captive among all nations, and Jerusalem will be trampled underfoot by the Gentiles, until the times of the Gentiles are fulfilled.'",
      "links": "<a href='/AIV/25/2/2'>Lamentations 2:2</a>; <a href='/AIV/45/11/25'>Romans 11:25</a>",
      "comment": "Refers both to the historical destruction and the wider mission to the Gentiles, showing God's involvement with all nations."
    },
    {
      "pk": 2102125,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 25,
      "text": "'There will be signs in the sun and moon and stars, and on the earth distress among nations in perplexity because of the roaring of the sea and the waves,'",
      "links": "<a href='/AIV/23/13/10'>Isaiah 13:10</a>; <a href='/AIV/34/1/5'>Nahum 1:5</a>",
      "comment": "These cosmic signs draw from prophetic language and stress the universality of the final judgment."
    },
    {
      "pk": 2102126,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 26,
      "text": "'People will faint from fear and foreboding of what is coming on the world, for the powers of the heavens will be shaken.'",
      "links": "<a href='/AIV/23/24/19'>Isaiah 24:19-20</a>",
      "comment": "The 'shaking of heavens’ is frequently symbolic of God intervening powerfully in human affairs."
    },
    {
      "pk": 2102127,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 27,
      "text": "'Then they will see the Son of Man coming in a cloud with power and great glory.'",
      "links": "<a href='/AIV/27/7/13'>Daniel 7:13-14</a>; <a href='/AIV/40/24/30'>Matthew 24:30</a>",
      "comment": "This title and imagery directly echo Daniel, showing Jesus claims the authority and divinity of the Messianic Son of Man (Daniel 7:13-14)."
    },
    {
      "pk": 2102128,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 28,
      "text": "'Now when these things begin to take place, stand up and lift up your heads, because your redemption is drawing near.'",
      "links": "<a href='/AIV/19/24/7'>Psalm 24:7</a>; <a href='/AIV/45/8/23'>Romans 8:23</a>",
      "comment": "Believers await not destruction but redemption—a new exodus accomplished by Christ."
    },
    {
      "pk": 2102129,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 29,
      "text": "He told them a parable: 'Look at the fig tree and all the trees.'",
      "links": "<a href='/AIV/28/9/10'>Hosea 9:10</a>",
      "comment": "Jesus uses a parable to teach alertness to God’s unfolding plan."
    },
    {
      "pk": 2102130,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 30,
      "text": "'As soon as they put out leaves, you see for yourselves and know that summer is already near.'",
      "links": "",
      "comment": "As leaves announce summer, so signs announce fulfillment of Jesus’ prophecy."
    },
    {
      "pk": 2102131,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 31,
      "text": "'So also, when you see these things happening, know that the kingdom of God is near.'",
      "links": "<a href='/AIV/40/24/33'>Matthew 24:33</a>",
      "comment": "The Kingdom’s coming is signaled by these events—a reminder to expect God’s reign to be fully realized."
    },
    {
      "pk": 2102132,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 32,
      "text": "'Truly, I say to you, this generation will not pass away until all has taken place.'",
      "links": "<a href='/AIV/40/24/34'>Matthew 24:34</a>",
      "comment": "Interpretations differ: may refer to the generation witnessing Jerusalem’s fall, or symbolically to the lasting authority of Jesus’ words. Tradition sees continuing fulfillment through the Church’s perseverance."
    },
    {
      "pk": 2102133,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 33,
      "text": "'Heaven and earth will pass away, but my words will never pass away.'",
      "links": "<a href='/AIV/23/40/8'>Isaiah 40:8</a>; <a href='/AIV/19/119/89'>Psalm 119:89</a>",
      "comment": "Jesus claims his words are eternally authoritative—the claim of one with divine authority."
    },
    {
      "pk": 2102134,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 34,
      "text": "'But watch yourselves, lest your hearts be weighed down with dissipation and drunkenness and worries of this life, and that day come upon you unexpectedly,'",
      "links": "<a href='/AIV/52/5/6'>1 Thessalonians 5:6</a>",
      "comment": "Spiritual vigilance is necessary to avoid spiritual lethargy and loss of readiness for Christ."
    },
    {
      "pk": 2102135,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 35,
      "text": "'For it will come like a trap on all those who live on the face of the whole earth.'",
      "links": "<a href='/AIV/26/12/27'>Ezekiel 12:27</a>",
      "comment": "A warning of the suddenness of divine judgment, recalling prophetic imagery."
    },
    {
      "pk": 2102136,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 36,
      "text": "'But stay awake at all times, praying that you may have the strength to escape all these things that are going to take place, and to stand before the Son of Man.'",
      "links": "<a href='/AIV/40/24/42'>Matthew 24:42</a>; <a href='/AIV/49/6/18'>Ephesians 6:18</a>",
      "comment": "Prayer and spiritual alertness are essential; note the expectation of standing before Christ in judgment—a call to remain faithful together in a persevering community."
    },
    {
      "pk": 2102137,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 37,
      "text": "Every day Jesus was teaching in the temple, but at night he went out and stayed on the mount called Olivet.",
      "links": "<a href='/AIV/42/19/47'>Luke 19:47</a>",
      "comment": "Shows Christ's faithfulness in proclaiming the Word, and his humility in retreating to pray."
    },
    {
      "pk": 2102138,
      "translation": "AIV",
      "book": 3,
      "chapter": 21,
      "verse": 38,
      "text": "And all the people came to him early in the morning to hear him in the temple.",
      "links": "<a href='/AIV/42/19/48'>Luke 19:48</a>",
      "comment": "Jesus’ teaching ministry attracts people hungry for the truth. The emphasis on listening to Jesus in the temple foreshadows the Church’s gathering around the Word and worship."
    }
  ],
  "translatedAt": "2025-12-23T02:52:46.856Z"
}