{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 1,
  "verses": [
    {
      "pk": 1933000,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 1,
      "text": "Many have attempted to compile an account of the events that have taken place among us,",
      "links": "<a href='/AIV/44/1/1-2'>Acts 1:1-2</a>",
      "comment": "Luke refers to other writings about Jesus, showing his desire for accuracy and reliability in recording the Gospel. This sets up the trustworthiness of the narrative."
    },
    {
      "pk": 1933001,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 2,
      "text": "just as they were handed down to us by those who from the beginning were eyewitnesses and servants of the word.",
      "links": "<a href='/AIV/62/1/1'>1 John 1:1</a>",
      "comment": "Luke emphasizes apostolic eyewitnesses, rooting his Gospel in firsthand testimony. The 'servants of the word' refers to those dedicated to faithfully transmitting the Gospel message."
    },
    {
      "pk": 1933002,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 3,
      "text": "It seemed good to me also, having investigated everything carefully from the start, to write an orderly account for you, most excellent Theophilus,",
      "links": "<a href='/AIV/44/1/1'>Acts 1:1</a>",
      "comment": "Luke demonstrates historical diligence and careful research. Theophilus may have been a high-ranking official or benefactor. This address highlights the careful transmission of truth through authority and tradition."
    },
    {
      "pk": 1933003,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 4,
      "text": "so that you may know the certainty of the things you have been taught.",
      "links": "<a href='/AIV/62/5/13'>1 John 5:13</a>",
      "comment": "Luke's goal is that readers have assurance in the teachings received, underscoring the reliability and continuity of the apostolic tradition."
    },
    {
      "pk": 1933004,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 5,
      "text": "In the days of Herod, king of Judea, there was a priest named Zechariah, of the division of Abijah. His wife Elizabeth was a descendant of Aaron.",
      "links": "<a href='/AIV/13/24/10'>1 Chron. 24:10</a>; <a href='/AIV/2/6/23'>Exod. 6:23</a>",
      "comment": "Luke roots the events in history, mentioning Herod and priestly divisions. Both Zechariah and Elizabeth have priestly lineage, emphasizing the priestly role central to Israel's worship."
    },
    {
      "pk": 1933005,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 6,
      "text": "They were both righteous before God, walking blamelessly in all the commandments and ordinances of the Lord.",
      "links": "<a href='/AIV/18/1/1'>Job 1:1</a>; <a href='/AIV/19/119/1'>Ps. 119:1</a>",
      "comment": "Their blamelessness is affirmed in a manner similar to Old Testament figures, showing that God's preparatory work involves holy vessels."
    },
    {
      "pk": 1933006,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 7,
      "text": "But they had no child, because Elizabeth was barren, and both were well advanced in years.",
      "links": "<a href='/AIV/1/16/1'>Gen. 16:1</a>; <a href='/AIV/9/1/2'>1 Sam. 1:2</a>",
      "comment": "The theme of barrenness recalls Sarah and Hannah, highlighting how God works through human weakness to show His power."
    },
    {
      "pk": 1933007,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 8,
      "text": "While he was serving as priest before God when his division was on duty,",
      "links": "<a href='/AIV/13/24/19'>1 Chron. 24:19</a>",
      "comment": "Priestly divisions established continuity with ancient temple service and order."
    },
    {
      "pk": 1933008,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 9,
      "text": "according to the custom of the priesthood, he was chosen by lot to enter the temple of the Lord and burn incense.",
      "links": "<a href='/AIV/3/16/12'>Lev. 16:12</a>; <a href='/AIV/19/141/2'>Ps. 141:2</a>",
      "comment": "The lot's choice underscores God's providence. Incense symbolizes prayers rising to God—a sacred act of mediation."
    },
    {
      "pk": 1933009,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 10,
      "text": "At the hour of incense, the whole congregation was praying outside.",
      "links": "<a href='/AIV/19/141/2'>Ps. 141:2</a>",
      "comment": "The unity of prayer links temple worship with communal intercession, echoing Old Testament patterns."
    },
    {
      "pk": 1933010,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 11,
      "text": "And there appeared to him an angel of the Lord, standing at the right side of the altar of incense.",
      "links": "<a href='/AIV/7/6/11'>Judg. 6:11</a>; <a href='/AIV/2/3/10'>Exod. 3:10</a>",
      "comment": "Angelophanies in the temple point towards God's direct intervention—prefiguring the angelic announcements regarding Christ."
    },
    {
      "pk": 1933011,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 12,
      "text": "When Zechariah saw him, he was troubled and fear fell upon him.",
      "links": "<a href='/AIV/7/6/22'>Judg. 6:22</a>; <a href='/AIV/27/10/7'>Dan. 10:7-8</a>",
      "comment": "Visions of angels frequently provoke awe and trembling in human witnesses, showing the majesty of God's messengers."
    },
    {
      "pk": 1933012,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 13,
      "text": "But the angel said to him, \"Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you shall call his name John.\"",
      "links": "<a href='/AIV/1/17/19'>Gen. 17:19</a>; <a href='/AIV/9/1/20'>1 Sam. 1:20</a>",
      "comment": "God answers Zechariah’s prayer, announcing the miraculous birth, echoing OT stories of promised children with significant roles."
    },
    {
      "pk": 1933013,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 14,
      "text": "\"You will have joy and gladness, and many will rejoice at his birth.\"",
      "links": "<a href='/AIV/19/126/3'>Ps. 126:3</a>",
      "comment": "John's birth brings communal joy, signaling the arrival of God's redemptive work through him."
    },
    {
      "pk": 1933014,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 15,
      "text": "\"For he will be great before the Lord, and he must not drink wine or strong drink. He will be filled with the Holy Spirit, even from his mother’s womb.\"",
      "links": "<a href='/AIV/4/6/2-3'>Num. 6:2–3</a>; <a href='/AIV/24/1/5'>Jer. 1:5</a>",
      "comment": "John is set apart as a Nazarite and filled with the Holy Spirit from conception—showing God's special preparation for him, with implications for the sanctity and value of life from the womb."
    },
    {
      "pk": 1933015,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 16,
      "text": "\"And he will turn many of the sons of Israel back to the Lord their God.\"",
      "links": "<a href='/AIV/39/4/5-6'>Mal. 4:5–6</a>",
      "comment": "John fulfills Malachi’s prophecy of returning hearts. Repentance is central to his mission—preparing Israel for the Messiah."
    },
    {
      "pk": 1933016,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 17,
      "text": "\"He will go before Him in the spirit and power of Elijah, to turn the hearts of fathers to their children and the disobedient to the wisdom of the just, to make ready for the Lord a people prepared.\"",
      "links": "<a href='/AIV/39/4/5'>Mal. 4:5</a>; <a href='/AIV/11/18/36-38'>1 Kings 18:36–38</a>",
      "comment": "This is a direct reference to the expectation of Elijah’s return before the Messiah. John is seen as fulfilling this typology through his prophetic ministry."
    },
    {
      "pk": 1933017,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 18,
      "text": "Zechariah said to the angel, \"How can I be sure of this? For I am an old man, and my wife is well advanced in years.\"",
      "links": "<a href='/AIV/1/18/11'>Gen. 18:11–12</a>",
      "comment": "Zechariah’s hesitation mirrors Abraham and Sarah’s doubt, from which God demonstrates His power."
    },
    {
      "pk": 1933018,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 19,
      "text": "The angel answered him, \"I am Gabriel. I stand in the presence of God, and I was sent to speak to you and to bring you this good news.\"",
      "links": "<a href='/AIV/27/8/16'>Dan. 8:16</a>; <a href='/AIV/27/9/21'>Dan. 9:21</a>",
      "comment": "Gabriel is one of the few named angels, tasked with delivering monumental messages—showing the continuity of God’s revelation."
    },
    {
      "pk": 1933019,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 20,
      "text": "\"And behold, you will be silent and unable to speak until the day these things take place, because you did not believe my words, which will be fulfilled in their time.\"",
      "links": "<a href='/AIV/1/17/17'>Gen. 17:17–18</a>",
      "comment": "Zechariah is muted as a sign, serving both as discipline and proof of divine power. God’s promises are fulfilled in His timing."
    },
    {
      "pk": 1933020,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 21,
      "text": "The people were waiting for Zechariah and wondered at his delay in the temple.",
      "links": "",
      "comment": "The congregation’s anticipation highlights the solemnity of priestly service and temple ritual."
    },
    {
      "pk": 1933021,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 22,
      "text": "When he came out, he could not speak to them, and they realized he had seen a vision in the temple. He kept making signs to them and remained mute.",
      "links": "",
      "comment": "Zechariah’s muteness is a miraculous sign—God’s direct intervention in temple priesthood, a theme central throughout the Gospel."
    },
    {
      "pk": 1933022,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 23,
      "text": "When his time of service was ended, he went home.",
      "links": "",
      "comment": "After fulfilling his priestly duties, Zechariah returns home, marking the end of his sacred service and the beginning of divine fulfillment."
    },
    {
      "pk": 1933023,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 24,
      "text": "After these days his wife Elizabeth conceived, and for five months she remained in seclusion, saying,",
      "links": "",
      "comment": "Elizabeth’s conception is presented as a direct fulfillment of God’s promise, her seclusion perhaps being a time of prayer and preparation."
    },
    {
      "pk": 1933024,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 25,
      "text": "\"The Lord has done this for me, in the days when He looked on me to take away my disgrace among men.\"",
      "links": "<a href='/AIV/9/1/6'>1 Sam. 1:6</a>",
      "comment": "Elizabeth expresses gratitude. Barrenness was seen as a reproach; God’s intervention brings honor."
    },
    {
      "pk": 1933025,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 26,
      "text": "In the sixth month, the angel Gabriel was sent by God to a city of Galilee named Nazareth,",
      "links": "<a href='/AIV/27/9/21'>Dan. 9:21</a>; <a href='/AIV/19/132/11'>Ps. 132:11</a>",
      "comment": "God acts in unexpected places—Nazareth is humble and obscure, yet chosen for a world-changing annunciation."
    },
    {
      "pk": 1933026,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 27,
      "text": "to a virgin betrothed to a man named Joseph, of the house of David. The virgin's name was Mary.",
      "links": "<a href='/AIV/23/7/14'>Isa. 7:14</a>; <a href='/AIV/10/7/16'>2 Sam. 7:16</a>",
      "comment": "This fulfills prophecy of a virgin bearing the Messiah (Isaiah 7:14) and establishes Jesus’ Davidic lineage—central to messianic expectation."
    },
    {
      "pk": 1933027,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 28,
      "text": "And the angel came to her and said, \"Greetings, favored one, the Lord is with you.\"",
      "links": "<a href='/AIV/7/6/12'>Judg. 6:12</a>",
      "comment": "Mary receives a unique title, showing her special status in salvation history—as the one chosen for the Incarnation."
    },
    {
      "pk": 1933028,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 29,
      "text": "But she was greatly troubled by his words, and wondered what kind of greeting this could be.",
      "links": "",
      "comment": "Mary’s humility and openness to God’s will is essential; her troubled reaction reveals her reverence and sense of responsibility."
    },
    {
      "pk": 1933029,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 30,
      "text": "The angel said to her, \"Do not be afraid, Mary, for you have found favor with God.\"",
      "links": "<a href='/AIV/1/6/8'>Gen. 6:8</a>",
      "comment": "Echoing Noah, Mary is singled out due to her faithfulness, highlighting God’s gracious initiative."
    },
    {
      "pk": 1933030,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 31,
      "text": "\"Behold, you will conceive in your womb and bear a son, and you will name Him Jesus.\"",
      "links": "<a href='/AIV/23/7/14'>Isa. 7:14</a>; <a href='/AIV/40/1/21'>Matt. 1:21</a>",
      "comment": "Direct fulfillment of Isaiah. The naming by divine command signifies the child’s mission—'Jesus' meaning 'Yahweh saves.'"
    },
    {
      "pk": 1933031,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 32,
      "text": "\"He will be great, and will be called Son of the Most High. The Lord God will give Him the throne of His father David,\"",
      "links": "<a href='/AIV/10/7/12-16'>2 Sam. 7:12–16</a>; <a href='/AIV/19/2/7'>Ps. 2:7</a>",
      "comment": "Jesus is identified as the Son of God and heir to David’s everlasting throne—asserting His full divinity and kingship."
    },
    {
      "pk": 1933032,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 33,
      "text": "\"and He will reign over the house of Jacob forever, and of His kingdom there will be no end.\"",
      "links": "<a href='/AIV/23/9/7'>Isa. 9:7</a>; <a href='/AIV/27/2/44'>Dan. 2:44</a>",
      "comment": "Jesus’ reign is everlasting—fulfillment of the prophecies promising God's eternal kingdom."
    },
    {
      "pk": 1933033,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 34,
      "text": "Mary said to the angel, \"How can this be, since I am a virgin?\"",
      "links": "<a href='/AIV/23/7/14'>Isa. 7:14</a>",
      "comment": "Mary’s question affirms her virginity and sets the stage for the miraculous conception by the Holy Spirit—the doctrine of the virginal conception."
    },
    {
      "pk": 1933034,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 35,
      "text": "The angel answered her, \"The Holy Spirit will come upon you, and the power of the Most High will overshadow you. Therefore the child to be born will be called holy—the Son of God.\"",
      "links": "<a href='/AIV/40/1/20'>Matt. 1:20</a>; <a href='/AIV/19/2/7'>Ps. 2:7</a>",
      "comment": "This verse directly affirms the Incarnation—Jesus is conceived by the Holy Spirit, making Him truly God and truly man."
    },
    {
      "pk": 1933035,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 36,
      "text": "\"And behold, your relative Elizabeth in her old age has also conceived a son, and this is the sixth month for her who was called barren.\"",
      "links": "<a href='/AIV/1/18/14'>Gen. 18:14</a>",
      "comment": "The angel links Mary’s sign to Elizabeth’s miraculous conception, emphasizing God’s omnipotence."
    },
    {
      "pk": 1933036,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 37,
      "text": "\"For nothing will be impossible with God.\"",
      "links": "<a href='/AIV/1/18/14'>Gen. 18:14</a>; <a href='/AIV/40/19/26'>Matt. 19:26</a>",
      "comment": "God’s limitless power is highlighted—He can bring forth new creation and fulfill His promises."
    },
    {
      "pk": 1933037,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 38,
      "text": "And Mary said, \"Behold, I am the servant of the Lord. Let it be to me according to your word.\" And the angel departed from her.",
      "links": "<a href='/AIV/19/40/8'>Ps. 40:8</a>; <a href='/AIV/40/26/39'>Matt. 26:39</a>",
      "comment": "Mary’s obedient consent is rich with spiritual meaning—her 'yes' to God models submission and openness to grace, preparing the way for the Incarnation."
    },
    {
      "pk": 1933038,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 39,
      "text": "In those days Mary arose and went quickly into the hill country, to a town in Judah,",
      "links": "",
      "comment": "Mary’s haste points to her zeal and charity in seeking out Elizabeth, highlighting the importance of spiritual fellowship and communion of saints."
    },
    {
      "pk": 1933039,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 40,
      "text": "and she entered the house of Zechariah and greeted Elizabeth.",
      "links": "",
      "comment": "The meeting of the two women brings together the Old and New Testament promises—each bearing a child of prophetic significance."
    },
    {
      "pk": 1933040,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 41,
      "text": "And when Elizabeth heard Mary’s greeting, the baby leaped in her womb. Elizabeth was filled with the Holy Spirit,",
      "links": "<a href='/AIV/24/1/5'>Jer. 1:5</a>",
      "comment": "John’s leap is interpreted as recognizing Jesus as Lord, even from the womb—a sign of sanctifying grace and spiritual recognition of Christ."
    },
    {
      "pk": 1933041,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 42,
      "text": "and she exclaimed with a loud voice, \"Blessed are you among women, and blessed is the fruit of your womb!\"",
      "links": "<a href='/AIV/7/5/24'>Judg. 5:24</a>; <a href='/AIV/19/127/3'>Ps. 127:3</a>",
      "comment": "Elizabeth, moved by the Spirit, prophesies Mary’s unique blessedness—a foundation for honoring Mary in Christian devotion."
    },
    {
      "pk": 1933042,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 43,
      "text": "\"And why has this happened to me, that the mother of my Lord should come to me?\"",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>",
      "comment": "Elizabeth calls Mary ‘mother of my Lord,’ making a high Christological confession that the unborn Jesus is her Lord (God)."
    },
    {
      "pk": 1933043,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 44,
      "text": "\"For behold, when the sound of your greeting reached my ears, the baby in my womb leaped for joy.\"",
      "links": "",
      "comment": "John’s leap is understood as an act of prophetic recognition, highlighting the spiritual presence of Christ even in the womb."
    },
    {
      "pk": 1933044,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 45,
      "text": "\"Blessed is she who believed that the Lord’s word to her would be fulfilled.\"",
      "links": "<a href='/AIV/19/31/19'>Ps. 31:19</a>",
      "comment": "Faith is praised as the key to receiving God's promises—Mary’s trust sets her apart as the model believer."
    },
    {
      "pk": 1933045,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 46,
      "text": "And Mary said: \"My soul magnifies the Lord,\"",
      "links": "<a href='/AIV/9/2/1'>1 Sam. 2:1</a>",
      "comment": "Mary’s 'Magnificat' parallels Hannah’s song—both celebrate God’s work through humble and faithful servants."
    },
    {
      "pk": 1933046,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 47,
      "text": "\"and my spirit rejoices in God my Savior,\"",
      "links": "<a href='/AIV/19/35/9'>Ps. 35:9</a>",
      "comment": "Mary acknowledges God as Savior—highlighting her need for grace and reinforcing the joy of divine redemption."
    },
    {
      "pk": 1933047,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 48,
      "text": "\"for He has looked on the humble state of His servant. For behold, from now on all generations will call me blessed,\"",
      "links": "<a href='/AIV/9/1/11'>1 Sam. 1:11</a>; <a href='/AIV/19/103/17'>Ps. 103:17</a>",
      "comment": "Mary’s prophecy finds fulfillment in the universal honor shown her by Christians; her humility becomes the framework for God’s exaltation."
    },
    {
      "pk": 1933048,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 49,
      "text": "\"for the Mighty One has done great things for me, and holy is His name.\"",
      "links": "<a href='/AIV/19/111/9'>Ps. 111:9</a>",
      "comment": "God’s holiness and power are linked to His saving actions; Mary’s praise acknowledges His transcendence and immanence."
    },
    {
      "pk": 1933049,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 50,
      "text": "\"His mercy is upon those who fear Him from generation to generation.\"",
      "links": "<a href='/AIV/19/103/17'>Ps. 103:17</a>",
      "comment": "God’s mercy is enduring—it’s received by those who respond with reverence."
    },
    {
      "pk": 1933050,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 51,
      "text": "\"He has shown strength with His arm; He has scattered the proud in the thoughts of their hearts.\"",
      "links": "<a href='/AIV/2/15/6'>Exod. 15:6</a>; <a href='/AIV/19/89/13'>Ps. 89:13</a>",
      "comment": "Mary echoes OT deliverance themes—God intervenes against human pride with divine strength."
    },
    {
      "pk": 1933051,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 52,
      "text": "\"He has brought down the mighty from their thrones and exalted those of humble estate.\"",
      "links": "<a href='/AIV/19/75/7'>Ps. 75:7</a>",
      "comment": "Mary celebrates God’s reversal of worldly status, a theme throughout Scripture."
    },
    {
      "pk": 1933052,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 53,
      "text": "\"He has filled the hungry with good things, and the rich He has sent away empty.\"",
      "links": "<a href='/AIV/19/107/9'>Ps. 107:9</a>; <a href='/AIV/20/13/7'>Prov. 13:7</a>",
      "comment": "Spiritual and physical needs are met through God—Mary’s song has both literal and spiritual implications, pointing to God’s care for all who seek Him."
    },
    {
      "pk": 1933053,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 54,
      "text": "\"He has helped His servant Israel, remembering His mercy,\"",
      "links": "<a href='/AIV/19/98/3'>Ps. 98:3</a>",
      "comment": "God’s covenant faithfulness to Israel is reaffirmed—His mercy endures forever."
    },
    {
      "pk": 1933054,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 55,
      "text": "\"just as He spoke to our fathers, to Abraham and to his offspring forever.\"",
      "links": "<a href='/AIV/1/17/7'>Gen. 17:7</a>; <a href='/AIV/19/105/8-10'>Ps. 105:8–10</a>",
      "comment": "Mary references the Abrahamic covenant, showing Christ’s coming as the fulfillment of prior promises."
    },
    {
      "pk": 1933055,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 56,
      "text": "Mary stayed with her about three months and then returned home.",
      "links": "",
      "comment": "Mary supports Elizabeth through the final months of her pregnancy, demonstrating service and charity."
    },
    {
      "pk": 1933056,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 57,
      "text": "Now the time came for Elizabeth to give birth, and she bore a son.",
      "links": "<a href='/AIV/9/1/20'>1 Sam. 1:20</a>",
      "comment": "The promise is fulfilled—the birth of John prepares the way for Christ’s own public ministry."
    },
    {
      "pk": 1933057,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 58,
      "text": "Her neighbors and relatives heard that the Lord had shown her great mercy, and they rejoiced with her.",
      "links": "<a href='/AIV/19/126/2'>Ps. 126:2</a>",
      "comment": "Joy attends the miracle, pointing to the communal aspect of salvation history."
    },
    {
      "pk": 1933058,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 59,
      "text": "On the eighth day they came to circumcise the child. They were about to name him after his father Zechariah,",
      "links": "<a href='/AIV/1/21/4'>Gen. 21:4</a>",
      "comment": "The timing and ritual circumcision highlight entrance into the covenant, connecting John to Israel’s tradition."
    },
    {
      "pk": 1933059,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 60,
      "text": "but his mother answered, \"No; he will be called John.\"",
      "links": "",
      "comment": "Elizabeth’s faithfulness to divine instruction is noteworthy—she upholds the angel’s command."
    },
    {
      "pk": 1933060,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 61,
      "text": "They said to her, \"None of your relatives is called by that name.\"",
      "links": "",
      "comment": "The unusual name underscores God’s intervention—a new chapter in salvation history."
    },
    {
      "pk": 1933061,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 62,
      "text": "And they made signs to his father, to find out what he wanted him to be called.",
      "links": "",
      "comment": "The community seeks confirmation from Zechariah, giving priority to his patriarchal role."
    },
    {
      "pk": 1933062,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 63,
      "text": "He asked for a writing tablet and wrote, \"His name is John.\" And they all marveled.",
      "links": "<a href='/AIV/27/12/10'>Dan. 12:10</a>",
      "comment": "Zechariah reaffirms God’s will; his obedience leads to wonder and amazement—his muteness is now about to be lifted."
    },
    {
      "pk": 1933063,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 64,
      "text": "Immediately, his mouth was opened and his tongue set free, and he spoke, blessing God.",
      "links": "<a href='/AIV/19/51/15'>Ps. 51:15</a>",
      "comment": "Zechariah’s restored speech parallels biblical accounts of miraculous healing, and his response is worship—praising God’s faithfulness."
    },
    {
      "pk": 1933064,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 65,
      "text": "And fear came on all who lived nearby, and all these things were talked about throughout the hill country of Judea.",
      "links": "<a href='/AIV/62/4/18'>1 John 4:18</a>",
      "comment": "A reverent awe spreads—the sign’s impact reaches beyond the immediate family, foreshadowing John's wide influence."
    },
    {
      "pk": 1933065,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 66,
      "text": "All who heard pondered these things in their hearts, saying, \"What then will this child be?\" For the hand of the Lord was with him.",
      "links": "<a href='/AIV/7/13/24'>Judg. 13:24-25</a>",
      "comment": "Questions about John’s destiny echo Samson and Samuel—God raises up significant leaders to prepare the people."
    },
    {
      "pk": 1933066,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 67,
      "text": "And Zechariah, his father, was filled with the Holy Spirit and prophesied, saying:",
      "links": "<a href='/AIV/4/11/29'>Num. 11:29</a>",
      "comment": "Filled with the Spirit, Zechariah’s song declares divine revelation and fulfillment, an instance of authoritative prophecy."
    },
    {
      "pk": 1933067,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 68,
      "text": "\"Blessed be the Lord, the God of Israel, for He has visited and redeemed His people,\"",
      "links": "<a href='/AIV/19/111/9'>Ps. 111:9</a>; <a href='/AIV/19/78/35'>Ps. 78:35</a>",
      "comment": "Zechariah’s Benedictus celebrates God’s imminent redemption—God 'visiting' Israel prefigures Jesus’ ministry."
    },
    {
      "pk": 1933068,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 69,
      "text": "\"and has raised up a horn of salvation for us in the house of His servant David,\"",
      "links": "<a href='/AIV/19/132/17'>Ps. 132:17</a>; <a href='/AIV/10/7/16'>2 Sam. 7:16</a>",
      "comment": "The 'horn of salvation' refers to strength and kingship. By mentioning David, it reaffirms messianic expectation and Jesus’ royal lineage."
    },
    {
      "pk": 1933069,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 70,
      "text": "\"as He spoke by the mouth of His holy prophets from old,\"",
      "links": "<a href='/AIV/24/23/5'>Jer. 23:5</a>; <a href='/AIV/23/11/1'>Isa. 11:1</a>",
      "comment": "Fulfillment of prophetic promises—God’s words through His chosen messengers are trustworthy and authoritative."
    },
    {
      "pk": 1933070,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 71,
      "text": "\"salvation from our enemies and from the hand of all who hate us,\"",
      "links": "<a href='/AIV/19/106/10'>Ps. 106:10</a>",
      "comment": "Israel’s hope is for deliverance—a prophetic aspect with both spiritual and national dimensions."
    },
    {
      "pk": 1933071,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 72,
      "text": "\"to show mercy to our fathers and to remember His holy covenant,\"",
      "links": "<a href='/AIV/1/17/19'>Gen. 17:19</a>; <a href='/AIV/19/105/8-10'>Ps. 105:8–10</a>",
      "comment": "God’s mercy is covenantal and lasting—His remembrance of His promises spans generations."
    },
    {
      "pk": 1933072,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 73,
      "text": "\"the oath which He swore to our father Abraham,\"",
      "links": "<a href='/AIV/1/22/16-18'>Gen. 22:16–18</a>",
      "comment": "Abraham’s covenant is central to God’s plan of salvation—a continuous thread from patriarchs to Christ."
    },
    {
      "pk": 1933073,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 74,
      "text": "\"to grant us that we, delivered from the hand of our enemies, might serve Him without fear,\"",
      "links": "<a href='/AIV/2/14/13'>Exod. 14:13</a>",
      "comment": "Redemption is for the purpose of worship and service—freedom finds its fullest expression in offering oneself to God."
    },
    {
      "pk": 1933074,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 75,
      "text": "\"in holiness and righteousness before Him all our days.\"",
      "links": "<a href='/AIV/19/15/2'>Ps. 15:2</a>",
      "comment": "The call is to sanctity and just living, essential for Christian discipleship."
    },
    {
      "pk": 1933075,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 76,
      "text": "\"And you, child, will be called the prophet of the Most High; for you will go before the Lord to prepare His ways,\"",
      "links": "<a href='/AIV/39/3/1'>Mal. 3:1</a>; <a href='/AIV/23/40/3'>Isa. 40:3</a>",
      "comment": "Zechariah identifies John as the forerunner of Christ, fulfilling OT prophecy—preparation for the coming Messiah is prophetic and sacramental."
    },
    {
      "pk": 1933076,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 77,
      "text": "\"to give knowledge of salvation to His people in the forgiveness of their sins,\"",
      "links": "<a href='/AIV/24/31/34'>Jer. 31:34</a>",
      "comment": "Salvation is tied to forgiveness—a key theme fulfilled in Christ’s atoning work."
    },
    {
      "pk": 1933077,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 78,
      "text": "\"because of the tender mercy of our God, by which the sunrise from on high will visit us,\"",
      "links": "<a href='/AIV/23/60/1'>Isa. 60:1</a>",
      "comment": "'Sunrise' or 'Dayspring' is an image of Christ—the light that dispels darkness, fulfilling messianic promises."
    },
    {
      "pk": 1933078,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 79,
      "text": "\"to give light to those who sit in darkness and in the shadow of death, to guide our feet into the way of peace.\"",
      "links": "<a href='/AIV/23/9/2'>Isa. 9:2</a>; <a href='/AIV/19/23/4'>Ps. 23:4</a>",
      "comment": "Light overcoming darkness refers spiritually to Christ’s role—He leads all to peace, reconciliation, and fullness of life."
    },
    {
      "pk": 1933079,
      "translation": "AIV",
      "book": 42,
      "chapter": 1,
      "verse": 80,
      "text": "The child grew and became strong in spirit, and he was in the wilderness until the day of his public appearance to Israel.",
      "links": "<a href='/AIV/7/13/24-25'>Judg. 13:24–25</a>; <a href='/AIV/9/3/19'>1 Sam. 3:19–20</a>",
      "comment": "John’s preparation in the wilderness mirrors Old Testament prophets and signifies a time of formation before his ministry inaugurates the era of Christ."
    }
  ],
  "translatedAt": "2025-12-23T02:37:55.700Z"
}