{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 16,
  "verses": [
    {
      "pk": 216001,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 1,
      "text": "He also said to his disciples: \"There was a rich man who had a manager, and charges were brought to him that this man was wasting his possessions.\"",
      "links": "",
      "comment": "This parable begins a teaching directly to the disciples. The theme of stewardship over another's possessions echoes Old Testament wisdom (see Prov. 27:18, Gen. 39:4-6). The idea of entrusted resources is significant for understanding Christian responsibility."
    },
    {
      "pk": 216002,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 2,
      "text": "\"So he called him and said, 'What is this I hear about you? Give an account of your management, because you can no longer be manager.'\"",
      "links": "",
      "comment": "The call for accountability is a common biblical principle (Matt. 25:14-30; Rom. 14:12). It subtly foreshadows the final judgment, where all people will be held accountable for their stewardship of what God has given them."
    },
    {
      "pk": 216003,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 3,
      "text": "\"Then the manager said to himself, 'What shall I do, since my master is taking away my management? I'm not strong enough to dig, and I'm ashamed to beg.'\"",
      "links": "",
      "comment": "The manager is faced with a desperate situation, leading to a creative solution. The narrative highlights the urgency for spiritual action when one recognizes their accountability."
    },
    {
      "pk": 216004,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 4,
      "text": "\"I know what I'll do, so that when I am removed from management, people will receive me into their houses.'\"",
      "links": "",
      "comment": "This idea of being 'received into houses' has a spiritual parallel regarding one's eternal dwelling (verse 9). The focus on foresight and preparing for the future has both literal and spiritual implications."
    },
    {
      "pk": 216005,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 5,
      "text": "\"So, summoning each one of his master's debtors, he said to the first, 'How much do you owe my master?'\"",
      "links": "",
      "comment": "Involving the debtors demonstrates the scope of the manager's duty and the impact of his decisions on others."
    },
    {
      "pk": 216006,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 6,
      "text": "\"He said, 'A hundred measures of olive oil.' The manager said, 'Take your bill, sit down quickly, and write fifty.'\"",
      "links": "",
      "comment": "The act of reducing the debt is shrewd, and is later praised by Jesus. The amount (about 800 gallons) would have been substantial. Some scholars suggest this could point to the remission of interest or illegal surcharges, aligning with the Mosaic Law's prohibition of usury (Deut. 23:19-20)."
    },
    {
      "pk": 216007,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 7,
      "text": "\"Then he said to another, 'And how much do you owe?' He answered, 'A hundred measures of wheat.' He said, 'Take your bill and write eighty.'\"",
      "links": "",
      "comment": "Again, the manager forgives a significant portion of the debt, possibly seeking favor with the debtors."
    },
    {
      "pk": 216008,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 8,
      "text": "\"The master commended the dishonest manager for his shrewdness. For the sons of this world are more shrewd in dealing with their own generation than the sons of light.\"",
      "links": "<a href='/AIV/40/10/16'>Matt. 10:16</a>",
      "comment": "Jesus points out the worldly manager’s prudence, not his dishonesty. Christians are exhorted to be wise in spiritual affairs. This forms part of Jesus’ teaching about the use of material wealth for eternal benefit—a principle with both social and spiritual overtones that suggest a visible, governed community entrusted with spiritual resources."
    },
    {
      "pk": 216009,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 9,
      "text": "\"And I tell you, make friends for yourselves by means of unrighteous wealth, so that when it fails, they may receive you into eternal dwellings.\"",
      "links": "<a href='/AIV/40/25/35-40'>Matt. 25:35-40</a>",
      "comment": "Material goods are to be used for charitable works leading to eternal reward. The phrase 'eternal dwellings' points beyond this life, linking the use of wealth to entry into everlasting communion (see also 1 Tim. 6:17-19). Tradition has often interpreted this in light of prayer, almsgiving, and the merits of the saints benefiting others."
    },
    {
      "pk": 216010,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 10,
      "text": "\"Whoever is faithful in very little is also faithful in much, and whoever is dishonest in very little is also dishonest in much.\"",
      "links": "<a href='/AIV/19/101/6'>Ps. 101:6</a>; <a href='/AIV/40/25/21'>Matt. 25:21</a>",
      "comment": "Faithfulness in small responsibilities proves one’s trustworthiness for more significant responsibilities. The spiritual application can include the role of ministers and those entrusted with spiritual authority."
    },
    {
      "pk": 216011,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 11,
      "text": "\"If then you have not been faithful with unrighteous wealth, who will entrust to you the true riches?\"",
      "links": "",
      "comment": "‘True riches’ refers to spiritual and heavenly treasures (cf. Matt. 6:19-20). The value of spiritual goods far exceeds all earthly wealth. This draws attention to an ordered hierarchy of goods, with stewardship demanded at every level."
    },
    {
      "pk": 216012,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 12,
      "text": "\"And if you have not been faithful with what is another's, who will give you what is your own?\"",
      "links": "",
      "comment": "The teaching further emphasizes stewardship and preparation for what God ultimately desires to give His children in eternity."
    },
    {
      "pk": 216013,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 13,
      "text": "\"No servant can serve two masters. For either he will hate the one and love the other, or he will be devoted to the one and despise the other. You cannot serve God and wealth.\"",
      "links": "<a href='/AIV/40/6/24'>Matt. 6:24</a>",
      "comment": "Jesus repeats a teaching found in the Sermon on the Mount, contrasting service to God with slavery to wealth. The absolute nature of this statement underlines the call to undivided discipleship."
    },
    {
      "pk": 216014,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 14,
      "text": "The Pharisees, who were lovers of money, heard all these things, and they ridiculed him.",
      "links": "<a href='/AIV/40/23/14'>Matt. 23:14</a>",
      "comment": "Luke often portrays Pharisees as resistant to Jesus’ prophetic teaching, especially regarding wealth and hypocrisy. Their reaction shows how spiritual blindness can follow from attachment to material things."
    },
    {
      "pk": 216015,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 15,
      "text": "And he said to them, \"You are those who justify yourselves before men, but God knows your hearts. For what is highly regarded among men is detestable before God.\"",
      "links": "<a href='/AIV/9/16/7'>1 Sam. 16:7</a>",
      "comment": "Jesus exposes the contrast between mere external righteousness and true conversion of heart. God’s standards invert worldly approval."
    },
    {
      "pk": 216016,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 16,
      "text": "\"The Law and the Prophets were until John; since then the good news of the kingdom of God is proclaimed, and everyone is forcefully pressing into it.\"",
      "links": "<a href='/AIV/39/4/5'>Mal. 4:5</a>; <a href='/AIV/40/11/12-13'>Matt. 11:12-13</a>",
      "comment": "Jesus marks the transition from the Old Covenant to the fulfillment in himself. The kingdom's arrival means fulfillment and consummation of prophecy (cf. Heb. 1:1-2). The 'pressing in' hints at spiritual urgency and struggle, mirrored in the sacramental and communal life."
    },
    {
      "pk": 216017,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 17,
      "text": "\"But it is easier for heaven and earth to pass away than for one stroke of a letter in the Law to fail.\"",
      "links": "<a href='/AIV/19/119/89'>Ps. 119:89</a>; <a href='/AIV/40/5/18'>Matt. 5:18</a>",
      "comment": "The abiding validity of the Law until its total fulfillment in Christ is reiterated. This shows continuity and fulfillment, not abolition, implying the Church’s role in teaching with authority."
    },
    {
      "pk": 216018,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 18,
      "text": "\"Everyone who divorces his wife and marries another commits adultery, and he who marries a woman divorced from her husband commits adultery.\"",
      "links": "<a href='/AIV/40/5/32'>Matt. 5:32</a>; <a href='/AIV/41/10/11-12'>Mark 10:11-12</a>",
      "comment": "This teaching upholds a high view of marriage, seen as indissoluble. Jesus' reaffirmation of this principle alludes to the sacramental character of marriage, which has been maintained universally since apostolic times."
    },
    {
      "pk": 216019,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 19,
      "text": "\"There was a rich man who was clothed in purple and fine linen and feasted sumptuously every day.\"",
      "links": "",
      "comment": "The parable sets a vivid contrast between material luxury and the spiritual emptiness of the rich man."
    },
    {
      "pk": 216020,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 20,
      "text": "\"At his gate was laid a poor man named Lazarus, covered with sores,\"",
      "links": "",
      "comment": "Lazarus’ affliction and dependence foreshadow the theme of reversal found throughout Luke. His very name means 'God has helped,' implying divine favor for the humble."
    },
    {
      "pk": 216021,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 21,
      "text": "\"who longed to be fed with what fell from the rich man's table. Even the dogs came and licked his sores.\"",
      "links": "<a href='/AIV/40/15/27'>Matt. 15:27</a>",
      "comment": "Lazarus' wretched state stands in acute contrast to the rich man's comfort. His humility prefigures the blessedness promised to the poor (Luke 6:20)."
    },
    {
      "pk": 216022,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 22,
      "text": "\"The poor man died and was carried by the angels to the bosom of Abraham. The rich man also died and was buried.\"",
      "links": "<a href='/AIV/1/25/8-9'>Gen. 25:8-9</a>",
      "comment": "Lazarus receives angelic escort, showing his true heritage as a child of faith. 'Bosom of Abraham' represents a place of comfort and rest for the righteous ancestors (see Matt. 8:11; Heb. 11:8-16)."
    },
    {
      "pk": 216023,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 23,
      "text": "\"In Hades, being in torment, he lifted up his eyes and saw Abraham far off and Lazarus at his side.\"",
      "links": "",
      "comment": "The great reversal is underscored here; the rich man, formerly exalted, is now humbled, while Lazarus is exalted. The realistic depiction of the afterlife carries both literal and figurative meanings regarding post-mortem accountability."
    },
    {
      "pk": 216024,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 24,
      "text": "\"And he called out, 'Father Abraham, have mercy on me! Send Lazarus to dip the tip of his finger in water and cool my tongue, for I am in anguish in this flame.'\"",
      "links": "",
      "comment": "The rich man appeals to Abraham as a spiritual ancestor, but his request is denied, indicating the finality of judgment."
    },
    {
      "pk": 216025,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 25,
      "text": "\"But Abraham said, 'Child, remember that in your lifetime you received your good things, and Lazarus in like manner evil things; but now he is comforted here, and you are in anguish.'\"",
      "links": "",
      "comment": "The teaching mirrors Luke's theme of reversal (cf. Luke 1:52-53; 6:24–25). Earthly status does not guarantee eternal security; there is a call to charity and mercy."
    },
    {
      "pk": 216026,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 26,
      "text": "\"And besides all this, between us and you a great chasm has been set, so that those who would pass from here to you cannot, nor can anyone cross from there to us.'\"",
      "links": "",
      "comment": "The 'great chasm' indicates the unchangeable state following death. This is the basis for the doctrine of particular judgment and the finality of one’s ultimate destiny."
    },
    {
      "pk": 216027,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 27,
      "text": "\"And he said, 'Then I beg you, father, to send him to my father's house—'\"",
      "links": "",
      "comment": "The rich man’s continued concern for his family demonstrates lingering attachment and regret, but still no direct repentance."
    },
    {
      "pk": 216028,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 28,
      "text": "'for I have five brothers—that he may warn them, lest they also come into this place of torment.'",
      "links": "",
      "comment": "Intercession for his family underscores the seriousness of conversion in earthly life. The number 'five' may allude to the Torah or fullness within a household."
    },
    {
      "pk": 216029,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 29,
      "text": "\"But Abraham said, 'They have Moses and the Prophets; let them listen to them.'\"",
      "links": "<a href='/AIV/5/18/15-19'>Deut. 18:15-19</a>; <a href='/AIV/9/6/17'>2 Kings 6:17</a>",
      "comment": "This reply affirms the sufficiency and authority of Scripture for conversion. Hearing, believing, and obeying is the ordinary means God has given for salvation."
    },
    {
      "pk": 216030,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 30,
      "text": "\"And he said, 'No, father Abraham, but if someone goes to them from the dead, they will repent.'\"",
      "links": "",
      "comment": "The expectation of a miraculous sign is countered by emphasis on faith and obedience. Later, Jesus himself will rise from the dead, fulfilling this hope, yet many will not believe."
    },
    {
      "pk": 216031,
      "translation": "AIV",
      "book": 42,
      "chapter": 16,
      "verse": 31,
      "text": "\"He said to him, 'If they do not listen to Moses and the Prophets, neither will they be convinced if someone should rise from the dead.'\"",
      "links": "<a href='/AIV/40/28/11-15'>Matt. 28:11-15</a>; <a href='/AIV/43/11/43-53'>John 11:43-53</a>; <a href='/AIV/24/29/13'>Jer. 29:13</a>",
      "comment": "The climactic point is that faith is not only a matter of witnessing miracles, but of hearing and obeying God’s Word. Ultimately, Jesus' own resurrection will fulfill this, and the visible, authoritative community he will establish will bear witness across the ages."
    }
  ],
  "translatedAt": "2025-12-23T02:49:24.394Z"
}