{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 6,
  "verses": [
    {
      "pk": 5006001,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 1,
      "text": "One Sabbath, as Jesus was walking through the grainfields, his disciples picked some heads of grain, rubbed them in their hands, and ate them.",
      "links": "<a href='/AIV/5/23/25'>Deut. 23:25</a>; <a href='/AIV/41/2/23'>Mark 2:23</a>",
      "comment": "The allowance for plucking grain (Deut. 23:25) is shown in practice, emphasizing Jesus' approach to the Law, prioritizing human need."
    },
    {
      "pk": 5006002,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 2,
      "text": "But some of the Pharisees said, 'Why are you doing what is not lawful on the Sabbath?'",
      "links": "<a href='/AIV/2/20/10-11'>Ex. 20:10-11</a>; <a href='/AIV/24/17/21'>Jer. 17:21</a>",
      "comment": "Here, the Pharisees interpret Sabbath rules strictly, highlighting a contrast between legal observance and the spirit of the Law."
    },
    {
      "pk": 5006003,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 3,
      "text": "Jesus answered them, 'Have you not read what David did when he was hungry, he and those with him?'",
      "links": "<a href='/AIV/9/21/1-6'>1 Sam. 21:1-6</a>",
      "comment": "Jesus points to David's example, suggesting divine precedent for mercy over ritual."
    },
    {
      "pk": 5006004,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 4,
      "text": "He entered the house of God, took and ate the bread of the Presence, which is not lawful for any but the priests to eat, and gave it also to those with him.",
      "links": "<a href='/AIV/9/21/4-6'>1 Sam. 21:4-6</a>; <a href='/AIV/3/24/5-9'>Lev. 24:5-9</a>",
      "comment": "Jesus highlights Old Testament exceptions, signifying that God's mercy can supersede ritual law, foreshadowing the New Covenant."
    },
    {
      "pk": 5006005,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 5,
      "text": "And he said to them, 'The Son of Man is Lord of the Sabbath.'",
      "links": "<a href='/AIV/27/7/13-14'>Dan. 7:13-14</a>; <a href='/AIV/40/12/8'>Matt. 12:8</a>",
      "comment": "A bold claim of authority over divine law, implying Jesus' divinity (see Dan. 7:13-14), establishing his authority over the Law."
    },
    {
      "pk": 5006006,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 6,
      "text": "On another Sabbath, he entered the synagogue and was teaching. A man was there whose right hand was withered.",
      "links": "<a href='/AIV/41/3/1'>Mark 3:1</a>",
      "comment": "Luke gives the detail that it was the right hand, emphasizing the severity of the injury in ancient context."
    },
    {
      "pk": 5006007,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 7,
      "text": "The scribes and Pharisees watched him closely, to see if he would heal on the Sabbath, so that they might find a reason to accuse him.",
      "links": "<a href='/AIV/24/20/10'>Jer. 20:10</a>",
      "comment": "The leadership’s intent is to accuse, not learn. Jesus’ healing challenges their heart, not only their rules."
    },
    {
      "pk": 5006008,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 8,
      "text": "But he knew their thoughts and said to the man with the withered hand, 'Get up and stand here.' So he rose and stood there.",
      "links": "<a href='/AIV/40/9/4'>Matt. 9:4</a>",
      "comment": "Jesus' awareness of their hearts underscores his divine knowledge (cf. Matt. 9:4)."
    },
    {
      "pk": 5006009,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 9,
      "text": "Then Jesus said to them, 'I ask you, is it lawful to do good or to do harm on the Sabbath, to save life or to destroy it?'",
      "links": "<a href='/AIV/3/19/16'>Lev. 19:16</a>; <a href='/AIV/40/12/12'>Matt. 12:12</a>",
      "comment": "Jesus reframes the question: the Sabbath is meant for life and goodness, not simply rule-keeping."
    },
    {
      "pk": 5006010,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 10,
      "text": "After looking around at them all, he said to him, 'Stretch out your hand.' He did so, and his hand was restored.",
      "links": "<a href='/AIV/41/3/5'>Mark 3:5</a>",
      "comment": "A miraculous act that demonstrates Jesus’ divinity and compassion."
    },
    {
      "pk": 5006011,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 11,
      "text": "But they were filled with fury and discussed with one another what they might do to Jesus.",
      "links": "<a href='/AIV/19/2/1-2'>Ps. 2:1-2</a>",
      "comment": "Their hardened hearts fulfill the pattern of opposition to God’s anointed (Ps. 2:1-2)."
    },
    {
      "pk": 5006012,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 12,
      "text": "In those days, he went out to the mountain to pray, and spent the whole night in prayer to God.",
      "links": "<a href='/AIV/19/119/147-148'>Ps. 119:147-148</a>",
      "comment": "Luke emphasizes Jesus’ prayer life before important events – a model for sustained, intentional prayer."
    },
    {
      "pk": 5006013,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 13,
      "text": "When day came, he called his disciples and chose from them twelve, whom he also named apostles:",
      "links": "<a href='/AIV/19/105/26'>Ps. 105:26</a>; <a href='/AIV/40/10/2-4'>Matt. 10:2-4</a>",
      "comment": "The deliberate choice of twelve apostles parallels the twelve tribes of Israel, indicating restoration and leadership for the new covenant people."
    },
    {
      "pk": 5006014,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 14,
      "text": "Simon, whom he also named Peter, and Andrew his brother, James and John, Philip and Bartholomew,",
      "links": "<a href='/AIV/40/10/2'>Matt. 10:2</a>",
      "comment": "Simon is named first, a sign of his leadership; Peter is a foundational figure among the apostles."
    },
    {
      "pk": 5006015,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 15,
      "text": "Matthew and Thomas, James the son of Alphaeus, and Simon who was called the Zealot,",
      "links": "<a href='/AIV/40/10/3-4'>Matt. 10:3-4</a>",
      "comment": "The diverse backgrounds of the apostles underscore the missionary nature of the Church."
    },
    {
      "pk": 5006016,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 16,
      "text": "Judas the son of James, and Judas Iscariot, who became a traitor.",
      "links": "<a href='/AIV/40/10/4'>Matt. 10:4</a>",
      "comment": "Judas Iscariot’s betrayal is foreseen, emphasizing God’s sovereign plan."
    },
    {
      "pk": 5006017,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 17,
      "text": "And he came down with them and stood on a level place, with a large crowd of his disciples and a great multitude of people from all Judea and Jerusalem and the seacoast of Tyre and Sidon,",
      "links": "<a href='/AIV/23/42/4'>Isa. 42:4</a>",
      "comment": "The inclusion of Gentile regions hints at the universality of Jesus’ mission (see Isa. 42:4)."
    },
    {
      "pk": 5006018,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 18,
      "text": "who came to hear him and to be healed of their diseases. Those who were troubled with unclean spirits were cured.",
      "links": "<a href='/AIV/23/35/5-6'>Isa. 35:5-6</a>",
      "comment": "Jesus’ miracles fulfill messianic prophecy (cf. Isa. 35:5-6)."
    },
    {
      "pk": 5006019,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 19,
      "text": "And all the crowd sought to touch him, for power came out from him and healed them all.",
      "links": "<a href='/AIV/42/8/46'>Luke 8:46</a>",
      "comment": "Divine power emanates from Jesus, reinforcing his divinity and unique authority to heal."
    },
    {
      "pk": 5006020,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 20,
      "text": "And he lifted up his eyes on his disciples, and said, 'Blessed are you who are poor, for yours is the kingdom of God.'",
      "links": "<a href='/AIV/19/37/11'>Ps. 37:11</a>; <a href='/AIV/40/5/3'>Matt. 5:3</a>",
      "comment": "This echoes the Sermon on the Mount (Matt. 5), highlighting God’s favor upon the humble and needy."
    },
    {
      "pk": 5006021,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 21,
      "text": "'Blessed are you who are hungry now, for you will be satisfied. Blessed are you who weep now, for you will laugh.'",
      "links": "<a href='/AIV/19/126/5'>Ps. 126:5</a>; <a href='/AIV/23/61/2-3'>Isa. 61:2-3</a>",
      "comment": "The reversal motif indicates God's ultimate justice and fulfillment of Old Testament promises (see Isa. 61:2-3)."
    },
    {
      "pk": 5006022,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 22,
      "text": "'Blessed are you when people hate you and when they exclude you and revile you and spurn your name as evil on account of the Son of Man!'",
      "links": "<a href='/AIV/23/66/5'>Isa. 66:5</a>; <a href='/AIV/40/5/11'>Matt. 5:11</a>",
      "comment": "Persecution for Christ’s sake is predicted and honored, linking Old and New Testament prophetic fulfillment."
    },
    {
      "pk": 5006023,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 23,
      "text": "'Rejoice in that day, and leap for joy, for, behold, your reward is great in heaven; for so their fathers did to the prophets.'",
      "links": "<a href='/AIV/12/9/7'>2 Kings 9:7</a>; <a href='/AIV/19/58/10-11'>Ps. 58:10-11</a>",
      "comment": "Prophets in the Old Testament foreshadowed Christ’s rejected servants."
    },
    {
      "pk": 5006024,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 24,
      "text": "'But woe to you who are rich, for you have received your consolation.'",
      "links": "<a href='/AIV/30/6/1'>Amos 6:1</a>; <a href='/AIV/19/49/6-7'>Ps. 49:6-7</a>",
      "comment": "Worldly comfort can blind one to heavenly realities and ultimate need."
    },
    {
      "pk": 5006025,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 25,
      "text": "'Woe to you who are full now, for you will be hungry. Woe to you who laugh now, for you will mourn and weep.'",
      "links": "<a href='/AIV/20/14/13'>Prov. 14:13</a>",
      "comment": "This is a warning that a reversal awaits those who ignore God’s justice, echoing Old Testament wisdom."
    },
    {
      "pk": 5006026,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 26,
      "text": "'Woe to you, when all men speak well of you, for so their fathers did to the false prophets.'",
      "links": "<a href='/AIV/24/5/31'>Jer. 5:31</a>",
      "comment": "Popularity with the world is not always a sign of God’s favor, as seen with false prophets."
    },
    {
      "pk": 5006027,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 27,
      "text": "'But I say to you who hear, Love your enemies, do good to those who hate you,'",
      "links": "<a href='/AIV/3/19/18'>Lev. 19:18</a>; <a href='/AIV/40/5/44'>Matt. 5:44</a>",
      "comment": "Radical love fulfills the true spirit of the Law; Jesus amplifies Old Testament commands with new depth."
    },
    {
      "pk": 5006028,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 28,
      "text": "'Bless those who curse you, pray for those who abuse you.'",
      "links": "<a href='/AIV/19/35/11-14'>Ps. 35:11-14</a>",
      "comment": "Christ calls for supernatural love, going beyond justice to mercy."
    },
    {
      "pk": 5006029,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 29,
      "text": "'To one who strikes you on the cheek, offer the other also, and from one who takes away your cloak do not withhold your tunic either.'",
      "links": "<a href='/AIV/25/3/30'>Lam. 3:30</a>; <a href='/AIV/40/5/39-40'>Matt. 5:39-40</a>",
      "comment": "An ethic of self-sacrificial love, imitating Jesus himself in his Passion."
    },
    {
      "pk": 5006030,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 30,
      "text": "'Give to everyone who begs from you, and from one who takes away your goods do not demand them back.'",
      "links": "<a href='/AIV/5/15/7-8'>Deut. 15:7-8</a>",
      "comment": "Calls to radical generosity, reflecting God’s own generosity to us."
    },
    {
      "pk": 5006031,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 31,
      "text": "'And as you wish that others would do to you, do so to them.'",
      "links": "<a href='/AIV/3/19/18'>Lev. 19:18</a>; <a href='/AIV/40/7/12'>Matt. 7:12</a>",
      "comment": "The Golden Rule summarizes the Law and the Prophets, elevated in the New Covenant."
    },
    {
      "pk": 5006032,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 32,
      "text": "'If you love those who love you, what credit is that to you? For even sinners love those who love them.'",
      "links": "",
      "comment": "True love shines in loving the undeserving, modeling God’s love for sinners."
    },
    {
      "pk": 5006033,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 33,
      "text": "'And if you do good to those who do good to you, what credit is that to you? For even sinners do the same.'",
      "links": "",
      "comment": "Jesus raises the standard to selfless, Christ-like virtue rather than reciprocal benefit."
    },
    {
      "pk": 5006034,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 34,
      "text": "'And if you lend to those from whom you expect to receive, what credit is that to you? Even sinners lend to sinners, to get back an equal amount.'",
      "links": "",
      "comment": "Kingdom values call for generosity without expectation of repayment, reflecting grace."
    },
    {
      "pk": 5006035,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 35,
      "text": "'But love your enemies, and do good, and lend, expecting nothing in return, and your reward will be great, and you will be sons of the Most High, for he is kind to the ungrateful and the evil.'",
      "links": "<a href='/AIV/19/145/9'>Ps. 145:9</a>",
      "comment": "Imitating God’s perfect love is a sign of true sonship in the family of God."
    },
    {
      "pk": 5006036,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 36,
      "text": "'Be merciful, even as your Father is merciful.'",
      "links": "<a href='/AIV/19/103/8'>Ps. 103:8</a>",
      "comment": "The call to discipleship is to partake in God’s attributes; divine mercy is ultimate."
    },
    {
      "pk": 5006037,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 37,
      "text": "'Judge not, and you will not be judged; condemn not, and you will not be condemned; forgive, and you will be forgiven.'",
      "links": "<a href='/AIV/19/18/25'>Ps. 18:25</a>",
      "comment": "A call to merciful forgiveness reflects God’s own forgiveness, a basis for Church unity."
    },
    {
      "pk": 5006038,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 38,
      "text": "'Give, and it will be given to you. Good measure, pressed down, shaken together, running over, will be put into your lap. For with the measure you use it will be measured back to you.'",
      "links": "<a href='/AIV/19/41/1-3'>Ps. 41:1-3</a>",
      "comment": "Reciprocal generosity is a divine principle – serving as both justice and mercy."
    },
    {
      "pk": 5006039,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 39,
      "text": "He also told them a parable: 'Can a blind man lead a blind man? Will they not both fall into a pit?'",
      "links": "<a href='/AIV/23/56/10'>Isa. 56:10</a>; <a href='/AIV/40/15/14'>Matt. 15:14</a>",
      "comment": "Religious leaders need true spiritual vision, which comes through proper teaching authority."
    },
    {
      "pk": 5006040,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 40,
      "text": "'A disciple is not above his teacher, but everyone, once he is fully trained, will be like his teacher.'",
      "links": "<a href='/AIV/40/10/24'>Matt. 10:24-25</a>",
      "comment": "Christ is the ultimate model for discipleship; proper spiritual formation requires submission and imitation."
    },
    {
      "pk": 5006041,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 41,
      "text": "'Why do you see the speck that is in your brother’s eye, but do not notice the log that is in your own eye?'",
      "links": "<a href='/AIV/40/7/3'>Matt. 7:3</a>",
      "comment": "Exhortation to self-examination before correcting others—a key in pursuing personal holiness."
    },
    {
      "pk": 5006042,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 42,
      "text": "'How can you say to your brother, \"Brother, let me take out the speck that is in your eye,\" when you yourself do not see the log that is in your own eye? You hypocrite, first take the log out of your own eye, and then you will see clearly to take out the speck that is in your brother’s eye.'",
      "links": "<a href='/AIV/40/7/5'>Matt. 7:5</a>",
      "comment": "Self-reform must precede reform in others—a principle key to authentic Christian living."
    },
    {
      "pk": 5006043,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 43,
      "text": "'For no good tree bears bad fruit, nor again does a bad tree bear good fruit,'",
      "links": "<a href='/AIV/19/1/3'>Ps. 1:3</a>; <a href='/AIV/40/7/16'>Matt. 7:16</a>",
      "comment": "Good works flow from a renewed heart—outward deeds reveal inward reality."
    },
    {
      "pk": 5006044,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 44,
      "text": "'For each tree is known by its own fruit. Figs are not gathered from thornbushes, nor are grapes picked from a bramble bush.'",
      "links": "<a href='/AIV/23/5/1-7'>Isa. 5:1-7</a>",
      "comment": "Moral results show their true spiritual source; the fruit reveals the tree’s identity."
    },
    {
      "pk": 5006045,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 45,
      "text": "'The good person out of the good treasure of his heart produces good, and the evil person out of his evil treasure produces evil; for out of the abundance of the heart his mouth speaks.'",
      "links": "<a href='/AIV/20/4/23'>Prov. 4:23</a>",
      "comment": "Inner life shapes outward action; true change begins with the heart, a biblical motif fulfilled in Christ."
    },
    {
      "pk": 5006046,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 46,
      "text": "'Why do you call me \"Lord, Lord,\" and not do what I tell you?'",
      "links": "<a href='/AIV/40/7/21'>Matt. 7:21</a>",
      "comment": "Obedience—not mere words—marks true discipleship. Faith and works are inseparable in authentic Christian life."
    },
    {
      "pk": 5006047,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 47,
      "text": "'Everyone who comes to me and hears my words and does them, I will show you what he is like:'",
      "links": "<a href='/AIV/40/7/24'>Matt. 7:24</a>",
      "comment": "Hearing Jesus is not enough—practical obedience is essential for the Christian foundation."
    },
    {
      "pk": 5006048,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 48,
      "text": "'He is like a man building a house, who dug deep and laid the foundation on the rock. When a flood arose, the river broke against that house and could not shake it, because it was well built.'",
      "links": "<a href='/AIV/23/28/16'>Isa. 28:16</a>; <a href='/AIV/19/18/2'>Ps. 18:2</a>",
      "comment": "The image of the foundation on the rock draws on Old Testament images for God and his chosen foundation—fulfilled in Christ, and by extension, his apostles."
    },
    {
      "pk": 5006049,
      "translation": "AIV",
      "book": 3,
      "chapter": 6,
      "verse": 49,
      "text": "'But the one who hears and does not do them is like a man who built a house on the ground without a foundation. The river broke against it, and immediately it fell, and the ruin of that house was great.'",
      "links": "<a href='/AIV/40/7/26-27'>Matt. 7:26-27</a>",
      "comment": "Without obedience to Christ, no spiritual house can endure. The foundation is personal and communal—obedience includes adherence to apostolic teaching and practice."
    }
  ],
  "translatedAt": "2025-12-23T02:41:27.936Z"
}