{
  "book": 49,
  "bookName": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 5,
  "verses": [
    {
      "pk": 49005001,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 1,
      "text": "Now it happened, as the crowd pressed in on Him to hear the word of God, that He stood by the Lake of Gennesaret.",
      "links": "<a href='/AIV/43/6/1'>John 6:1</a>; <a href='/AIV/40/4/18'>Matt. 4:18</a>",
      "comment": "The Lake of Gennesaret is another name for the Sea of Galilee. The crowd's eagerness to hear Jesus suggests His unique authority as a teacher. The repeated title 'word of God' implies divinity and fulfillment of Old Testament prophecy (Deut. 18:18; Isa. 61:1–2)."
    },
    {
      "pk": 49005002,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 2,
      "text": "He saw two boats standing by the lake; but the fishermen had gone out of them and were washing their nets.",
      "links": "<a href='/AIV/40/4/21'>Matt. 4:21</a>; <a href='/AIV/41/1/19'>Mark 1:19</a>",
      "comment": "Washing nets was essential after fishing, showing their diligence and readiness. This sets the background for the miracle that will follow."
    },
    {
      "pk": 49005003,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 3,
      "text": "He got into one of the boats, which belonged to Simon, and asked him to put out a little from the shore. Then He sat down and taught the crowds from the boat.",
      "links": "<a href='/AIV/40/5/1-2'>Matt. 5:1-2</a>",
      "comment": "Rabbis commonly taught sitting, signifying authority. Jesus chooses Simon's boat, foreshadowing Simon’s future leadership role among the apostles (see Matt. 16:18; John 21:15-17)."
    },
    {
      "pk": 49005004,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 4,
      "text": "When He had finished speaking, He said to Simon, 'Launch out into the deep and let down your nets for a catch.'",
      "links": "<a href='/AIV/43/21/6'>John 21:6</a>",
      "comment": "Jesus’ command challenges Simon to trust His word over his own experience. This anticipates the apostles being 'fishers of men' (Luke 5:10; cf. Jer. 16:16)."
    },
    {
      "pk": 49005005,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 5,
      "text": "Simon answered, 'Master, we worked all night and caught nothing; but at Your word I will let down the nets.'",
      "links": "<a href='/AIV/19/33/9'>Ps. 33:9</a>",
      "comment": "Simon calls Jesus 'Master,' showing respect and willingness to obey divine instruction against worldly logic. This is a model of obedience to God's will."
    },
    {
      "pk": 49005006,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 6,
      "text": "When they had done this, they caught a great number of fish, and their nets were breaking.",
      "links": "<a href='/AIV/43/21/11'>John 21:11</a>",
      "comment": "The miraculous catch points to divine abundance. In biblical symbolism, fish often represent the Gentiles who will be brought into God’s people (Ezek. 47:9-10)."
    },
    {
      "pk": 49005007,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 7,
      "text": "So they signaled to their partners in the other boat to come and help them. They came and filled both boats so that they began to sink.",
      "links": "<a href='/AIV/40/13/47-50'>Matt. 13:47-50</a>",
      "comment": "The need for partners shows the communal nature of discipleship. The overflowing catch symbolizes the abundance and universality of the coming kingdom."
    },
    {
      "pk": 49005008,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 8,
      "text": "When Simon Peter saw it, he fell down at Jesus’ knees saying, 'Depart from me, for I am a sinful man, Lord.'",
      "links": "<a href='/AIV/23/6/5'>Isa. 6:5</a>; <a href='/AIV/42/18/13'>Luke 18:13</a>",
      "comment": "Peter addresses Jesus as 'Lord,' with a term used for God. His reaction recalls Isaiah’s response to God’s holiness (Isa. 6:5), recognizing Jesus’ divinity by his awe and unworthiness."
    },
    {
      "pk": 49005009,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 9,
      "text": "For he and all who were with him were astonished at the catch of fish they had taken;",
      "links": "",
      "comment": "The overwhelming miracle produces awe in all present—God’s power breaks into their ordinary lives."
    },
    {
      "pk": 49005010,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 10,
      "text": "and so were James and John, sons of Zebedee, who were partners with Simon. Then Jesus said to Simon, 'Do not be afraid; from now on you will be catching men.'",
      "links": "<a href='/AIV/19/51/13'>Ps. 51:13</a>; <a href='/AIV/24/16/16'>Jer. 16:16</a>",
      "comment": "Jesus’ command not to fear and His calling of Simon signify the beginning of apostolic mission. The phrase 'catching men' evokes prophetic imagery of Israel’s restoration and outreach to all nations (see Matt. 28:19)."
    },
    {
      "pk": 49005011,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 11,
      "text": "When they had brought their boats to land, they left everything and followed Him.",
      "links": "<a href='/AIV/40/19/27'>Matt. 19:27</a>; <a href='/AIV/42/18/28'>Luke 18:28</a>",
      "comment": "The disciples’ radical response models the true call to discipleship—abandoning worldly pursuits for total dedication to Christ, echoing Israel’s call to total covenant faithfulness."
    },
    {
      "pk": 49005012,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 12,
      "text": "While He was in one of the towns, there came a man covered with leprosy. When he saw Jesus, he fell on his face and begged Him, 'Lord, if You are willing, You can make me clean.'",
      "links": "<a href='/AIV/03/13/45-46'>Lev. 13:45-46</a>; <a href='/AIV/40/8/2'>Matt. 8:2</a>",
      "comment": "Lepers were outcasts under Mosaic Law (Lev. 13:45-46). The man’s faith in Jesus’ ability to cleanse points to Jesus’ unique holiness and power to restore."
    },
    {
      "pk": 49005013,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 13,
      "text": "Then Jesus stretched out His hand, touched him, and said, 'I am willing. Be clean.' Immediately the leprosy left him.",
      "links": "<a href='/AIV/04/12/13-15'>Num. 12:13-15</a>; <a href='/AIV/40/8/3'>Matt. 8:3</a>",
      "comment": "Touching a leper would normally defile a person, but Jesus’ holiness overcomes impurity. His word alone is effective, attesting to His divinity."
    },
    {
      "pk": 49005014,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 14,
      "text": "He ordered him to tell no one, 'But go and show yourself to the priest, and offer for your cleansing what Moses commanded, as a testimony to them.'",
      "links": "<a href='/AIV/03/14/2-32'>Lev. 14:2-32</a>; <a href='/AIV/40/8/4'>Matt. 8:4</a>",
      "comment": "Jesus upholds the Law of Moses, sending the healed man to the priests. This affirms the legitimacy of priestly authority and ongoing religious tradition, signifying that Jesus fulfills and does not abolish the law (Matt. 5:17)."
    },
    {
      "pk": 49005015,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 15,
      "text": "But news about Him spread even more, and large crowds came together to hear Him and to be healed of their illnesses.",
      "links": "<a href='/AIV/40/4/24'>Matt. 4:24</a>",
      "comment": "Jesus’ fame grows through both His teaching and miraculous healings, highlighting both word and deed in His messianic mission."
    },
    {
      "pk": 49005016,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 16,
      "text": "But He withdrew to deserted places and prayed.",
      "links": "<a href='/AIV/19/55/17'>Ps. 55:17</a>; <a href='/AIV/42/6/12'>Luke 6:12</a>",
      "comment": "Jesus’ regular prayer shows the importance of solitude and communion with the Father, setting an enduring example for all believers and for leaders of the faith."
    },
    {
      "pk": 49005017,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 17,
      "text": "One day, as He was teaching, Pharisees and teachers of the law were sitting there, who had come from every village of Galilee, Judea, and Jerusalem. And the power of the Lord was with Him to heal.",
      "links": "<a href='/AIV/42/4/32'>Luke 4:32</a>",
      "comment": "Jesus teaches with divine authority and power. The presence of religious leaders from all regions sets the stage for conflict and the manifestation of Jesus' heavenly mandate."
    },
    {
      "pk": 49005018,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 18,
      "text": "And behold, men brought on a mattress a man who was paralyzed. They tried to bring him in and lay him before Jesus.",
      "links": "<a href='/AIV/40/9/2'>Matt. 9:2</a>; <a href='/AIV/41/2/3'>Mark 2:3</a>",
      "comment": "The faith of the friends stands out here; community intercedes for the individual. This is an example of vicarious faith—believers carrying each other to Christ."
    },
    {
      "pk": 49005019,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 19,
      "text": "But not finding how they could bring him in because of the crowd, they went up on the roof and lowered him with his mattress into the middle before Jesus.",
      "links": "<a href='/AIV/23/57/14'>Isa. 57:14</a>",
      "comment": "Their bold effort to break through barriers is a powerful image for perseverance in seeking God’s grace. It prefigures the church’s mission to break down obstacles to faith."
    },
    {
      "pk": 49005020,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 20,
      "text": "When He saw their faith, He said, 'Man, your sins are forgiven you.'",
      "links": "<a href='/AIV/19/32/5'>Ps. 32:5</a>; <a href='/AIV/23/43/25'>Isa. 43:25</a>",
      "comment": "Jesus claims the authority to forgive sins, a divine prerogative (see Mark 2:7). This pronouncement signals Jesus’ divinity and sets the pattern for the sacramental forgiveness of sins by divine authority."
    },
    {
      "pk": 49005021,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 21,
      "text": "The scribes and the Pharisees began reasoning, saying, 'Who is this who speaks blasphemies? Who can forgive sins but God alone?'",
      "links": "<a href='/AIV/19/130/4'>Ps. 130:4</a>; <a href='/AIV/23/43/25'>Isa. 43:25</a>",
      "comment": "The religious leaders recognize that forgiving sins is God’s privilege alone. Their accusation of blasphemy reveals the high Christology of Luke’s Jesus—He acts as only God can."
    },
    {
      "pk": 49005022,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 22,
      "text": "But Jesus, perceiving their thoughts, answered them, 'Why are you reasoning in your hearts?'",
      "links": "<a href='/AIV/09/16/7'>1 Sam. 16:7</a>",
      "comment": "Jesus’ ability to know their hearts reveals supernatural knowledge, further showing His divine nature (see Jer. 17:10)."
    },
    {
      "pk": 49005023,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 23,
      "text": "'Which is easier, to say, ",
      "links": "<a href='/AIV/40/9/5'>Matt. 9:5</a>",
      "comment": "Jesus’ rhetorical question contrasts speaking forgiveness with actually healing, challenging the skeptics to acknowledge His authority."
    },
    {
      "pk": 49005024,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 24,
      "text": "But that you may know that the Son of Man has authority on earth to forgive sins'—He said to the paralyzed man, 'I say to you, rise, pick up your mattress, and go to your house.'",
      "links": "<a href='/AIV/27/7/13-14'>Dan. 7:13-14</a>; <a href='/AIV/40/9/6'>Matt. 9:6</a>",
      "comment": "The title 'Son of Man' alludes to Daniel 7:13–14, indicating both authority and divinity. This is a big claim to divine authority to act on earth, connecting His miracles with His mission to forgive and heal."
    },
    {
      "pk": 49005025,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 25,
      "text": "Immediately he got up before them, took up what he had been lying on, and went to his house, glorifying God.",
      "links": "<a href='/AIV/19/103/2-5'>Ps. 103:2-5</a>",
      "comment": "The instantaneous healing visibly substantiates Jesus’ authority. The healed man’s response is a model for giving glory to God after receiving grace."
    },
    {
      "pk": 49005026,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 26,
      "text": "Amazement seized them all, and they glorified God. They were filled with awe, saying, 'We have seen extraordinary things today.'",
      "links": "<a href='/AIV/19/118/23'>Ps. 118:23</a>",
      "comment": "The people recognize God’s power in their midst. The response shows communal worship as an immediate outpouring after God’s works."
    },
    {
      "pk": 49005027,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 27,
      "text": "After this He went out and saw a tax collector named Levi sitting at the tax booth, and He said to him, 'Follow Me.'",
      "links": "<a href='/AIV/40/9/9'>Matt. 9:9</a>",
      "comment": "Levi (Matthew) would have been despised as a collaborator with Rome. Jesus’ call shows the inclusivity of His kingdom and authority to transform lives through relationship."
    },
    {
      "pk": 49005028,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 28,
      "text": "He left everything, got up, and followed Him.",
      "links": "<a href='/AIV/42/18/22'>Luke 18:22</a>",
      "comment": "Levi’s immediate and total response echoes that of Peter and his companions. This radical call to discipleship remains foundational for the apostolic community."
    },
    {
      "pk": 49005029,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 29,
      "text": "Then Levi made Him a great feast in his house. And there was a large crowd of tax collectors and others dining with them.",
      "links": "<a href='/AIV/42/15/2'>Luke 15:2</a>",
      "comment": "Table fellowship signified acceptance and forgiveness. Jesus’ willingness to dine with sinners anticipates the Eucharistic fellowship at the heart of the community of faith."
    },
    {
      "pk": 49005030,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 30,
      "text": "But the Pharisees and their scribes complained to His disciples, saying, 'Why do you eat and drink with tax collectors and sinners?'",
      "links": "<a href='/AIV/19/1/1'>Ps. 1:1</a>; <a href='/AIV/42/7/34'>Luke 7:34</a>",
      "comment": "The religious leaders’ objection shows their misunderstanding of holiness and mercy. Jesus’ welcoming love reveals the new order being established through Him."
    },
    {
      "pk": 49005031,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 31,
      "text": "Jesus answered them, 'Those who are well have no need of a physician, but those who are sick.'",
      "links": "<a href='/AIV/40/9/12'>Matt. 9:12</a>",
      "comment": "Jesus likens Himself to a physician, emphasizing the need for spiritual healing and acknowledging human brokenness—a fundamental reason for His ministry."
    },
    {
      "pk": 49005032,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 32,
      "text": "I have not come to call the righteous, but sinners to repentance.'",
      "links": "<a href='/AIV/26/18/32'>Ezek. 18:32</a>; <a href='/AIV/40/9/13'>Matt. 9:13</a>",
      "comment": "Jesus states His mission—to call sinners to repentance. This shows God’s initiative in salvation, not human striving, and the necessity of repentance as the gateway to reconciliation with God."
    },
    {
      "pk": 49005033,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 33,
      "text": "They said to Him, 'Why do the disciples of John fast often and offer prayers, and likewise those of the Pharisees, but Yours eat and drink?'",
      "links": "<a href='/AIV/40/9/14'>Matt. 9:14</a>",
      "comment": "Fasting was a traditional act of piety. The question challenges Jesus’ interpretation of spiritual practices, showing the tension between the old and the new."
    },
    {
      "pk": 49005034,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 34,
      "text": "Jesus replied, 'Can you make the wedding guests fast while the bridegroom is with them?'",
      "links": "<a href='/AIV/23/62/5'>Isa. 62:5</a>; <a href='/AIV/40/9/15'>Matt. 9:15</a>",
      "comment": "Jesus calls Himself the bridegroom, tying Himself to God’s own self-description as Israel’s husband. This veiled reference further indicates Christ’s divinity and fulfills prophetic imagery of the coming age of salvation."
    },
    {
      "pk": 49005035,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 35,
      "text": "'But the days will come when the bridegroom is taken away from them, then in those days they will fast.'",
      "links": "<a href='/AIV/23/53/8'>Isa. 53:8</a>",
      "comment": "Jesus prophesies His own suffering, death, and departure. Afterward, fasting becomes a means for the community to mourn and await His return—a practice kept by the faithful through the ages."
    },
    {
      "pk": 49005036,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 36,
      "text": "He also told them a parable: 'No one tears a piece of cloth from a new garment to patch an old one. Otherwise, he will tear the new, and the patch from the new will not match the old.'",
      "links": "<a href='/AIV/40/9/16'>Matt. 9:16</a>",
      "comment": "The newness Jesus brings cannot simply be added onto old religious systems. This parable subtly affirms the need for a complete transformation—continued adherence to old ways cannot contain the fullness of the Gospel."
    },
    {
      "pk": 49005037,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 37,
      "text": "And no one pours new wine into old wineskins. Otherwise, the new wine will burst the skins, it will be spilled, and the skins will be ruined.",
      "links": "<a href='/AIV/40/9/17'>Matt. 9:17</a>",
      "comment": "The metaphor of new wine and wineskins expresses the incompatibility of the new covenant with old structures—new life in the Spirit needs a new form of community and worship."
    },
    {
      "pk": 49005038,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 38,
      "text": "But new wine must be put into fresh wineskins.",
      "links": "<a href='/AIV/24/31/31'>Jer. 31:31</a>",
      "comment": "Jesus signals a new covenant, prepared for and anticipated by the prophets. The implication is a dynamic and living tradition receptive to the Spirit’s work."
    },
    {
      "pk": 49005039,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 5,
      "verse": 39,
      "text": "And no one after drinking old wine desires new, for he says, ‘The old is good.’",
      "links": "<a href='/AIV/24/6/16'>Jer. 6:16</a>",
      "comment": "This closing note gently critiques those who prefer established traditions and resist new revelation. Yet, ‘the old is good’ suggests continuity and respect for what came before—hinting that the new way does not reject the old, but fulfills and raises it to a greater level within God’s plan."
    }
  ],
  "translatedAt": "2025-12-24T10:40:04.418Z"
}