{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 3,
  "verses": [
    {
      "pk": 4303801,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 1,
      "text": "In the fifteenth year of the reign of Tiberius Caesar—when Pontius Pilate was governor of Judea, Herod was tetrarch of Galilee, his brother Philip was tetrarch of the region of Ituraea and Trachonitis, and Lysanias was tetrarch of Abilene—",
      "links": "<a href='/AIV/40/14/1'>Matt. 14:1</a>; <a href='/AIV/41/6/14'>Mark 6:14</a>",
      "comment": "Luke carefully sets the historical context, grounding the events in specific time and place, affirming the reliability of the Gospel story."
    },
    {
      "pk": 4303802,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 2,
      "text": "during the high priesthood of Annas and Caiaphas, the word of God came to John, the son of Zechariah, in the wilderness.",
      "links": "<a href='/AIV/43/1/6'>John 1:6</a>; <a href='/AIV/42/1/80'>Luke 1:80</a>",
      "comment": "John receives his divine commission in the wilderness, outside the temple system, indicating a prophetic calling."
    },
    {
      "pk": 4303803,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 3,
      "text": "He went into all the region around the Jordan, proclaiming a baptism of repentance for the forgiveness of sins.",
      "links": "<a href='/AIV/41/1/4'>Mark 1:4</a>; <a href='/AIV/40/3/2'>Matt. 3:2</a>",
      "comment": "John’s baptism anticipates reconciliation with God. Repentance here includes a turning of heart, not only outward actions."
    },
    {
      "pk": 4303804,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 4,
      "text": "As it is written in the book of the words of Isaiah the prophet: 'The voice of one calling in the wilderness: Prepare the way of the Lord, make his paths straight.'",
      "links": "<a href='/AIV/23/40/3'>Isa. 40:3</a>; <a href='/AIV/43/1/23'>John 1:23</a>",
      "comment": "Luke explicitly connects John’s ministry to prophecy, confirming Jesus as the anticipated Lord."
    },
    {
      "pk": 4303805,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 5,
      "text": "Every valley will be filled, and every mountain and hill will be made low; the crooked will become straight, and the rough ways smooth;",
      "links": "<a href='/AIV/23/40/4'>Isa. 40:4</a>",
      "comment": "Isaiah’s imagery signifies radical transformation—symbolic of the spiritual preparation for Christ."
    },
    {
      "pk": 4303806,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 6,
      "text": "and all flesh will see the salvation of God.",
      "links": "<a href='/AIV/23/40/5'>Isa. 40:5</a>; <a href='/AIV/42/2/30'>Luke 2:30</a>",
      "comment": "Salvation is universal in scope, echoing that Christ’s work is for all people."
    },
    {
      "pk": 4303807,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 7,
      "text": "So John said to the crowds coming out to be baptized by him, 'You offspring of vipers! Who warned you to flee from the coming wrath?'",
      "links": "<a href='/AIV/40/3/7'>Matt. 3:7</a>",
      "comment": "John’s rebuke is sharp, challenging the sincerity of repentance among those present."
    },
    {
      "pk": 4303808,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 8,
      "text": "Bear fruits worthy of repentance. Do not begin to say to yourselves, ‘We have Abraham as our father.’ For I tell you, God is able from these stones to raise up children for Abraham.",
      "links": "<a href='/AIV/40/3/9'>Matt. 3:9</a>",
      "comment": "Spiritual heritage must be accompanied by real change; mere ancestry is not enough."
    },
    {
      "pk": 4303809,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 9,
      "text": "Even now the axe is laid to the root of the trees. Every tree therefore that does not bear good fruit is cut down and thrown into the fire.",
      "links": "<a href='/AIV/40/7/19'>Matt. 7:19</a>",
      "comment": "Judgment is imminent; fruitfulness—living faith—will mark true repentance."
    },
    {
      "pk": 4303810,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 10,
      "text": "And the crowds asked him, 'What then should we do?'",
      "links": "<a href='/AIV/44/2/37'>Acts 2:37</a>",
      "comment": "Prompted by conviction, the crowd seeks practical application—a sign of authentic spiritual openness."
    },
    {
      "pk": 4303811,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 11,
      "text": "He answered, 'Whoever has two tunics should share with the one who has none, and whoever has food should do likewise.'",
      "links": "<a href='/AIV/40/25/35'>Matt. 25:35</a>; <a href='/AIV/59/2/15'>James 2:15</a>",
      "comment": "John emphasizes acts of charity. Genuine repentance expresses itself through works of mercy."
    },
    {
      "pk": 4303812,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 12,
      "text": "Tax collectors also came to be baptized and asked him, 'Teacher, what should we do?'",
      "links": "<a href='/AIV/19/51/13'>Ps. 51:13</a>",
      "comment": "Even those considered outcasts seek transformation, foreshadowing the expansive reach of the Gospel."
    },
    {
      "pk": 4303813,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 13,
      "text": "He said to them, 'Collect no more than you are authorized to.'",
      "links": "<a href='/AIV/18/27/13'>Job 27:13</a>",
      "comment": "Honest dealings are demanded, underscoring the practical morality of repentance."
    },
    {
      "pk": 4303814,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 14,
      "text": "Soldiers also asked him, 'And what about us, what should we do?' And he said to them, 'Do not extort money from anyone by force or false accusation, and be content with your wages.'",
      "links": "<a href='/AIV/58/13/5'>Heb. 13:5</a>",
      "comment": "Integrity in authority and contentment with provision are marks of the life God desires."
    },
    {
      "pk": 4303815,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 15,
      "text": "As the people were filled with expectation and all were wondering in their hearts about John—whether he might be the Christ—",
      "links": "<a href='/AIV/43/1/19-20'>John 1:19-20</a>",
      "comment": "Messianic expectation is high; the people are searching for God’s promised deliverance."
    },
    {
      "pk": 4303816,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 16,
      "text": "John answered them all, saying, 'I baptize you with water. But one mightier than I is coming, the straps of whose sandals I am not worthy to untie. He will baptize you with the Holy Spirit and fire.'",
      "links": "<a href='/AIV/40/3/11'>Matt. 3:11</a>; <a href='/AIV/44/1/5'>Acts 1:5</a>",
      "comment": "John distinguishes his preparatory ministry from Christ’s. Baptism with the Spirit anticipates powerful sacramental grace."
    },
    {
      "pk": 4303817,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 17,
      "text": "His winnowing fork is in his hand to clear his threshing floor and to gather the wheat into his barn, but the chaff he will burn with unquenchable fire.",
      "links": "<a href='/AIV/40/13/30'>Matt. 13:30</a>; <a href='/AIV/40/25/41'>Matt. 25:41</a>",
      "comment": "Christ’s coming brings both mercy and judgment, a final sorting of the righteous and the unrighteous."
    },
    {
      "pk": 4303818,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 18,
      "text": "So with many other exhortations he preached the good news to the people.",
      "links": "<a href='/AIV/40/4/23'>Matt. 4:23</a>",
      "comment": "John’s ministry ultimately prepares people for the Gospel of Jesus."
    },
    {
      "pk": 4303819,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 19,
      "text": "But Herod the tetrarch, who was rebuked by John because of Herodias, his brother’s wife, and because of all the evil things Herod had done,",
      "links": "<a href='/AIV/40/14/3'>Matt. 14:3</a>",
      "comment": "John’s prophetic ministry includes moral confrontation with the authorities."
    },
    {
      "pk": 4303820,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 20,
      "text": "added to all this by locking John up in prison.",
      "links": "<a href='/AIV/41/6/17'>Mark 6:17</a>",
      "comment": "John’s faithfulness leads to suffering—a pattern seen in prophetic witness throughout Scripture."
    },
    {
      "pk": 4303821,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 21,
      "text": "When all the people were baptized, Jesus also was baptized, and while he was praying, heaven was opened,",
      "links": "<a href='/AIV/40/3/16'>Matt. 3:16</a>; <a href='/AIV/43/1/32'>John 1:32</a>",
      "comment": "Jesus, though sinless, undergoes baptism to fully identify with humanity and inaugurate His public ministry."
    },
    {
      "pk": 4303822,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 22,
      "text": "and the Holy Spirit descended upon him in bodily form like a dove, and a voice came from heaven: 'You are my beloved Son; with you I am well pleased.'",
      "links": "<a href='/AIV/19/2/7'>Ps. 2:7</a>; <a href='/AIV/23/42/1'>Isa. 42:1</a>; <a href='/AIV/40/3/17'>Matt. 3:17</a>",
      "comment": "All three persons of the Trinity are revealed. The Father’s pronouncement affirms Jesus’ divine identity—Sonship and mission."
    },
    {
      "pk": 4303823,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 23,
      "text": "Now Jesus, when he began his ministry, was about thirty years old, being the son, as it was supposed, of Joseph, the son of Heli,",
      "links": "<a href='/AIV/40/1/16'>Matt. 1:16</a>",
      "comment": "Luke traces Jesus’ genealogy through Joseph, emphasizing both historical reality and fulfillment of prophecy."
    },
    {
      "pk": 4303824,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 24,
      "text": "the son of Matthat, the son of Levi, the son of Melchi, the son of Jannai, the son of Joseph,",
      "links": "<a href='/AIV/40/1/15'>Matt. 1:15</a>",
      "comment": "Luke’s genealogy differs in names from Matthew’s, highlighting theology over strict biological descent."
    },
    {
      "pk": 4303825,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 25,
      "text": "the son of Mattathias, the son of Amos, the son of Nahum, the son of Esli, the son of Naggai,",
      "links": "",
      "comment": "Several of these names are unique to Luke’s genealogy, reflecting the evangelist’s distinct sources."
    },
    {
      "pk": 4303826,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 26,
      "text": "the son of Maath, the son of Mattathias, the son of Semein, the son of Josech, the son of Joda,",
      "links": "",
      "comment": "This segment continues the tracing of Jesus’ family line back through obscure ancestors."
    },
    {
      "pk": 4303827,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 27,
      "text": "the son of Joanan, the son of Rhesa, the son of Zerubbabel, the son of Shealtiel, the son of Neri,",
      "links": "<a href='/AIV/13/3/19'>1 Chr. 3:19</a>; <a href='/AIV/15/2/2'>Ezra 2:2</a>",
      "comment": "Zerubbabel connects Jesus to the Davidic dynasty and the restoration after exile."
    },
    {
      "pk": 4303828,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 28,
      "text": "the son of Melchi, the son of Addi, the son of Cosam, the son of Elmadam, the son of Er,",
      "links": "",
      "comment": "Ancestors listed from the return from exile to the time of Jesus highlight continuity of God’s plan."
    },
    {
      "pk": 4303829,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 29,
      "text": "the son of Joshua, the son of Eliezer, the son of Jorim, the son of Matthat, the son of Levi,",
      "links": "",
      "comment": "Luke’s genealogy uses lesser-known figures to build an unbroken line."
    },
    {
      "pk": 4303830,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 30,
      "text": "the son of Simeon, the son of Judah, the son of Joseph, the son of Jonan, the son of Eliakim,",
      "links": "",
      "comment": "Each generation maintains continuity from Abraham through David to Christ."
    },
    {
      "pk": 4303831,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 31,
      "text": "the son of Melea, the son of Menna, the son of Mattatha, the son of Nathan, the son of David,",
      "links": "<a href='/AIV/10/5/14'>2 Sam. 5:14</a>; <a href='/AIV/40/1/6'>Matt. 1:6</a>",
      "comment": "Nathan, David’s son, is the line taken by Luke; Matthew traces through Solomon. Both lines converge in Jesus—fulfilling messianic prophecy."
    },
    {
      "pk": 4303832,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 32,
      "text": "the son of Jesse, the son of Obed, the son of Boaz, the son of Salmon, the son of Nahshon,",
      "links": "<a href='/AIV/08/4/17-22'>Ruth 4:17-22</a>; <a href='/AIV/13/2/10-12'>1 Chr. 2:10-12</a>",
      "comment": "Jesus’ ancestry passes through the kings and heroes of Israel’s history—affirming royal lineage."
    },
    {
      "pk": 4303833,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 33,
      "text": "the son of Amminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah,",
      "links": "<a href='/AIV/01/38/29'>Gen. 38:29</a>; <a href='/AIV/13/2/4-5'>1 Chr. 2:4-5</a>",
      "comment": "Luke’s genealogy differs slightly in names from Matthew, highlighting theology and transmission."
    },
    {
      "pk": 4303834,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 34,
      "text": "the son of Jacob, the son of Isaac, the son of Abraham, the son of Terah, the son of Nahor,",
      "links": "<a href='/AIV/01/35/10-12'>Gen. 35:10-12</a>",
      "comment": "God’s covenant promises to Abraham are fulfilled in Jesus—He is heir of the blessing to all nations."
    },
    {
      "pk": 4303835,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 35,
      "text": "the son of Serug, the son of Reu, the son of Peleg, the son of Eber, the son of Shelah,",
      "links": "<a href='/AIV/01/11/18-22'>Gen. 11:18-22</a>",
      "comment": "Christ’s genealogy links Him with all post-Flood humanity, underlining His universal significance."
    },
    {
      "pk": 4303836,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 36,
      "text": "the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech,",
      "links": "<a href='/AIV/01/05/28-32'>Gen. 5:28-32</a>; <a href='/AIV/01/10/21-24'>Gen. 10:21-24</a>",
      "comment": "All post-Flood lines converge in Christ, indicating redemption for all descendants of Noah."
    },
    {
      "pk": 4303837,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 37,
      "text": "the son of Methuselah, the son of Enoch, the son of Jared, the son of Mahalalel, the son of Cainan,",
      "links": "<a href='/AIV/01/05/18-24'>Gen. 5:18-24</a>",
      "comment": "Prominent pre-Flood ancestors are included, showing Jesus as the fulfillment of primeval hope."
    },
    {
      "pk": 4303838,
      "translation": "AIV",
      "book": 42,
      "chapter": 3,
      "verse": 38,
      "text": "the son of Enos, the son of Seth, the son of Adam, the son of God.",
      "links": "<a href='/AIV/01/05/6-8'>Gen. 5:6-8</a>; <a href='/AIV/01/04/25'>Gen. 4:25</a>",
      "comment": "By ending with 'Adam, the son of God,' Luke links Jesus not only to Israel, but to all mankind. Christ is the new Adam, the divine Son who restores fallen humanity—emphasizing both His divinity and universal mediation. See <a href='/AIV/45/5/14-21'>Rom. 5:14-21</a> for Paul’s interpretation of Jesus as the new Adam."
    }
  ],
  "translatedAt": "2025-12-23T02:39:02.911Z"
}