{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 4,
  "verses": [
    {
      "pk": 4000401,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 1,
      "text": "Jesus, full of the Holy Spirit, returned from the Jordan and was led by the Spirit in the wilderness",
      "links": "<a href='/AIV/2/3/2'>Ex. 3:2</a>; <a href='/AIV/42/3/21-22'>Luke 3:21–22</a>",
      "comment": "Jesus, being filled with the Spirit after His baptism, enters the desert, recalling the Exodus motif of God’s people being tested in the wilderness."
    },
    {
      "pk": 4000402,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 2,
      "text": "for forty days, being tempted by the devil. He ate nothing during those days, and when they ended, He was hungry.",
      "links": "<a href='/AIV/2/34/28'>Ex. 34:28</a>; <a href='/AIV/40/4/2'>Matt. 4:2</a>",
      "comment": "The forty days reflect Israel’s forty years in the wilderness (Num. 14:33). Jesus, the New Israel, succeeds where old Israel failed."
    },
    {
      "pk": 4000403,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 3,
      "text": "The devil said to Him, 'If You are the Son of God, command this stone to become bread.'",
      "links": "<a href='/AIV/2/16/3'>Ex. 16:3</a>",
      "comment": "The devil challenges Jesus’ identity as Son of God, echoing the temptation in Eden and Israel’s complaints for bread in the desert."
    },
    {
      "pk": 4000404,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 4,
      "text": "But Jesus answered him, 'It is written, \"Man shall not live by bread alone.\"'",
      "links": "<a href='/AIV/5/8/3'>Deut. 8:3</a>",
      "comment": "Jesus quotes Deuteronomy, showing reliance on God’s word. His obedience fulfills the pattern set by Israel’s trials."
    },
    {
      "pk": 4000405,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 5,
      "text": "The devil led Him up and showed Him all the kingdoms of the world in a moment of time.",
      "links": "<a href='/AIV/19/2/8'>Ps. 2:8</a>",
      "comment": "This temptation targets Jesus’ kingship; Psalm 2 prophesies the Messiah as inheritor of the nations."
    },
    {
      "pk": 4000406,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 6,
      "text": "And the devil said to Him, 'To You I will give all this authority and their glory, for it has been handed over to me, and I can give it to anyone I please.'",
      "links": "<a href='/AIV/19/24/1'>Ps. 24:1</a>",
      "comment": "Satan’s claim is a half-truth; ultimate authority belongs to God. The offer is to gain the kingdom without the cross."
    },
    {
      "pk": 4000407,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 7,
      "text": "If then You will worship me, all will be Yours.'",
      "links": "<a href='/AIV/2/20/3'>Ex. 20:3</a>",
      "comment": "This temptation is for idolatry. While the enemy offers earthly glory, true glory is fidelity to God."
    },
    {
      "pk": 4000408,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 8,
      "text": "And Jesus answered, 'It is written, \"You shall worship the Lord your God, and Him only shall you serve.\"'",
      "links": "<a href='/AIV/5/6/13'>Deut. 6:13</a>",
      "comment": "Jesus rejects the shortcut to power, affirming exclusive worship of God. By quoting Scripture, Jesus models obedience."
    },
    {
      "pk": 4000409,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 9,
      "text": "Then he took Him to Jerusalem, set Him on the pinnacle of the temple, and said to Him, 'If You are the Son of God, throw Yourself down from here,'",
      "links": "<a href='/AIV/19/91/11-12'>Ps. 91:11–12</a>",
      "comment": "The temple was the sacred center for Israel; this challenge tests Jesus’ relationship with God, the Father."
    },
    {
      "pk": 4000410,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 10,
      "text": "for it is written, \"He will command His angels concerning you, to guard you,\"",
      "links": "<a href='/AIV/19/91/11'>Ps. 91:11</a>",
      "comment": "The devil misuses Scripture, twisting a messianic promise about God’s care into a temptation to presumption."
    },
    {
      "pk": 4000411,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 11,
      "text": "\"and on their hands they will bear you up, lest you strike your foot against a stone.\"",
      "links": "<a href='/AIV/19/91/12'>Ps. 91:12</a>",
      "comment": "The passage is about God’s faithfulness, not testing Him. Jesus will show later that true faith trusts, it does not test."
    },
    {
      "pk": 4000412,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 12,
      "text": "And Jesus answered, 'It is said, \"You shall not put the Lord your God to the test.\"'",
      "links": "<a href='/AIV/5/6/16'>Deut. 6:16</a>",
      "comment": "Again quoting Deuteronomy, Jesus identifies Himself with faithful Israel. Notice Jesus resists the devil by rightly interpreting Scripture."
    },
    {
      "pk": 4000413,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 13,
      "text": "And when the devil had ended every temptation, he departed from Him until an opportune time.",
      "links": "<a href='/AIV/22/10/19'>Wis. 2:18'>Wis. 2:18</a>",
      "comment": "The devil’s withdrawal is temporary; the great test will return at Gethsemane (Luke 22:53). Jesus’ victory here foreshadows His victory on the cross."
    },
    {
      "pk": 4000414,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 14,
      "text": "And Jesus returned in the power of the Spirit to Galilee, and a report about Him went out through all the surrounding country.",
      "links": "<a href='/AIV/23/9/1'>Isa. 9:1</a>",
      "comment": "Jesus’ ministry begins in Galilee, fulfilling prophecy that the light would come to this region first."
    },
    {
      "pk": 4000415,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 15,
      "text": "And He taught in their synagogues, being glorified by all.",
      "links": "<a href='/AIV/19/22/22'>Ps. 22:22</a>",
      "comment": "Jesus is the authoritative teacher, drawing crowds; this theme continues through the Gospels."
    },
    {
      "pk": 4000416,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 16,
      "text": "And He came to Nazareth, where He had been brought up. As was His custom, He went into the synagogue on the Sabbath day, and He stood up to read.",
      "links": "<a href='/AIV/23/61/1'>Isa. 61:1</a>",
      "comment": "Jesus regularly participated in corporate worship, setting a model for gathering as believers."
    },
    {
      "pk": 4000417,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 17,
      "text": "And the scroll of the prophet Isaiah was handed to Him. He unrolled the scroll and found the place where it was written:",
      "links": "<a href='/AIV/23/61/1-2'>Isa. 61:1–2</a>",
      "comment": "Jesus intentionally chooses this passage, revealing His self-understanding as the promised Messiah."
    },
    {
      "pk": 4000418,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 18,
      "text": "\"The Spirit of the Lord is upon Me, because He has anointed Me to proclaim good news to the poor. He has sent Me to announce liberty to the captives and recovery of sight to the blind, to set at liberty those who are oppressed,",
      "links": "<a href='/AIV/23/61/1'>Isa. 61:1</a>; <a href='/AIV/29/2/28'>Joel 2:28</a>",
      "comment": "Jesus claims the Spirit’s anointing, fulfilling the rôle of the Messiah. This also foreshadows the sacramental means of healing and liberation He will employ."
    },
    {
      "pk": 4000419,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 19,
      "text": "\"to proclaim the acceptable year of the Lord.\"",
      "links": "<a href='/AIV/23/61/2'>Isa. 61:2</a>; <a href='/AIV/3/25/10'>Lev. 25:10</a>",
      "comment": "The \"year of the Lord's favor\" references Jubilee, a time of deliverance and restoration, now fulfilled in Christ."
    },
    {
      "pk": 4000420,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 20,
      "text": "And He rolled up the scroll, gave it back to the attendant, and sat down. The eyes of everyone in the synagogue were fixed on Him.",
      "links": "",
      "comment": "Sitting signified an authoritative teacher. The congregation’s expectation signals anticipation of a messianic announcement."
    },
    {
      "pk": 4000421,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 21,
      "text": "He began to say to them, 'Today this Scripture has been fulfilled in your hearing.'",
      "links": "<a href='/AIV/23/61/1'>Isa. 61:1</a>",
      "comment": "Jesus explicitly identifies Himself as the One Isaiah foretold, making a clear claim to divinity and messianic office. This is a high christology statement; see also John 8:58."
    },
    {
      "pk": 4000422,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 22,
      "text": "All spoke well of Him and marveled at the gracious words that came from His mouth. And they said, 'Is not this Joseph’s son?'",
      "links": "<a href='/AIV/40/13/55'>Matt. 13:55</a>",
      "comment": "The people struggle to reconcile Jesus’ divine authority and His humble origins. The gracious nature of Jesus’s speech is emphasized."
    },
    {
      "pk": 4000423,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 23,
      "text": "And He said to them, 'No doubt you will quote Me this proverb: \"Physician, heal Yourself.\" What we heard You did in Capernaum, do here in Your hometown as well.'",
      "links": "<a href='/AIV/42/23/35'>Luke 23:35</a>",
      "comment": "Jesus anticipates their skepticism and desire for miracles as proof, a theme revisited at the crucifixion."
    },
    {
      "pk": 4000424,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 24,
      "text": "And He said, 'Truly, I say to you, no prophet is accepted in his hometown.'",
      "links": "<a href='/AIV/24/11/21'>Jer. 11:21</a>",
      "comment": "A recurring biblical theme: prophets face rejection among their own people, foreshadowing Jesus’ broader rejection."
    },
    {
      "pk": 4000425,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 25,
      "text": "But in truth, I tell you, there were many widows in Israel in the days of Elijah, when the heavens were shut up for three years and six months, and a great famine came over all the land;",
      "links": "<a href='/AIV/11/17/1'>1 Kings 17:1</a>; <a href='/AIV/59/5/17'>James 5:17</a>",
      "comment": "Jesus references Elijah’s time to show that God’s mercy extended beyond Israel when Israel lacked faith."
    },
    {
      "pk": 4000426,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 26,
      "text": "and Elijah was not sent to any of them, but only to Zarephath in the land of Sidon, to a woman who was a widow.",
      "links": "<a href='/AIV/11/17/9'>1 Kings 17:9</a>",
      "comment": "Elijah’s mission to a Gentile widow prefigures the blessing of the nations, a hint at the universal scope of the messianic Kingdom."
    },
    {
      "pk": 4000427,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 27,
      "text": "And there were many lepers in Israel in the time of Elisha the prophet, and none of them was cleansed, but only Naaman the Syrian.'",
      "links": "<a href='/AIV/12/5/14'>2 Kings 5:14</a>",
      "comment": "Naaman, a Gentile, is cleansed. The ministry of God is not limited by ethnicity—pointing to the inclusion of all nations. Cleansing prefigures later sacramental actions."
    },
    {
      "pk": 4000428,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 28,
      "text": "When they heard these things, all in the synagogue were filled with anger.",
      "links": "",
      "comment": "The crowd resents the idea of God’s favor extending to outsiders—a recurring obstacle in biblical history."
    },
    {
      "pk": 4000429,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 29,
      "text": "And they rose up and drove Him out of the town and brought Him to the brow of the hill on which their town was built, that they might throw Him down off the cliff.",
      "links": "",
      "comment": "Early hostility foreshadows rejection and the passion. Crowds set themselves against the Messiah, fulfilling Old Testament patterns of persecution."
    },
    {
      "pk": 4000430,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 30,
      "text": "But He, passing through the midst of them, went on His way.",
      "links": "",
      "comment": "Jesus displays supernatural authority; His hour has not yet come (cf. John 7:30)."
    },
    {
      "pk": 4000431,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 31,
      "text": "And He went down to Capernaum, a city of Galilee. And He was teaching them on the Sabbath;",
      "links": "",
      "comment": "Jesus continues His ministry, prioritizing both preaching and participation in Sabbath worship."
    },
    {
      "pk": 4000432,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 32,
      "text": "and they were astonished at His teaching, for His word was with authority.",
      "links": "<a href='/AIV/40/7/28-29'>Matt. 7:28–29</a>",
      "comment": "Jesus’ authority exceeds that of the scribes, testifying to His unique identity."
    },
    {
      "pk": 4000433,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 33,
      "text": "In the synagogue there was a man who had the spirit of an unclean demon. And he cried out with a loud voice,",
      "links": "",
      "comment": "Jesus’ ministry often involves direct confrontation with demonic forces, emphasizing His victory over evil."
    },
    {
      "pk": 4000434,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 34,
      "text": "\"Ha! What have You to do with us, Jesus of Nazareth? Have You come to destroy us? I know who You are—the Holy One of God.\"",
      "links": "<a href='/AIV/19/16/10'>Ps. 16:10</a>; <a href='/AIV/43/6/69'>John 6:69</a>",
      "comment": "Demons recognize Jesus' divine identity. The phrase 'Holy One of God' signals both messianic and divine claims."
    },
    {
      "pk": 4000435,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 35,
      "text": "But Jesus rebuked him, saying, 'Be silent and come out of him!' And when the demon had thrown him down in their midst, he came out of him without harming him.",
      "links": "<a href='/AIV/41/1/25'>Mark 1:25–26</a>",
      "comment": "Jesus commands with authority and heals without ritual, showing His power and concern for spiritual healing."
    },
    {
      "pk": 4000436,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 36,
      "text": "And amazement came upon them all, and they said to one another, 'What is this word? For with authority and power He commands the unclean spirits, and they come out!'",
      "links": "<a href='/AIV/40/8/27'>Matt. 8:27</a>",
      "comment": "The people marvel at the authority of Jesus, which validates His claim to divinity and messianic office."
    },
    {
      "pk": 4000437,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 37,
      "text": "And news about Him went out into every place in the surrounding region.",
      "links": "",
      "comment": "Jesus' reputation spreads, preparing the way for the proclamation of the Kingdom."
    },
    {
      "pk": 4000438,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 38,
      "text": "Then He left the synagogue and entered Simon’s house. Now Simon’s mother-in-law was suffering from a high fever, and they asked Him for help concerning her.",
      "links": "<a href='/AIV/40/8/14'>Matt. 8:14</a>",
      "comment": "Jesus’ concern for the suffering points toward a physical-spiritual ministry of compassion."
    },
    {
      "pk": 4000439,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 39,
      "text": "And standing over her, He rebuked the fever, and it left her. Immediately she got up and began to serve them.",
      "links": "<a href='/AIV/41/1/31'>Mark 1:31</a>",
      "comment": "Jesus' words bring instant physical healing. Service in response to healing aligns with a life of gratitude and ministry."
    },
    {
      "pk": 4000440,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 40,
      "text": "When the sun was setting, all those who had any who were sick with various diseases brought them to Him, and He laid His hands on each of them and healed them.",
      "links": "",
      "comment": "The laying on of hands is a precursor to apostolic practices of healing in the church—a physical sign bearing spiritual grace."
    },
    {
      "pk": 4000441,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 41,
      "text": "And demons also came out of many, crying, 'You are the Son of God!' But He rebuked them and did not allow them to speak, because they knew that He was the Christ.",
      "links": "<a href='/AIV/40/16/16'>Matt. 16:16</a>",
      "comment": "Jesus silences demonic testimony, reserving the announcement of His identity for God’s chosen means."
    },
    {
      "pk": 4000442,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 42,
      "text": "And when it was day, He departed and went to a secluded place. And the crowds sought Him and came to Him, and tried to keep Him from leaving them.",
      "links": "<a href='/AIV/41/1/35-37'>Mark 1:35–37</a>",
      "comment": "Jesus withdraws for prayer, modeling the importance of solitude and communion with the Father."
    },
    {
      "pk": 4000443,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 43,
      "text": "But He said to them, 'I must proclaim the good news of the kingdom of God to the other cities also, because for this purpose I was sent.'",
      "links": "<a href='/AIV/23/61/1'>Isa. 61:1</a>",
      "comment": "Jesus’ mission is universal, echoing Isaiah. His proclamation is both word and action, anticipating the Church’s mission."
    },
    {
      "pk": 4000444,
      "translation": "AIV",
      "book": 3,
      "chapter": 4,
      "verse": 44,
      "text": "And He was preaching in the synagogues of Judea.",
      "links": "",
      "comment": "Jesus’ teaching ministry encompasses all Judea, laying a foundation for wider outreach to the nations through His apostles."
    }
  ],
  "translatedAt": "2025-12-23T02:39:53.083Z"
}