{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 23,
  "verses": [
    {
      "pk": 2363001,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 1,
      "text": "Then the whole assembly rose and led Jesus before Pilate.",
      "links": "<a href='/AIV/42/22/66'>Luke 22:66</a>; <a href='/AIV/40/27/2'>Matthew 27:2</a>",
      "comment": "This begins the official trial before the Roman governor Pilate, showing how the Jewish leaders needed Roman authority to execute their plan."
    },
    {
      "pk": 2363002,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 2,
      "text": "They started to accuse him, saying, \"We found this man misleading our nation, forbidding us to pay taxes to Caesar, and saying that he himself is Christ, a king.\"",
      "links": "<a href='/AIV/42/20/25'>Luke 20:25</a>; <a href='/AIV/43/18/33-37'>John 18:33-37</a>",
      "comment": "They bring both political and religious charges. Jesus' claim to be the Christ, or Messiah, is presented as a claim to kingship."
    },
    {
      "pk": 2363003,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 3,
      "text": "So Pilate asked him, \"Are you the King of the Jews?\" Jesus replied, \"You say so.\"",
      "links": "<a href='/AIV/40/27/11'>Matthew 27:11</a>; <a href='/AIV/41/15/2'>Mark 15:2</a>",
      "comment": "Jesus' reply is affirmation but enigmatic, indicating both literal and spiritual kingship. The question of kingship is a key Christological theme."
    },
    {
      "pk": 2363004,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 4,
      "text": "Pilate said to the chief priests and the crowds, \"I find no guilt in this man.\"",
      "links": "<a href='/AIV/41/15/14'>Mark 15:14</a>",
      "comment": "Pilate finds no evidence of a crime. This connects to Jesus' innocence foretold in the Old Testament: <a href='/AIV/23/53/9'>Isaiah 53:9</a>."
    },
    {
      "pk": 2363005,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 5,
      "text": "But they kept insisting, saying, \"He stirs up the people, teaching throughout Judea, beginning from Galilee even to here.\"",
      "links": "<a href='/AIV/40/4/12-17'>Matthew 4:12-17</a>",
      "comment": "The mention of Galilee links to where his ministry began, highlighting his wide influence."
    },
    {
      "pk": 2363006,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 6,
      "text": "When Pilate heard this, he asked if the man was a Galilean.",
      "links": "<a href='/AIV/40/2/22'>Matthew 2:22</a>",
      "comment": "Pilate seeks jurisdiction, implying legal procedure typical of Roman rule."
    },
    {
      "pk": 2363007,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 7,
      "text": "And when he learned that Jesus was under Herod's authority, Pilate sent him to Herod, who was also in Jerusalem at that time.",
      "links": "<a href='/AIV/42/13/31'>Luke 13:31</a>",
      "comment": "Pilate transfers the case, avoiding responsibility. Herod is the ruler of Galilee."
    },
    {
      "pk": 2363008,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 8,
      "text": "When Herod saw Jesus, he was very glad, for he had long wanted to see him, because he had heard about him and hoped to see some sign done by him.",
      "links": "<a href='/AIV/42/9/7-9'>Luke 9:7-9</a>",
      "comment": "Herod's curiosity about miracles reflects a superficial interest, not faith."
    },
    {
      "pk": 2363009,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 9,
      "text": "He questioned him with many words, but Jesus gave him no reply.",
      "links": "<a href='/AIV/23/53/7'>Isaiah 53:7</a>",
      "comment": "Jesus' silence fulfills prophecy of the suffering servant, who did not open his mouth (<a href='/AIV/23/53/7'>Isaiah 53:7</a>)."
    },
    {
      "pk": 2363010,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 10,
      "text": "The chief priests and scribes stood by, accusing him forcefully.",
      "links": "<a href='/AIV/40/27/12'>Matthew 27:12</a>",
      "comment": "The religious leaders remain hostile, intensifying accusations."
    },
    {
      "pk": 2363011,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 11,
      "text": "Herod and his soldiers, after treating him with contempt and mocking him, dressed him in a splendid robe and sent him back to Pilate.",
      "links": "<a href='/AIV/41/15/17-20'>Mark 15:17-20</a>",
      "comment": "The mockery highlights both rejection and recognition of his claim to kingship."
    },
    {
      "pk": 2363012,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 12,
      "text": "Pilate and Herod became friends with each other that very day, for before this they had been enemies.",
      "links": "",
      "comment": "Jesus' trial unites two political rivals, emphasizing the scope of his impact."
    },
    {
      "pk": 2363013,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 13,
      "text": "Pilate called together the chief priests, the rulers, and the people,",
      "links": "",
      "comment": "Pilate addresses religious leaders and the assembled crowd, showing the broad involvement in Jesus' fate."
    },
    {
      "pk": 2363014,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 14,
      "text": "and said to them, \"You brought this man to me as someone who misleads the people. After examining him before you, I have found no basis for your charges against him.",
      "links": "<a href='/AIV/43/18/38'>John 18:38</a>",
      "comment": "Pilate repeats Jesus' innocence, echoing Old Testament prophecy about the suffering righteous one."
    },
    {
      "pk": 2363015,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 15,
      "text": "Neither did Herod, for he sent him back to us. Clearly, he has done nothing deserving death.",
      "links": "",
      "comment": "Both Roman and regional authorities affirm Jesus' innocence, further highlighting his unjust suffering."
    },
    {
      "pk": 2363016,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 16,
      "text": "Therefore, I will punish him and release him.\"",
      "links": "<a href='/AIV/41/15/15'>Mark 15:15</a>",
      "comment": "Pilate tries to offer a compromise, showing his reluctance to convicts Jesus."
    },
    {
      "pk": 2363017,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 17,
      "text": "Now he was obligated to release one prisoner to them at the festival.",
      "links": "<a href='/AIV/40/27/15'>Matthew 27:15</a>",
      "comment": "This Passover custom sets up the choice between Jesus and Barabbas."
    },
    {
      "pk": 2363018,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 18,
      "text": "But the crowd all cried out together, \"Away with this man! Release Barabbas to us!\"",
      "links": "<a href='/AIV/43/18/40'>John 18:40</a>",
      "comment": "Barabbas, a criminal, is preferred over Jesus, showing the depth of rejection."
    },
    {
      "pk": 2363019,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 19,
      "text": "Barabbas had been thrown into prison for a rebellion in the city and for murder.",
      "links": "<a href='/AIV/41/15/7'>Mark 15:7</a>",
      "comment": "Barabbas, a violent insurrectionist, is chosen over the innocent Jesus."
    },
    {
      "pk": 2363020,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 20,
      "text": "Pilate, wanting to release Jesus, spoke to them again.",
      "links": "",
      "comment": "Pilate's repeated attempts to free Jesus underscore the injustice of Jesus' condemnation."
    },
    {
      "pk": 2363021,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 21,
      "text": "But they shouted, \"Crucify! Crucify him!\"",
      "links": "<a href='/AIV/40/27/22-23'>Matthew 27:22-23</a>",
      "comment": "The crowd’s insistence on crucifixion fulfills prophecies about the suffering Messiah (<a href='/AIV/19/22/16'>Psalm 22:16</a>)."
    },
    {
      "pk": 2363022,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 22,
      "text": "For the third time he said to them, \"Why? What evil has he done? I find no reason for death. I will punish him and release him.\"",
      "links": "",
      "comment": "Pilate makes three declarations of Jesus’ innocence, highlighting the triple affirmation often seen in liturgical repetition. See <a href='/AIV/43/18/38'>John 18:38</a>."
    },
    {
      "pk": 2363023,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 23,
      "text": "But they were urgent, demanding with loud cries that he be crucified. And their voices prevailed.",
      "links": "",
      "comment": "Mob rule overrides justice, demonstrating how Christ’s sacrifice comes through rejection by his own people."
    },
    {
      "pk": 2363024,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 24,
      "text": "So Pilate decided their demand should be done.",
      "links": "",
      "comment": "Pilate's decision is passive; he allows injustice—a human authority succumbs to public pressure."
    },
    {
      "pk": 2363025,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 25,
      "text": "He released the man who had been imprisoned for rebellion and murder, whom they asked for, but he handed Jesus over to their will.",
      "links": "",
      "comment": "Substitution between Barabbas and Jesus is a stark image of Christ dying for sinners."
    },
    {
      "pk": 2363026,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 26,
      "text": "As they led Jesus away, they seized Simon of Cyrene, coming from the countryside, and put the cross on him to carry behind Jesus.",
      "links": "<a href='/AIV/41/15/21'>Mark 15:21</a>",
      "comment": "Simon helps carry the cross, signifying participation in Christ's suffering—a parallel to shared suffering in Christian life."
    },
    {
      "pk": 2363027,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 27,
      "text": "A large crowd followed him, including women mourning and lamenting for him.",
      "links": "",
      "comment": "Women mourn for Jesus, showing compassion and faithfulness even when others abandon him."
    },
    {
      "pk": 2363028,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 28,
      "text": "But Jesus turned to them and said, \"Daughters of Jerusalem, do not weep for me, but weep for yourselves and for your children.",
      "links": "<a href='/AIV/42/19/41-44'>Luke 19:41-44</a>",
      "comment": "Jesus foresees coming judgment upon Jerusalem—prophetic warning connecting to previous laments and prophecies."
    },
    {
      "pk": 2363029,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 29,
      "text": "For indeed, the days are coming when people will say, 'Blessed are the barren and the wombs that have never borne and the breasts that have never nursed.'",
      "links": "",
      "comment": "Judgment will invert normal blessedness, recalling Old Testament woes (<a href='/AIV/28/9/14'>Hosea 9:14</a>)."
    },
    {
      "pk": 2363030,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 30,
      "text": "Then they will begin to say to the mountains, 'Fall on us,' and to the hills, 'Cover us.'",
      "links": "<a href='/AIV/28/10/8'>Hosea 10:8</a>; <a href='/AIV/66/6/16'>Revelation 6:16</a>",
      "comment": "References apocalyptic language about judgment from Hosea; Jesus links coming destruction to Old Testament imagery."
    },
    {
      "pk": 2363031,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 31,
      "text": "For if they do these things when the tree is green, what will happen when it is dry?",
      "links": "",
      "comment": "Jesus uses a proverb: if the righteous suffer now, how much worse will the unrighteous suffer in judgment?"
    },
    {
      "pk": 2363032,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 32,
      "text": "Two other criminals were also led out to be executed with him.",
      "links": "<a href='/AIV/41/15/27'>Mark 15:27</a>",
      "comment": "Jesus is counted among transgressors, fulfilling prophecy (<a href='/AIV/23/53/12'>Isaiah 53:12</a>)."
    },
    {
      "pk": 2363033,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 33,
      "text": "When they came to the place called The Skull, there they crucified him, along with the criminals, one on his right and one on his left.",
      "links": "",
      "comment": "The central placement of Jesus highlights his role as mediator and fulfillment of prophecy."
    },
    {
      "pk": 2363034,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 34,
      "text": "Jesus said, \"Father, forgive them, for they do not know what they are doing.\" And they cast lots to divide his clothing.",
      "links": "<a href='/AIV/19/22/18'>Psalm 22:18</a>",
      "comment": "Jesus' intercession reveals divine mercy. The casting of lots fulfills messianic prophecy (<a href='/AIV/19/22/18'>Psalm 22:18</a>)."
    },
    {
      "pk": 2363035,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 35,
      "text": "The people stood watching, but the rulers mocked him, saying, \"He saved others; let him save himself, if he is the Christ, God’s chosen one!\"",
      "links": "<a href='/AIV/19/22/6-8'>Psalm 22:6-8</a>",
      "comment": "The mockery repeats messianic prophecies about the suffering servant being insulted."
    },
    {
      "pk": 2363036,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 36,
      "text": "The soldiers also mocked him, coming up to offer him sour wine,",
      "links": "",
      "comment": "Sour wine is a reference to the suffering described in <a href='/AIV/19/69/21'>Psalm 69:21</a>."
    },
    {
      "pk": 2363037,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 37,
      "text": "and saying, \"If you are the King of the Jews, save yourself!\"",
      "links": "",
      "comment": "The charge of kingship is repeated, highlighting Jesus' divine claim as King, even in suffering."
    },
    {
      "pk": 2363038,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 38,
      "text": "Above him was an inscription: \"This is the King of the Jews.\"",
      "links": "<a href='/AIV/41/15/26'>Mark 15:26</a>",
      "comment": "The written title functions as both accusation and proclamation—theologically significant as a universal declaration."
    },
    {
      "pk": 2363039,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 39,
      "text": "One of the criminals hanging there hurled abuse at him, saying, \"Aren’t you the Christ? Save yourself and us!\"",
      "links": "",
      "comment": "This recalls the temptation narratives, where Jesus refuses to use power selfishly."
    },
    {
      "pk": 2363040,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 40,
      "text": "But the other criminal rebuked him, saying, \"Do you not fear God, since you are under the same sentence?",
      "links": "",
      "comment": "A confession of justice and divinity; the criminal acknowledges the fear of God in suffering."
    },
    {
      "pk": 2363041,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 41,
      "text": "And we indeed are justly condemned, for we receive the due reward for our actions; but this man has done nothing wrong.\"",
      "links": "",
      "comment": "The innocence of Jesus is declared by a transgressor, echoing prophetic witness."
    },
    {
      "pk": 2363042,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 42,
      "text": "Then he said, \"Jesus, remember me when you come into your kingdom.\"",
      "links": "<a href='/AIV/19/106/4'>Psalm 106:4</a>",
      "comment": "A powerful declaration of faith in Jesus’ kingship and messianic authority even in death."
    },
    {
      "pk": 2363043,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 43,
      "text": "Jesus replied, \"Truly, I tell you, today you will be with me in Paradise.\"",
      "links": "<a href='/AIV/47/12/4'>2 Corinthians 12:4</a>",
      "comment": "Jesus offers assurance of salvation and eternal communion—indicative of his authority to forgive and grant paradise instantly."
    },
    {
      "pk": 2363044,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 44,
      "text": "It was now about noon, and darkness came over the whole land until three in the afternoon.",
      "links": "",
      "comment": "The supernatural darkness echoes judgment scenes from the prophets (<a href='/AIV/30/8/9'>Amos 8:9</a>)."
    },
    {
      "pk": 2363045,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 45,
      "text": "The sun’s light failed, and the curtain of the temple was torn in two.",
      "links": "<a href='/AIV/2/26/33'>Exodus 26:33</a>; <a href='/AIV/58/10/19-20'>Hebrews 10:19-20</a>",
      "comment": "The torn curtain signifies new access to God’s presence, theologically important for understanding atonement and mediation."
    },
    {
      "pk": 2363046,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 46,
      "text": "Then Jesus, crying out with a loud voice, said, \"Father, into your hands I commit my spirit!\" Having said this, he breathed his last.",
      "links": "<a href='/AIV/19/31/5'>Psalm 31:5</a>",
      "comment": "Jesus willingly entrusts himself to God, quoting Scripture; this demonstrates his role as perfect Son and fulfillment of the righteous sufferer."
    },
    {
      "pk": 2363047,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 47,
      "text": "When the centurion saw what had happened, he praised God, saying, \"Certainly this man was righteous.\"",
      "links": "",
      "comment": "A Gentile’s acknowledgment reveals the universality of Christ’s righteousness and the breaking of barriers between Jew and Gentile."
    },
    {
      "pk": 2363048,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 48,
      "text": "And all the crowds who had gathered for this spectacle, when they saw what had happened, went away beating their breasts.",
      "links": "",
      "comment": "The people express remorse and grief, suggesting recognition of tragic innocence."
    },
    {
      "pk": 2363049,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 49,
      "text": "But all his acquaintances, including the women who had followed him from Galilee, stood at a distance watching these things.",
      "links": "",
      "comment": "The faithful women and disciples remain present, a testimony to perseverance and fidelity amidst suffering."
    },
    {
      "pk": 2363050,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 50,
      "text": "Now there was a man named Joseph, a council member, a good and righteous man.",
      "links": "",
      "comment": "Joseph of Arimathea is depicted as noble, showing faith within the ruling council."
    },
    {
      "pk": 2363051,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 51,
      "text": "He had not agreed with their plan or actions. He was from Arimathea, a town of the Jews, and was waiting for the kingdom of God.",
      "links": "",
      "comment": "Joseph’s hope for the kingdom links him to Jesus’ message and points to fidelity to true faith."
    },
    {
      "pk": 2363052,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 52,
      "text": "He went to Pilate and asked for Jesus’ body.",
      "links": "",
      "comment": "Joseph’s courage risks association with Jesus even after his death, an act of piety."
    },
    {
      "pk": 2363053,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 53,
      "text": "He took it down, wrapped it in a linen shroud, and laid him in a tomb cut out of rock, where no one had yet been laid.",
      "links": "<a href='/AIV/23/53/9'>Isaiah 53:9</a>",
      "comment": "This action fulfills prophecy of burial among the rich, showing God’s providential care."
    },
    {
      "pk": 2363054,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 54,
      "text": "It was Preparation Day, and the Sabbath was beginning.",
      "links": "<a href='/AIV/2/12/16'>Exodus 12:16</a>",
      "comment": "Jesus' burial happens in accordance with Jewish law, respecting Sabbath customs."
    },
    {
      "pk": 2363055,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 55,
      "text": "The women who had come with him from Galilee followed and saw the tomb and how his body was laid.",
      "links": "",
      "comment": "Women are primary witnesses to the burial, emphasizing their crucial role in the gospel and apostolic witness."
    },
    {
      "pk": 2363056,
      "translation": "AIV",
      "book": 3,
      "chapter": 23,
      "verse": 56,
      "text": "Then they returned and prepared spices and ointments. On the Sabbath, they rested according to the commandment.",
      "links": "<a href='/AIV/2/20/10'>Exodus 20:10</a>",
      "comment": "Obedience to Sabbath law reveals faithfulness to divine instruction. This pattern of devotion and rest anticipates the resurrection and the centrality of sacred traditions."
    }
  ],
  "translatedAt": "2025-12-23T02:54:23.210Z"
}