{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 12,
  "verses": [
    {
      "pk": 12001001,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 1,
      "text": "In those days, when thousands of people had gathered together so that they were trampling on one another, Jesus began to say to his disciples first, \"Beware of the yeast of the Pharisees, which is hypocrisy.",
      "links": "<a href='/AIV/40/16/6'>Matt 16:6</a>; <a href='/AIV/41/8/15'>Mark 8:15</a>",
      "comment": "Jesus uses 'yeast' as a metaphor for the influential nature of hypocrisy. His warning to the disciples indicates they are called to a higher integrity, foreshadowing the coming spiritual leadership of the Apostles."
    },
    {
      "pk": 12001002,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 2,
      "text": "Nothing is covered up that will not be revealed, or hidden that will not be known.",
      "links": "<a href='/AIV/40/10/26'>Matt 10:26</a>; <a href='/AIV/41/4/22'>Mark 4:22</a>",
      "comment": "This teaching shows the divine omniscience of Christ—He knows all secrets, both of hearts and actions."
    },
    {
      "pk": 12001003,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 3,
      "text": "Therefore, whatever you have said in the dark will be heard in the light, and what you have whispered in ear in private rooms will be proclaimed on the housetops.",
      "links": "<a href='/AIV/40/10/27'>Matt 10:27</a>",
      "comment": "Echoing Old Testament prophets, Jesus calls for public witness. Secret truths, especially about Christ, are destined to be revealed through the disciples’ preaching."
    },
    {
      "pk": 12001004,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 4,
      "text": "I tell you, my friends, do not fear those who kill the body and after that have nothing more that they can do.",
      "links": "<a href='/AIV/35/3/8'>Hab 3:8</a>",
      "comment": "Emphasizes Christ's authority over life and death. Mortal dangers are temporary, but fidelity to God has eternal implications."
    },
    {
      "pk": 12001005,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 5,
      "text": "But I will warn you whom to fear: fear Him who, after He has killed, has authority to cast into hell. Yes, I tell you, fear Him!",
      "links": "<a href='/AIV/23/33/14'>Isa 33:14</a>; <a href='/AIV/19/76/7'>Ps 76:7</a>",
      "comment": "Jesus affirms the reality of hell and the ultimate judgment by God, showing Christ expects us to maintain a reverent awe for divine justice."
    },
    {
      "pk": 12001006,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 6,
      "text": "Are not five sparrows sold for two pennies? Yet not one of them is forgotten before God.",
      "links": "<a href='/AIV/40/10/29'>Matt 10:29</a>",
      "comment": "Highlights God’s providence over even the smallest creatures, teaching that all creation falls under God's attentive care."
    },
    {
      "pk": 12001007,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 7,
      "text": "Even the hairs of your head are all numbered. Do not be afraid; you are of more value than many sparrows.",
      "links": "<a href='/AIV/40/10/30-31'>Matt 10:30-31</a>",
      "comment": "Reassures believers of God’s intimate knowledge and special love for each person."
    },
    {
      "pk": 12001008,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 8,
      "text": "And I say to you, everyone who acknowledges Me before men, the Son of Man will also acknowledge before the angels of God.",
      "links": "<a href='/AIV/40/10/32'>Matt 10:32</a>; <a href='/AIV/27/7/13'>Dan 7:13</a>",
      "comment": "Jesus refers to Himself as the Son of Man (Danielic title), highlighting His divinity and Messianic authority in the heavenly court."
    },
    {
      "pk": 12001009,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 9,
      "text": "But whoever denies Me before men will be denied before the angels of God.",
      "links": "<a href='/AIV/40/10/33'>Matt 10:33</a>",
      "comment": "Reveals the serious consequence of rejecting Christ—ultimate separation from Him. Early Christians understood this as referring to eternal realities."
    },
    {
      "pk": 12001010,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 10,
      "text": "And everyone who speaks a word against the Son of Man will be forgiven, but the one who blasphemes against the Holy Spirit will not be forgiven.",
      "links": "<a href='/AIV/40/12/31-32'>Matt 12:31-32</a>; <a href='/AIV/41/3/29'>Mark 3:29</a>",
      "comment": "Points to the gravity of rejecting the Spirit’s testimony, usually interpreted as persistent hardness of heart. Early tradition saw this as the refusal of God's mercy."
    },
    {
      "pk": 12001011,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 11,
      "text": "When they bring you before synagogues and rulers and authorities, do not be anxious about how you should defend yourself or what you should say,",
      "links": "<a href='/AIV/40/10/19-20'>Matt 10:19-20</a>; <a href='/AIV/41/13/11'>Mark 13:11</a>",
      "comment": "Jesus assures the Spirit’s inspiration and protection for His witnesses—reliance on the Spirit is foundational for apostolic preaching."
    },
    {
      "pk": 12001012,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 12,
      "text": "for the Holy Spirit will teach you in that very hour what you ought to say.",
      "links": "<a href='/AIV/44/4/8'>Acts 4:8</a>; <a href='/AIV/42/21/15'>Luke 21:15</a>",
      "comment": "Parallels fulfilled in Acts; apostolic teaching is guided by the Spirit. Reinforces confidence in the supernatural assistance for the Church’s mission."
    },
    {
      "pk": 12001013,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 13,
      "text": "Someone in the crowd said to Him, \"Teacher, tell my brother to divide the inheritance with me.\"",
      "links": "<a href='/AIV/42/10/25'>Luke 10:25</a>",
      "comment": "Shows the way followers looked to Jesus as both spiritual and ethical authority, not just a teacher but as a judge (cf. Moses/Judges, Ex. 18:13-16)."
    },
    {
      "pk": 12001014,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 14,
      "text": "But He said to him, \"Man, who made Me a judge or arbitrator over you?\"",
      "links": "<a href='/AIV/02/2/14'>Ex 2:14</a>",
      "comment": "Jesus distances Himself from secular disputes, emphasizing the primacy of His spiritual mission."
    },
    {
      "pk": 12001015,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 15,
      "text": "And He said to them, \"Take care, and be on your guard against all covetousness, for a person's life does not consist in the abundance of his possessions.\"",
      "links": "<a href='/AIV/02/20/17'>Ex 20:17</a>; <a href='/AIV/21/5/10'>Eccl 5:10</a>",
      "comment": "Warns against greed, connecting to commandments against coveting, emphasizing spiritual over material wealth."
    },
    {
      "pk": 12001016,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 16,
      "text": "And He told them a parable, saying, \"The land of a rich man produced plentifully.",
      "links": "<a href='/AIV/19/49/16-17'>Ps 49:16-17</a>",
      "comment": "Prepares the listeners for a lesson on trusting in God rather than riches."
    },
    {
      "pk": 12001017,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 17,
      "text": "And he thought to himself, 'What shall I do, for I have nowhere to store my crops?'",
      "links": "",
      "comment": "Reflects the inward focus of the parable’s subject; wisdom literature often exposes the folly of self-reliance."
    },
    {
      "pk": 12001018,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 18,
      "text": "And he said, 'I will do this: I will tear down my barns and build larger ones, and there I will store all my grain and my goods.'",
      "links": "",
      "comment": "The man's solution is entirely self-centered, revealing the spiritual danger of placing hope in material security."
    },
    {
      "pk": 12001019,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 19,
      "text": "And I will say to my soul, 'Soul, you have many goods laid up for many years; relax, eat, drink, be merry.'",
      "links": "<a href='/AIV/21/8/15'>Eccl 8:15</a>; <a href='/AIV/23/22/13'>Isa 22:13</a>",
      "comment": "Echoes Old Testament warnings against complacency and trusting in wealth. 'Eat, drink, and be merry' is condemned in prophetic literature."
    },
    {
      "pk": 12001020,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 20,
      "text": "But God said to him, 'Fool! This night your soul is required of you, and the things you have prepared, whose will they be?'",
      "links": "<a href='/AIV/19/39/6'>Ps 39:6</a>; <a href='/AIV/21/2/18'>Eccl 2:18</a>",
      "comment": "Points to the vanity of riches—without spiritual preparation, material possessions are left behind."
    },
    {
      "pk": 12001021,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 21,
      "text": "So is the one who lays up treasure for himself and is not rich toward God.\"",
      "links": "<a href='/AIV/41/10/21'>Mark 10:21</a>",
      "comment": "A call to focus on storing up spiritual treasures through faith and good works."
    },
    {
      "pk": 12001022,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 22,
      "text": "And He said to His disciples, \"Therefore I tell you, do not be anxious about your life, what you will eat, nor about your body, what you will put on.",
      "links": "<a href='/AIV/40/6/25'>Matt 6:25</a>",
      "comment": "Relates to Jesus’ teaching about trust in divine providence."
    },
    {
      "pk": 12001023,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 23,
      "text": "For life is more than food, and the body more than clothing.",
      "links": "",
      "comment": "A call to value the spiritual above the material."
    },
    {
      "pk": 12001024,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 24,
      "text": "Consider the ravens: they neither sow nor reap, they have neither storehouse nor barn, yet God feeds them. How much more valuable are you than the birds!",
      "links": "<a href='/AIV/18/38/41'>Job 38:41</a>; <a href='/AIV/19/147/9'>Ps 147:9</a>",
      "comment": "Draws from Old Testament imagery; invites trust in God, who cares for even the least creatures."
    },
    {
      "pk": 12001025,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 25,
      "text": "And which of you by being anxious can add a single hour to the span of your life?",
      "links": "<a href='/AIV/19/39/5'>Ps 39:5</a>",
      "comment": "Shows the limits of human effort and wisdom without reliance on God."
    },
    {
      "pk": 12001026,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 26,
      "text": "If then you are not able to do as small a thing as that, why are you anxious about the rest?",
      "links": "",
      "comment": "Calls for humble trust in God’s lordship."
    },
    {
      "pk": 12001027,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 27,
      "text": "Consider the lilies, how they grow: they neither toil nor spin, yet I tell you, even Solomon in all his glory was not arrayed like one of these.",
      "links": "<a href='/AIV/11/10/4-7'>1 Kgs 10:4-7</a>; <a href='/AIV/19/104/24'>Ps 104:24</a>",
      "comment": "Jesus affirms God’s handiwork and providence, showing creation as a reflection of God’s care."
    },
    {
      "pk": 12001028,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 28,
      "text": "But if God so clothes the grass, which is alive in the field today, and tomorrow is thrown into the oven, how much more will He clothe you, O you of little faith?",
      "links": "<a href='/AIV/40/6/30'>Matt 6:30</a>",
      "comment": "A gentle rebuke—faith is the key to trusting in God’s providence for body and soul."
    },
    {
      "pk": 12001029,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 29,
      "text": "And do not seek what you are to eat and what you are to drink, nor be worried.",
      "links": "",
      "comment": "Simple trust in God relieves anxiety about material needs."
    },
    {
      "pk": 12001030,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 30,
      "text": "For all the nations of the world seek after these things, and your Father knows that you need them.",
      "links": "<a href='/AIV/40/6/32'>Matt 6:32</a>",
      "comment": "God’s fatherhood is emphasized—the new identity of believers as children of God."
    },
    {
      "pk": 12001031,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 31,
      "text": "But seek His kingdom, and these things will be added to you.",
      "links": "<a href='/AIV/40/6/33'>Matt 6:33</a>",
      "comment": "Prioritizing the kingdom brings all other needs into focus—echoes Jesus’ teaching on eternal priorities."
    },
    {
      "pk": 12001032,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 32,
      "text": "Fear not, little flock, for it is your Father's good pleasure to give you the kingdom.",
      "links": "<a href='/AIV/19/23/1'>Ps 23:1</a>; <a href='/AIV/27/7/27'>Dan 7:27</a>",
      "comment": "Affirms God’s generous will. The 'little flock' evokes imagery of the gathered community led by apostolic shepherds."
    },
    {
      "pk": 12001033,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 33,
      "text": "Sell your possessions, and give to the needy. Store up for yourselves treasures in the heavens, where no thief approaches and no moth destroys.",
      "links": "<a href='/AIV/19/112/9'>Ps 112:9</a>; <a href='/AIV/40/6/20'>Matt 6:20</a>",
      "comment": "Teaches detachment and charity, central for Christian discipleship and the sanctification of daily life."
    },
    {
      "pk": 12001034,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 34,
      "text": "For where your treasure is, there your heart will be also.",
      "links": "<a href='/AIV/40/6/21'>Matt 6:21</a>",
      "comment": "Spiritual formation depends on internal conversion—aligning one’s heart with heavenly rather than earthly values."
    },
    {
      "pk": 12001035,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 35,
      "text": "\"Let your waists be dressed for action, and your lamps burning.",
      "links": "<a href='/AIV/02/12/11'>Ex 12:11</a>; <a href='/AIV/40/25/1-13'>Matt 25:1-13</a>",
      "comment": "Evokes Passover and the vigilance of those awaiting the Lord’s coming—a call for constant spiritual readiness."
    },
    {
      "pk": 12001036,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 36,
      "text": "Be like men waiting for their master to come home from the wedding feast, so that they may open the door to him at once when he comes and knocks.",
      "links": "<a href='/AIV/66/3/20'>Rev 3:20</a>",
      "comment": "The imagery parallels Christ as bridegroom returning—an early Church image for Christ's second coming and vigilance in prayer."
    },
    {
      "pk": 12001037,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 37,
      "text": "Blessed are those servants whom the master finds awake when he comes. Truly, I say to you, he will dress himself to serve, and have them recline at table, and he will come and serve them.",
      "links": "<a href='/AIV/43/13/4-5'>John 13:4-5</a>",
      "comment": "Remarks on the reversal of roles—a foretaste of the Last Supper when Christ, the divine Master, serves His disciples."
    },
    {
      "pk": 12001038,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 38,
      "text": "If he comes in the second or in the third watch, and finds them so, blessed are those servants!",
      "links": "",
      "comment": "Faithful vigilance at all hours is a mark of discipleship—echoes eschatological readiness."
    },
    {
      "pk": 12001039,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 39,
      "text": "But know this, that if the master of the house had known at what hour the thief was coming, he would not have left his house to be broken into.",
      "links": "<a href='/AIV/52/5/2'>1 Thess 5:2</a>; <a href='/AIV/66/16/15'>Rev 16:15</a>",
      "comment": "The suddenness of Christ’s return is a reminder to live in constant preparedness."
    },
    {
      "pk": 12001040,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 40,
      "text": "You also must be ready, for the Son of Man is coming at an hour you do not expect.\"",
      "links": "<a href='/AIV/40/24/44'>Matt 24:44</a>",
      "comment": "The Son of Man is a title loaded with Messianic and divine significance. Christ reminds them of final judgment and consummation."
    },
    {
      "pk": 12001041,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 41,
      "text": "Peter said, \"Lord, are You telling this parable for us or for all?\"",
      "links": "",
      "comment": "Peter, representative of apostolic leadership, seeks clarification concerning the scope of Christ’s commands."
    },
    {
      "pk": 12001042,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 42,
      "text": "And the Lord said, \"Who then is the faithful and wise manager, whom his master will set over his household, to give them their portion of food at the proper time?",
      "links": "<a href='/AIV/40/24/45'>Matt 24:45</a>",
      "comment": "The 'manager' is responsible for spiritual nourishment—anticipates apostolic stewardship in the Church."
    },
    {
      "pk": 12001043,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 43,
      "text": "Blessed is that servant whom his master will find so doing when he comes.",
      "links": "",
      "comment": "Faithful leadership is rewarded, suggesting the dignity and accountability of those entrusted with spiritual care."
    },
    {
      "pk": 12001044,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 44,
      "text": "Truly, I say to you, he will set him over all his possessions.",
      "links": "<a href='/AIV/40/25/21'>Matt 25:21</a>",
      "comment": "Points to the unique reward for faithful leaders; implies a hierarchy and visible structure to the people of God."
    },
    {
      "pk": 12001045,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 45,
      "text": "But if that servant says in his heart, 'My master is delayed in coming,' and begins to beat the male and female servants, and to eat and drink and get drunk,",
      "links": "",
      "comment": "Warns against clerical abuse and moral laxity—leaders are held to higher standards."
    },
    {
      "pk": 12001046,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 46,
      "text": "the master of that servant will come on a day when he does not expect him and at an hour he does not know, and will cut him in pieces and assign him a place with the unbelievers.",
      "links": "<a href='/AIV/41/13/36-37'>Mark 13:36-37</a>",
      "comment": "Severe judgment awaits unfaithful stewards—judgment is a central eschatological theme."
    },
    {
      "pk": 12001047,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 47,
      "text": "And that servant who knew his master's will but did not prepare or act according to his will, will receive a severe beating.",
      "links": "",
      "comment": "Degrees of responsibility and culpability; those with greater knowledge are held to stricter account, resonating with early church teaching."
    },
    {
      "pk": 12001048,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 48,
      "text": "But the one who did not know, and did what deserved a beating, will receive a light beating. Everyone to whom much was given, of him much will be required, and from him to whom much was entrusted, even more will be asked.",
      "links": "<a href='/AIV/40/25/29'>Matt 25:29</a>; <a href='/AIV/45/2/12-16'>Rom 2:12-16</a>",
      "comment": "The principle of divine justice: mercy for ignorance but responsibility for knowledge and the offices given."
    },
    {
      "pk": 12001049,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 49,
      "text": "\"I came to cast fire upon the earth, and would that it were already kindled!",
      "links": "<a href='/AIV/39/3/2-3'>Mal 3:2-3</a>; <a href='/AIV/44/2/3'>Acts 2:3</a>",
      "comment": "Fire symbolizes judgment and the Holy Spirit, anticipating the Pentecost and purification by Christ."
    },
    {
      "pk": 12001050,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 50,
      "text": "I have a baptism to be baptized with, and how great is my distress until it is accomplished!",
      "links": "<a href='/AIV/41/10/38'>Mark 10:38</a>; <a href='/AIV/40/20/22'>Matt 20:22</a>",
      "comment": "Alludes to Christ’s impending passion, connecting His suffering with the mystery of baptism and the cross."
    },
    {
      "pk": 12001051,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 51,
      "text": "Do you think that I have come to give peace on earth? No, I tell you, but rather division.",
      "links": "<a href='/AIV/33/7/6'>Mic 7:6</a>; <a href='/AIV/40/10/34'>Matt 10:34</a>",
      "comment": "Faithfulness to Christ produces a supernatural peace, which can bring division in families and communities. Christ’s claim here is divine and radical."
    },
    {
      "pk": 12001052,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 52,
      "text": "For from now on in one house there will be five divided, three against two and two against three.",
      "links": "",
      "comment": "The coming of Christ demands ultimate allegiance, surpassing even family ties, a theme reinforced in Old Testament prophecy."
    },
    {
      "pk": 12001053,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 53,
      "text": "They will be divided, father against son and son against father, mother against daughter and daughter against mother, mother-in-law against her daughter-in-law, and daughter-in-law against mother-in-law.\"",
      "links": "<a href='/AIV/33/7/6'>Mic 7:6</a>",
      "comment": "Echoes Micah 7:6; Christ boldly places loyalty to Him above all human relationships—a high christological claim."
    },
    {
      "pk": 12001054,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 54,
      "text": "He also said to the crowds, \"When you see a cloud rising in the west, you say at once, 'A shower is coming.' And so it happens.",
      "links": "",
      "comment": "Jesus highlights the crowd’s ability to interpret earthly signs, contrasting with their lack of spiritual discernment."
    },
    {
      "pk": 12001055,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 55,
      "text": "And when you see the south wind blowing, you say, 'There will be scorching heat,' and it happens.",
      "links": "",
      "comment": "Natural events are easily interpreted, indicating the lamentable blindness to spiritual realities among the people."
    },
    {
      "pk": 12001056,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 56,
      "text": "You hypocrites! You know how to interpret the appearance of earth and sky, but why do you not know how to interpret this present time?",
      "links": "<a href='/AIV/40/16/3'>Matt 16:3</a>",
      "comment": "Condemns spiritual blindness—'this present time' is a reference to the Messianic age inaugurated by Christ Himself."
    },
    {
      "pk": 12001057,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 57,
      "text": "\"And why do you not judge for yourselves what is right?",
      "links": "",
      "comment": "Personal discernment is necessary—the call to be attentive to justice and the truth of Christ’s teaching."
    },
    {
      "pk": 12001058,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 58,
      "text": "As you go with your accuser before the magistrate, make an effort to settle with him on the way, lest he drag you to the judge, and the judge hand you over to the officer, and the officer put you in prison.",
      "links": "<a href='/AIV/40/5/25-26'>Matt 5:25-26</a>",
      "comment": "A parable for reconciliation now, before the final judgment—an implicit reference to the value of repentance and making peace now."
    },
    {
      "pk": 12001059,
      "translation": "AIV",
      "book": 42,
      "chapter": 12,
      "verse": 59,
      "text": "I tell you, you will never get out until you have paid the very last penny.\"",
      "links": "<a href='/AIV/19/32/1-2'>Ps 32:1-2</a>",
      "comment": "Suggests ongoing consequences for unresolved sin—a passage often seen as implying a temporary penalty after death. Interpreted by many as support for the biblical teaching on purification after death, commonly understood by the early Church."
    }
  ],
  "translatedAt": "2025-12-23T02:47:26.972Z"
}