{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 22,
  "verses": [
    {
      "pk": 22472101,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 1,
      "text": "Now the Feast of Unleavened Bread, called Passover, was approaching.",
      "links": "<a href='/AIV/2/12/1-20'>Ex. 12:1-20</a>; <a href='/AIV/3/23/5'>Lev. 23:5</a>",
      "comment": "The Passover commemorates Israel's deliverance from Egypt. Jesus chooses this moment to institute the New Covenant, layering old rituals with new fulfillment."
    },
    {
      "pk": 22472102,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 2,
      "text": "The chief priests and the scribes were seeking how they might put him to death, for they were afraid of the people.",
      "links": "<a href='/AIV/40/26/3-5'>Matt. 26:3-5</a>; <a href='/AIV/41/14/1-2'>Mark 14:1-2</a>",
      "comment": "Fear of popular opinion restrains the leaders' plot, highlighting the tension between human authority and God's plan."
    },
    {
      "pk": 22472103,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 3,
      "text": "Then Satan entered into Judas, called Iscariot, who was numbered among the twelve.",
      "links": "<a href='/AIV/43/13/2,27'>John 13:2, 27</a>",
      "comment": "Luke emphasizes supernatural forces behind betrayal. The presence of Satan demonstrates opposition to Jesus' mission, but also serves God's greater plan."
    },
    {
      "pk": 22472104,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 4,
      "text": "He went and spoke with the chief priests and the officers about how he might betray him to them.",
      "links": "<a href='/AIV/40/26/14-16'>Matt. 26:14-16</a>",
      "comment": "Judas collaborates with religious leaders, fulfilling prophetic anticipation of the Messiah's betrayal (<a href='/AIV/19/41/9'>Ps. 41:9</a>)."
    },
    {
      "pk": 22472105,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 5,
      "text": "They were glad and agreed to give him money.",
      "links": "<a href='/AIV/38/11/12-13'>Zech. 11:12–13</a>",
      "comment": "Judas’s greed echoes the 30 pieces of silver reference in Zechariah—prophetic foreshadowing of Messiah's rejection."
    },
    {
      "pk": 22472106,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 6,
      "text": "So he consented and sought an opportunity to betray him to them in the absence of the crowd.",
      "links": "<a href='/AIV/40/26/16'>Matt. 26:16</a>",
      "comment": "The secrecy of the betrayal underscores its darkness, and prepares for the Passion narrative."
    },
    {
      "pk": 22472107,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 7,
      "text": "Then the day of Unleavened Bread came, on which the Passover lamb had to be sacrificed.",
      "links": "<a href='/AIV/2/12/6-8'>Ex. 12:6-8</a>; <a href='/AIV/46/5/7'>1 Cor. 5:7</a>",
      "comment": "Jesus, the true Passover Lamb, fulfills the type of the Old Covenant sacrifice."
    },
    {
      "pk": 22472108,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 8,
      "text": "Jesus sent Peter and John, saying, “Go and prepare for us the Passover, so we may eat.”",
      "links": "<a href='/AIV/40/26/17'>Matt. 26:17</a>",
      "comment": "The apostles act with delegated authority, reflecting structure and holy order in discipleship. The choice of Peter and John is notable."
    },
    {
      "pk": 22472109,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 9,
      "text": "They said to him, “Where do you want us to prepare it?”",
      "links": "",
      "comment": "Disciples depend entirely on Jesus for direction in spiritual matters."
    },
    {
      "pk": 22472110,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 10,
      "text": "He said to them, “Behold, when you enter the city, a man carrying a jar of water will meet you. Follow him into the house that he enters.",
      "links": "",
      "comment": "Jesus’s exact foreknowledge reveals his divinity, as he controls even these hidden details."
    },
    {
      "pk": 22472111,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 11,
      "text": "And say to the master of the house, ‘The Teacher says to you, Where is the guest room, where I may eat the Passover with my disciples?’”",
      "links": "",
      "comment": "‘The Teacher’ demonstrates Jesus’s recognized authority, and the meal is a sacred gathering."
    },
    {
      "pk": 22472112,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 12,
      "text": "He will show you a large upper room furnished. Make preparations there.”",
      "links": "<a href='/AIV/44/1/13'>Acts 1:13</a>",
      "comment": "The ‘upper room’ becomes the holy setting for the Last Supper, reflecting the sacredness of tradition."
    },
    {
      "pk": 22472113,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 13,
      "text": "So they went and found it just as he had told them, and they prepared the Passover.",
      "links": "",
      "comment": "The text emphasizes obedience to Jesus’s command, a crucial spiritual posture."
    },
    {
      "pk": 22472114,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 14,
      "text": "When the hour had come, he reclined at table, and the apostles with him.",
      "links": "",
      "comment": "The posture at table echoes the practice of fellowship and unity, a meal with spiritual significance."
    },
    {
      "pk": 22472115,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 15,
      "text": "And he said to them, “I have earnestly desired to eat this Passover with you before I suffer.",
      "links": "",
      "comment": "Note Jesus’s deep longing; this is the final Passover and the inauguration of a new covenant."
    },
    {
      "pk": 22472116,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 16,
      "text": "For I tell you, I will not eat it again until it is fulfilled in the kingdom of God.”",
      "links": "<a href='/AIV/40/26/29'>Matt. 26:29</a>",
      "comment": "Jesus points to the future Messianic banquet. This statement hints at the perpetual celebration in heaven, reflected liturgically on earth."
    },
    {
      "pk": 22472117,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 17,
      "text": "And he took a cup, and when he had given thanks he said, “Take this, and divide it among yourselves.",
      "links": "",
      "comment": "The sharing of the cup symbolizes unity. The use of a communal cup becomes central to Christian worship."
    },
    {
      "pk": 22472118,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 18,
      "text": "For I tell you that from now on I will not drink of the fruit of the vine until the kingdom of God comes.”",
      "links": "<a href='/AIV/23/25/6'>Isa. 25:6</a>",
      "comment": "Refers to a future fulfillment, alluding to the great feast in God’s kingdom and a lasting liturgical significance."
    },
    {
      "pk": 22472119,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 19,
      "text": "And he took bread, and when he had given thanks, he broke it and gave it to them, saying, “This is my body, which is given for you. Do this in remembrance of me.”",
      "links": "<a href='/AIV/40/26/26'>Matt. 26:26</a>; <a href='/AIV/46/11/24'>1 Cor. 11:24</a>",
      "comment": "The literal words, ‘This is my body,’ have been central to Christian belief in the real presence of Christ in the Eucharist. The command ‘do this’ institutes a ritual, not just a commemoration but an ongoing sacrifice and participation in Jesus’s offering. Compare with Old Testament sacrifices."
    },
    {
      "pk": 22472120,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 20,
      "text": "And likewise the cup after they had eaten, saying, “This cup that is poured out for you is the new covenant in my blood.”",
      "links": "<a href='/AIV/2/24/8'>Ex. 24:8</a>; <a href='/AIV/24/31/31'>Jer. 31:31</a>",
      "comment": "‘New covenant in my blood’ recalls the Mosaic covenant sealed with blood. Jesus is thus both priest and sacrifice. The cup isn’t just symbolic, it’s the application of the covenant. See <a href='/AIV/58/9/15'>Heb. 9:15</a>."
    },
    {
      "pk": 22472121,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 21,
      "text": "But behold, the hand of him who betrays me is with me on the table.",
      "links": "<a href='/AIV/41/14/18'>Mark 14:18</a>",
      "comment": "Jesus is not surprised by betrayal. Sharing the table and yet committing betrayal emphasizes the seriousness of the sin."
    },
    {
      "pk": 22472122,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 22,
      "text": "For the Son of Man goes as it has been determined, but woe to that man by whom he is betrayed!”",
      "links": "<a href='/AIV/19/41/9'>Ps. 41:9</a>; <a href='/AIV/13/17/15'>1 Chr. 17:15</a>",
      "comment": "Divine sovereignty and human responsibility are both affirmed. Fulfillment of prophecy does not excuse the betrayer’s action."
    },
    {
      "pk": 22472123,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 23,
      "text": "And they began to question among themselves, which of them it could be who was going to do this.",
      "links": "",
      "comment": "Self-examination at the Lord’s table is a model for Christian tradition."
    },
    {
      "pk": 22472124,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 24,
      "text": "A dispute also broke out among them, as to which of them was to be regarded as the greatest.",
      "links": "<a href='/AIV/9/9/23'>Num. 9:23</a>",
      "comment": "The disciples' misunderstanding highlights the contrast between earthly and spiritual greatness."
    },
    {
      "pk": 22472125,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 25,
      "text": "And he said to them, “The kings of the Gentiles exercise lordship over them, and those in authority over them are called benefactors.",
      "links": "<a href='/AIV/41/10/42-43'>Mark 10:42-43</a>",
      "comment": "Jesus identifies the worldly model of power. Christians are asked to model a servant leadership."
    },
    {
      "pk": 22472126,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 26,
      "text": "But not so with you. Rather, let the greatest among you become as the youngest, and the leader as one who serves.",
      "links": "<a href='/AIV/40/23/11'>Matt. 23:11</a>",
      "comment": "Jesus institutes a new model of leadership for his community—service, not domination."
    },
    {
      "pk": 22472127,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 27,
      "text": "For who is greater, the one who reclines at table, or the one who serves? Isn’t it the one who reclines at table? But I am among you as one who serves.",
      "links": "<a href='/AIV/40/20/28'>Matt. 20:28</a>",
      "comment": "Jesus exemplifies servant leadership, a model continued through apostolic ministry."
    },
    {
      "pk": 22472128,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 28,
      "text": "You are those who have continued with me in my trials.",
      "links": "<a href='/AIV/43/15/27'>John 15:27</a>",
      "comment": "Faithful endurance with Christ is the condition for reward."
    },
    {
      "pk": 22472129,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 29,
      "text": "And I assign to you, as my Father assigned to me, a kingdom,",
      "links": "<a href='/AIV/27/7/14'>Dan. 7:14</a>",
      "comment": "Jesus bestows a kingdom, as a Father to his heirs—a key theme for the foundation of the visible Church."
    },
    {
      "pk": 22472130,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 30,
      "text": "that you may eat and drink at my table in my kingdom and sit on thrones judging the twelve tribes of Israel.",
      "links": "<a href='/AIV/40/19/28'>Matt. 19:28</a>; <a href='/AIV/66/3/21'>Rev. 3:21</a>",
      "comment": "Jesus promises the apostles a unique authority to rule. This points to an ongoing, visible structure in his community, a perpetual apostolic leadership."
    },
    {
      "pk": 22472131,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 31,
      "text": "“Simon, Simon, behold, Satan demanded to have all of you, that he might sift you like wheat,",
      "links": "<a href='/AIV/18/1/6-12'>Job 1:6-12</a>",
      "comment": "Parallel to the testing of Job. Spiritual leaders face special attack, and God’s plan accommodates even these trials."
    },
    {
      "pk": 22472132,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 32,
      "text": "but I have prayed for you, that your faith may not fail. And when you have turned again, strengthen your brothers.”",
      "links": "<a href='/AIV/43/17/9'>John 17:9</a>",
      "comment": "Jesus’s unique prayer for Peter singles him out as a shepherd with special responsibility. This places Peter as a chief among the apostles, tasked to strengthen the others—an early sign of foundational leadership (see <a href='/AIV/40/16/18'>Matt. 16:18</a>)."
    },
    {
      "pk": 22472133,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 33,
      "text": "And he said to him, “Lord, I am ready to go with you both to prison and to death.”",
      "links": "",
      "comment": "Peter’s devotion is sincere yet lacks foresight. Contrast to his coming denial."
    },
    {
      "pk": 22472134,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 34,
      "text": "Jesus replied, “I tell you, Peter, the rooster will not crow this day before you deny three times that you know me.”",
      "links": "<a href='/AIV/41/14/30'>Mark 14:30</a>",
      "comment": "Jesus’s prophetic knowledge again evidences his divinity, and Peter’s fall points to the mercy and restoration available through repentance."
    },
    {
      "pk": 22472135,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 35,
      "text": "And he said to them, “When I sent you out with no moneybag or knapsack or sandals, did you lack anything?” They said, “Nothing.”",
      "links": "<a href='/AIV/42/9/3'>Luke 9:3</a>",
      "comment": "God provided for the apostles on their mission, showing dependence on divine rather than material resources."
    },
    {
      "pk": 22472136,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 36,
      "text": "He said to them, “But now, let the one who has a moneybag take it, and likewise a knapsack. And let the one who has no sword sell his cloak and buy one.",
      "links": "",
      "comment": "Jesus prepares his disciples for coming trials. The mention of swords is interpreted traditionally as metaphorical, not a call to violence."
    },
    {
      "pk": 22472137,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 37,
      "text": "For I tell you that this Scripture must be fulfilled in me: ‘And he was numbered with the transgressors.’ For what is written about me has its fulfillment.”",
      "links": "<a href='/AIV/23/53/12'>Isa. 53:12</a>",
      "comment": "Jesus is consciously fulfilling messianic prophecy of the Suffering Servant."
    },
    {
      "pk": 22472138,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 38,
      "text": "They said, “Lord, look, here are two swords.” And he said to them, “It is enough.”",
      "links": "",
      "comment": "Jesus dismisses literal violence—he fulfills his mission through suffering, not force."
    },
    {
      "pk": 22472139,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 39,
      "text": "And he went out and made his way, as was his custom, to the Mount of Olives; and the disciples followed him.",
      "links": "<a href='/AIV/38/14/4'>Zech. 14:4</a>",
      "comment": "The Mount of Olives carries deep messianic significance. Jesus’s prayer here fulfills prophetic anticipation."
    },
    {
      "pk": 22472140,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 40,
      "text": "When he came to the place, he said to them, “Pray that you may not enter into temptation.”",
      "links": "<a href='/AIV/40/6/13'>Matt. 6:13</a>",
      "comment": "Prayer is presented as the means to resist temptation and spiritual attack."
    },
    {
      "pk": 22472141,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 41,
      "text": "And he withdrew from them about a stone’s throw, and knelt down and prayed,",
      "links": "<a href='/AIV/42/9/29'>Luke 9:29</a>",
      "comment": "Kneeling demonstrates humility and reverence—an example kept in Christian liturgical tradition."
    },
    {
      "pk": 22472142,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 42,
      "text": "saying, “Father, if you are willing, remove this cup from me. Nevertheless, not my will, but yours, be done.”",
      "links": "<a href='/AIV/19/40/7-8'>Ps. 40:7-8</a>; <a href='/AIV/40/26/39'>Matt. 26:39</a>",
      "comment": "Displays complete obedience to the Father—a model of submitting human will to divine plan."
    },
    {
      "pk": 22472143,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 43,
      "text": "And an angel from heaven appeared to him, strengthening him.",
      "links": "",
      "comment": "Heaven’s response reveals Jesus’s true human weakness and his divine support."
    },
    {
      "pk": 22472144,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 44,
      "text": "And being in agony he prayed more earnestly, and his sweat became like great drops of blood falling down to the ground.",
      "links": "",
      "comment": "The intensity of Jesus’s suffering is described; the imagery of blood points to the coming Passion."
    },
    {
      "pk": 22472145,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 45,
      "text": "And when he rose from prayer, he came to the disciples and found them sleeping for sorrow,",
      "links": "",
      "comment": "Sorrow overwhelms the disciples; humanity’s frailty subtly contrasts with Jesus’s steadfastness."
    },
    {
      "pk": 22472146,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 46,
      "text": "He said to them, “Why are you sleeping? Rise and pray, that you may not enter into temptation.”",
      "links": "",
      "comment": "Jesus repeats instruction to pray—alertness and prayerful vigilance are crucial in spiritual warfare."
    },
    {
      "pk": 22472147,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 47,
      "text": "While he was still speaking, behold, a crowd came, and the man called Judas, one of the twelve, was leading them. He drew near to Jesus to kiss him.",
      "links": "<a href='/AIV/40/26/47-49'>Matt. 26:47-49</a>",
      "comment": "The sign of friendship is turned into an act of betrayal; a powerful image of sacrilege."
    },
    {
      "pk": 22472148,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 48,
      "text": "But Jesus said to him, “Judas, are you betraying the Son of Man with a kiss?”",
      "links": "",
      "comment": "‘Son of Man’ is a messianic and divine title, drawing from Daniel (<a href='/AIV/27/7/13-14'>Dan. 7:13-14</a>), so Jesus’s question emphasizes the gravity of the offense."
    },
    {
      "pk": 22472149,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 49,
      "text": "And when those who were around him saw what was about to happen, they said, “Lord, shall we strike with the sword?”",
      "links": "",
      "comment": "The disciples seek to defend Jesus, but misunderstand the nature of his mission."
    },
    {
      "pk": 22472150,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 50,
      "text": "And one of them struck the servant of the high priest and cut off his right ear.",
      "links": "<a href='/AIV/40/26/51'>Matt. 26:51</a>",
      "comment": "Acting in misguided zeal, the disciple uses violence, which Jesus rebukes."
    },
    {
      "pk": 22472151,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 51,
      "text": "But Jesus answered, “No more of this!” And touching his ear, he healed him.",
      "links": "",
      "comment": "Jesus’s commitment to nonviolence and mercy, even toward his enemies, exemplifies divine forgiveness."
    },
    {
      "pk": 22472152,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 52,
      "text": "Then Jesus said to the chief priests and officers of the temple and elders, who had come against him, “Have you come out as against a robber, with swords and clubs?",
      "links": "",
      "comment": "Jesus reveals their fear and hypocrisy; he is not a violent criminal but is treated as one to fulfill prophecy."
    },
    {
      "pk": 22472153,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 53,
      "text": "When I was with you day after day in the temple, you did not lay hands on me. But this is your hour, and the power of darkness.”",
      "links": "",
      "comment": "‘The power of darkness’ references not just human opposition but the forces opposed to God’s kingdom. See <a href='/AIV/51/1/13'>Col. 1:13</a>."
    },
    {
      "pk": 22472154,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 54,
      "text": "Then they seized him and led him away, bringing him into the high priest’s house. But Peter followed at a distance.",
      "links": "",
      "comment": "Peter’s hesitant loyalty sets up the drama of his denial and subsequent restoration."
    },
    {
      "pk": 22472155,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 55,
      "text": "When they had lit a fire in the middle of the courtyard and sat down together, Peter sat among them.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 22472156,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 56,
      "text": "Then a servant girl, seeing him as he sat in the light, looked closely at him and said, “This man also was with him.”",
      "links": "",
      "comment": ""
    },
    {
      "pk": 22472157,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 57,
      "text": "But he denied it, saying, “Woman, I do not know him.”",
      "links": "",
      "comment": ""
    },
    {
      "pk": 22472158,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 58,
      "text": "A little later someone else saw him and said, “You also are one of them.” But Peter said, “Man, I am not.”",
      "links": "",
      "comment": ""
    },
    {
      "pk": 22472159,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 59,
      "text": "After an interval of about an hour still another insisted, saying, “Certainly this man also was with him, for he too is a Galilean.”",
      "links": "",
      "comment": ""
    },
    {
      "pk": 22472160,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 60,
      "text": "But Peter said, “Man, I do not know what you are talking about.” And immediately, while he was still speaking, the rooster crowed.",
      "links": "",
      "comment": "The rooster’s crow fulfills Jesus’s prophecy, demonstrating again his foreknowledge."
    },
    {
      "pk": 22472161,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 61,
      "text": "And the Lord turned and looked at Peter. And Peter remembered the word of the Lord, how he had said to him, “Before the rooster crows today, you will deny me three times.”",
      "links": "",
      "comment": "Jesus’s glance expresses mercy and invites repentance, leading to Peter’s eventual restoration. The theme of repentance and grace is central."
    },
    {
      "pk": 22472162,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 62,
      "text": "And he went out and wept bitterly.",
      "links": "",
      "comment": "True repentance is deeply emotional, preparing the way for Peter’s future leadership."
    },
    {
      "pk": 22472163,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 63,
      "text": "Now the men who were holding Jesus mocked him and beat him.",
      "links": "",
      "comment": "Fulfillment of the prophecies about the suffering Messiah (<a href='/AIV/23/50/6'>Isa. 50:6</a>)."
    },
    {
      "pk": 22472164,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 64,
      "text": "They blindfolded him and kept asking, “Prophesy! Who is it that struck you?”",
      "links": "",
      "comment": "They mock Jesus’s prophetic gifts, fulfilling predictions of the suffering servant’s humiliation."
    },
    {
      "pk": 22472165,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 65,
      "text": "And they said many other things against him, blaspheming him.",
      "links": "",
      "comment": "Blasphemy against Jesus, despite his innocence, fulfills the suffering servant motif and emphasizes his divinity."
    },
    {
      "pk": 22472166,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 66,
      "text": "When day came, the council of elders of the people, both chief priests and scribes, gathered together, and they led him into their council, saying,",
      "links": "",
      "comment": "The Sanhedrin tribunal assembles for the formal charge. It is both judicial and religious in nature."
    },
    {
      "pk": 22472167,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 67,
      "text": "“If you are the Messiah, tell us.” But he said to them, “If I tell you, you will not believe;",
      "links": "",
      "comment": "The leaders are seeking a reason to condemn, not to understand."
    },
    {
      "pk": 22472168,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 68,
      "text": "and if I ask you, you will not answer.",
      "links": "",
      "comment": "Jesus exposes their heart’s unwillingness and lack of genuine seeking for truth."
    },
    {
      "pk": 22472169,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 69,
      "text": "But from now on the Son of Man will be seated at the right hand of the power of God.”",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/27/7/13-14'>Dan. 7:13-14</a>",
      "comment": "Here Jesus explicitly claims divinity, echoing Old Testament enthronement texts associated only with God. This claim to the right hand of power is unmistakable to his accusers—see also <a href='/AIV/58/1/3'>Heb. 1:3</a>."
    },
    {
      "pk": 22472170,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 70,
      "text": "So they all said, “Are you then the Son of God?” And he said to them, “You say that I am.”",
      "links": "",
      "comment": "Jesus affirms the title, a clear claim to divinity in their understanding. The phrase is an emphatic yet indirect affirmation."
    },
    {
      "pk": 22472171,
      "translation": "AIV",
      "book": 42,
      "chapter": 22,
      "verse": 71,
      "text": "Then they said, “What further need do we have of testimony? We have heard it ourselves from his own mouth.”",
      "links": "",
      "comment": "The council convicts Jesus of blasphemy due to his claim of divine Sonship, setting the stage for the Passion."
    }
  ],
  "translatedAt": "2025-12-23T02:53:42.019Z"
}