{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 20,
  "verses": [
    {
      "pk": 4202001,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 1,
      "text": "One day, as Jesus was teaching the people in the temple and preaching the gospel, the chief priests, the scribes, and the elders came up to him.",
      "links": "<a href='/AIV/41/11/27'>Mark 11:27</a>; <a href='/AIV/40/21/23'>Matthew 21:23</a>",
      "comment": "The context follows Jesus' entry into Jerusalem and cleansing of the temple, showing conflict with the established religious leaders."
    },
    {
      "pk": 4202002,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 2,
      "text": "And they said to him, 'Tell us, by what authority are you doing these things? Or who gave you this authority?'",
      "links": "<a href='/AIV/43/2/18'>John 2:18</a>",
      "comment": "The religious authorities question the source of Jesus' authority, which alludes to the divine nature of his mission."
    },
    {
      "pk": 4202003,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 3,
      "text": "He answered them, 'I also will ask you a question. Tell me,",
      "links": "<a href='/AIV/40/21/24'>Matthew 21:24</a>",
      "comment": "Jesus often responds to challenges with questions to reveal hearts and intentions."
    },
    {
      "pk": 4202004,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 4,
      "text": "Was the baptism of John from heaven or from men?'",
      "links": "<a href='/AIV/41/11/30'>Mark 11:30</a>",
      "comment": "Jesus refers to John’s baptism, connecting it with divine authority. Recognition of John’s mission points to recognition of Jesus."
    },
    {
      "pk": 4202005,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 5,
      "text": "They discussed it among themselves, saying, 'If we say, “From heaven,” he will say, “Why did you not believe him?”",
      "links": "<a href='/AIV/40/21/25'>Matthew 21:25</a>",
      "comment": "The leaders realize the implications; refusing to affirm John implicates their own disbelief."
    },
    {
      "pk": 4202006,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 6,
      "text": "But if we say, “From men,” all the people will stone us, for they are convinced that John was a prophet.'",
      "links": "",
      "comment": "Fear of the people influences the leadership's response, underlying their political motivation."
    },
    {
      "pk": 4202007,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 7,
      "text": "So they answered that they did not know where it was from.",
      "links": "",
      "comment": "Their refusal to answer shows their lack of integrity and spiritual blindness."
    },
    {
      "pk": 4202008,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 8,
      "text": "And Jesus said to them, 'Neither will I tell you by what authority I do these things.'",
      "links": "<a href='/AIV/40/21/27'>Matthew 21:27</a>",
      "comment": "Jesus withholds a direct response to those with hardened hearts. Divine authority is revealed to the humble, not the proud."
    },
    {
      "pk": 4202009,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 9,
      "text": "Then he began to tell the people this parable: 'A man planted a vineyard, leased it to tenants, and went into another country for a long time.",
      "links": "<a href='/AIV/23/5/1-7'>Isaiah 5:1-7</a>; <a href='/AIV/41/12/1-12'>Mark 12:1-12</a>",
      "comment": "The vineyard is a common Old Testament image for Israel. The parable addresses God's dealings with Israel."
    },
    {
      "pk": 4202010,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 10,
      "text": "When the season came, he sent a servant to the tenants so that they would give him some of the fruit of the vineyard. But the tenants beat him and sent him away empty-handed.",
      "links": "",
      "comment": "The servants represent the prophets sent to Israel."
    },
    {
      "pk": 4202011,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 11,
      "text": "He sent another servant, but they also beat and treated him shamefully, and sent him away empty-handed.",
      "links": "",
      "comment": "Repeated rejections highlight Israel’s mistreatment of God’s messengers."
    },
    {
      "pk": 4202012,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 12,
      "text": "He sent yet a third; this one also they wounded and threw out.",
      "links": "",
      "comment": "The increasing violence shows escalating rejection of God’s will."
    },
    {
      "pk": 4202013,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 13,
      "text": "Then the owner of the vineyard said, ‘What shall I do? I will send my beloved son; perhaps they will respect him.’",
      "links": "<a href='/AIV/40/3/17'>Matthew 3:17</a>",
      "comment": "The 'beloved son' is a reference to Jesus himself, making a direct claim to unique sonship and authority (high Christology)."
    },
    {
      "pk": 4202014,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 14,
      "text": "But when the tenants saw him, they said to themselves, ‘This is the heir. Let’s kill him, so that the inheritance may be ours.’",
      "links": "",
      "comment": "This foreshadows the plot to kill Jesus."
    },
    {
      "pk": 4202015,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 15,
      "text": "So they threw him out of the vineyard and killed him. What then will the owner of the vineyard do to them?",
      "links": "",
      "comment": "The crucifixion of Jesus is foretold in this parable."
    },
    {
      "pk": 4202016,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 16,
      "text": "'He will come and destroy those tenants and give the vineyard to others.' When they heard this, they said, 'May it never be!'",
      "links": "",
      "comment": "Judgment is announced, and the inheritance is given to those who accept the son (hinting at succession and universal mission of the Church)."
    },
    {
      "pk": 4202017,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 17,
      "text": "But he looked straight at them and said, 'Then what is this that is written: “The stone that the builders rejected has become the cornerstone”?'",
      "links": "<a href='/AIV/19/118/22'>Psalm 118:22</a>; <a href='/AIV/60/2/4-7'>1 Peter 2:4-7</a>",
      "comment": "Jesus is the cornerstone prophesied in the Psalms, tying Old Testament prophecy to his messianic identity."
    },
    {
      "pk": 4202018,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 18,
      "text": "Everyone who falls on that stone will be broken to pieces, but if it falls on anyone, it will crush him.'",
      "links": "<a href='/AIV/27/2/34-35'>Daniel 2:34-35</a>",
      "comment": "Christ as cornerstone is both foundation and instrument of judgment (see Daniel’s vision of divine kingdom)."
    },
    {
      "pk": 4202019,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 19,
      "text": "The scribes and the chief priests sought to lay hands on him at that very hour, for they knew that he had spoken this parable against them, but they feared the people.",
      "links": "",
      "comment": "Religious authorities recognize Jesus’ warning and show their continued rejection."
    },
    {
      "pk": 4202020,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 20,
      "text": "So they watched him and sent spies, who pretended to be sincere, so that they might catch him in something he said, to hand him over to the authority and power of the governor.",
      "links": "<a href='/AIV/41/12/13'>Mark 12:13</a>",
      "comment": "Opposition increases as authorities try to trap Jesus through craftiness."
    },
    {
      "pk": 4202021,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 21,
      "text": "They asked him, 'Teacher, we know that you speak and teach rightly, and show no partiality, but truly teach the way of God.",
      "links": "",
      "comment": "Insincere praise is used as a prelude to their question."
    },
    {
      "pk": 4202022,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 22,
      "text": "Is it lawful for us to pay taxes to Caesar, or not?'",
      "links": "<a href='/AIV/41/12/14'>Mark 12:14</a>",
      "comment": "This was a politically charged question, designed to trap Jesus between Roman law and Jewish sentiment."
    },
    {
      "pk": 4202023,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 23,
      "text": "But he perceived their craftiness and said to them,",
      "links": "",
      "comment": "Jesus discerns their hearts, a sign of divine wisdom."
    },
    {
      "pk": 4202024,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 24,
      "text": "'Show me a denarius. Whose image and inscription does it have?' They said, 'Caesar’s.'",
      "links": "",
      "comment": "Jesus uses the coin as a concrete teaching tool."
    },
    {
      "pk": 4202025,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 25,
      "text": "He said to them, 'Then give to Caesar the things that are Caesar’s, and to God the things that are God’s.'",
      "links": "<a href='/AIV/40/22/21'>Matthew 22:21</a>",
      "comment": "Acknowledges legitimate authority of civil government, while affirming God’s ultimate claim on the person. Early Christian teaching on two kingdoms."
    },
    {
      "pk": 4202026,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 26,
      "text": "And they were not able to catch him in what he said in the presence of the people, and astonished by his answer, they became silent.",
      "links": "",
      "comment": "Christ’s wisdom silences his adversaries."
    },
    {
      "pk": 4202027,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 27,
      "text": "Some of the Sadducees, who say that there is no resurrection, came to him.",
      "links": "<a href='/AIV/44/23/8'>Acts 23:8</a>",
      "comment": "The Sadducees denied the resurrection, differing from the Pharisees and most Jews."
    },
    {
      "pk": 4202028,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 28,
      "text": "They asked him, 'Teacher, Moses wrote for us that if a man’s brother dies, having a wife but no children, the man must take the widow and raise up children for his brother.'",
      "links": "<a href='/AIV/5/25/5'>Deuteronomy 25:5</a>",
      "comment": "Reference to the levirate marriage law from Deuteronomy."
    },
    {
      "pk": 4202029,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 29,
      "text": "Now there were seven brothers. The first took a wife, and died without children.",
      "links": "",
      "comment": "A hypothetical case commonly used in rabbinic debates."
    },
    {
      "pk": 4202030,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 30,
      "text": "The second",
      "links": "",
      "comment": "Continuing the hypothetical scenario."
    },
    {
      "pk": 4202031,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 31,
      "text": "and the third took her, and likewise all seven left no children and died.",
      "links": "",
      "comment": "The point is to show an absurdity in the resurrection."
    },
    {
      "pk": 4202032,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 32,
      "text": "Afterward, the woman also died.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4202033,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 33,
      "text": "In the resurrection, therefore, whose wife will the woman be? For all seven had her as wife.'",
      "links": "",
      "comment": "The challenge exposes Sadducean misunderstanding of life after death."
    },
    {
      "pk": 4202034,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 34,
      "text": "And Jesus said to them, 'The sons of this age marry and are given in marriage,",
      "links": "",
      "comment": "He begins to clarify that resurrection life is different from earthly life."
    },
    {
      "pk": 4202035,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 35,
      "text": "but those considered worthy to attain to that age and to the resurrection from the dead neither marry nor are given in marriage.",
      "links": "",
      "comment": "He points to the transformation of relationships; marriage is for this age, not the next. This verse has underpinned later Christian teaching on celibacy as a sign of the kingdom to come."
    },
    {
      "pk": 4202036,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 36,
      "text": "For they cannot die anymore, because they are equal to angels and are sons of God, being sons of the resurrection.",
      "links": "<a href='/AIV/66/21/4'>Revelation 21:4</a>",
      "comment": "The resurrection brings eternal life, sharing the life of the angels."
    },
    {
      "pk": 4202037,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 37,
      "text": "But that the dead are raised, even Moses showed, at the bush, when he called the Lord the God of Abraham, the God of Isaac, and the God of Jacob.",
      "links": "<a href='/AIV/2/3/6'>Exodus 3:6</a>",
      "comment": "Jesus grounds the truth of the resurrection in the Scriptures recognized by the Sadducees (the Torah)."
    },
    {
      "pk": 4202038,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 38,
      "text": "Now he is not the God of the dead, but of the living, for all live to him.'",
      "links": "",
      "comment": "God’s relationship with the patriarchs means they are alive to him, affirming the resurrection."
    },
    {
      "pk": 4202039,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 39,
      "text": "Then some of the scribes answered, 'Teacher, you have spoken well.'",
      "links": "",
      "comment": "Some scribes (not Sadducees) express approval."
    },
    {
      "pk": 4202040,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 40,
      "text": "For they no longer dared to ask him any question.",
      "links": "",
      "comment": "All opposition falls silent before Jesus’ teaching authority."
    },
    {
      "pk": 4202041,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 41,
      "text": "But he said to them, 'How can they say that the Christ is David’s son?",
      "links": "<a href='/AIV/19/110/1'>Psalm 110:1</a>",
      "comment": "Jesus is pressing them on the identity of the Messiah and his divine status."
    },
    {
      "pk": 4202042,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 42,
      "text": "For David himself says in the Book of Psalms, “The Lord said to my Lord, ‘Sit at my right hand,",
      "links": "<a href='/AIV/19/110/1'>Psalm 110:1</a>",
      "comment": "Quoting Psalm 110, a key messianic and high Christology passage."
    },
    {
      "pk": 4202043,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 43,
      "text": "until I make your enemies your footstool.”'",
      "links": "<a href='/AIV/19/110/1'>Psalm 110:1</a>",
      "comment": "The Messiah is not just David’s descendant but his Lord—an implicit claim of divinity."
    },
    {
      "pk": 4202044,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 44,
      "text": "David thus calls him Lord, so how is he his son?'",
      "links": "",
      "comment": "Jesus shows the Messiah's identity as both the Son of David and the Son of God—affirming his own divinity."
    },
    {
      "pk": 4202045,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 45,
      "text": "And in the hearing of all the people he said to his disciples,",
      "links": "",
      "comment": ""
    },
    {
      "pk": 4202046,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 46,
      "text": "'Beware of the scribes, who like to walk around in long robes, and love greetings in the marketplaces and the best seats in the synagogues and places of honor at feasts,",
      "links": "<a href='/AIV/40/23/5-7'>Matthew 23:5-7</a>",
      "comment": "Warning against religious hypocrisy and the temptation to seek honor rather than service."
    },
    {
      "pk": 4202047,
      "translation": "AIV",
      "book": 3,
      "chapter": 20,
      "verse": 47,
      "text": "who devour widows’ houses and for a pretense make long prayers. They will receive greater condemnation.'",
      "links": "",
      "comment": "Sincere devotion and concern for justice are central. Jesus warns that spiritual leaders will be held accountable—implied encouragement to seek humble, genuine leaders, unified doctrine, and sacramental life."
    }
  ],
  "translatedAt": "2025-12-23T02:52:10.076Z"
}