{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 8,
  "verses": [
    {
      "pk": 4008001,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 1,
      "text": "Soon afterward, Jesus traveled through cities and villages, proclaiming and bringing the good news of the kingdom of God. The Twelve were with him,",
      "links": "<a href='/AIV/40/4/23'>Matt. 4:23</a>; <a href='/AIV/41/1/14-15'>Mark 1:14-15</a>",
      "comment": "Jesus' proclamation of the Kingdom fulfills Old Testament expectations, see Isaiah 61:1. The Twelve being with Him shows the formation of the apostolic foundation of the Church."
    },
    {
      "pk": 4008002,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 2,
      "text": "and also some women who had been healed of evil spirits and diseases: Mary, called Magdalene, from whom seven demons had gone out,",
      "links": "<a href='/AIV/41/16/9'>Mark 16:9</a>",
      "comment": "The reference to Mary Magdalene stresses her transformation and significant role, foreshadowing the dignity women will have among Christ's followers."
    },
    {
      "pk": 4008003,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 3,
      "text": "and Joanna, the wife of Chuza, Herod's household manager, and Susanna, and many others, who provided for them out of their resources.",
      "links": "",
      "comment": "These women supported Jesus' ministry materially, hinting at the importance of lay involvement and stewardship in the Church's mission throughout history."
    },
    {
      "pk": 4008004,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 4,
      "text": "When a large crowd was gathering and people from every town were coming to him, he spoke in a parable:",
      "links": "<a href='/AIV/40/13/2-3'>Matt. 13:2-3</a>",
      "comment": "Jesus teaches in parables, fulfilling prophecy about speaking in riddles (Psalm 78:2) and displaying his divine wisdom that reveals truths to those open to Him."
    },
    {
      "pk": 4008005,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 5,
      "text": "\"A sower went out to sow his seed. As he sowed, some fell along the path, and was trampled underfoot, and the birds of the air devoured it.",
      "links": "<a href='/AIV/40/13/4'>Matt. 13:4</a>; <a href='/AIV/41/4/4'>Mark 4:4</a>",
      "comment": "The parable prepares to teach about the response to God's word—both literal meaning and spiritual growth are addressed."
    },
    {
      "pk": 4008006,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 6,
      "text": "Other seed fell on the rock, and as it grew up, it withered away because it had no moisture.",
      "links": "<a href='/AIV/40/13/5-6'>Matt. 13:5-6</a>",
      "comment": "The lack of moisture refers to those who lack roots in faith—lessons on perseverance and spiritual sustenance."
    },
    {
      "pk": 4008007,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 7,
      "text": "Other seed fell among thorns, and the thorns grew up with it and choked it.",
      "links": "<a href='/AIV/41/4/7'>Mark 4:7</a>",
      "comment": "The choking thorns evoke worldly distractions; the Church's teaching preserves seed from being lost in worldliness."
    },
    {
      "pk": 4008008,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 8,
      "text": "Other seed fell into good soil and grew and yielded a hundredfold.\" As he said these things, he called out, \"He who has ears to hear, let him hear!\"",
      "links": "<a href='/AIV/40/13/8-9'>Matt. 13:8-9</a>",
      "comment": "A fruitful harvest calls Christians to bear spiritual fruit, cooperating with grace. 'He who has ears...' invites personal response."
    },
    {
      "pk": 4008009,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 9,
      "text": "His disciples asked him what this parable meant.",
      "links": "",
      "comment": "Clear sign that even disciples required authoritative interpretation, reflecting the ongoing need for a living teaching authority."
    },
    {
      "pk": 4008010,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 10,
      "text": "He said, \"To you it has been given to know the secrets of the kingdom of God, but to others they are in parables, so that, 'seeing they may not see, and hearing they may not understand.'\"",
      "links": "<a href='/AIV/23/6/9'>Isa. 6:9</a>; <a href='/AIV/41/4/11-12'>Mark 4:11-12</a>",
      "comment": "Jesus quotes Isaiah 6:9. The mystery of the kingdom is revealed to those close to Him, showing a distinction in understanding within the community of believers."
    },
    {
      "pk": 4008011,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 11,
      "text": "\"Now the parable is this: The seed is the word of God.",
      "links": "<a href='/AIV/60/1/23'>1 Pet. 1:23</a>",
      "comment": "The spoken word of God has power to transform; it is living and active (Heb. 4:12)."
    },
    {
      "pk": 4008012,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 12,
      "text": "The ones along the path are those who have heard; then the devil comes and takes away the word from their hearts, so they may not believe and be saved.",
      "links": "<a href='/AIV/47/4/4'>2 Cor. 4:4</a>",
      "comment": "Spiritual warfare is real and can prevent faith from taking root. Salvation is connected to faith received in the heart."
    },
    {
      "pk": 4008013,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 13,
      "text": "And the ones on the rock are those who, when they hear the word, receive it with joy. But these have no root; they believe for a little while, and in time of testing fall away.",
      "links": "<a href='/AIV/40/13/20-21'>Matt. 13:20-21</a>",
      "comment": "Endurance in faith is necessary. Early joy must be deepened by perseverance and communion with God through prayer and sacrament."
    },
    {
      "pk": 4008014,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 14,
      "text": "As for what fell among the thorns, they are those who hear, but as they go on their way they are choked by the cares, riches, and pleasures of life, and their fruit does not mature.",
      "links": "",
      "comment": "Material distractions and worries can hinder spiritual growth. Calls Christians to a detachment from earthly things."
    },
    {
      "pk": 4008015,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 15,
      "text": "As for the seed in the good soil, they are those who, hearing the word, hold it fast in an honest and good heart, and bear fruit with patience.",
      "links": "<a href='/AIV/40/13/23'>Matt. 13:23</a>",
      "comment": "Spiritual maturity requires perseverance and cooperation with God’s grace, resulting in good works."
    },
    {
      "pk": 4008016,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 16,
      "text": "\"No one, after lighting a lamp, covers it with a jar or puts it under a bed, but sets it on a stand, so those who enter may see the light.",
      "links": "<a href='/AIV/40/5/15-16'>Matt. 5:15-16</a>",
      "comment": "The light symbolizes God’s truth revealed through Christ and His followers; the Church is called to be visible in the world."
    },
    {
      "pk": 4008017,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 17,
      "text": "For nothing is hidden that will not be made manifest, nor is anything secret that will not be known and come to light.",
      "links": "<a href='/AIV/41/4/22'>Mark 4:22</a>",
      "comment": "Divine truth will ultimately be revealed. This also hints at the reality of future judgment."
    },
    {
      "pk": 4008018,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 18,
      "text": "Therefore take care how you hear, for to the one who has, more will be given, and from the one who does not have, even what he thinks he has will be taken away.\"",
      "links": "<a href='/AIV/40/25/29'>Matt. 25:29</a>",
      "comment": "Responsibility with spiritual gifts and understanding is emphasized; those who are faithful receive more, recalling the parable of the talents."
    },
    {
      "pk": 4008019,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 19,
      "text": "Then his mother and brothers came to him, but they could not reach him because of the crowd.",
      "links": "<a href='/AIV/40/12/46'>Matt. 12:46</a>",
      "comment": "Jesus’ physical family seeks him; their approach highlights both the honor of his mother and the new family Jesus forms in faith."
    },
    {
      "pk": 4008020,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 20,
      "text": "And he was told, \"Your mother and your brothers are standing outside, wanting to see you.\"",
      "links": "",
      "comment": "Emphasizes the relational closeness Jesus' mother maintains, while preparing for a teaching moment on spiritual kinship."
    },
    {
      "pk": 4008021,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 21,
      "text": "But he answered them, \"My mother and my brothers are those who hear the word of God and do it.\"",
      "links": "<a href='/AIV/40/12/50'>Matt. 12:50</a>; <a href='/AIV/59/1/22'>James 1:22</a>",
      "comment": "Hearing and doing God’s word defines membership in Christ’s family, underscoring obedience and the Church as a spiritual family."
    },
    {
      "pk": 4008022,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 22,
      "text": "One day he got into a boat with his disciples, and he said to them, \"Let us go across to the other side of the lake.\" So they set out,",
      "links": "<a href='/AIV/41/4/35'>Mark 4:35</a>",
      "comment": "Jesus leading the disciples into the boat foreshadows the journey of faith guided by His presence."
    },
    {
      "pk": 4008023,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 23,
      "text": "and while they were sailing, he fell asleep. And a windstorm came down on the lake, and they were filling with water and were in danger.",
      "links": "",
      "comment": "Jesus’ sleep shows his true humanity, and the disciples' danger highlights human vulnerability."
    },
    {
      "pk": 4008024,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 24,
      "text": "And they went and woke him, saying, \"Master, Master, we are perishing!\" And he awoke and rebuked the wind and the raging waves, and they ceased, and there was a calm.",
      "links": "<a href='/AIV/19/107/29'>Ps. 107:29</a>",
      "comment": "Christ, by his word, commands nature—revealing his divinity (Ps. 107:29) and authority over creation."
    },
    {
      "pk": 4008025,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 25,
      "text": "He said to them, \"Where is your faith?\" And they were afraid and marveled, saying to one another, \"Who then is this, that he commands even the winds and water, and they obey him?\"",
      "links": "<a href='/AIV/41/4/41'>Mark 4:41</a>",
      "comment": "The disciples’ awe shows recognition of Jesus’ divine authority—a revelation of his true identity."
    },
    {
      "pk": 4008026,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 26,
      "text": "Then they sailed to the region of the Gerasenes, which is opposite Galilee.",
      "links": "<a href='/AIV/40/8/28'>Matt. 8:28</a>",
      "comment": "Sets the stage for a significant exorcism. The geographic detail is historically accurate."
    },
    {
      "pk": 4008027,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 27,
      "text": "When he stepped out on land, there met him a man from the city who had demons. For a long time he had worn no clothes, and had not lived in a house, but among the tombs.",
      "links": "<a href='/AIV/41/5/2-3'>Mark 5:2-3</a>",
      "comment": "Demonic possession is described vividly, reflecting the disruptive power of evil apart from Christ."
    },
    {
      "pk": 4008028,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 28,
      "text": "When he saw Jesus, he cried out and fell before him and said with a loud voice, \"What have you to do with me, Jesus, Son of the Most High God? I beg you, do not torment me.\"",
      "links": "<a href='/AIV/41/1/24'>Mark 1:24</a>",
      "comment": "Even demons recognize Jesus’ divine identity, foreshadowing every knee bowing to Him (Phil. 2:10)."
    },
    {
      "pk": 4008029,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 29,
      "text": "For Jesus had commanded the unclean spirit to come out of the man. Many times it had seized him, and he was kept under guard and bound with chains and shackles; but he would break the bonds and be driven by the demon into the deserts.",
      "links": "",
      "comment": "Demons overpower human restraint, but Jesus’ command is absolute. This shows his divine authority over evil."
    },
    {
      "pk": 4008030,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 30,
      "text": "Jesus asked him, \"What is your name?\" He said, \"Legion,\" for many demons had entered him.",
      "links": "",
      "comment": "The response 'Legion' represents overwhelming evil, but Christ’s authority is greater still."
    },
    {
      "pk": 4008031,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 31,
      "text": "And they begged him not to command them to depart into the abyss.",
      "links": "<a href='/AIV/66/20/3'>Rev. 20:3</a>",
      "comment": "Demons fear ultimate judgment and recognize Christ’s power to condemn them (see Rev. 20:3)."
    },
    {
      "pk": 4008032,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 32,
      "text": "Now a large herd of pigs was feeding there on the hillside, and they begged him to let them enter these. So he gave them permission.",
      "links": "",
      "comment": "The Lord's permission shows his sovereignty; pigs represent uncleanness in Jewish law."
    },
    {
      "pk": 4008033,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 33,
      "text": "Then the demons came out of the man and entered the pigs, and the herd rushed down the steep bank into the lake and drowned.",
      "links": "",
      "comment": "The destruction of the pigs makes visible the destructive intentions of the demons, and the power of God to free."
    },
    {
      "pk": 4008034,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 34,
      "text": "When the herdsmen saw what had happened, they fled and reported it in the city and in the countryside.",
      "links": "",
      "comment": "Eyewitness testimony spreads news of Jesus’ miraculous authority, foreshadowing later evangelization."
    },
    {
      "pk": 4008035,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 35,
      "text": "People went out to see what had happened, and they came to Jesus and found the man from whom the demons had gone, sitting at Jesus' feet, clothed and in his right mind, and they were afraid.",
      "links": "",
      "comment": "Sitting at Jesus’ feet implies discipleship and transformation—conversion involves restoration and submission to Christ."
    },
    {
      "pk": 4008036,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 36,
      "text": "Those who had seen it told them how the demon-possessed man had been healed.",
      "links": "",
      "comment": "Testimony to Christ’s healing power encourages belief in His divinity and mission."
    },
    {
      "pk": 4008037,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 37,
      "text": "Then all the people of the surrounding region of the Gerasenes asked Jesus to depart from them, because they were seized with great fear. So he got into the boat and returned.",
      "links": "",
      "comment": "Fear in the face of divine power contrasts with the openness of faith; it is possible to reject God’s presence out of misunderstanding or fear."
    },
    {
      "pk": 4008038,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 38,
      "text": "The man from whom the demons had gone begged that he might be with him, but Jesus sent him away, saying,",
      "links": "",
      "comment": "Personal discipleship sometimes means remaining where one is, bearing witness at home—a model for laity’s mission."
    },
    {
      "pk": 4008039,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 39,
      "text": "\"Return to your home, and declare how much God has done for you.\" So he went away, proclaiming throughout the whole city how much Jesus had done for him.",
      "links": "",
      "comment": "Jesus equates His own works with those of God, an implicit claim to divinity (see also John 10:30)."
    },
    {
      "pk": 4008040,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 40,
      "text": "Now when Jesus returned, the crowd welcomed him, for they were all waiting for him.",
      "links": "",
      "comment": "Anticipation grows around Jesus, echoing the longing for the Messiah throughout Israel."
    },
    {
      "pk": 4008041,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 41,
      "text": "Then a man named Jairus, who was a ruler of the synagogue, came and fell at Jesus’ feet, begging him to come to his house,",
      "links": "<a href='/AIV/41/5/22'>Mark 5:22</a>",
      "comment": "A religious leader seeks Jesus’ help publicly, demonstrating faith and humility."
    },
    {
      "pk": 4008042,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 42,
      "text": "for he had an only daughter, about twelve years old, and she was dying. As he went, the crowds pressed around him.",
      "links": "",
      "comment": "The girl's age (12) often symbolizes fullness in biblical tradition, hinting at spiritual completion."
    },
    {
      "pk": 4008043,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 43,
      "text": "And there was a woman who had a discharge of blood for twelve years, and though she had spent all her living on physicians, she could not be healed by anyone.",
      "links": "<a href='/AIV/03/15/25'>Lev. 15:25</a>",
      "comment": "Twelve years links this woman’s suffering to the girl—a theme of restoration and new life. Her ritual impurity made her situation even more desperate."
    },
    {
      "pk": 4008044,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 44,
      "text": "She came up behind him and touched the fringe of his garment, and immediately her flow of blood stopped.",
      "links": "<a href='/AIV/04/15/38'>Num. 15:38</a>",
      "comment": "Touching the fringe refers to the religious tassel, a symbol of holiness. Her faith in Christ brings immediate healing, showing the efficacy of physical contact with Christ—see sacramental overtones."
    },
    {
      "pk": 4008045,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 45,
      "text": "And Jesus said, \"Who was it that touched me?\" When all denied it, Peter said, \"Master, the crowds surround you and are pressing in on you!\"",
      "links": "",
      "comment": "Peter acts as spokesman for the disciples—the importance of an authoritative leader is implied."
    },
    {
      "pk": 4008046,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 46,
      "text": "But Jesus said, \"Someone touched me, for I perceived that power had gone out from me.\"",
      "links": "",
      "comment": "Jesus is aware of this healing, indicating his divinity—he both knows all and dispenses healing power."
    },
    {
      "pk": 4008047,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 47,
      "text": "When the woman saw that she was not hidden, she came trembling, and falling down before him, declared in the presence of all the people why she had touched him, and how she had been healed immediately.",
      "links": "",
      "comment": "Public confession of faith is modeled here. Her humility and openness foreshadow sacramental confession."
    },
    {
      "pk": 4008048,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 48,
      "text": "And he said to her, \"Daughter, your faith has made you well; go in peace.\"",
      "links": "<a href='/AIV/41/5/34'>Mark 5:34</a>",
      "comment": "Faith is the means of healing—fullness of peace is pronounced, pointing to wholeness found in Christ."
    },
    {
      "pk": 4008049,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 49,
      "text": "While he was still speaking, someone from the house of the ruler of the synagogue came and said, \"Your daughter is dead; do not trouble the Teacher any longer.\"",
      "links": "",
      "comment": "Despair contrasts with faith, setting up Christ’s demonstration of power over death."
    },
    {
      "pk": 4008050,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 50,
      "text": "But Jesus on hearing this answered him, \"Do not fear; only believe, and she will be made well.\"",
      "links": "",
      "comment": "Faith is required to see the fullness of Jesus’ healing and life-giving power—this is a call to trust Christ beyond human limits."
    },
    {
      "pk": 4008051,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 51,
      "text": "When he came to the house, he allowed no one to enter with him, except Peter and John and James, and the child's father and mother.",
      "links": "<a href='/AIV/41/5/37'>Mark 5:37</a>",
      "comment": "The inner circle is present for the raising—pointing to an order of leadership among the apostles."
    },
    {
      "pk": 4008052,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 52,
      "text": "All were weeping and mourning for her, but he said, \"Do not weep, for she is not dead but sleeping.\"",
      "links": "",
      "comment": "Jesus refers to death as sleep, revealing his authority to awaken the dead and foreshadowing Christian hope in resurrection."
    },
    {
      "pk": 4008053,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 53,
      "text": "And they laughed at him, knowing that she was dead.",
      "links": "",
      "comment": "Skepticism meets Christ’s power—a common reaction before a miracle, but unbelief cannot counteract Jesus’ authority."
    },
    {
      "pk": 4008054,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 54,
      "text": "But he, taking her by the hand, called, saying, \"Child, arise.\"",
      "links": "<a href='/AIV/41/5/41'>Mark 5:41</a>",
      "comment": "Jesus raises her by the power of His word and touch—a foreshadow of the resurrection and the efficacy of Christ’s physical contact."
    },
    {
      "pk": 4008055,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 55,
      "text": "And her spirit returned, and she got up at once. And he directed that something should be given her to eat.",
      "links": "",
      "comment": "Resurrection and restoration are completed with a return to normal life, the fullness of healing."
    },
    {
      "pk": 4008056,
      "translation": "AIV",
      "book": 42,
      "chapter": 8,
      "verse": 56,
      "text": "And her parents were amazed, but he ordered them to tell no one what had happened.",
      "links": "",
      "comment": "The command for silence anticipates the full revelation of Christ’s identity after his death and resurrection. The miracles both confirm faith and point beyond themselves to God’s ultimate work in Christ."
    }
  ],
  "translatedAt": "2025-12-23T02:43:43.664Z"
}