{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 5,
  "verses": [
    {
      "pk": 2014001,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 1,
      "text": "One day, while the crowd was pressing in to hear the word of God, Jesus was standing by the Lake of Gennesaret.",
      "links": "<a href='/AIV/43/6/2'>John 6:2</a>",
      "comment": "Luke emphasizes the eagerness of people to hear Jesus, highlighting His authority in teaching the word of God."
    },
    {
      "pk": 2014002,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 2,
      "text": "He saw two boats by the lake, but the fishermen had left them and were washing their nets.",
      "links": "<a href='/AIV/40/4/18'>Matt. 4:18</a>; <a href='/AIV/41/1/16'>Mark 1:16</a>",
      "comment": "The detail about fishermen washing nets underscores the daily realities of life and sets the stage for Jesus’ call."
    },
    {
      "pk": 2014003,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 3,
      "text": "He got into one of the boats, the one belonging to Simon, and asked him to put out a little from land. Then He sat down and taught the crowds from the boat.",
      "links": "<a href='/AIV/40/13/2'>Matt. 13:2</a>",
      "comment": "Jesus teaching from Simon’s boat foreshadows Simon Peter’s later leadership among the apostles."
    },
    {
      "pk": 2014004,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 4,
      "text": "When He had finished speaking, He said to Simon, 'Put out into the deep water and let down your nets for a catch.'",
      "links": "<a href='/AIV/43/21/6'>John 21:6</a>",
      "comment": "A direct command from Jesus. The instruction to go into 'deep water' hints at a spiritual call to trust in Christ beyond human understanding."
    },
    {
      "pk": 2014005,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 5,
      "text": "Simon answered, 'Master, we worked hard all night and caught nothing. But at Your word, I will let down the nets.'",
      "links": "<a href='/AIV/40/8/8'>Matt. 8:8</a>",
      "comment": "Peter’s obedience shows trust in Jesus’ authority even when it seems unreasonable, a model for faith."
    },
    {
      "pk": 2014006,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 6,
      "text": "When they had done this, they caught so many fish their nets began to break.",
      "links": "<a href='/AIV/43/21/11'>John 21:11</a>",
      "comment": "The miraculous catch symbolizes the abundant grace found in following Christ."
    },
    {
      "pk": 2014007,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 7,
      "text": "So they signaled to their partners in the other boat to come and help them. They came and filled both boats so full that they began to sink.",
      "links": "<a href='/AIV/40/13/47-50'>Matt. 13:47–50</a>",
      "comment": "The shared bounty prefigures the communal nature and unity of the Church, where blessings are meant to be shared among all."
    },
    {
      "pk": 2014008,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 8,
      "text": "When Simon Peter saw it, he fell down at Jesus’ knees, saying, 'Depart from me, Lord! For I am a sinful man.'",
      "links": "<a href='/AIV/23/6/5'>Isaiah 6:5</a>",
      "comment": "Peter’s response echoes the prophets’ reaction to God's holiness, hinting at Jesus’ divine status. Calling Jesus 'Lord' is a strong theological claim."
    },
    {
      "pk": 2014009,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 9,
      "text": "For he and all who were with him were astonished at the catch of fish they had taken.",
      "links": "<a href='/AIV/40/8/27'>Matt. 8:27</a>",
      "comment": "Miracle produces awe, a typical reaction to encounters with the divine throughout Scripture."
    },
    {
      "pk": 2014010,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 10,
      "text": "So were James and John, sons of Zebedee, partners with Simon. Jesus said to Simon, 'Do not be afraid; from now on you will be catching men.'",
      "links": "<a href='/AIV/40/4/19'>Matt. 4:19</a>; <a href='/AIV/41/1/17'>Mark 1:17</a>",
      "comment": "Jesus gives the apostles a new mission, indicating their unique role and future authority in the Church. The new calling suggests a spiritual priesthood."
    },
    {
      "pk": 2014011,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 11,
      "text": "When they brought their boats to land, they left everything and followed Him.",
      "links": "<a href='/AIV/40/19/27'>Matt. 19:27</a>; <a href='/AIV/41/10/28'>Mark 10:28</a>",
      "comment": "The disciples’ total commitment prefigures the call to radical discipleship and renunciation for Christ."
    },
    {
      "pk": 2014012,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 12,
      "text": "While He was in one of the towns, a man full of leprosy came to Him. When he saw Jesus, he fell on his face and pleaded, 'Lord, if You are willing, You can make me clean.'",
      "links": "<a href='/AIV/40/8/2'>Matt. 8:2</a>; <a href='/AIV/41/1/40'>Mark 1:40</a>",
      "comment": "Leprosy was symbolic of spiritual uncleanliness; the leper’s faith and reverence show recognition of Jesus' power to heal and purify."
    },
    {
      "pk": 2014013,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 13,
      "text": "And Jesus stretched out His hand and touched him, saying, 'I am willing. Be cleansed.' Immediately, the leprosy left him.",
      "links": "<a href='/AIV/2/4/7'>Ex. 4:7</a>",
      "comment": "The physical touch shows sacramental aspects of Jesus' ministry, conveying grace through material means."
    },
    {
      "pk": 2014014,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 14,
      "text": "Then He ordered him not to tell anyone, but said, 'Go, show yourself to the priest and offer for your cleansing what Moses commanded, as a testimony to them.'",
      "links": "<a href='/AIV/3/14/2'>Leviticus 14:2</a>",
      "comment": "Jesus respects the Law of Moses, affirming the necessity of priestly mediation and continuity with the Old Covenant."
    },
    {
      "pk": 2014015,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 15,
      "text": "But the report about Him spread even more, and great crowds came to hear Him and to be healed of their diseases.",
      "links": "<a href='/AIV/41/1/45'>Mark 1:45</a>",
      "comment": "Jesus’ fame grows because of His power to heal and teach, indicating His public ministry’s impact."
    },
    {
      "pk": 2014016,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 16,
      "text": "But He often withdrew to lonely places and prayed.",
      "links": "<a href='/AIV/40/14/23'>Matt. 14:23</a>; <a href='/AIV/41/1/35'>Mark 1:35</a>",
      "comment": "Jesus models prayer, continuing the tradition of the prophets and indicating the centrality of prayer in the life of believers."
    },
    {
      "pk": 2014017,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 17,
      "text": "On one of those days, as He was teaching, Pharisees and teachers of the law were sitting there, who had come from every village of Galilee and Judea and from Jerusalem. And the power of the Lord was with Him to heal.",
      "links": "<a href='/AIV/40/9/4'>Matt. 9:4</a>; <a href='/AIV/41/2/6'>Mark 2:6</a>",
      "comment": "Jesus’ teaching and healing are viewed with skepticism by the religious authorities, foreshadowing future conflicts."
    },
    {
      "pk": 2014018,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 18,
      "text": "Behold, some men came, carrying a paralyzed man on a bed. They tried to bring him in and set him before Jesus.",
      "links": "<a href='/AIV/40/9/2'>Matt. 9:2</a>; <a href='/AIV/41/2/3'>Mark 2:3</a>",
      "comment": "Faithful friends bring the paralyzed man, suggesting the role of communal faith and intercession."
    },
    {
      "pk": 2014019,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 19,
      "text": "But finding no way to bring him in because of the crowd, they went up on the roof and lowered him with his bed through the tiles into the midst before Jesus.",
      "links": "<a href='/AIV/41/2/4'>Mark 2:4</a>",
      "comment": "Their determination illustrates faith that overcomes obstacles, prefiguring perseverance in the spiritual life."
    },
    {
      "pk": 2014020,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 20,
      "text": "When He saw their faith, He said, 'Man, your sins are forgiven.'",
      "links": "<a href='/AIV/19/32/1'>Ps. 32:1</a>; <a href='/AIV/40/9/2'>Matt. 9:2</a>",
      "comment": "Jesus prioritizes forgiveness of sins over physical healing, exercising divine authority to forgive – a claim that only God can make."
    },
    {
      "pk": 2014021,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 21,
      "text": "Then the scribes and Pharisees began to reason, saying, 'Who is this who speaks blasphemies? Who can forgive sins but God alone?'",
      "links": "<a href='/AIV/19/51/4'>Ps. 51:4</a>",
      "comment": "Leaders recognize that forgiving sins is God’s prerogative alone, showing that Jesus is here making a claim to power that is reserved for the divine."
    },
    {
      "pk": 2014022,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 22,
      "text": "But Jesus, knowing their thoughts, answered, 'Why do you question in your hearts?'",
      "links": "<a href='/AIV/40/9/4'>Matt. 9:4</a>",
      "comment": "Jesus perceives inner thoughts, further showing His divine knowledge and authority."
    },
    {
      "pk": 2014023,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 23,
      "text": "'Which is easier, to say, ‘Your sins are forgiven,’ or to say, ‘Get up and walk?’'",
      "links": "",
      "comment": "The rhetorical question challenges the audience regarding the reality and authority of spiritual versus physical miracles."
    },
    {
      "pk": 2014024,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 24,
      "text": "But so that you may know that the Son of Man has authority on earth to forgive sins, He said to the paralyzed man, 'I say to you, rise, pick up your bed, and go home.'",
      "links": "<a href='/AIV/27/7/13'>Dan. 7:13</a>; <a href='/AIV/40/9/6'>Matt. 9:6</a>",
      "comment": "‘Son of Man’ recalls Daniel 7, a title for the Messiah associated with divine authority; Jesus publicly exercises this authority."
    },
    {
      "pk": 2014025,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 25,
      "text": "Immediately, he stood up before them, picked up what he had been lying on, and went home, glorifying God.",
      "links": "<a href='/AIV/40/9/7'>Matt. 9:7</a>; <a href='/AIV/41/2/12'>Mark 2:12</a>",
      "comment": "The healing overtly confirms the authority Jesus claimed; the man’s praise encourages all believers to glorify God for His works."
    },
    {
      "pk": 2014026,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 26,
      "text": "They were all amazed and filled with awe, saying, 'We have seen extraordinary things today.'",
      "links": "",
      "comment": "The response echoes Old Testament reactions to God’s miracles, confirming the divine source of Jesus’ works."
    },
    {
      "pk": 2014027,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 27,
      "text": "After this, He went out and saw a tax collector named Levi sitting at the tax booth, and said to him, 'Follow Me.'",
      "links": "<a href='/AIV/40/9/9'>Matt. 9:9</a>; <a href='/AIV/41/2/14'>Mark 2:14</a>",
      "comment": "Jesus’ call of Levi, a tax collector, demonstrates His inclusivity and willingness to sanctify those considered outcasts."
    },
    {
      "pk": 2014028,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 28,
      "text": "And leaving everything, Levi got up and followed Him.",
      "links": "<a href='/AIV/40/19/27'>Matt. 19:27</a>",
      "comment": "Levi’s immediate response models total sacrifice and devotion expected of disciples."
    },
    {
      "pk": 2014029,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 29,
      "text": "Then Levi hosted a great banquet at his house, and a large group of tax collectors and others were reclining with them.",
      "links": "<a href='/AIV/40/9/10'>Matt. 9:10</a>; <a href='/AIV/41/2/15'>Mark 2:15</a>",
      "comment": "The banquet points to Jesus’ willingness to associate with sinners and his desire for reconciliation and fellowship."
    },
    {
      "pk": 2014030,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 30,
      "text": "And the Pharisees and their scribes grumbled at His disciples, saying, 'Why do you eat and drink with tax collectors and sinners?'",
      "links": "<a href='/AIV/41/2/16'>Mark 2:16</a>",
      "comment": "Conflict arises because Jesus breaks social boundaries, emphasizing mercy and outreach over legalistic exclusion."
    },
    {
      "pk": 2014031,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 31,
      "text": "Jesus answered, 'Those who are healthy do not need a doctor, but those who are sick.'",
      "links": "<a href='/AIV/41/2/17'>Mark 2:17</a>",
      "comment": "Jesus self-identifies as a healer of sinners, implying His redemptive, mediatorial role."
    },
    {
      "pk": 2014032,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 32,
      "text": "'I have not come to call the righteous, but sinners, to repentance.'",
      "links": "<a href='/AIV/40/9/13'>Matt. 9:13</a>",
      "comment": "Jesus’ mission focuses on reconciliation and conversion rather than condemnation."
    },
    {
      "pk": 2014033,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 33,
      "text": "Then they said to Him, 'The disciples of John often fast and pray, and likewise those of the Pharisees, but Yours eat and drink.'",
      "links": "<a href='/AIV/18/22/26-27'>Job 22:26-27</a>",
      "comment": "Comparison of practices points to the distinctiveness of Jesus’ followers, foreshadowing new forms of piety."
    },
    {
      "pk": 2014034,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 34,
      "text": "Jesus said to them, 'Can you make the wedding guests fast while the bridegroom is with them?'",
      "links": "<a href='/AIV/19/45/14'>Ps. 45:14</a>; <a href='/AIV/40/25/1'>Matt. 25:1</a>",
      "comment": "Jesus refers to Himself as the bridegroom, alluding to Old Testament imagery of God’s covenant with His people (high christology)."
    },
    {
      "pk": 2014035,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 35,
      "text": "'The days will come when the bridegroom is taken away from them, and then they will fast in those days.'",
      "links": "<a href='/AIV/23/53/8'>Isaiah 53:8</a>",
      "comment": "This points ahead to Jesus’ suffering and death, a crucial moment for the practice of prayer and fasting among His followers."
    },
    {
      "pk": 2014036,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 36,
      "text": "He also told them a parable: 'No one tears a piece from a new garment and puts it on an old one. If he does, he will tear the new, and the patch from the new will not match the old.'",
      "links": "<a href='/AIV/41/2/21'>Mark 2:21</a>",
      "comment": "The parable extends to the incompatibility of the old and new covenants, preparing believers for ecclesial and liturgical renewal."
    },
    {
      "pk": 2014037,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 37,
      "text": "'And no one pours new wine into old wineskins. If he does, the new wine will burst the skins and be spilled, and the skins will be destroyed.'",
      "links": "<a href='/AIV/41/2/22'>Mark 2:22</a>",
      "comment": "This imagery points to the necessity of new forms and structures for the new work of God in Christ."
    },
    {
      "pk": 2014038,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 38,
      "text": "'But new wine must be put into fresh wineskins.'",
      "links": "",
      "comment": "The new covenant requires new vessels – a hint at a completely renewed community and sacramental life."
    },
    {
      "pk": 2014039,
      "translation": "AIV",
      "book": 42,
      "chapter": 5,
      "verse": 39,
      "text": "'And no one who has drunk old wine desires new, for he says, ‘The old is better.’'",
      "links": "",
      "comment": "Jesus notes resistance to change, observing that some cling to previous traditions; an encouragement toward embracing the fullness of what Christ establishes."
    }
  ],
  "translatedAt": "2025-12-23T02:40:26.352Z"
}