{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 17,
  "verses": [
    {
      "pk": 4201701,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 1,
      "text": "And he said to his disciples, \"Stumbling blocks are sure to come, but woe to the one through whom they come!",
      "links": "<a href='/AIV/40/18/7'>Matt. 18:7</a>; <a href='/AIV/41/9/42'>Mark 9:42</a>",
      "comment": "Here Jesus warns about leading others into sin, placing great responsibility on believers to avoid causing others to stumble. The phrase 'stumbling blocks' refers to temptations or occasions to sin."
    },
    {
      "pk": 4201702,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 2,
      "text": "It would be better for him if a millstone were put around his neck and he were thrown into the sea, than that he should cause one of these little ones to stumble.",
      "links": "<a href='/AIV/40/18/6'>Matt. 18:6</a>; <a href='/AIV/41/9/42'>Mark 9:42</a>",
      "comment": "Jesus uses strong language to emphasize the severe judgment against those who lead 'little ones'—a term that can mean children or humble believers—into sin. The imagery underscores the seriousness of scandal in the Christian community."
    },
    {
      "pk": 4201703,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 3,
      "text": "Be on guard. If your brother sins, rebuke him, and if he repents, forgive him.",
      "links": "<a href='/AIV/40/18/15'>Matt. 18:15</a>; <a href='/AIV/19/141/5'>Ps. 141:5</a>",
      "comment": "Christian fellowship requires accountability, correction, and forgiveness. Jesus sets a model for reconciliation and discipline within the community."
    },
    {
      "pk": 4201704,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 4,
      "text": "And if he sins against you seven times in a day, and returns to you seven times, saying, 'I repent,' you must forgive him.",
      "links": "<a href='/AIV/40/18/21-22'>Matt. 18:21-22</a>; <a href='/AIV/19/86/5'>Ps. 86:5</a>",
      "comment": "Here, forgiveness is shown to be limitless, echoing God's own mercy towards us. The number seven often symbolizes completeness in Scripture."
    },
    {
      "pk": 4201705,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 5,
      "text": "The apostles said to the Lord, \"Increase our faith!\"",
      "links": "",
      "comment": "The disciples recognize their dependence on divine grace to live out Jesus' teaching, showing faith is not only a human effort but a gift that can be increased by the Lord."
    },
    {
      "pk": 4201706,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 6,
      "text": "The Lord said, \"If you had faith as small as a mustard seed, you could say to this mulberry tree, 'Be uprooted and planted in the sea,' and it would obey you.\"",
      "links": "<a href='/AIV/40/17/20'>Matt. 17:20</a>; <a href='/AIV/41/11/23'>Mark 11:23</a>",
      "comment": "Jesus illustrates the immense power of even the smallest amount of authentic faith. This underscores both the potential of faith and the importance of trust in God."
    },
    {
      "pk": 4201707,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 7,
      "text": "Which of you, having a servant plowing or keeping sheep, will say to him when he comes in from the field, 'Come immediately and sit down to eat'?",
      "links": "",
      "comment": "Jesus uses an everyday scenario to teach humility in service. Just as servants fulfill their duties, believers are called to serve God without expecting special recognition."
    },
    {
      "pk": 4201708,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 8,
      "text": "Will you not rather say to him, 'Prepare my supper, dress yourself properly, and serve me while I eat and drink; afterward you will eat and drink'?",
      "links": "",
      "comment": "The servant's work is not done until all their obligations are fulfilled. This reflects the Christian call to persevere faithfully in duty until the end."
    },
    {
      "pk": 4201709,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 9,
      "text": "Does he thank the servant because he did what was commanded?",
      "links": "",
      "comment": "Jesus makes a point about humility; we serve God not to earn merit or praise, but out of love and obedience. The concept here hints at the spiritual value of obedient service without self-seeking."
    },
    {
      "pk": 4201710,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 10,
      "text": "So you also, when you have done all that you were commanded, say, 'We are unworthy servants; we have only done what was our duty.'\"",
      "links": "<a href='/AIV/40/25/30'>Matt. 25:30</a>",
      "comment": "True discipleship entails recognizing our humble position before God. Good works are the expected fruit of faith, not means of boasting."
    },
    {
      "pk": 4201711,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 11,
      "text": "While on his way to Jerusalem, he was passing along between Samaria and Galilee.",
      "links": "<a href='/AIV/9/15/17'>1 Sam. 15:17</a>",
      "comment": "This travel note situates Jesus as journeying towards his passion and fulfills his mission in marginalized regions, illustrating his outreach to all people."
    },
    {
      "pk": 4201712,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 12,
      "text": "As he entered a village, he was met by ten men who were lepers, who stood at a distance.",
      "links": "<a href='/AIV/3/13/45-46'>Lev. 13:45-46</a>",
      "comment": "Old Testament law required lepers to remain separate from the community (Lev. 13:45-46). This highlights both their physical and social isolation."
    },
    {
      "pk": 4201713,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 13,
      "text": "And they lifted up their voices, saying, \"Jesus, Master, have mercy on us!\"",
      "links": "<a href='/AIV/40/20/30-31'>Matt. 20:30-31</a>",
      "comment": "The address 'Master' reflects their faith in Jesus' authority and power. Their plea for mercy is echoed in traditional prayers of the early church."
    },
    {
      "pk": 4201714,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 14,
      "text": "When he saw them, he said to them, \"Go and show yourselves to the priests.\" And as they went, they were cleansed.",
      "links": "<a href='/AIV/3/14/2-7'>Lev. 14:2-7</a>; <a href='/AIV/40/8/4'>Matt. 8:4</a>",
      "comment": "Jesus sends them to the priests, in line with Levitical law for declaration of healing (Lev. 14). The healing happens as they obey, teaching the power of obedient faith and the honoring of religious authority."
    },
    {
      "pk": 4201715,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 15,
      "text": "Then one of them, when he saw that he was healed, turned back, praising God with a loud voice.",
      "links": "<a href='/AIV/19/30/2'>Ps. 30:2</a>",
      "comment": "True gratitude results in praise to God. This highlights the connection between thankfulness and worship."
    },
    {
      "pk": 4201716,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 16,
      "text": "He fell on his face at Jesus' feet, giving him thanks. Now he was a Samaritan.",
      "links": "<a href='/AIV/42/10/33'>Luke 10:33</a>",
      "comment": "Samaritans were considered outsiders. Here, the outcast receives healing and displays profound gratitude, suggesting the Gospel is for all nations."
    },
    {
      "pk": 4201717,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 17,
      "text": "Then Jesus answered, \"Were not ten cleansed? Where are the nine?",
      "links": "",
      "comment": "This rhetorical question emphasizes the importance of returning to thank God, hinting at an often overlooked virtue among believers."
    },
    {
      "pk": 4201718,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 18,
      "text": "Was no one found to return and praise God except this foreigner?\"",
      "links": "<a href='/AIV/19/107/32'>Ps. 107:32</a>",
      "comment": "A reminder that God's mercy is not restricted by ethnicity or previous status. True worship and thankfulness can sometimes be found where it's least expected."
    },
    {
      "pk": 4201719,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 19,
      "text": "And he said to him, \"Rise and go your way; your faith has made you well.\"",
      "links": "<a href='/AIV/7/10/12'>Judg. 10:12</a>; <a href='/AIV/42/7/50'>Luke 7:50</a>",
      "comment": "The faith of the healed man brings not only physical but spiritual restoration. Salvation and healing often go together in Christ's ministry."
    },
    {
      "pk": 4201720,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 20,
      "text": "Being asked by the Pharisees when the kingdom of God would come, he answered them, \"The kingdom of God does not come with observation,",
      "links": "<a href='/AIV/40/24/23'>Matt. 24:23</a>; <a href='/AIV/43/18/36'>John 18:36</a>",
      "comment": "Jesus clarifies the kingdom is not an observable, external event but is already present in a hidden manner."
    },
    {
      "pk": 4201721,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 21,
      "text": "nor will they say, 'Look, here it is!' or 'There!' For behold, the kingdom of God is in your midst.\"",
      "links": "<a href='/AIV/40/12/28'>Matt. 12:28</a>; <a href='/AIV/45/14/17'>Rom. 14:17</a>",
      "comment": "Jesus says the kingdom is in their midst—personally present in him and spiritually present among his followers. The phrase can also mean 'within you,' stressing the inward, transformative reality of his reign."
    },
    {
      "pk": 4201722,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 22,
      "text": "And he said to the disciples, \"Days are coming when you will desire to see one of the days of the Son of Man, and you will not see it.",
      "links": "<a href='/AIV/43/8/56'>John 8:56</a>",
      "comment": "Jesus speaks of a future longing for his presence, a reference to the coming separation after his ascension. The 'Son of Man' is a divine title from Daniel 7:13-14."
    },
    {
      "pk": 4201723,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 23,
      "text": "And they will say to you, 'Look, there!' or 'Look, here!' Do not go out or follow them.",
      "links": "<a href='/AIV/40/24/23'>Matt. 24:23</a>",
      "comment": "Jesus warns against false claims about his return. True disciples are not to be misled by sensationalism."
    },
    {
      "pk": 4201724,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 24,
      "text": "For as the lightning flashes and lights up the sky from one side to the other, so will the Son of Man be in his day.",
      "links": "<a href='/AIV/40/24/27'>Matt. 24:27</a>",
      "comment": "The coming of Christ will be sudden and unmistakable, not hidden or secret. His divine identity is implied in this mighty, visible return."
    },
    {
      "pk": 4201725,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 25,
      "text": "But first he must suffer many things and be rejected by this generation.",
      "links": "<a href='/AIV/40/16/21'>Matt. 16:21</a>; <a href='/AIV/42/9/22'>Luke 9:22</a>",
      "comment": "Jesus, as the prophesied suffering Messiah, declares the necessity of his coming death and rejection, highlighting the link to prophetic passages such as Isaiah 53."
    },
    {
      "pk": 4201726,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 26,
      "text": "Just as it was in the days of Noah, so will it be in the days of the Son of Man.",
      "links": "<a href='/AIV/1/6/5-8'>Gen. 6:5-8</a>; <a href='/AIV/40/24/37-39'>Matt. 24:37-39</a>",
      "comment": "The final judgment will come suddenly amid ordinary life, just as in Noah's day. This draws on typology of the Old Testament flood as a foreshadowing of future judgment."
    },
    {
      "pk": 4201727,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 27,
      "text": "They were eating, drinking, marrying, and being given in marriage, until the day Noah entered the ark, and the flood came and destroyed them all.",
      "links": "<a href='/AIV/1/7/7'>Gen. 7:7</a>",
      "comment": "Normal life continued until sudden destruction. This points to the need for spiritual vigilance and readiness for Christ’s return."
    },
    {
      "pk": 4201728,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 28,
      "text": "Likewise, just as it was in the days of Lot—they were eating and drinking, buying and selling, planting and building,",
      "links": "<a href='/AIV/1/19/16'>Gen. 19:16</a>",
      "comment": "Lot's generation was busy with daily life, oblivious to the imminent judgment. This continues the theme of surprise at God’s intervention."
    },
    {
      "pk": 4201729,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 29,
      "text": "but on the day when Lot went out from Sodom, fire and sulfur rained from heaven and destroyed them all.",
      "links": "<a href='/AIV/1/19/24-25'>Gen. 19:24-25</a>",
      "comment": "Judgment came suddenly upon Sodom and Gomorrah, reinforcing Jesus' warning to be prepared for the day of the Lord."
    },
    {
      "pk": 4201730,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 30,
      "text": "So will it be on the day when the Son of Man is revealed.",
      "links": "<a href='/AIV/40/24/30'>Matt. 24:30</a>",
      "comment": "The coming of Jesus will result in final judgment and will be plain for all to see, mirroring Old Testament examples."
    },
    {
      "pk": 4201731,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 31,
      "text": "On that day, let the one who is on the housetop, with his goods in the house, not come down to take them away, and likewise let the one who is in the field not turn back.",
      "links": "<a href='/AIV/40/24/17-18'>Matt. 24:17-18</a>",
      "comment": "The need for immediate readiness is stressed. Attachment to earthly things can hinder salvation."
    },
    {
      "pk": 4201732,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 32,
      "text": "Remember Lot’s wife.",
      "links": "<a href='/AIV/1/19/26'>Gen. 19:26</a>",
      "comment": "Lot's wife became a pillar of salt because she longed for what she left behind. This is a warning against divided loyalties."
    },
    {
      "pk": 4201733,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 33,
      "text": "Whoever seeks to save his life will lose it, but whoever loses his life will preserve it.",
      "links": "<a href='/AIV/40/10/39'>Matt. 10:39</a>; <a href='/AIV/42/9/24'>Luke 9:24</a>",
      "comment": "This paradox is central to discipleship. True life comes from self-sacrifice, trusting in Christ’s promise."
    },
    {
      "pk": 4201734,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 34,
      "text": "I tell you, in that night there will be two in one bed; one will be taken and the other left.",
      "links": "<a href='/AIV/40/24/40'>Matt. 24:40</a>",
      "comment": "This verse highlights the sudden and personal nature of coming judgment. Salvation is not based on proximity or relationship but individual response to Christ."
    },
    {
      "pk": 4201735,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 35,
      "text": "There will be two women grinding together; one will be taken and the other left.\"",
      "links": "<a href='/AIV/40/24/41'>Matt. 24:41</a>",
      "comment": "Emphasizing again the personal call of God—salvation and judgment will divide even the closest companions."
    },
    {
      "pk": 4201736,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 36,
      "text": "",
      "links": "",
      "comment": "Some manuscripts include verse 36: 'Two will be in the field; one will be taken, and the other left.' This parallels Matt. 24:40 but is omitted in some early sources."
    },
    {
      "pk": 4201737,
      "translation": "AIV",
      "book": 3,
      "chapter": 17,
      "verse": 37,
      "text": "And they answered, 'Where, Lord?' He said to them, 'Where the corpse is, there the vultures will gather.'",
      "links": "<a href='/AIV/40/24/28'>Matt. 24:28</a>; <a href='/AIV/18/39/30'>Job 39:30</a>",
      "comment": "This proverb points to the inevitability and clarity of the coming judgment. The sign will be obvious to all, just as vultures are attracted to a corpse."
    }
  ],
  "translatedAt": "2025-12-23T02:50:07.555Z"
}