{
  "book": 49,
  "bookName": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 21,
  "verses": [
    {
      "pk": 49021001,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 1,
      "text": "Jesus looked up and saw the rich putting their gifts into the temple treasury.",
      "links": "<a href='/AIV/41/12/41'>Mark 12:41</a>",
      "comment": "Luke sets the scene in the temple, showing contrasts between outward wealth and true devotion. The temple treasury was a central aspect of worship and religious life."
    },
    {
      "pk": 49021002,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 2,
      "text": "He also saw a poor widow putting in two small coins.",
      "links": "<a href='/AIV/41/12/42'>Mark 12:42</a>",
      "comment": "Widows in the ancient world were especially vulnerable (cf. <a href='/AIV/02/22/22'>Exodus 22:22</a>). Jesus highlights her action as an example of pure faith and true worship."
    },
    {
      "pk": 49021003,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 3,
      "text": "And He said, 'Truly I tell you, this poor widow has put in more than all of them.'",
      "links": "<a href='/AIV/41/12/43'>Mark 12:43</a>",
      "comment": "Jesus affirms that God values the heart and sacrifice rather than the amount given. This is a rebuke to external religiosity without true devotion."
    },
    {
      "pk": 49021004,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 4,
      "text": "For they all gave out of their abundance, but she out of her poverty put in all she had to live on.",
      "links": "<a href='/AIV/07/6/15'>Judges 6:15</a>; <a href='/AIV/19/34/18'>Psalm 34:18</a>",
      "comment": "Her radical trust is seen as a model for all disciples. Spiritual poverty and humble offering are highly praised by Jesus, showing the way God measures the value of gifts differently than humans."
    },
    {
      "pk": 49021005,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 5,
      "text": "While some were speaking about the temple, how it was adorned with beautiful stones and gifts dedicated to God, He said,",
      "links": "<a href='/AIV/40/24/1'>Matthew 24:1</a>; <a href='/AIV/41/13/1'>Mark 13:1</a>",
      "comment": "The temple was the center of Jewish worship and sacrifice, and its destruction was unthinkable. Yet Jesus points to a deeper reality, which will become clearer in the following verses."
    },
    {
      "pk": 49021006,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 6,
      "text": "'As for these things you see, the days will come when not one stone will be left upon another that will not be thrown down.'",
      "links": "<a href='/AIV/33/3/12'>Micah 3:12</a>; <a href='/AIV/24/7/14'>Jeremiah 7:14</a>",
      "comment": "Jesus foretells the destruction of the temple (fulfilled in 70 AD), demonstrating His prophetic authority and fulfilling Old Testament warnings. This points to the passing away of the old order and the coming of a new covenant."
    },
    {
      "pk": 49021007,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 7,
      "text": "They asked Him, 'Teacher, when will these things be, and what will be the sign when these things are about to take place?'",
      "links": "<a href='/AIV/40/24/3'>Matthew 24:3</a>",
      "comment": "The disciples seek clarification about the timing and signs of these world-changing events. Such questions connect Jesus' prophecy to both immediate and future fulfillment."
    },
    {
      "pk": 49021008,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 8,
      "text": "And He said, 'Take care that you are not misled. For many will come in My name, saying, \"I am he,\" and, \"The time is near.\" Do not go after them.'",
      "links": "<a href='/AIV/40/24/4-5'>Matthew 24:4-5</a>; <a href='/AIV/62/2/18'>1 John 2:18</a>",
      "comment": "False messiahs and teachers are a recurring danger in the church's history. Jesus’ words warn believers to remain faithful to divine revelation and not be swayed by dramatic false claims."
    },
    {
      "pk": 49021009,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 9,
      "text": "'When you hear of wars and tumults, do not be terrified; for these things must take place first, but the end will not come at once.'",
      "links": "<a href='/AIV/41/13/7'>Mark 13:7</a>; <a href='/AIV/27/2/28'>Daniel 2:28</a>",
      "comment": "These difficulties are expected in history but do not signal the immediate end. Jesus encourages steadfastness and trust in God's providence."
    },
    {
      "pk": 49021010,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 10,
      "text": "Then He said to them, 'Nation will rise against nation, and kingdom against kingdom.'",
      "links": "<a href='/AIV/23/19/2'>Isaiah 19:2</a>; <a href='/AIV/24/25/32'>Jeremiah 25:32</a>",
      "comment": "Jesus echoes Old Testament prophecy about days of upheaval, presenting both a literal and spiritual reality—human conflict foreshadowing final judgment but not yet its fulfillment."
    },
    {
      "pk": 49021011,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 11,
      "text": "'There will be great earthquakes, famines, and plagues in various places, and fearful sights and great signs from heaven.'",
      "links": "<a href='/AIV/02/10/22'>Exodus 10:22</a>; <a href='/AIV/29/2/30'>Joel 2:30</a>",
      "comment": "God’s sovereignty is seen in powerful signs, recalling prophetic events like those in Exodus. Such signs often accompany decisive moments in biblical history and invite repentance and faith."
    },
    {
      "pk": 49021012,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 12,
      "text": "'But before all this, they will lay their hands on you and persecute you, delivering you up to synagogues and prisons, and you will be brought before kings and governors for My name's sake.'",
      "links": "<a href='/AIV/44/4/3'>Acts 4:3</a>; <a href='/AIV/44/25/23'>Acts 25:23</a>",
      "comment": "Jesus forewarns the suffering that will characterize the lives of His followers. This foreshadows the persecution of the early Church and points to the call to share in Christ’s sufferings."
    },
    {
      "pk": 49021013,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 13,
      "text": "'This will be your opportunity to bear witness.'",
      "links": "<a href='/AIV/44/6/9-10'>Acts 6:9-10</a>; <a href='/AIV/40/10/18'>Matthew 10:18</a>",
      "comment": "Persecution is not meaningless; it provides the Church the opportunity to testify to Christ. Many saints bore witness with their lives and words in the face of suffering."
    },
    {
      "pk": 49021014,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 14,
      "text": "'So make up your minds not to prepare beforehand how to defend yourselves,",
      "links": "<a href='/AIV/40/10/19-20'>Matthew 10:19-20</a>",
      "comment": "Believers are to trust the Holy Spirit for wisdom and speech in times of trial, rather than relying solely on human strength or strategies."
    },
    {
      "pk": 49021015,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 15,
      "text": "'for I will give you a mouth and wisdom which none of your adversaries will be able to resist or contradict.'",
      "links": "<a href='/AIV/24/1/9'>Jeremiah 1:9</a>; <a href='/AIV/44/6/10'>Acts 6:10</a>",
      "comment": "Jesus promises His ongoing presence and guidance. This links to Old Testament patterns, where God empowers His messengers. It implies a divine commission and support for the church's leaders and all who share the gospel."
    },
    {
      "pk": 49021016,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 16,
      "text": "'But you will be betrayed even by parents, brothers, relatives, and friends. Some of you they will put to death.'",
      "links": "<a href='/AIV/33/7/6'>Micah 7:6</a>; <a href='/AIV/40/10/21'>Matthew 10:21</a>",
      "comment": "Divided families and martyrdom signal the high cost of discipleship. Historically and spiritually, these things have occurred throughout the Church’s history, testifying to the truth of Jesus’ prophecy."
    },
    {
      "pk": 49021017,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 17,
      "text": "'And you will be hated by all because of My name.'",
      "links": "<a href='/AIV/62/3/13'>1 John 3:13</a>; <a href='/AIV/40/10/22'>Matthew 10:22</a>",
      "comment": "Hostility against believers echoes the world’s rejection of Christ Himself. Sharing in persecution binds Christians together in the fellowship of Christ’s suffering."
    },
    {
      "pk": 49021018,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 18,
      "text": "'But not a hair of your head will perish.'",
      "links": "<a href='/AIV/09/14/45'>1 Samuel 14:45</a>; <a href='/AIV/40/10/30'>Matthew 10:30</a>",
      "comment": "Despite persecution, Jesus assures divine protection—God preserves what matters most. Even martyrdom leads ultimately to victory and resurrection life (spiritual security even in physical death)."
    },
    {
      "pk": 49021019,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 19,
      "text": "'By your endurance you will gain your souls.'",
      "links": "<a href='/AIV/58/10/36'>Hebrews 10:36</a>; <a href='/AIV/66/14/12'>Revelation 14:12</a>",
      "comment": "Faithful perseverance is necessary for salvation. This calls for patient endurance, which has always been a hallmark of the true Church."
    },
    {
      "pk": 49021020,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 20,
      "text": "'But when you see Jerusalem surrounded by armies, then know that its desolation has come near.'",
      "links": "<a href='/AIV/27/9/26'>Daniel 9:26</a>; <a href='/AIV/40/24/15'>Matthew 24:15</a>",
      "comment": "This prophecy was sharply fulfilled in 70 AD with the destruction of Jerusalem, a clear sign of judgment and the end of the Old Covenant system, preparing for Christ’s universal kingdom."
    },
    {
      "pk": 49021021,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 21,
      "text": "'Then let those who are in Judea flee to the mountains, and let those who are inside the city depart, and let not those who are in the country enter it.'",
      "links": "<a href='/AIV/24/6/1'>Jeremiah 6:1</a>; <a href='/AIV/40/24/16'>Matthew 24:16</a>",
      "comment": "Jesus offers practical warning and mercy. The flight from Jerusalem historically saved believers, who recognized the sign and obeyed."
    },
    {
      "pk": 49021022,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 22,
      "text": "'For these are days of vengeance, to fulfill all that is written.'",
      "links": "<a href='/AIV/24/5/29'>Jeremiah 5:29</a>; <a href='/AIV/25/2/17'>Lamentations 2:17</a>",
      "comment": "The judgment is the fulfillment of Old Testament prophecy. God’s justice is intertwined with mercy and His faithfulness to His promises."
    },
    {
      "pk": 49021023,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 23,
      "text": "'Woe to those who are pregnant and to those who are nursing infants in those days! For there will be great distress upon the land and wrath against this people.'",
      "links": "<a href='/AIV/28/13/16'>Hosea 13:16</a>; <a href='/AIV/40/24/19'>Matthew 24:19</a>",
      "comment": "This lament shows the deep compassion of Jesus; yet also the inevitability of judgment for unfaithfulness. It also highlights the gravity and historical reality of the events spoken of."
    },
    {
      "pk": 49021024,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 24,
      "text": "'They will fall by the edge of the sword and be led captive among all nations. Jerusalem will be trampled underfoot by the Gentiles, until the times of the Gentiles are fulfilled.'",
      "links": "<a href='/AIV/19/79/1'>Psalm 79:1</a>; <a href='/AIV/45/11/25'>Romans 11:25</a>",
      "comment": "The scattering of Israel and the dominion of the Gentiles is a motif in biblical prophecy. This eschatological phrase points to a period when God’s plan for the nations is brought to fullness."
    },
    {
      "pk": 49021025,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 25,
      "text": "'And there will be signs in the sun, moon, and stars, and on the earth distress among nations, with perplexity at the roaring of the sea and the waves,'",
      "links": "<a href='/AIV/23/13/10'>Isaiah 13:10</a>; <a href='/AIV/29/2/31'>Joel 2:31</a>",
      "comment": "Cosmic signs often introduce divine intervention. Apocalyptic language shows the finality and universality of God's judgment and redemption."
    },
    {
      "pk": 49021026,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 26,
      "text": "'people fainting with fear and foreboding of what is coming upon the world. For the powers of the heavens will be shaken.'",
      "links": "<a href='/AIV/23/34/4'>Isaiah 34:4</a>; <a href='/AIV/58/12/26'>Hebrews 12:26</a>",
      "comment": "The language evokes Day of the Lord imagery—radical transformation and divine intervention breaking into history."
    },
    {
      "pk": 49021027,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 27,
      "text": "'Then they will see the Son of Man coming in a cloud with power and great glory.'",
      "links": "<a href='/AIV/27/7/13-14'>Daniel 7:13-14</a>; <a href='/AIV/40/24/30'>Matthew 24:30</a>",
      "comment": "Jesus identifies Himself with the exalted Son of Man from Daniel—a divine figure who comes to judge and reign. This is a direct claim to divinity and messiahship."
    },
    {
      "pk": 49021028,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 28,
      "text": "'Now when these things begin to take place, stand up and raise your heads, because your redemption is drawing near.'",
      "links": "<a href='/AIV/45/8/23'>Romans 8:23</a>; <a href='/AIV/23/35/4'>Isaiah 35:4</a>",
      "comment": "The final redemption is anticipated with hope, not fear. The Church is called to look to Christ in confidence, trusting in the promise of full salvation and restoration."
    },
    {
      "pk": 49021029,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 29,
      "text": "And He told them a parable: 'Look at the fig tree, and all the trees.'",
      "links": "<a href='/AIV/24/24/5-7'>Jeremiah 24:5-7</a>; <a href='/AIV/40/24/32'>Matthew 24:32</a>",
      "comment": "The fig tree had been used as a symbol of Israel, but also more generally as a sign to observe God’s timing in nature and history."
    },
    {
      "pk": 49021030,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 30,
      "text": "'As soon as they put out leaves, you see for yourselves and know that summer is already near.'",
      "links": "",
      "comment": "Just as one recognizes the change of seasons by signs, so also should believers be attentive to spiritual and historical signs of God’s action."
    },
    {
      "pk": 49021031,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 31,
      "text": "'So also, when you see these things taking place, know that the kingdom of God is near.'",
      "links": "<a href='/AIV/40/3/2'>Matthew 3:2</a>; <a href='/AIV/41/1/15'>Mark 1:15</a>",
      "comment": "The kingdom of God advances through history and culminates in Christ’s return. The establishment of His reign means judgment and renewal."
    },
    {
      "pk": 49021032,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 32,
      "text": "'Truly, I tell you, this generation will not pass away until all has taken place.'",
      "links": "<a href='/AIV/41/13/30'>Mark 13:30</a>",
      "comment": "Interpretations vary: many see reference to the destruction of Jerusalem within that generation, while others discern a spiritual meaning about the ongoing presence of the Church to the end of the age."
    },
    {
      "pk": 49021033,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 33,
      "text": "'Heaven and earth will pass away, but My words will never pass away.'",
      "links": "<a href='/AIV/23/40/8'>Isaiah 40:8</a>; <a href='/AIV/19/119/89'>Psalm 119:89</a>",
      "comment": "A strong claim to divinity—only God’s word is unchanging. Jesus affirms the eternal truth of His teaching. His authority is universal and everlasting, sustaining faith and doctrine throughout history."
    },
    {
      "pk": 49021034,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 34,
      "text": "'But watch yourselves lest your hearts be weighed down with dissipation and drunkenness and the cares of this life, and that day come upon you suddenly like a trap.'",
      "links": "<a href='/AIV/52/5/6-8'>1 Thessalonians 5:6-8</a>",
      "comment": "Vigilance is necessary for all believers. The reality of Christ’s return calls for sober living, prayer, and preparation, not carelessness."
    },
    {
      "pk": 49021035,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 35,
      "text": "'For it will come upon all who dwell on the face of the whole earth.'",
      "links": "<a href='/AIV/23/24/17'>Isaiah 24:17</a>",
      "comment": "The universality of God’s judgment and the coming of the Son of Man is emphasized. No one is exempt; preparation and faith are required from every nation and person."
    },
    {
      "pk": 49021036,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 36,
      "text": "'But stay awake at all times, praying that you may have strength to escape all these things that are going to take place, and to stand before the Son of Man.'",
      "links": "<a href='/AIV/49/6/18'>Ephesians 6:18</a>; <a href='/AIV/46/16/13'>1 Corinthians 16:13</a>",
      "comment": "Jesus links prayer, vigilance, and perseverance. The call to stand before the Son of Man points to final judgment and the need for ongoing readiness—a theme central to the Church's tradition."
    },
    {
      "pk": 49021037,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 37,
      "text": "During the day He was teaching in the temple, but at night He went out and stayed on the mount called Olivet.",
      "links": "<a href='/AIV/42/22/39'>Luke 22:39</a>; <a href='/AIV/38/14/4'>Zechariah 14:4</a>",
      "comment": "Jesus’ unwavering teaching ministry in the temple fulfills messianic expectations. His retreat to the Mount of Olives sets the stage for His passion—the ultimate sacrifice for redemption."
    },
    {
      "pk": 49021038,
      "translation": "AIV",
      "book": 49,
      "bookName": "Luke",
      "bookAbbreviation": "Luke",
      "chapter": 21,
      "verse": 38,
      "text": "And all the people came early in the morning to Him in the temple to hear Him.",
      "links": "<a href='/AIV/40/21/23'>Matthew 21:23</a>",
      "comment": "The people’s eagerness to hear Jesus echoes the call for all Christians to seek Him, receive His teaching, and be formed by it—laying a foundation for unity and the authority of the apostolic Church."
    }
  ],
  "translatedAt": "2025-12-24T10:56:41.043Z"
}