{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 7,
  "verses": [
    {
      "pk": 3407071,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 1,
      "text": "After he had finished all his sayings in the hearing of the people, he entered Capernaum.",
      "links": "<a href='/AIV/40/8/5'>Matt. 8:5</a>;<a href='/AIV/43/4/46'>John 4:46</a>",
      "comment": "Luke sets the scene for key miracles. Capernaum was a central place for Jesus’ ministry."
    },
    {
      "pk": 3407072,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 2,
      "text": "A centurion’s servant, who was highly valued by him, was sick and about to die.",
      "links": "<a href='/AIV/40/8/5'>Matt. 8:5-13</a>",
      "comment": "A centurion was a Roman officer, showing that Jesus’ ministry reached even Gentiles."
    },
    {
      "pk": 3407073,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 3,
      "text": "When he heard about Jesus, he sent some Jewish elders to him, asking him to come and heal his servant.",
      "links": "",
      "comment": "The centurion shows humility by sending Jewish elders instead of coming himself."
    },
    {
      "pk": 3407074,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 4,
      "text": "When they came to Jesus, they urged him earnestly, saying, 'He is worthy for you to do this for him,'",
      "links": "",
      "comment": "The elders express the centurion’s merit—which becomes important when considering grace and works."
    },
    {
      "pk": 3407075,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 5,
      "text": "for he loves our nation, and he himself built us our synagogue.",
      "links": "",
      "comment": "The centurion’s generosity to the synagogue demonstrates faith working through love."
    },
    {
      "pk": 3407076,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 6,
      "text": "Jesus went with them. When he was not far from the house, the centurion sent friends to say to him, 'Lord, do not trouble yourself, for I am not worthy for you to come under my roof.'",
      "links": "<a href='/AIV/40/8/8'>Matt. 8:8</a>",
      "comment": "His words echo liturgical humility (“I am not worthy that you should enter under my roof”), familiar in Christian worship."
    },
    {
      "pk": 3407077,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 7,
      "text": "That is why I did not even consider myself worthy to come to you. But just say the word, and my servant will be healed.",
      "links": "",
      "comment": "The centurion has faith in Jesus’ authority to heal by his word alone—a key Christological moment."
    },
    {
      "pk": 3407078,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 8,
      "text": "For I also am a man placed under authority, having soldiers under me. I say to one, ‘Go,’ and he goes; and to another, ‘Come,’ and he comes; and to my servant, ‘Do this,’ and he does it.",
      "links": "",
      "comment": "The centurion likens Jesus’ authority over illness to his own over men—recognizing Jesus’ divine power."
    },
    {
      "pk": 3407079,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 9,
      "text": "When Jesus heard these things, he marveled at him, and turning to the crowd following him, he said, 'I tell you, not even in Israel have I found such great faith.'",
      "links": "<a href='/AIV/40/8/10'>Matt. 8:10</a>",
      "comment": "A Gentile exhibits the very faith Israel was meant to model (cf. Gen. 12:3)."
    },
    {
      "pk": 3407080,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 10,
      "text": "And when those who had been sent returned to the house, they found the servant healed.",
      "links": "",
      "comment": "This miracle demonstrates Jesus’ word has power to heal even at a distance."
    },
    {
      "pk": 3407081,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 11,
      "text": "Soon afterward, he went to a town called Nain, and his disciples and a large crowd went with him.",
      "links": "",
      "comment": "Nain was a small town—this miracle, recorded only in Luke, is unique for its compassion and public setting."
    },
    {
      "pk": 3407082,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 12,
      "text": "As he approached the gate of the town, a dead man was being carried out, the only son of his mother, and she was a widow. A considerable crowd from the town was with her.",
      "links": "",
      "comment": "A widow losing her only son faced destitution. This sets up a dramatic act of restoration."
    },
    {
      "pk": 3407083,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 13,
      "text": "When the Lord saw her, he had compassion on her and said to her, 'Do not weep.'",
      "links": "",
      "comment": "Jesus’ compassion is a sign of divine mercy (cf. Hosea 11:8)."
    },
    {
      "pk": 3407084,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 14,
      "text": "Then he came up and touched the bier, and those who carried him stood still. He said, 'Young man, I say to you, arise!'",
      "links": "<a href='/AIV/11/17/21-22'>1 Kings 17:21–22</a>;<a href='/AIV/12/4/32-35'>2 Kings 4:32–35</a>",
      "comment": "Touching a corpse was ritually defiling (Num. 19:11), but Jesus is not made unclean—showing his authority over life and death."
    },
    {
      "pk": 3407085,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 15,
      "text": "And the dead man sat up and began to speak, and Jesus gave him to his mother.",
      "links": "",
      "comment": "This recalls Elijah and Elisha’s miracles (cf. the links) and points to Jesus as the new and greater prophet."
    },
    {
      "pk": 3407086,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 16,
      "text": "Fear seized them all, and they glorified God, saying, 'A great prophet has arisen among us!' and 'God has visited his people!'",
      "links": "<a href='/AIV/19/106/4'>Ps. 106:4</a>",
      "comment": "The people recognize a new era of God’s activity, echoing Old Testament expectations of divine visitation."
    },
    {
      "pk": 3407087,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 17,
      "text": "And this report about him spread through the whole of Judea and all the surrounding country.",
      "links": "",
      "comment": "Jesus' ministry attracts widespread attention, setting the stage for further public miracles."
    },
    {
      "pk": 3407088,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 18,
      "text": "John’s disciples told him about all these things.",
      "links": "",
      "comment": "John the Baptist hears of Jesus’ miraculous deeds through his disciples."
    },
    {
      "pk": 3407089,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 19,
      "text": "And John, calling two of his disciples to him, sent them to the Lord, saying, 'Are you the one who is to come, or should we look for another?'",
      "links": "<a href='/AIV/39/3/1'>Mal. 3:1</a>;<a href='/AIV/40/11/3'>Matt. 11:3</a>",
      "comment": "John’s question concerns whether Jesus is the expected Messiah (cf. prophecy of Malachi)."
    },
    {
      "pk": 3407090,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 20,
      "text": "When the men had come to him, they said, 'John the Baptist has sent us to you, saying, “Are you the one who is to come, or should we look for another?”'",
      "links": "",
      "comment": "Jesus receives the delegation from John the Baptist."
    },
    {
      "pk": 3407091,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 21,
      "text": "In that hour he healed many people of diseases, plagues, and evil spirits, and bestowed sight to many who were blind.",
      "links": "<a href='/AIV/23/35/5-6'>Isa. 35:5–6</a>",
      "comment": "Jesus fulfills Isaiah’s prophecy of the Messianic age, giving evidence of his identity as the Christ."
    },
    {
      "pk": 3407092,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 22,
      "text": "He answered them, 'Go and tell John what you have seen and heard: the blind receive their sight, the lame walk, lepers are cleansed, the deaf hear, the dead are raised up, the poor have good news preached to them.'",
      "links": "<a href='/AIV/23/35/5–6'>Isa. 35:5–6</a>;<a href='/AIV/23/61/1'>Isa. 61:1</a>",
      "comment": "Jesus references Messianic signs found in Isaiah, proving his divine mission."
    },
    {
      "pk": 3407093,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 23,
      "text": "And blessed is anyone who does not stumble because of me.'",
      "links": "<a href='/AIV/23/8/14'>Isa. 8:14</a>",
      "comment": "Jesus foresees that he will be a stumbling block to some—an image of the mysterious way God acts."
    },
    {
      "pk": 3407094,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 24,
      "text": "When John’s messengers had gone, Jesus began to speak to the crowds concerning John: 'What did you go out into the wilderness to see? A reed shaken by the wind?'",
      "links": "",
      "comment": "Jesus commends John for his steadfastness—unlike a reed, John was not swayed by worldly opinion."
    },
    {
      "pk": 3407095,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 25,
      "text": "'But what did you go out to see? A man dressed in soft clothing? Those who wear splendid clothing and live in luxury are in kings’ courts.'",
      "links": "",
      "comment": "John’s simple life contrasts with earthly rulers—showing the prophetic call rarely comes with comfort."
    },
    {
      "pk": 3407096,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 26,
      "text": "'But what then did you go out to see? A prophet? Yes, I tell you, and more than a prophet.'",
      "links": "",
      "comment": "Jesus elevates John’s status above the prophets—preparing his audience for new revelation."
    },
    {
      "pk": 3407097,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 27,
      "text": "'This is he of whom it is written, “Behold, I send my messenger before your face, who will prepare your way before you.”'",
      "links": "<a href='/AIV/39/3/1'>Mal. 3:1</a>; <a href='/AIV/23/40/3'>Isa. 40:3</a>",
      "comment": "Jesus quotes prophecy about the forerunner (John), confirming his own messianic role."
    },
    {
      "pk": 3407098,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 28,
      "text": "'I tell you, among those born of women none is greater than John; yet the one who is least in the kingdom of God is greater than he.'",
      "links": "",
      "comment": "Membership in God’s kingdom brings a new spiritual dignity surpassing even the greatest prophets."
    },
    {
      "pk": 3407099,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 29,
      "text": "When all the people, including the tax collectors, heard this, they declared God just, having been baptized with the baptism of John.",
      "links": "",
      "comment": "Even tax collectors recognize the righteousness of God’s plan through John’s ministry."
    },
    {
      "pk": 3407100,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 30,
      "text": "But the Pharisees and the scribes rejected the purpose of God for themselves, not having been baptized by him.",
      "links": "",
      "comment": "Those opposing John illustrate that free will can resist God’s grace offered through chosen instruments."
    },
    {
      "pk": 3407101,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 31,
      "text": "And the Lord said, 'To what then shall I compare the people of this generation, and what are they like?'",
      "links": "",
      "comment": "Jesus often uses analogies to teach about the character of his contemporaries."
    },
    {
      "pk": 3407102,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 32,
      "text": "'They are like children sitting in the marketplace and calling to one another, “We piped for you, and you did not dance; we mourned, and you did not weep.”'",
      "links": "",
      "comment": "A parable likening the unbelieving generation to fickle children who cannot be pleased."
    },
    {
      "pk": 3407103,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 33,
      "text": "'For John the Baptist has come eating no bread and drinking no wine, and you say, “He has a demon.”'",
      "links": "",
      "comment": "Despite asceticism, John was rejected for his austerity; the people were hard to satisfy."
    },
    {
      "pk": 3407104,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 34,
      "text": "'The Son of Man has come eating and drinking, and you say, “Look, a glutton and a drunkard, a friend of tax collectors and sinners!”'",
      "links": "<a href='/AIV/5/21/20'>Deut. 21:20</a>",
      "comment": "Jesus is condemned for mercy and fellowship; the title 'Son of Man' is messianic (Dan. 7:13–14)."
    },
    {
      "pk": 3407105,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 35,
      "text": "'Yet wisdom is justified by all her children.'",
      "links": "<a href='/AIV/20/8/32'>Prov. 8:32</a>",
      "comment": "Divine wisdom is vindicated by the fruit it produces—true followers recognize it."
    },
    {
      "pk": 3407106,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 36,
      "text": "One of the Pharisees asked him to eat with him, and he went into the Pharisee’s house and took his place at the table.",
      "links": "",
      "comment": "Jesus accepts invitations from all, displaying openness to engage with anyone seeking truth."
    },
    {
      "pk": 3407107,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 37,
      "text": "And behold, a woman of the city, who was a sinner, when she learned that he was reclining at table in the Pharisee’s house, brought an alabaster flask of ointment.",
      "links": "<a href='/AIV/40/26/7'>Matt. 26:7</a>",
      "comment": "The woman’s costly gift foreshadows Jesus’ burial and hints at the value of sacrificial acts of love."
    },
    {
      "pk": 3407108,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 38,
      "text": "Standing behind him at his feet, weeping, she began to wet his feet with her tears, then wiped them with the hair of her head, kissed his feet, and anointed them with the ointment.",
      "links": "<a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "Her actions mirror penitence and adoration. The physical act shows a sacramental view of grace—outward sign of inward repentance."
    },
    {
      "pk": 3407109,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 39,
      "text": "When the Pharisee who had invited him saw this, he said to himself, 'If this man were a prophet, he would have known who and what kind of woman this is who is touching him, for she is a sinner.'",
      "links": "",
      "comment": "The Pharisee’s inner thought reveals his misunderstanding of the mission of God—to forgive and seek the lost."
    },
    {
      "pk": 3407110,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 40,
      "text": "And Jesus answered him, 'Simon, I have something to say to you.' And he replied, 'Say it, Teacher.'",
      "links": "",
      "comment": "Jesus knows Simon’s heart, an implicit sign of his divinity (cf. John 2:25)."
    },
    {
      "pk": 3407111,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 41,
      "text": "'A certain moneylender had two debtors. One owed five hundred denarii, and the other fifty.'",
      "links": "",
      "comment": "The parable sets a framework for understanding gratitude and forgiveness."
    },
    {
      "pk": 3407112,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 42,
      "text": "'When they could not pay, he forgave them both. Now which of them will love him more?'",
      "links": "",
      "comment": "Forgiveness inspires deeper love; the larger the debt cancelled, the greater the love in response."
    },
    {
      "pk": 3407113,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 43,
      "text": "Simon answered, 'The one, I suppose, for whom he forgave more.' And he said to him, 'You have judged rightly.'",
      "links": "",
      "comment": "Simon understands the moral logic, preparing for Jesus’ application to true repentance."
    },
    {
      "pk": 3407114,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 44,
      "text": "Then turning toward the woman, he said to Simon, 'Do you see this woman? I entered your house, you gave me no water for my feet, but she has wet my feet with her tears and wiped them with her hair.'",
      "links": "",
      "comment": "Jesus exposes the contrast between conventional hospitality and heartfelt repentance."
    },
    {
      "pk": 3407115,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 45,
      "text": "'You did not give me a kiss, but from the time I came in she has not ceased to kiss my feet.'",
      "links": "",
      "comment": "Her actions go beyond ritual—true love and devotion surpass mere custom."
    },
    {
      "pk": 3407116,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 46,
      "text": "'You did not anoint my head with oil, but she has anointed my feet with ointment.'",
      "links": "",
      "comment": "The woman’s generosity is an act of humility and worship, hinting at the value of sacramental actions."
    },
    {
      "pk": 3407117,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 47,
      "text": "'Therefore I tell you, her sins, which are many, are forgiven—for she loved much. But he who is forgiven little, loves little.'",
      "links": "",
      "comment": "Love flows from receiving mercy. Forgiveness here involves both interior faith and outward expression."
    },
    {
      "pk": 3407118,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 48,
      "text": "And he said to her, 'Your sins are forgiven.'",
      "links": "<a href='/AIV/41/2/5-7'>Mark 2:5–7</a>",
      "comment": "Only God can forgive sins—Jesus here acts with divine authority, confirming his identity."
    },
    {
      "pk": 3407119,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 49,
      "text": "Then those who were reclining with him began to say among themselves, 'Who is this, who even forgives sins?'",
      "links": "<a href='/AIV/41/2/7'>Mark 2:7</a>",
      "comment": "This question recognizes the staggering claim Jesus makes to forgive sins—a prerogative of God alone."
    },
    {
      "pk": 3407120,
      "translation": "AIV",
      "book": 42,
      "chapter": 7,
      "verse": 50,
      "text": "He said to the woman, 'Your faith has saved you; go in peace.'",
      "links": "<a href='/AIV/18/22/21'>Job 22:21</a>",
      "comment": "‘Faith’ here is shown by acts—salvation brings peace, and Christ mediates both forgiveness and reconciliation. This affirms both interior faith and the value of outward confession and repentance."
    }
  ],
  "translatedAt": "2025-12-23T02:42:17.675Z"
}