{
  "book": "Luke",
  "bookAbbreviation": "Luke",
  "chapter": 2,
  "verses": [
    {
      "pk": 200001,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 1,
      "text": "In those days, a decree went out from Caesar Augustus that all the world should be registered.",
      "links": "<a href='/AIV/44/5/37'>Acts 5:37</a>",
      "comment": "The worldwide census set the historical context for Jesus' birth, fulfilling prophecy that the Messiah would come in real human history. See Micah 5:2 regarding Bethlehem."
    },
    {
      "pk": 200002,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 2,
      "text": "This was the first registration when Quirinius was governor of Syria.",
      "links": "",
      "comment": "Luke roots the narrative in historical events, emphasizing the factual nature of Christ's birth."
    },
    {
      "pk": 200003,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 3,
      "text": "And everyone went to register, each to his own town.",
      "links": "",
      "comment": "This census required families to return to their ancestral home, leading Joseph and Mary to Bethlehem."
    },
    {
      "pk": 200004,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 4,
      "text": "Joseph also went up from Galilee, from the city of Nazareth, to Judea, to the city of David which is called Bethlehem, because he was from the house and family of David,",
      "links": "<a href='/AIV/19/132/11'>Ps. 132:11</a>; <a href='/AIV/33/5/2'>Mic. 5:2</a>",
      "comment": "This fulfills prophecy that the Messiah would come from David's line and be born in Bethlehem (Micah 5:2)."
    },
    {
      "pk": 200005,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 5,
      "text": "to be registered with Mary, his betrothed, who was with child.",
      "links": "<a href='/AIV/40/1/18'>Matt. 1:18</a>",
      "comment": "Mary's betrothal highlights the virginal conception. See Matthew 1:18 for parallel."
    },
    {
      "pk": 200006,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 6,
      "text": "And while they were there, the time came for her to give birth.",
      "links": "",
      "comment": "Christ’s incarnation occurs in humility and simplicity, echoing the prophetic expectation of the suffering servant."
    },
    {
      "pk": 200007,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 7,
      "text": "She gave birth to her firstborn son, and wrapped him in swaddling cloths and laid him in a manger, because there was no place for them in the inn.",
      "links": "<a href='/AIV/23/1/3'>Isa. 1:3</a>",
      "comment": "The humble birth foreshadows how Jesus would be accessible to all, especially the lowly. Swaddling clothes may reference ancient traditions, hinting at Christ’s true humanity."
    },
    {
      "pk": 200008,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 8,
      "text": "And in the same region there were shepherds staying out in the fields, keeping watch over their flock by night.",
      "links": "<a href='/AIV/26/34/23'>Ezek. 34:23</a>",
      "comment": "Shepherds, often seen as outcasts, are first to receive the news, reflecting God's preference for the humble. The shepherd imagery echoes messianic prophecy."
    },
    {
      "pk": 200009,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 9,
      "text": "And an angel of the Lord appeared to them, and the glory of the Lord shone around them, and they were filled with great fear.",
      "links": "<a href='/AIV/1/16/7'>Gen. 16:7</a>; <a href='/AIV/7/13/6'>Judg. 13:6</a>",
      "comment": "Divine revelation often generates awe and fear; the glory here recalls the Shekinah glory of God in the Old Testament."
    },
    {
      "pk": 200010,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 10,
      "text": "And the angel said to them, 'Do not be afraid, for behold, I bring you good news of great joy which will be for all the people.'",
      "links": "<a href='/AIV/23/40/9'>Isa. 40:9</a>",
      "comment": "The angel announces the gospel, fulfilling the hope proclaimed by Isaiah—salvation for all peoples."
    },
    {
      "pk": 200011,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 11,
      "text": "'For today in the city of David a Savior has been born to you, who is Christ the Lord.'",
      "links": "<a href='/AIV/23/9/6'>Isa. 9:6</a>; <a href='/AIV/19/110/1'>Ps. 110:1</a>",
      "comment": "Calling Jesus 'Christ the Lord' is a title of divinity and kingship, fulfilling messianic prophecy."
    },
    {
      "pk": 200012,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 12,
      "text": "'And this will be a sign to you: you will find a baby wrapped in swaddling cloths and lying in a manger.'",
      "links": "",
      "comment": "God’s sign comes in humble circumstances, indicating that true greatness is often found in humility."
    },
    {
      "pk": 200013,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 13,
      "text": "And suddenly there was with the angel a multitude of the heavenly host praising God and saying,",
      "links": "<a href='/AIV/19/103/20-21'>Ps. 103:20–21</a>",
      "comment": "The presence of angels underscores the supernatural significance of this event."
    },
    {
      "pk": 200014,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 14,
      "text": "'Glory to God in the highest, and on earth peace among those with whom He is pleased.'",
      "links": "<a href='/AIV/19/29/1'>Ps. 29:1</a>",
      "comment": "This hymn expresses both praise and a promise of peace, pointing to reconciliation between God and mankind."
    },
    {
      "pk": 200015,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 15,
      "text": "When the angels had gone away from them into heaven, the shepherds said to one another, 'Let us go now to Bethlehem and see this thing that has happened, which the Lord has made known to us.'",
      "links": "",
      "comment": "The shepherds’ willingness to seek the newborn Christ sets an example of faith and responsiveness to divine invitation."
    },
    {
      "pk": 200016,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 16,
      "text": "And they hurried and found Mary and Joseph, and the baby lying in the manger.",
      "links": "",
      "comment": "This fulfills the angel’s sign and displays the unity of the holy family."
    },
    {
      "pk": 200017,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 17,
      "text": "When they saw this, they made known what had been told them about this child.",
      "links": "",
      "comment": "Witnessing and sharing the message is the natural response to encountering Christ."
    },
    {
      "pk": 200018,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 18,
      "text": "And all who heard it were astonished at what the shepherds had told them.",
      "links": "",
      "comment": "The good news is met with wonder, echoing the response to prophecy throughout scripture."
    },
    {
      "pk": 200019,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 19,
      "text": "But Mary treasured up all these things, pondering them in her heart.",
      "links": "<a href='/AIV/42/2/51'>Luke 2:51</a>",
      "comment": "Mary’s meditation points to the importance of reflection and contemplation of the mysteries of faith."
    },
    {
      "pk": 200020,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 20,
      "text": "And the shepherds returned, glorifying and praising God for all they had heard and seen, just as it had been told them.",
      "links": "<a href='/AIV/19/34/1'>Ps. 34:1</a>",
      "comment": "True encounter with Christ leads to worship and praise, fulfilling prophetic expectation."
    },
    {
      "pk": 200021,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 21,
      "text": "And when eight days had passed, when He was to be circumcised, He was named Jesus, the name given by the angel before He was conceived in the womb.",
      "links": "<a href='/AIV/1/17/19'>Gen. 17:19</a>; <a href='/AIV/40/1/21'>Matt. 1:21</a>",
      "comment": "The fulfillment of circumcision under the Law shows Jesus’ perfect obedience and the continuity between old and new covenants."
    },
    {
      "pk": 200022,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 22,
      "text": "And when the days of their purification according to the law of Moses were completed, they brought Him up to Jerusalem to present Him to the Lord,",
      "links": "<a href='/AIV/3/12/2-4'>Lev. 12:2–4</a>",
      "comment": "The presentation fulfills Mosaic Law and foreshadows the offering of Christ in the Temple."
    },
    {
      "pk": 200023,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 23,
      "text": "as it is written in the law of the Lord, ‘Every male who first opens the womb shall be called holy to the Lord,’",
      "links": "<a href='/AIV/2/13/2'>Ex. 13:2</a>",
      "comment": "The dedication connects Jesus with the tradition of setting apart the firstborn, symbolizing His holiness and mission."
    },
    {
      "pk": 200024,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 24,
      "text": "and to offer a sacrifice according to what is said in the law of the Lord: ‘a pair of turtledoves or two young pigeons.’",
      "links": "<a href='/AIV/3/12/8'>Lev. 12:8</a>",
      "comment": "The offering of birds indicates the humility of Jesus’ family; they were not wealthy, again emphasizing Christ’s solidarity with the poor."
    },
    {
      "pk": 200025,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 25,
      "text": "Now there was a man in Jerusalem named Simeon; this man was righteous and devout, waiting for the consolation of Israel, and the Holy Spirit was upon him.",
      "links": "<a href='/AIV/23/40/1'>Isa. 40:1</a>",
      "comment": "Simeon personifies Israel’s faithful remnant, awaiting the Messiah and endowed with the Spirit even before Pentecost."
    },
    {
      "pk": 200026,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 26,
      "text": "It had been revealed to him by the Holy Spirit that he would not see death before he had seen the Lord’s Christ.",
      "links": "",
      "comment": "Simeon’s promise reveals the active role of the Spirit in guiding and revealing God’s plans."
    },
    {
      "pk": 200027,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 27,
      "text": "He came by the Spirit into the temple, and when the parents brought in the child Jesus to do for Him according to the custom of the law,",
      "links": "",
      "comment": "The perfect timing and guidance by the Spirit illustrate Providence and the intersection of law and grace."
    },
    {
      "pk": 200028,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 28,
      "text": "He took Him up in his arms and praised God, saying:",
      "links": "",
      "comment": "This spontaneous praise is a model of worship in response to recognizing God’s action."
    },
    {
      "pk": 200029,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 29,
      "text": "'Lord, now You let Your servant depart in peace, according to Your word,",
      "links": "",
      "comment": "This is known as the Nunc Dimittis, a prayer of fulfillment and trust."
    },
    {
      "pk": 200030,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 30,
      "text": "for my eyes have seen Your salvation,",
      "links": "<a href='/AIV/23/52/10'>Isa. 52:10</a>",
      "comment": "Simeon recognizes Jesus Himself as salvation, both literally and spiritually—God’s promise fulfilled."
    },
    {
      "pk": 200031,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 31,
      "text": "which You have prepared in the presence of all peoples,",
      "links": "<a href='/AIV/23/42/6'>Isa. 42:6</a>",
      "comment": "The universal scope of the Messiah is declared: Jesus comes for all nations."
    },
    {
      "pk": 200032,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 32,
      "text": "a light for revelation to the Gentiles, and for glory to Your people Israel.'",
      "links": "<a href='/AIV/23/49/6'>Isa. 49:6</a>",
      "comment": "Jesus is revealed as the fulfillment of Isaiah’s prophecies, bringing light to Gentiles and honor to Israel. This foreshadows the Church’s universal mission."
    },
    {
      "pk": 200033,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 33,
      "text": "And his father and mother marveled at what was said about Him.",
      "links": "",
      "comment": "Even Jesus' earthly parents stand in awe of the scope of His mission. This points to the mystery of the Incarnation."
    },
    {
      "pk": 200034,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 34,
      "text": "And Simeon blessed them and said to Mary, His mother, 'Behold, this child is appointed for the fall and rising of many in Israel, and for a sign that will be opposed—'",
      "links": "<a href='/AIV/23/8/14'>Isa. 8:14</a>",
      "comment": "Simeon’s prophecy hints at the division Christ brings—some will accept, others will stumble. This has ongoing meaning for the people of God."
    },
    {
      "pk": 200035,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 35,
      "text": "'and a sword will pierce even your own soul—so that the thoughts of many hearts may be revealed.'",
      "links": "<a href='/AIV/19/22/16'>Ps. 22:16</a>",
      "comment": "The suffering of Mary foreshadows the cost of discipleship and Christ’s redemptive suffering, connecting Old Testament prophecy to Gospel fulfillment."
    },
    {
      "pk": 200036,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 36,
      "text": "Now there was a prophetess, Anna, daughter of Phanuel, of the tribe of Asher. She was advanced in years, having lived with her husband seven years after her marriage,",
      "links": "",
      "comment": "Anna’s devoted life and prophetic ministry reveal the presence of faithful women in salvation history."
    },
    {
      "pk": 200037,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 37,
      "text": "and then was a widow to the age of eighty-four. She did not leave the temple, worshiping with fasting and prayers night and day.",
      "links": "",
      "comment": "Her constant presence in prayer demonstrates the importance of spiritual disciplines and the value of continuous intercession."
    },
    {
      "pk": 200038,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 38,
      "text": "And coming up at that very moment, she began to give thanks to God and spoke about Him to all who were waiting for the redemption of Jerusalem.",
      "links": "<a href='/AIV/23/52/9'>Isa. 52:9</a>",
      "comment": "Anna recognizes Jesus’ role in redemption, linking hope from Isaiah to its fulfillment in Christ."
    },
    {
      "pk": 200039,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 39,
      "text": "When they had finished everything required by the law of the Lord, they returned to Galilee, to their own city of Nazareth.",
      "links": "",
      "comment": "Obedience to the Law is emphasized; it confirms Jesus' identity as the perfectly obedient Son."
    },
    {
      "pk": 200040,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 40,
      "text": "The child grew and became strong, filled with wisdom, and the grace of God was upon Him.",
      "links": "<a href='/AIV/19/45/2'>Ps. 45:2</a>",
      "comment": "Jesus’ growth in wisdom and grace shows His humanity, yet this grace is singular, pointing to His unique role in salvation history."
    },
    {
      "pk": 200041,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 41,
      "text": "Every year His parents went to Jerusalem for the feast of the Passover.",
      "links": "<a href='/AIV/2/23/17'>Ex. 23:17</a>",
      "comment": "Faithfulness to yearly pilgrimages shows the family’s devotion, and the significance of Passover in salvation history."
    },
    {
      "pk": 200042,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 42,
      "text": "And when He was twelve years old, they went up according to the custom of the feast.",
      "links": "",
      "comment": "Age twelve marks Jesus nearing adulthood in Jewish tradition, and sets the stage for His first public engagement."
    },
    {
      "pk": 200043,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 43,
      "text": "After the feast days were over, as they were returning, the boy Jesus remained behind in Jerusalem. But His parents did not know it.",
      "links": "",
      "comment": "Jesus demonstrates an early zeal for His Father’s house—hinting at His future ministry."
    },
    {
      "pk": 200044,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 44,
      "text": "Thinking He was in their company, they went a day’s journey, and then looked for Him among their relatives and friends.",
      "links": "",
      "comment": "The loss and search for Jesus by His parents emphasizes the close-knit community of faith and family."
    },
    {
      "pk": 200045,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 45,
      "text": "And when they did not find Him, they returned to Jerusalem, seeking Him.",
      "links": "",
      "comment": "The diligence and anxiety of Jesus' parents reflect both the humanity of the Holy Family and the value of perseverance in seeking God."
    },
    {
      "pk": 200046,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 46,
      "text": "After three days they found Him in the temple, sitting among the teachers, listening to them and asking them questions.",
      "links": "",
      "comment": "Three days foreshadow Jesus' later resurrection. His presence among the teachers shows His wisdom and sets a precedent for authoritative teaching in the Church."
    },
    {
      "pk": 200047,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 47,
      "text": "And all who heard Him were amazed at His understanding and His answers.",
      "links": "",
      "comment": "Jesus' wisdom even as a youth is an early sign of His divine identity and fulfillment of messianic expectations."
    },
    {
      "pk": 200048,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 48,
      "text": "When His parents saw Him, they were astonished. And His mother said to Him, 'Son, why have You treated us this way? Look, Your father and I have been searching for You anxiously.'",
      "links": "",
      "comment": "Mary’s concern highlights her maternal role and the family’s deep love for Jesus."
    },
    {
      "pk": 200049,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 49,
      "text": "He said to them, 'Why were you looking for Me? Did you not know that I must be in My Father’s house?'",
      "links": "<a href='/AIV/19/27/4'>Ps. 27:4</a>",
      "comment": "Jesus here makes a claim of unique relationship with God, identifying God as His Father in a way no other did. This is an implicit claim to divinity and messianic fulfillment."
    },
    {
      "pk": 200050,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 50,
      "text": "But they did not understand what He said to them.",
      "links": "",
      "comment": "The mystery of Christ’s identity was hidden even from those closest to Him, showing that faith is a journey of growing understanding."
    },
    {
      "pk": 200051,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 51,
      "text": "And He went down with them and came to Nazareth, and was obedient to them. And His mother treasured all these things in her heart.",
      "links": "<a href='/AIV/42/2/19'>Luke 2:19</a>",
      "comment": "Jesus' submission to His earthly parents reveals the model of humility and obedience. The spiritual practice of meditation on sacred mysteries is exemplified by Mary."
    },
    {
      "pk": 200052,
      "translation": "AIV",
      "book": 42,
      "chapter": 2,
      "verse": 52,
      "text": "And Jesus grew in wisdom and stature, and in favor with God and man.",
      "links": "<a href='/AIV/9/2/26'>1 Sam. 2:26</a>",
      "comment": "Jesus’ human development affirms both His true humanity and divinity. His favor with God and men foreshadows His role as the perfect mediator and High Priest."
    }
  ],
  "translatedAt": "2025-12-23T02:38:29.132Z"
}