{
  "book": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 20,
  "verses": [
    {
      "pk": 5020001,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 1,
      "text": "When you go out to battle against your enemies and see horses and chariots and a people more numerous than you, do not be afraid of them, for the LORD your God, who brought you up out of the land of Egypt, is with you.",
      "links": "<a href='/AIV/2/14/13'>Ex. 14:13</a>; <a href='/AIV/7/7/12'>Judg. 7:12</a>",
      "comment": "Stays close to the Hebrew text, with 'do not be afraid' for the imperative."
    },
    {
      "pk": 5020002,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 2,
      "text": "And when you are drawing near to the battle, the priest shall come forward and speak to the people",
      "links": "<a href='/AIV/4/10/9'>Num. 10:9</a>",
      "comment": "Priest’s role is emphasized as in the Hebrew."
    },
    {
      "pk": 5020003,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 3,
      "text": "and shall say to them, ‘Hear, O Israel: Today you are drawing near for battle against your enemies. Do not let your heart be faint. Do not be afraid, or panic, or be terrified because of them.’",
      "links": "<a href='/AIV/6/1/9'>Josh. 1:9</a>; <a href='/AIV/5/1/21'>Deut. 1:21</a>",
      "comment": "Four Hebrew verbs for fear are translated as 'faint', 'afraid', 'panic', and 'terrified'."
    },
    {
      "pk": 5020004,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 4,
      "text": "For the LORD your God is the one who goes with you to fight for you against your enemies, to save you.",
      "links": "<a href='/AIV/2/14/14'>Ex. 14:14</a>",
      "comment": "‘To save you’ translates the Hebrew l’hoshia."
    },
    {
      "pk": 5020005,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 5,
      "text": "Then the officers shall speak to the people, saying, ‘Who is the man who has built a new house and has not dedicated it? Let him go and return to his house, lest he die in the battle and another man dedicate it.’",
      "links": "<a href='/AIV/23/65/21'>Isa. 65:21</a>",
      "comment": "‘Dedicated’ refers to making the house holy or officially opening."
    },
    {
      "pk": 5020006,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 6,
      "text": "Who is the man who has planted a vineyard and has not enjoyed its fruit? Let him go and return to his house, lest he die in the battle and another man enjoy its fruit.",
      "links": "<a href='/AIV/3/19/23-25'>Lev. 19:23-25</a>",
      "comment": "‘Enjoy its fruit’ is literal for Hebrew ‘begin to use it’."
    },
    {
      "pk": 5020007,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 7,
      "text": "Who is the man who is engaged to a woman and has not married her? Let him go and return to his house, lest he die in the battle and another man marry her.",
      "links": "<a href='/AIV/28/14/3'>Hos. 14:3</a>",
      "comment": "‘Engaged’ is literal, ‘has not taken her’ translates Hebrew idiom."
    },
    {
      "pk": 5020008,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 8,
      "text": "And the officers shall continue to speak to the people, and say, ‘Who is the man who is afraid and fainthearted? Let him go and return to his house, lest his brothers' hearts faint like his heart.’",
      "links": "<a href='/AIV/7/7/3'>Judg. 7:3</a>",
      "comment": "‘Afraid and fainthearted’ doublet is preserved from the Hebrew."
    },
    {
      "pk": 5020009,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 9,
      "text": "And when the officers have finished speaking to the people, they shall appoint commanders of armies at the head of the people.",
      "links": "<a href='/AIV/4/31/14'>Num. 31:14</a>",
      "comment": "‘Commanders of armies’ reflects Hebrew officers of the host."
    },
    {
      "pk": 5020010,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 10,
      "text": "When you draw near to a city to fight against it, you shall offer it terms of peace.",
      "links": "<a href='/AIV/6/9/7'>Josh. 9:7, 15</a>",
      "comment": "‘Offer it terms of peace’ translates Hebrew idiom 'call for peace'."
    },
    {
      "pk": 5020011,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 11,
      "text": "And if it answers you peacefully and opens to you, then all the people who are found in it shall become your forced labor and shall serve you.",
      "links": "<a href='/AIV/11/9/21'>1 Kings 9:21</a>",
      "comment": "‘Forced labor’ is a literal rendering; refers to tribute/service."
    },
    {
      "pk": 5020012,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 12,
      "text": "But if it does not make peace with you, but makes war against you, then you shall besiege it.",
      "links": "<a href='/AIV/10/20/15'>2 Sam. 20:15</a>",
      "comment": "‘Besiege it’ is a literal translation."
    },
    {
      "pk": 5020013,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 13,
      "text": "And when the LORD your God delivers it into your hand, you shall strike every male in it with the edge of the sword.",
      "links": "<a href='/AIV/6/6/21'>Josh. 6:21</a>",
      "comment": "‘With the edge of the sword’ is a literal Hebrew phrase."
    },
    {
      "pk": 5020014,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 14,
      "text": "But the women, the little ones, the livestock, and all that is in the city, all its spoil, you shall take as plunder for yourself. And you shall enjoy the spoil of your enemies that the LORD your God has given you.",
      "links": "<a href='/AIV/4/31/9-11'>Num. 31:9-11</a>",
      "comment": "‘Plunder’ and ‘spoil’ both translate Hebrew words for property taken in war."
    },
    {
      "pk": 5020015,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 15,
      "text": "Thus you shall do to all the cities that are very far from you, which are not of the cities of these nations here.",
      "links": "<a href='/AIV/6/9/7'>Josh. 9:7</a>",
      "comment": "‘Very far from you’ is a literal translation of the Hebrew phrase."
    },
    {
      "pk": 5020016,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 16,
      "text": "But of the cities of these peoples that the LORD your God is giving you for an inheritance, you shall not let anything that breathes remain alive,",
      "links": "<a href='/AIV/5/7/2'>Deut. 7:2</a>; <a href='/AIV/6/10/40'>Josh. 10:40</a>",
      "comment": "‘Anything that breathes’ is literal for Hebrew ‘all that breathes’."
    },
    {
      "pk": 5020017,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 17,
      "text": "but you shall completely destroy them—the Hittites, the Amorites, the Canaanites, the Perizzites, the Hivites, and the Jebusites—as the LORD your God has commanded you;",
      "links": "<a href='/AIV/6/24/11'>Josh. 24:11</a>",
      "comment": "‘Completely destroy’ translates Hebrew herem, meaning ‘devote to destruction’."
    },
    {
      "pk": 5020018,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 18,
      "text": "so that they do not teach you to do according to all the abominations that they have done for their gods, and so you sin against the LORD your God.",
      "links": "<a href='/AIV/5/12/31'>Deut. 12:31</a>",
      "comment": "‘Abominations’ retains the moral term for idolatrous practices."
    },
    {
      "pk": 5020019,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 19,
      "text": "When you besiege a city a long time, making war against it to capture it, you shall not destroy its trees by swinging an axe against them. For you may eat from them, but you shall not cut them down. Are the trees of the field human, that they should be besieged by you?",
      "links": "<a href='/AIV/2/23/10-11'>Ex. 23:10-11</a>",
      "comment": "Retains wordplay of ‘man is the tree of the field’ as in Hebrew."
    },
    {
      "pk": 5020020,
      "translation": "AIV",
      "book": 5,
      "chapter": 20,
      "verse": 20,
      "text": "Only the trees that you know are not trees for food you may destroy and cut down, so that you may build siege works against the city that makes war with you, until it falls.",
      "links": "<a href='/AIV/6/8/1'>Josh. 8:1</a>",
      "comment": "‘Siege works’ is a literal rendering; applies to military context."
    }
  ],
  "translatedAt": "2025-12-20T09:58:07.253Z"
}