{
  "book": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 25,
  "verses": [
    {
      "pk": 2502501,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 1,
      "text": "If there is a dispute between men and they come to court, and the judges judge them, then they shall justify the righteous and condemn the wicked.",
      "links": "<a href='/AIV/2/23/7'>Ex. 23:7</a>; <a href='/AIV/20/17/15'>Prov. 17:15</a>",
      "comment": "The phrase 'justify the righteous and condemn the wicked' is a literal rendering of the Hebrew."
    },
    {
      "pk": 2502502,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 2,
      "text": "If the guilty man deserves to be beaten, the judge shall make him lie down and be beaten in his presence, with the number of stripes in proportion to his offense.",
      "links": "<a href='/AIV/5/19/20'>Deut. 19:20–21</a>; <a href='/AIV/61/23/2'>2 Cor. 11:24</a>",
      "comment": "The word 'stripes' refers to lashes; 'in proportion to his offense' is a literal translation from the Hebrew."
    },
    {
      "pk": 2502503,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 3,
      "text": "He may give him forty stripes, not more; lest, if he beats him with more stripes than these, your brother is degraded in your eyes.",
      "links": "<a href='/AIV/47/11/24'>2 Cor. 11:24</a>",
      "comment": "The limit of forty stripes is exact as in the Hebrew; the phrase 'is degraded' reflects the sense of humiliation."
    },
    {
      "pk": 2502504,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 4,
      "text": "You shall not muzzle an ox when it treads out the grain.",
      "links": "<a href='/AIV/46/9/9'>1 Cor. 9:9</a>; <a href='/AIV/54/5/18'>1 Tim. 5:18</a>",
      "comment": "Literal translation of the law regarding treatment of animals; quoted in the New Testament."
    },
    {
      "pk": 2502505,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 5,
      "text": "If brothers dwell together, and one of them dies and has no son, the wife of the dead man shall not be married outside the family to a stranger; her husband's brother shall go in to her, take her as his wife, and perform the duty of a brother-in-law to her.",
      "links": "<a href='/AIV/1/38/8'>Gen. 38:8</a>; <a href='/AIV/40/22/24'>Matt. 22:24</a>",
      "comment": "This is the law of levirate marriage, rendered as directly as possible."
    },
    {
      "pk": 2502506,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 6,
      "text": "And the first son whom she bears shall succeed in the name of his dead brother, that his name may not be blotted out from Israel.",
      "links": "<a href='/AIV/8/4/5'>Ruth 4:5</a>",
      "comment": "Literal language for the preservation of the brother's name."
    },
    {
      "pk": 2502507,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 7,
      "text": "But if the man does not wish to take his brother's wife, then his brother's wife shall go up to the gate to the elders and say, 'My husband's brother refuses to perpetuate his brother's name in Israel; he will not perform the duty of a brother-in-law to me.'",
      "links": "<a href='/AIV/8/4/1'>Ruth 4:1</a>",
      "comment": "Rendered word-for-word; 'perpetuate his brother's name' is a literal phrase from the Hebrew."
    },
    {
      "pk": 2502508,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 8,
      "text": "Then the elders of his city shall call him and speak to him, and if he persists and says, 'I do not wish to take her,'",
      "links": "<a href='/AIV/8/4/2'>Ruth 4:2</a>",
      "comment": "Directly translated to keep the legal process clear."
    },
    {
      "pk": 2502509,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 9,
      "text": "then his brother's wife shall come up to him in the presence of the elders, pull his sandal off his foot, spit in his face, and answer and say, 'So shall it be done to the man who does not build up his brother's house.'",
      "links": "<a href='/AIV/8/4/7'>Ruth 4:7,8</a>",
      "comment": "Literal actions and speech; 'build up his brother's house' means continue his family line."
    },
    {
      "pk": 2502510,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 10,
      "text": "And his name shall be called in Israel, 'The house of him who had his sandal pulled off.'",
      "links": "<a href='/AIV/8/4/8'>Ruth 4:8</a>",
      "comment": "Translation sticks closely with the Hebrew idiom about disgrace."
    },
    {
      "pk": 2502511,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 11,
      "text": "When men fight with one another, and the wife of one comes near to rescue her husband from the hand of him who is beating him, and puts out her hand and grabs him by the private parts,",
      "links": "",
      "comment": "'Private parts' is a straightforward modern phrasing for the Hebrew euphemism."
    },
    {
      "pk": 2502512,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 12,
      "text": "then you shall cut off her hand; your eye shall not pity her.",
      "links": "<a href='/AIV/5/19/13'>Deut. 19:13</a>",
      "comment": "Literal description of the punishment; 'your eye shall not pity' is a Hebrew expression for unflinching justice."
    },
    {
      "pk": 2502513,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 13,
      "text": "You shall not have in your bag two kinds of weights, a large and a small.",
      "links": "<a href='/AIV/3/19/35'>Lev. 19:35–36</a>; <a href='/AIV/20/20/10'>Prov. 20:10</a>",
      "comment": "Literal rendering of law against dishonest weights."
    },
    {
      "pk": 2502514,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 14,
      "text": "You shall not have in your house two kinds of measures, a large and a small.",
      "links": "<a href='/AIV/20/20/23'>Prov. 20:23</a>; <a href='/AIV/33/6/10'>Mic. 6:10-11</a>",
      "comment": "Continuation of honest business principles."
    },
    {
      "pk": 2502515,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 15,
      "text": "You shall have a perfect and just weight, a perfect and just measure, so that your days may be long in the land that the LORD your God is giving you.",
      "links": "<a href='/AIV/20/16/11'>Prov. 16:11</a>",
      "comment": "'Perfect and just' is a literal phrase; connects obedience to long life in the land."
    },
    {
      "pk": 2502516,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 16,
      "text": "For all who do such things, all who act unjustly, are an abomination to the LORD your God.",
      "links": "<a href='/AIV/20/11/1'>Prov. 11:1</a>",
      "comment": "'Abomination' is the standard translation of the Hebrew toʿevah."
    },
    {
      "pk": 2502517,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 17,
      "text": "Remember what Amalek did to you on the way as you came out of Egypt,",
      "links": "<a href='/AIV/2/17/8'>Ex. 17:8–16</a>",
      "comment": "Literal rendering; refers back to the events recounted in Exodus 17."
    },
    {
      "pk": 2502518,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 18,
      "text": "how he attacked you on the way, when you were faint and weary, and cut off your stragglers at your rear, and he did not fear God.",
      "links": "<a href='/AIV/9/15/2'>1 Sam. 15:2</a>",
      "comment": "Translation sticks closely to description of Amalek's actions."
    },
    {
      "pk": 2502519,
      "translation": "AIV",
      "book": 5,
      "chapter": 25,
      "verse": 19,
      "text": "Therefore, when the LORD your God has given you rest from all your enemies around you, in the land that the LORD your God is giving you as an inheritance to possess, you shall blot out the memory of Amalek from under heaven; you shall not forget.",
      "links": "<a href='/AIV/9/15/3'>1 Sam. 15:3</a>",
      "comment": "'Blot out the memory' is a literal phrase from Hebrew signifying total destruction."
    }
  ],
  "translatedAt": "2025-12-20T10:00:17.678Z"
}