{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 10,
  "verses": [
    {
      "pk": 5010001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 1,
      "text": "At that time the LORD said to me, 'Cut two stone tablets like the first, and come up to Me on the mountain. Make a wooden ark for yourself.'",
      "links": "<a href='/AIV/2/34/1'>Ex. 34:1</a>; <a href='/AIV/5/9/9'>Deut. 9:9</a>",
      "comment": "Here, Moses is to recreate the tablets of the covenant, showing that God's mercy allows restoration after Israel's disobedience. The ark is introduced as the vessel for God's law—later signifying God dwelling among His people, prefiguring a deeper sacramental presence. See Ex. 25:10-22 for the original instructions."
    },
    {
      "pk": 5010002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 2,
      "text": "'I will write on the tablets the words that were on the first tablets, which you broke, and you will put them in the ark.'",
      "links": "<a href='/AIV/2/32/19'>Ex. 32:19</a>; <a href='/AIV/2/25/16'>Ex. 25:16</a>",
      "comment": "God Himself writes the commandments, emphasizing their divine origin and permanence. The act of placing them in the ark is an image of the heart containing God's Word. For Christians, this hints at the Word made flesh, dwelling among us (John 1:14)."
    },
    {
      "pk": 5010003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 3,
      "text": "So I made an ark of acacia wood, and cut two stone tablets like the first, then went up the mountain holding the two tablets.",
      "links": "<a href='/AIV/2/25/10'>Ex. 25:10</a>",
      "comment": "Moses follows God's instructions precisely—a sign of faithful obedience, shaping the foundation for the pattern of worship and reverence before God."
    },
    {
      "pk": 5010004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 4,
      "text": "And He wrote on the tablets, just as before, the Ten Words which the LORD had spoken to you on the mountain out of the midst of the fire on the day of the assembly; and the LORD gave them to me.",
      "links": "<a href='/AIV/2/20/1-17'>Ex. 20:1-17</a>; <a href='/AIV/5/5/22'>Deut. 5:22</a>",
      "comment": "The reference to the 'Ten Words' (Ten Commandments) highlights the heart of the covenant. The assembly recalls the communal nature of receiving God's law, foreshadowing how God's people are called together, united in truth and worship."
    },
    {
      "pk": 5010005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 5,
      "text": "Then I turned and came down from the mountain and put the tablets in the ark I had made. They have remained there, just as the LORD commanded me.",
      "links": "<a href='/AIV/4/17/4'>Num. 17:4</a>; <a href='/AIV/9/15/'>Deut. 9:15</a>",
      "comment": "The tablets remaining in the ark signifies God's continued covenant presence. This permanence of God's Word is a theme picked up by the prophets and ultimately fulfilled in Christ (Heb. 9:4)."
    },
    {
      "pk": 5010006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 6,
      "text": "The Israelites traveled from Beeroth Bene-Jaakan to Moserah. There Aaron died and was buried, and Eleazar his son served as priest in his place.",
      "links": "<a href='/AIV/4/20/28'>Num. 20:28</a>; <a href='/AIV/5/33/6'>Deut. 33:6</a>",
      "comment": "Succession in the priesthood is emphasized here, demonstrating continuity of spiritual authority. The priesthood is vital for mediation between God and man—a principle later fulfilled and elevated in Christ, our high priest (Heb. 7:23-28)."
    },
    {
      "pk": 5010007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 7,
      "text": "From there they traveled to Gudgodah, and then to Jotbathah, a land with streams of water.",
      "links": "<a href='/AIV/4/33/32-33'>Num. 33:32-33</a>",
      "comment": "The mention of a land with streams points to God's ongoing care and providence, linking to the promise of abundance and the living water Christ later offers (John 4:14; John 7:38)."
    },
    {
      "pk": 5010008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 8,
      "text": "At that time the LORD set apart the tribe of Levi to carry the ark of the covenant of the LORD, to stand before the LORD to serve Him, and to bless in His name until this day.",
      "links": "<a href='/AIV/4/3/6-13'>Num. 3:6-13</a>; <a href='/AIV/5/18/5'>Deut. 18:5</a>",
      "comment": "Levi's setting apart is a foundation for specialized spiritual ministry and blessing, later paralleled in the concept of apostolic succession and the special role of those who serve in worship and sacraments."
    },
    {
      "pk": 5010009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 9,
      "text": "That is why Levi has no share or inheritance with their brothers; the LORD is his inheritance, as the LORD your God told him.",
      "links": "<a href='/AIV/4/18/20'>Num. 18:20</a>; <a href='/AIV/5/18/2'>Deut. 18:2</a>",
      "comment": "Levi’s unique inheritance—God Himself—underscores the greater spiritual calling. For Christians, it mirrors the call to set aside earthly rewards for lasting spiritual treasure (Matt. 6:19-21)."
    },
    {
      "pk": 5010010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 10,
      "text": "I stayed on the mountain forty days and forty nights, just as the first time. The LORD listened to me that time also; He did not destroy you.",
      "links": "<a href='/AIV/2/34/28'>Ex. 34:28</a>; <a href='/AIV/5/9/18'>Deut. 9:18</a>",
      "comment": "Forty days and nights symbolize completeness, trial, and preparation—foreshadowing Christ’s forty days in the wilderness (Matt. 4:2). Moses’ intercession recalls the power of mediation and prayer for God’s mercy."
    },
    {
      "pk": 5010011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 11,
      "text": "The LORD said to me, 'Get up and continue your journey ahead of the people, so that they may go in and take possession of the land I swore to give their ancestors.'",
      "links": "<a href='/AIV/1/12/6-7'>Gen. 12:6-7</a>; <a href='/AIV/5/1/7'>Deut. 1:7</a>",
      "comment": "God’s faithfulness to His promises is highlighted. The possession of the land prefigures the deeper reality of God’s kingdom and inheritance promised in Christ."
    },
    {
      "pk": 5010012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 12,
      "text": "Now, Israel, what does the LORD your God ask of you, but to fear the LORD your God, to walk in all His ways, to love Him, and to serve the LORD your God with all your heart and all your soul?",
      "links": "<a href='/AIV/5/6/5'>Deut. 6:5</a>; <a href='/AIV/40/22/37'>Matt. 22:37</a>",
      "comment": "Calling for total love and devotion, this verse is the heart of the law and the foundation of biblical ethics. Jesus affirms this as the greatest commandment, showing continuity between Old and New Testament teaching."
    },
    {
      "pk": 5010013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 13,
      "text": "And to keep the LORD’s commandments and statutes that I am giving you today for your own good.",
      "links": "<a href='/AIV/5/30/16'>Deut. 30:16</a>",
      "comment": "Obedience to God’s commands leads to blessing, emphasizing the covenant’s conditional aspect. The moral law remains a guide for Christians, fulfilled and perfected in Jesus."
    },
    {
      "pk": 5010014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 14,
      "text": "Look, to the LORD your God belong heaven and the highest heavens, the earth and everything in it.",
      "links": "<a href='/AIV/19/24/1'>Ps. 24:1</a>; <a href='/AIV/19/115/16'>Ps. 115:16</a>",
      "comment": "God’s universal sovereignty is declared: all creation is His. This supports later themes of God’s kingdom and the fulfilment of divine promises beyond political or national boundaries (Col. 1:16)."
    },
    {
      "pk": 5010015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 15,
      "text": "Yet the LORD set His affection on your ancestors—loved them—and chose their descendants after them, you above all people, as it is today.",
      "links": "<a href='/AIV/1/17/7'>Gen. 17:7</a>; <a href='/AIV/19/135/4'>Ps. 135:4</a>",
      "comment": "Here, God’s choosing and loving initiative is emphasized, laying groundwork for salvation history. God’s electing love is echoed in Christ’s calling of His disciples and the church."
    },
    {
      "pk": 5010016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 16,
      "text": "Therefore, circumcise the foreskin of your hearts, and do not be stiff-necked any longer.",
      "links": "<a href='/AIV/24/4/4'>Jer. 4:4</a>; <a href='/AIV/45/2/29'>Rom. 2:29</a>",
      "comment": "This verse introduces the concept of interior transformation, not just outward ritual. Paul applies this very language to describe genuine conversion in Christ, connecting the old and new covenants (Rom. 2:29)."
    },
    {
      "pk": 5010017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 17,
      "text": "For the LORD your God is the God of gods and Lord of lords, the great, mighty, and awesome God who does not show favoritism or take bribes.",
      "links": "<a href='/AIV/19/136/2-3'>Ps. 136:2-3</a>; <a href='/AIV/66/19/16'>Rev. 19:16</a>",
      "comment": "God’s supreme justice and transcendence are emphasized—the same title given to Christ in Revelation 19:16, identifying the divine Messiah as the fulfillment of this description."
    },
    {
      "pk": 5010018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 18,
      "text": "He upholds the cause of the fatherless and the widow, and loves the foreigner, giving him food and clothing.",
      "links": "<a href='/AIV/19/68/5'>Ps. 68:5</a>; <a href='/AIV/40/25/35'>Matt. 25:35</a>",
      "comment": "God’s compassion for the vulnerable is a constant biblical theme, later embodied perfectly in Christ’s ministry and in apostolic teaching on charity and justice (James 1:27)."
    },
    {
      "pk": 5010019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 19,
      "text": "So you shall love the foreigner, for you were foreigners in the land of Egypt.",
      "links": "<a href='/AIV/3/19/34'>Lev. 19:34</a>",
      "comment": "Israel’s experience of alienation is the motive for generosity and kindness. In Christ, all tribes and nations are welcomed into the one family of God—unity in diversity."
    },
    {
      "pk": 5010020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 20,
      "text": "Fear the LORD your God; serve Him, cling to Him, and swear by His name.",
      "links": "<a href='/AIV/5/6/13'>Deut. 6:13</a>; <a href='/AIV/40/4/10'>Matt. 4:10</a>",
      "comment": "Wholehearted devotion and worship are commanded. Jesus quotes this in His temptation (Matt. 4:10), affirming true worship and service must be directed only to God."
    },
    {
      "pk": 5010021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 21,
      "text": "He is your praise; He is your God, who has done for you these great and awesome things which your eyes have seen.",
      "links": "<a href='/AIV/19/106/2'>Ps. 106:2</a>; <a href='/AIV/5/4/34'>Deut. 4:34</a>",
      "comment": "Praise belongs to God alone. The 'awesome things' recalls the miracles of Exodus, pointing to the greater works in salvation history, culminating in Christ’s resurrection."
    },
    {
      "pk": 5010022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 10,
      "verse": 22,
      "text": "Your ancestors went down into Egypt seventy in number, and now the LORD your God has made you as numerous as the stars in heaven.",
      "links": "<a href='/AIV/1/46/27'>Gen. 46:27</a>; <a href='/AIV/1/15/5'>Gen. 15:5</a>",
      "comment": "The promise to Abraham (Gen. 15:5) is shown fulfilled, emphasizing God’s faithfulness to His people and the multiplication of their descendants, which finds a spiritual fulfillment in the gathering of all believers in Christ."
    }
  ],
  "translatedAt": "2025-12-24T02:02:22.151Z"
}