{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 8,
  "verses": [
    {
      "pk": 5008001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 1,
      "text": "Be careful to follow every command that I am commanding you today, so that you may live and multiply, and go in and possess the land that the LORD swore to your fathers.",
      "links": "<a href='/AIV/5/6/24'>Deut. 6:24</a>; <a href='/AIV/1/15/18'>Gen. 15:18</a>",
      "comment": "Obedience to God's commands is seen as the path to true life and blessing. There is an emphasis on continuity with the faith of the patriarchs, highlighting God's faithfulness to His promises. The call to follow 'every command' foreshadows the later importance placed on both faith and works in entering God's promises (cf. Jas. 2:17-24)."
    },
    {
      "pk": 5008002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 2,
      "text": "You shall remember all the way that the LORD your God has led you these forty years in the wilderness, to humble you and test you, to know what was in your heart, whether you would keep His commands or not.",
      "links": "<a href='/AIV/2/16/4'>Exod. 16:4</a>; <a href='/AIV/5/13/3'>Deut. 13:3</a>",
      "comment": "The purpose of testing is to reveal the depth of true faith and to form humility. This process of 'testing' connects with later spiritual disciplines that help believers discern their hearts."
    },
    {
      "pk": 5008003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 3,
      "text": "He humbled you and let you hunger, and then fed you with manna, which neither you nor your fathers had known, to make you understand that man does not live by bread alone, but by every word that comes from the mouth of the LORD.",
      "links": "<a href='/AIV/2/16/15'>Exod. 16:15</a>; <a href='/AIV/40/4/4'>Matt. 4:4</a>",
      "comment": "This verse is quoted by Jesus during His temptation in the wilderness (<a href='/AIV/40/4/4'>Matt. 4:4</a>). The spiritual lesson is dependence on God's word, a pattern fulfilled in Christ, the true bread from heaven (<a href='/AIV/43/6/31-35'>John 6:31-35</a>)."
    },
    {
      "pk": 5008004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 4,
      "text": "Your clothing did not wear out on you, nor did your feet swell these forty years.",
      "links": "<a href='/AIV/5/29/5'>Deut. 29:5</a>; <a href='/AIV/16/9/21'>Neh. 9:21</a>",
      "comment": "God's care extended to every detail, showing that He provides for both material and spiritual needs. This care anticipates the Church's call to minister to body and soul."
    },
    {
      "pk": 5008005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 5,
      "text": "Know then in your heart that, just as a man disciplines his son, so the LORD your God disciplines you.",
      "links": "<a href='/AIV/20/3/11-12'>Prov. 3:11-12</a>; <a href='/AIV/58/12/5-7'>Heb. 12:5-7</a>",
      "comment": "Discipline is a sign of adoption as God's children. The New Testament echoes this (<a href='/AIV/58/12/6'>Heb. 12:6</a>), pointing to a loving Father who corrects and guides for holiness."
    },
    {
      "pk": 5008006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 6,
      "text": "So you shall keep the commands of the LORD your God, to walk in His ways and to fear Him.",
      "links": "<a href='/AIV/5/10/12'>Deut. 10:12</a>; <a href='/AIV/21/12/13'>Eccl. 12:13</a>",
      "comment": "Walking in God's ways involves both obedience and reverence. The call to 'fear' God includes awe and worship, pointing forward to the communal worship and sacramental life that the people of God are invited into."
    },
    {
      "pk": 5008007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 7,
      "text": "For the LORD your God is bringing you into a good land, a land of brooks of water, of fountains and springs, flowing out in valleys and hills,",
      "links": "<a href='/AIV/2/3/8'>Exod. 3:8</a>; <a href='/AIV/19/65/9-13'>Ps. 65:9-13</a>",
      "comment": "The Promised Land is described as a place of abundance and blessing, a foreshadowing of the eternal inheritance prepared for the faithful."
    },
    {
      "pk": 5008008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 8,
      "text": "a land of wheat and barley, of vines, fig trees, and pomegranates, a land of olive oil and honey;",
      "links": "<a href='/AIV/2/3/17'>Exod. 3:17</a>; <a href='/AIV/26/20/6'>Ezek. 20:6</a>",
      "comment": "The blessed bounty points to both physical and spiritual fruitfulness, connecting with the fruits of the Spirit found in the New Covenant (<a href='/AIV/48/5/22-23'>Gal. 5:22-23</a>)."
    },
    {
      "pk": 5008009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 9,
      "text": "a land where you will eat bread without shortage, where you will lack nothing; a land whose stones are iron and out of whose hills you can dig copper.",
      "links": "<a href='/AIV/5/6/11'>Deut. 6:11</a>; <a href='/AIV/19/23/1'>Ps. 23:1</a>",
      "comment": "God promises provision and security. The abundance of bread is a hint of the later Bread of Life (<a href='/AIV/43/6/35'>John 6:35</a>), and the minerals recall the enduring strength of God's blessing."
    },
    {
      "pk": 5008010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 10,
      "text": "And you shall eat and be satisfied, and you shall bless the LORD your God for the good land He has given you.",
      "links": "<a href='/AIV/19/103/2-5'>Ps. 103:2-5</a>; <a href='/AIV/40/14/19'>Matt. 14:19</a>",
      "comment": "Blessing God after receiving His gifts reflects a heart of gratitude. This forms the basis for the practice of giving thanks, especially in connection with meals, and foreshadows giving thanks in worship after receiving spiritual food."
    },
    {
      "pk": 5008011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 11,
      "text": "Take care that you do not forget the LORD your God by failing to keep His commands, His judgments, and His statutes, which I am commanding you today.",
      "links": "<a href='/AIV/5/6/12'>Deut. 6:12</a>; <a href='/AIV/19/103/2'>Ps. 103:2</a>",
      "comment": "Forgetting God occurs when obedience wanes. Faithfulness in observing God's teachings is tied to recalling His works. Remembrance is central to worship practices throughout salvation history."
    },
    {
      "pk": 5008012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 12,
      "text": "Otherwise, when you have eaten and are satisfied, and have built fine houses and lived in them,",
      "links": "<a href='/AIV/28/13/6'>Hos. 13:6</a>",
      "comment": "Comfort and prosperity can lead to forgetfulness of God, a recurring theme. This warns believers of the danger of self-sufficiency apart from God’s grace."
    },
    {
      "pk": 5008013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 13,
      "text": "and when your herds and flocks multiply, and your silver and gold increase, and all that you have is multiplied;",
      "links": "<a href='/AIV/20/30/8-9'>Prov. 30:8-9</a>",
      "comment": "Increasing prosperity can tempt the heart away from dependence on God. The spiritual lesson is to hold God above all material blessings."
    },
    {
      "pk": 5008014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 14,
      "text": "then your heart be lifted up, and you forget the LORD your God, who brought you out of the land of Egypt, out of the house of slavery,",
      "links": "<a href='/AIV/2/13/3'>Exod. 13:3</a>; <a href='/AIV/19/106/21'>Ps. 106:21</a>",
      "comment": "Pride leads to forgetfulness of salvation. Remembering God's saving acts is crucial, as it grounds humility and gratitude in the community of faith."
    },
    {
      "pk": 5008015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 15,
      "text": "who led you through the great and terrible wilderness, with its fiery serpents and scorpions, and thirsty ground where there was no water; who brought water for you out of the flinty rock;",
      "links": "<a href='/AIV/2/17/6'>Exod. 17:6</a>; <a href='/AIV/4/21/6'>Num. 21:6</a>; <a href='/AIV/46/10/4'>1 Cor. 10:4</a>",
      "comment": "Paul sees the 'rock' as a spiritual type of Christ (<a href='/AIV/46/10/4'>1 Cor. 10:4</a>). The ongoing theme is that God sustains His people in miraculous ways, leading to the New Covenant understanding of Christ’s presence with His people."
    },
    {
      "pk": 5008016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 16,
      "text": "who fed you in the wilderness with manna, which your fathers had not known, that He might humble you and test you, to do you good in the end;",
      "links": "<a href='/AIV/2/16/15'>Exod. 16:15</a>; <a href='/AIV/43/6/49-51'>John 6:49-51</a>",
      "comment": "God's purpose in testing and humbling was ultimately their good. The giving of manna anticipates the greater gift: the bread from heaven, fulfilled in Jesus."
    },
    {
      "pk": 5008017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 17,
      "text": "and you say in your heart, 'My power and the strength of my hand have gotten me this wealth.'",
      "links": "<a href='/AIV/28/12/8'>Hos. 12:8</a>",
      "comment": "A warning against the pride of self-reliance. Salvation and blessing are gifts, not earned, and a humble dependence upon God is essential."
    },
    {
      "pk": 5008018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 18,
      "text": "But you shall remember the LORD your God, for it is He who gives you power to produce wealth, that He may confirm His covenant that He swore to your fathers, as it is this day.",
      "links": "<a href='/AIV/1/12/2-3'>Gen. 12:2-3</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "God’s covenant faithfulness is the foundation for all blessing. The theme of memory and thanksgiving forms a central part of ongoing worship life for God’s people."
    },
    {
      "pk": 5008019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 19,
      "text": "If you ever forget the LORD your God and go after other gods and worship them and bow down to them, I testify against you today that you will surely perish.",
      "links": "<a href='/AIV/3/26/14-33'>Lev. 26:14-33</a>; <a href='/AIV/5/30/17-18'>Deut. 30:17-18</a>",
      "comment": "Idolatry leads to destruction. Faithfulness to the sole worship of the true God is an enduring command and the basis for unity in God's people."
    },
    {
      "pk": 5008020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 8,
      "verse": 20,
      "text": "Like the nations that the LORD makes to perish before you, so you shall perish, because you would not obey the voice of the LORD your God.",
      "links": "<a href='/AIV/5/28/45-51'>Deut. 28:45-51</a>; <a href='/AIV/19/81/11-13'>Ps. 81:11-13</a>",
      "comment": "God's discipline demonstrates both justice and mercy. Obedience brings life and blessing, while disobedience leads to loss, emphasizing the need to listen and respond to God's revealed will."
    }
  ],
  "translatedAt": "2025-12-24T02:01:24.376Z"
}