{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 28,
  "verses": [
    {
      "pk": 5028001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 1,
      "text": "And if you fully obey the voice of the LORD your God, being careful to do all His commandments that I command you today, the LORD your God will set you high above all the nations of the earth.",
      "links": "<a href='/AIV/19/81/13-16'>Ps. 81:13-16</a>; <a href='/AIV/26/36/27-28'>Ezek. 36:27-28</a>",
      "comment": "The blessings depend on careful obedience, a theme repeated throughout Scripture. This verse prefigures the idea of a people set apart—note Paul speaks of the Church as a holy nation (1 Peter 2:9)."
    },
    {
      "pk": 5028002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 2,
      "text": "And all these blessings shall come upon you and overtake you, if you obey the voice of the LORD your God.",
      "links": "<a href='/AIV/19/23/5-6'>Ps. 23:5-6</a>",
      "comment": "God's blessings pursue those who heed His word. Compare with the promise in the Psalms that goodness and mercy will follow the faithful."
    },
    {
      "pk": 5028003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 3,
      "text": "Blessed shall you be in the city, and blessed shall you be in the field.",
      "links": "<a href='/AIV/19/127/1-2'>Ps. 127:1-2</a>",
      "comment": "The blessings cover every aspect of life, urban and rural, signaling the wholeness of God's providence."
    },
    {
      "pk": 5028004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 4,
      "text": "Blessed shall be the fruit of your womb, and the fruit of your ground, and the fruit of your cattle—the increase of your herds and the young of your flocks.",
      "links": "<a href='/AIV/01/49/25'>Gen. 49:25</a>; <a href='/AIV/19/128/3-4'>Ps. 128:3-4</a>",
      "comment": "Fruitfulness is a sign of God’s favor, reminiscent of the promises to Abraham and the continuing theme in the Psalms."
    },
    {
      "pk": 5028005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 5,
      "text": "Blessed shall be your basket and your kneading bowl.",
      "links": "<a href='/AIV/19/111/5'>Ps. 111:5</a>",
      "comment": "A promise of abundance in daily provision—an image that later finds profound spiritual meaning in the bread of life teachings of Jesus (John 6:35)."
    },
    {
      "pk": 5028006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 6,
      "text": "Blessed shall you be when you come in, and blessed shall you be when you go out.",
      "links": "<a href='/AIV/19/121/8'>Ps. 121:8</a>",
      "comment": "The Lord’s protection encompasses your whole life journey—compare with the psalm’s promise of God’s guard over coming and going."
    },
    {
      "pk": 5028007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 7,
      "text": "The LORD will cause your enemies who rise against you to be defeated before you. They shall come out against you one way and flee before you seven ways.",
      "links": "<a href='/AIV/06/23/10'>Josh. 23:10</a>",
      "comment": "Total victory through God’s intervention. The imagery of multiplied routes of fleeing indicates complete rout, and points to divine aid as central to Israel's defense."
    },
    {
      "pk": 5028008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 8,
      "text": "The LORD will command the blessing upon you in your barns and in all that you undertake. He will bless you in the land that the LORD your God is giving you.",
      "links": "<a href='/AIV/03/25/21'>Lev. 25:21</a>",
      "comment": "Blessing is not accidental but directly commanded by God, emphasizing His sovereignty and the connection to inheriting the land promised to the fathers."
    },
    {
      "pk": 5028009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 9,
      "text": "The LORD will establish you as a holy people to Himself, as He has sworn to you, if you keep the commandments of the LORD your God and walk in His ways.",
      "links": "<a href='/AIV/03/20/26'>Lev. 20:26</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "The call to be holy echoes throughout scripture. This is later picked up as a foundational identity for the Church, set apart for God's purposes."
    },
    {
      "pk": 5028010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 10,
      "text": "And all the peoples of the earth shall see that you are called by the name of the LORD, and they shall be afraid of you.",
      "links": "<a href='/AIV/19/67/2-3'>Ps. 67:2-3</a>",
      "comment": "Belonging to the Lord brings visible distinction; a theme pointing forward to the Church's witness before the nations."
    },
    {
      "pk": 5028011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 11,
      "text": "The LORD will make you overflow in prosperity, in the fruit of your womb, in the fruit of your livestock, and in the fruit of your ground, within the land that the LORD swore to your fathers to give to you.",
      "links": "<a href='/AIV/01/22/17'>Gen. 22:17</a>",
      "comment": "Fulfilling ancient promises to the patriarchs, this abundance is both material and a sign of covenant blessing; parallels to spiritual fruitfulness are significant (Gal. 5:22-23)."
    },
    {
      "pk": 5028012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 12,
      "text": "The LORD will open to you His good treasury, the heavens, to give rain to your land in its season and to bless all the work of your hands. You shall lend to many nations, but you shall not borrow.",
      "links": "<a href='/AIV/24/14/22'>Jer. 14:22</a>",
      "comment": "Divine provision includes both agricultural blessing and financial favor, with echoes of the idea of God as the source of every good gift (James 1:17)."
    },
    {
      "pk": 5028013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 13,
      "text": "The LORD will make you the head and not the tail, and you shall be only above and not beneath, if you obey the commandments of the LORD your God, which I command you today, and are careful to do them.",
      "links": "<a href='/AIV/19/18/43'>Ps. 18:43</a>",
      "comment": "Israel’s preeminence is dependent on obedience, an image later used for the authority and primacy of the Church in Christ."
    },
    {
      "pk": 5028014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 14,
      "text": "And you shall not turn aside from any of the words which I command you today, to the right hand or to the left, to go after other gods to serve them.",
      "links": "<a href='/AIV/06/1/7'>Josh. 1:7</a>",
      "comment": "Faithfulness requires steadfastness and avoidance of idolatry—a principle that holds both literal and spiritual resonance, carried into New Testament warnings against worldliness (1 John 5:21)."
    },
    {
      "pk": 5028015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 15,
      "text": "But if you will not obey the voice of the LORD your God, or be careful to do all His commandments and His statutes that I command you today, then all these curses shall come upon you and overtake you.",
      "links": "<a href='/AIV/03/26/14-39'>Lev. 26:14-39</a>",
      "comment": "A reversal of the promised blessings, showing sin’s grave consequences. Compare the parallel warnings in Leviticus, and consider the spiritual implications—alienation from God."
    },
    {
      "pk": 5028016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 16,
      "text": "Cursed shall you be in the city, and cursed shall you be in the field.",
      "links": "<a href='/AIV/03/26/16'>Lev. 26:16</a>",
      "comment": "The consequences of disobedience touch every aspect of life, contrasting the comprehensive blessing of obedience in verse 3."
    },
    {
      "pk": 5028017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 17,
      "text": "Cursed shall be your basket and your kneading bowl.",
      "links": "<a href='/AIV/03/26/26'>Lev. 26:26</a>",
      "comment": "Loss of basic provision under the curse, showing the dependency of daily bread on the favor of God—a concept echoed by Jesus in teaching us to pray for our daily bread (Matt. 6:11)."
    },
    {
      "pk": 5028018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 18,
      "text": "Cursed shall be the fruit of your womb, and the fruit of your ground, the increase of your herds and the young of your flock.",
      "links": "<a href='/AIV/01/4/12'>Gen. 4:12</a>",
      "comment": "Infertility and barrenness are signs of broken covenant. Spiritual fruitfulness is similarly tied to union with God (John 15:4-5)."
    },
    {
      "pk": 5028019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 19,
      "text": "Cursed shall you be when you come in, and cursed shall you be when you go out.",
      "links": "<a href='/AIV/19/121/7-8'>Ps. 121:7-8</a>",
      "comment": "The reversal of the blessing in verse 6—absence of God’s presence results in danger and adversity."
    },
    {
      "pk": 5028020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 20,
      "text": "The LORD will send upon you curses, confusion, and frustration in all that you undertake to do, until you are destroyed and perish quickly, because of the evil of your deeds, because you have forsaken Me.",
      "links": "<a href='/AIV/03/26/16'>Lev. 26:16</a>; <a href='/AIV/19/109/17'>Ps. 109:17</a>",
      "comment": "God’s personal involvement in judgment counters any notion of impersonal fate. Apostasy brings devastation, a theme addressed in the prophets (Ezek. 23:35)."
    },
    {
      "pk": 5028021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 21,
      "text": "The LORD will make the plague cling to you until He has consumed you off the land that you are entering to possess.",
      "links": "<a href='/AIV/03/26/25'>Lev. 26:25</a>",
      "comment": "Plague as covenant curse echoes the plagues against Egypt. Applies on both literal and spiritual levels, as separation from God renders people vulnerable."
    },
    {
      "pk": 5028022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 22,
      "text": "The LORD will strike you with wasting disease, with fever and inflammation, with scorching heat and drought, and with blight and mildew. They shall pursue you until you perish.",
      "links": "<a href='/AIV/03/26/16'>Lev. 26:16</a>",
      "comment": "Specific judgments indicating the completeness of curse—God’s sovereignty over nature points to the seriousness of departing from Him."
    },
    {
      "pk": 5028023,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 23,
      "text": "And your heavens over your head shall be bronze, and the earth under you shall be iron.",
      "links": "<a href='/AIV/03/26/19'>Lev. 26:19</a>",
      "comment": "The metaphor of heavens as bronze and earth as iron signifies complete lack of rain or fruit—the closing off of blessing."
    },
    {
      "pk": 5028024,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 24,
      "text": "The LORD will make the rain of your land powder and dust; from heaven it shall come down on you until you are destroyed.",
      "links": "<a href='/AIV/03/26/20'>Lev. 26:20</a>",
      "comment": "The curse is so severe that instead of rain, destructive dust falls—again reflecting the reversal of God’s provision seen in earlier verses."
    },
    {
      "pk": 5028025,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 25,
      "text": "The LORD will cause you to be defeated before your enemies. You shall go out against them one way and flee before them seven ways, and you shall become a horror to all the kingdoms of the earth.",
      "links": "<a href='/AIV/03/26/17'>Lev. 26:17</a>",
      "comment": "Total defeat, in contrast to victory promised to the obedient—underscores divine justice and the seriousness of covenant rupture."
    },
    {
      "pk": 5028026,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 26,
      "text": "And your dead bodies shall be food for all the birds of the air and for the beasts of the earth, and no one shall frighten them away.",
      "links": "<a href='/AIV/19/79/2'>Ps. 79:2</a>",
      "comment": "Shame and desecration in death, lacking burial—shows the horror of curse and is revisited in prophetic judgments (Jer. 7:33)."
    },
    {
      "pk": 5028027,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 27,
      "text": "The LORD will strike you with the boils of Egypt, and with tumors, scabs and itch, of which you cannot be healed.",
      "links": "<a href='/AIV/02/9/11'>Ex. 9:11</a>",
      "comment": "Diseases as judgment recall Egypt’s plagues—illustrating the symmetry between deliverance and curse in the covenant story."
    },
    {
      "pk": 5028028,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 28,
      "text": "The LORD will strike you with madness and blindness and confusion of heart.",
      "links": "<a href='/AIV/09/2/33'>1 Sam. 2:33</a>",
      "comment": "Judgment on mental and spiritual faculties. Not just physical hardship, but a confusion of the heart."
    },
    {
      "pk": 5028029,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 29,
      "text": "And you shall grope at noonday, as the blind grope in darkness, and you shall not prosper in your ways. You shall be only oppressed and robbed continually, with no one to save you.",
      "links": "<a href='/AIV/23/59/10'>Isa. 59:10</a>",
      "comment": "Blindness and continual oppression is the result of rejected light—a theme Jesus reverses by proclaiming Himself as the light of the world (John 8:12)."
    },
    {
      "pk": 5028030,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 30,
      "text": "You shall betroth a wife, but another man shall violate her. You shall build a house, but you shall not live in it. You shall plant a vineyard, but you shall not enjoy its fruit.",
      "links": "<a href='/AIV/03/26/16'>Lev. 26:16</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "Complete inversion of hope and labor—the futility is compared to the vanity theme in Ecclesiastes."
    },
    {
      "pk": 5028031,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 31,
      "text": "Your ox shall be slaughtered before your eyes, but you shall not eat of it. Your donkey shall be violently taken away from you and shall not be restored to you. Your sheep shall be given to your enemies, and no one shall rescue you.",
      "links": "<a href='/AIV/19/44/11'>Ps. 44:11</a>",
      "comment": "A loss of provision and protection, again a reversal of the promise in earlier verses."
    },
    {
      "pk": 5028032,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 32,
      "text": "Your sons and daughters shall be given to another people, and your eyes shall look on and fail with longing for them all day long, but you shall be powerless to do anything.",
      "links": "<a href='/AIV/25/1/5'>Lam. 1:5</a>",
      "comment": "Loss of children is the ultimate heartbreak, highlighting the devastating results of spiritual unfaithfulness."
    },
    {
      "pk": 5028033,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 33,
      "text": "A nation that you have not known shall eat up the fruit of your ground and all your labors. And you shall be only oppressed and crushed continually,",
      "links": "<a href='/AIV/19/44/11-12'>Ps. 44:11-12</a>",
      "comment": "The curse reaches every part of society—foreign nations take what belonged to Israel, much like later exile under Babylon."
    },
    {
      "pk": 5028034,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 34,
      "text": "so that you shall be driven mad by the sights your eyes see.",
      "links": "<a href='/AIV/25/3/14'>Lam. 3:14</a>",
      "comment": "Repeated psychological sorrow and torment, the ultimate consequence of turning from God."
    },
    {
      "pk": 5028035,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 35,
      "text": "The LORD will strike you on the knees and on the legs with grievous boils which cannot be healed, from the sole of your foot to the crown of your head.",
      "links": "<a href='/AIV/02/9/11'>Ex. 9:11</a>",
      "comment": "Physical suffering escalating to totality. Note the parallel to Job’s affliction—sometimes interpreted as perpetual exclusion from God’s table unless restored."
    },
    {
      "pk": 5028036,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 36,
      "text": "The LORD will bring you and your king whom you set over you to a nation that neither you nor your fathers have known, and there you shall serve other gods, wood and stone.",
      "links": "<a href='/AIV/12/24/12'>2 Kings 24:12</a>",
      "comment": "A prophecy of exile—fulfilled dramatically in the Babylonian Captivity, linking unfaithfulness with loss of community and leadership."
    },
    {
      "pk": 5028037,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 37,
      "text": "And you shall become a horror, a proverb, and a byword among all the peoples where the LORD will drive you.",
      "links": "<a href='/AIV/19/44/14'>Ps. 44:14</a>",
      "comment": "The loss of honor and legacy, becoming a cautionary tale to others. This echoes the need for true fidelity to God."
    },
    {
      "pk": 5028038,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 38,
      "text": "You shall carry much seed out to the field but gather little in, for the locust shall consume it.",
      "links": "<a href='/AIV/29/1/4'>Joel 1:4</a>",
      "comment": "Harvest lost to the locust—a sign of the futility of labor apart from God’s blessing."
    },
    {
      "pk": 5028039,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 39,
      "text": "You shall plant vineyards and dress them, but you shall neither drink of the wine nor gather the grapes, for the worm shall eat them.",
      "links": "<a href='/AIV/29/1/7'>Joel 1:7</a>",
      "comment": "Labor is stolen by pestilence, a repeated theme in the prophets as warning for unfaithfulness."
    },
    {
      "pk": 5028040,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 40,
      "text": "You shall have olive trees throughout all your territory, but you shall not anoint yourself with the oil, for your olives shall drop off.",
      "links": "<a href='/AIV/29/1/10'>Joel 1:10</a>",
      "comment": "Oil—used in sacred rituals and for healing—is denied, reinforcing both material and spiritual deprivation outside God’s blessing."
    },
    {
      "pk": 5028041,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 41,
      "text": "You shall father sons and daughters, but they shall not be yours, for they shall go into captivity.",
      "links": "<a href='/AIV/25/1/5'>Lam. 1:5</a>",
      "comment": "A reversal of blessing—children lost to captivity, showing the collective consequence of infidelity."
    },
    {
      "pk": 5028042,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 42,
      "text": "All your trees and the fruit of your ground the locust shall consume.",
      "links": "<a href='/AIV/29/1/4'>Joel 1:4</a>",
      "comment": "Even creation turns against man who abandons God, a motif echoed in Romans 8, where Paul describes the world awaiting redemption through Christ."
    },
    {
      "pk": 5028043,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 43,
      "text": "The sojourner who is among you shall rise higher and higher above you; you shall come down lower and lower.",
      "links": "<a href='/AIV/19/113/7-8'>Ps. 113:7-8</a>",
      "comment": "Social reversal and humiliation—a reminder of justice and mercy in the law, later expanded in Jesus’ teaching on humility."
    },
    {
      "pk": 5028044,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 44,
      "text": "He shall lend to you, and you shall not lend to him. He shall be the head, and you shall be the tail.",
      "links": "<a href='/AIV/28/4/6'>Hos. 4:6</a>",
      "comment": "Echoes the reversal of the promise in verse 13. Failing to walk in God’s ways leads to loss of leadership and authority."
    },
    {
      "pk": 5028045,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 45,
      "text": "All these curses shall come upon you and pursue you and overtake you until you are destroyed, because you did not obey the voice of the LORD your God or keep the commandments and statutes that He commanded you.",
      "links": "<a href='/AIV/03/26/14-39'>Lev. 26:14-39</a>",
      "comment": "Repeated emphasis on judgment for disobedience. Compare with Paul’s warnings against apostasy in Hebrews (Heb. 10:26-31)."
    },
    {
      "pk": 5028046,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 46,
      "text": "They shall be a sign and a wonder against you and your descendants forever.",
      "links": "<a href='/AIV/19/78/41-43'>Ps. 78:41-43</a>",
      "comment": "The curses serve as lasting lessons—a warning for all generations. Their fulfillment through exile is a historical sign pointing towards the need for a Redeemer."
    },
    {
      "pk": 5028047,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 47,
      "text": "Because you did not serve the LORD your God with joyfulness and gladness of heart, out of the abundance of all things,",
      "links": "<a href='/AIV/19/100/2'>Ps. 100:2</a>",
      "comment": "Service to God must be joyful and not just dutiful; worship in spirit and truth is central in the New Testament (John 4:24)."
    },
    {
      "pk": 5028048,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 48,
      "text": "you shall serve your enemies whom the LORD will send against you, in hunger, in thirst, in nakedness, and in lacking everything. And He will put a yoke of iron on your neck until He has destroyed you.",
      "links": "<a href='/AIV/25/5/5'>Lam. 5:5</a>",
      "comment": "The yoke of iron is a symbol of harsh servitude, later shown literally in Babylonian exile; it speaks spiritually to being slaves to sin apart from Christ."
    },
    {
      "pk": 5028049,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 49,
      "text": "The LORD will bring a nation against you from far away, from the end of the earth, swift as the eagle flies, a nation whose language you do not understand,",
      "links": "<a href='/AIV/23/5/26-28'>Isa. 5:26-28</a>",
      "comment": "Foretelling foreign conquest—most ultimately realized in the Assyrian and Babylonian invasions, emphasizing the consequences of covenant unfaithfulness."
    },
    {
      "pk": 5028050,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 50,
      "text": "a hard-faced nation who shall show no regard for the old or favor to the young.",
      "links": "<a href='/AIV/25/5/12'>Lam. 5:12</a>",
      "comment": "Merciless enemies are agents of God’s judgment; the divine justice here is exacting, yet always directed to bring about repentance."
    },
    {
      "pk": 5028051,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 51,
      "text": "They shall eat the offspring of your livestock and the fruit of your ground, until you are destroyed. They also shall not leave you grain, wine, or oil, the increase of your cattle or the young of your flock, until they have caused you to perish.",
      "links": "<a href='/AIV/25/1/6'>Lam. 1:6</a>",
      "comment": "Complete loss of provision. This points towards the need for deliverance and restoration, foreshadowed in messianic prophecies."
    },
    {
      "pk": 5028052,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 52,
      "text": "They shall besiege you in all your towns, until your high and fortified walls in which you trusted come down throughout all your land. And they shall besiege you in all your towns throughout all your land, which the LORD your God has given you.",
      "links": "<a href='/AIV/25/4/12'>Lam. 4:12</a>",
      "comment": "Even the strongest defenses fall without God’s favor—a theme echoed in the fall of Jerusalem and later destruction of the Temple in 70 AD."
    },
    {
      "pk": 5028053,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 53,
      "text": "And you shall eat the fruit of your own womb, the flesh of your sons and daughters whom the LORD your God has given you, in the siege and distress with which your enemies shall oppress you.",
      "links": "<a href='/AIV/25/4/10'>Lam. 4:10</a>",
      "comment": "The horror of siege reaches its deepest point—a judgment so severe it is described being fulfilled during the fall of Jerusalem."
    },
    {
      "pk": 5028054,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 54,
      "text": "The most tender and refined man among you will begrudge food to his brother, to the wife he loves, and to the last of his children whom he has left,",
      "links": "<a href='/AIV/25/4/3-4'>Lam. 4:3-4</a>",
      "comment": "Judgment deteriorates social ties, undermining love and communal bonds—a direct inversion of God’s command to love neighbor."
    },
    {
      "pk": 5028055,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 55,
      "text": "so that he will not give to any of them any of the flesh of his children whom he is eating, because he has nothing else left to him in the siege and in the distress which your enemy shall inflict on you in all your towns.",
      "links": "<a href='/AIV/25/4/10'>Lam. 4:10</a>",
      "comment": "Compassion gives way to selfishness in extreme crisis, picturing the full extent of curse against unfaithfulness."
    },
    {
      "pk": 5028056,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 56,
      "text": "The most tender and refined woman among you, who would not venture to set the sole of her foot on the ground because of her delicacy and gentleness, will begrudge to the husband she loves, to her son and to her daughter,",
      "links": "<a href='/AIV/25/4/10'>Lam. 4:10</a>",
      "comment": "Even the most delicate become hardened in judgment—a sign of complete societal breakdown."
    },
    {
      "pk": 5028057,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 57,
      "text": "her afterbirth that comes out from between her feet and her children whom she bears; for she will eat them secretly for lack of anything else, in the siege and in the distress with which your enemy shall oppress you in your towns.",
      "links": "<a href='/AIV/25/4/10'>Lam. 4:10</a>",
      "comment": "Total breakdown of family compassion under curse—a reversal of the nurture normally expected."
    },
    {
      "pk": 5028058,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 58,
      "text": "If you are not careful to obey all the words of this law that are written in this book, to fear this glorious and awesome Name, the LORD your God,",
      "links": "<a href='/AIV/19/99/3'>Ps. 99:3</a>",
      "comment": "The fear of the Lord is foundational—a key theme, later summarized in Proverbs as the beginning of wisdom."
    },
    {
      "pk": 5028059,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 59,
      "text": "then the LORD will bring upon you and your descendants extraordinary plagues, severe and lasting, and sicknesses grievous and enduring.",
      "links": "<a href='/AIV/03/26/16'>Lev. 26:16</a>",
      "comment": "Disobedience results in enduring judgments—not only physical but generational, foreshadowing the need for generational restoration through Christ."
    },
    {
      "pk": 5028060,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 60,
      "text": "He will bring upon you again all the diseases of Egypt, of which you were afraid, and they shall cling to you.",
      "links": "<a href='/AIV/02/9/11'>Ex. 9:11</a>",
      "comment": "Disease as judgment—undoing the deliverance from Egypt, showing the seriousness of loss of covenant protection."
    },
    {
      "pk": 5028061,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 61,
      "text": "Also every sickness and every plague, which is not written in the book of this law, the LORD will bring upon you until you are destroyed.",
      "links": "<a href='/AIV/19/91/6'>Ps. 91:6</a>",
      "comment": "Judgment could be even worse than what is spelled out—showing God’s power and absolute justice."
    },
    {
      "pk": 5028062,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 62,
      "text": "You shall be left few in number, whereas you were as the stars of heaven for multitude, because you did not obey the voice of the LORD your God.",
      "links": "<a href='/AIV/01/22/17'>Gen. 22:17</a>",
      "comment": "The reversal of the Abrahamic blessing—a loss of standing and fruitfulness. This points to the necessity of restoration in God’s plan."
    },
    {
      "pk": 5028063,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 63,
      "text": "And as the LORD took delight in doing you good and multiplying you, so the LORD will take delight in bringing ruin upon you and destroying you. And you shall be plucked off the land that you are entering to possess.",
      "links": "<a href='/AIV/19/37/38'>Ps. 37:38</a>",
      "comment": "God is not aloof; even His judgments are purposeful and involve His will. Judgment teaches the seriousness of rebellion and prepares for redemption."
    },
    {
      "pk": 5028064,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 64,
      "text": "And the LORD will scatter you among all peoples, from one end of the earth to the other, and there you shall serve other gods of wood and stone, which neither you nor your fathers have known.",
      "links": "<a href='/AIV/26/22/15'>Ezek. 22:15</a>",
      "comment": "The scattering of Israel points to both historical exile and spiritual exile. Restoration, as prophesied later, comes only through the promised Messiah."
    },
    {
      "pk": 5028065,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 65,
      "text": "And among those nations you shall find no rest, and there shall be no resting place for the sole of your foot. But the LORD will give you there a trembling heart, failing eyes, and a languishing soul.",
      "links": "<a href='/AIV/25/1/3'>Lam. 1:3</a>",
      "comment": "Exile brings unending restlessness—spiritually, these effects parallel the experience of separation from God’s family and sacramental life."
    },
    {
      "pk": 5028066,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 66,
      "text": "Your life shall hang in doubt before you. Night and day you shall be in dread, and you shall have no assurance of your life.",
      "links": "<a href='/AIV/25/3/54-55'>Lam. 3:54-55</a>",
      "comment": "Oppression and existential doubt. True assurance is found only in the fullness of faith, culminating in the promises of Christ."
    },
    {
      "pk": 5028067,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 67,
      "text": "In the morning you shall say, ‘If only it were evening!’ and at evening you shall say, ‘If only it were morning!’ because of the dread that your heart shall feel, and because of the sights your eyes shall see.",
      "links": "<a href='/AIV/25/3/14'>Lam. 3:14</a>",
      "comment": "Restlessness and anxiety dominate a life under judgment; such longing for relief is answered only in God’s ultimate restoration."
    },
    {
      "pk": 5028068,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 28,
      "verse": 68,
      "text": "And the LORD will bring you back in ships to Egypt, by a journey that I promised you would never make again. There you shall offer yourselves for sale to your enemies as male and female slaves, but there will be no buyer.",
      "links": "<a href='/AIV/01/15/13'>Gen. 15:13</a>",
      "comment": "This is the ultimate reversal—returning to slavery in Egypt, prophesying utter loss. It points toward the longing for freedom and restoration, promised fully only in Christ and the fullness of life in the united body of the faithful."
    }
  ],
  "translatedAt": "2025-12-24T02:12:41.212Z"
}