{
  "book": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 23,
  "verses": [
    {
      "pk": 13423001,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 1,
      "text": "No man whose testicles are crushed or whose male organ is cut off may enter the assembly of the Lord.",
      "links": "<a href='/ESV/23/56/3'>Isa. 56:3</a>",
      "comment": "Refers to ritual purity and participation in worship. The term 'assembly of the Lord' refers to spiritual participation in Israel's community."
    },
    {
      "pk": 13423002,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 2,
      "text": "No one born of a forbidden union may enter the assembly of the Lord. Even to the tenth generation, none of his descendants may enter the assembly of the Lord.",
      "links": "<a href='/ESV/16/13/1'>Neh. 13:1</a>",
      "comment": "The 'forbidden union' includes illegitimate birth and unions God forbade for Israel. 'Tenth generation' means a complete exclusion."
    },
    {
      "pk": 13423003,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 3,
      "text": "No Ammonite or Moabite may enter the assembly of the Lord. Not even to the tenth generation may any of them enter the assembly of the Lord forever.",
      "links": "<a href='/ESV/16/13/1'>Neh. 13:1</a>",
      "comment": "Ammonite and Moabite exclusion was due to their actions against Israel (see v.4). 'Forever' stresses the severe limit."
    },
    {
      "pk": 13423004,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 4,
      "text": "Because they did not meet you with bread and water on the way when you came out of Egypt, and because they hired Balaam the son of Beor from Pethor in Aram-naharaim to curse you.",
      "links": "<a href='/ESV/4/22/5'>Num. 22:5</a>; <a href='/ESV/4/22/7'>Num. 22:7</a>",
      "comment": "Explains the reason for exclusion: lack of hospitality and attempt to curse Israel (Numbers 22ff)."
    },
    {
      "pk": 13423005,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 5,
      "text": "But the Lord your God did not listen to Balaam. Instead, the Lord your God turned the curse into a blessing for you, because the Lord your God loved you.",
      "links": "<a href='/ESV/4/23/5-8'>Num. 23:5-8</a>",
      "comment": "Describes God's faithfulness protecting Israel from Balaam's curse."
    },
    {
      "pk": 13423006,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 6,
      "text": "You shall not seek their peace or their prosperity all your days forever.",
      "links": "<a href='/ESV/19/137/7'>Ps. 137:7</a>",
      "comment": "'Peace' and 'prosperity' mean Israel is not to seek their welfare or alliance."
    },
    {
      "pk": 13423007,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 7,
      "text": "You shall not abhor an Edomite, for he is your brother. You shall not abhor an Egyptian, because you were a sojourner in his land.",
      "links": "<a href='/ESV/2/22/21'>Ex. 22:21</a>; <a href='/ESV/1/25/25'>Gen. 25:25</a>",
      "comment": "The Edomites are considered kin (descendants of Esau). Egyptians are not to be hated because of their past hospitality."
    },
    {
      "pk": 13423008,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 8,
      "text": "Children born to them in the third generation may enter the assembly of the Lord.",
      "links": "<a href='/ESV/4/20/14'>Num. 20:14</a>",
      "comment": "Contrasts Ammonite and Moabite exclusion; Edomite and Egyptian descendants after three generations may join Israel."
    },
    {
      "pk": 13423009,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 9,
      "text": "When you go out to camp against your enemies, then keep yourself from every evil thing.",
      "links": "<a href='/ESV/3/11/44'>Lev. 11:44</a>",
      "comment": "Military camps must be ritually and morally pure."
    },
    {
      "pk": 13423010,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 10,
      "text": "If any man among you becomes unclean because of a nocturnal emission, then he shall go outside the camp. He shall not come inside the camp.",
      "links": "<a href='/ESV/3/15/16'>Lev. 15:16</a>",
      "comment": "'Nocturnal emission' means an emission of semen. Ritual purity required exclusion until cleansing."
    },
    {
      "pk": 13423011,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 11,
      "text": "But when evening comes, he shall bathe himself in water, and after the sun sets, he may come into the camp.",
      "links": "<a href='/ESV/3/15/16-18'>Lev. 15:16-18</a>",
      "comment": "Restores purity after bathing and waiting until evening."
    },
    {
      "pk": 13423012,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 12,
      "text": "You shall have a place outside the camp, and you shall go out to it.",
      "links": "<a href='/ESV/4/5/3'>Num. 5:3</a>",
      "comment": "Refers to sanitation: a place for relieving oneself outside the camp."
    },
    {
      "pk": 13423013,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 13,
      "text": "And you shall have a trowel among your tools, and when you relieve yourself outside, you shall dig with it and turn back and cover your excrement.",
      "links": "<a href='/ESV/4/5/3'>Num. 5:3</a>",
      "comment": "God commands cleanliness and respect for the camp's holiness."
    },
    {
      "pk": 13423014,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 14,
      "text": "Because the Lord your God walks in the midst of your camp, to deliver you and give your enemies over to you; therefore your camp must be holy, so that he may not see anything indecent among you and turn away from you.",
      "links": "<a href='/ESV/3/26/12'>Lev. 26:12</a>",
      "comment": "God's presence demands purity and order in Israel’s camp."
    },
    {
      "pk": 13423015,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 15,
      "text": "You shall not hand over to his master a slave who has escaped from his master to you.",
      "links": "<a href='/ESV/2/23/9'>Ex. 23:9</a>",
      "comment": "This refers to runaway slaves seeking asylum, possibly foreign or oppressed."
    },
    {
      "pk": 13423016,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 16,
      "text": "He shall live with you, in your midst, in the place that he chooses within one of your towns, wherever it suits him. You shall not oppress him.",
      "links": "<a href='/ESV/2/23/9'>Ex. 23:9</a>",
      "comment": "Israel was to treat such a person humanely, unlike other nations."
    },
    {
      "pk": 13423017,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 17,
      "text": "There shall be no cult prostitute of the daughters of Israel, nor shall there be a cult prostitute of the sons of Israel.",
      "links": "<a href='/ESV/3/19/29'>Lev. 19:29</a>; <a href='/ESV/11/14/24'>1 Kings 14:24</a>",
      "comment": "'Cult prostitute' refers to ritual prostitution practiced in pagan worship."
    },
    {
      "pk": 13423018,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 18,
      "text": "You shall not bring the fee of a prostitute or the wages of a male prostitute into the house of the Lord your God for any vow, for both of these are detestable to the Lord your God.",
      "links": "<a href='/ESV/3/19/29'>Lev. 19:29</a>",
      "comment": "Temple worship to remain pure; such wages are not acceptable offerings."
    },
    {
      "pk": 13423019,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 19,
      "text": "You shall not charge interest to your brother, interest on money, food, or anything that may be lent for interest.",
      "links": "<a href='/ESV/2/22/25'>Ex. 22:25</a>; <a href='/ESV/3/25/35-37'>Lev. 25:35-37</a>",
      "comment": "'Brother' refers to fellow Israelites; loans to kin must be interest free."
    },
    {
      "pk": 13423020,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 20,
      "text": "You may charge a foreigner interest, but you may not charge your brother interest, so that the Lord your God may bless you in all that you undertake in the land that you are entering to possess.",
      "links": "<a href='/ESV/2/22/25'>Ex. 22:25</a>",
      "comment": "Foreigners (non-Israelites) could be charged interest, but not countrymen."
    },
    {
      "pk": 13423021,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 21,
      "text": "If you make a vow to the Lord your God, you shall not delay in fulfilling it, for the Lord your God will surely require it of you, and it would be sin in you.",
      "links": "<a href='/ESV/4/30/2'>Num. 30:2</a>; <a href='/ESV/21/5/4'>Eccl. 5:4</a>",
      "comment": "Vows to God are to be fulfilled promptly; delayed fulfillment is considered sinful."
    },
    {
      "pk": 13423022,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 22,
      "text": "But if you refrain from making a vow, you will not have sin.",
      "links": "<a href='/ESV/21/5/5'>Eccl. 5:5</a>",
      "comment": "Vows are voluntary; not vowing is not sin."
    },
    {
      "pk": 13423023,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 23,
      "text": "You shall be careful to do what has passed your lips, for you have voluntarily vowed to the Lord your God what you have promised with your mouth.",
      "links": "<a href='/ESV/4/30/2'>Num. 30:2</a>",
      "comment": "Faithfulness in fulfilling spoken vows is required."
    },
    {
      "pk": 13423024,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 24,
      "text": "If you go into your neighbor's vineyard, you may eat your fill of grapes, as many as you wish, but you shall not put any in your basket.",
      "links": "<a href='/ESV/3/19/9-10'>Lev. 19:9-10</a>",
      "comment": "Allows picking/eating by hand while traveling, but not harvesting meant for oneself."
    },
    {
      "pk": 13423025,
      "translation": "AIV",
      "book": 5,
      "chapter": 23,
      "verse": 25,
      "text": "If you go into your neighbor’s standing grain, you may pluck the ears with your hand, but you shall not use a sickle on your neighbor’s standing grain.",
      "links": "<a href='/ESV/3/19/9-10'>Lev. 19:9-10</a>; <a href='/ESV/40/12/1'>Matt. 12:1</a>",
      "comment": "Hand-picked grain for immediate use is allowed, but not harvesting with tools."
    }
  ],
  "translatedAt": "2025-12-20T09:59:30.715Z"
}