{
  "book": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 28,
  "verses": [
    {
      "pk": 1962801,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 1,
      "text": "If you fully obey the LORD your God and carefully follow all his commandments that I am giving you today, the LORD your God will set you high above all the nations of the earth.",
      "links": "<a href='/AIV/5/26/19'>Deut. 26:19</a>; <a href='/AIV/5/7/12'>Deut. 7:12</a>",
      "comment": "The phrase 'set you high above' refers to Israel's exalted status among nations if obedient."
    },
    {
      "pk": 1962802,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 2,
      "text": "All these blessings will come upon you and overtake you if you obey the voice of the LORD your God:",
      "links": "",
      "comment": "'Overtake you' maintains the sense in Hebrew that the blessings will pursue and catch the obedient."
    },
    {
      "pk": 1962803,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 3,
      "text": "Blessed will you be in the city, and blessed will you be in the field.",
      "links": "",
      "comment": "Faithful to the Hebrew parallel blessings."
    },
    {
      "pk": 1962804,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 4,
      "text": "Blessed will be the fruit of your womb, the produce of your ground, and the young of your livestock—the calves of your herds and the lambs of your flocks.",
      "links": "<a href='/AIV/5/7/13'>Deut. 7:13</a>",
      "comment": "'The fruit of your womb' equals children or descendants; agricultural and livestock prosperity are literal."
    },
    {
      "pk": 1962805,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 5,
      "text": "Blessed will be your basket and your kneading bowl.",
      "links": "",
      "comment": "Literal translation of food containers; references to daily provision."
    },
    {
      "pk": 1962806,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 6,
      "text": "Blessed will you be when you come in, and blessed will you be when you go out.",
      "links": "",
      "comment": "Hebraism meaning in every activity and situation."
    },
    {
      "pk": 1962807,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 7,
      "text": "The LORD will cause your enemies who rise against you to be defeated before you. They will come against you from one direction but flee before you in seven.",
      "links": "<a href='/AIV/3/26/8'>Lev. 26:8</a>",
      "comment": "The phrase 'flee before you in seven directions' is maintained literally."
    },
    {
      "pk": 1962808,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 8,
      "text": "The LORD will command the blessing on you in your barns and in all that you undertake. He will bless you in the land that the LORD your God is giving you.",
      "links": "",
      "comment": "'Command the blessing' is kept literal."
    },
    {
      "pk": 1962809,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 9,
      "text": "The LORD will establish you as his holy people, as he swore to you, if you keep the commandments of the LORD your God and walk in his ways.",
      "links": "<a href='/AIV/2/19/5-6'>Ex. 19:5-6</a>",
      "comment": "'Establish you as his holy people' echoes promises in Exodus."
    },
    {
      "pk": 1962810,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 10,
      "text": "Then all the peoples of the earth will see that you are called by the name of the LORD, and they will be afraid of you.",
      "links": "",
      "comment": "Literal rendering of being 'called by the name of the LORD.'"
    },
    {
      "pk": 1962811,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 11,
      "text": "The LORD will make you abound in prosperity—in the fruit of your womb, the offspring of your livestock, and the produce of your ground—in the land that the LORD swore to your fathers to give you.",
      "links": "<a href='/AIV/1/15/5'>Gen. 15:5</a>",
      "comment": "Phrase mirrors Genesis promises to patriarchs."
    },
    {
      "pk": 1962812,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 12,
      "text": "The LORD will open to you his good treasury, the heavens, to give rain to your land in its season and to bless all the work of your hands. You will lend to many nations, but you will not borrow.",
      "links": "<a href='/AIV/5/15/6'>Deut. 15:6</a>",
      "comment": "The phrase 'his good treasury, the heavens' refers to rain as blessing."
    },
    {
      "pk": 1962813,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 13,
      "text": "The LORD will make you the head and not the tail; you will only move upward and never downward, if you listen to the commandments of the LORD your God that I am commanding you today, being careful to do them.",
      "links": "",
      "comment": "The 'head and not the tail' is a Hebrew idiom meaning superiority."
    },
    {
      "pk": 1962814,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 14,
      "text": "Do not turn aside from any of the words that I am commanding you today, to the right or to the left, to follow other gods to serve them.",
      "links": "<a href='/AIV/5/5/32'>Deut. 5:32</a>",
      "comment": "'To the right or to the left' is a Hebrew idiom for straying."
    },
    {
      "pk": 1962815,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 15,
      "text": "But if you will not obey the voice of the LORD your God, and do not carefully follow all his commandments and statutes that I am commanding you today, then all these curses will come upon you and overtake you:",
      "links": "<a href='/AIV/5/27/15-26'>Deut. 27:15–26</a>",
      "comment": "Transition to curses matched to the original structure."
    },
    {
      "pk": 1962816,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 16,
      "text": "Cursed will you be in the city, and cursed will you be in the field.",
      "links": "",
      "comment": "Direct inversion of v.3 blessing."
    },
    {
      "pk": 1962817,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 17,
      "text": "Cursed will be your basket and your kneading bowl.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1962818,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 18,
      "text": "Cursed will be the fruit of your womb, the produce of your land, the calves of your herds, and the lambs of your flocks.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1962819,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 19,
      "text": "Cursed will you be when you come in, and cursed will you be when you go out.",
      "links": "",
      "comment": "Mirror of blessing statement from v.6."
    },
    {
      "pk": 1962820,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 20,
      "text": "The LORD will send upon you curses, confusion, and frustration in all that you put your hand to do, until you are destroyed and quickly perish on account of the evil of your deeds by which you have forsaken me.",
      "links": "",
      "comment": "'Confusion and frustration' translate Hebrew words for chaos/disorder."
    },
    {
      "pk": 1962821,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 21,
      "text": "The LORD will make the plague cling to you until he has consumed you from off the land that you are entering to possess.",
      "links": "<a href='/AIV/3/26/25'>Lev. 26:25</a>",
      "comment": "The term 'plague' (Hebrew: deber) can mean pestilence."
    },
    {
      "pk": 1962822,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 22,
      "text": "The LORD will strike you with wasting disease, with fever, inflammation, burning heat, drought, blight, and mildew. These will pursue you until you perish.",
      "links": "",
      "comment": "'Wasting disease' is literal translation of Hebrew 'shachefet.'"
    },
    {
      "pk": 1962823,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 23,
      "text": "The sky over your head will be bronze, and the earth beneath you will be iron.",
      "links": "",
      "comment": "This is figurative for severe drought and barrenness."
    },
    {
      "pk": 1962824,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 24,
      "text": "The LORD will turn the rain of your land into powder and dust; it will come down on you until you are destroyed.",
      "links": "",
      "comment": "Literal translation of Hebrew imagery."
    },
    {
      "pk": 1962825,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 25,
      "text": "The LORD will cause you to be defeated before your enemies. You will go out against them in one direction but flee before them in seven directions; you will become a horror to all the kingdoms of the earth.",
      "links": "<a href='/AIV/5/28/7'>Deut. 28:7</a>",
      "comment": "Direct reversal of earlier military blessing."
    },
    {
      "pk": 1962826,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 26,
      "text": "Your dead bodies will be food for all the birds of the sky and the beasts of the earth, and there will be no one to frighten them away.",
      "links": "",
      "comment": "'Dead bodies' literally 'carcasses' in Hebrew."
    },
    {
      "pk": 1962827,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 27,
      "text": "The LORD will strike you with the boils of Egypt, with tumors, scabs, and itch, of which you cannot be healed.",
      "links": "<a href='/AIV/2/9/9'>Ex. 9:9</a>",
      "comment": "'Boils of Egypt' refers to plagues in Exodus."
    },
    {
      "pk": 1962828,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 28,
      "text": "The LORD will strike you with madness, blindness, and confusion of mind.",
      "links": "",
      "comment": "Literal translation of mental afflictions."
    },
    {
      "pk": 1962829,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 29,
      "text": "And you will grope at noonday as a blind man gropes in darkness, and you shall not prosper in your ways. You will be only oppressed and robbed continually, and there will be no one to save you.",
      "links": "",
      "comment": "Literal language maintained."
    },
    {
      "pk": 1962830,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 30,
      "text": "You will betroth a wife, but another man will violate her; you will build a house, but you will not live in it; you will plant a vineyard, but you will not enjoy its fruit.",
      "links": "<a href='/AIV/3/26/16'>Lev. 26:16</a>",
      "comment": "'Violate her' is a strong literal rendering of the Hebrew verb."
    },
    {
      "pk": 1962831,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 31,
      "text": "Your ox will be slaughtered before your eyes, but you will not eat of it; your donkey will be violently taken from you and will not be returned; your sheep will be given to your enemies, and you will have no one to help you.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1962832,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 32,
      "text": "Your sons and your daughters will be given to another people, while your eyes look on and fail with longing for them all day long; but you will not have the power to do anything.",
      "links": "",
      "comment": "'Given to another people' refers to exile/slavery."
    },
    {
      "pk": 1962833,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 33,
      "text": "A people whom you do not know will eat the fruit of your land and all your labors. You will only be oppressed and crushed continually,",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1962834,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 34,
      "text": "so that you are driven mad by what your eyes see.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1962835,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 35,
      "text": "The LORD will strike you on the knees and on the legs with grievous boils from which you cannot be healed, from the sole of your foot to the top of your head.",
      "links": "<a href='/AIV/18/2/7'>Job 2:7</a>",
      "comment": "Corresponds with Job's affliction in Job 2."
    },
    {
      "pk": 1962836,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 36,
      "text": "The LORD will bring you and your king whom you set over you to a nation that neither you nor your fathers have known. There you shall serve other gods, wood and stone.",
      "links": "<a href='/AIV/5/4/28'>Deut. 4:28</a>; <a href='/AIV/12/17/6'>2 Kgs. 17:6</a>",
      "comment": "'King whom you set over you' anticipates Israel's monarchy."
    },
    {
      "pk": 1962837,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 37,
      "text": "And you will become a horror, a proverb, and a byword among all the peoples where the LORD will drive you.",
      "links": "<a href='/AIV/11/9/7'>1 Kgs. 9:7</a>",
      "comment": "'Byword' means an object of mocking."
    },
    {
      "pk": 1962838,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 38,
      "text": "You will carry much seed to the field, but gather in little, for the locust will consume it.",
      "links": "<a href='/AIV/29/1/4'>Joel 1:4</a>",
      "comment": "Literal description of agricultural devastation."
    },
    {
      "pk": 1962839,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 39,
      "text": "You will plant vineyards and dress them, but you will not drink the wine or gather the grapes, for the worm will eat them.",
      "links": "",
      "comment": "'The worm' is a literal translation."
    },
    {
      "pk": 1962840,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 40,
      "text": "You will have olive trees throughout all your territory, but you will not anoint yourself with oil, for your olives will drop off.",
      "links": "",
      "comment": "'Drop off' literally means fail to mature."
    },
    {
      "pk": 1962841,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 41,
      "text": "You will father sons and daughters, but they will not be yours, for they will go into captivity.",
      "links": "",
      "comment": "Refers to children being taken captive by foreigners."
    },
    {
      "pk": 1962842,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 42,
      "text": "All your trees and the fruit of your land the locust will consume.",
      "links": "<a href='/AIV/29/1/4'>Joel 1:4</a>",
      "comment": ""
    },
    {
      "pk": 1962843,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 43,
      "text": "The sojourner who is among you will rise higher and higher above you, and you will sink lower and lower.",
      "links": "<a href='/AIV/3/25/35'>Lev. 25:35</a>",
      "comment": "'Sojourner' is kept word-for-word; refers to a resident foreigner."
    },
    {
      "pk": 1962844,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 44,
      "text": "He will lend to you, but you will not lend to him. He will be the head and you will be the tail.",
      "links": "<a href='/AIV/5/28/13'>Deut. 28:13</a>",
      "comment": "Direct inversion of v.13 promise."
    },
    {
      "pk": 1962845,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 45,
      "text": "All these curses will come upon you, pursue you, and overtake you until you are destroyed, because you did not obey the voice of the LORD your God by keeping his commandments and his statutes that he commanded you.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1962846,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 46,
      "text": "They will be a sign and a wonder against you and your descendants forever.",
      "links": "",
      "comment": "'Sign and a wonder' means a visible object lesson."
    },
    {
      "pk": 1962847,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 47,
      "text": "Because you did not serve the LORD your God with joyfulness and gladness of heart, when you had an abundance of all things,",
      "links": "",
      "comment": "'With joyfulness and gladness of heart' is literal."
    },
    {
      "pk": 1962848,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 48,
      "text": "therefore you will serve your enemies whom the LORD will send against you, in hunger, thirst, nakedness, and lacking everything. He will put an iron yoke on your neck until he has destroyed you.",
      "links": "<a href='/AIV/24/28/13'>Jer. 28:13</a>",
      "comment": "'Iron yoke' is an idiom for harsh slavery."
    },
    {
      "pk": 1962849,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 49,
      "text": "The LORD will bring a nation against you from far away, from the end of the earth, swift as the eagle flies, a nation whose language you do not understand,",
      "links": "<a href='/AIV/24/5/15-16'>Jer. 5:15-16</a>",
      "comment": "All imagery is literal, with likely reference to later Assyrian/Babylonian invaders."
    },
    {
      "pk": 1962850,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 50,
      "text": "a hard-faced nation who will not show regard for the old or pity for the young.",
      "links": "",
      "comment": "Literal 'hard-faced nation.'"
    },
    {
      "pk": 1962851,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 51,
      "text": "They will eat the offspring of your livestock and the produce of your land until you are destroyed. They will leave you no grain, wine, or oil, nor the calves of your herds or the lambs of your flocks, until they have caused you to perish.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1962852,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 52,
      "text": "They will besiege you in all your towns until your high and fortified walls, in which you trusted throughout your land, come down. They will besiege you in all your towns throughout all your land, which the LORD your God has given you.",
      "links": "<a href='/AIV/12/25/1-4'>2 Kgs. 25:1–4</a>",
      "comment": ""
    },
    {
      "pk": 1962853,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 53,
      "text": "You will eat the fruit of your own womb, the flesh of your sons and daughters whom the LORD your God has given you, in the siege and distress with which your enemies will distress you.",
      "links": "<a href='/AIV/25/2/20'>Lam. 2:20</a>",
      "comment": "Cannibalism during siege is literal, as in later OT accounts."
    },
    {
      "pk": 1962854,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 54,
      "text": "The man among you who is most tender and sensitive, his eye will be evil toward his brother, toward the wife of his embrace, and toward the rest of his children whom he has left,",
      "links": "",
      "comment": "'His eye will be evil' means hostile/greedy toward even his family."
    },
    {
      "pk": 1962855,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 55,
      "text": "so that he will not give to any of them any of the flesh of his children that he is eating, because he has nothing left to him in the siege and distress with which your enemy will distress you in all your towns.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1962856,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 56,
      "text": "The most tender and delicate woman among you, who would not venture to set the sole of her foot on the ground out of delicacy and tenderness, will be hostile toward her husband, toward her son, and toward her daughter,",
      "links": "",
      "comment": "Literal: 'who would not venture...'—emphasizing extreme delicacy."
    },
    {
      "pk": 1962857,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 57,
      "text": "toward her afterbirth that comes out from between her feet and toward her children whom she bears, for she will eat them secretly for lack of anything else, in the siege and distress with which your enemy will distress you in your towns.",
      "links": "",
      "comment": "'Afterbirth' and 'bear' are literal; cannibalism repeated for emphasis."
    },
    {
      "pk": 1962858,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 58,
      "text": "If you do not carefully observe all the words of this law that are written in this book, to fear this glorious and awesome name, the LORD your God,",
      "links": "",
      "comment": "'Glorious and awesome name' is literal."
    },
    {
      "pk": 1962859,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 59,
      "text": "then the LORD will make your plagues and the plagues of your descendants extraordinary, severe and persistent plagues, and severe and persistent sicknesses.",
      "links": "",
      "comment": "All adjectives retained word-for-word from Hebrew."
    },
    {
      "pk": 1962860,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 60,
      "text": "And he will bring back upon you all the diseases of Egypt of which you were afraid, and they will cling to you.",
      "links": "",
      "comment": "Allusions to Exodus plagues."
    },
    {
      "pk": 1962861,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 61,
      "text": "Every sickness also and every plague that is not written in the book of this law, the LORD will bring upon you, until you are destroyed.",
      "links": "",
      "comment": ""
    },
    {
      "pk": 1962862,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 62,
      "text": "You will be left few in number, whereas you were as numerous as the stars of heaven, because you did not obey the voice of the LORD your God.",
      "links": "<a href='/AIV/1/15/5'>Gen. 15:5</a>",
      "comment": "Contrast with God's promise to Abraham."
    },
    {
      "pk": 1962863,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 63,
      "text": "And just as the LORD delighted to do you good and to multiply you, so the LORD will take delight to bring ruin upon you and to destroy you. You will be plucked from the land that you are entering to possess.",
      "links": "",
      "comment": "Parallels v.11, but with reversal."
    },
    {
      "pk": 1962864,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 64,
      "text": "And the LORD will scatter you among all peoples, from one end of the earth to the other, and there you will serve other gods of wood and stone, which neither you nor your fathers have known.",
      "links": "<a href='/AIV/5/4/27'>Deut. 4:27</a>",
      "comment": "Exile to the nations; literal idolatry."
    },
    {
      "pk": 1962865,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 65,
      "text": "And among those nations you will find no rest, and there will be no resting place for the sole of your foot. There the LORD will give you a trembling heart, failing eyes, and a languishing soul.",
      "links": "",
      "comment": "Literal: 'languishing soul' for Hebrew nefesh."
    },
    {
      "pk": 1962866,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 66,
      "text": "Your life will hang in doubt before you. Day and night you will be in dread and have no assurance of your life.",
      "links": "",
      "comment": "'Hang in doubt' is a literal rendering."
    },
    {
      "pk": 1962867,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 67,
      "text": "In the morning you will say, ‘If only it were evening!’ and at evening you will say, ‘If only it were morning!’ because of the dread that fills your heart and the sights that your eyes will see.",
      "links": "",
      "comment": "Desperate longing for escape is literal."
    },
    {
      "pk": 1962868,
      "translation": "AIV",
      "book": 5,
      "chapter": 28,
      "verse": 68,
      "text": "And the LORD will bring you back in ships to Egypt, by a route that I promised you would never see again. There you will offer yourselves for sale as male and female slaves to your enemies, but there will be no buyer.",
      "links": "<a href='/AIV/2/14/13'>Ex. 14:13</a>",
      "comment": "Literal 'offer yourselves for sale,' emphasizing the complete reversal of Exodus."
    }
  ],
  "translatedAt": "2025-12-20T10:01:57.740Z"
}