{
  "book": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 26,
  "verses": [
    {
      "pk": 1954026,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 1,
      "text": "When you come into the land that the Lord your God is giving you as an inheritance and you possess it and live in it,",
      "links": "<a href='/AIV/05/1/8'>Deut. 1:8</a>; <a href='/AIV/05/17/14'>Deut. 17:14</a>",
      "comment": "The structure follows a conditional statement in the Hebrew, maintaining the literal development of the instruction."
    },
    {
      "pk": 1954027,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 2,
      "text": "you shall take some of the first of all the fruit of the ground, which you harvest from your land that the Lord your God is giving you, and you shall put it in a basket and go to the place that the Lord your God will choose to make His name dwell there.",
      "links": "<a href='/AIV/02/23/19'>Ex. 23:19</a>; <a href='/AIV/05/12/5'>Deut. 12:5</a>",
      "comment": "Rendered 'make His name dwell there' literally, as the Hebrew expression means God's dwelling presence."
    },
    {
      "pk": 1954028,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 3,
      "text": "You shall go to the priest who is in office at that time and say to him, 'I declare today to the Lord your God that I have come into the land that the Lord swore to our fathers to give us.'",
      "links": "<a href='/AIV/01/12/7'>Gen. 12:7</a>; <a href='/AIV/05/7/8'>Deut. 7:8</a>",
      "comment": "Maintains first person form as in Hebrew; 'swore to our fathers' is a covenantal phrase, left literal."
    },
    {
      "pk": 1954029,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 4,
      "text": "Then the priest shall take the basket from your hand and set it down before the altar of the Lord your God.",
      "links": "<a href='/AIV/02/40/29'>Ex. 40:29</a>",
      "comment": "Kept 'before the altar' as a literal rendering of the Hebrew phrase."
    },
    {
      "pk": 1954030,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 5,
      "text": "And you shall declare and say before the Lord your God, 'My father was a wandering Aramean. He went down to Egypt and sojourned there, few in number, and there he became a great, mighty, and populous nation.'",
      "links": "<a href='/AIV/01/46/1-7'>Gen. 46:1–7</a>",
      "comment": "Rendered 'wandering Aramean' literally, which refers to Jacob, per Hebrew idiom."
    },
    {
      "pk": 1954031,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 6,
      "text": "And the Egyptians treated us harshly, afflicted us, and placed hard labor upon us.",
      "links": "<a href='/AIV/02/1/11-14'>Ex. 1:11–14</a>",
      "comment": "Phrasing made direct and active, retaining the three verbs from the Hebrew."
    },
    {
      "pk": 1954032,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 7,
      "text": "Then we cried out to the Lord, the God of our fathers, and the Lord heard our voice and saw our affliction, our toil, and our oppression.",
      "links": "<a href='/AIV/02/2/23-25'>Ex. 2:23–25</a>; <a href='/AIV/02/3/7'>Ex. 3:7</a>",
      "comment": "'The God of our fathers' directly maintains the Hebrew phrase."
    },
    {
      "pk": 1954033,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 8,
      "text": "And the Lord brought us out of Egypt with a mighty hand and an outstretched arm, with great terrors, with signs and wonders.",
      "links": "<a href='/AIV/02/12/33-36'>Ex. 12:33–36</a>; <a href='/AIV/05/4/34'>Deut. 4:34</a>",
      "comment": "The phrase 'with a mighty hand and an outstretched arm' is preserved as a Hebrew idiom."
    },
    {
      "pk": 1954034,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 9,
      "text": "And He brought us to this place and gave us this land, a land flowing with milk and honey.",
      "links": "<a href='/AIV/02/3/8'>Ex. 3:8</a>; <a href='/AIV/05/6/3'>Deut. 6:3</a>",
      "comment": "Literal phrase 'flowing with milk and honey' kept, per repeated OT motif."
    },
    {
      "pk": 1954035,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 10,
      "text": "Now, behold, I have brought the first of the fruit of the land which you, O Lord, have given me.' And you shall set it down before the Lord your God and worship before the Lord your God.",
      "links": "<a href='/AIV/05/16/10'>Deut. 16:10</a>",
      "comment": "Repetitive phrase 'before the Lord your God' is a key OT phrase and is left as is."
    },
    {
      "pk": 1954036,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 11,
      "text": "And you shall rejoice in all the good which the Lord your God has given to you and to your house, you and the Levite and the sojourner who is among you.",
      "links": "<a href='/AIV/03/23/22'>Lev. 23:22</a>; <a href='/AIV/05/16/11'>Deut. 16:11</a>",
      "comment": "'Sojourner' is rendered for Hebrew 'ger' (stranger or resident alien); kept literal."
    },
    {
      "pk": 1954037,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 12,
      "text": "When you have finished tithing all the tithe of your produce in the third year, the year of tithing, then you shall give it to the Levite, the sojourner, the fatherless, and the widow, so that they may eat within your gates and be filled.",
      "links": "<a href='/AIV/05/14/28-29'>Deut. 14:28–29</a>",
      "comment": "Hebrew 'within your gates' is an idiom for 'within your towns' but retained for literal flavor."
    },
    {
      "pk": 1954038,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 13,
      "text": "Then you shall say before the Lord your God, 'I have removed the sacred portion out of my house, and moreover, I have given it to the Levite, the sojourner, the fatherless, and the widow, according to all Your commandment which You have commanded me. I have not transgressed any of Your commandments, nor have I forgotten them.'",
      "links": "<a href='/AIV/05/12/19'>Deut. 12:19</a>; <a href='/AIV/05/24/19'>Deut. 24:19</a>",
      "comment": "'Sacred portion' translated for Hebrew 'kodesh'; direct rendering."
    },
    {
      "pk": 1954039,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 14,
      "text": "'I have not eaten any of it while mourning, nor have I removed any of it while I was unclean, nor have I offered any of it to the dead. I have listened to the voice of the Lord my God; I have done according to all that You have commanded me.'",
      "links": "<a href='/AIV/03/21/6'>Lev. 21:6</a>; <a href='/AIV/05/14/1'>Deut. 14:1</a>",
      "comment": "Phrases about ritual purity and mourning follow Hebrew conceptual categories closely."
    },
    {
      "pk": 1954040,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 15,
      "text": "'Look down from Your holy habitation, from heaven, and bless Your people Israel and the ground which You have given us, as You swore to our fathers, a land flowing with milk and honey.'",
      "links": "<a href='/AIV/05/26/9'>Deut. 26:9</a>; <a href='/AIV/05/9/29'>Deut. 9:29</a>",
      "comment": "The prayer motif is kept literal, with the repeated phrase 'a land flowing with milk and honey'."
    },
    {
      "pk": 1954041,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 16,
      "text": "This day the Lord your God commands you to do these statutes and rights. Therefore, you shall keep and do them with all your heart and with all your soul.",
      "links": "<a href='/AIV/05/4/29'>Deut. 4:29</a>; <a href='/AIV/05/6/5'>Deut. 6:5</a>",
      "comment": "'Statutes and rights' for Hebrew 'chukkim u'mishpatim', phrase left literal."
    },
    {
      "pk": 1954042,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 17,
      "text": "You have declared today that the Lord is your God, and that you will walk in His ways and keep His statutes, His commandments, and His rights, and will obey His voice.",
      "links": "<a href='/AIV/05/5/1-3'>Deut. 5:1–3</a>; <a href='/AIV/05/10/20'>Deut. 10:20</a>",
      "comment": "'Rights' translates 'mishpatim'; maintained the triplicate formula of obedience."
    },
    {
      "pk": 1954043,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 18,
      "text": "And the Lord has declared today that you are His treasured people, as He promised you, and that you are to keep all His commandments,",
      "links": "<a href='/AIV/02/19/5'>Ex. 19:5</a>; <a href='/AIV/05/7/6'>Deut. 7:6</a>",
      "comment": "'Treasured people' is the Hebrew 'segullah,' denoting special possession."
    },
    {
      "pk": 1954044,
      "translation": "AIV",
      "book": 5,
      "chapter": 26,
      "verse": 19,
      "text": "and that He will set you high above all nations that He has made, in praise and in fame and in honor. And that you shall be a holy people to the Lord your God, as He has spoken.",
      "links": "<a href='/AIV/05/28/1'>Deut. 28:1</a>; <a href='/AIV/03/20/26'>Lev. 20:26</a>",
      "comment": "Literal rendering of Hebrew emphatic contrast with other nations and the threefold elevation (praise/fame/honor)."
    }
  ],
  "translatedAt": "2025-12-20T10:00:40.153Z"
}