{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 33,
  "verses": [
    {
      "pk": 5033001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 1,
      "text": "This is the blessing with which Moses, the man of God, blessed the children of Israel before his death.",
      "links": "<a href='/AIV/4/22/41'>Num. 22:41</a>, <a href='/AIV/34/1/1'>Hab. 1:1</a>",
      "comment": "The figure of Moses as 'the man of God' marks him as a unique prophetic and priestly intermediary, a foreshadowing of Christ as both Prophet and High Priest (see Heb. 3:1-6)."
    },
    {
      "pk": 5033002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 2,
      "text": "He said, \"The Lord came from Sinai, and dawned upon them from Seir; He shone forth from Mount Paran, and He came with myriads of holy ones; at His right hand a fiery law for them.\"",
      "links": "<a href='/AIV/7/5/4'>Judg. 5:4</a>, <a href='/AIV/19/68/17'>Ps. 68:17</a>, <a href='/AIV/35/3/3'>Hab. 3:3-4</a>",
      "comment": "The Theophany imagery recalls the Lord’s presence at Sinai and elsewhere, with angels accompanying Him. The 'fiery law' refers to the giving of the law. Early Christians saw these theophanies as strong hints of the coming Incarnation and presence of Christ among his people (John 1:14)."
    },
    {
      "pk": 5033003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 3,
      "text": "He indeed loves the people; all His holy ones are in Your hand. They sit at Your feet; everyone receives Your words.",
      "links": "<a href='/AIV/2/19/5-6'>Ex. 19:5-6</a>, <a href='/AIV/19/16/3'>Ps. 16:3</a>",
      "comment": "God’s love for His holy ones prefigures the intimate relationship believers enjoy through the sacraments, especially the Eucharist, where the faithful spiritually 'sit at the Lord’s feet' (see Luke 10:39, John 6:53-56)."
    },
    {
      "pk": 5033004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 4,
      "text": "Moses commanded us a law, an inheritance for the assembly of Jacob.",
      "links": "<a href='/AIV/3/26/46'>Lev. 26:46</a>, <a href='/AIV/44/7/38'>Acts 7:38</a>",
      "comment": "The law given by Moses is described as an inheritance—hinting at how the Church receives not only written Scripture but also living tradition handed down from the apostles (see 2 Thess. 2:15)."
    },
    {
      "pk": 5033005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 5,
      "text": "He became king in Jeshurun, when the heads of the people were gathered, all the tribes of Israel together.",
      "links": "<a href='/AIV/5/32/15'>Deut. 32:15</a>, <a href='/AIV/19/47/9'>Ps. 47:9</a>",
      "comment": "'Jeshurun' is a poetic name for Israel. The gathering of the tribes foreshadows the unity intended for God’s people, which finds its fulfillment in the visible unity of the New Covenant Church (see John 17:21)."
    },
    {
      "pk": 5033006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 6,
      "text": "\"Let Reuben live, and not die, nor let his men be few.\"",
      "links": "<a href='/AIV/1/49/3-4'>Gen. 49:3-4</a>, <a href='/AIV/4/26/5'>Num. 26:5</a>",
      "comment": "Moses begins the tribal blessings with Reuben, referencing the vulnerability of the tribe (see also Gen. 49:3-4)."
    },
    {
      "pk": 5033007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 7,
      "text": "And this he said of Judah: \"Hear, Lord, the voice of Judah, and bring him to his people. With his hands he contended for them, and may You be a help against his adversaries.\"",
      "links": "<a href='/AIV/1/49/8-10'>Gen. 49:8-10</a>, <a href='/AIV/19/20/9'>Ps. 20:9</a>",
      "comment": "Judah's primacy among the tribes is reinforced—tradition sees this as pointing towards Christ, the Lion of Judah, whose intercession continues through His priestly ministry (see Heb. 7:14-25; Rev. 5:5)."
    },
    {
      "pk": 5033008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 8,
      "text": "And of Levi he said: \"Give to Levi your Thummim and your Urim, to your faithful one, whom You tested at Massah, with whom You contended at the waters of Meribah;\"",
      "links": "<a href='/AIV/2/17/1-7'>Ex. 17:1-7</a>, <a href='/AIV/4/27/21'>Num. 27:21</a>",
      "comment": "Levi’s priestly role is emphasized—the Thummim and Urim were the sacred lots by which God communicated His will, a precursor to the spiritual discernment of God’s will in the Church through ordained ministers."
    },
    {
      "pk": 5033009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 9,
      "text": "\"Who said of his father and mother, 'I do not regard them'; he did not acknowledge his brothers or know his own children; for they observed Your word and kept Your covenant.\"",
      "links": "<a href='/AIV/2/32/26-29'>Ex. 32:26-29</a>, <a href='/AIV/40/10/37'>Matt. 10:37</a>",
      "comment": "Levi’s radical dedication to God foreshadows the call to renounce everything for the sake of God’s covenant. This hints towards ministries set apart for sacramental service, including those with celibate commitments (see Matt. 19:12)."
    },
    {
      "pk": 5033010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 10,
      "text": "\"They shall teach Jacob Your judgments, and Israel Your law. They will put incense before You, and whole burnt offerings on Your altar.\"",
      "links": "<a href='/AIV/3/10/11'>Lev. 10:11</a>, <a href='/AIV/39/1/11'>Mal. 1:11</a>",
      "comment": "The Levitical task of teaching and offering sacrificial worship points towards the ongoing priestly ministry in the New Covenant—where Christ, our High Priest, offers the perfect sacrifice perpetually (see Heb. 8:1-4; Mal. 1:11)."
    },
    {
      "pk": 5033011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 11,
      "text": "\"Bless, O Lord, his substance, and accept the work of his hands; crush the loins of his adversaries and those who hate him, that they rise not again.\"",
      "links": "<a href='/AIV/13/26/27'>1 Chr. 26:27</a>, <a href='/AIV/19/110/1'>Ps. 110:1</a>",
      "comment": "The request for God to bless and protect the Levitical ministry implies the importance and perseverance of a visible priestly order for the sanctification of the people."
    },
    {
      "pk": 5033012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 12,
      "text": "Of Benjamin he said: \"The beloved of the Lord shall dwell in safety by Him; He covers him all day long, and he dwells between His shoulders.\"",
      "links": "<a href='/AIV/1/49/27'>Gen. 49:27</a>, <a href='/AIV/19/91/1-4'>Ps. 91:1-4</a>",
      "comment": "Benjamin’s closeness to God (dwelling 'between His shoulders') is often seen as a metaphor for God’s special, sustaining presence for His people."
    },
    {
      "pk": 5033013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 13,
      "text": "And of Joseph he said: \"Blessed by the Lord is his land, with precious things of heaven, with the dew, with the deep that lies beneath,",
      "links": "<a href='/AIV/1/49/22-26'>Gen. 49:22-26</a>, <a href='/AIV/19/65/9-13'>Ps. 65:9-13</a>",
      "comment": "The blessings on Joseph (Ephraim and Manasseh) emphasize supernatural abundance—paralleling the spiritual blessings poured out on the members of the New Covenant."
    },
    {
      "pk": 5033014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 14,
      "text": "\"with the precious fruits brought forth by the sun and the precious produce of the months,",
      "links": "<a href='/AIV/19/104/13-15'>Ps. 104:13-15</a>",
      "comment": "Each image—the sun, the seasonal produce—speaks to the providence of God who nourishes the Church through both natural and supernatural means."
    },
    {
      "pk": 5033015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 15,
      "text": "\"with the best things of the ancient mountains, and the precious things of the everlasting hills,",
      "links": "<a href='/AIV/1/49/26'>Gen. 49:26</a>",
      "comment": "These blessings allude to Christ, the Rock, from whom living water flows for the Church (see 1 Cor. 10:4)."
    },
    {
      "pk": 5033016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 16,
      "text": "\"with the precious things of the earth and its fullness, and the favor of Him who dwelt in the bush. Let these rest on the head of Joseph, on the crown of the head of the one set apart from his brothers.\"",
      "links": "<a href='/AIV/2/3/2'>Ex. 3:2</a>, <a href='/AIV/1/49/26'>Gen. 49:26</a>",
      "comment": "\"Him who dwelt in the bush\" refers to the burning bush, an image the early Church saw as symbolizing the mystery of God’s presence in the Church—holy, unconsumed, and life-giving."
    },
    {
      "pk": 5033017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 17,
      "text": "His majesty is like a firstborn bull, and his horns are the horns of a wild ox; with them he will push the peoples, all of them, to the ends of the earth. They are the ten thousands of Ephraim, and they are the thousands of Manasseh.\"",
      "links": "<a href='/AIV/1/48/19-20'>Gen. 48:19-20</a>",
      "comment": "This image points to the fruitfulness and vigor of Joseph’s line and foreshadows the global spread of the New Covenant among all peoples."
    },
    {
      "pk": 5033018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 18,
      "text": "And of Zebulun he said: \"Rejoice, Zebulun, in your going out, and Issachar, in your tents.",
      "links": "<a href='/AIV/1/49/13-14'>Gen. 49:13-14</a>",
      "comment": "Zebulun and Issachar’s blessing highlights both missionary activity and contemplative stability in the life of God’s people—two vital aspects of spiritual life."
    },
    {
      "pk": 5033019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 19,
      "text": "\"They shall call peoples to the mountain; there they offer right sacrifices. For they draw from the abundance of the seas, and hidden treasures of the sand.\"",
      "links": "<a href='/AIV/23/60/5'>Isa. 60:5</a>, <a href='/AIV/40/5/1'>Matt. 5:1</a>",
      "comment": "The invitation to 'call peoples to the mountain' prefigures the mission to invite all nations into worship, fulfilled in the proclamation of the Gospel."
    },
    {
      "pk": 5033020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 20,
      "text": "And of Gad he said: \"Blessed is he who enlarges Gad; like a lion he dwells, and he tears the arm, even the crown of the head.",
      "links": "<a href='/AIV/1/49/19'>Gen. 49:19</a>",
      "comment": "Gad’s martial blessing underscores God’s strength and protection of His people."
    },
    {
      "pk": 5033021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 21,
      "text": "He chose the best of the land for himself, for there was reserved a leader’s portion; he came with the heads of the people; he executed the justice of the Lord and his judgments for Israel.\"",
      "links": "<a href='/AIV/4/32/34-42'>Num. 32:34-42</a>",
      "comment": "Gad chooses well, operating in harmony with God’s appointed order and leadership."
    },
    {
      "pk": 5033022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 22,
      "text": "Of Dan he said: \"Dan is a lion’s cub that leaps from Bashan.\"",
      "links": "<a href='/AIV/1/49/16-17'>Gen. 49:16-17</a>",
      "comment": "Dan’s swift and forceful character is described with vivid imagery; in Scripture, Dan’s future is often enigmatic (Rev. 7:4-8 omits Dan from the sealed tribes)."
    },
    {
      "pk": 5033023,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 23,
      "text": "And of Naphtali he said: \"O Naphtali, sated with favor and full of the blessing of the Lord, possess the west and the south.\"",
      "links": "<a href='/AIV/1/49/21'>Gen. 49:21</a>",
      "comment": "Naphtali receives a blessing of fullness and territory—an image of spiritual abundance available to those who faithfully abide within God’s people."
    },
    {
      "pk": 5033024,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 24,
      "text": "And of Asher he said: \"Most blessed of sons is Asher; let him be favored by his brothers, and let him dip his foot in oil.",
      "links": "<a href='/AIV/1/49/20'>Gen. 49:20</a>, <a href='/AIV/19/133/2'>Ps. 133:2</a>",
      "comment": "The image of oil ties to anointing and blessing, with resonances pointing toward the sacraments and the priesthood in the new covenant (see James 5:14)."
    },
    {
      "pk": 5033025,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 25,
      "text": "\"Your bars shall be iron and bronze; as your days, so shall your strength be.\"",
      "links": "<a href='/AIV/24/15/20'>Jer. 15:20</a>",
      "comment": "Strength and protection are promised, symbolizing the enduring security given to those inside God’s covenantal household."
    },
    {
      "pk": 5033026,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 26,
      "text": "\"There is no one like the God of Jeshurun, who rides the heavens to your help, and in His majesty through the skies.\"",
      "links": "<a href='/AIV/19/68/33-34'>Ps. 68:33-34</a>, <a href='/AIV/19/104/3'>Ps. 104:3</a>",
      "comment": "This echoes the transcendence and power of God—a theme found throughout both Testaments and exemplified most perfectly in the Ascension of Christ (see Acts 1:9-11)."
    },
    {
      "pk": 5033027,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 27,
      "text": "\"The eternal God is your dwelling place, and underneath are the everlasting arms. And He drove out the enemy before you and said, ‘Destroy.’\"",
      "links": "<a href='/AIV/19/90/1-2'>Ps. 90:1-2</a>, <a href='/AIV/42/1/51-53'>Luke 1:51-53</a>",
      "comment": "The theme of God as refuge forms the basis for understanding the Church as the secure dwelling of God's people throughout history."
    },
    {
      "pk": 5033028,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 28,
      "text": "\"So Israel dwelled in safety, Jacob lived alone in a land of grain and new wine, where the heavens drop down dew.\"",
      "links": "<a href='/AIV/19/4/8'>Ps. 4:8</a>, <a href='/AIV/28/14/5-7'>Hos. 14:5-7</a>",
      "comment": "The promises of safety, fruitfulness, and blessing in the promised land are types fulfilled in the superabundant grace poured out in the New Covenant."
    },
    {
      "pk": 5033029,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 33,
      "verse": 29,
      "text": "\"Blessed are you, O Israel! Who is like you, a people saved by the Lord, the shield of your help, the sword of your triumph! Your enemies shall submit to you, and you shall tread upon their high places.\"",
      "links": "<a href='/AIV/19/144/15'>Ps. 144:15</a>, <a href='/AIV/45/8/31'>Rom. 8:31</a>",
      "comment": "Israel’s blessing is ultimately fulfilled in Christ, who saves and protects His people, and in the community He establishes, against which the gates of hell do not prevail (Matt. 16:18)."
    }
  ],
  "translatedAt": "2025-12-24T02:16:19.254Z"
}