{
  "book": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 16,
  "verses": [
    {
      "pk": 3016001,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 1,
      "text": "Observe the month of Abib, and keep the Passover to the LORD your God. For in the month of Abib, the LORD your God brought you out of Egypt by night.",
      "links": "<a href='/AIV/2/12/2'>Ex. 12:2</a>; <a href='/AIV/2/12/29-30'>Ex. 12:29–30</a>",
      "comment": "‘Abib’ refers to the first month of the Hebrew calendar (March/April)."
    },
    {
      "pk": 3016002,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 2,
      "text": "You shall offer the Passover sacrifice to the LORD your God, from the flock and the herd, at the place that the LORD will choose as a dwelling for His name.",
      "links": "<a href='/AIV/2/12/3-6'>Ex. 12:3–6</a>; <a href='/AIV/5/12/5'>Deut. 12:5</a>",
      "comment": "‘Place that the LORD will choose’ refers to the future temple location in Jerusalem."
    },
    {
      "pk": 3016003,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 3,
      "text": "You shall not eat it with leavened bread. For seven days you shall eat unleavened bread with it, the bread of affliction—because you came out of the land of Egypt in haste—so that you may remember the day when you came out of Egypt all the days of your life.",
      "links": "<a href='/AIV/2/12/8'>Ex. 12:8</a>; <a href='/AIV/2/12/17'>Ex. 12:17</a>",
      "comment": "‘Bread of affliction’ indicates the hardship of Israel’s flight from Egypt."
    },
    {
      "pk": 3016004,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 4,
      "text": "No leaven shall be seen with you in all your territory for seven days; and none of the meat that you sacrifice on the evening of the first day shall remain until morning.",
      "links": "<a href='/AIV/2/12/19'>Ex. 12:19</a>; <a href='/AIV/2/12/10'>Ex. 12:10</a>",
      "comment": "Requirement for complete removal of leaven and consumption of sacrificial meat."
    },
    {
      "pk": 3016005,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 5,
      "text": "You are not allowed to offer the Passover sacrifice within any of your towns that the LORD your God gives you.",
      "links": "<a href='/AIV/5/12/13-14'>Deut. 12:13–14</a>",
      "comment": "Sacrifice can only be made at the chosen central sanctuary."
    },
    {
      "pk": 3016006,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 6,
      "text": "But at the place that the LORD your God will choose as a dwelling for His name, there you shall offer the Passover sacrifice in the evening, at sunset, at the time when you came out of Egypt.",
      "links": "<a href='/AIV/2/12/6'>Ex. 12:6</a>; <a href='/AIV/5/16/2'>v.2</a>",
      "comment": "Time of sacrifice specified as sunset, paralleling the Exodus timing."
    },
    {
      "pk": 3016007,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 7,
      "text": "You shall cook it and eat it at the place the LORD your God chooses. Then you shall turn in the morning and go to your tents.",
      "links": "<a href='/AIV/2/12/8'>Ex. 12:8</a>",
      "comment": "‘Go to your tents’ means to return home after the festival observance."
    },
    {
      "pk": 3016008,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 8,
      "text": "For six days you shall eat unleavened bread, and on the seventh day there shall be a solemn assembly to the LORD your God. You shall do no work.",
      "links": "<a href='/AIV/2/12/16'>Ex. 12:16</a>; <a href='/AIV/3/23/8'>Lev. 23:8</a>",
      "comment": "Solemn assembly marks the end of the Feast of Unleavened Bread."
    },
    {
      "pk": 3016009,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 9,
      "text": "You shall count seven weeks. Begin to count the seven weeks when the sickle is first put to the grain.",
      "links": "<a href='/AIV/2/23/16'>Ex. 23:16</a>; <a href='/AIV/3/23/15'>Lev. 23:15</a>",
      "comment": "Marks the beginning of the festival of weeks (Pentecost)."
    },
    {
      "pk": 3016010,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 10,
      "text": "Then you shall keep the Feast of Weeks to the LORD your God with the tribute of a freewill offering from your hand, which you shall give as the LORD your God blesses you.",
      "links": "<a href='/AIV/3/23/21'>Lev. 23:21</a>",
      "comment": "Freewill offering enjoined alongside the festival celebration."
    },
    {
      "pk": 3016011,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 11,
      "text": "And you shall rejoice before the LORD your God, you and your son and your daughter, your male servant and your female servant, and the Levite who is within your towns, and the stranger, the fatherless, and the widow who are among you, at the place that the LORD your God will choose as a dwelling for His name.",
      "links": "<a href='/AIV/5/12/12'>Deut. 12:12</a>; <a href='/AIV/3/23/22'>Lev. 23:22</a>",
      "comment": "Command includes all segments of society in communal celebration."
    },
    {
      "pk": 3016012,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 12,
      "text": "You shall remember that you were a slave in Egypt. Therefore, you shall be careful to observe these statutes.",
      "links": "<a href='/AIV/5/5/15'>Deut. 5:15</a>",
      "comment": "Remembrance as motivation for keeping God’s commandments."
    },
    {
      "pk": 3016013,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 13,
      "text": "You shall keep the Feast of Booths for seven days, when you have gathered in the produce from your threshing floor and your winepress.",
      "links": "<a href='/AIV/3/23/34'>Lev. 23:34</a>; <a href='/AIV/2/23/16'>Ex. 23:16</a>",
      "comment": "Feast of Booths (Tabernacles) celebrates the harvest."
    },
    {
      "pk": 3016014,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 14,
      "text": "You shall rejoice in your feast, you and your son and your daughter, your male servant and your female servant, and the Levite, the stranger, the fatherless, and the widow who are within your towns.",
      "links": "<a href='/AIV/5/16/11'>v.11</a>; <a href='/AIV/3/23/40'>Lev. 23:40</a>",
      "comment": "Repeats inclusive joy and unity in festival observance."
    },
    {
      "pk": 3016015,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 15,
      "text": "For seven days you shall keep the feast to the LORD your God at the place that the LORD will choose. For the LORD your God will bless you in all your produce and in all the work of your hands, so that you will be altogether joyful.",
      "links": "<a href='/AIV/3/23/39'>Lev. 23:39</a>",
      "comment": "The result of obedience to God’s festal statute is joy and blessing."
    },
    {
      "pk": 3016016,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 16,
      "text": "Three times a year all your males shall appear before the LORD your God at the place He will choose: at the Feast of Unleavened Bread, at the Feast of Weeks, and at the Feast of Booths. No one shall appear before the LORD empty-handed.",
      "links": "<a href='/AIV/2/23/17'>Ex. 23:17</a>; <a href='/AIV/3/23/6'>Lev. 23:6</a>",
      "comment": "Mandatory attendance for males at three major annual festivals."
    },
    {
      "pk": 3016017,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 17,
      "text": "Each man shall bring a gift as he is able, according to the blessing of the LORD your God that He has given you.",
      "links": "<a href='/AIV/5/16/10'>v.10</a>; <a href='/AIV/2/23/15'>Ex. 23:15</a>",
      "comment": "Freewill offering proportionate to God’s blessing."
    },
    {
      "pk": 3016018,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 18,
      "text": "You shall appoint judges and officers in all your towns that the LORD your God gives you, according to your tribes. They shall judge the people with righteous judgment.",
      "links": "<a href='/AIV/5/1/16'>Deut. 1:16–17</a>; <a href='/AIV/2/18/21'>Ex. 18:21</a>",
      "comment": "Introduction of local judicial officers for righteous governance."
    },
    {
      "pk": 3016019,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 19,
      "text": "You shall not pervert justice. You shall not show partiality, and you shall not take a bribe, for a bribe blinds the eyes of the wise and twists the words of the righteous.",
      "links": "<a href='/AIV/2/23/8'>Ex. 23:8</a>; <a href='/AIV/3/19/15'>Lev. 19:15</a>",
      "comment": "Strong condemnation of judicial corruption and bribery."
    },
    {
      "pk": 3016020,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 20,
      "text": "Justice, and only justice, you shall pursue, so that you may live and possess the land that the LORD your God is giving you.",
      "links": "<a href='/AIV/5/4/1'>Deut. 4:1</a>; <a href='/AIV/5/17/1'>Deut. 17:1</a>",
      "comment": "Emphasizes the central ethical obligation: unwavering pursuit of justice."
    },
    {
      "pk": 3016021,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 21,
      "text": "You shall not plant any tree as an Asherah beside the altar of the LORD your God, which you shall make.",
      "links": "<a href='/AIV/2/34/13'>Ex. 34:13</a>; <a href='/AIV/5/7/5'>Deut. 7:5</a>",
      "comment": "Prohibition of any pagan worship concepts near God’s altar."
    },
    {
      "pk": 3016022,
      "translation": "AIV",
      "book": 5,
      "chapter": 16,
      "verse": 22,
      "text": "And you shall not set up a pillar, which the LORD your God hates.",
      "links": "<a href='/AIV/3/26/1'>Lev. 26:1</a>; <a href='/AIV/5/7/5'>Deut. 7:5</a>",
      "comment": "‘Pillar’ refers to a stone monument used in idolatrous worship."
    }
  ],
  "translatedAt": "2025-12-20T09:56:37.722Z"
}