{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 3,
  "verses": [
    {
      "pk": 5003001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 1,
      "text": "Then we turned and went up the way to Bashan, and Og king of Bashan came out against us, he and all his people, to battle at Edrei.",
      "links": "<a href='/AIV/4/21/33-35'>Num. 21:33-35</a>; <a href='/AIV/5/1/4'>Deut. 1:4</a>",
      "comment": "The verse vividly recalls the approach to Bashan, echoing earlier encounters with opposing kings. The militaristic context points to God's providential leadership of Israel."
    },
    {
      "pk": 5003002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 2,
      "text": "But the LORD said to me, 'Do not fear him, for I have given him and all his people and his land into your hand. You shall do to him as you did to Sihon king of the Amorites, who lived at Heshbon.'",
      "links": "<a href='/AIV/1/15/20'>Gen. 15:20</a>; <a href='/AIV/4/21/34'>Num. 21:34</a>",
      "comment": "God's assurance not to fear the enemy reflects the theme of divine sovereignty in battle—foreshadowing spiritual battles and victory through faith. See the typology fulfilled in Christ's victory over sin (cf. Col. 2:15)."
    },
    {
      "pk": 5003003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 3,
      "text": "So the LORD our God gave into our hand Og also, king of Bashan, and all his people, and we struck him down until he had no survivor left.",
      "links": "<a href='/AIV/4/21/35'>Num. 21:35</a>",
      "comment": "The total defeat mirrors the completeness of God's judgment and deliverance, which anticipates total spiritual victory in Christ (cf. Rom. 8:37)."
    },
    {
      "pk": 5003004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 4,
      "text": "And we took all his cities at that time—there was not a city that we did not take from them—sixty cities, the whole region of Argob, the kingdom of Og in Bashan.",
      "links": "<a href='/AIV/4/32/33'>Num. 32:33</a>",
      "comment": "The extensive conquest indicates thorough fulfillment of God's promise, reminding believers of the total commitment required to inherit the promises of faith."
    },
    {
      "pk": 5003005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 5,
      "text": "All these cities were fortified with high walls, gates, and bars, besides very many unwalled towns.",
      "links": "<a href='/AIV/13/11/7'>1 Chr. 11:7</a>",
      "comment": "The mention of fortifications illustrates the miraculous aspect of the victory—God accomplishes what human strength cannot."
    },
    {
      "pk": 5003006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 6,
      "text": "And we devoted them to destruction, as we did to Sihon king of Heshbon, devoting every city—men, women, and children—to destruction.",
      "links": "<a href='/AIV/6/6/21'>Josh. 6:21</a>; <a href='/AIV/5/2/34'>Deut. 2:34</a>",
      "comment": "The 'devoting to destruction' (herem) signals both judgment and radical separation from the idolatrous practices of these nations—a call to total consecration, which has spiritual parallels in sanctification (cf. Lev. 20:7)."
    },
    {
      "pk": 5003007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 7,
      "text": "But all the livestock and the spoil of the cities we took as our plunder.",
      "links": "<a href='/AIV/4/21/35'>Num. 21:35</a>",
      "comment": "Material goods were permitted, distinguishing these conquests from later commands of total destruction. This typifies God’s ability to bless His people temporally as well as spiritually."
    },
    {
      "pk": 5003008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 8,
      "text": "So we took at that time the land out of the hand of the two kings of the Amorites who were beyond the Jordan, from the Arnon to Mount Hermon—",
      "links": "<a href='/AIV/6/12/1'>Josh. 12:1</a>; <a href='/AIV/4/21/13'>Num. 21:13</a>",
      "comment": "The summary of territory conquered signals a significant fulfillment of the Abrahamic promise (Genesis 15:18)."
    },
    {
      "pk": 5003009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 9,
      "text": "(The Sidonians call Hermon Sirion, while the Amorites call it Senir.)",
      "links": "<a href='/AIV/19/29/6'>Psalm 29:6</a>; <a href='/AIV/13/5/23'>1 Chr. 5:23</a>",
      "comment": "This linguistic detail shows the historical breadth and documentation, reinforcing the reliability of Scripture."
    },
    {
      "pk": 5003010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 10,
      "text": "All the cities of the plain, and all Gilead, and all Bashan, as far as Salecah and Edrei, cities of the kingdom of Og in Bashan.",
      "links": "<a href='/AIV/6/12/4'>Josh. 12:4</a>",
      "comment": "Lists of cities show Israel's thoroughness and serve as historical markers to God’s covenant faithfulness."
    },
    {
      "pk": 5003011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 11,
      "text": "For only Og king of Bashan was left of the remnant of the Rephaim. Behold, his bed was a bed of iron. Is it not in Rabbah of the Ammonites? Nine cubits was its length and four cubits its breadth, according to the common cubit.",
      "links": "<a href='/AIV/5/2/11'>Deut. 2:11</a>; <a href='/AIV/6/12/4'>Josh. 12:4</a>",
      "comment": "Og's iron bed and extraordinary size point to his feared stature. Historically, this magnifies the Lord's victory over human might. Spiritually, it teaches dependence on divine power rather than earthly strength."
    },
    {
      "pk": 5003012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 12,
      "text": "When we took possession of this land at that time, I gave to the Reubenites and Gadites the territory beginning at Aroer, which is by the valley of the Arnon, and half the hill country of Gilead with its cities.",
      "links": "<a href='/AIV/4/32/33'>Num. 32:33</a>; <a href='/AIV/6/13/8'>Josh. 13:8-9</a>",
      "comment": "Dividing the land foreshadows the principle of inheritance, which finds fulfillment spiritually in the inheritance of the saints (cf. Col. 1:12)."
    },
    {
      "pk": 5003013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 13,
      "text": "The rest of Gilead and all Bashan, the kingdom of Og, I gave to the half-tribe of Manasseh—all the region of Argob, that is, all Bashan. (It is called the land of Rephaim.)",
      "links": "<a href='/AIV/6/13/29-31'>Josh. 13:29-31</a>",
      "comment": "Manasseh’s share underscores the unity and charism of tribe division, prefiguring the gathering of all believers into one spiritual household."
    },
    {
      "pk": 5003014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 14,
      "text": "Jair the son of Manasseh took all the region of Argob, as far as the boundary of the Geshurites and the Maacathites, and called them Bashan-havoth-jair, after his own name, to this day.",
      "links": "<a href='/AIV/6/13/30'>Josh. 13:30</a>; <a href='/AIV/7/10/4'>Judg. 10:4</a>",
      "comment": "Naming the towns after Jair shows the importance of legacy and stewardship for God’s people."
    },
    {
      "pk": 5003015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 15,
      "text": "And I gave Gilead to Machir.",
      "links": "<a href='/AIV/6/13/31'>Josh. 13:31</a>",
      "comment": "Gilead’s assignment reinforces the principle of promise and reward for faithful service—echoes of justice with mercy."
    },
    {
      "pk": 5003016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 16,
      "text": "And to the Reubenites and Gadites I gave the territory from Gilead as far as the valley of the Arnon, with the middle of the valley as a border, as far as the river Jabbok, the border of the Ammonites;",
      "links": "<a href='/AIV/4/32/33'>Num. 32:33</a>",
      "comment": "Clear territorial boundaries show God’s intentional provision and order in establishing His people’s inheritance."
    },
    {
      "pk": 5003017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 17,
      "text": "the Arabah also, with the Jordan as the border, from Kinnereth as far as the Sea of the Arabah, the Salt Sea, under the slopes of Pisgah on the east.",
      "links": "<a href='/AIV/6/12/3'>Josh. 12:3</a>",
      "comment": "Kinnereth, later known as the Sea of Galilee, becomes significant in the Gospels as the center of much of Jesus' ministry (cf. Matt. 4:13)."
    },
    {
      "pk": 5003018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 18,
      "text": "And I commanded you at that time, saying, ‘The LORD your God has given you this land to possess. All your able-bodied men, armed for battle, shall cross over before your brothers, the people of Israel.’",
      "links": "<a href='/AIV/4/32/20-27'>Num. 32:20-27</a>",
      "comment": "Helping one another enter into God’s promise points toward the communion of saints and the united effort of God’s people in spiritual pilgrimage."
    },
    {
      "pk": 5003019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 19,
      "text": "But your wives, your little ones, and your livestock (I know that you have much livestock) shall stay in your cities that I have given you,",
      "links": "<a href='/AIV/4/32/24'>Num. 32:24'</a>",
      "comment": "Provision for families and livestock indicates God’s concern for the welfare of all believers, echoing a holistic care for the congregation."
    },
    {
      "pk": 5003020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 20,
      "text": "until the LORD gives rest to your brothers, as to you, and they also occupy the land that the LORD your God gives them beyond the Jordan. Then each of you may return to his possession which I have given you.",
      "links": "<a href='/AIV/6/22/4'>Josh. 22:4</a>",
      "comment": "'Rest' here is not final; later the true rest is found in Christ (cf. Heb. 4:8-11), illustrating the journey from promise to spiritual fulfillment."
    },
    {
      "pk": 5003021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 21,
      "text": "And I commanded Joshua at that time, ‘Your eyes have seen all that the LORD your God has done to these two kings; so will the LORD do to all the kingdoms into which you are crossing.’",
      "links": "<a href='/AIV/6/1/2'>Josh. 1:2</a>; <a href='/AIV/2/3/6'>Ex. 3:6</a>",
      "comment": "God's past faithfulness guarantees future victory—moral certainty reinforces trust in His ongoing providence and justice."
    },
    {
      "pk": 5003022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 22,
      "text": "You shall not fear them, for it is the LORD your God who fights for you.’",
      "links": "<a href='/AIV/2/14/14'>Ex. 14:14</a>; <a href='/AIV/6/23/10'>Josh. 23:10</a>",
      "comment": "The principle that God Himself fights for His people finds fullness in the victory of Christ over death and spiritual enemies (cf. 1 Cor. 15:57)."
    },
    {
      "pk": 5003023,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 23,
      "text": "And I pleaded with the LORD at that time, saying,",
      "links": "<a href='/AIV/5/9/18'>Deut. 9:18</a>",
      "comment": "Moses' intercession shows the importance of prayer and mediation—the role of spiritual leaders in pleading for God's favor on behalf of His people is continued in the New Testament, with Christ as chief intercessor (cf. Heb. 7:25)."
    },
    {
      "pk": 5003024,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 24,
      "text": "‘O Lord GOD, you have begun to show your servant your greatness and your mighty hand, for what god is there in heaven or on earth who can do such mighty works as yours?",
      "links": "<a href='/AIV/19/86/8'>Ps. 86:8</a>; <a href='/AIV/19/89/8'>Ps. 89:8</a>",
      "comment": "Confession of divine supremacy prefigures the exclusive worship of God, later echoed in the New Testament call to worship God alone (cf. Matt. 4:10)."
    },
    {
      "pk": 5003025,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 25,
      "text": "Please let me go over and see the good land beyond the Jordan, that good hill country and Lebanon.’",
      "links": "<a href='/AIV/5/34/1'>Deut. 34:1</a>; <a href='/AIV/19/106/24'>Ps. 106:24</a>",
      "comment": "Moses’ longing for the Promised Land, though denied, points to the future hope and the ultimate fulfillment found not in mere geography but spiritual communion."
    },
    {
      "pk": 5003026,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 26,
      "text": "But the LORD was angry with me because of you and would not listen to me. And the LORD said to me, ‘Enough from you; do not speak to me of this matter again.",
      "links": "<a href='/AIV/5/1/37'>Deut. 1:37</a>",
      "comment": "God’s discipline of Moses illustrates leadership’s accountability—and the necessity of humility before God’s decrees."
    },
    {
      "pk": 5003027,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 27,
      "text": "Go up to the top of Pisgah and lift up your eyes westward and northward and southward and eastward, and see it with your eyes, for you shall not go over this Jordan.",
      "links": "<a href='/AIV/5/34/1-4'>Deut. 34:1-4</a>",
      "comment": "Though Moses saw but did not enter the land, it typologically prefigures being able to see but not yet inherit. Allegorically, it points to the transition from Law to grace through Christ (cf. John 1:17)."
    },
    {
      "pk": 5003028,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 28,
      "text": "But charge Joshua, and encourage him and strengthen him, for he shall go over at the head of this people, and he shall give them as an inheritance the land that you will see.’",
      "links": "<a href='/AIV/6/1/6'>Josh. 1:6</a>",
      "comment": "Moses prepares Joshua for leadership, foreshadowing the idea of apostolic succession and the continuity of God’s work from generation to generation."
    },
    {
      "pk": 5003029,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 3,
      "verse": 29,
      "text": "So we remained in the valley opposite Beth-peor.",
      "links": "<a href='/AIV/5/4/46'>Deut. 4:46</a>; <a href='/AIV/4/25/18'>Num. 25:18</a>",
      "comment": "This location marks a place of both sin and renewed covenant, reminding readers of the continual call toward faithfulness and grace."
    }
  ],
  "translatedAt": "2025-12-24T01:57:54.034Z"
}