{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 29,
  "verses": [
    {
      "pk": 5029001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 1,
      "text": "These are the words of the covenant which the LORD commanded Moses to make with the children of Israel in the land of Moab, in addition to the covenant that He made with them at Horeb.",
      "links": "<a href='/AIV/2/24/3-8'>Ex. 24:3-8</a>; <a href='/AIV/5/5/2'>Deut. 5:2</a>",
      "comment": "This verse marks the renewal and continuation of the covenant, building upon the earlier covenant at Horeb (Sinai). It emphasizes continuity and deepening of God’s saving relationship with His people (see Jer. 31:31-34 for New Covenant connections)."
    },
    {
      "pk": 5029002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 2,
      "text": "Moses summoned all Israel and said to them, “You have seen all that the LORD did before your eyes in the land of Egypt, to Pharaoh and to all his servants, and to all his land:",
      "links": "<a href='/AIV/2/7/4-5'>Ex. 7:4-5</a>; <a href='/AIV/5/4/34'>Deut. 4:34</a>",
      "comment": "Moses recalls God’s mighty acts in Egypt, grounding Israel’s faith in concrete historical events. Christian theology often sees these as foreshadowing Christ's ultimate act of salvation."
    },
    {
      "pk": 5029003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 3,
      "text": "the great trials that your eyes saw—those great signs and wonders.",
      "links": "<a href='/AIV/2/7/10'>Ex. 7:10</a>; <a href='/AIV/2/14/31'>Ex. 14:31</a>",
      "comment": "References to signs and wonders call to mind God’s intervention in history, seen later perfectly fulfilled in Jesus’ miracles as signs verifying His mission."
    },
    {
      "pk": 5029004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 4,
      "text": "But to this day, the LORD has not given you a heart to understand, or eyes to see, or ears to hear.",
      "links": "<a href='/AIV/23/6/9-10'>Isa. 6:9-10</a>; <a href='/AIV/40/13/13-15'>Matt. 13:13-15</a>",
      "comment": "Spiritual understanding is ultimately a gift from God. This verse is echoed by prophets and later by Jesus, who challenges His hearers to be open not just in body, but also in heart."
    },
    {
      "pk": 5029005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 5,
      "text": "I have led you forty years in the wilderness. Your clothes did not wear out on you, nor did your sandals wear out on your feet.",
      "links": "<a href='/AIV/5/8/4'>Deut. 8:4</a>; <a href='/AIV/16/9/21'>Neh. 9:21</a>",
      "comment": "God provides for His people in remarkable ways, showing divine care for both spiritual and physical needs, a foreshadowing of Christ’s provision in the Eucharist."
    },
    {
      "pk": 5029006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 6,
      "text": "You ate no bread and drank no wine or strong drink, so that you might know that I am the LORD your God.",
      "links": "<a href='/AIV/2/16/35'>Ex. 16:35</a>; <a href='/AIV/5/8/3'>Deut. 8:3</a>",
      "comment": "Physical signs point beyond themselves: God’s ultimate purpose is that His people know Him. This theme finds its climax where bread and wine gain new significance in the New Testament (<a href='/AIV/40/26/26-29'>Matt. 26:26-29</a>)."
    },
    {
      "pk": 5029007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 7,
      "text": "When you came to this place, Sihon the king of Heshbon and Og the king of Bashan came out against us to battle, but we defeated them.",
      "links": "<a href='/AIV/4/21/21-35'>Num. 21:21-35</a>; <a href='/AIV/5/2/24-37'>Deut. 2:24-37</a>",
      "comment": "Reminding the people of victory over enemies, through God’s power, not their own. Points to the need for reliance upon divine grace."
    },
    {
      "pk": 5029008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 8,
      "text": "We took their land and gave it as an inheritance to the Reubenites, Gadites, and half-tribe of Manasseh.",
      "links": "<a href='/AIV/4/32/33'>Num. 32:33</a>; <a href='/AIV/5/3/12-17'>Deut. 3:12-17</a>",
      "comment": "God’s faithfulness in giving inheritance links to spiritual inheritance promised through Christ (see <a href='/AIV/58/4/1'>Heb. 4:1</a>)."
    },
    {
      "pk": 5029009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 9,
      "text": "Therefore keep the words of this covenant and do them, so that you may prosper in all that you do.",
      "links": "<a href='/AIV/5/4/6'>Deut. 4:6</a>; <a href='/AIV/5/6/24-25'>Deut. 6:24-25</a>",
      "comment": "Obedience to God’s commands is not just an external matter but leads to true flourishing. Jesus later emphasizes faithful living (see <a href='/AIV/40/7/24-25'>Matt. 7:24-25</a>)."
    },
    {
      "pk": 5029010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 10,
      "text": "You all stand today before the LORD your God—the heads of your tribes, your elders, your officers, all the men of Israel,",
      "links": "<a href='/AIV/2/19/17'>Ex. 19:17</a>; <a href='/AIV/6/24/1'>Josh. 24:1</a>",
      "comment": "All the people, leaders and commoners alike, are called to be present before God. This anticipates the unity of God’s people in Christ (see <a href='/AIV/48/3/28'>Gal. 3:28</a>)."
    },
    {
      "pk": 5029011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 11,
      "text": "your children, your wives, and the sojourner who is within your camp, from the one who cuts your wood to the one who draws your water,",
      "links": "<a href='/AIV/5/31/12'>Deut. 31:12</a>; <a href='/AIV/6/8/35'>Josh. 8:35</a>",
      "comment": "The covenant is inclusive, extending even to resident foreigners and those of humble status. Note the spiritual image of God’s kingdom being open to all who seek Him."
    },
    {
      "pk": 5029012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 12,
      "text": "so that you may enter into the covenant of the LORD your God, and into His oath, which the LORD your God is making with you today,",
      "links": "<a href='/AIV/1/15/18'>Gen. 15:18</a>; <a href='/AIV/5/26/17-18'>Deut. 26:17-18</a>",
      "comment": "Participation in the covenant is corporate and personal, reflecting the binding oath God makes with His people—a theme fulfilled in the new and everlasting covenant."
    },
    {
      "pk": 5029013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 13,
      "text": "that He may establish you today as His people, and that He may be your God, as He promised you and as He swore to your fathers, to Abraham, to Isaac, and to Jacob.",
      "links": "<a href='/AIV/1/17/7'>Gen. 17:7</a>; <a href='/AIV/3/26/12'>Lev. 26:12</a>",
      "comment": "Being set apart as God’s own people is rooted in His promises to the patriarchs, fulfilled in belonging to God’s family through faith and sacramental initiation."
    },
    {
      "pk": 5029014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 14,
      "text": "And it is not with you alone that I am making this covenant and this oath,",
      "links": "<a href='/AIV/5/5/3'>Deut. 5:3</a>",
      "comment": "The covenant includes present and future generations, indicating the enduring, visible nature of God’s people on earth."
    },
    {
      "pk": 5029015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 15,
      "text": "but with whoever stands here with us today before the LORD our God, and also with those who are not here with us today.",
      "links": "<a href='/AIV/5/30/6'>Deut. 30:6</a>; <a href='/AIV/44/2/39'>Acts 2:39</a>",
      "comment": "God’s covenantal promise reaches to descendants not yet born and all peoples to be gathered together into one people (see John 10:16 on ‘one flock’)."
    },
    {
      "pk": 5029016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 16,
      "text": "You know how we lived in the land of Egypt, and how we passed through the midst of the nations through which you passed.",
      "links": "<a href='/AIV/2/12/40-41'>Ex. 12:40-41</a>",
      "comment": "Reminding the people of their journey and call to holiness while living among nations, keeping faith pure from compromise."
    },
    {
      "pk": 5029017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 17,
      "text": "You saw their abominations and their idols of wood, stone, silver, and gold, which were among them.",
      "links": "<a href='/AIV/2/20/4-5'>Ex. 20:4-5</a>; <a href='/AIV/19/115/4'>Ps. 115:4</a>",
      "comment": "Idolatry is a persistent danger. God calls for faithfulness to Him alone, an enduring spiritual principle."
    },
    {
      "pk": 5029018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 18,
      "text": "Beware lest there be among you a man or woman, or family or tribe, whose heart turns away today from the LORD our God, to go and serve the gods of those nations, lest there be among you a root bearing bitter and poisonous fruit.",
      "links": "<a href='/AIV/58/12/15'>Heb. 12:15</a>; <a href='/AIV/5/13/13'>Deut. 13:13</a>",
      "comment": "A warning against individuals or groups who turn from God. The New Testament echoes this with language about the dangers of apostasy (<a href='/AIV/58/12/15'>Heb. 12:15</a>)."
    },
    {
      "pk": 5029019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 19,
      "text": "and when he hears the words of this oath, he blesses himself in his heart, saying, ‘I will have peace, though I walk in the stubbornness of my heart.’ This will lead to the sweeping away of the moist with the dry.",
      "links": "<a href='/AIV/23/30/10'>Isa. 30:10</a>; <a href='/AIV/19/19/12'>Ps. 19:12</a>",
      "comment": "\"Peace\" is not found apart from obedience. Secret rebellion affects the whole community—like leaven, a metaphor later used by Jesus."
    },
    {
      "pk": 5029020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 20,
      "text": "The LORD will not be willing to forgive him, but the anger of the LORD and His jealousy will burn against that man, and every curse written in this book will settle upon him, and the LORD will blot out his name from under heaven.",
      "links": "<a href='/AIV/5/28/15-68'>Deut. 28:15-68</a>; <a href='/AIV/66/20/15'>Rev. 20:15</a>",
      "comment": "The consequences of rebellion are severe. Name-blotting appears in both Old and New Testaments, connecting to the Book of Life (<a href='/AIV/66/3/5'>Rev. 3:5</a>)."
    },
    {
      "pk": 5029021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 21,
      "text": "And the LORD will set him apart for calamity out of all the tribes of Israel, according to all the curses of the covenant written in this Book of the Law.",
      "links": "<a href='/AIV/5/28/20-68'>Deut. 28:20-68</a>",
      "comment": "Divine justice maintains holiness among the people, reflecting the seriousness of faithful living within the visible, covenant community."
    },
    {
      "pk": 5029022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 22,
      "text": "The coming generation, your children who rise up after you, and the foreigner who comes from a distant land, will say, when they see the plagues of that land and the sicknesses which the LORD has laid upon it:",
      "links": "<a href='/AIV/5/31/17'>Deut. 31:17</a>; <a href='/AIV/11/9/8'>1 Kgs 9:8</a>",
      "comment": "Future generations and outsiders are impacted by Israel’s covenant faithfulness or lack thereof—reminding us of the witness of the Church to the world."
    },
    {
      "pk": 5029023,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 23,
      "text": "The whole land is brimstone and salt, a burning waste, unsown and unproductive, with no grass growing in it—like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His anger and wrath.",
      "links": "<a href='/AIV/1/19/24-25'>Gen. 19:24-25</a>; <a href='/AIV/28/11/8'>Hos. 11:8</a>",
      "comment": "Covenant unfaithfulness leads to judgment, recalling the fate of Sodom and Gomorrah. These become warnings for all generations (<a href='/AIV/65/1/7'>Jude 7</a>)."
    },
    {
      "pk": 5029024,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 24,
      "text": "All the nations will say, ‘Why has the LORD done this to this land? What caused the heat of this great anger?’",
      "links": "<a href='/AIV/24/22/8-9'>Jer. 22:8-9</a>",
      "comment": "God’s dealings with His people serve as a witness, causing the nations to consider the seriousness of covenant faith."
    },
    {
      "pk": 5029025,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 25,
      "text": "Then people will say, ‘It is because they abandoned the covenant of the LORD, the God of their fathers, which He made with them when He brought them out of the land of Egypt.’",
      "links": "<a href='/AIV/5/28/15'>Deut. 28:15</a>",
      "comment": "Abandoning the covenant brings about calamity—the importance of remaining faithful to God’s promises is a recurring biblical theme."
    },
    {
      "pk": 5029026,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 26,
      "text": "They went and served other gods, and worshiped them, gods whom they had not known and whom He had not allotted to them.",
      "links": "<a href='/AIV/2/20/3'>Ex. 20:3</a>; <a href='/AIV/5/32/17'>Deut. 32:17</a>",
      "comment": "Serving ‘other gods’ is contrasted with worship owed alone to the LORD. In Christian understanding, this points toward the undivided worship in spirit and truth."
    },
    {
      "pk": 5029027,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 27,
      "text": "Therefore the anger of the LORD was kindled against this land, bringing upon it all the curses written in this book.",
      "links": "<a href='/AIV/5/28/15-68'>Deut. 28:15-68</a>",
      "comment": "God’s justice is proportionate. Disobedience to covenantal obligations brings real consequences, reaffirming God’s holiness."
    },
    {
      "pk": 5029028,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 28,
      "text": "And the LORD uprooted them from their land in anger, in fury, and in great wrath, and threw them into another land, as it is this day.",
      "links": "<a href='/AIV/24/52/27'>Jer. 52:27</a>; <a href='/AIV/27/9/7'>Dan. 9:7</a>",
      "comment": "The exile is both an historical warning and spiritual image, reminding the faithful of the need for perseverance and unity in the covenant community."
    },
    {
      "pk": 5029029,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 29,
      "verse": 29,
      "text": "The secret things belong to the LORD our God, but the things that are revealed belong to us and to our children forever, that we may do all the words of this law.",
      "links": "<a href='/AIV/19/25/14'>Ps. 25:14</a>; <a href='/AIV/45/11/33'>Rom. 11:33</a>",
      "comment": "God’s ways are mysterious, yet He graciously reveals what is necessary for salvation. The passage underscores the importance of passing down the faith—both Word and Tradition—to future generations."
    }
  ],
  "translatedAt": "2025-12-24T02:13:20.069Z"
}