{
  "book": 39,
  "bookName": "Jonah",
  "bookAbbreviation": "Jonah",
  "chapter": 4,
  "verses": [
    {
      "pk": 39004001,
      "translation": "AIV",
      "book": 39,
      "bookName": "Jonah",
      "bookAbbreviation": "Jonah",
      "chapter": 4,
      "verse": 1,
      "text": "But this greatly displeased Jonah, and he became angry.",
      "links": "<a href='/AIV/19/106/45'>Ps. 106:45</a>; <a href='/AIV/23/1/24'>Isa. 1:24</a>",
      "comment": "Jonah's anger is in response to God's mercy toward Nineveh. The text displays the struggle between God's justice and mercy, reflecting the tension between human expectation and divine forgiveness. This foreshadows the expansive mercy found in the Gospel (see <a href='/AIV/40/20/1-16'>Matt. 20:1-16</a>)."
    },
    {
      "pk": 39004002,
      "translation": "AIV",
      "book": 39,
      "bookName": "Jonah",
      "bookAbbreviation": "Jonah",
      "chapter": 4,
      "verse": 2,
      "text": "He prayed to the LORD and said, \"O LORD, is this not what I said when I was still in my own land? That is why I was quick to flee to Tarshish. For I knew that you are a gracious and compassionate God, slow to anger and abundant in mercy, and one who relents from sending disaster.\"",
      "links": "<a href='/AIV/2/34/6'>Ex. 34:6</a>; <a href='/AIV/19/86/15'>Ps. 86:15</a>; <a href='/AIV/42/23/34'>Luke 23:34</a>",
      "comment": "Jonah quotes Exodus 34:6, highlighting God's enduring attributes. This verse is significant for understanding God’s willingness to forgive even the most undeserving. As in the New Testament, forgiveness is offered freely to all who repent (<a href='/AIV/42/15/7-10'>Luke 15:7-10</a>)."
    },
    {
      "pk": 39004003,
      "translation": "AIV",
      "book": 39,
      "bookName": "Jonah",
      "bookAbbreviation": "Jonah",
      "chapter": 4,
      "verse": 3,
      "text": "Now, LORD, please take my life from me, for it is better for me to die than to live.",
      "links": "<a href='/AIV/11/19/4'>1 Kings 19:4</a>; <a href='/AIV/19/73/26'>Ps. 73:26</a>",
      "comment": "Jonah's despair recalls Elijah's similar plea. The prophet’s struggle aligns with moments of spiritual turmoil experienced by many throughout Scripture. See the parallel of resignation and unanswered longing in the lives of the prophets."
    },
    {
      "pk": 39004004,
      "translation": "AIV",
      "book": 39,
      "bookName": "Jonah",
      "bookAbbreviation": "Jonah",
      "chapter": 4,
      "verse": 4,
      "text": "But the LORD said, \"Is it right for you to be angry?\"",
      "links": "<a href='/AIV/19/37/8'>Ps. 37:8</a>; <a href='/AIV/40/5/44-45'>Matt. 5:44-45</a>",
      "comment": "God's question invites self-examination. The Lord's pedagogy of asking rather than condemning reveals a path of mercy through questioning. Jesus often asks probing questions to teach and restore (<a href='/AIV/41/8/27'>Mark 8:27</a>)."
    },
    {
      "pk": 39004005,
      "translation": "AIV",
      "book": 39,
      "bookName": "Jonah",
      "bookAbbreviation": "Jonah",
      "chapter": 4,
      "verse": 5,
      "text": "So Jonah went out of the city and sat down east of it. There he made a shelter for himself and sat under its shade, waiting to see what would happen to the city.",
      "links": "<a href='/AIV/19/91/1'>Ps. 91:1</a>",
      "comment": "Jonah’s withdrawal portrays expectation for judgment rather than mercy. The act of waiting is reminiscent of intercessors anticipating God’s direction. In spiritual reading, or 'lectio', the posture of waiting can indicate openness to God's unfolding will."
    },
    {
      "pk": 39004006,
      "translation": "AIV",
      "book": 39,
      "bookName": "Jonah",
      "bookAbbreviation": "Jonah",
      "chapter": 4,
      "verse": 6,
      "text": "Then the LORD God appointed a plant, and it grew up over Jonah to give shade for his head and relieve his discomfort. Jonah was exceedingly glad because of the plant.",
      "links": "<a href='/AIV/19/121/5-6'>Ps. 121:5-6</a>",
      "comment": "The Lord’s provision reveals both mercy and teaching. Like the manna in the desert (<a href='/AIV/2/16/4'>Ex. 16:4</a>), God provides physical and spiritual relief, teaching reliance on divine generosity and the sacraments as heavenly sustenance."
    },
    {
      "pk": 39004007,
      "translation": "AIV",
      "book": 39,
      "bookName": "Jonah",
      "bookAbbreviation": "Jonah",
      "chapter": 4,
      "verse": 7,
      "text": "But at dawn the next day, God appointed a worm that attacked the plant, so that it withered.",
      "links": "<a href='/AIV/19/90/6'>Ps. 90:6</a>",
      "comment": "God's sovereignty extends to creation, using even a worm for His purpose. This shows how God can use suffering or loss to teach greater truths. Related themes in Scripture: the fleeting nature of earthly comfort (<a href='/AIV/19/103/15-16'>Ps. 103:15-16</a>)."
    },
    {
      "pk": 39004008,
      "translation": "AIV",
      "book": 39,
      "bookName": "Jonah",
      "bookAbbreviation": "Jonah",
      "chapter": 4,
      "verse": 8,
      "text": "When the sun rose, God appointed a scorching east wind, and the sun beat down on Jonah’s head so that he grew faint. He wished to die and said, \"It is better for me to die than to live.\"",
      "links": "<a href='/AIV/19/121/6'>Ps. 121:6</a>; <a href='/AIV/19/102/4'>Ps. 102:4</a>; <a href='/AIV/40/26/38'>Matt. 26:38</a>",
      "comment": "Jonah's suffering points to the interior struggle of surrendering control to God. Suffering in Scripture often leads to deeper conversion, and is presented with spiritual purpose (cf. Jesus' agony in the garden, <a href='/AIV/40/26/38'>Matt. 26:38</a>)."
    },
    {
      "pk": 39004009,
      "translation": "AIV",
      "book": 39,
      "bookName": "Jonah",
      "bookAbbreviation": "Jonah",
      "chapter": 4,
      "verse": 9,
      "text": "But God said to Jonah, \"Is it right for you to be angry about the plant?\" And he said, \"It is right for me to be angry, even to death.\"",
      "links": "<a href='/AIV/19/73/3'>Ps. 73:3</a>; <a href='/AIV/24/12/1'>Jer. 12:1</a>",
      "comment": "God continues to guide Jonah through questions, inviting him to recognize the limits of his perspective and the breadth of divine mercy. The contrast between Jonah’s justice and God’s mercy echoes Jesus’ teaching on loving enemies (see <a href='/AIV/40/5/43-48'>Matt. 5:43-48</a>)."
    },
    {
      "pk": 39004010,
      "translation": "AIV",
      "book": 39,
      "bookName": "Jonah",
      "bookAbbreviation": "Jonah",
      "chapter": 4,
      "verse": 10,
      "text": "The LORD said, \"You have been concerned about the plant, though you did not labor for it or make it grow. It came up in a night and perished in a night.\"",
      "links": "<a href='/AIV/19/39/5'>Ps. 39:5</a>; <a href='/AIV/19/127/1'>Ps. 127:1</a>",
      "comment": "The Lord teaches about the nature of grace and gift---receiving without earning. This parallels the New Testament conception of salvation as freely given, not merited (<a href='/AIV/45/3/24'>Rom. 3:24</a>)."
    },
    {
      "pk": 39004011,
      "translation": "AIV",
      "book": 39,
      "bookName": "Jonah",
      "bookAbbreviation": "Jonah",
      "chapter": 4,
      "verse": 11,
      "text": "And should I not have concern for Nineveh, that great city, in which there are more than a hundred and twenty thousand persons who cannot tell their right hand from their left, and also many animals?",
      "links": "<a href='/AIV/19/36/6'>Ps. 36:6</a>; <a href='/AIV/42/19/41-44'>Luke 19:41-44</a>",
      "comment": "God’s compassion extends universally, embracing even the ignorant and the unworthy. This signals the universality of salvation, fulfilled in Christ, who weeps over Jerusalem (<a href='/AIV/42/19/41-44'>Luke 19:41-44</a>). Mercy triumphs over judgment (see <a href='/AIV/59/2/13'>James 2:13</a>)."
    }
  ],
  "translatedAt": "2025-12-24T09:47:07.209Z"
}