{
  "book": 46,
  "bookName": "Malachi",
  "bookAbbreviation": "Mal",
  "chapter": 4,
  "verses": [
    {
      "pk": 46004001,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 4,
      "verse": 1,
      "text": "For look, the day is coming, burning like a furnace, when all the arrogant and every evildoer will be stubble. And the coming day will set them ablaze, says the LORD of hosts, so that it will leave them neither root nor branch.",
      "links": "<a href='/AIV/23/66/15'>Isaiah 66:15</a>; <a href='/AIV/40/13/40'>Matt. 13:40</a>; <a href='/AIV/19/21/9'>Ps. 21:9</a>",
      "comment": "This verse describes the coming Day of the LORD—a time of final judgment when the wicked will be utterly destroyed (cf. Isaiah 66:15; Matthew 13:40). In the Jewish context, God's justice purifies the land. Christian interpreters see this as a foreshadowing of the Final Judgment at Christ's return, when evil will be removed completely. The imagery of fire points both to God's purifying judgment and the eschatological hope that evil will not endure."
    },
    {
      "pk": 46004002,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 4,
      "verse": 2,
      "text": "But for you who fear my name, the sun of righteousness will rise with healing in its wings; you will go out leaping like calves released from the stall.",
      "links": "<a href='/AIV/19/84/11'>Ps. 84:11</a>; <a href='/AIV/42/1/78'>Luke 1:78</a>; <a href='/AIV/40/9/35'>Matt. 9:35</a>",
      "comment": "Here the 'sun of righteousness' is understood by many early Christian interpreters as a prophecy of Christ, who brings light and healing to the righteous (see Luke 1:78). The imagery recalls joyful freedom and restoration, themes fulfilled in the New Covenant. The healing in God's wings suggests both spiritual and bodily restoration, foreshadowing the holistic redemption offered through Christ. This verse subtly echoes the continuing presence of God with his people in a tangible, visible manner, as seen in sacramental theology."
    },
    {
      "pk": 46004003,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 4,
      "verse": 3,
      "text": "You will tread down the wicked, for they will be ashes under the soles of your feet on the day when I act, says the LORD of hosts.",
      "links": "<a href='/AIV/19/91/13'>Ps. 91:13</a>; <a href='/AIV/45/16/20'>Rom. 16:20</a>",
      "comment": "The victory over evil is not merely defensive; God's faithful people are depicted as sharing in his triumph, treading upon evil. See also Romans 16:20 where the spiritual victory is connected to Christ's ultimate conquest of Satan. This promise offers hope for vindication for God's people and points to the inheritance of the righteous in God's kingdom, a theme echoed in the New Testament."
    },
    {
      "pk": 46004004,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 4,
      "verse": 4,
      "text": "Remember the law of my servant Moses, the statutes and judgments that I commanded him at Horeb for all Israel.",
      "links": "<a href='/AIV/05/4/10'>Deut. 4:10</a>; <a href='/AIV/02/19/8'>Ex. 19:8</a>; <a href='/AIV/40/5/17'>Matt. 5:17</a>",
      "comment": "The call to remember Moses' law ties together prophetic expectation with covenant faithfulness. In Christian understanding, Christ fulfills and perfects the law (Matthew 5:17). The mention of Horeb recalls the giving of the covenant, emphasizing continuity in God's saving plan from old to new. This continuity is preserved in the ongoing tradition and teaching throughout the ages."
    },
    {
      "pk": 46004005,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 4,
      "verse": 5,
      "text": "Look, I am sending Elijah the prophet to you before the great and awesome day of the LORD comes.",
      "links": "<a href='/AIV/11/2/11'>2 Kings 2:11</a>; <a href='/AIV/40/17/10-13'>Matt. 17:10-13</a>; <a href='/AIV/42/1/17'>Luke 1:17</a>",
      "comment": "Elijah's promised return is interpreted in the New Testament as fulfilled in John the Baptist (Matthew 17:10-13; Luke 1:17), who prepared the way for Christ. But many Christian theologians hold that this prophecy also looks forward to a final return, signifying God's ongoing guidance of His people through appointed leaders and prophetic voices, a pattern that continues throughout history in various forms."
    },
    {
      "pk": 46004006,
      "translation": "AIV",
      "book": 46,
      "bookName": "Malachi",
      "bookAbbreviation": "Mal",
      "chapter": 4,
      "verse": 6,
      "text": "He will turn the hearts of fathers to their children and the hearts of children to their fathers, so that I will not come and strike the land with total destruction.",
      "links": "<a href='/AIV/42/1/17'>Luke 1:17</a>; <a href='/AIV/39/2/16'>Mal. 2:16</a>",
      "comment": "This verse closes the prophetic canon with a call to reconciliation and restoration, a movement central to the Gospel. John the Baptist fulfills this ministry by calling people to repentance and renewal of relationship (Luke 1:17), paving the way for Christ. God's redemptive plan is one of family unity and the restoration of broken relationships, a theme that finds its ultimate fulfillment in the Church as a spiritual family where reconciliation is made manifest."
    }
  ],
  "translatedAt": "2025-12-24T10:01:34.569Z"
}