{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 19,
  "verses": [
    {
      "pk": 5019001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 1,
      "text": "When the LORD your God destroys the nations whose land the LORD your God is giving you, and you dispossess them and settle in their cities and houses,",
      "links": "<a href='/AIV/2/23/20-31'>Ex. 23:20-31</a>; <a href='/AIV/5/7/1'>Deut. 7:1</a>",
      "comment": "This verse marks the transition of Israel from nomadic life to a settled inheritance, which points to God fulfilling His covenant promise to Abraham (Gen. 15:18-21). The grant of cities also prefigures the fullness of the promised kingdom under God's appointed leadership."
    },
    {
      "pk": 5019002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 2,
      "text": "you shall set aside for yourself three cities in the land the LORD your God is giving you to possess.",
      "links": "<a href='/AIV/4/35/6'>Num. 35:6</a>; <a href='/AIV/6/20/2'>Josh. 20:2</a>",
      "comment": "These cities are called cities of refuge (cf. Num. 35). God provides for both justice and mercy in His law, and this system anticipates Christ, our ultimate Refuge (Heb. 6:18)."
    },
    {
      "pk": 5019003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 3,
      "text": "Prepare the roads for yourself and divide into three parts the land the LORD your God is giving you as an inheritance, so that any manslayer can flee there.",
      "links": "<a href='/AIV/4/35/11-15'>Num. 35:11-15</a>",
      "comment": "The roads were to be well-kept, emphasizing the accessibility of mercy. This anticipates the open invitation to repentance and forgiveness in Christ (Rom. 5:20)."
    },
    {
      "pk": 5019004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 4,
      "text": "This is the case of the manslayer who may flee there and live: whoever kills his neighbor unintentionally, without having hated him in the past—",
      "links": "<a href='/AIV/4/35/22-23'>Num. 35:22-23</a>",
      "comment": "Distinguishing between accidental and intentional killing shows God's justice and mercy. Sin committed in ignorance is treated differently (cf. 1 Tim. 1:13), reflecting the need for repentance and confession."
    },
    {
      "pk": 5019005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 5,
      "text": "as when someone goes with his neighbor into the forest to cut wood, and his hand swings the axe to cut a tree, and the head slips from the handle and strikes his neighbor and he dies—he may flee to one of these cities and live.",
      "links": "<a href='/AIV/4/35/25'>Num. 35:25</a>",
      "comment": "This concrete example teaches that unintentional sin has a remedy. In the Church, confession reconciles us to the community and to God through proper means."
    },
    {
      "pk": 5019006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 6,
      "text": "Otherwise, the avenger of blood might pursue the manslayer in anger and overtake him, since the distance is great, and strike him dead, although he was not deserving of death, since he had not hated him in the past.",
      "links": "<a href='/AIV/6/20/5'>Josh. 20:5</a>",
      "comment": "The close tie between justice and mercy avoids both anarchy and personal vengeance. The system of cities of refuge reflects the Church's role as protector against unjust punishment."
    },
    {
      "pk": 5019007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 7,
      "text": "Therefore I command you, set aside three cities for yourself.",
      "links": "<a href='/AIV/4/35/13'>Num. 35:13</a>",
      "comment": "God's explicit command shows the importance of mercy and legal sanctuary. The number three recalls the fullness of protection, also hinted at in the New Testament in Peter's threefold affirmation (John 21:15-17)."
    },
    {
      "pk": 5019008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 8,
      "text": "If the LORD your God enlarges your territory, as He swore to your fathers, and gives you all the land He promised to give your fathers—",
      "links": "<a href='/AIV/1/15/7-8'>Gen. 15:7-8</a>; <a href='/AIV/1/17/8'>Gen. 17:8</a>",
      "comment": "This points to the covenant faithfulness of God, who fulfills every promise. The expansion of borders is a subtle type of the universal scope of God's salvation plan."
    },
    {
      "pk": 5019009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 9,
      "text": "if you keep all these commandments that I command you today, to love the LORD your God and to walk always in His ways, then you shall add three more cities to these three,",
      "links": "<a href='/AIV/5/6/5'>Deut. 6:5</a>; <a href='/AIV/5/11/22'>Deut. 11:22</a>",
      "comment": "Expansion of mercy goes alongside growth in obedience and love. The interconnection of law, love, and expansion finds its fulfillment in the ministry and sacraments of Christ, extending access to grace."
    },
    {
      "pk": 5019010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 10,
      "text": "so that innocent blood will not be shed in the midst of the land the LORD your God is giving you as an inheritance, and so that there will be no guilt of bloodshed upon you.",
      "links": "<a href='/AIV/4/35/33'>Num. 35:33</a>",
      "comment": "Shedding innocent blood pollutes the land. This principle underlies the Church's later teaching on the sanctity of life (cf. Matt. 5:21; Jas. 2:11)."
    },
    {
      "pk": 5019011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 11,
      "text": "But if anyone hates his neighbor, lies in wait for him, attacks him, and strikes him so that he dies, and he flees into one of these cities,",
      "links": "<a href='/AIV/4/35/16-21'>Num. 35:16-21</a>",
      "comment": "Premeditated murder is distinguished from accidental killing. God demands both mercy and justice—a theme Jesus amplifies (cf. Matt. 5:21-22)."
    },
    {
      "pk": 5019012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 12,
      "text": "then the elders of his city shall send and take him from there, and deliver him into the hand of the avenger of blood, that he may die.",
      "links": "<a href='/AIV/6/20/6'>Josh. 20:6</a>",
      "comment": "The elders have the responsibility to judge serious cases. This teaches the importance of legitimate, apostolic authority in applying justice and excommunication (cf. Matt. 18:17-18)."
    },
    {
      "pk": 5019013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 13,
      "text": "Your eye shall not pity him, but you shall purge the guilt of innocent blood from Israel, so that it may go well with you.",
      "links": "<a href='/AIV/5/13/8'>Deut. 13:8</a>; <a href='/AIV/5/17/7'>Deut. 17:7</a>",
      "comment": "This stern measure emphasizes the seriousness of murder and the need for justice. Purification of the community is necessary for continued blessing."
    },
    {
      "pk": 5019014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 14,
      "text": "You shall not move your neighbor’s boundary marker, which the ancestors have set, in your inheritance that you receive in the land the LORD your God is giving you to possess.",
      "links": "<a href='/AIV/20/22/28'>Prov. 22:28</a>; <a href='/AIV/23/5/8'>Isa. 5:8</a>",
      "comment": "Respect for ancestral boundaries teaches justice and respect for tradition. It also reflects on the importance of maintaining the faith as handed down (cf. 2 Thes. 2:15)."
    },
    {
      "pk": 5019015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 15,
      "text": "A single witness shall not rise up against a man concerning any crime or any sin he commits; at the mouth of two or three witnesses a matter shall be established.",
      "links": "<a href='/AIV/4/35/30'>Num. 35:30</a>; <a href='/AIV/40/18/16'>Matt. 18:16</a>",
      "comment": "The requirement for two or three witnesses safeguards against false accusations. This principle is reaffirmed by Jesus and Paul (cf. 2 Cor. 13:1), vital for doctrinal and disciplinary processes."
    },
    {
      "pk": 5019016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 16,
      "text": "If a malicious witness rises up against someone to accuse him of wrongdoing,",
      "links": "<a href='/AIV/5/27/24'>Deut. 27:24</a>",
      "comment": "The law addresses perjury, revealing God's desire for truth in all communities—a theme echoed in Christ's warnings against false witness (cf. Matt. 19:18)."
    },
    {
      "pk": 5019017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 17,
      "text": "then both the men involved in the dispute shall stand before the LORD, before the priests and the judges who are in office in those days.",
      "links": "<a href='/AIV/5/17/9'>Deut. 17:9</a>",
      "comment": "This verse highlights priestly and judicial mediation. The involvement of priests in judgment hints at the later role of ordained leaders as spiritual judges and guardians of the faith."
    },
    {
      "pk": 5019018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 18,
      "text": "The judges shall investigate thoroughly. If the witness is a false witness and has testified falsely against his brother,",
      "links": "<a href='/AIV/5/1/16'>Deut. 1:16</a>",
      "comment": "Careful, just inquiry is key to the legal and spiritual life of the community. The idea that truth must be established by proper authority is carried on in apostolic practice."
    },
    {
      "pk": 5019019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 19,
      "text": "then you shall do to him as he intended to do to his brother. So you shall purge the evil from among you.",
      "links": "<a href='/AIV/5/13/5'>Deut. 13:5</a>; <a href='/AIV/5/17/7'>Deut. 17:7</a>",
      "comment": "The law of retribution ('lex talionis') here is applied to false witnesses, ensuring justice and removing evil. Jesus upholds justice but teaches us its fulfilment is in mercy and reconciliation (cf. Matt. 5:38-39)."
    },
    {
      "pk": 5019020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 20,
      "text": "And the rest shall hear and fear, and never again do such an evil thing among you.",
      "links": "<a href='/AIV/5/13/11'>Deut. 13:11</a>",
      "comment": "Stern judgment has a deterrent effect. The passage points to the seriousness of communal holiness, which underlies later teaching on discipline and excommunication."
    },
    {
      "pk": 5019021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 19,
      "verse": 21,
      "text": "Your eye shall not pity. Life for life, eye for eye, tooth for tooth, hand for hand, foot for foot.",
      "links": "<a href='/AIV/2/21/23-25'>Ex. 21:23-25</a>; <a href='/AIV/40/5/38-39'>Matt. 5:38-39</a>",
      "comment": "The principle of equal justice is foundational. In the New Testament, Jesus both affirms the justice of the law, yet brings its fullness in the call to forgiveness and love—law perfected in mercy."
    }
  ],
  "translatedAt": "2025-12-24T02:07:10.581Z"
}