{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 2,
  "verses": [
    {
      "pk": 5002001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 1,
      "text": "Then we turned back and set out toward the wilderness by the way of the Red Sea, as the LORD had told me, and for many days we traveled around Mount Seir.",
      "links": "<a href='/AIV/2/14/2'>Ex. 14:2</a>; <a href='/AIV/4/33/36'>Num. 33:36</a>",
      "comment": "The wilderness journey emphasizes obedience to God's directions, with parallels to Israel's Exodus and continuous testing in the wilderness (see also Matthew 4:1, where Christ is tested in the wilderness)."
    },
    {
      "pk": 5002002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 2,
      "text": "Then the LORD said to me:",
      "links": "<a href='/AIV/4/14/25'>Num. 14:25</a>",
      "comment": "God's direct speech shows divine guidance. Moses as intercessor prefigures Christ’s own mediation."
    },
    {
      "pk": 5002003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 3,
      "text": "'You have wandered around this mountain long enough; turn northward,’",
      "links": "<a href='/AIV/5/1/6'>Deut. 1:6</a>",
      "comment": "This signals a new phase in salvation history. The command echoes the call to move out of complacency toward God’s promises."
    },
    {
      "pk": 5002004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 4,
      "text": "and give the people this command: 'You are about to pass through the territory of your brothers, the descendants of Esau, who live in Seir, and they will be afraid of you. So be very careful.",
      "links": "<a href='/AIV/1/36/6-8'>Gen. 36:6-8</a>; <a href='/AIV/4/20/14'>Num. 20:14</a>",
      "comment": "Here, God refers to the Edomites as 'brothers,' reminding Israel of their kinship with Esau through Isaac. This highlights the importance of unity and respect even with those outside the chosen lineage."
    },
    {
      "pk": 5002005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 5,
      "text": "Do not provoke them, for I will not give you any of their land, not even enough to set foot on. I have given Mount Seir as a possession to Esau.",
      "links": "<a href='/AIV/5/23/7'>Deut. 23:7</a>; <a href='/AIV/1/36/8'>Gen. 36:8</a>",
      "comment": "God appoints an inheritance even for those outside the chosen people, foreshadowing the hope of salvation extending to all nations. See also Acts 10:34-35."
    },
    {
      "pk": 5002006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 6,
      "text": "You are to buy food from them with silver so that you may eat, and you will also buy water from them with silver so that you may drink.",
      "links": "<a href='/AIV/4/20/19'>Num. 20:19</a>",
      "comment": "Relying on peaceful exchange—and not seizing by force—mirrors the Christian call to charity and justice in all dealings (cf. Romans 12:18)."
    },
    {
      "pk": 5002007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 7,
      "text": "For the LORD your God has blessed you in all the work of your hands. He knows your journey through this great wilderness. These forty years the LORD your God has been with you; you have lacked nothing.",
      "links": "<a href='/AIV/4/14/33'>Num. 14:33</a>; <a href='/AIV/5/8/2-4'>Deut. 8:2–4</a>",
      "comment": "The forty years prefigure Lent's forty days and recall God’s faithful provision. Christ, too, was forty days in the wilderness (Luke 4:1-2)."
    },
    {
      "pk": 5002008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 8,
      "text": "So we passed by our brothers, the descendants of Esau, who lived in Seir, avoiding the way of the Arabah from Elath and Ezion-geber. Then we turned and went by the way of the wilderness of Moab.",
      "links": "<a href='/AIV/4/33/35'>Num. 33:35</a>",
      "comment": "The obedience shown here is central; God’s people move as He directs, showing a recognition of authority higher than themselves."
    },
    {
      "pk": 5002009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 9,
      "text": "Then the LORD said to me, 'Do not harass the Moabites or provoke them to war, for I will not give you any part of their land. I have given Ar to the descendants of Lot as a possession.’",
      "links": "<a href='/AIV/1/19/36-38'>Gen. 19:36-38</a>; <a href='/AIV/4/21/13'>Num. 21:13</a>",
      "comment": "Lot, like Esau, receives a promise from God, showing the Creator's faithfulness and the importance of familial bonds and covenants."
    },
    {
      "pk": 5002010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 10,
      "text": "(The Emim formerly lived there—a people great and many, and tall as the Anakim.",
      "links": "<a href='/AIV/4/13/33'>Num. 13:33</a>",
      "comment": "Reference to giants symbolizes formidable obstacles in God’s plan, yet God’s will prevails. These themes echo the coming of Christ, who overcomes all enemies."
    },
    {
      "pk": 5002011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 11,
      "text": "They were also regarded as Rephaim, as the Anakim are, but the Moabites call them Emim.",
      "links": "<a href='/AIV/1/14/5'>Gen. 14:5</a>",
      "comment": "Different names for similar peoples underscore Israel’s unique perspective but acknowledge shared history with surrounding nations."
    },
    {
      "pk": 5002012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 12,
      "text": "The Horites previously lived in Seir, but the descendants of Esau dispossessed and destroyed them and settled in their place, as Israel did to the land of their inheritance, which the LORD gave to them.)",
      "links": "<a href='/AIV/1/14/6'>Gen. 14:6</a>",
      "comment": "Israel’s conquest is compared to that of Esau’s descendants, emphasizing God’s sovereignty in allotting land and nations."
    },
    {
      "pk": 5002013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 13,
      "text": "Now rise up and cross the brook Zered.’ So we crossed the brook Zered.",
      "links": "<a href='/AIV/4/21/12'>Num. 21:12</a>",
      "comment": "Crossing boundaries marks progress in faith. Such thresholds foreshadow Christian sacraments marking transition and movement toward God’s promise."
    },
    {
      "pk": 5002014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 14,
      "text": "The days from our departure from Kadesh-barnea until we crossed the brook Zered were thirty-eight years, until the entire generation of men of war perished from the camp, as the LORD had sworn to them.",
      "links": "<a href='/AIV/4/32/13'>Num. 32:13</a>; <a href='/AIV/5/1/46'>Deut. 1:46</a>",
      "comment": "God’s judgment and mercy are both manifest: the faithless generation passes away, but hope and promise are preserved for the next."
    },
    {
      "pk": 5002015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 15,
      "text": "The hand of the LORD was against them, to destroy them from the camp until they had perished.",
      "links": "<a href='/AIV/4/14/29-35'>Num. 14:29-35</a>",
      "comment": "Divine discipline is for the sake of bringing about God’s purpose and reflects both justice and an underlying call to repentance."
    },
    {
      "pk": 5002016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 16,
      "text": "So it was, when all the men of war had perished and died from among the people,",
      "links": "<a href='/AIV/4/26/65'>Num. 26:65</a>",
      "comment": "A new generation is prepared to enter the promise. Spiritual renewal often comes after cleansing and renewal, seen throughout salvation history."
    },
    {
      "pk": 5002017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 17,
      "text": "that the LORD spoke to me, saying,",
      "links": "",
      "comment": "Moses’ continued communication with God is a model for the prophetic tradition—mediating God’s word to the people."
    },
    {
      "pk": 5002018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 18,
      "text": "'Today you are to cross the border of Moab at Ar.",
      "links": "<a href='/AIV/4/21/13-15'>Num. 21:13-15</a>",
      "comment": "God’s timing and place for entrance reinforce the importance of divine initiative in human affairs."
    },
    {
      "pk": 5002019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 19,
      "text": "When you approach the people of Ammon, do not harass them or provoke them, for I will not give you any of the land of the people of Ammon as a possession, because I have given it to the descendants of Lot as a possession.’",
      "links": "<a href='/AIV/1/19/36-38'>Gen. 19:36-38</a>",
      "comment": "God remains faithful to His covenants, even to those outside Israel, hinting at a universal scope to His saving plan."
    },
    {
      "pk": 5002020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 20,
      "text": "(That also is counted as the land of Rephaim. Rephaim formerly lived there, but the Ammonites call them Zamzummim,",
      "links": "<a href='/AIV/1/14/5'>Gen. 14:5</a>",
      "comment": "Again, multiple names highlight an interconnected ancient world and the complexity of biblical history."
    },
    {
      "pk": 5002021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 21,
      "text": "a people great and many, and tall as the Anakim. But the LORD destroyed them before the Ammonites, so that they dispossessed them and lived in their place,",
      "links": "<a href='/AIV/4/21/24'>Num. 21:24</a>",
      "comment": "God’s sovereignty over all nations is shown, hinting at a divine plan where all history is providentially guided."
    },
    {
      "pk": 5002022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 22,
      "text": "just as he did for the descendants of Esau, who live in Seir, when he destroyed the Horites before them; so they dispossessed them and have lived in their place to this day.",
      "links": "<a href='/AIV/1/36/8'>Gen. 36:8</a>",
      "comment": "Patterns repeat: God displaces nations to fulfill His purposes. This foreshadows future transitions, such as the spread of the Christian faith among the nations."
    },
    {
      "pk": 5002023,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 23,
      "text": "And the Avvim, who lived in villages as far as Gaza, were destroyed by the Caphtorim, who came from Caphtor, and lived in their place.)",
      "links": "<a href='/AIV/1/10/14'>Gen. 10:14</a>",
      "comment": "The mention of distant peoples affirms God’s involvement in a global history, pointing ultimately to a kingdom that gathers all nations."
    },
    {
      "pk": 5002024,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 24,
      "text": "‘Rise up, take your journey, and cross over the Valley of the Arnon. See, I have given into your hand Sihon the Amorite, king of Heshbon, and his land. Begin to take possession, and engage him in battle.",
      "links": "<a href='/AIV/4/21/21-24'>Num. 21:21-24</a>",
      "comment": "Israel’s conquest begins only at God’s command. Authority and inheritance come not by presumption but by divine grant—a principle echoed in the establishment of true spiritual authority."
    },
    {
      "pk": 5002025,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 25,
      "text": "This day I will begin to put the dread and fear of you upon the peoples under the whole heaven, who shall hear the report of you and tremble and be in anguish because of you.’",
      "links": "<a href='/AIV/6/2/9-11'>Josh. 2:9-11</a>",
      "comment": "God’s intervention changes hearts and reputations, just as later miraculous works in the early Church spread awe and conviction (Acts 2:43-47)."
    },
    {
      "pk": 5002026,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 26,
      "text": "So I sent messengers from the wilderness of Kedemoth to Sihon king of Heshbon with words of peace, saying,",
      "links": "<a href='/AIV/4/21/21'>Num. 21:21</a>",
      "comment": "Approaching with peace before war demonstrates the priority of reconciliation (see Matthew 5:9)."
    },
    {
      "pk": 5002027,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 27,
      "text": "'Let me pass through your land. I will only go by the road; I will turn neither to the right nor to the left.",
      "links": "<a href='/AIV/4/20/17'>Num. 20:17</a>",
      "comment": "A respectful request for passage reflects a spirit of humility and order."
    },
    {
      "pk": 5002028,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 28,
      "text": "You shall sell me food for money, so that I may eat, and give me water for money, so that I may drink; only let me pass through on foot,",
      "links": "<a href='/AIV/4/20/19'>Num. 20:19</a>",
      "comment": "The repetition of fair dealings signals God’s concern for integrity in even the smallest matters. Material needs are to be met justly."
    },
    {
      "pk": 5002029,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 29,
      "text": "as the sons of Esau who live in Seir and the Moabites who live in Ar did for me, until I cross the Jordan into the land that the LORD our God is giving to us.'",
      "links": "<a href='/AIV/4/21/22'>Num. 21:22</a>",
      "comment": "The journey is toward a promise—land given by God. The motif of inheritance by grace is fundamental to the biblical message."
    },
    {
      "pk": 5002030,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 30,
      "text": "But Sihon king of Heshbon would not let us pass by him, for the LORD your God had hardened his spirit and made his heart obstinate, that He might give him into your hand, as he has done this day.",
      "links": "<a href='/AIV/2/4/21'>Ex. 4:21</a>; <a href='/AIV/4/21/23'>Num. 21:23</a>",
      "comment": "Even opposition is under God’s providence, similar to Pharaoh whose heart was hardened (Exodus 7:13). This event points to divine sovereignty over human events."
    },
    {
      "pk": 5002031,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 31,
      "text": "And the LORD said to me, 'Behold, I have begun to give Sihon and his land over to you. Begin to possess it, so that you may inherit his land.'",
      "links": "<a href='/AIV/4/21/34'>Num. 21:34</a>",
      "comment": "The transfer of inheritance is at God’s command, anticipating future patterns of spiritual inheritance (cf. Ephesians 1:11)."
    },
    {
      "pk": 5002032,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 32,
      "text": "Then Sihon came out against us, he and all his people, to fight at Jahaz.",
      "links": "<a href='/AIV/4/21/23'>Num. 21:23</a>",
      "comment": "Conflict comes despite peaceful offers; Israel’s vocation sometimes meets resistance even when acting justly."
    },
    {
      "pk": 5002033,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 33,
      "text": "And the LORD our God delivered him over to us, and we struck him down, along with his sons and all his people.",
      "links": "<a href='/AIV/4/21/24'>Num. 21:24</a>",
      "comment": "Victory comes from God, not by Israel’s own strength. This foreshadows Christ’s victory over sin and death."
    },
    {
      "pk": 5002034,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 34,
      "text": "We captured all his cities at that time and devoted every city to destruction—men, women, and children. We left no survivor.",
      "links": "<a href='/AIV/6/6/21'>Josh. 6:21</a>",
      "comment": "The 'herem' or devotion to destruction is commanded by God as judgment. It is a difficult but definitive aspect of Old Testament justice, to be read typologically (see comment on Heb. 10:31)."
    },
    {
      "pk": 5002035,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 35,
      "text": "We took only the livestock as plunder for ourselves, along with the spoil of the cities we had captured.",
      "links": "<a href='/AIV/4/21/35'>Num. 21:35</a>",
      "comment": "Material goods are allowed as spoil, distinguishing between people (devoted) and possessions (permitted). Spiritual discernment is necessary in applying such principles."
    },
    {
      "pk": 5002036,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 36,
      "text": "From Aroer, which is on the edge of the Valley of the Arnon, and from the town that is by the valley, as far as Gilead, there was not a city too strong for us; the LORD our God delivered everything into our hands.",
      "links": "<a href='/AIV/4/21/24'>Num. 21:24</a>",
      "comment": "God’s omnipotence is manifest. Spiritual conquests are accomplished not by human might, but by the Lord (Zechariah 4:6)."
    },
    {
      "pk": 5002037,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 2,
      "verse": 37,
      "text": "But you did not go near to the land of the people of Ammon, any part of the banks of the river Jabbok, or the cities of the hill country, or wherever the LORD our God had forbidden us.",
      "links": "<a href='/AIV/4/21/24'>Num. 21:24</a>",
      "comment": "Strict adherence to God’s instructions underscores the importance of authority and obedience—a pattern reaffirmed in the New Testament (Acts 5:29)."
    }
  ],
  "translatedAt": "2025-12-24T01:57:22.589Z"
}