{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 1,
  "verses": [
    {
      "pk": 5001001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 1,
      "text": "These are the words Moses spoke to all Israel across the Jordan in the wilderness, in the Arabah opposite Suph, between Paran, Tophel, Laban, Hazeroth, and Dizahab.",
      "links": "<a href='/AIV/4/33/48-49'>Num. 33:48-49</a>",
      "comment": "This introduction sets the scene for Moses’ final addresses to Israel. The location details root these speeches in history, highlighting continuity in God’s plan."
    },
    {
      "pk": 5001002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 2,
      "text": "It is eleven days’ journey from Horeb by way of Mount Seir to Kadesh-Barnea.",
      "links": "<a href='/AIV/1/16/1'>Gen. 16:1</a>; <a href='/AIV/4/13/26'>Num. 13:26</a>",
      "comment": "Moses reminds Israel of the short physical distance their journey should have taken, compared to the forty years due to their unfaithfulness."
    },
    {
      "pk": 5001003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 3,
      "text": "In the fortieth year, in the eleventh month, on the first day of the month, Moses spoke to the children of Israel according to all that the LORD had commanded him concerning them.",
      "links": "<a href='/AIV/4/33/38'>Num. 33:38</a>",
      "comment": "The timeline shows the importance of obedience, as the Israelites enter the promised land after a long period due to their lack of faith."
    },
    {
      "pk": 5001004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 4,
      "text": "After he had defeated Sihon king of the Amorites, who dwelt in Heshbon, and Og king of Bashan, who lived at Ashtaroth and Edrei.",
      "links": "<a href='/AIV/4/21/21-35'>Num. 21:21-35</a>",
      "comment": "God’s victories over Sihon and Og demonstrate His authority and faithfulness, prefiguring final victory over evil (see <a href='/AIV/66/19/19-21'>Rev. 19:19-21</a>)."
    },
    {
      "pk": 5001005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 5,
      "text": "Beyond the Jordan, in the land of Moab, Moses began to explain this law, saying:",
      "links": "<a href='/AIV/5/27/8'>Deut. 27:8</a>",
      "comment": "Moses expounds the Law; the act of explaining and teaching points toward the importance of true interpretation maintained by leaders given authority by God."
    },
    {
      "pk": 5001006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 6,
      "text": "The LORD our God spoke to us at Horeb, saying, 'You have stayed long enough at this mountain.'",
      "links": "<a href='/AIV/2/19/1'>Ex. 19:1</a>",
      "comment": "'Horeb' is Sinai, where the covenant was given, illustrating the continuous guidance of God through specific places and times."
    },
    {
      "pk": 5001007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 7,
      "text": "'Turn and take your journey, and go to the hill country of the Amorites, and to all their neighbors in the Arabah, in the hill country, in the lowlands, in the Negev, and by the seacoast, the land of the Canaanites, and Lebanon, as far as the great river, the river Euphrates.'",
      "links": "<a href='/AIV/1/15/18'>Gen. 15:18</a>",
      "comment": "The land described matches God’s ancient promise to Abraham, reinforcing the reality and physicality of the covenant."
    },
    {
      "pk": 5001008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 8,
      "text": "'See, I have set the land before you. Go in and possess the land which the LORD swore to your fathers—to Abraham, to Isaac, and to Jacob—to give to them and to their descendants after them.'",
      "links": "<a href='/AIV/1/26/3'>Gen. 26:3</a>; <a href='/AIV/1/28/13'>Gen. 28:13</a>",
      "comment": "God’s faithfulness to the patriarchs is emphasized. The inheritance is for both the fathers and their descendants, typifying Christ’s spiritual inheritance to His people (see <a href='/AIV/48/3/29'>Gal. 3:29</a>)."
    },
    {
      "pk": 5001009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 9,
      "text": "Then I spoke to you at that time, saying, 'I am not able to bear you by myself.'",
      "links": "<a href='/AIV/2/18/18'>Ex. 18:18</a>",
      "comment": "Moses’ humility and awareness of his limitations points forward to the need for divinely established leadership among God’s people."
    },
    {
      "pk": 5001010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 10,
      "text": "'The LORD your God has multiplied you, and today you are as numerous as the stars of heaven.'",
      "links": "<a href='/AIV/1/15/5'>Gen. 15:5</a>; <a href='/AIV/1/22/17'>Gen. 22:17</a>",
      "comment": "God’s promise of countless descendants to Abraham is being fulfilled."
    },
    {
      "pk": 5001011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 11,
      "text": "May the LORD, the God of your ancestors, make you a thousand times as many as you are, and bless you, as he has promised you!",
      "links": "<a href='/AIV/1/12/2'>Gen. 12:2</a>",
      "comment": "Moses expresses a prayer of abundance; divine blessing is presented as ongoing and generous."
    },
    {
      "pk": 5001012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 12,
      "text": "How can I bear by myself the weight and burden of you and your strife?",
      "links": "<a href='/AIV/2/18/18'>Ex. 18:18</a>",
      "comment": "Moses’ acknowledgment of his need for help foreshadows how God structures His people through order, authority, and wise counsel."
    },
    {
      "pk": 5001013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 13,
      "text": "'Choose for yourselves wise and understanding men, well known among your tribes, and I will appoint them as your heads.'",
      "links": "<a href='/AIV/2/18/21'>Ex. 18:21</a>",
      "comment": "The delegation of authority foreshadows the necessity of a continuing governing structure in the worshiping community."
    },
    {
      "pk": 5001014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 14,
      "text": "And you answered me, 'The thing that you have spoken is good for us to do.'",
      "links": "",
      "comment": "The people’s agreement with Moses reveals the value of unity and obedience to established leadership."
    },
    {
      "pk": 5001015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 15,
      "text": "So I took the heads of your tribes, wise and experienced men, and set them as heads over you—leaders of thousands, of hundreds, of fifties, of tens, and officers for your tribes.",
      "links": "<a href='/AIV/2/18/25-26'>Ex. 18:25-26</a>",
      "comment": "Structured leadership arises from divine appointment and communal discernment; this is the foundation for orderly worship and governance."
    },
    {
      "pk": 5001016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 16,
      "text": "And I charged your judges at that time, saying, 'Hear cases between your brothers, and judge righteously between each man and his brother or the foreigner who is with him.'",
      "links": "<a href='/AIV/2/23/6-7'>Ex. 23:6-7</a>",
      "comment": "God’s command for just judgment includes both Israelites and foreigners, prefiguring the universality of salvation."
    },
    {
      "pk": 5001017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 17,
      "text": "'You shall not show partiality in judgment; you shall hear the small and the great alike. You shall not be afraid of any man, for the judgment is God’s. The case that is too hard for you, bring to me, and I will hear it.'",
      "links": "<a href='/AIV/3/19/15'>Lev. 19:15</a>",
      "comment": "Justice as a reflection of God’s righteousness; Moses’ role points forward to the ultimate Judge who will fulfill the Law (Christ as mediator, cf. <a href='/AIV/54/2/5'>1 Tim. 2:5</a>)."
    },
    {
      "pk": 5001018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 18,
      "text": "And I commanded you at that time all the things that you should do.",
      "links": "",
      "comment": "Moses gives all necessary instruction, symbolizing the sufficiency and completeness of divine revelation through God’s appointed mediators."
    },
    {
      "pk": 5001019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 19,
      "text": "So we set out from Horeb and went through all that great and terrifying wilderness that you saw, on the way to the hill country of the Amorites, as the LORD our God commanded us; and we came to Kadesh-Barnea.",
      "links": "<a href='/AIV/4/10/12'>Num. 10:12</a>; <a href='/AIV/4/13/26'>Num. 13:26</a>",
      "comment": "The hardship of the wilderness journey prepares Israel for the promised inheritance, much like trials purify faith."
    },
    {
      "pk": 5001020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 20,
      "text": "And I said to you, 'You have come to the hill country of the Amorites, which the LORD our God is giving us.'",
      "links": "",
      "comment": "God’s act of giving is highlighted; faith requires the people to receive God’s gift."
    },
    {
      "pk": 5001021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 21,
      "text": "'See, the LORD your God has set the land before you. Go up, take possession, as the LORD, the God of your fathers, has spoken to you. Do not be afraid and do not be discouraged.'",
      "links": "<a href='/AIV/6/1/9'>Josh. 1:9</a>",
      "comment": "The call to courage in faith echoes throughout Scripture, climaxing in Christ’s encouragement to His disciples."
    },
    {
      "pk": 5001022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 22,
      "text": "Then all of you came near to me and said, 'Let us send men ahead of us to spy out the land and bring us back word as to which way we should go up and what cities we shall come to.'",
      "links": "<a href='/AIV/4/13/1-3'>Num. 13:1-3</a>",
      "comment": "The people’s initiative shows both prudence and lack of full trust, as God had already promised victory."
    },
    {
      "pk": 5001023,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 23,
      "text": "The thing seemed good to me, and I took twelve men from you, one man from each tribe.",
      "links": "<a href='/AIV/4/13/4-16'>Num. 13:4-16</a>",
      "comment": "The twelve spies are typological of the twelve apostles, sent to prepare the way for God’s kingdom."
    },
    {
      "pk": 5001024,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 24,
      "text": "And they turned and went up into the hill country, and came to the Valley of Eshcol, and spied it out.",
      "links": "<a href='/AIV/4/13/23'>Num. 13:23</a>",
      "comment": "Eshcol means ‘cluster’, referring to the fruitfulness of the land—a sign of God’s promise."
    },
    {
      "pk": 5001025,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 25,
      "text": "And they took some of the fruit of the land in their hands and brought it down to us, and brought us word again, and said, 'It is a good land that the LORD our God is giving us.'",
      "links": "<a href='/AIV/4/13/27'>Num. 13:27</a>",
      "comment": "The goodness of the land points to the abundance of God’s gifts—an image of spiritual blessings in Christ."
    },
    {
      "pk": 5001026,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 26,
      "text": "Yet you would not go up, but rebelled against the command of the LORD your God.",
      "links": "<a href='/AIV/4/14/1-4'>Num. 14:1-4</a>",
      "comment": "Unbelief and rebellion cause exclusion from God’s blessings, echoing the necessity of both faith and obedience."
    },
    {
      "pk": 5001027,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 27,
      "text": "And you murmured in your tents and said, 'Because the LORD hates us, he has brought us out of the land of Egypt, to give us into the hand of the Amorites, to destroy us.'",
      "links": "<a href='/AIV/4/14/2-3'>Num. 14:2-3</a>",
      "comment": "Murmuring shows a lack of trust in God’s intentions—a recurring theme and a warning in the New Testament (see <a href='/AIV/46/10/10'>1 Cor. 10:10</a>)."
    },
    {
      "pk": 5001028,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 28,
      "text": "'Where are we going up? Our brothers have made our hearts melt, saying, ‘The people are greater and taller than we. The cities are great and fortified up to heaven. Also, we have seen the sons of the Anakim there.’'",
      "links": "<a href='/AIV/4/13/28'>Num. 13:28</a>",
      "comment": "Fear based on appearances contrasts with faith founded on God’s promises. Mention of the 'Anakim' (giants) highlights Israel’s inability versus God’s power."
    },
    {
      "pk": 5001029,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 29,
      "text": "Then I said to you, 'Do not be terrified, and do not be afraid of them.'",
      "links": "",
      "comment": "Throughout Scripture, God calls His people to courage based on His faithfulness, ultimately fulfilled in Christ’s victory over sin and death."
    },
    {
      "pk": 5001030,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 30,
      "text": "'The LORD your God who goes before you will Himself fight for you, just as He did for you in Egypt before your eyes,'",
      "links": "<a href='/AIV/2/14/14'>Ex. 14:14</a>",
      "comment": "The Lord fights for His people—a type of Christ as redeemer and the leader of salvation."
    },
    {
      "pk": 5001031,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 31,
      "text": "'and in the wilderness, where you have seen how the LORD your God carried you, as a man carries his son, all the way you went until you came to this place.'",
      "links": "<a href='/AIV/2/19/4'>Ex. 19:4</a>",
      "comment": "God’s fatherly care for Israel prefigures the intimate relationship believers have through adoption in Christ (<a href='/AIV/45/8/15'>Rom. 8:15</a>)."
    },
    {
      "pk": 5001032,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 32,
      "text": "Yet in spite of this word, you did not trust the LORD your God,",
      "links": "<a href='/AIV/4/14/11'>Num. 14:11</a>",
      "comment": "Persistent unbelief is a fundamental human problem only overcome through grace and faith."
    },
    {
      "pk": 5001033,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 33,
      "text": "who went ahead of you in the way, to seek you out a place to pitch your tents, in fire by night and in the cloud by day, to show you the way you should go.",
      "links": "<a href='/AIV/2/13/21'>Ex. 13:21</a>",
      "comment": "God’s presence guides Israel visibly; a type of the indwelling and guidance of the Holy Spirit."
    },
    {
      "pk": 5001034,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 34,
      "text": "When the LORD heard your words, he was angry and swore,",
      "links": "<a href='/AIV/4/14/22-23'>Num. 14:22-23</a>",
      "comment": "God’s just anger demonstrates the seriousness of sin and the consequences for lack of faith."
    },
    {
      "pk": 5001035,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 35,
      "text": "'Not one of these men of this evil generation shall see the good land that I swore to give to your fathers,'",
      "links": "<a href='/AIV/4/14/23'>Num. 14:23</a>",
      "comment": "Entry into the promised land requires faith and perseverance; parallels with entrance into eternal life through grace."
    },
    {
      "pk": 5001036,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 36,
      "text": "except Caleb the son of Jephunneh; he shall see it, and to him and his children I will give the land on which he has trodden, because he has wholly followed the LORD.'",
      "links": "<a href='/AIV/4/14/24'>Num. 14:24</a>",
      "comment": "Caleb's faithfulness is rewarded; this models persevering in faith and loyalty to God’s commands."
    },
    {
      "pk": 5001037,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 37,
      "text": "The LORD was also angry with me because of you, and said, 'You also shall not go in there.'",
      "links": "<a href='/AIV/4/20/12'>Num. 20:12</a>",
      "comment": "Even Moses faces consequences for his actions, emphasizing the seriousness of obedience and the need for an intercessor."
    },
    {
      "pk": 5001038,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 38,
      "text": "Joshua the son of Nun, who stands before you, he shall enter; encourage him, for he shall cause Israel to inherit it.",
      "links": "<a href='/AIV/6/1/2-6'>Josh. 1:2-6</a>",
      "comment": "Joshua’s leadership foreshadows Jesus (the same name in Hebrew), who brings God’s people into the ultimate inheritance."
    },
    {
      "pk": 5001039,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 39,
      "text": "And as for your little ones, who you said would become prey, and your children, who today have no knowledge of good or evil, they shall go in there. To them I will give it, and they shall possess it.",
      "links": "<a href='/AIV/4/14/31'>Num. 14:31</a>",
      "comment": "God’s justice spares the innocent, showing His mercy, and anticipates the call of children and 'the least' in the New Covenant."
    },
    {
      "pk": 5001040,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 40,
      "text": "But as for yourselves, turn, and journey into the wilderness by the way to the Red Sea.'",
      "links": "<a href='/AIV/4/14/25'>Num. 14:25</a>",
      "comment": "The people are sent back into the wilderness, symbolizing penance and purification before God’s promise can be fulfilled."
    },
    {
      "pk": 5001041,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 41,
      "text": "Then you answered and said to me, 'We have sinned against the LORD; we will go up and fight, just as the LORD our God commanded us.' And each of you put on his weapons, considering it an easy thing to go up into the hill country.",
      "links": "<a href='/AIV/4/14/40-44'>Num. 14:40-44</a>",
      "comment": "Attempting to obey after rejecting God’s timing leads to failure, showing that true obedience is both in action and in trust."
    },
    {
      "pk": 5001042,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 42,
      "text": "And the LORD said to me, 'Say to them, Do not go up or fight, for I am not among you, lest you be defeated before your enemies.'",
      "links": "<a href='/AIV/4/14/42'>Num. 14:42</a>",
      "comment": "Success depends on God’s presence; without Him, human effort is fruitless."
    },
    {
      "pk": 5001043,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 43,
      "text": "So I spoke to you, but you would not listen. You rebelled against the command of the LORD, and presumptuously went up into the hill country.",
      "links": "<a href='/AIV/4/14/44'>Num. 14:44</a>",
      "comment": "Disobedience to God’s direct command—even in apparent piety—brings disaster; obedience is better than sacrifice (<a href='/AIV/9/15/22'>1 Sam. 15:22</a>)."
    },
    {
      "pk": 5001044,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 44,
      "text": "Then the Amorites who lived in that hill country came out against you and chased you as bees do, and struck you down in Seir as far as Hormah.",
      "links": "<a href='/AIV/4/14/45'>Num. 14:45</a>",
      "comment": "The defeat here is direct consequence of disregarding God’s presence and command."
    },
    {
      "pk": 5001045,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 45,
      "text": "And you returned and wept before the LORD, but the LORD did not listen to your voice or give ear to you.",
      "links": "<a href='/AIV/4/14/45'>Num. 14:45</a>",
      "comment": "There are times when sorrow comes too late; repentance must be sincere and timely (cf. <a href='/AIV/58/12/17'>Heb. 12:17</a>)."
    },
    {
      "pk": 5001046,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 1,
      "verse": 46,
      "text": "So you remained at Kadesh many days, the days that you remained there.",
      "links": "<a href='/AIV/4/20/1'>Num. 20:1</a>",
      "comment": "Israel’s delay is the result of unbelief and rebellion. The path to the promise passes through purification and submission to God’s way."
    }
  ],
  "translatedAt": "2025-12-24T01:56:39.576Z"
}