{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 9,
  "verses": [
    {
      "pk": 5009001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 1,
      "text": "Hear, Israel! You are crossing the Jordan today, to go in and dispossess nations greater and mightier than you, cities great and fortified up to heaven.",
      "links": "<a href='/AIV/6/3/10'>Josh. 3:10</a>; <a href='/AIV/1/15/16-21'>Gen. 15:16-21</a>",
      "comment": "This sets the context of Israel’s entry into the Promised Land, underscoring the impossible odds, which prepare us to see God's work through weakness—a theme that will echo in later Scripture (see 2 Cor. 12:9)."
    },
    {
      "pk": 5009002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 2,
      "text": "A people great and tall, the descendants of the Anakim, whom you know and of whom you have heard it said, 'Who can stand before the children of Anak?'",
      "links": "<a href='/AIV/4/13/28'>Num. 13:28</a>; <a href='/AIV/4/13/33'>Num. 13:33</a>",
      "comment": "The Anakim represented overwhelming physical strength. This links to the theme that salvation and victory come by grace, not human power; a subtle foreshadowing of Christ’s victory over sin (Rom. 5:6)."
    },
    {
      "pk": 5009003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 3,
      "text": "Know today that the LORD your God is he who goes before you as a consuming fire. He will destroy them and subdue them before you. So you shall drive them out and make them perish quickly, as the LORD has promised you.",
      "links": "<a href='/AIV/2/15/7'>Ex. 15:7</a>; <a href='/AIV/6/3/10'>Josh. 3:10</a>",
      "comment": "God’s presence described as a consuming fire points to His holiness and power. This image parallels the Holy Spirit in Acts 2:3-4, showing God’s active, purifying role throughout salvation history."
    },
    {
      "pk": 5009004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 4,
      "text": "Do not say in your heart, after the LORD your God has driven them out before you, 'It is because of my righteousness the LORD has brought me in to possess this land.' But it is because of the wickedness of these nations that the LORD is driving them out before you.",
      "links": "<a href='/AIV/45/3/27'>Rom. 3:27</a>; <a href='/AIV/51/2/12'>Col. 2:12</a>",
      "comment": "Israel is warned of spiritual pride, teaching that God’s gifts are not earned—an early pointer to justification by grace, not works (Eph. 2:8-9). The idea prepares for the fuller revelation of grace."
    },
    {
      "pk": 5009005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 5,
      "text": "It is not by your righteousness or the uprightness of your heart that you are going in to possess their land, but because of the wickedness of these nations the LORD your God is driving them out before you, and that he may confirm the word that the LORD swore to your fathers, to Abraham, Isaac, and Jacob.",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/1/26/3'>Gen. 26:3</a>; <a href='/AIV/1/28/13'>Gen. 28:13</a>",
      "comment": "This reveals that God's faithfulness to His promise is central. God acts for His covenant's sake—and this foreshadows a mediating, covenantal grace that is fulfilled fully in Christ (Gal. 3:16)."
    },
    {
      "pk": 5009006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 6,
      "text": "Know, therefore, that the LORD your God is not giving you this good land to possess because of your righteousness, for you are a stiff-necked people.",
      "links": "<a href='/AIV/2/32/9'>Ex. 32:9</a>; <a href='/AIV/44/7/51'>Acts 7:51</a>",
      "comment": "The term 'stiff-necked' emphasizes repeated resistance to God’s will—implying the need for deep transformation. Spiritual renewal, not mere outward observance, is needed—a hint toward God’s interior work (Jer. 31:33)."
    },
    {
      "pk": 5009007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 7,
      "text": "Remember, and do not forget, how you provoked the LORD your God to wrath in the wilderness. From the day you left the land of Egypt until you came to this place, you have been rebellious against the LORD.",
      "links": "<a href='/AIV/2/14/11'>Ex. 14:11</a>; <a href='/AIV/4/14/2'>Num. 14:2</a>",
      "comment": "The call to remember past failures is the beginning of repentance and humility—both crucial for genuine faith and ongoing sanctification (James 4:6-10)."
    },
    {
      "pk": 5009008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 8,
      "text": "Even at Horeb you provoked the LORD to wrath, and the LORD was angry enough with you to destroy you.",
      "links": "<a href='/AIV/2/32/9-10'>Ex. 32:9-10</a>",
      "comment": "Horeb (Mount Sinai) is the setting of the golden calf incident, a stark example of rebellion. The narrative reveals both human sinfulness and God’s justice."
    },
    {
      "pk": 5009009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 9,
      "text": "When I went up the mountain to receive the tablets of stone, the tablets of the covenant which the LORD made with you, I stayed on the mountain forty days and forty nights; I neither ate bread nor drank water.",
      "links": "<a href='/AIV/2/24/18'>Ex. 24:18</a>; <a href='/AIV/2/34/28'>Ex. 34:28</a>; <a href='/AIV/40/4/2'>Matt. 4:2</a>",
      "comment": "Moses’ forty-day fast prefigures other biblical fasts, including Jesus’ own, modeling intercessory prayer and self-denial—elements of spiritual discipline still vital for believers."
    },
    {
      "pk": 5009010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 10,
      "text": "The LORD gave me the two tablets of stone written with the finger of God; and on them were all the words which the LORD had spoken with you on the mountain out of the midst of the fire on the day of the assembly.",
      "links": "<a href='/AIV/2/31/18'>Ex. 31:18</a>; <a href='/AIV/2/19/17-19'>Ex. 19:17-19</a>",
      "comment": "God’s finger signifies direct divine action (see Luke 11:20). The written law is seen as the embodiment of God’s will, a precursor to the ‘Word made flesh’ (John 1:14)."
    },
    {
      "pk": 5009011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 11,
      "text": "At the end of forty days and forty nights, the LORD gave me the two tablets of stone, the tablets of the covenant.",
      "links": "<a href='/AIV/2/34/28-29'>Ex. 34:28-29</a>",
      "comment": "Emphasis on the covenant highlights God’s desire to bind Himself to His people. This anticipates the New Covenant, fulfilled in Christ (Heb. 8:6-13)."
    },
    {
      "pk": 5009012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 12,
      "text": "Then the LORD said to me, 'Arise, go down quickly from here, for your people whom you brought out of Egypt have corrupted themselves. They have quickly turned aside from the way which I commanded them. They have made themselves a molded image.'",
      "links": "<a href='/AIV/2/32/7-8'>Ex. 32:7-8</a>",
      "comment": "The sin of idolatry is described as sudden and total. This reinforces the tragic reality of turning from God, and the dangers of self-chosen worship."
    },
    {
      "pk": 5009013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 13,
      "text": "The LORD spoke to me, saying, 'I have seen this people, and indeed, they are a stiff-necked people.'",
      "links": "<a href='/AIV/2/32/9'>Ex. 32:9</a>; <a href='/AIV/4/14/11'>Num. 14:11</a>",
      "comment": "Repetition of 'stiff-necked' crystalizes the concept of deep-seated resistance—only God's grace can heal such a condition (Ezek. 36:26)."
    },
    {
      "pk": 5009014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 14,
      "text": "'Let me alone, that I may destroy them and blot out their name from under heaven. And I will make of you a nation mightier and greater than they.'",
      "links": "<a href='/AIV/2/32/10'>Ex. 32:10</a>; <a href='/AIV/4/14/12'>Num. 14:12</a>",
      "comment": "This threat of judgment shows God’s justice. Moses’ subsequent intercession reveals the power of prayer and mediation—important spiritual themes."
    },
    {
      "pk": 5009015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 15,
      "text": "So I turned and went down from the mountain, while the mountain was burning with fire. The two tablets of the covenant were in my two hands.",
      "links": "<a href='/AIV/2/32/15'>Ex. 32:15</a>",
      "comment": "Visual imagery recalls God’s presence and the seriousness of the covenant. It also connects later to the transfiguration in the New Testament (Matt. 17:1-6)."
    },
    {
      "pk": 5009016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 16,
      "text": "And I looked, and behold, you had sinned against the LORD your God. You had made yourselves a molded calf. You had turned aside quickly from the way that the LORD had commanded you.",
      "links": "<a href='/AIV/2/32/19-20'>Ex. 32:19-20</a>",
      "comment": "The molded calf incident emphasizes the gravity of idolatry. Idolatry is a recurring spiritual danger, which the New Testament reinterprets as covetousness (Col. 3:5)."
    },
    {
      "pk": 5009017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 17,
      "text": "So I took the two tablets and threw them out of my two hands and broke them before your eyes.",
      "links": "<a href='/AIV/2/32/19'>Ex. 32:19</a>",
      "comment": "Breaking the tablets is symbolic of breaking the covenant. Physical signs accompany spiritual realities in biblical revelation—informing later sacramental theology."
    },
    {
      "pk": 5009018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 18,
      "text": "Then I fell down before the LORD as at the first, forty days and forty nights; I neither ate bread nor drank water, because of all your sin which you had committed, doing what was evil in the sight of the LORD to provoke him to anger.",
      "links": "<a href='/AIV/2/34/28'>Ex. 34:28</a>",
      "comment": "Moses’ repeated intercession, involving another forty days of fasting, highlights the perseverance of prayer and the mediation of the chosen leader—a theme fulfilled by Christ’s perfect mediation (1 Tim. 2:5)."
    },
    {
      "pk": 5009019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 19,
      "text": "For I was afraid of the anger and hot displeasure with which the LORD was angry against you to destroy you. But the LORD listened to me that time also.",
      "links": "<a href='/AIV/2/32/14'>Ex. 32:14</a>; <a href='/AIV/4/14/20'>Num. 14:20</a>",
      "comment": "God’s willingness to hear the prayer of His appointed mediator illustrates His mercy working through ordained means—a motif contributing to the understanding of intercessory prayer and the communion of saints (Rev. 5:8)."
    },
    {
      "pk": 5009020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 20,
      "text": "And the LORD was very angry with Aaron, and was ready to destroy him; so I prayed for Aaron also at the same time.",
      "links": "<a href='/AIV/2/32/21-24'>Ex. 32:21-24</a>",
      "comment": "Aaron’s failure as high priest points to the need for a faithful and sinless high priest, ultimately fulfilled in Christ (Heb. 4:15)."
    },
    {
      "pk": 5009021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 21,
      "text": "Then I took your sin, the calf which you had made, and burned it with fire and crushed it, grinding it very small until it was as fine as dust; and I threw its dust into the brook that descended from the mountain.",
      "links": "<a href='/AIV/2/32/20'>Ex. 32:20</a>",
      "comment": "The destruction of the idol is thorough, signifying complete repentance. Water crossing and cleansing is a recurring biblical symbol, foundational for sacramental allusions."
    },
    {
      "pk": 5009022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 22,
      "text": "At Taberah and at Massah and at Kibroth-hattaavah, you provoked the LORD to wrath.",
      "links": "<a href='/AIV/4/11/1-35'>Num. 11:1-35</a>; <a href='/AIV/2/17/7'>Ex. 17:7</a>",
      "comment": "The references recall episodes of rebellion and testing, meant to instruct on perseverance and trust—layered with meaning for the spiritual journey of the Church."
    },
    {
      "pk": 5009023,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 23,
      "text": "And when the LORD sent you from Kadesh Barnea, saying, 'Go up and possess the land which I have given you,' then you rebelled against the command of the LORD your God, and did not believe him nor obey his voice.",
      "links": "<a href='/AIV/4/13/26'>Num. 13:26</a>; <a href='/AIV/4/14/1-4'>Num. 14:1-4</a>",
      "comment": "Faith and obedience are inseparable. The failure at Kadesh Barnea points forward to the absolute necessity of trust in God’s Word—a truth Jesus affirms (John 6:28-29)."
    },
    {
      "pk": 5009024,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 24,
      "text": "You have been rebellious against the LORD from the day that I knew you.",
      "links": "<a href='/AIV/2/14/11'>Ex. 14:11</a>; <a href='/AIV/4/14/22'>Num. 14:22</a>",
      "comment": "The persistent theme of rebellion makes God’s perseverance clear. God's steadfast love is thus foundational, as later celebrated in the Psalms (Ps. 136)."
    },
    {
      "pk": 5009025,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 25,
      "text": "So I fell down before the LORD the forty days and forty nights, as I had done before, because the LORD had said he would destroy you.",
      "links": "<a href='/AIV/2/34/28'>Ex. 34:28</a>",
      "comment": "Moses models persevering intercession and humility before God, something reflected in the ministry and prayer of leaders throughout biblical history."
    },
    {
      "pk": 5009026,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 26,
      "text": "And I prayed to the LORD, and said, 'O Lord GOD, do not destroy your people and your inheritance, whom you have redeemed through your greatness, whom you brought out of Egypt with a mighty hand.'",
      "links": "<a href='/AIV/2/32/11'>Ex. 32:11</a>",
      "comment": "Moses appeals to God’s redeeming actions and inheritance, echoing themes of ransom and belonging, which find their perfect fulfillment in Christ (Eph. 1:7)."
    },
    {
      "pk": 5009027,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 27,
      "text": "'Remember your servants, Abraham, Isaac, and Jacob. Do not look at the stubbornness of this people, or at their wickedness or their sin,'",
      "links": "<a href='/AIV/2/32/13'>Ex. 32:13</a>",
      "comment": "Moses intercedes through the merits of the patriarchs, showing the importance of faithfulness and the idea of God remembering His promises to chosen vessels—spiritual forebears of the faith."
    },
    {
      "pk": 5009028,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 28,
      "text": "Lest the land from which you brought us say, 'Because the LORD was not able to bring them into the land which he promised them, and because he hated them, he has brought them out to kill them in the wilderness.'",
      "links": "<a href='/AIV/2/32/12'>Ex. 32:12</a>; <a href='/AIV/4/14/16'>Num. 14:16</a>",
      "comment": "Concern for God’s reputation among the nations foreshadows the role of God’s people as witnesses (Matt. 5:16), reminding us that communal faithfulness has broader purpose."
    },
    {
      "pk": 5009029,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 9,
      "verse": 29,
      "text": "Yet they are your people and your inheritance, whom you brought out by your great power and by your outstretched arm.",
      "links": "<a href='/AIV/2/6/6'>Ex. 6:6</a>; <a href='/AIV/2/32/11'>Ex. 32:11</a>",
      "comment": "Israel is described with terms of belonging and redemption, emphasizing salvation by divine initiative—an ongoing truth for all believers. The language of ‘inheritance’ will become a major New Testament theme (1 Pet. 1:4)."
    }
  ],
  "translatedAt": "2025-12-24T02:01:56.765Z"
}