{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 31,
  "verses": [
    {
      "pk": 5031001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 1,
      "text": "So Moses went and spoke these words to all Israel.",
      "links": "<a href='/AIV/3/27/1'>Lev. 27:1</a>",
      "comment": "This begins Moses' final words to Israel as he prepares to hand over leadership. The motif of a departing leader handing authority to a successor echoes throughout both Old and New Testaments."
    },
    {
      "pk": 5031002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 2,
      "text": "And he said to them, “I am one hundred and twenty years old today. I am no longer able to go out and come in. And the Lord has said to me, ‘You shall not cross this Jordan.’”",
      "links": "<a href='/AIV/4/20/12'>Num. 20:12</a>; <a href='/AIV/5/34/7'>Deut. 34:7</a>",
      "comment": "Moses’ age is significant, representing fullness and completion. He accepts God’s judgment and prepares Israel for the transition of leadership."
    },
    {
      "pk": 5031003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 3,
      "text": "The Lord your God himself will go over before you. He will destroy these nations before you, and you shall dispossess them. And Joshua will go before you, just as the Lord has spoken.",
      "links": "<a href='/AIV/6/1/5'>Josh. 1:5</a>; <a href='/AIV/5/3/28'>Deut. 3:28</a>",
      "comment": "The direct involvement of God in leading His people is emphasized. Joshua, as Moses' chosen successor, prefigures the importance of apostolic succession."
    },
    {
      "pk": 5031004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 4,
      "text": "And the Lord will do to them as he did to Sihon and Og, the kings of the Amorites, and to their land, when he destroyed them.",
      "links": "<a href='/AIV/4/21/21-35'>Num. 21:21-35</a>",
      "comment": "Reminds Israel of God’s past faithfulness and victories, bolstering confidence for the future."
    },
    {
      "pk": 5031005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 5,
      "text": "The Lord will give them over to you, and you shall do to them according to all the commandment that I have commanded you.",
      "links": "<a href='/AIV/2/23/31'>Ex. 23:31</a>",
      "comment": "God’s sovereignty in granting victory is repeated. Israel must follow divine instruction, not their own plans."
    },
    {
      "pk": 5031006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 6,
      "text": "Be strong and courageous. Do not fear or be in dread of them, for it is the Lord your God who goes with you. He will not leave you or forsake you.",
      "links": "<a href='/AIV/6/1/5'>Josh. 1:5</a>; <a href='/AIV/13/28/20'>1 Chron. 28:20</a>; <a href='/AIV/58/13/5'>Heb. 13:5</a>",
      "comment": "The assurance of God's presence is echoed by Jesus in the New Testament (see Matt. 28:20), showing how God's promises endure."
    },
    {
      "pk": 5031007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 7,
      "text": "Then Moses summoned Joshua and said to him in the sight of all Israel, 'Be strong and courageous, for you shall go with this people into the land that the Lord has sworn to their fathers to give them, and you shall put them in possession of it.'",
      "links": "<a href='/AIV/6/1/6'>Josh. 1:6</a>; <a href='/AIV/1/28/13'>Gen. 28:13</a>",
      "comment": "A public appointment ensures unity and continuity among God's people. The laying on of hands in later tradition is foreshadowed here."
    },
    {
      "pk": 5031008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 8,
      "text": "It is the Lord who goes before you. He will be with you; he will not leave you or abandon you. Do not fear or be dismayed.",
      "links": "<a href='/AIV/6/1/5-6'>Josh. 1:5-6</a>; <a href='/AIV/13/28/20'>1 Chron. 28:20</a>",
      "comment": "Repetition of God's steadfast presence to Joshua anticipates Christ's promise to be with His people always."
    },
    {
      "pk": 5031009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 9,
      "text": "So Moses wrote down this Law and gave it to the priests, the sons of Levi, who carried the ark of the covenant of the Lord, and to all the elders of Israel.",
      "links": "<a href='/AIV/6/8/35'>Josh. 8:35</a>; <a href='/AIV/2/25/16'>Ex. 25:16</a>",
      "comment": "The preservation and reading of God’s Word through authorized ministers points to the centrality of tradition and authority for transmitting the faith."
    },
    {
      "pk": 5031010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 10,
      "text": "And Moses commanded them, 'At the end of every seven years, at the appointed time in the year of release, at the Feast of Booths,",
      "links": "<a href='/AIV/3/23/34-43'>Lev. 23:34-43</a>; <a href='/AIV/2/23/16'>Ex. 23:16</a>",
      "comment": "There is a liturgical rhythm and cycle to the reading of Scripture. Regular, communal proclamation of God’s Word is vital."
    },
    {
      "pk": 5031011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 11,
      "text": "when all Israel comes to appear before the Lord your God at the place that he will choose, you shall read this Law before all Israel in their hearing.",
      "links": "<a href='/AIV/3/23/42'>Lev. 23:42</a>; <a href='/AIV/5/12/5'>Deut. 12:5</a>",
      "comment": "A specific place chosen by God for worship emphasizes unity of worship and the importance of a central authority in the faith community."
    },
    {
      "pk": 5031012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 12,
      "text": "Assemble the people—men, women, and little ones, and the sojourner within your towns—that they may hear and learn to fear the Lord your God, and be careful to do all the words of this Law,",
      "links": "<a href='/AIV/2/12/49'>Ex. 12:49</a>; <a href='/AIV/3/25/10'>Lev. 25:10</a>",
      "comment": "Gathering all people, including foreigners, shows the inclusive scope of God’s covenant and the public proclamation of the Law—a continual tradition in both Testaments."
    },
    {
      "pk": 5031013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 13,
      "text": "and that their children, who have not known it, may hear and learn to fear the Lord your God, as long as you live in the land that you are going over the Jordan to possess.",
      "links": "<a href='/AIV/5/6/7'>Deut. 6:7</a>",
      "comment": "The education of children in the faith is foundational. This principle continues in the teaching and sacramental life of the believing community."
    },
    {
      "pk": 5031014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 14,
      "text": "And the Lord said to Moses, 'Behold, the day is coming when you must die. Call Joshua, and present yourselves in the tent of meeting, that I may commission him.' So Moses and Joshua went and presented themselves in the tent of meeting.",
      "links": "<a href='/AIV/4/27/18-23'>Num. 27:18-23</a>",
      "comment": "Divine commissioning takes place in the presence of God and the congregation, showing sacramental signs that accompany authoritative transitions."
    },
    {
      "pk": 5031015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 15,
      "text": "And the Lord appeared in the Tent in a pillar of cloud, and the pillar of cloud stood over the entrance of the tent.",
      "links": "<a href='/AIV/2/40/34-38'>Ex. 40:34-38</a>",
      "comment": "God’s tangible presence is made known through visible signs, prefiguring later incarnational manifestations."
    },
    {
      "pk": 5031016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 16,
      "text": "And the Lord said to Moses, 'Behold, you are about to lie down with your fathers. Then these people will rise and whore after the foreign gods among them in the land that they are entering, and they will forsake me and break my covenant that I have made with them.'",
      "links": "<a href='/AIV/7/2/17'>Judg. 2:17</a>; <a href='/AIV/2/34/15'>Ex. 34:15</a>",
      "comment": "The foretelling of Israel’s apostasy connects with repeated cycles of faithfulness and infidelity throughout Scripture, mirroring the need for perseverance and continual repentance."
    },
    {
      "pk": 5031017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 17,
      "text": "Then my anger will be kindled against them on that day, and I will forsake them and hide my face from them, and they will be devoured. And many evils and troubles will come upon them, so that they will say in that day, ‘Have not these evils come upon us because our God is not among us?’",
      "links": "<a href='/AIV/5/32/20'>Deut. 32:20</a>",
      "comment": "The withdrawal of God’s presence signifies judgment, but always with an aim toward restoration upon repentance—a consistent theme in salvation history."
    },
    {
      "pk": 5031018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 18,
      "text": "And I will surely hide my face in that day because of all the evil that they have done, because they have turned to other gods.",
      "links": "<a href='/AIV/23/1/15'>Isa. 1:15</a>",
      "comment": "A recurring scriptural warning against idolatry points to the need for true worship and adherence to revealed truth."
    },
    {
      "pk": 5031019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 19,
      "text": "Now therefore write this song and teach it to the people of Israel. Put it in their mouths, that this song may be a witness for me against the people of Israel.",
      "links": "<a href='/AIV/5/32/1'>Deut. 32:1</a>",
      "comment": "The use of song for spiritual teaching underscores the role of liturgical worship and tradition in preserving the faith."
    },
    {
      "pk": 5031020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 20,
      "text": "For when I have brought them into the land flowing with milk and honey, which I swore to give to their fathers, and they have eaten and are full and grown fat, they will turn to other gods and serve them, and despise me and break my covenant.",
      "links": "<a href='/AIV/5/6/10-12'>Deut. 6:10-12</a>",
      "comment": "Spiritual complacency in times of prosperity is a warning throughout scripture; true thankfulness requires fidelity."
    },
    {
      "pk": 5031021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 21,
      "text": "And when many evils and troubles have come upon them, this song shall confront them as a witness (for it will live unforgotten in the mouths of their descendants). For I know what they are inclined to do even today, before I have brought them into the land that I swore to give.”",
      "links": "<a href='/AIV/5/32/1-47'>Deut. 32:1-47</a>",
      "comment": "The prophetic nature of liturgical remembrance is shown—inspired song helps call people back to God."
    },
    {
      "pk": 5031022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 22,
      "text": "So Moses wrote this song the same day and taught it to the people of Israel.",
      "links": "<a href='/AIV/5/32/44'>Deut. 32:44</a>",
      "comment": "Active teaching by Moses is paired with the tradition of passing on doctrine through authoritative leaders."
    },
    {
      "pk": 5031023,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 23,
      "text": "And the Lord commissioned Joshua son of Nun and said, “Be strong and courageous, for you shall bring the people of Israel into the land that I swore to give them. I will be with you.”",
      "links": "<a href='/AIV/6/1/6'>Josh. 1:6</a>",
      "comment": "Commissioning and the assurance of God's presence signify leadership chosen and confirmed by God."
    },
    {
      "pk": 5031024,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 24,
      "text": "When Moses had finished writing the words of this Law in a book to the very end,",
      "links": "<a href='/AIV/5/17/18'>Deut. 17:18</a>",
      "comment": "Moses’ completion of the written Law marks a model for authoritative Scripture that will continue."
    },
    {
      "pk": 5031025,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 25,
      "text": "Moses commanded the Levites, who carried the ark of the covenant of the Lord:",
      "links": "<a href='/AIV/4/4/5'>Num. 4:5</a>",
      "comment": "Levites as guardians of the Law parallel later roles of deacons and ministers entrusted with the faith."
    },
    {
      "pk": 5031026,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 26,
      "text": "“Take this Book of the Law and put it by the side of the ark of the covenant of the Lord your God, that it may be there as a witness against you.",
      "links": "<a href='/AIV/2/25/16'>Ex. 25:16</a>",
      "comment": "The written Word, kept with the ark, attests to the importance of both Scripture and sacred tradition."
    },
    {
      "pk": 5031027,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 27,
      "text": "For I know how rebellious and stubborn you are. Behold, even today while I am still alive with you, you have been rebellious against the Lord. How much more after my death!",
      "links": "<a href='/AIV/2/32/9'>Ex. 32:9</a>",
      "comment": "Moses testifies to the ongoing human tendency to stray, foreshadowing the need for enduring, unified leadership and discipline."
    },
    {
      "pk": 5031028,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 28,
      "text": "Assemble to me all the elders of your tribes and your officers, that I may speak these words in their hearing and call heaven and earth to witness against them.",
      "links": "<a href='/AIV/5/30/19'>Deut. 30:19</a>; <a href='/AIV/5/32/1'>Deut. 32:1</a>",
      "comment": "The role of elders and officers as witnesses continues the pattern of corporate responsibility and accountability among God’s people."
    },
    {
      "pk": 5031029,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 29,
      "text": "For I know that after my death you will surely act corruptly and turn aside from the way that I have commanded you. In the days to come, evil will befall you, because you will do what is evil in the sight of the Lord, provoking him to anger through the work of your hands.",
      "links": "<a href='/AIV/7/2/19'>Judg. 2:19</a>; <a href='/AIV/5/4/25'>Deut. 4:25</a>",
      "comment": "Prophetic warnings seek to turn hearts back to God, anticipating both discipline and the grace of future restoration."
    },
    {
      "pk": 5031030,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 31,
      "verse": 30,
      "text": "Then Moses spoke the words of this song until they were finished, in the hearing of all the assembly of Israel:",
      "links": "<a href='/AIV/5/32/1-43'>Deut. 32:1-43</a>",
      "comment": "Moses’ final song becomes part of the enduring liturgy of Israel. The pattern of Scriptural canticles inspires the continual use of hymns and spiritual songs for the instruction and remembrance of God’s people."
    }
  ],
  "translatedAt": "2025-12-24T02:14:31.968Z"
}