{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 7,
  "verses": [
    {
      "pk": 5007001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 1,
      "text": "When the LORD your God brings you into the land you are going to possess, and drives out many nations before you—the Hittites, the Girgashites, the Amorites, the Canaanites, the Perizzites, the Hivites, and the Jebusites, seven nations larger and stronger than you—",
      "links": "<a href='/AIV/01/15/19-21'>Gen. 15:19-21</a>; <a href='/AIV/06/3/10'>Josh. 3:10</a>",
      "comment": "This introduces Israel's call to holiness and separation from the nations in the promised land. The seven nations referenced represent a fullness of opposition. The conquest motif here finds its spiritual fulfillment in the New Testament's battle against sin and spiritual powers (<a href='/AIV/49/6/12'>Eph. 6:12</a>)."
    },
    {
      "pk": 5007002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 2,
      "text": "and when the LORD your God gives them over to you, and you defeat them, you must devote them to complete destruction. Make no covenant with them and show them no mercy.",
      "links": "<a href='/AIV/05/20/16-18'>Deut. 20:16-18</a>; <a href='/AIV/07/2/34'>Judg. 2:34</a>",
      "comment": "The command for total destruction emphasizes the seriousness of idolatry and sin. Theologically, this foreshadows the radical call to spiritual purity in the Christian life. Figuratively, this reflects the soul's battle to eliminate sin completely, not to compromise with it."
    },
    {
      "pk": 5007003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 3,
      "text": "You must not intermarry with them. Do not give your daughters to their sons or take their daughters for your sons.",
      "links": "<a href='/AIV/02/34/16'>Ex. 34:16</a>; <a href='/AIV/11/11/2'>1 Kings 11:2</a>",
      "comment": "Marriage here represents covenantal unity. Israel is to remain distinct, preserving both faith and worship. In the spiritual sense, this anticipates the call for believers to be united in faith and in the worship of the one true God (<a href='/AIV/47/6/14'>2 Cor. 6:14</a>)."
    },
    {
      "pk": 5007004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 4,
      "text": "For they would turn your children away from following Me, to serve other gods. Then the anger of the LORD would be aroused against you, and He would quickly destroy you.",
      "links": "<a href='/AIV/05/6/14-15'>Deut. 6:14-15</a>; <a href='/AIV/07/2/11-14'>Judg. 2:11-14</a>",
      "comment": "Serving other gods brings judgment, revealing the gravity of idolatry. The ultimate fulfillment is seen in Christ's exclusive claim for worship (<a href='/AIV/40/4/10'>Matt. 4:10</a>)."
    },
    {
      "pk": 5007005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 5,
      "text": "But you must deal with them like this: tear down their altars, break their sacred pillars, cut down their Asherah poles, and burn their idols with fire.",
      "links": "<a href='/AIV/02/23/24'>Ex. 23:24</a>; <a href='/AIV/05/12/3'>Deut. 12:3</a>",
      "comment": "Removal of pagan objects ensures pure worship. This calls Christians to reject anything that rivals absolute devotion to God. The focus on external action mirrors the inward call to holiness and the rejection of spiritual idolatry."
    },
    {
      "pk": 5007006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 6,
      "text": "For you are a people holy to the LORD your God. The LORD your God has chosen you to be a people for Himself, treasured out of all the peoples who are on the face of the earth.",
      "links": "<a href='/AIV/02/19/5-6'>Ex. 19:5-6</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "Israel's election as a 'holy people' prefigures God's gathering of a new, set-apart people in Christ, who are called 'a chosen race, a royal priesthood.' The language mirrors the identity given to the Church in the New Testament, pointing to the continuity of God's plan."
    },
    {
      "pk": 5007007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 7,
      "text": "The LORD did not set His love on you or choose you because you were more numerous than any other people—for you were the fewest of all peoples—",
      "links": "<a href='/AIV/05/9/5-6'>Deut. 9:5-6</a>; <a href='/AIV/13/16/19'>1 Chr. 16:19</a>",
      "comment": "God's choice is entirely an act of grace, not merit. This foreshadows the gratuitous nature of salvation in Christ, given not because of works, but because of divine love (<a href='/AIV/49/2/8-9'>Eph. 2:8-9</a>)."
    },
    {
      "pk": 5007008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 8,
      "text": "but because the LORD loved you and kept the oath He swore to your fathers, the LORD brought you out with a mighty hand and redeemed you from the house of slavery, from the hand of Pharaoh king of Egypt.",
      "links": "<a href='/AIV/02/6/6'>Ex. 6:6</a>; <a href='/AIV/05/4/37'>Deut. 4:37</a>",
      "comment": "Redemption flows from God's faithfulness to His promises. The Exodus deliverance prefigures Christian salvation—God freeing His people from slavery to sin through Christ."
    },
    {
      "pk": 5007009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 9,
      "text": "Know therefore that the LORD your God is God; He is the faithful God, keeping His covenant and steadfast love to a thousand generations with those who love Him and keep His commandments.",
      "links": "<a href='/AIV/02/34/6-7'>Ex. 34:6-7</a>; <a href='/AIV/19/105/8'>Ps. 105:8</a>",
      "comment": "Here God's faithfulness is tied to covenant and commandments. The link between love and obedience is also emphasized by Jesus (<a href='/AIV/43/14/15'>John 14:15</a>). The Church continues this covenant relationship through Christ."
    },
    {
      "pk": 5007010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 10,
      "text": "but repaying to their face those who hate Him, to destroy them. He will not delay with those who hate Him; He will repay them to their face.",
      "links": "<a href='/AIV/02/20/5'>Ex. 20:5</a>; <a href='/AIV/26/18/30'>Ezek. 18:30</a>",
      "comment": "Justice is swift for those who hate God, warning against spiritual complacency. The dual aspects of mercy and justice remain core to biblical theology and are balanced in the New Testament in the message of Christ (<a href='/AIV/45/11/22'>Rom. 11:22</a>)."
    },
    {
      "pk": 5007011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 11,
      "text": "Therefore you must keep the commandments, the statutes, and the ordinances which I am commanding you today, to observe them.",
      "links": "<a href='/AIV/05/6/17'>Deut. 6:17</a>; <a href='/AIV/43/15/10'>John 15:10</a>",
      "comment": "Obedience is the right response to God's love. Keeping God's commandments is linked to remaining in the Lord's favor and is reiterated by Jesus as an expression of love for Him."
    },
    {
      "pk": 5007012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 12,
      "text": "If you listen to these ordinances and keep and do them, the LORD your God will keep with you the covenant and the steadfast love He swore to your fathers.",
      "links": "<a href='/AIV/03/26/3-4'>Lev. 26:3-4</a>; <a href='/AIV/05/28/1-2'>Deut. 28:1-2</a>",
      "comment": "God's covenant blessings depend on Israel's faithfulness. The principle of blessing through obedience carries into Christ's teaching about abiding in His love by keeping His commands."
    },
    {
      "pk": 5007013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 13,
      "text": "He will love you, bless you, and multiply you. He will also bless the fruit of your womb and the fruit of your land—your grain, your new wine, your oil, the calves of your herds, and the lambs of your flocks—in the land He swore to your fathers to give you.",
      "links": "<a href='/AIV/01/22/17'>Gen. 22:17</a>; <a href='/AIV/05/28/4'>Deut. 28:4</a>",
      "comment": "Material prosperity is a sign of God's covenant blessing in the Old Testament. Spiritually, it foreshadows the fruitfulness of the grace-filled life in the New Covenant."
    },
    {
      "pk": 5007014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 14,
      "text": "You shall be blessed above all peoples; there shall not be a male or female barren among you or among your livestock.",
      "links": "<a href='/AIV/02/23/26'>Ex. 23:26</a>; <a href='/AIV/05/28/11'>Deut. 28:11</a>",
      "comment": "Bodily and agricultural fruitfulness symbolizes spiritual vitality. In a spiritual sense, the faithful are promised abundance—even eternal life in the new creation."
    },
    {
      "pk": 5007015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 15,
      "text": "The LORD will remove from you all sickness. And none of the terrible diseases of Egypt, which you have known, will He put on you, but He will lay them on all who hate you.",
      "links": "<a href='/AIV/02/15/26'>Ex. 15:26</a>; <a href='/AIV/19/103/3'>Ps. 103:3</a>",
      "comment": "Physical well-being is assured as a sign of God's favor. Ultimately, sickness and death are overcome through Christ, the 'great physician' (<a href='/AIV/40/8/17'>Matt. 8:17</a>)."
    },
    {
      "pk": 5007016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 16,
      "text": "You shall consume all the peoples whom the LORD your God will give you. Your eye shall not pity them; neither shall you serve their gods, for that would be a snare to you.",
      "links": "<a href='/AIV/02/23/33'>Ex. 23:33</a>; <a href='/AIV/05/12/30'>Deut. 12:30</a>",
      "comment": "Mercy is not to be shown to persistent, unrepentant evil, underscoring the seriousness of idolatry. In the spiritual sense, compromise with sin ensnares the soul."
    },
    {
      "pk": 5007017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 17,
      "text": "If you say in your heart, ‘These nations are greater than I; how can I dispossess them?’—",
      "links": "<a href='/AIV/04/13/31'>Num. 13:31</a>; <a href='/AIV/05/1/28'>Deut. 1:28</a>",
      "comment": "Doubt about overcoming great obstacles is addressed. The lesson is to rely not on self, but on God's power. This anticipation of God's victory foreshadows Christian trust in grace amidst spiritual battles."
    },
    {
      "pk": 5007018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 18,
      "text": "do not be afraid of them; but remember what the LORD your God did to Pharaoh and to all Egypt—",
      "links": "<a href='/AIV/02/14/13'>Ex. 14:13</a>; <a href='/AIV/05/5/15'>Deut. 5:15</a>",
      "comment": "Remembrance of God's past deliverance encourages faith for present challenges. The New Testament continues this pattern as believers remember Christ's saving acts."
    },
    {
      "pk": 5007019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 19,
      "text": "the great trials which your eyes saw, the signs, the wonders, the mighty hand, and the outstretched arm, by which the LORD your God brought you out. So shall the LORD your God do to all the peoples you are afraid of.",
      "links": "<a href='/AIV/05/4/34'>Deut. 4:34</a>; <a href='/AIV/24/32/21'>Jer. 32:21</a>",
      "comment": "God’s mighty acts inspire confidence. The language of 'outstretched arm' is later used of God's saving work in Jesus, whose miracles and resurrection are the ultimate sign."
    },
    {
      "pk": 5007020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 20,
      "text": "Moreover, the LORD your God will send the hornet among them until those who are left and hide themselves from you are destroyed.",
      "links": "<a href='/AIV/02/23/28'>Ex. 23:28</a>; <a href='/AIV/06/24/12'>Josh. 24:12</a>",
      "comment": "The 'hornet' symbolizes God's supernatural intervention. Nothing can resist God's purposes. This same divine power is now accessible to the Church, accomplishing spiritual victories."
    },
    {
      "pk": 5007021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 21,
      "text": "You shall not be terrified of them, for the LORD your God, the great and awesome God, is among you.",
      "links": "<a href='/AIV/05/1/29-30'>Deut. 1:29-30</a>; <a href='/AIV/58/13/5-6'>Heb. 13:5-6</a>",
      "comment": "God's presence is the basis for courage. The reality of God's indwelling presence shapes Christian confidence and mission (<a href='/AIV/40/28/20'>Matt. 28:20</a>)."
    },
    {
      "pk": 5007022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 22,
      "text": "The LORD your God will clear away these nations before you little by little. You will not be able to destroy them all at once, or the wild animals would become too numerous for you.",
      "links": "<a href='/AIV/02/23/29-30'>Ex. 23:29-30</a>",
      "comment": "Progress in God's promises is gradual, not instant. The spiritual journey is a process, mirroring progressive sanctification and growth in holiness."
    },
    {
      "pk": 5007023,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 23,
      "text": "But the LORD your God will give them over to you and will throw them into great confusion, until they are destroyed.",
      "links": "<a href='/AIV/02/23/27'>Ex. 23:27</a>; <a href='/AIV/06/10/10'>Josh. 10:10</a>",
      "comment": "God's gift of victory is complete, accomplished through His own power. This points to Christ's total victory over all spiritual enemies, culminating in the triumph of the Church."
    },
    {
      "pk": 5007024,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 24,
      "text": "He will deliver their kings into your hand, and you will wipe out their names from under heaven. No one will be able to stand against you until you have destroyed them.",
      "links": "<a href='/AIV/06/12/24'>Josh. 12:24</a>; <a href='/AIV/19/110/5-6'>Ps. 110:5-6</a>",
      "comment": "God grants authority and final victory, which is echoed in Christ's authority over all powers and principalities (<a href='/AIV/51/2/15'>Col. 2:15</a>)."
    },
    {
      "pk": 5007025,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 25,
      "text": "The carved images of their gods you shall burn with fire. You shall not covet the silver or the gold that is on them, nor take it for yourselves, lest you be ensnared by it, for it is an abomination to the LORD your God.",
      "links": "<a href='/AIV/05/17/3'>Deut. 17:3</a>; <a href='/AIV/06/7/1'>Josh. 7:1</a>",
      "comment": "All remnants of idolatry are to be destroyed, and not even precious metals should entice the people. This foreshadows Jesus' call to renounce earthly treasure for the sake of God's kingdom."
    },
    {
      "pk": 5007026,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 7,
      "verse": 26,
      "text": "And you shall not bring any abominable thing into your house, lest you be doomed to destruction like it. You shall utterly detest it and abhor it, for it is doomed to destruction.",
      "links": "<a href='/AIV/05/13/17'>Deut. 13:17</a>; <a href='/AIV/66/18/4'>Rev. 18:4</a>",
      "comment": "Total rejection of what is accursed preserves the holiness of the people. The spiritual application is the call to radical separation from sin, preparing for the fullness of God's dwelling among His people."
    }
  ],
  "translatedAt": "2025-12-24T02:00:58.089Z"
}