{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 20,
  "verses": [
    {
      "pk": 5020001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 1,
      "text": "When you go out to war against your enemies and you see horses, chariots, and a people more numerous than you, do not be afraid of them, for the LORD your God, who brought you up from the land of Egypt, is with you.",
      "links": "<a href='/AIV/02/14/14'>Ex. 14:14</a>; <a href='/AIV/05/31/6'>Deut. 31:6</a>",
      "comment": "This verse begins with God's assurance to His people that He will fight for them, echoing His deliverance from Egypt. Spiritually, this foreshadows Christ's victory over sin and death for His church (see Rom. 8:31-37). The continual theme of divine presence anticipates the incarnational reality fulfilled in Jesus (Matt. 1:23)."
    },
    {
      "pk": 5020002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 2,
      "text": "And it shall be, when you are about to go into battle, the priest shall come forward and speak to the people,",
      "links": "<a href='/AIV/03/21/10-12'>Lev. 21:10-12</a>; <a href='/AIV/07/20/28'>Judg. 20:28</a>",
      "comment": "The priest leads in spiritual preparation before battle, underscoring the link between worship and action. This highlights the role of mediators (cf. Heb. 4:14), and the importance of ordained ministry for spiritual guidance."
    },
    {
      "pk": 5020003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 3,
      "text": "He shall say to them, 'Hear, Israel: Today you are advancing to wage war against your enemies. Do not let your heart be faint. Do not be afraid, do not panic, and do not be terrified by them.'",
      "links": "<a href='/AIV/06/01/9'>Josh. 1:9</a>; <a href='/AIV/23/41/10'>Isa. 41:10</a>",
      "comment": "Here, God's command to not fear reflects Biblical teaching on trusting in divine providence (see Phil. 4:6-7). The message is not only for physical battles, but for spiritual ones as well."
    },
    {
      "pk": 5020004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 4,
      "text": "For the LORD your God is the one who goes with you, to fight for you against your enemies, to give you victory.",
      "links": "<a href='/AIV/10/17/47'>1 Sam. 17:47</a>; <a href='/AIV/45/08/37'>Rom. 8:37</a>",
      "comment": "The assurance of victory comes from God’s active involvement. This parallels Christ’s triumph over evil through His sacrifice (Col. 2:15), and suggests the ongoing protection over the faithful."
    },
    {
      "pk": 5020005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 5,
      "text": "And the officers shall speak to the people, saying, 'Is there any man who has built a new house and has not yet dedicated it? Let him go and return to his house, lest he die in battle and another man dedicate it.'",
      "links": "<a href='/AIV/05/28/30'>Deut. 28:30</a>",
      "comment": "The instruction to allow one to dedicate his house highlights the sanctity of home and family. The theme of dedication anticipates the consecration found in New Testament worship (Heb. 10:19-22)."
    },
    {
      "pk": 5020006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 6,
      "text": "'Is there any man who has planted a vineyard and has not yet enjoyed its fruit? Let him go and return to his house, lest he die in battle and another man eat its fruit.'",
      "links": "<a href='/AIV/03/19/23-25'>Lev. 19:23-25</a>",
      "comment": "Participating in the harvest connects to the blessing of labor and fruitfulness. The biblical symbolism of vines and vineyards also points ahead to imagery of the Eucharist (John 15:1-5; Matt. 26:29)."
    },
    {
      "pk": 5020007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 7,
      "text": "'Is there any man who is betrothed to a woman and has not married her? Let him go and return to his house, lest he die in battle and another man marry her.'",
      "links": "<a href='/AIV/05/24/5'>Deut. 24:5</a>",
      "comment": "The sanctity of marriage is preserved, emphasizing the value of covenant relationships. Spiritual interpretation links marriage to the union of Christ and the Church (Eph. 5:25-32)."
    },
    {
      "pk": 5020008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 8,
      "text": "And the officers shall speak further to the people, and say, 'Is there any man who is fearful and fainthearted? Let him go and return to his house, so that the heart of his brothers does not melt as his heart does.'",
      "links": "<a href='/AIV/07/07/03'>Judg. 7:3</a>",
      "comment": "The call for courage serves both practical and spiritual purposes, ensuring only the resolute remain. This can be seen as a call to spiritual boldness, a virtue stressed throughout the New Testament (2 Tim. 1:7)."
    },
    {
      "pk": 5020009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 9,
      "text": "And when the officers have finished speaking to the people, they shall appoint commanders over the army to lead the people.",
      "links": "<a href='/AIV/04/31/14'>Num. 31:14</a>",
      "comment": "The orderly structure for battle reflects the principle of spiritual leadership and authority (Acts 14:23). This foreshadows later ecclesial forms of leadership grounded in apostolic succession (cf. Titus 1:5)."
    },
    {
      "pk": 5020010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 10,
      "text": "When you draw near to a city to fight against it, offer it terms of peace first.",
      "links": "<a href='/AIV/14/19/10'>2 Chron. 19:10</a>",
      "comment": "Offering peace before conflict prescribes mercy as a first option. This motif finds fulfillment in Christ, who is the Prince of Peace (Isa. 9:6; Luke 10:5)."
    },
    {
      "pk": 5020011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 11,
      "text": "And if it answers you in peace and opens its gates to you, then all the people within it shall become your servants and serve you.",
      "links": "<a href='/AIV/08/01/1-5'>Ruth 1:1-5</a>",
      "comment": "Terms of peace allow integration and service, reflective of the kingdom’s invitation to all. Spiritual servanthood echoes Jesus’ teaching on humility and being ‘servant of all’ (Mark 9:35)."
    },
    {
      "pk": 5020012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 12,
      "text": "But if it does not make peace with you but makes war against you, then you shall besiege it.",
      "links": "<a href='/AIV/24/21/4'>Jer. 21:4</a>",
      "comment": "The justice of God is shown in giving opportunity for peace before judgment. This image prepares for final judgment scenes in the New Testament (Rev. 19:11-21)."
    },
    {
      "pk": 5020013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 13,
      "text": "And when the LORD your God gives it into your hand, put all its male inhabitants to the sword.",
      "links": "<a href='/AIV/06/08/24'>Josh. 8:24</a>",
      "comment": "This command expresses the severity of judgment in ancient warfare. Understanding this through the lens of salvation history, it points forward to Christ’s final victory over evil (Rev. 19:15)."
    },
    {
      "pk": 5020014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 14,
      "text": "But the women, children, livestock, and all that is in the city, all its spoil, you shall take as plunder for yourselves. And you shall enjoy the spoil of your enemies which the LORD your God has given you.",
      "links": "<a href='/AIV/10/30/26'>1 Sam. 30:26</a>",
      "comment": "The separation of spoils demonstrates justice and mercy. Later spiritual application notes that God’s gifts to His people include more than physical provision—He endows His church with spiritual riches (Eph. 1:18)."
    },
    {
      "pk": 5020015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 15,
      "text": "Thus you shall deal with all the cities that are very far from you, which are not among the cities of these nations here.",
      "links": "<a href='/AIV/06/13/1-6'>Josh. 13:1-6</a>",
      "comment": "Treatment differs for distant nations, reflecting the process of gradual incorporation. By analogy, this prefigures the gospel’s outreach to the gentiles (Acts 13:46-48)."
    },
    {
      "pk": 5020016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 16,
      "text": "But in the cities of these peoples, which the LORD your God is giving you as an inheritance, do not leave alive anything that breathes.",
      "links": "<a href='/AIV/06/06/21'>Josh. 6:21</a>",
      "comment": "Total destruction is commanded for the cities within the land, signifying the purging of evil. Spiritual interpretation views this as a metaphor for rooting out sin completely, as Paul urges in Col. 3:5-10."
    },
    {
      "pk": 5020017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 17,
      "text": "But you shall completely destroy them—the Hittites, Amorites, Canaanites, Perizzites, Hivites, and Jebusites—as the LORD your God has commanded you,",
      "links": "<a href='/AIV/06/11/20'>Josh. 11:20</a>",
      "comment": "This command underlines the seriousness of spiritual contamination. It is a call to holiness, realized in Christ, who makes His people pure and set apart (Titus 2:14)."
    },
    {
      "pk": 5020018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 18,
      "text": "so that they do not teach you to do all the abominations they have done for their gods, and so you would sin against the LORD your God.",
      "links": "<a href='/AIV/05/12/30-31'>Deut. 12:30-31</a>",
      "comment": "The separation is meant to prevent the spread of idolatry and disorder. Allegorically, this warns about the dangers of false teaching and the necessity of safeguarding apostolic faith (2 Tim. 1:13-14)."
    },
    {
      "pk": 5020019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 19,
      "text": "When you besiege a city for a long time, making war against it to capture it, you shall not destroy its trees by cutting them down with an axe, for you may eat from them. Do not cut them down. Are the trees of the field human, that they should be besieged by you?",
      "links": "<a href='/AIV/01/02/9'>Gen. 2:9</a>; <a href='/AIV/23/55/12'>Isa. 55:12</a>",
      "comment": "Creation is to be respected even in war. This principle highlights stewardship of the earth, consistent with the biblical vision of creation care (Ps. 24:1)."
    },
    {
      "pk": 5020020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 20,
      "verse": 20,
      "text": "Only the trees that you know are not trees for food you may destroy and cut down, to build siegeworks against the city that is making war with you, until it falls.",
      "links": "<a href='/AIV/21/03/1-2'>Eccl. 3:1-2</a>",
      "comment": "Practical wisdom is exercised here—using only non-fruit trees in siege warfare. The distinction echoes discernment in Christian life: the wise separation of what sustains and what can be sacrificed for the kingdom (Phil. 3:7-8)."
    }
  ],
  "translatedAt": "2025-12-24T02:07:37.102Z"
}