{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 11,
  "verses": [
    {
      "pk": 5011001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 1,
      "text": "Therefore, you shall love the LORD your God and always keep His requirements, His statutes, His judgments, and His commandments.",
      "links": "<a href='/AIV/5/6/5'>Deut 6:5</a>; <a href='/AIV/40/22/37'>Matt 22:37</a>",
      "comment": "The command to love God forms the foundation of the entire law and echoes the Shema (Deut 6:5), later affirmed by Jesus as the greatest commandment. The mention of statutes, judgments, and commandments stresses fidelity and total devotion."
    },
    {
      "pk": 5011002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 2,
      "text": "Know today that I am not speaking with your children, who have not known and who have not seen the discipline of the LORD your God—His greatness, His mighty hand, and His outstretched arm—",
      "links": "<a href='/AIV/5/4/9'>Deut 4:9</a>; <a href='/AIV/2/13/9'>Ex. 13:9</a>",
      "comment": "The address distinguishes between the generation with firsthand knowledge of God’s mighty acts and their children, emphasizing the importance of personal experience in faith."
    },
    {
      "pk": 5011003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 3,
      "text": "and His signs and the deeds He performed in Egypt against Pharaoh king of Egypt and all his land;",
      "links": "<a href='/AIV/2/7/3'>Ex. 7:3</a>; <a href='/AIV/19/135/8-9'>Ps. 135:8-9</a>",
      "comment": "Reminds the people of the miracles and judgments against Egypt, highlighting God’s saving power—a foreshadowing of future divine acts for His people."
    },
    {
      "pk": 5011004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 4,
      "text": "also what He did to the army of Egypt, to their horses and chariots—how He caused the waters of the Red Sea to flood over them as they pursued you, and He destroyed them to this day;",
      "links": "<a href='/AIV/2/14/27-28'>Ex. 14:27-28</a>; <a href='/AIV/19/106/11'>Ps. 106:11</a>",
      "comment": "References the defeat of Egypt at the Red Sea, an event that established Israel's freedom and God’s supremacy; it alludes to baptism as a passage from slavery to new life."
    },
    {
      "pk": 5011005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 5,
      "text": "and what He did for you in the wilderness, until you came to this place;",
      "links": "<a href='/AIV/2/16/4'>Ex. 16:4</a>; <a href='/AIV/5/8/2'>Deut 8:2</a>",
      "comment": "Emphasizes God’s providence during the desert wanderings; spiritual nourishment parallels the Eucharist as God’s ongoing sustenance for believers."
    },
    {
      "pk": 5011006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 6,
      "text": "and what He did to Dathan and Abiram, the sons of Eliab, the son of Reuben—how the earth opened its mouth and swallowed them up, their households, their tents, and everything living that belonged to them, in the midst of all Israel;",
      "links": "<a href='/AIV/4/16/32-33'>Num 16:32-33</a>; <a href='/AIV/19/106/17'>Ps. 106:17</a>",
      "comment": "The destruction of Dathan and Abiram is a warning against rebellion and schism, reinforcing the importance of unity and obedience to God's appointed authority."
    },
    {
      "pk": 5011007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 7,
      "text": "for your eyes have seen all the great works of the LORD that He did.",
      "links": "<a href='/AIV/5/4/34'>Deut 4:34</a>; <a href='/AIV/19/78/43'>Ps. 78:43</a>",
      "comment": "Direct eyewitnesses are held responsible to remember and remain faithful, indicating the value of tradition passed down through generations."
    },
    {
      "pk": 5011008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 8,
      "text": "Therefore you shall keep all the commandment which I command you today, so that you may be strong and go in and possess the land which you cross over to possess;",
      "links": "<a href='/AIV/5/31/6'>Deut 31:6</a>; <a href='/AIV/8/1/6'>Josh 1:6</a>",
      "comment": "Obedience fortifies the people and secures their inheritance, teaching that grace and perseverance in faith are necessary for entering the promised inheritance."
    },
    {
      "pk": 5011009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 9,
      "text": "and so that you may prolong your days in the land which the LORD swore to give to your fathers, to them and to their descendants—a land flowing with milk and honey.",
      "links": "<a href='/AIV/5/6/2-3'>Deut 6:2-3</a>; <a href='/AIV/2/3/8'>Ex. 3:8</a>",
      "comment": "Echoes the covenant promises; land as blessing represents God’s abundant life, which later is spiritualized in Christ's promises of eternal life."
    },
    {
      "pk": 5011010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 10,
      "text": "For the land you are entering to possess is not like the land of Egypt, from which you came, where you sowed your seed and watered it by foot, as in a vegetable garden;",
      "links": "<a href='/AIV/1/13/10'>Gen. 13:10</a>; <a href='/AIV/2/23/10'>Ex. 23:10</a>",
      "comment": "Contrasts self-reliance in Egypt with dependence on God in the promised land; spiritual dependence on God for every blessing is stressed."
    },
    {
      "pk": 5011011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 11,
      "text": "but the land you are crossing over to possess is a land of hills and valleys that drinks water by the rain from the heavens,",
      "links": "<a href='/AIV/18/5/10'>Job 5:10</a>; <a href='/AIV/19/65/9-10'>Ps. 65:9-10</a>",
      "comment": "Blessing will depend on God’s provision rather than human effort; the imagery of rain ties to divine grace."
    },
    {
      "pk": 5011012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 12,
      "text": "a land the LORD your God cares for; the eyes of the LORD your God are always upon it, from the beginning of the year to the end of the year.",
      "links": "<a href='/AIV/19/121/4'>Ps. 121:4</a>; <a href='/AIV/19/34/15'>Ps. 34:15</a>",
      "comment": "God’s continual care mirrors His providence for the Church universally, watching over His people perpetually."
    },
    {
      "pk": 5011013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 13,
      "text": "And it shall be, if you will diligently obey My commandments which I command you today—to love the LORD your God and to serve Him with all your heart and with all your soul—",
      "links": "<a href='/AIV/5/6/5'>Deut 6:5</a>; <a href='/AIV/19/103/1'>Ps. 103:1</a>",
      "comment": "Connects love and service with full, heartfelt devotion; a holistic commitment anticipated in the New Testament command to love God fully."
    },
    {
      "pk": 5011014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 14,
      "text": "then I will give the rain for your land in its season—the early rain and the latter rain—that you may gather in your grain, your wine, and your oil.",
      "links": "<a href='/AIV/29/2/23'>Joel 2:23</a>; <a href='/AIV/59/5/7'>James 5:7</a>",
      "comment": "Rain as a sign of blessing and fruitfulness; spiritual interpretations see this as outpouring of the Holy Spirit on the community."
    },
    {
      "pk": 5011015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 15,
      "text": "And I will give grass in your fields for your livestock, and you will eat and be satisfied.",
      "links": "<a href='/AIV/19/104/14'>Ps. 104:14</a>; <a href='/AIV/19/107/9'>Ps. 107:9</a>",
      "comment": "Total provision from God is promised, echoing themes of bounty and satisfaction found throughout the Psalms."
    },
    {
      "pk": 5011016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 16,
      "text": "Beware lest your hearts be deceived, so that you turn aside and serve other gods and bow down to them;",
      "links": "<a href='/AIV/5/6/14'>Deut 6:14</a>; <a href='/AIV/62/5/21'>1 John 5:21</a>",
      "comment": "A warning about idolatry; Israel’s faithfulness will be tested. Spiritual application: vigilance against anything that rivals God in one’s life."
    },
    {
      "pk": 5011017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 17,
      "text": "then the LORD’s anger will be kindled against you, and He will shut up the heavens so that there will be no rain, and the earth will not give its produce, and you will soon perish from the good land the LORD is giving you.",
      "links": "<a href='/AIV/11/17/1'>1 Kings 17:1</a>; <a href='/AIV/24/3/3'>Jer. 3:3</a>",
      "comment": "Withdrawal of blessing is a direct consequence of disobedience; this underscores God’s justice and the seriousness of turning away."
    },
    {
      "pk": 5011018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 18,
      "text": "Therefore you shall lay up these words of Mine in your heart and in your soul, and bind them as a sign on your hand, and as frontlets between your eyes.",
      "links": "<a href='/AIV/5/6/6-8'>Deut 6:6-8</a>; <a href='/AIV/19/119/11'>Ps. 119:11</a>",
      "comment": "God’s Word must be internalized and ever-present; physical signs point to a spiritual reality of setting God’s law foremost in one’s life."
    },
    {
      "pk": 5011019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 19,
      "text": "You shall teach them to your children, talking of them when you sit in your house, when you walk along the road, when you lie down, and when you rise up.",
      "links": "<a href='/AIV/5/6/7'>Deut 6:7</a>; <a href='/AIV/20/22/6'>Prov. 22:6</a>",
      "comment": "Stresses transmission of faith through generations; continual teaching forms the basis of organic, living tradition."
    },
    {
      "pk": 5011020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 20,
      "text": "And you shall write them on the doorposts of your house and on your gates,",
      "links": "<a href='/AIV/5/6/9'>Deut 6:9</a>; <a href='/AIV/23/57/7'>Isa. 57:7</a>",
      "comment": "Physical reminders in the home serve as public witness to living by God’s law; spiritual application points to integrating faith into daily life."
    },
    {
      "pk": 5011021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 21,
      "text": "so that your days and the days of your children may be multiplied in the land the LORD swore to your fathers to give them, as long as the heavens are above the earth.",
      "links": "<a href='/AIV/5/4/40'>Deut 4:40</a>; <a href='/AIV/19/72/5'>Ps. 72:5</a>",
      "comment": "Obedience is linked to longevity and generational blessing; hints at the spiritual inheritance in the New Covenant."
    },
    {
      "pk": 5011022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 22,
      "text": "For if you will diligently keep all these commandments that I command you, to love the LORD your God, to walk in all His ways, and to hold fast to Him,",
      "links": "<a href='/AIV/5/6/17'>Deut 6:17</a>; <a href='/AIV/19/63/8'>Ps. 63:8</a>",
      "comment": "Integration of love, obedience, and intimacy with God is presented as the path for blessing; echoes John 15 (‘Abide in Me’)."
    },
    {
      "pk": 5011023,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 23,
      "text": "then the LORD will drive out all these nations before you, and you will dispossess nations greater and mightier than you.",
      "links": "<a href='/AIV/5/7/1'>Deut 7:1</a>; <a href='/AIV/7/23/10'>Josh 23:10</a>",
      "comment": "Shows God’s power to protect and establish His people; ultimate victory belongs to God, foreshadowing spiritual victory through Christ."
    },
    {
      "pk": 5011024,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 24,
      "text": "Every place on which the sole of your foot treads shall be yours; your territory will be from the wilderness and Lebanon, from the river, the river Euphrates, even to the Western Sea.",
      "links": "<a href='/AIV/1/15/18'>Gen. 15:18</a>; <a href='/AIV/7/1/3-4'>Josh 1:3-4</a>",
      "comment": "The promise of land connects to Abraham's covenant; spiritually, points to the universal scope of Christ’s Kingdom."
    },
    {
      "pk": 5011025,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 25,
      "text": "No one shall be able to stand against you. The LORD your God will lay the terror and fear of you upon all the land wherever you set foot, as He has spoken to you.",
      "links": "<a href='/AIV/2/23/27'>Ex. 23:27</a>; <a href='/AIV/6/2/9-11'>Josh 2:9-11</a>",
      "comment": "God grants total security; parallels in spiritual warfare where faithfulness gives believers confidence and protection."
    },
    {
      "pk": 5011026,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 26,
      "text": "See, I am setting before you today a blessing and a curse:",
      "links": "<a href='/AIV/5/30/19'>Deut 30:19</a>; <a href='/AIV/24/21/8'>Jer. 21:8</a>",
      "comment": "Choice is presented as central to covenantal life; linking obedience with blessing and disobedience with curse. Christ re-emphasizes free, loving acceptance of the Gospel."
    },
    {
      "pk": 5011027,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 27,
      "text": "the blessing, if you obey the commandments of the LORD your God which I command you today,",
      "links": "<a href='/AIV/5/28/1-2'>Deut 28:1-2</a>; <a href='/AIV/19/128/1'>Ps. 128:1</a>",
      "comment": "Obedience is the path to blessing; stress on total fidelity as modeled by Christ’s obedience unto death."
    },
    {
      "pk": 5011028,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 28,
      "text": "and the curse, if you do not obey the commandments of the LORD your God, but turn aside from the way which I command you today, to go after other gods, which you have not known.",
      "links": "<a href='/AIV/5/28/15'>Deut 28:15</a>; <a href='/AIV/45/1/21-23'>Rom. 1:21-23</a>",
      "comment": "Rejection of God’s command leads to loss; idolatry is always a grave danger spiritually and physically, as seen throughout Scripture."
    },
    {
      "pk": 5011029,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 29,
      "text": "Now when the LORD your God has brought you into the land you are entering to possess, you shall set the blessing on Mount Gerizim and the curse on Mount Ebal.",
      "links": "<a href='/AIV/6/8/33-34'>Josh 8:33-34</a>; <a href='/AIV/5/27/12-13'>Deut 27:12-13</a>",
      "comment": "The physical enactment of blessing and curse underscores the communal and liturgical dimension of covenant—seen in later worship strata."
    },
    {
      "pk": 5011030,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 30,
      "text": "Are they not across the Jordan, west of the road toward the setting sun, in the land of the Canaanites who dwell in the Arabah, opposite Gilgal, beside the oaks of Moreh?",
      "links": "<a href='/AIV/1/12/6'>Gen. 12:6</a>; <a href='/AIV/6/4/19'>Josh 4:19</a>",
      "comment": "Geographic specificity roots the covenant in real history; Gilgal becomes a key place for Israel’s liturgical activity."
    },
    {
      "pk": 5011031,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 31,
      "text": "For you are about to cross over the Jordan to go in and possess the land the LORD your God is giving you, and you shall possess it and live in it.",
      "links": "<a href='/AIV/6/3/17'>Josh 3:17</a>; <a href='/AIV/5/9/1'>Deut 9:1</a>",
      "comment": "Crossing the Jordan is symbolic of entering into God’s promises and blessing; later seen as spiritual entering into new life through Christ."
    },
    {
      "pk": 5011032,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 11,
      "verse": 32,
      "text": "And you shall carefully keep all the statutes and judgments which I set before you today.",
      "links": "<a href='/AIV/5/4/1'>Deut 4:1</a>; <a href='/AIV/51/1/22-23'>Col. 1:22-23</a>",
      "comment": "Faithfulness to God’s commands is required and rewarded; complete commitment leads to being presented holy and blameless, as Paul later writes (Col 1:22-23)."
    }
  ],
  "translatedAt": "2025-12-24T02:02:52.521Z"
}