{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 30,
  "verses": [
    {
      "pk": 5030001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 1,
      "text": "When all these things come upon you, the blessing and the curse that I have set before you, and you take them to heart among all the nations where the Lord your God has driven you,",
      "links": "<a href='/AIV/5/28/15'>Deut. 28:15</a>; <a href='/AIV/5/29/1'>Deut. 29:1</a>",
      "comment": "Moses reminds Israel that their fate lies in choosing either blessing or curse, echoing the covenant concept as central to God's relationship with His people."
    },
    {
      "pk": 5030002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 2,
      "text": "and return to the Lord your God and obey His voice, you and your children, with all your heart and with all your soul, according to all that I command you today,",
      "links": "<a href='/AIV/5/4/29'>Deut. 4:29</a>; <a href='/AIV/28/14/1'>Hos. 14:1</a>",
      "comment": "Repentance and wholehearted obedience are required to restore relationship with God. True return involves not just ritual but the heart—an internal conversion."
    },
    {
      "pk": 5030003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 3,
      "text": "then the Lord your God will restore your fortunes and have compassion on you, and He will gather you again from all the peoples where the Lord your God has scattered you.",
      "links": "<a href='/AIV/24/29/14'>Jer. 29:14</a>; <a href='/AIV/26/36/24'>Ezek. 36:24</a>",
      "comment": "God’s restoration is an act of mercy, fulfilling His promise to gather His people from exile, prefiguring the ultimate gathering of believers in Christ (cf. John 11:52)."
    },
    {
      "pk": 5030004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 4,
      "text": "Even if your outcasts are at the ends of the earth, from there the Lord your God will gather you, and from there He will bring you back.",
      "links": "<a href='/AIV/15/1/3'>Ezra 1:3</a>; <a href='/AIV/23/43/5-6'>Isa. 43:5-6</a>",
      "comment": "God’s power to gather His people knows no bounds, symbolizing His universal call. This foreshadows the mission to all nations found in the New Testament (Matt. 28:19)."
    },
    {
      "pk": 5030005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 5,
      "text": "The Lord your God will bring you into the land that your fathers possessed, and you will possess it. He will do you good and multiply you more than your fathers.",
      "links": "<a href='/AIV/1/12/7'>Gen. 12:7</a>; <a href='/AIV/1/17/7-8'>Gen. 17:7-8</a>",
      "comment": "This is a reaffirmation of the land promise to Abraham, Isaac, and Jacob, showing God's faithfulness even after discipline."
    },
    {
      "pk": 5030006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 6,
      "text": "And the Lord your God will circumcise your heart and the heart of your descendants, so that you will love the Lord your God with all your heart and with all your soul, that you may live.",
      "links": "<a href='/AIV/24/4/4'>Jer. 4:4</a>; <a href='/AIV/45/2/29'>Rom. 2:29</a>",
      "comment": "Here is the promise of interior transformation—a spiritual circumcision—anticipating the outpouring of grace and the law written on the heart (cf. Jer. 31:33; Heb. 8:10). See also Rom. 2:29 on the believer's heart."
    },
    {
      "pk": 5030007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 7,
      "text": "The Lord your God will put all these curses on your enemies and on those who hate and persecute you.",
      "links": "<a href='/AIV/5/7/15'>Deut. 7:15</a>; <a href='/AIV/23/54/17'>Isa. 54:17</a>",
      "comment": "A reversal of fortunes echoes God’s justice: those who persecute the faithful will experience the curses Israel endured, confirming God's protective providence."
    },
    {
      "pk": 5030008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 8,
      "text": "And you will again obey the voice of the Lord and keep all His commandments that I command you today.",
      "links": "<a href='/AIV/5/28/1'>Deut. 28:1</a>",
      "comment": "Obedience to God’s commandments is essential for restored blessing, highlighting the importance of the law not just as rule, but as a way of life."
    },
    {
      "pk": 5030009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 9,
      "text": "The Lord your God will make you abundant in all the work of your hand, in the fruit of your womb, in the offspring of your livestock, and in the produce of your land. The Lord will again delight in prospering you, as He delighted in your fathers,",
      "links": "<a href='/AIV/5/7/13'>Deut. 7:13</a>; <a href='/AIV/1/26/12'>Gen. 26:12</a>",
      "comment": "God’s blessings encompass all areas of life, reflecting the fullness of the covenant when Israel is faithful."
    },
    {
      "pk": 5030010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 10,
      "text": "if you obey the voice of the Lord your God, to keep His commandments and His statutes that are written in this Book of the Law, and if you turn to the Lord your God with all your heart and with all your soul.",
      "links": "<a href='/AIV/5/17/19'>Deut. 17:19</a>; <a href='/AIV/6/22/5'>Josh. 22:5</a>",
      "comment": "Wholehearted conversion involves both obedience and love, suggesting the worship of God with one's entire being. This foreshadows Jesus’ summary of the Law (Matt. 22:37-40)."
    },
    {
      "pk": 5030011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 11,
      "text": "For this commandment that I am commanding you today is not too hard for you, nor is it far off.",
      "links": "<a href='/AIV/45/10/6-8'>Rom. 10:6-8</a>",
      "comment": "God’s law is accessible; it is near. Paul applies these verses to Christ, showing their fulfillment in the Gospel (see Rom. 10:6-8)."
    },
    {
      "pk": 5030012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 12,
      "text": "It is not in heaven, that you should say, 'Who will go up to heaven for us and bring it to us, that we may hear it and do it?'",
      "links": "<a href='/AIV/5/29/29'>Deut. 29:29</a>; <a href='/AIV/45/10/6'>Rom. 10:6</a>",
      "comment": "There is no barrier between man and God’s will. Christ, the incarnate Word, ultimately bridges what is beyond human reach—see John 1:14 for the Word made flesh."
    },
    {
      "pk": 5030013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 13,
      "text": "Neither is it beyond the sea, that you should say, 'Who will cross over the sea for us, and bring it to us, that we may hear it and do it?'",
      "links": "<a href='/AIV/45/10/7'>Rom. 10:7</a>",
      "comment": "God makes Himself accessible, and in Christ the Word, there is both revelation and salvation near at hand (cf. Rom. 10:7)."
    },
    {
      "pk": 5030014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 14,
      "text": "But the word is very near you; it is in your mouth and in your heart, so that you can do it.",
      "links": "<a href='/AIV/45/10/8'>Rom. 10:8</a>",
      "comment": "This anticipate the internalization of God’s law—later seen in the new covenant (Jer. 31:33)—as a grace that enables authentic obedience. Paul links this to faith in Christ."
    },
    {
      "pk": 5030015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 15,
      "text": "See, I have set before you today life and good, death and evil.",
      "links": "<a href='/AIV/5/11/26'>Deut. 11:26</a>; <a href='/AIV/24/21/8'>Jer. 21:8</a>",
      "comment": "Free will to choose life or death is emphasized. This recalls the idea of grace and cooperation in salvation, not mere passive reception."
    },
    {
      "pk": 5030016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 16,
      "text": "If you obey the commandments of the Lord your God that I command you today, by loving the Lord your God, by walking in His ways, and by keeping His commandments and His statutes and His rules, then you shall live and multiply, and the Lord your God will bless you in the land that you are entering to possess.",
      "links": "<a href='/AIV/5/6/5'>Deut. 6:5</a>; <a href='/AIV/5/8/1'>Deut. 8:1</a>",
      "comment": "Life, fertility, and blessing are contingent on faithful love and obedience, combining right belief and action as necessary responses to God’s grace."
    },
    {
      "pk": 5030017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 17,
      "text": "But if your heart turns away and you will not hear, but are drawn away to bow down to other gods and serve them,",
      "links": "<a href='/AIV/5/29/18'>Deut. 29:18</a>",
      "comment": "Disobedience from the heart leads to idolatry. Spiritual infidelity is contrasted with obedient love, reflecting the importance of both faith and works."
    },
    {
      "pk": 5030018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 18,
      "text": "I declare to you today that you shall surely perish. You shall not live long in the land that you are going over the Jordan to possess.",
      "links": "<a href='/AIV/5/4/26'>Deut. 4:26</a>; <a href='/AIV/5/28/63'>Deut. 28:63</a>",
      "comment": "Turning from God inevitably brings destruction; life comes through covenant fidelity—emphasizing the seriousness of sin."
    },
    {
      "pk": 5030019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 19,
      "text": "I call heaven and earth to witness against you today, that I have set before you life and death, blessing and curse. Therefore choose life, so that you and your descendants may live,",
      "links": "<a href='/AIV/5/4/26'>Deut. 4:26</a>; <a href='/AIV/30/4/13'>Amos 4:13</a>",
      "comment": "The appeal to creation as witness underscores the solemnity of this covenant choice. 'Choose life' includes personal and communal responsibility."
    },
    {
      "pk": 5030020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 30,
      "verse": 20,
      "text": "by loving the Lord your God, by obeying His voice, and by holding fast to Him. For He is your life and the length of your days, so that you may dwell in the land that the Lord swore to your fathers, to Abraham, to Isaac, and to Jacob, to give them.",
      "links": "<a href='/AIV/5/4/4'>Deut. 4:4</a>; <a href='/AIV/43/14/6'>John 14:6</a>",
      "comment": "Union with God—through love, obedience, and perseverance—is foundational for true life. This verse looks forward to Christ, who calls Himself 'the life' (John 14:6), fulfilling the promise given to the patriarchs and all God’s people."
    }
  ],
  "translatedAt": "2025-12-24T02:13:56.260Z"
}