{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 23,
  "verses": [
    {
      "pk": 5023001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 1,
      "text": "No man whose genitals have been crushed or cut off may enter the assembly of the LORD.",
      "links": "<a href='/AIV/03/21/17-21'>Lev. 21:17-21</a>; <a href='/AIV/23/56/3-5'>Isa. 56:3-5</a>",
      "comment": "This verse emphasizes ritual purity and physical wholeness in worship. Later, the prophet Isaiah foretells the inclusion of eunuchs, pointing toward the openness of God’s covenant (see Isa. 56:3-5), reflecting a movement from external to internal purity — fulfilled in Christ’s invitation to all (cf. Acts 8:36-39)."
    },
    {
      "pk": 5023002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 2,
      "text": "No one born of a forbidden union may enter the assembly of the LORD. Even to the tenth generation, none of his descendants may enter the assembly of the LORD.",
      "links": "<a href='/AIV/07/11/1-2'>Judg. 11:1-2</a>; <a href='/AIV/40/1/1-6'>Matt. 1:1-6</a>",
      "comment": "This command stresses the importance of lineage and covenant heritage. Note that Jesus’ lineage includes individuals from forbidden unions, showing God’s redemption and fulfillment of the Law."
    },
    {
      "pk": 5023003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 3,
      "text": "No Ammonite or Moabite may enter the assembly of the LORD; even to the tenth generation, none of their descendants may ever enter the assembly of the LORD.",
      "links": "<a href='/AIV/08/4/10'>Ruth 4:10</a>; <a href='/AIV/16/13/1'>Neh. 13:1</a>",
      "comment": "Though Ammonites and Moabites are excluded, Ruth the Moabitess not only is welcomed, but becomes an ancestor of King David and ultimately Christ (see Ruth 4:10, Matt. 1). God’s grace extends beyond legal boundaries, revealing spiritual meaning in the inclusiveness of salvation."
    },
    {
      "pk": 5023004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 4,
      "text": "Because they did not meet you with bread and water on your journey out of Egypt, and because they hired Balaam son of Beor from Pethor in Mesopotamia to curse you.",
      "links": "<a href='/AIV/04/22/5'>Num. 22:5</a>; <a href='/AIV/05/23/5'>Deut. 23:5</a>",
      "comment": "Hostility and lack of charity exclude the Ammonites and Moabites, pointing to the importance of hospitality — a virtue later highlighted as essential in Christian life (Hebrews 13:2)."
    },
    {
      "pk": 5023005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 5,
      "text": "But the LORD your God did not listen to Balaam; instead, the LORD your God turned the curse into a blessing for you, because the LORD your God loves you.",
      "links": "<a href='/AIV/04/23/11'>Num. 23:11</a>; <a href='/AIV/01/50/20'>Gen. 50:20</a>",
      "comment": "God’s sovereignty transforms evil intentions into blessings, foreshadowing Christ’s victory over curses and evil (see Gen. 50:20, Romans 8:28)."
    },
    {
      "pk": 5023006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 6,
      "text": "You shall never seek their peace or prosperity as long as you live.",
      "links": "<a href='/AIV/16/13/2'>Neh. 13:2</a>",
      "comment": "The command maintains separation from nations hostile to Israel. The Church later expands its mission universally, including those formerly excluded (cf. Matt. 28:19)."
    },
    {
      "pk": 5023007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 7,
      "text": "Do not despise the Edomite, for he is your brother. Do not despise the Egyptian, for you were a foreigner in his land.",
      "links": "<a href='/AIV/01/25/25'>Gen. 25:25</a>; <a href='/AIV/02/12/40-41'>Ex. 12:40-41</a>",
      "comment": "Despite past hardships, Israel is called to a spirit of reconciliation, setting an example for forgiveness and unity in the community of faith."
    },
    {
      "pk": 5023008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 8,
      "text": "Children born to them in the third generation may enter the assembly of the LORD.",
      "links": "<a href='/AIV/03/19/34'>Lev. 19:34</a>",
      "comment": "There is mercy in eventual restoration, revealing an openness to conversion and unity after time and repentance."
    },
    {
      "pk": 5023009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 9,
      "text": "When you set up camp against your enemies, you must keep yourself away from every impure thing.",
      "links": "<a href='/AIV/03/15/31'>Lev. 15:31</a>; <a href='/AIV/19/24/3-4'>Ps. 24:3-4</a>",
      "comment": "Purity in battle reflects the need for inner holiness, a concept fulfilled in Christ’s cleansing work and the call to spiritual warfare (Eph. 6:12)."
    },
    {
      "pk": 5023010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 10,
      "text": "If there is any man among you who is not clean because of a nocturnal emission, he must go outside the camp and not reenter until evening.",
      "links": "<a href='/AIV/03/15/16-18'>Lev. 15:16-18</a>",
      "comment": "Physical uncleanness symbolizes spiritual separation. Washing and waiting until evening is reminiscent of later sacramental cleansing and restoration to the community."
    },
    {
      "pk": 5023011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 11,
      "text": "When evening comes, he shall wash himself with water, and after sunset he may return to the camp.",
      "links": "<a href='/AIV/03/22/6-7'>Lev. 22:6-7</a>",
      "comment": "Ritual washing signifies purification and restoration, prefiguring spiritual cleansing found through Christ and the sacraments."
    },
    {
      "pk": 5023012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 12,
      "text": "You shall have a place outside the camp to go and relieve yourself.",
      "links": "<a href='/AIV/03/5/2-4'>Lev. 5:2-4</a>",
      "comment": "Maintaining camp cleanliness is part of reverence for God’s presence among the people. This theme continues in the Christian call to interior and exterior purity."
    },
    {
      "pk": 5023013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 13,
      "text": "You shall have a tool with your gear, and when you relieve yourself outside, you shall dig a hole and cover your excrement.",
      "links": "<a href='/AIV/03/11/33'>Lev. 11:33</a>",
      "comment": "The instruction for hygiene also reflects order, discipline, and respect for the sacred community."
    },
    {
      "pk": 5023014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 14,
      "text": "For the LORD your God walks in the midst of your camp to deliver you and to give up your enemies before you. Therefore your camp must be holy, so that He may not see any indecent thing among you and turn away from you.",
      "links": "<a href='/AIV/03/26/12'>Lev. 26:12</a>; <a href='/AIV/19/15/1'>Ps. 15:1</a>",
      "comment": "God’s dwelling among His people requires holiness and purity. This foreshadows the indwelling Spirit in New Testament believers (1 Cor. 3:16)."
    },
    {
      "pk": 5023015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 15,
      "text": "You shall not hand over to his master a slave who has escaped from his master to you.",
      "links": "<a href='/AIV/02/22/21'>Ex. 22:21</a>; <a href='/AIV/57/1/15-17'>Philemon 15-17</a>",
      "comment": "Sheltering the oppressed reflects God’s justice, a principle reaffirmed in the New Testament emphasis on charity and care (Matt. 25:35-36)."
    },
    {
      "pk": 5023016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 16,
      "text": "He may live among you, wherever he likes within your gates. Do not oppress him.",
      "links": "<a href='/AIV/03/19/33-34'>Lev. 19:33-34</a>",
      "comment": "Showing compassion to strangers points toward the universal invitation to belong to the people of God, prefiguring the welcoming of all nations."
    },
    {
      "pk": 5023017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 17,
      "text": "None of the daughters of Israel shall be a temple prostitute, nor shall any of the sons of Israel be a temple prostitute.",
      "links": "<a href='/AIV/03/19/29'>Lev. 19:29</a>; <a href='/AIV/46/6/15-20'>1 Cor. 6:15-20</a>",
      "comment": "Prohibiting cult prostitution upholds chastity and dignity of worship. In the New Testament, the body is described as a temple of the Holy Spirit (1 Cor. 6)."
    },
    {
      "pk": 5023018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 18,
      "text": "You shall not bring the hire of a prostitute or the wages of a dog into the house of the LORD your God for any vow, for both are an abomination to the LORD your God.",
      "links": "<a href='/AIV/03/22/18-25'>Lev. 22:18-25</a>; <a href='/AIV/39/1/7-8'>Mal. 1:7-8</a>",
      "comment": "God desires offerings that are pure, both spiritually and materially. The spiritual interpretation foreshadows the Christian teaching to offer oneself wholly to God."
    },
    {
      "pk": 5023019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 19,
      "text": "You shall not charge interest to your brother — interest on money, food, or anything that may be lent at interest.",
      "links": "<a href='/AIV/02/22/25'>Ex. 22:25</a>; <a href='/AIV/03/25/36-37'>Lev. 25:36-37</a>",
      "comment": "Charging interest is forbidden among Israelites, emphasizing mutual generosity. This practice finds echoes in later Christian social teaching."
    },
    {
      "pk": 5023020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 20,
      "text": "You may charge interest to a foreigner, but to your brother you shall not charge interest, that the LORD your God may bless you in all that you set your hand to in the land you are entering to possess.",
      "links": "<a href='/AIV/02/22/25'>Ex. 22:25</a>; <a href='/AIV/03/25/36-37'>Lev. 25:36-37</a>",
      "comment": "God’s blessing is tied to mercy within the covenant people, reinforcing a principle of communal charity."
    },
    {
      "pk": 5023021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 21,
      "text": "When you make a vow to the LORD your God, do not delay fulfilling it, for the LORD your God will surely require it of you, and you would be guilty of sin.",
      "links": "<a href='/AIV/21/5/4-5'>Eccl. 5:4-5</a>; <a href='/AIV/40/5/33-37'>Matt. 5:33-37</a>",
      "comment": "Vows are sacred and must be honored promptly. The seriousness of vows echoes in Christ’s call to integrity in speech and promise (Matt. 5:33-37)."
    },
    {
      "pk": 5023022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 22,
      "text": "But if you refrain from making a vow, you will not be guilty.",
      "links": "<a href='/AIV/21/5/5'>Eccl. 5:5</a>",
      "comment": "There is freedom regarding voluntary vows. The spirit of sincerity in commitment is stressed."
    },
    {
      "pk": 5023023,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 23,
      "text": "You shall be careful to do what has passed your lips, for you have voluntarily vowed to the LORD your God what you have promised.",
      "links": "<a href='/AIV/21/5/4-5'>Eccl. 5:4-5</a>",
      "comment": "This repeats the sacredness of keeping one’s word, prefiguring the high Christian emphasis on truthfulness and honor before God."
    },
    {
      "pk": 5023024,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 24,
      "text": "When you enter your neighbor’s vineyard, you may eat your fill of grapes, but do not carry any away in a basket.",
      "links": "<a href='/AIV/03/19/10'>Lev. 19:10</a>; <a href='/AIV/40/12/1-7'>Matt. 12:1-7</a>",
      "comment": "Generosity and restraint are balanced — just enough for personal need, not for profit, encouraging charity and fairness among the people."
    },
    {
      "pk": 5023025,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 23,
      "verse": 25,
      "text": "When you enter your neighbor’s standing grain, you may pluck the heads with your hand, but you shall not wield a sickle on your neighbor’s grain.",
      "links": "<a href='/AIV/40/12/1'>Matt. 12:1</a>; <a href='/AIV/03/19/9-10'>Lev. 19:9-10</a>",
      "comment": "The principle of mercy and provision for the poor is embedded in this law, foreshadowing Christ’s teaching about providing for those in need."
    }
  ],
  "translatedAt": "2025-12-24T02:09:08.287Z"
}