{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 16,
  "verses": [
    {
      "pk": 5016001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 1,
      "text": "Keep the month of Abib, and observe the Passover to the LORD your God; for in the month of Abib the LORD your God brought you out of Egypt by night.",
      "links": "<a href='/AIV/2/12/2-14'>Ex. 12:2-14</a>; <a href='/AIV/3/23/5'>Lev. 23:5</a>",
      "comment": "The month of Abib corresponds to spring, when Passover is celebrated. Passover prefigures Christ as the true Lamb who brings salvation (see 1 Cor. 5:7)."
    },
    {
      "pk": 5016002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 2,
      "text": "And you shall offer the Passover sacrifice to the LORD your God, from the flock and the herd, at the place which the LORD will choose to make His name dwell.",
      "links": "<a href='/AIV/2/12/6'>Ex. 12:6</a>; <a href='/AIV/5/12/5'>Deut. 12:5</a>",
      "comment": "The centralization of worship at one place points towards later ideas of a universal worship centered around God's presence."
    },
    {
      "pk": 5016003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 3,
      "text": "Do not eat with it any leavened bread. For seven days you shall eat unleavened bread with it, the bread of affliction—for you came out of the land of Egypt in haste—so that you may remember the day when you came out of the land of Egypt all the days of your life.",
      "links": "<a href='/AIV/2/12/8-20'>Ex. 12:8-20</a>; <a href='/AIV/3/23/6'>Lev. 23:6</a>",
      "comment": "Unleavened bread symbolizes purity and separation from sin, echoing how Christ, without sin, is our true bread (see John 6:51). The memorial aspect anticipates later forms of worship remembering redemptive acts."
    },
    {
      "pk": 5016004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 4,
      "text": "No leaven shall be seen with you in all your territory for seven days; nor shall any of the flesh that you offer in the evening of the first day remain overnight until morning.",
      "links": "<a href='/AIV/2/12/10'>Ex. 12:10</a>",
      "comment": "The complete removal of leavened bread highlights the seriousness of removal of sin. The requirement of not keeping leftovers emphasizes the sacredness and finality of the offering."
    },
    {
      "pk": 5016005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 5,
      "text": "You may not sacrifice the Passover within any of your towns that the LORD your God is giving you.",
      "links": "<a href='/AIV/5/12/13-14'>Deut. 12:13-14</a>",
      "comment": "Sacrifice is to be made only in the place God chooses, prefiguring the unity of worship and authority in the worshiping community."
    },
    {
      "pk": 5016006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 6,
      "text": "But at the place that the LORD your God will choose to make His name dwell, there you shall offer the Passover sacrifice in the evening at the setting of the sun, at the time you came out of Egypt.",
      "links": "<a href='/AIV/2/12/42'>Ex. 12:42</a>",
      "comment": "This foreshadows the gathering of God’s people to one table and one altar, pointing ahead to later Christian practices around unity in the worship of the one Lord."
    },
    {
      "pk": 5016007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 7,
      "text": "And you shall cook it and eat it in the place which the LORD your God will choose. In the morning you shall return to your tents.",
      "links": "<a href='/AIV/2/12/46-50'>Ex. 12:46-50</a>",
      "comment": "The emphasis on location recalls the importance of sacred places and times. Gathering for worship in one place remains a biblical principle."
    },
    {
      "pk": 5016008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 8,
      "text": "For six days you shall eat unleavened bread, and on the seventh day there shall be a solemn assembly to the LORD your God. You shall do no work on it.",
      "links": "<a href='/AIV/3/23/8'>Lev. 23:8</a>",
      "comment": "The solemn assembly points to the importance of liturgical gatherings and communal worship, anticipating later developments in Christian liturgy."
    },
    {
      "pk": 5016009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 9,
      "text": "You shall count seven weeks; begin to count the seven weeks from the time you start to put the sickle to the standing grain.",
      "links": "<a href='/AIV/3/23/15-16'>Lev. 23:15-16</a>",
      "comment": "This marks the beginning of counting towards the Feast of Weeks (Pentecost), foreshadowing the New Testament Pentecost when the Holy Spirit was given (Acts 2:1)."
    },
    {
      "pk": 5016010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 10,
      "text": "Then you shall keep the Feast of Weeks to the LORD your God with a freewill offering from your hand, which you shall give as the LORD your God blesses you.",
      "links": "<a href='/AIV/2/23/16'>Ex. 23:16</a>; <a href='/AIV/3/23/17'>Lev. 23:17</a>",
      "comment": "The Feast of Weeks celebrates the first fruits and God’s provision, paralleled by the coming of the Holy Spirit as first fruits of the new covenant."
    },
    {
      "pk": 5016011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 11,
      "text": "And you shall rejoice before the LORD your God, you, your son, your daughter, your male and female servant, the Levite who is within your towns, the sojourner, the orphan, and the widow who are among you, at the place which the LORD your God will choose to make His name dwell.",
      "links": "<a href='/AIV/5/14/29'>Deut. 14:29</a>; <a href='/AIV/3/23/22'>Lev. 23:22</a>",
      "comment": "True worship is inclusive of all: family, clergy, strangers, and the poor. This reflects God’s desire for a worshiping community united, transcending social barriers."
    },
    {
      "pk": 5016012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 12,
      "text": "Remember that you were a slave in Egypt; so you shall be careful to observe these statutes.",
      "links": "<a href='/AIV/5/5/15'>Deut. 5:15</a>",
      "comment": "Redemption from slavery is a recurring theme, reminding believers continually of salvation’s cost. This also forms the pattern for later celebrations of redemption in Christian practice."
    },
    {
      "pk": 5016013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 13,
      "text": "You shall keep the Feast of Booths for seven days, when you have gathered in from your threshing floor and your winepress.",
      "links": "<a href='/AIV/3/23/34-39'>Lev. 23:34-39</a>",
      "comment": "The Feast of Booths commemorates Israel’s journey through the wilderness, emphasizing God's protection. Spiritually, it points to the pilgrimage of the Christian life, and thanksgiving for God’s provision."
    },
    {
      "pk": 5016014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 14,
      "text": "You shall rejoice in your feast, you and your son, your daughter, your male and female servant, the Levite, the sojourner, the orphan, and the widow who are within your towns.",
      "links": "<a href='/AIV/5/16/11'>Deut. 16:11</a>",
      "comment": "Joy and community are core to worship; all are called to celebrate together, reflecting a vision of unity and shared blessing."
    },
    {
      "pk": 5016015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 15,
      "text": "For seven days you shall keep the feast to the LORD your God in the place that the LORD will choose, because the LORD your God will bless you in all your produce and in all the work of your hands, so that you will be altogether joyful.",
      "links": "<a href='/AIV/3/23/40-43'>Lev. 23:40-43</a>",
      "comment": "Joy in worship is not optional but the result of God’s blessing. The place chosen by God remains central."
    },
    {
      "pk": 5016016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 16,
      "text": "Three times a year all your males shall appear before the LORD your God in the place that He will choose: at the Feast of Unleavened Bread, at the Feast of Weeks, and at the Feast of Booths. They shall not appear before the LORD empty-handed.",
      "links": "<a href='/AIV/2/23/17'>Ex. 23:17</a>; <a href='/AIV/3/23/14,21,41'>Lev. 23:14,21,41</a>",
      "comment": "Obligatory pilgrimages to the worship site prefigure Christian pilgrimage and attendance at communal worship. The idea of not coming empty-handed implies the offering of one’s best to the Lord."
    },
    {
      "pk": 5016017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 17,
      "text": "Each shall give as he is able, according to the blessing of the LORD your God which He has given you.",
      "links": "<a href='/AIV/2/35/5'>Ex. 35:5</a>; <a href='/AIV/2/25/2'>Ex. 25:2</a>",
      "comment": "Giving is proportionate to God’s blessing, a motif further developed in New Testament teaching on generosity (see 2 Cor. 9:7)."
    },
    {
      "pk": 5016018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 18,
      "text": "You shall appoint judges and officers in all your towns that the LORD your God is giving you, according to your tribes; and they shall judge the people with righteous judgment.",
      "links": "<a href='/AIV/2/18/21-26'>Ex. 18:21-26</a>",
      "comment": "The establishment of a just authority structure is divinely commanded. The concept of appointed spiritual and civic leaders continues in later biblical history."
    },
    {
      "pk": 5016019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 19,
      "text": "You shall not pervert justice. You shall not show partiality, and you shall not take a bribe, for a bribe blinds the eyes of the wise and subverts the cause of the righteous.",
      "links": "<a href='/AIV/2/23/8'>Ex. 23:8</a>; <a href='/AIV/3/19/15'>Lev. 19:15</a>",
      "comment": "Justice is central to God’s law. The command not to show partiality is echoed in the teachings of Jesus and the apostles (see Jas. 2:1-9)."
    },
    {
      "pk": 5016020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 20,
      "text": "Righteousness, righteousness you shall pursue, so that you may live and possess the land which the LORD your God is giving you.",
      "links": "<a href='/AIV/3/19/15'>Lev. 19:15</a>",
      "comment": "The repetition emphasizes the absolute necessity of living righteously—a theme picked up in the Beatitudes (Matt. 5:6)."
    },
    {
      "pk": 5016021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 21,
      "text": "You shall not plant any tree as an Asherah beside the altar of the LORD your God that you shall make.",
      "links": "<a href='/AIV/2/34/13'>Ex. 34:13</a>; <a href='/AIV/5/7/5'>Deut. 7:5</a>",
      "comment": "Asherah poles were associated with pagan worship. Mixing idols with the true worship of God is strictly forbidden, ensuring purity in worship (cf. 1 Cor. 10:21)."
    },
    {
      "pk": 5016022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 16,
      "verse": 22,
      "text": "And you shall not set up a pillar, which the LORD your God hates.",
      "links": "<a href='/AIV/2/23/24'>Ex. 23:24</a>",
      "comment": "Pillars were objects of idolatrous worship. The LORD’s hatred of such things underscores the requirement for exclusive, pure devotion and foreshadows later commands to separate from all forms of syncretism."
    }
  ],
  "translatedAt": "2025-12-24T02:05:42.925Z"
}