{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 4,
  "verses": [
    {
      "pk": 5004001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 1,
      "text": "Now, Israel, listen to the statutes and commands I am teaching you to do, so that you may live and enter and possess the land that the LORD, the God of your fathers, is giving you.",
      "links": "<a href='/AIV/2/15/26'>Ex. 15:26</a>; <a href='/AIV/5/6/1'>Deut. 6:1</a>",
      "comment": "Moses urges obedience to God's Law as the path to true life and inheritance. Note the connection between faith and living out God's commands, which foreshadows the later link between faith and works as seen in James 2:17."
    },
    {
      "pk": 5004002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 2,
      "text": "Do not add to the word that I command you, nor take away from it, so that you may keep the commandments of the LORD your God which I command you.",
      "links": "<a href='/AIV/20/30/6'>Prov. 30:6</a>; <a href='/AIV/66/22/18'>Rev. 22:18–19</a>",
      "comment": "God’s revelation is complete in His commands; tampering with the Word is forbidden, echoing similar warnings in Revelation 22:18-19. This safeguards the integrity of divine truth handed down through generations."
    },
    {
      "pk": 5004003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 3,
      "text": "Your eyes have seen what the LORD did at Baal Peor; for the LORD your God destroyed from among you all the men who followed Baal of Peor.",
      "links": "<a href='/AIV/4/25/3'>Num. 25:3–5</a>",
      "comment": "A reference to God’s judgment on idolatry, reminding Israel that allegiance to God alone is necessary for survival. This warns against spiritual infidelity, with New Testament parallels in 1 Corinthians 10:6-11."
    },
    {
      "pk": 5004004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 4,
      "text": "But you who held fast to the LORD your God are all alive today.",
      "links": "<a href='/AIV/19/63/8'>Ps. 63:8</a>",
      "comment": "Faithfulness to God results in life. Clinging to God’s covenant points to the perseverance of the saints and the promise of eternal life in Christ (John 15:4)."
    },
    {
      "pk": 5004005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 5,
      "text": "See, I have taught you statutes and judgments just as the LORD my God commanded me, that you should do them in the land you are entering to possess.",
      "links": "<a href='/AIV/5/5/31'>Deut. 5:31</a>",
      "comment": "The transmission of divine law through Moses prefigures the handing down of sacred teachings and tradition by the apostles (2 Thessalonians 2:15)."
    },
    {
      "pk": 5004006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 6,
      "text": "Keep them and do them, for that will be your wisdom and your understanding in the sight of the peoples, who will hear all these statutes and say, ‘Surely this great nation is a wise and understanding people.’",
      "links": "<a href='/AIV/19/111/10'>Ps. 111:10</a>",
      "comment": "Living according to God’s commands marks Israel as distinguished; true wisdom comes from obeying divine law. In Christ, the Church becomes the light to the nations (Matthew 5:14-16)."
    },
    {
      "pk": 5004007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 7,
      "text": "For what great nation is there that has a god so near to it as the LORD our God is to us whenever we call on Him?",
      "links": "<a href='/AIV/19/145/18'>Ps. 145:18</a>; <a href='/AIV/44/17/27'>Acts 17:27</a>",
      "comment": "God’s nearness through covenant relationship mirrors the closeness believers enjoy through prayer, ultimately fulfilled in Christ through the indwelling of the Holy Spirit (John 14:23)."
    },
    {
      "pk": 5004008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 8,
      "text": "And what great nation is there that has statutes and judgments so righteous as all this law that I set before you today?",
      "links": "<a href='/AIV/19/19/7'>Ps. 19:7-9</a>",
      "comment": "The moral excellence of God’s law stands out among all nations, reflecting divine justice. Christ’s sermon on the mount (Matthew 5–7) further unveils God’s standard of righteousness."
    },
    {
      "pk": 5004009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 9,
      "text": "Only be careful, and greatly guard your soul, lest you forget the things your eyes have seen, and lest they depart from your heart all the days of your life. Make them known to your children and your grandchildren.",
      "links": "<a href='/AIV/19/78/4'>Ps. 78:4</a>; <a href='/AIV/5/6/6-7'>Deut. 6:6-7</a>",
      "comment": "Transmission of faith from generation to generation is commanded; spiritual formation in families, especially through memory and teaching, is foundational for continuity of belief (Ephesians 6:4)."
    },
    {
      "pk": 5004010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 10,
      "text": "On the day you stood before the LORD your God at Horeb, the LORD said to me, ‘Gather the people to Me, so I may let them hear My words, that they may learn to fear Me all the days they live on the earth, and that they may teach their children.’",
      "links": "<a href='/AIV/2/19/9'>Ex. 19:9</a>; <a href='/AIV/5/6/2'>Deut. 6:2</a>",
      "comment": "The call to gather and listen forms the basis for communal worship and hearing the Word, a practice continued in Christian liturgy which brings God's people together in reverence."
    },
    {
      "pk": 5004011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 11,
      "text": "And you came near and stood at the foot of the mountain, and the mountain burned with fire to the heart of heaven, with darkness, cloud, and thick gloom.",
      "links": "<a href='/AIV/2/19/18'>Ex. 19:18</a>; <a href='/AIV/58/12/18'>Heb. 12:18-21</a>",
      "comment": "God’s manifest presence is awesome and fearful, recalling the sacredness of encounters with Him. Underscores transcendence and holiness, elements present in worship and sacramental encounters."
    },
    {
      "pk": 5004012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 12,
      "text": "Then the LORD spoke to you out of the midst of the fire. You heard the sound of words, but saw no form—there was only a voice.",
      "links": "<a href='/AIV/2/19/19'>Ex. 19:19</a>; <a href='/AIV/5/5/24'>Deut. 5:24</a>",
      "comment": "God reveals Himself by speaking, not by an image. Later, God’s self-revelation will come most fully in the Word made flesh (John 1:14)."
    },
    {
      "pk": 5004013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 13,
      "text": "He declared to you His covenant, which He commanded you to do—the Ten Words—and He wrote them on two tablets of stone.",
      "links": "<a href='/AIV/2/34/28'>Ex. 34:28</a>; <a href='/AIV/5/10/4'>Deut. 10:4</a>",
      "comment": "‘Ten Words’ refers to the Ten Commandments. They form the heart of God’s moral law, later summarized by Christ as love of God and neighbor (Matthew 22:37-40)."
    },
    {
      "pk": 5004014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 14,
      "text": "And the LORD commanded me at that time to teach you statutes and judgments, that you might do them in the land you are crossing over to possess.",
      "links": "<a href='/AIV/5/6/1'>Deut. 6:1</a>",
      "comment": "Emphasizes both the reception and transmission of divine teaching—illustrates the necessity for authoritative teaching offices within the believing community."
    },
    {
      "pk": 5004015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 15,
      "text": "Therefore, pay great attention to yourselves, for you saw no form on the day the LORD spoke to you at Horeb out of the midst of the fire.",
      "links": "<a href='/AIV/5/4/12'>Deut. 4:12</a>",
      "comment": "God’s transcendence is expressed by the absence of visible form; fosters pure worship without images, preparing for the incarnational mystery when God becomes visible in Christ."
    },
    {
      "pk": 5004016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 16,
      "text": "Lest you act corruptly and make for yourselves a carved image in the form of any figure—the likeness of male or female.",
      "links": "<a href='/AIV/2/20/4'>Ex. 20:4</a>",
      "comment": "Warns against idolatry and human attempts to depict the divine, keeping the distinction between Creator and creation. Idolatry is spiritual adultery, a recurring biblical theme."
    },
    {
      "pk": 5004017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 17,
      "text": "The likeness of any animal that is on the earth, the likeness of any winged bird that flies in the sky,",
      "links": "<a href='/AIV/45/1/23'>Rom. 1:23</a>",
      "comment": "Expands the warning to all created things. This anticipates the New Testament condemnation of exchanging the glory of God for images (Romans 1:23)."
    },
    {
      "pk": 5004018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 18,
      "text": "The likeness of anything that creeps on the ground, or the likeness of any fish that is in the waters beneath the earth;",
      "links": "<a href='/AIV/1/1/20'>Gen. 1:20</a>",
      "comment": "Inclusion of all categories of animals reaffirms the prohibition against equating God with created beings, a teaching foundational to biblical theology."
    },
    {
      "pk": 5004019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 19,
      "text": "And lest you lift your eyes to heaven, and see the sun, moon, and stars, all the host of heaven, and be drawn to worship and serve them, things the LORD your God has allotted to all peoples under the whole heaven.",
      "links": "<a href='/AIV/2/20/4-5'>Ex. 20:4-5</a>; <a href='/AIV/45/1/25'>Rom. 1:25</a>",
      "comment": "Prohibits the worship of heavenly bodies. Creation is for humanity’s benefit, not as objects of worship. The passage affirms God’s sovereignty over all creation."
    },
    {
      "pk": 5004020,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 20,
      "text": "But the LORD took you and brought you out of the iron furnace, out of Egypt, to be a people of His possession, as you are this day.",
      "links": "<a href='/AIV/11/8/51'>1 Kings 8:51</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "Israel is delivered and set apart as God’s own people, prefiguring the Church as God’s treasured possession (1 Peter 2:9)."
    },
    {
      "pk": 5004021,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 21,
      "text": "Furthermore, the LORD was angry with me because of you, and swore that I should not cross the Jordan, nor enter that good land which the LORD your God is giving you as an inheritance.",
      "links": "<a href='/AIV/5/3/26'>Deut. 3:26–27</a>",
      "comment": "Moses’ exclusion from the promised land demonstrates the seriousness of God’s justice, but also points forward to the One who ultimately brings the people into the true inheritance."
    },
    {
      "pk": 5004022,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 22,
      "text": "For I must die in this land; I must not cross the Jordan. But you shall cross over and possess that good land.",
      "links": "<a href='/AIV/5/31/2'>Deut. 31:2</a>",
      "comment": "Moses contrasts his fate with the people’s, highlighting leadership transition. Joshua will lead, symbolizing the need for faithful succession in guiding God’s people."
    },
    {
      "pk": 5004023,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 23,
      "text": "Take care, lest you forget the covenant of the LORD your God, which He made with you, and make for yourselves a carved image in any form, which the LORD your God has forbidden.",
      "links": "<a href='/AIV/19/106/19'>Ps. 106:19</a>",
      "comment": "Faithfulness to covenant is central—the danger of forgetting leads to idolatry. This anticipates the need for constant renewal of faith and remembrance through established means."
    },
    {
      "pk": 5004024,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 24,
      "text": "For the LORD your God is a consuming fire, a jealous God.",
      "links": "<a href='/AIV/58/12/29'>Heb. 12:29</a>; <a href='/AIV/2/34/14'>Ex. 34:14</a>",
      "comment": "God’s holiness and zeal for exclusive worship are compared to fire. The image recurs in Hebrews 12:29, now seen in Christ as the perfect bridge between judgment and mercy."
    },
    {
      "pk": 5004025,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 25,
      "text": "When you have children and grandchildren, and have lived long in the land, if you act corruptly and make a carved image in any form, and do what is evil in the sight of the LORD your God, so as to provoke Him to anger,",
      "links": "<a href='/AIV/5/31/29'>Deut. 31:29</a>",
      "comment": "The warning looks far into Israel’s future, indicating the ongoing importance of generational faithfulness and the dangers of apostasy."
    },
    {
      "pk": 5004026,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 26,
      "text": "I call heaven and earth to witness against you today, that you will surely perish quickly from the land you are crossing the Jordan to possess; you shall not prolong your days in it, but shall be utterly destroyed.",
      "links": "<a href='/AIV/5/30/19'>Deut. 30:19</a>",
      "comment": "The invocation of heaven and earth recalls the legal formality and the cosmic scope of the covenant, reinforcing that apostasy leads to judgment."
    },
    {
      "pk": 5004027,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 27,
      "text": "And the LORD will scatter you among the peoples, and you will be left few in number among the nations where the LORD will drive you.",
      "links": "<a href='/AIV/5/28/64'>Deut. 28:64</a>; <a href='/AIV/24/9/16'>Jer. 9:16</a>",
      "comment": "Prophecy of exile, fulfilled in later history. Scattering prefigures the spiritual dispersion and ultimate gathering through a central authority."
    },
    {
      "pk": 5004028,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 28,
      "text": "There you will serve gods, the work of human hands, wood and stone, which neither see nor hear nor eat nor smell.",
      "links": "<a href='/AIV/19/115/4-7'>Ps. 115:4-7</a>",
      "comment": "Idols lack true power and presence—a strong contrast to the living God who speaks and hears. The verse also underscores the need for authentic worship."
    },
    {
      "pk": 5004029,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 29,
      "text": "But from there, you will seek the LORD your God and you will find Him, if you seek Him with all your heart and with all your soul.",
      "links": "<a href='/AIV/24/29/13'>Jer. 29:13</a>; <a href='/AIV/40/7/7'>Matt. 7:7</a>",
      "comment": "The whole-hearted search for God is central—in the New Testament, Christ affirms this promise personally (Matthew 7:7)."
    },
    {
      "pk": 5004030,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 30,
      "text": "When you are in tribulation, and all these things come upon you in the latter days, you will return to the LORD your God and obey His voice.",
      "links": "<a href='/AIV/5/30/2'>Deut. 30:2</a>",
      "comment": "God’s grace allows return even after exile and judgment. Points to future moments of repentance, a theme fulfilled in salvation history."
    },
    {
      "pk": 5004031,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 31,
      "text": "For the LORD your God is a merciful God; He will not abandon you or destroy you, nor forget the covenant with your fathers that He swore to them.",
      "links": "<a href='/AIV/19/103/8'>Ps. 103:8</a>; <a href='/AIV/45/11/29'>Rom. 11:29</a>",
      "comment": "God’s covenant fidelity and mercy are highlighted, which continue to be fundamental attributes throughout all salvation history and new covenant."
    },
    {
      "pk": 5004032,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 32,
      "text": "Ask now about the former days, long before you, since the day God created man on the earth, and from one end of heaven to the other: Has anything this great ever happened, or been heard of?",
      "links": "<a href='/AIV/1/1/27'>Gen. 1:27</a>; <a href='/AIV/19/77/11'>Ps. 77:11</a>",
      "comment": "Israel is invited to contemplate salvation history—from creation onward—to recognize the uniqueness of God’s acts and calling."
    },
    {
      "pk": 5004033,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 33,
      "text": "Has any people heard the voice of God speaking out of the midst of the fire, as you have heard, and lived?",
      "links": "<a href='/AIV/5/5/24'>Deut. 5:24</a>",
      "comment": "God’s self-revelation to Israel is unparalleled, foreshadowing the even deeper revelation in the Incarnation (Heb. 1:1-3)."
    },
    {
      "pk": 5004034,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 34,
      "text": "Or has any god tried to go and take for himself a nation out of the midst of another nation, by trials, signs, wonders, by war, by a mighty hand and an outstretched arm, and by awesome deeds, as the LORD your God did for you in Egypt before your eyes?",
      "links": "<a href='/AIV/2/7/19'>Ex. 7:19</a>; <a href='/AIV/5/26/8'>Deut. 26:8</a>",
      "comment": "Describes the mighty acts of God in delivering Israel, paralleling Christ’s unique work of redemption."
    },
    {
      "pk": 5004035,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 35,
      "text": "You were shown this, so that you might know that the LORD is God; there is none besides Him.",
      "links": "<a href='/AIV/23/45/5'>Isa. 45:5</a>",
      "comment": "The absolute uniqueness of the LORD is a central theme—‘none besides Him’ is echoed in the New Testament’s monotheism (Mark 12:29-32)."
    },
    {
      "pk": 5004036,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 36,
      "text": "Out of heaven He let you hear His voice, to instruct you; and on earth He let you see His great fire, and you heard His words out of the midst of the fire.",
      "links": "<a href='/AIV/5/4/12'>Deut. 4:12</a>",
      "comment": "God’s instruction is both transcendent and immanent, foreshadowing the union of divinity and humanity in the Incarnation, where word and presence are united."
    },
    {
      "pk": 5004037,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 37,
      "text": "And because He loved your fathers and chose their descendants after them, He brought you out of Egypt with His presence, by His mighty power;",
      "links": "<a href='/AIV/5/7/7-8'>Deut. 7:7-8</a>",
      "comment": "God’s election stems from love, not merit—a motif deepened in the New Testament concept of grace and election (Romans 8:28-30)."
    },
    {
      "pk": 5004038,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 38,
      "text": "To drive out before you nations greater and mightier than you, to bring you in, to give you their land for an inheritance, as it is this day.",
      "links": "<a href='/AIV/5/7/1'>Deut. 7:1</a>",
      "comment": "God's acts fulfill His promise. The concept of inheritance echoes the greater spiritual inheritance of eternal life in Christ (Ephesians 1:11)."
    },
    {
      "pk": 5004039,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 39,
      "text": "Know therefore today, and take to heart, that the LORD is God in heaven above and on earth beneath; there is no other.",
      "links": "<a href='/AIV/19/135/5'>Ps. 135:5</a>; <a href='/AIV/44/4/12'>Acts 4:12</a>",
      "comment": "The exclusive claim of God’s sovereignty; in Acts 4:12, the exclusivity transfers to salvation in Christ."
    },
    {
      "pk": 5004040,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 40,
      "text": "So keep His statutes and His commandments which I command you today, that it may go well with you and with your children after you, and that you may prolong your days in the land which the LORD your God is giving you for all time.",
      "links": "<a href='/AIV/5/6/2'>Deut. 6:2</a>",
      "comment": "Obedience is tied to blessing and endurance. Continuity of faithfulness is seen in the Christian understanding of the perseverance of the saints."
    },
    {
      "pk": 5004041,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 41,
      "text": "Then Moses set apart three cities across the Jordan toward the east,",
      "links": "<a href='/AIV/5/19/2'>Deut. 19:2</a>",
      "comment": "Setting apart cities of refuge establishes a system of justice and mercy, anticipating later developments in community care and discipline."
    },
    {
      "pk": 5004042,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 42,
      "text": "That the manslayer might flee there, who kills his neighbor unintentionally and did not hate him previously, so that, fleeing to one of these cities, he might live:",
      "links": "<a href='/AIV/4/35/15'>Num. 35:15</a>",
      "comment": "Law of asylum for involuntary manslaughter underscores mercy and just process—parallels the grace offered to those who repent."
    },
    {
      "pk": 5004043,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 43,
      "text": "Bezer in the wilderness, in the land of the Reubenites; Ramoth in Gilead, for the Gadites; and Golan in Bashan, for the Manassites.",
      "links": "<a href='/AIV/5/19/4'>Deut. 19:4-7</a>",
      "comment": "Details of the cities of refuge; geographic placement reinforces structure and order in community life."
    },
    {
      "pk": 5004044,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 44,
      "text": "Now this is the law that Moses set before the children of Israel.",
      "links": "<a href='/AIV/5/12/1'>Deut. 12:1</a>",
      "comment": "A summary marker, emphasizes formality of the giving of the law. The use of mediators to transmit divine law foreshadows the apostolic authority in the New Testament."
    },
    {
      "pk": 5004045,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 45,
      "text": "These are the testimonies, the statutes, and the judgments which Moses spoke to the children of Israel after they came out of Egypt,",
      "links": "<a href='/AIV/5/12/1'>Deut. 12:1</a>",
      "comment": "Further summary indicates the completeness and divine origin of the Law. The structure assists memorization and formation, anticipates Christian catechesis."
    },
    {
      "pk": 5004046,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 46,
      "text": "Beyond the Jordan, in the valley opposite Beth Peor, in the land of Sihon king of the Amorites, who lived at Heshbon, whom Moses and the children of Israel defeated when they came out of Egypt.",
      "links": "<a href='/AIV/4/21/23'>Num. 21:23-26</a>",
      "comment": "Sets the historical context of the lawgiving, rooting spiritual life in real events—a pattern seen in the Church’s remembrance of salvation history."
    },
    {
      "pk": 5004047,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 47,
      "text": "And they took possession of his land and the land of Og king of Bashan, two kings of the Amorites, who were across the Jordan to the east—",
      "links": "<a href='/AIV/4/21/33'>Num. 21:33-35</a>",
      "comment": "Victory and inheritance fulfill the promise made to the patriarchs, highlighting the faithfulness of God."
    },
    {
      "pk": 5004048,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 48,
      "text": "From Aroer, which is on the edge of the Valley of the Arnon, even to Mount Sion (that is, Hermon),",
      "links": "<a href='/AIV/5/3/9'>Deut. 3:9</a>",
      "comment": "Geographical markers again root the narrative in history, essential for both historical and spiritual meaning."
    },
    {
      "pk": 5004049,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 4,
      "verse": 49,
      "text": "And all the Arabah east of the Jordan, as far as the Sea of the Arabah, below the slopes of Pisgah.",
      "links": "<a href='/AIV/5/3/17'>Deut. 3:17</a>",
      "comment": "Final territorial details lay the groundwork for the division of the promised land, which typologically prefigures the spiritual inheritance available to all believers through Christ."
    }
  ],
  "translatedAt": "2025-12-24T01:58:43.277Z"
}