{
  "book": 5,
  "bookName": "Deuteronomy",
  "bookAbbreviation": "Deut",
  "chapter": 25,
  "verses": [
    {
      "pk": 5025001,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 1,
      "text": "If there is a dispute between men, and they come before the judges, and they judge them, and declare the righteous innocent and pronounce the wicked guilty,",
      "links": "<a href='/AIV/2/23/7'>Ex. 23:7</a>; <a href='/AIV/5/16/18'>Deut. 16:18</a>",
      "comment": "This verse establishes the principle of justice through judges, a theme that echoes through Scripture. Notice the role of authorized judgment among God's people, prefiguring the divine authority given to church leaders in the New Testament (see <a href='/AIV/40/16/19'>Matt. 16:19</a>)."
    },
    {
      "pk": 5025002,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 2,
      "text": "then if the guilty man deserves to be beaten, the judge shall cause him to lie down and be beaten in his presence, with a number of stripes according to his guilt.",
      "links": "<a href='/AIV/2/21/20'>Ex. 21:20</a>; <a href='/AIV/20/19/29'>Prov. 19:29</a>",
      "comment": "Corporal punishment was not arbitrary, highlighting proportional justice. This points to the biblical balance of justice and mercy, seen ultimately in Christ’s atoning sacrifice which satisfies justice while bringing mercy (<a href='/AIV/45/3/25'>Rom. 3:25-26</a>)."
    },
    {
      "pk": 5025003,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 3,
      "text": "He may be given forty lashes, but not more, so that if he is beaten with more stripes than these, your brother is not degraded in your sight.",
      "links": "<a href='/AIV/47/11/24'>2 Cor. 11:24</a>; <a href='/AIV/5/17/8'>Deut. 17:8</a>",
      "comment": "Limiting lashes upholds human dignity and mercy—anticipating Christ’s command to love one another (<a href='/AIV/43/13/34'>John 13:34</a>). Jewish practice sometimes stopped at 39 stripes to avoid accidental excess."
    },
    {
      "pk": 5025004,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 4,
      "text": "You shall not muzzle an ox when it is treading out the grain.",
      "links": "<a href='/AIV/46/9/9'>1 Cor. 9:9</a>; <a href='/AIV/54/5/18'>1 Tim. 5:18</a>",
      "comment": "Paul cites this law to show that those who labor in spiritual work should share in its fruits, affirming a principle of support for those entrusted with teaching and leading the Church."
    },
    {
      "pk": 5025005,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 5,
      "text": "If brothers dwell together, and one of them dies without having a son, the wife of the dead man shall not marry outside of the family to a stranger. Her husband's brother shall take her as his wife and perform the duty of a brother-in-law to her.",
      "links": "<a href='/AIV/1/38/8'>Gen. 38:8</a>; <a href='/AIV/40/22/24'>Matt. 22:24</a>",
      "comment": "This law supports the preservation of family lineage—a vital issue in salvation history. It prepares the way for the genealogy of Jesus (as in <a href='/AIV/40/1/5'>Matt. 1:5</a>), and hints at deeper spiritual realities of kinship within the People of God."
    },
    {
      "pk": 5025006,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 6,
      "text": "And the first son whom she bears shall succeed in the name of his dead brother, that his name may not be blotted out of Israel.",
      "links": "<a href='/AIV/8/4/5-10'>Ruth 4:5-10</a>; <a href='/AIV/40/22/24'>Matt. 22:24</a>",
      "comment": "The concern for the family name reflects a biblical focus on memory and inheritance. Spiritually, this points to believers being adopted into a new family in Christ (<a href='/AIV/45/8/15'>Rom. 8:15-17</a>)."
    },
    {
      "pk": 5025007,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 7,
      "text": "But if the man does not wish to take his brother’s wife, then his brother’s wife shall go up to the elders at the gate and say, 'My husband's brother refuses to set up a name for his brother in Israel; he will not perform the duty of a brother-in-law to me.'",
      "links": "<a href='/AIV/8/4/7'>Ruth 4:7</a>",
      "comment": "This shows the role of elders in settling disputes, again highlighting divinely established leadership. The gate was the place of authority, paralleling later practices in Church councils and decision-making."
    },
    {
      "pk": 5025008,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 8,
      "text": "Then the elders of his city shall summon him and speak to him. If he persists and says, 'I do not wish to take her,'",
      "links": "<a href='/AIV/8/4/8'>Ruth 4:8</a>",
      "comment": "Persistence in refusing this duty brought public shame—a visible sign of the seriousness of communal responsibility, which foreshadows the call to mutual responsibility within the Christian community."
    },
    {
      "pk": 5025009,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 9,
      "text": "then his brother's wife shall go up to him in the presence of the elders, pull his sandal off his foot and spit in his face. She shall answer and say, 'So shall it be done to the man who does not build up his brother's house.'",
      "links": "<a href='/AIV/8/4/7-8'>Ruth 4:7-8</a>",
      "comment": "Removal of the sandal and public shaming is a ritual act. Such symbols are important throughout Scripture (see <a href='/AIV/2/3/5'>Ex. 3:5</a>). This incidentally connects to the book of Ruth and the ancestry of Christ."
    },
    {
      "pk": 5025010,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 10,
      "text": "And his name shall be called in Israel, 'The house of him who had his sandal removed.'",
      "links": "<a href='/AIV/8/4/8'>Ruth 4:8</a>",
      "comment": "A man’s failure in duty leads to lasting public memory—a reminder of the importance of faithfully fulfilling one’s responsibilities in God’s family."
    },
    {
      "pk": 5025011,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 11,
      "text": "If two men are fighting with each other, and the wife of one comes near to rescue her husband from the hand of him who is beating him, and puts out her hand and seizes him by the private parts,",
      "links": "",
      "comment": "This specific law is about personal boundaries and protecting human dignity, which has deeper implications for sexual purity and respecting the order established by God."
    },
    {
      "pk": 5025012,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 12,
      "text": "then you shall cut off her hand; your eye shall have no pity.",
      "links": "<a href='/AIV/5/19/21'>Deut. 19:21</a>",
      "comment": "The seriousness of the penalty underscores the importance of discipline and societal order in Israel—principles that are later fulfilled in the call to holiness and order in the life of the Church (<a href='/AIV/40/18/17'>Matt. 18:17</a>)."
    },
    {
      "pk": 5025013,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 13,
      "text": "You shall not have in your bag differing weights, a heavy and a light.",
      "links": "<a href='/AIV/3/19/35-36'>Lev. 19:35-36</a>; <a href='/AIV/20/20/10'>Prov. 20:10</a>",
      "comment": "This law condemns dishonesty in business. Scripture consistently calls for integrity—a foundation for right worship and faithful living. ‘Weights and measures’ became symbols for justice and judgment."
    },
    {
      "pk": 5025014,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 14,
      "text": "You shall not have in your house differing measures, a large and a small.",
      "links": "<a href='/AIV/20/16/11'>Prov. 16:11</a>",
      "comment": "Repeating the admonition against cheating, this verse affirms the importance of honesty and consistent standards both in public and private life—a constant biblical theme that shapes the tradition of ethical living."
    },
    {
      "pk": 5025015,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 15,
      "text": "You shall have a full and just weight, a full and just measure, so that your days may be long in the land that the LORD your God is giving you.",
      "links": "<a href='/AIV/3/19/36'>Lev. 19:36</a>; <a href='/AIV/20/11/1'>Prov. 11:1</a>",
      "comment": "Promise of blessing is tied to justice and uprightness. Obedience is not only moral but covenantal, forming a people set apart for the Lord—prefiguring the mission of the Church as a holy and just community."
    },
    {
      "pk": 5025016,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 16,
      "text": "For all who do such things, all who act dishonestly, are an abomination to the LORD your God.",
      "links": "<a href='/AIV/20/20/23'>Prov. 20:23</a>",
      "comment": "Dishonesty is described in strong moral terms, showing that external actions reflect internal spiritual realities—a theme Jesus later upholds (<a href='/AIV/40/15/18-20'>Matt. 15:18-20</a>)."
    },
    {
      "pk": 5025017,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 17,
      "text": "Remember what Amalek did to you on the way as you came out of Egypt,",
      "links": "<a href='/AIV/2/17/8-16'>Ex. 17:8-16</a>; <a href='/AIV/9/15/2-3'>1 Sam. 15:2-3</a>",
      "comment": "Recollection of Amalek’s attack frames Israel’s journey as spiritual warfare—the New Testament later applies such themes to the Church’s battle against sin and evil (<a href='/AIV/49/6/12'>Eph. 6:12</a>)."
    },
    {
      "pk": 5025018,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 18,
      "text": "how he met you on the way and attacked your rear, all who were weak and lagging behind you, when you were faint and weary; and he did not fear God.",
      "links": "<a href='/AIV/2/17/8-13'>Ex. 17:8-13</a>",
      "comment": "Amalek’s targeting of the weak illustrates the evil of preying on the vulnerable—contrasted with Christ’s care for the least (<a href='/AIV/40/25/40'>Matt. 25:40</a>)."
    },
    {
      "pk": 5025019,
      "translation": "AIV",
      "book": 5,
      "bookName": "Deuteronomy",
      "bookAbbreviation": "Deut",
      "chapter": 25,
      "verse": 19,
      "text": "Therefore, when the LORD your God gives you rest from all your enemies around you, in the land that the LORD your God is giving you as an inheritance to possess, you shall blot out the memory of Amalek from under heaven. Do not forget.",
      "links": "<a href='/AIV/9/15/3'>1 Sam. 15:3</a>; <a href='/AIV/2/17/14'>Ex. 17:14</a>",
      "comment": "Complete obedience to divine command symbolizes the ultimate victory over evil. This points forward to Christ's final triumph over the powers of darkness. 'Do not forget' is a call to faithful remembrance—a key theme in worship and spiritual life (<a href='/AIV/42/22/19'>Luke 22:19</a>)."
    }
  ],
  "translatedAt": "2025-12-24T02:10:24.050Z"
}