{
  "book": 71,
  "bookName": "3 John",
  "bookAbbreviation": "3John",
  "chapter": 1,
  "verses": [
    {
      "pk": 71001001,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 1,
      "text": "The elder, to the beloved Gaius, whom I truly love in the truth.",
      "links": "<a href='/AIV/62/2/1'>1 John 2:1</a>; <a href='/AIV/62/4/1'>1 John 4:1</a>",
      "comment": "John calls himself 'the elder,' signaling both authority and pastoral care. His love 'in truth' emphasizes fidelity to Christ, blending doctrinal reality and charity—a model for authentically united Christian fellowship."
    },
    {
      "pk": 71001002,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 2,
      "text": "Beloved, I pray that you may prosper in all things and be in good health, just as your soul prospers.",
      "links": "<a href='/AIV/62/1/2'>1 John 1:2</a>; <a href='/AIV/19/67/7'>Psalm 67:7</a>",
      "comment": "John shows care for both the physical and spiritual wellbeing of Gaius. The prayer for holistic prosperity reflects early Christian concern for the whole person, echoing biblical teaching on unity of soul and body."
    },
    {
      "pk": 71001003,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 3,
      "text": "I rejoiced greatly when brothers came and testified about your truth, how you walk in truth.",
      "links": "<a href='/AIV/62/2/4'>1 John 2:4</a>; <a href='/AIV/43/8/31-32'>John 8:31-32</a>",
      "comment": "Walking in truth is living according to the gospel and apostolic teaching. Early Christians bore witness (literally 'martureó'), showing the importance of communal accountability and faithful living."
    },
    {
      "pk": 71001004,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 4,
      "text": "I have no greater joy than this: to hear that my children are walking in the truth.",
      "links": "<a href='/AIV/62/2/6'>1 John 2:6</a>; <a href='/AIV/20/23/24'>Proverbs 23:24</a>",
      "comment": "John refers to disciples as 'children,' representing spiritual fatherhood—rooted in apostolic succession. True joy for a leader is found in the faithfulness of those under his spiritual care."
    },
    {
      "pk": 71001005,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 5,
      "text": "Beloved, you do faithfully in whatever you do for the brothers—even though they are strangers.",
      "links": "<a href='/AIV/40/25/40'>Matthew 25:40</a>; <a href='/AIV/58/13/2'>Hebrews 13:2</a>",
      "comment": "Hospitality is a Christian virtue, reflecting Christ’s teaching to love those unknown to us. Welcoming traveling evangelists and missionaries upheld unity and expanded the reach of the Church."
    },
    {
      "pk": 71001006,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 6,
      "text": "These brothers have testified to your love before the church. You will do well to send them on their way in a manner worthy of God.",
      "links": "<a href='/AIV/45/12/13'>Romans 12:13</a>; <a href='/AIV/52/5/12'>1 Thessalonians 5:12</a>",
      "comment": "'Church' is mentioned here as the visible gathered community. Manifesting love publicly and supporting missionaries underscores the duty of every Christian to sustain the mission in a fitting, reverent way."
    },
    {
      "pk": 71001007,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 7,
      "text": "For they set out for the sake of the Name, accepting nothing from the Gentiles.",
      "links": "<a href='/AIV/44/5/41'>Acts 5:41</a>; <a href='/AIV/40/10/8-10'>Matthew 10:8-10</a>",
      "comment": "Missionaries relied only on Christian support, not outsiders, showing faith in God’s provision and avoiding accusation of self-interest in ministry. 'For the sake of the Name' points to devotion to Jesus."
    },
    {
      "pk": 71001008,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 8,
      "text": "Therefore, we ought to support such people, so that we can be fellow workers in the truth.",
      "links": "<a href='/AIV/46/3/9'>1 Corinthians 3:9</a>; <a href='/AIV/50/4/3'>Philippians 4:3</a>",
      "comment": "Supporting those who proclaim the gospel makes believers co-laborers in God’s work—not just passive recipients. This calls for active partnership in sustaining the apostolic mission of the Church."
    },
    {
      "pk": 71001009,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 9,
      "text": "I wrote something to the church, but Diotrephes, who loves to be first among them, does not accept us.",
      "links": "<a href='/AIV/43/13/16'>John 13:16</a>; <a href='/AIV/52/5/12'>1 Thessalonians 5:12</a>",
      "comment": "Diotrephes' refusal exposes the danger of rejecting legitimate spiritual authority and apostolic leadership. Endeavoring to be 'first' is warned against by Jesus, who taught humility and submission to church leadership."
    },
    {
      "pk": 71001010,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 10,
      "text": "So if I come, I will call attention to what he is doing, spreading wicked words against us. Not satisfied with this, he refuses to welcome the brothers, and even prevents those who would, and puts them out of the church.",
      "links": "<a href='/AIV/40/18/17'>Matthew 18:17</a>; <a href='/AIV/46/5/2'>1 Corinthians 5:2</a>",
      "comment": "John intends to exercise corrective discipline, keeping the community pure and orderly. The apostolic leader’s responsibility includes rebuking sin and upholding unity, consistent with Christ’s instructions about church governance and discipline."
    },
    {
      "pk": 71001011,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 11,
      "text": "Beloved, do not imitate evil but imitate good. Whoever does good is from God; whoever does evil has not seen God.",
      "links": "<a href='/AIV/40/5/16'>Matthew 5:16</a>; <a href='/AIV/62/3/10'>1 John 3:10</a>",
      "comment": "Christianity is a call to practical holiness. Good works flow from God’s life within, confirming genuine relationship with Him. Spiritual sight—seeing God—is tagently both literal and spiritual, hinting at the importance of sacramental grace."
    },
    {
      "pk": 71001012,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 12,
      "text": "Demetrius has received a good testimony from everyone, and from the truth itself. We also testify, and you know that our testimony is true.",
      "links": "<a href='/AIV/43/19/35'>John 19:35</a>; <a href='/AIV/62/5/6'>1 John 5:6</a>",
      "comment": "Demetrius is affirmed by the community, by apostolic witness, and by the truth. The triple witness structure echoes biblical standards for establishing truth, reinforcing the Church’s role in discernment and affirmation."
    },
    {
      "pk": 71001013,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 13,
      "text": "I have much to write to you, but I do not wish to write with pen and ink.",
      "links": "<a href='/AIV/63/1/12'>2 John 1:12</a>; <a href='/AIV/46/16/20'>1 Corinthians 16:20</a>",
      "comment": "The desire for face-to-face fellowship is prioritized over written communication, highlighting the importance of the gathered community and personal relationships in Christian living."
    },
    {
      "pk": 71001014,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 14,
      "text": "But I hope to see you soon, and we will speak face to face.",
      "links": "<a href='/AIV/63/1/12'>2 John 1:12</a>; <a href='/AIV/52/2/17'>1 Thessalonians 2:17</a>",
      "comment": "Personal encounter is prized; early Christians valued sacramental presence and apostolic fellowship, seen as the fullness of communion among believers, going beyond mere words."
    },
    {
      "pk": 71001015,
      "translation": "AIV",
      "book": 71,
      "bookName": "3 John",
      "bookAbbreviation": "3John",
      "chapter": 1,
      "verse": 15,
      "text": "Peace to you. The friends greet you. Greet the friends by name.",
      "links": "<a href='/AIV/43/20/19-21'>John 20:19-21</a>; <a href='/AIV/45/16/16'>Romans 16:16</a>",
      "comment": "'Peace' is both greeting and blessing, drawing on Christ’s resurrection appearances. Naming the friends points to personal connection and unity. Early Christian practice prioritized specific prayer, blessing, and relational bonds."
    }
  ],
  "translatedAt": "2025-12-24T12:32:39.140Z"
}