{
  "book": "Song of Songs",
  "bookAbbreviation": "Song",
  "chapter": 4,
  "verses": [
    {
      "pk": 4004001,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 1,
      "text": "Behold, you are beautiful, my love, behold, you are beautiful! Your eyes are like doves behind your veil. Your hair is like a flock of goats descending from Mount Gilead.",
      "links": "<a href='/AIV/19/45/11'>Ps. 45:11</a>; <a href='/AIV/22/2/14'>Song 2:14</a>",
      "comment": "The imagery sets a tone of awe, with the bride described as flawlessly beautiful. The 'dove' imagery is associated with purity (cf. Matt. 3:16), foreshadowing spiritual implications for both the church as a spotless bride and individuals called to holiness."
    },
    {
      "pk": 4004002,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 2,
      "text": "Your teeth are like a flock of shorn sheep coming up from the washing, all of which bear twins, and not one among them is missing.",
      "links": "<a href='/AIV/22/6/6'>Song 6:6</a>",
      "comment": "The reference to perfectly matched and clean teeth emphasizes unity and wholeness. Spiritually, this hints at the unity and sanctification of the redeemed (cf. Eph. 5:27)."
    },
    {
      "pk": 4004003,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 3,
      "text": "Your lips are like a scarlet thread, and your mouth is lovely. Your temples behind your veil are like a slice of pomegranate.",
      "links": "<a href='/AIV/22/6/7'>Song 6:7</a>; <a href='/AIV/19/45/2'>Ps. 45:2</a>",
      "comment": "Beautiful speech is highlighted, with the scarlet referencing preciousness. The mouth’s loveliness can be seen as signifying the purity of praise (cf. Ps. 51:15). In spiritual interpretation, the Church’s doctrine is pure and fruitful."
    },
    {
      "pk": 4004004,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 4,
      "text": "Your neck is like the tower of David, built for an armory, on which a thousand shields hang, all the shields of warriors.",
      "links": "<a href='/AIV/22/7/4'>Song 7:4</a>; <a href='/AIV/19/18/2'>Ps. 18:2</a>",
      "comment": "The strong neck, like a fortified tower, signifies dignity and steadfastness. Spiritually, this foreshadows the strength of the faithful community, guarded by spiritual defence (cf. Eph. 6:11)."
    },
    {
      "pk": 4004005,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 5,
      "text": "Your two breasts are like two fawns, twins of a gazelle, that feed among the lilies.",
      "links": "<a href='/AIV/22/7/3'>Song 7:3</a>; <a href='/AIV/1/49/12'>Gen. 49:12'</a>",
      "comment": "Tenderness and nourishment are signified. Spiritual interpreters see here an image of nurturing faith and love, representing the sustenance provided by right teaching and sacramental grace."
    },
    {
      "pk": 4004006,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 6,
      "text": "Until the day breathes and the shadows flee, I will go to the mountain of myrrh and to the hill of frankincense.",
      "links": "<a href='/AIV/22/2/17'>Song 2:17</a>; <a href='/AIV/19/141/2'>Ps. 141:2</a>",
      "comment": "Myrhh and frankincense are symbols used in worship. This foreshadows Christ’s sacrifice and the rising of prayers like incense (cf. Rev. 8:3-4)."
    },
    {
      "pk": 4004007,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 7,
      "text": "You are all beautiful, my love; there is no flaw in you.",
      "links": "<a href='/AIV/22/1/15'>Song 1:15</a>; <a href='/AIV/49/5/27'>Eph. 5:27</a>",
      "comment": "A declaration of perfection. Spiritually, this anticipates the spotless nature of the church, made pure through Christ (Eph. 5:27), which points to the necessity of a holy community set apart."
    },
    {
      "pk": 4004008,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 8,
      "text": "Come with me from Lebanon, my bride; come with me from Lebanon. Depart from the peak of Amana, from the summit of Senir and Hermon, from the dens of lions, from the mountains of leopards.",
      "links": "<a href='/AIV/22/1/15'>Song 1:15</a>; <a href='/AIV/5/3/25'>Deut. 3:25</a>",
      "comment": "The invitation to leave dangerous heights represents a call from danger to safety in the beloved’s presence. Spiritually, this can be seen as the call to leave spiritual perils for union with God—in line with the journey of faith."
    },
    {
      "pk": 4004009,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 9,
      "text": "You have captivated my heart, my sister, my bride; you have captivated my heart with one glance of your eyes, with one jewel of your necklace.",
      "links": "<a href='/AIV/22/5/1'>Song 5:1</a>; <a href='/AIV/23/61/10'>Isa. 61:10</a>",
      "comment": "The beloved’s love has captured the groom’s heart. Spiritual tradition reads this as the effect of pure love and devotion; with the Church’s faithful devotion winning the heart of Christ (cf. Isa. 61:10, the joy of salvation and adornment)."
    },
    {
      "pk": 4004010,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 10,
      "text": "How delightful is your love, my sister, my bride! How much better is your love than wine, and the fragrance of your oils than any spice!",
      "links": "<a href='/AIV/22/1/2'>Song 1:2</a>; <a href='/AIV/50/1/9-11'>Phil. 1:9-11</a>",
      "comment": "The superlative joy in pure love surpasses earthly pleasures. Applied spiritually, this points forward to the greater delights of communion with God above all earthly joys."
    },
    {
      "pk": 4004011,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 11,
      "text": "Your lips drip honey, my bride; honey and milk are under your tongue. The scent of your garments is like the aroma of Lebanon.",
      "links": "<a href='/AIV/22/5/13'>Song 5:13</a>; <a href='/AIV/2/3/8'>Ex. 3:8</a>",
      "comment": "Honey and milk evoke the Promised Land’s abundance (Ex. 3:8). The speech of the beloved is nourishing and pleasant—seen as the proclamation of saving doctrine that brings life."
    },
    {
      "pk": 4004012,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 12,
      "text": "A locked garden is my sister, my bride—a locked garden, a sealed spring.",
      "links": "<a href='/AIV/22/4/15'>Song 4:15</a>; <a href='/AIV/23/62/5'>Isa. 62:5</a>",
      "comment": "The sealed garden and fountain indicates exclusivity and purity, a symbol of faithful devotion kept for the beloved. Spiritually, this prefigures the unique sanctity required for union with God (cf. Isa. 62:5)."
    },
    {
      "pk": 4004013,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 13,
      "text": "Your shoots are an orchard of pomegranates with the choicest fruits, henna with nard,",
      "links": "<a href='/AIV/22/6/11'>Song 6:11</a>",
      "comment": "The garden imagery continues, full of spiritual fruitfulness. The pomegranate’s abundance points to the virtues blossoming in the beloved, echoed in the fruitful life of faith."
    },
    {
      "pk": 4004014,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 14,
      "text": "nard and saffron, calamus and cinnamon, with all trees of frankincense, myrrh and aloes, with all the chief spices—",
      "links": "<a href='/AIV/19/45/8'>Ps. 45:8</a>; <a href='/AIV/2/30/23-25'>Ex. 30:23-25</a>",
      "comment": "These spices recall the ingredients used in worship (Ex. 30:23-25), linking the beloved’s life to the fragrance of worship pleasing to God—pointing to the spiritual sacrifice of continuous prayer and praise."
    },
    {
      "pk": 4004015,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 15,
      "text": "a fountain in the garden, a well of living water, flowing streams from Lebanon.",
      "links": "<a href='/AIV/43/4/14'>John 4:14</a>; <a href='/AIV/24/2/13'>Jer. 2:13</a>",
      "comment": "Living water points to the life-giving stream of grace. Jesus applies this image to Himself (John 4:14), echoing the church as a source of living water through the Spirit (cf. Jer. 2:13)."
    },
    {
      "pk": 4004016,
      "translation": "AIV",
      "book": 22,
      "chapter": 4,
      "verse": 16,
      "text": "Awake, O north wind, and come, O south wind! Blow upon my garden, so that its fragrance may spread. Let my beloved come to his garden and eat its choicest fruits.",
      "links": "<a href='/AIV/19/80/14-15'>Ps. 80:14-15</a>; <a href='/AIV/43/15/8'>John 15:8</a>",
      "comment": "This calls for the Spirit to bring forth fruit and delight, inviting the beloved to enjoy. This images the call for divine presence and fruitfulness—the life of grace opened to the beloved, fulfilled in the renewal of hearts by the Spirit (<a href='/AIV/43/15/8'>John 15:8</a>)."
    }
  ],
  "translatedAt": "2025-12-23T06:13:31.920Z"
}