{
  "book": 26,
  "bookName": "Song of Songs",
  "bookAbbreviation": "Song",
  "chapter": 5,
  "verses": [
    {
      "pk": 26005001,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 1,
      "text": "I have come into my garden, my sister, my bride; I have gathered my myrrh with my spices. I have eaten my honeycomb with my honey; I have drunk my wine with my milk. Eat, friends; drink, and be intoxicated with love.",
      "links": "<a href='/AIV/23/62/5'>Isa. 62:5</a>; <a href='/AIV/19/36/8'>Ps. 36:8</a>; <a href='/AIV/43/2/10'>John 2:10</a>",
      "comment": "This verse marks a joyful consummation, reminiscent of banquet imagery often seen in Scripture. The garden represents intimacy and union, echoing Eden and future spiritual fulfillment. The communal call to 'eat and drink' anticipates heavenly feasting, referenced in Revelation 19:9."
    },
    {
      "pk": 26005002,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 2,
      "text": "I slept, but my heart was awake. The voice of my beloved! He knocks: 'Open to me, my sister, my love, my dove, my perfect one, for my head is drenched with dew, my hair with the drops of the night.'",
      "links": "<a href='/AIV/66/3/20'>Rev. 3:20</a>; <a href='/AIV/19/77/6'>Ps. 77:6</a>",
      "comment": "The Bride is receptive yet hesitant. The knocking echoes Christ's invitation in Revelation 3:20. Dew and night suggest persistence and longing, traditionally seen as divine pursuit of the soul."
    },
    {
      "pk": 26005003,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 3,
      "text": "'I have taken off my garment; how could I put it on again? I have washed my feet; how could I dirty them?'",
      "links": "<a href='/AIV/43/13/5'>John 13:5</a>",
      "comment": "The reluctance here often symbolizes spiritual hesitance to respond fully to divine calls, reflecting moments of human weakness or delay."
    },
    {
      "pk": 26005004,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 4,
      "text": "My beloved put his hand through the latch-opening; my heart was stirred within me.",
      "links": "<a href='/AIV/42/24/32'>Luke 24:32</a>; <a href='/AIV/19/73/21'>Ps. 73:21</a>",
      "comment": "The beloved's action enkindles desire, signifying the transformative effect of true union with the divine. The door imagery is common in spiritual writings about the soul's receptivity."
    },
    {
      "pk": 26005005,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 5,
      "text": "I arose to open to my beloved, and my hands dripped with myrrh, my fingers with liquid myrrh that flowed on the handles of the bolt.",
      "links": "<a href='/AIV/40/2/11'>Matt. 2:11</a>; <a href='/AIV/43/19/39'>John 19:39</a>",
      "comment": "Myrrh is a symbol of suffering and sacrifice and is used in messianic context. The detail of the anointed door prefigures sacred encounters, reminiscent of the way Christ is connected to the fragrant offerings."
    },
    {
      "pk": 26005006,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 6,
      "text": "I opened to my beloved, but my beloved had turned away, gone. My soul failed when he spoke. I sought him, but could not find him; I called him, but he did not answer.",
      "links": "<a href='/AIV/19/22/2'>Ps. 22:2</a>; <a href='/AIV/43/20/14'>John 20:14</a>",
      "comment": "This absence intensifies longing, resembling Mary Magdalene's search for Jesus after the resurrection. Spiritual desolation and longing are important in the journey toward deeper faith."
    },
    {
      "pk": 26005007,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 7,
      "text": "The watchmen who go about the city found me, they struck me, they wounded me; the keepers of the walls took away my cloak.",
      "links": "<a href='/AIV/19/127/1'>Ps. 127:1</a>; <a href='/AIV/23/62/6'>Isa. 62:6</a>",
      "comment": "The watchmen, sometimes seen as religious authorities, respond harshly. The stripping away of the cloak recalls both vulnerability and purification, a spiritual stripping for deeper union."
    },
    {
      "pk": 26005008,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 8,
      "text": "I adjure you, daughters of Jerusalem, if you find my beloved, that you tell him I am faint with love.",
      "links": "<a href='/AIV/22/2/7'>Song 2:7</a>; <a href='/AIV/19/42/1'>Ps. 42:1</a>",
      "comment": "The appeal to others for help reflects communal aspects in spiritual seeking and the value of intercession within the faith journey."
    },
    {
      "pk": 26005009,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 9,
      "text": "What is your beloved more than another beloved, O most beautiful among women? What is your beloved more than another beloved, that you so adjure us?",
      "links": "<a href='/AIV/19/45/2'>Ps. 45:2</a>",
      "comment": "Here, the companions question what makes her beloved unique, opening the way for praise and glorification, much like the glorification of Christ’s singular role."
    },
    {
      "pk": 26005010,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 10,
      "text": "My beloved is radiant and ruddy, outstanding among ten thousand.",
      "links": "<a href='/AIV/19/45/2'>Ps. 45:2</a>; <a href='/AIV/66/1/13'>Rev. 1:13-16</a>",
      "comment": "The description highlights the beloved's uniqueness and glory. This imagery is often applied in Christological interpretation, depicting Christ's distinct excellence."
    },
    {
      "pk": 26005011,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 11,
      "text": "His head is pure gold; his hair is wavy, black as a raven.",
      "links": "<a href='/AIV/27/10/6'>Dan. 10:6</a>",
      "comment": "Symbolic of wisdom, royalty, and strength. Descriptions of the beloved's attributes parallel prophetic imagery of messiah figures."
    },
    {
      "pk": 26005012,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 12,
      "text": "His eyes are like doves by streams of water, bathed in milk, set within fullness.",
      "links": "<a href='/AIV/22/1/15'>Song 1:15</a>; <a href='/AIV/40/6/22'>Matt. 6:22</a>",
      "comment": "Gentleness and purity are emphasized here, which are seen as marks of both the divine and those united to Him."
    },
    {
      "pk": 26005013,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 13,
      "text": "His cheeks are like beds of spices, yielding fragrance. His lips are lilies, dripping flowing myrrh.",
      "links": "<a href='/AIV/19/45/2'>Ps. 45:2</a>; <a href='/AIV/43/7/46'>John 7:46</a>",
      "comment": "The myrrh and lilies recall sacramental language, emphasizing the beloved’s life-giving and sacrificial qualities, which often point to Christ’s role."
    },
    {
      "pk": 26005014,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 14,
      "text": "His hands are rods of gold set with beryl. His body is polished ivory adorned with sapphires.",
      "links": "<a href='/AIV/27/10/6'>Dan. 10:6</a>; <a href='/AIV/19/45/9'>Ps. 45:9-10</a>",
      "comment": "Royal substance and purity are symbolized by gold, beryl, ivory, and sapphire. These rich images are frequently used in prophetic descriptions of divine beings."
    },
    {
      "pk": 26005015,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 15,
      "text": "His legs are pillars of alabaster, set on bases of pure gold. His presence is like Lebanon, majestic as the cedars.",
      "links": "<a href='/AIV/19/92/12'>Ps. 92:12</a>; <a href='/AIV/23/35/2'>Isa. 35:2</a>",
      "comment": "Stability, nobility, and beauty are suggested. The majestic imagery aligns with messianic prophecy of enduring strength and grace."
    },
    {
      "pk": 26005016,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 5,
      "verse": 16,
      "text": "His mouth is sweetness itself; he is altogether desirable. This is my beloved, this is my friend, daughters of Jerusalem.",
      "links": "<a href='/AIV/19/34/8'>Ps. 34:8</a>; <a href='/AIV/43/15/15'>John 15:15</a>",
      "comment": "The beloved's mouth as sweetness evokes God’s Word and spiritual nourishment (Ps. 34:8). The concluding declaration encourages love and intimacy with the divine, reminiscent of Christ’s own invitation to friendship in John 15:15. The bridal love here models both personal devotion and communal celebration in the life of faith."
    }
  ],
  "translatedAt": "2025-12-24T07:13:26.375Z"
}