{
  "book": "Song of Songs",
  "bookAbbreviation": "Song",
  "chapter": 6,
  "verses": [
    {
      "pk": 2071001,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 1,
      "text": "Where has your beloved gone, most beautiful among women? Where has your beloved turned aside, that we may seek him with you?",
      "links": "<a href='/AIV/22/5/9'>Song 5:9</a>; <a href='/AIV/1/37/35'>Gen. 37:35</a>",
      "comment": "The daughters of Jerusalem speak, showing concern and willingness to seek the beloved with the bride. This anticipates communal participation in seeking divine love, subtly reflecting the theme of the faithful seeking union with Christ as a body."
    },
    {
      "pk": 2071002,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 2,
      "text": "My beloved has gone down to his garden, to the beds of spices, to graze in the gardens and to gather lilies.",
      "links": "<a href='/AIV/22/4/16'>Song 4:16</a>; <a href='/AIV/22/5/1'>Song 5:1</a>; <a href='/AIV/22/2/16'>Song 2:16</a>",
      "comment": "The garden imagery represents intimacy and delight. Traditionally, it points to Christ descending to tend His Church, often referred to as a 'garden' throughout Christian tradition."
    },
    {
      "pk": 2071003,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 3,
      "text": "I am my beloved’s and my beloved is mine; he grazes among the lilies.",
      "links": "<a href='/AIV/22/2/16'>Song 2:16</a>; <a href='/AIV/22/7/10'>Song 7:10</a>",
      "comment": "A statement of mutual possession and love, echoing bond between Christ and the Church (see <a href='/AIV/43/17/21'>John 17:21</a>). The lilies symbolize purity and joy."
    },
    {
      "pk": 2071004,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 4,
      "text": "You are beautiful as Tirzah, my love, lovely as Jerusalem, awe-inspiring as an army with banners.",
      "links": "<a href='/AIV/19/45/10-11'>Psalm 45:10–11</a>; <a href='/AIV/22/1/15'>Song 1:15</a>",
      "comment": "Tirzah and Jerusalem were famed for beauty and strength. The Church, as the Bride, is both beautiful and strong, an image later echoed in descriptions of the New Jerusalem."
    },
    {
      "pk": 2071005,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 5,
      "text": "Turn your eyes away from me, for they overwhelm me. Your hair is like a flock of goats streaming down from Gilead.",
      "links": "<a href='/AIV/22/4/1'>Song 4:1</a>",
      "comment": "The beloved is captivated by her gaze, a metaphor for the soul’s overwhelming devotion to Christ. The repeated simile about hair recalls earlier verses and emphasizes continuity in love's imagery."
    },
    {
      "pk": 2071006,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 6,
      "text": "Your teeth are like a flock of ewes coming up from washing, all of them bearing twins; not one among them is bereaved.",
      "links": "<a href='/AIV/22/4/2'>Song 4:2</a>",
      "comment": "The description symbolizes purity and fruitfulness. The reference to twins and none missing subtly highlights completeness, reflecting spiritual wholeness in the community of believers."
    },
    {
      "pk": 2071007,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 7,
      "text": "Your cheeks behind your veil are like halves of a pomegranate.",
      "links": "<a href='/AIV/22/4/3'>Song 4:3</a>",
      "comment": "The pomegranate, full of seeds, symbolizes abundance and inner beauty. The imagery suggests the hidden richness of the soul united in love."
    },
    {
      "pk": 2071008,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 8,
      "text": "There are sixty queens and eighty concubines, and virgins without number.",
      "links": "<a href='/AIV/19/45/14-15'>Ps. 45:14–15</a>; <a href='/AIV/1/29/28'>Gen. 29:28</a>",
      "comment": "The great multitude of women refers to the many who seek the beloved, but the unique love of the bride stands apart. Spiritually, the many faithful members and saints are acknowledged, but there is an emphasis on unity."
    },
    {
      "pk": 2071009,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 9,
      "text": "My dove, my perfect one, is unique; she is the only one of her mother, pure to her who bore her. The daughters saw her and called her blessed; queens and concubines also praised her.",
      "links": "<a href='/AIV/19/45/17'>Ps. 45:17</a>; <a href='/AIV/42/1/48'>Luke 1:48</a>",
      "comment": "The bride’s uniqueness suggests the chosen people and, spiritually, the singular holiness expected of the Church. The language ‘called her blessed’ echoes the praise given to Mary, the mother of Jesus, by all generations (<a href='/AIV/42/1/48'>Luke 1:48</a>)."
    },
    {
      "pk": 2071010,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 10,
      "text": "Who is this who looks forth like the dawn, beautiful as the moon, pure as the sun, awe-inspiring as an army with banners?",
      "links": "<a href='/AIV/19/84/11'>Ps. 84:11</a>; <a href='/AIV/66/12/1'>Rev. 12:1</a>",
      "comment": "The radiant language recalls the imagery of the woman in Revelation 12. The Church, or the soul devoted to God, is depicted as shining with divine light. The repeated army metaphor points to strength and authority."
    },
    {
      "pk": 2071011,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 11,
      "text": "I went down to the grove of nut trees to look at the new growth in the valley, to see whether the vines had budded or the pomegranates were in bloom.",
      "links": "<a href='/AIV/22/7/12'>Song 7:12</a>; <a href='/AIV/43/15/5'>John 15:5</a>",
      "comment": "A scene of inspection and anticipation. The vineyard and pomegranate imagery reflect spiritual fruitfulness and echoes parables of growth found in the teachings of Jesus (<a href='/AIV/43/15/5'>John 15:5</a>)."
    },
    {
      "pk": 2071012,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 12,
      "text": "Before I was aware, my soul put me among the chariots of my noble people.",
      "links": "<a href='/AIV/19/110/3'>Ps. 110:3</a>",
      "comment": "A mysterious verse suggesting being suddenly uplifted or honored. Christologically, this points to the transformation and exaltation that occurs through grace, a work attributed to the initiative of God in the believer’s life."
    },
    {
      "pk": 2071013,
      "translation": "AIV",
      "book": 22,
      "chapter": 6,
      "verse": 13,
      "text": "Return, return, O Shulammite! Return, return, that we may look upon you. Why should you look upon the Shulammite, as upon a dance before two armies?",
      "links": "<a href='/AIV/22/7/1'>Song 7:1</a>; <a href='/AIV/22/2/14'>Song 2:14</a>",
      "comment": "The final appeal for the beloved to return has both literal and spiritual meanings. Spiritually, it is a call for the Church to come forth in glory. The 'dance before two armies' suggests both celebration and awe before the union of heaven and earth."
    }
  ],
  "translatedAt": "2025-12-23T06:14:06.580Z"
}