{
  "book": "Song of Songs",
  "bookAbbreviation": "Song",
  "chapter": 7,
  "verses": [
    {
      "pk": 2137001,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 1,
      "text": "How beautiful are your feet in sandals, noble daughter! The curves of your thighs are like ornaments, crafted by the hands of an artist.",
      "links": "<a href='/AIV/45/10/15'>Rom. 10:15</a>; <a href='/AIV/19/45/10-11'>Ps. 45:10-11</a>",
      "comment": "This verse uses poetic imagery to praise the beloved’s beauty, evoking the way the Church is adorned as Christ’s bride (see Ephesians 5:27). The use of 'noble daughter' is a literal rendering, emphasizing dignity."
    },
    {
      "pk": 2137002,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 2,
      "text": "Your navel is a rounded bowl that never lacks mixed wine. Your waist is a heap of wheat, encircled with lilies.",
      "links": "<a href='/AIV/19/81/16'>Ps. 81:16</a>; <a href='/AIV/40/26/29'>Matt. 26:29</a>",
      "comment": "Wine and wheat are here images of blessing and abundance, prefiguring sacred symbols later seen in the New Testament."
    },
    {
      "pk": 2137003,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 3,
      "text": "Your two breasts are like two fawns, twins of a gazelle.",
      "links": "<a href='/AIV/22/4/5'>Song 4:5</a>",
      "comment": "Repeated from Song 4:5, this metaphor stresses innocence and gentleness. Traditionally interpreted as representing the nurturing teachings of faith and love."
    },
    {
      "pk": 2137004,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 4,
      "text": "Your neck is like an ivory tower. Your eyes are like the pools in Heshbon, by the gate of Bath-rabbim. Your nose is like a tower of Lebanon, facing Damascus.",
      "links": "<a href='/AIV/22/4/4'>Song 4:4</a>",
      "comment": "The imagery of towers and pools connotes majesty, purity, and vigilance, reminiscent of the spiritual strength found in the communion of believers."
    },
    {
      "pk": 2137005,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 5,
      "text": "Your head crowns you like Carmel, and the flowing locks of your hair are like purple; a king is held captive by your tresses.",
      "links": "<a href='/AIV/19/45/11'>Ps. 45:11</a>",
      "comment": "Carmel represents fruitfulness, and the mention of the king hints at the royal relationship between Christ and His people (see Psalm 45:11)."
    },
    {
      "pk": 2137006,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 6,
      "text": "How beautiful and pleasant you are, O loved one, with your delights!",
      "links": "<a href='/AIV/22/4/10'>Song 4:10</a>",
      "comment": "Echoes previous passages on the beloved’s beauty (Song 4:10). Love here signifies not mere human affection but the profound union between Christ and the faithful."
    },
    {
      "pk": 2137007,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 7,
      "text": "Your stature is like a palm tree, and your breasts are like its clusters of fruit.",
      "links": "<a href='/AIV/19/92/12'>Ps. 92:12</a>",
      "comment": "Palm trees in Scripture symbolize enduring righteousness and flourish (Psalm 92:12); the fruitfulness points toward spiritual abundance."
    },
    {
      "pk": 2137008,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 8,
      "text": "I said, 'I will climb the palm tree, I will take hold of its fruit.' May your breasts be like clusters of the vine, the scent of your breath like apples,",
      "links": "<a href='/AIV/22/2/3'>Song 2:3</a>; <a href='/AIV/22/4/10-11'>Song 4:10-11</a>",
      "comment": "The desire to partake in the beloved’s fruit points to longing for spiritual communion. The fragrance here recalls the pleasing aroma of offering (Genesis 8:21)."
    },
    {
      "pk": 2137009,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 9,
      "text": "and your mouth like the best wine.' She responds: 'May the wine go straight to my beloved, flowing smoothly to those who sleep, touching the lips of those who slumber.'",
      "links": "<a href='/AIV/19/104/15'>Ps. 104:15</a>; <a href='/AIV/40/26/27-29'>Matt. 26:27-29</a>",
      "comment": "Wine represents joy and deep fellowship, later fulfilled in the Last Supper’s cup—a symbol of union and covenant."
    },
    {
      "pk": 2137010,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 10,
      "text": "I am my beloved’s, and his desire is for me.",
      "links": "<a href='/AIV/22/6/3'>Song 6:3</a>; <a href='/AIV/43/17/24'>John 17:24</a>",
      "comment": "Echoing Song 6:3, this expresses total belonging and mutual love—a reflection of the soul’s union with Christ and His sacrificial desire for His people."
    },
    {
      "pk": 2137011,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 11,
      "text": "Come, my beloved, let us go out into the countryside; let us spend the night among the villages.",
      "links": "<a href='/AIV/22/2/10'>Song 2:10</a>; <a href='/AIV/22/4/8'>Song 4:8</a>",
      "comment": "This invitation to journey together evokes missionary callings and spiritual pilgrimage with Christ, similar to invitations found in Song 2:10 and Song 4:8."
    },
    {
      "pk": 2137012,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 12,
      "text": "Let us rise early and go to the vineyards, to see if the vine has budded, if the blossoms have opened and the pomegranates are in bloom. There I will give you my love.",
      "links": "<a href='/AIV/22/2/13'>Song 2:13</a>; <a href='/AIV/22/6/11'>Song 6:11</a>",
      "comment": "The vineyard represents fruitfulness and spiritual growth; early rising recalls devoted seeking (see Song 6:11)."
    },
    {
      "pk": 2137013,
      "translation": "AIV",
      "book": 22,
      "chapter": 7,
      "verse": 13,
      "text": "The mandrakes send forth fragrance, and at our doors are all choice fruits, new and old, which I have stored up for you, my beloved.",
      "links": "<a href='/AIV/01/30/14'>Gen. 30:14'; <a href='/AIV/22/4/13'>Song 4:13</a>",
      "comment": "Mandrakes symbolize love and fruitfulness (Genesis 30:14), the stored fruits hint at tradition and continuity in spiritual gifts—old and new, kept for the beloved."
    }
  ],
  "translatedAt": "2025-12-23T06:14:19.563Z"
}