{
  "book": "Song of Songs",
  "bookAbbreviation": "Song",
  "chapter": 2,
  "verses": [
    {
      "pk": 3902001,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 1,
      "text": "I am a rose of Sharon, a lily of the valleys.",
      "links": "<a href='/AIV/28/14/5'>Hosea 14:5</a>; <a href='/AIV/40/6/28-29'>Matt. 6:28-29</a>",
      "comment": "The 'rose of Sharon' and 'lily of the valleys' are symbols of beauty and purity. Early Christian interpreters saw the bride as a figure of the soul in union with God, or of God's chosen people. Some see Christ as the true blossom among humanity."
    },
    {
      "pk": 3902002,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 2,
      "text": "Like a lily among thorns, so is my beloved among the daughters.",
      "links": "<a href='/AIV/19/45/13'>Psalm 45:13</a>",
      "comment": "The beloved is set apart in glory and purity, echoing God's love for his people. The contrast of 'lily among thorns' echoes Christian teaching on the distinctness of Christ or the Church amid the world."
    },
    {
      "pk": 3902003,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 3,
      "text": "As an apple tree among the trees of the forest, so is my beloved among the young men. I delighted to sit in his shadow, and his fruit was sweet to my taste.",
      "links": "<a href='/AIV/19/34/8'>Psalm 34:8</a>; <a href='/AIV/43/6/51'>John 6:51</a>",
      "comment": "The apple tree was prized for shade and fruit. Christian interpreters often saw this as Christ, whose protection and spiritual nourishment surpass all others. The soul's delight in union with Christ is expressed in Eucharistic language."
    },
    {
      "pk": 3902004,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 4,
      "text": "He brought me into the banquet hall, and his banner over me is love.",
      "links": "<a href='/AIV/19/23/5'>Psalm 23:5</a>; <a href='/AIV/66/19/9'>Rev. 19:9</a>",
      "comment": "The banquet hall is associated with the abundance of God's blessings and the heavenly banquet. The 'banner of love' can signify the mark of belonging to God, prefiguring the love poured out through Christ (cf. John 13:34)."
    },
    {
      "pk": 3902005,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 5,
      "text": "Sustain me with raisin cakes, refresh me with apples, for I am faint with love.",
      "links": "<a href='/AIV/19/63/1'>Psalm 63:1</a>",
      "comment": "Raisin cakes and apples were considered strengthening foods. Spiritually, this is the soul longing for deeper union with God, anticipating the spiritual nourishment of the New Covenant."
    },
    {
      "pk": 3902006,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 6,
      "text": "His left hand is under my head, and his right hand embraces me.",
      "links": "<a href='/AIV/23/66/13'>Isa. 66:13</a>",
      "comment": "A poetic image of intimacy and protection, often interpreted as the tender care of Christ for His people or the Church."
    },
    {
      "pk": 3902007,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 7,
      "text": "I charge you, daughters of Jerusalem, by the gazelles and the does of the field: Do not awaken or stir up love until it pleases.",
      "links": "<a href='/AIV/19/27/14'>Psalm 27:14</a>; <a href='/AIV/22/3/5'>Song 3:5</a>",
      "comment": "A refrain signaling the proper time for love, often seen as urging patience and chastity— key virtues for spiritual maturity. The reference to 'daughters of Jerusalem' points to a corporate element in God's people."
    },
    {
      "pk": 3902008,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 8,
      "text": "The voice of my beloved! Look, he comes, leaping over the mountains, skipping over the hills.",
      "links": "<a href='/AIV/19/18/33'>Psalm 18:33</a>; <a href='/AIV/40/21/5'>Matt. 21:5</a>",
      "comment": "The coming of the beloved is sometimes read as God's dramatic initiative. Early Christian interpretation associated this with the coming of Christ, who overcomes all obstacles to draw near to His people."
    },
    {
      "pk": 3902009,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 9,
      "text": "My beloved is like a gazelle or a young stag. Look, he stands behind our wall, gazing through the windows, peering through the lattice.",
      "links": "<a href='/AIV/22/2/17'>Song 2:17</a>; <a href='/AIV/19/42/1'>Psalm 42:1</a>",
      "comment": "Swift movement and yearning are depicted. The beloved is near but not yet fully revealed, echoing the way God's presence can be known but is sometimes hidden, as in sacraments and mysteries."
    },
    {
      "pk": 3902010,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 10,
      "text": "My beloved spoke and said to me, 'Arise, my love, my beautiful one, and come away.'",
      "links": "<a href='/AIV/45/13/11'>Rom. 13:11</a>",
      "comment": "The call to rise and depart is often associated metaphorically with the call to spiritual renewal, resembling Christ's invitation to follow Him."
    },
    {
      "pk": 3902011,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 11,
      "text": "For look, the winter is past; the rain is over and gone.",
      "links": "<a href='/AIV/32/2/10'>Jonah 2:10</a>",
      "comment": "Winter symbolizes trial, and its passing points to the new season of grace that comes with God's presence."
    },
    {
      "pk": 3902012,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 12,
      "text": "The flowers appear on the earth, the season of singing has come, and the voice of the turtledove is heard in our land.",
      "links": "<a href='/AIV/19/96/1'>Psalm 96:1</a>",
      "comment": "Signs of new life and joy point to the renewal that God brings. The turtledove often symbolizes innocence, purity, and the coming of the Spirit."
    },
    {
      "pk": 3902013,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 13,
      "text": "The fig tree puts forth its figs, and the vines in blossom give off their fragrance. Arise, my love, my beautiful one, and come away.",
      "links": "<a href='/AIV/40/24/32'>Matt. 24:32</a>",
      "comment": "The natural imagery signals the fullness of time. Many spiritual writers see this as the moment of readiness to respond to God's call."
    },
    {
      "pk": 3902014,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 14,
      "text": "My dove, in the clefts of the rock, in the hiding places on the mountainside, let me see your face, let me hear your voice; for your voice is sweet, and your face is lovely.",
      "links": "<a href='/AIV/02/33/22'>Ex. 33:22</a>",
      "comment": "Calling to the dove, hidden in the rocks, evokes imagery of safety and intimacy. The dove recalls the Spirit and the beloved as cherished and sought by God (cf. Ex. 33:22 for the hiding in the cleft)."
    },
    {
      "pk": 3902015,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 15,
      "text": "Catch for us the foxes, the little foxes, that spoil the vineyards, for our vineyards are in bloom.",
      "links": "<a href='/AIV/19/80/14-16'>Psalm 80:14-16</a>",
      "comment": "Foxes threaten the blooming vineyard, which is a common metaphor for Israel or the Church. Diligence in removing obstacles to spiritual growth is implied, aligning with the theme of perseverance in faith."
    },
    {
      "pk": 3902016,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 16,
      "text": "My beloved is mine, and I am his; he grazes among the lilies.",
      "links": "<a href='/AIV/19/63/1-3'>Psalm 63:1-3</a>; <a href='/AIV/43/10/14'>John 10:14</a>",
      "comment": "A profound statement of mutual belonging. The intimacy echoes the union between Christ and His people (cf. John 10:14). This mutuality underscores the promise of abiding relationship, reminiscent of Trinitarian communion."
    },
    {
      "pk": 3902017,
      "translation": "AIV",
      "book": 22,
      "chapter": 2,
      "verse": 17,
      "text": "Until the day breathes and the shadows flee, turn, my beloved, and be like a gazelle or a young stag on the rugged mountains.",
      "links": "<a href='/AIV/19/130/6'>Psalm 130:6</a>; <a href='/AIV/22/8/14'>Song 8:14</a>",
      "comment": "Longing for the beloved's return awaits the fullness of day. Spiritually, this expresses the soul's yearning for Christ's coming and the anticipation of final union in glory."
    }
  ],
  "translatedAt": "2025-12-23T06:12:51.467Z"
}