{
  "book": "Song of Songs",
  "bookAbbreviation": "Song",
  "chapter": 5,
  "verses": [
    {
      "pk": 3305001,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 1,
      "text": "I have come into my garden, my sister, my bride. I have gathered my myrrh with my spices. I have eaten my honeycomb with my honey; I have drunk my wine with my milk. Eat, friends; drink, and be drunk with love!",
      "links": "<a href='/AIV/22/4/12'>Song 4:12</a>; <a href='/AIV/22/5/16'>Song 5:16</a>",
      "comment": "The imagery of the bridegroom entering the garden represents fulfillment and intimate union. Early Christian interpreters saw this verse as symbolic of Christ's union with the Church. The garden motif recalls Eden and hints at restoration and communion. 'Wine with milk' evokes abundance and spiritual satisfaction. The invitation to 'friends' suggests a communal celebration—reminiscent of liturgical participation in sacred mystery."
    },
    {
      "pk": 3305002,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 2,
      "text": "I slept, but my heart was awake. Listen! My beloved is knocking: 'Open to me, my sister, my love, my dove, my perfect one, for my head is wet with dew, my locks with the drops of the night.'",
      "links": "<a href='/AIV/22/2/14'>Song 2:14</a>; <a href='/AIV/22/3/1'>Song 3:1</a>",
      "comment": "The bride's divided state—sleeping yet awake—suggests spiritual tension between longing and complacency. The beloved’s persistence points to Christ seeking the soul. 'Wet with dew' signals endurance and sorrow (cf. Jesus praying at night, <a href='/AIV/41/14/32-42'>Mark 14:32–42</a>)."
    },
    {
      "pk": 3305003,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 3,
      "text": "I have taken off my robe; how can I put it on again? I have washed my feet; how can I soil them?",
      "links": "<a href='/AIV/22/3/1'>Song 3:1</a>",
      "comment": "The hesitation represents spiritual reluctance to respond to divine invitation after spiritual comfort. Early commentators link this to the need to rise and answer the Lord’s call, even when inconvenient."
    },
    {
      "pk": 3305004,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 4,
      "text": "My beloved put his hand through the latch of the door, and my heart was stirred for him.",
      "links": "<a href='/AIV/22/2/16'>Song 2:16</a>",
      "comment": "The bridegroom's persistence breaks through hesitation; parallels arise with Christ overcoming barriers between Himself and those He loves (cf. <a href='/AIV/66/3/20'>Rev 3:20</a>)."
    },
    {
      "pk": 3305005,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 5,
      "text": "I rose to open for my beloved, and my hands dripped with myrrh, my fingers with flowing myrrh, on the handles of the lock.",
      "links": "<a href='/AIV/22/3/6'>Song 3:6</a>; <a href='/AIV/19/45/8'>Ps. 45:8</a>",
      "comment": "Myrrh, symbolic of suffering and sacrifice, connects to Christ’s Passion (<a href='/AIV/41/15/23'>Mark 15:23</a>). The bride partakes of this mystery in responding to love."
    },
    {
      "pk": 3305006,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 6,
      "text": "I opened to my beloved, but my beloved had turned away and gone. My heart failed me when he spoke. I searched for him, but did not find him; I called him, but he did not answer.",
      "links": "<a href='/AIV/22/3/1-2'>Song 3:1–2</a>",
      "comment": "The soul’s experience of spiritual absence after awakening is echoed in the psalms (<a href='/AIV/19/42/1-2'>Ps. 42:1-2</a>); this reflects the tension of longing in the spiritual journey and the mystery of divine withdrawal to deepen desire."
    },
    {
      "pk": 3305007,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 7,
      "text": "The watchmen who go about the city found me; they struck and wounded me. The keepers of the walls took away my veil from me.",
      "links": "<a href='/AIV/22/3/3'>Song 3:3</a>",
      "comment": "The bride’s suffering at the hands of watchmen is interpreted spiritually as the trials faced by the soul seeking God. The removal of the veil suggests loss of dignity or privacy, perhaps a purifying exposure. Early tradition saw this as martyrdom or sanctification through suffering."
    },
    {
      "pk": 3305008,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 8,
      "text": "I charge you, daughters of Jerusalem, if you find my beloved, that you tell him I am faint with love.",
      "links": "<a href='/AIV/22/2/7'>Song 2:7</a>",
      "comment": "Repeated refrain emphasizes longing; 'daughters of Jerusalem' suggest the communion of believers sharing in spiritual yearning—an echo of intercessory prayer and spiritual solidarity within the faith community."
    },
    {
      "pk": 3305009,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 9,
      "text": "What is your beloved more than another beloved, O most beautiful among women? What is your beloved more than another beloved, that you thus urge us?",
      "links": "<a href='/AIV/22/5/10'>Song 5:10</a>",
      "comment": "The question from others invites testimony—a model for personal witness to the unique love of Christ. The repeated questioning calls the reader to consider the singular fidelity owed to the bridegroom."
    },
    {
      "pk": 3305010,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 10,
      "text": "My beloved is radiant and ruddy, outstanding among ten thousand.",
      "links": "<a href='/AIV/19/45/2'>Ps. 45:2</a>; <a href='/AIV/66/1/14'>Rev 1:14</a>",
      "comment": "Descriptions of the beloved’s beauty and distinction are interpreted as types of Christ—radiant in divinity, ruddy in humanity. 'Ten thousand' suggests incomparability and supremacy."
    },
    {
      "pk": 3305011,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 11,
      "text": "His head is pure gold; his locks are wavy, black as a raven.",
      "links": "<a href='/AIV/22/7/5'>Song 7:5</a>",
      "comment": "Images of gold and raven-black hair evoke nobility and incorruptibility; gold often symbolizes kingship and divinity (cf. <a href='/AIV/19/21/3'>Ps. 21:3</a>)."
    },
    {
      "pk": 3305012,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 12,
      "text": "His eyes are like doves by streams of water, bathed in milk, sitting beside abundant waters.",
      "links": "<a href='/AIV/22/1/15'>Song 1:15</a>; <a href='/AIV/22/4/1'>Song 4:1</a>",
      "comment": "This speaks to purity, gentleness, and depth. Doves symbolize peace and the Spirit (<a href='/AIV/40/3/16'>Matt 3:16</a>), alluding to Christ’s loving gaze."
    },
    {
      "pk": 3305013,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 13,
      "text": "His cheeks are like beds of spices, yielding fragrance; his lips are lilies, dripping myrrh.",
      "links": "<a href='/AIV/22/1/13'>Song 1:13</a>; <a href='/AIV/19/45/2'>Ps. 45:2</a>",
      "comment": "Fragrant cheeks and lips signify words of grace and the effects of Christ’s teachings, sweet yet connected to sacrificial love (myrrh)."
    },
    {
      "pk": 3305014,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 14,
      "text": "His hands are rods of gold set with beryl. His body is polished ivory adorned with sapphires.",
      "links": "<a href='/AIV/22/7/5'>Song 7:5</a>",
      "comment": "Gold and precious stones stress the beloved’s strength and beauty. Ivory suggests purity and glory. Implies a bodily presence worthy of veneration."
    },
    {
      "pk": 3305015,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 15,
      "text": "His legs are pillars of marble set on bases of pure gold. His form is like Lebanon, choice as the cedars.",
      "links": "<a href='/AIV/22/7/8'>Song 7:8</a>; <a href='/AIV/19/92/12'>Ps. 92:12</a>",
      "comment": "Strength, stability, and majesty are evoked. Lebanon and cedar are famed for excellence and endurance, reflecting the eternal and steadfast nature of the beloved."
    },
    {
      "pk": 3305016,
      "translation": "AIV",
      "book": 22,
      "chapter": 5,
      "verse": 16,
      "text": "His mouth is sweetness itself, and he is altogether lovely. This is my beloved, this is my friend, daughters of Jerusalem.",
      "links": "<a href='/AIV/19/19/10'>Ps. 19:10</a>; <a href='/AIV/43/15/13'>John 15:13-15</a>",
      "comment": "The ultimate confession: the beloved is both 'friend' and 'lovely,' capturing intimacy and devotion. Early Christian tradition saw the beloved as an allegory of Christ, inviting the soul to deep communion and love that is both personal and transcendent. The phrase echoes friendship with Christ granted through grace and union in the community of believers."
    }
  ],
  "translatedAt": "2025-12-23T06:13:50.616Z"
}