{
  "book": 26,
  "bookName": "Song of Songs",
  "bookAbbreviation": "Song",
  "chapter": 2,
  "verses": [
    {
      "pk": 26002001,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 1,
      "text": "I am a rose of Sharon, a lily of the valleys.",
      "links": "<a href='/AIV/23/35/1'>Isa. 35:1</a>; <a href='/AIV/28/14/5'>Hos. 14:5</a>",
      "comment": "The beloved refers to herself with poetic imagery. The rose and lily are symbols of beauty and purity, sometimes interpreted allegorically as Israel or the Church. The language connects to imagery of God's restored people in Isaiah 35:1."
    },
    {
      "pk": 26002002,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 2,
      "text": "Like a lily among thorns, so is my beloved among the young women.",
      "links": "<a href='/AIV/19/45/13'>Ps. 45:13</a>",
      "comment": "The beloved is set apart from others, a theme that foreshadows the Church set apart for Christ. This verse is often interpreted as Christ seeing His people as uniquely precious among the nations."
    },
    {
      "pk": 26002003,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 3,
      "text": "As an apple tree among the trees of the forest, so is my beloved among the young men. I delight to sit in his shade, and his fruit is sweet to my taste.",
      "links": "<a href='/AIV/19/34/8'>Ps. 34:8</a>; <a href='/AIV/22/1/16'>Song 1:16</a>",
      "comment": "The beloved finds comfort and satisfaction in her lover, symbolizing spiritual rest and refreshment. 'Fruit' is often linked with spiritual nourishment, echoing Psalm 34:8's invitation to 'taste and see.'"
    },
    {
      "pk": 26002004,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 4,
      "text": "He brought me to the banquet hall, and his banner over me is love.",
      "links": "<a href='/AIV/19/23/5'>Ps. 23:5</a>; <a href='/AIV/22/6/10'>Song 6:10</a>",
      "comment": "The banquet hall suggests intimate fellowship and celebration—often seen as an image of divine communion. The 'banner' is a sign of protection and delight, reflecting God's steadfast love (Psalm 23:5)."
    },
    {
      "pk": 26002005,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 5,
      "text": "Strengthen me with raisins, refresh me with apples, for I am faint with love.",
      "links": "<a href='/AIV/10/6/19'>2 Sam. 6:19</a>; <a href='/AIV/22/1/2'>Song 1:2</a>",
      "comment": "The beloved desires to be sustained in love with food symbolic of blessing and joy. The intensity of her longing reveals the depth of the spiritual union."
    },
    {
      "pk": 26002006,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 6,
      "text": "His left hand is under my head, and his right hand embraces me.",
      "links": "<a href='/AIV/22/8/3'>Song 8:3</a>",
      "comment": "A posture of protection, affection, and intimacy. Many church fathers saw in this an image of Christ's intimate embrace of the faithful, especially in times of prayer and worship."
    },
    {
      "pk": 26002007,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 7,
      "text": "I charge you, daughters of Jerusalem, by the gazelles and the does of the field: Do not stir up or awaken love until it pleases.",
      "links": "<a href='/AIV/22/3/5'>Song 3:5</a>; <a href='/AIV/19/127/2'>Ps. 127:2</a>",
      "comment": "A call to patience and respect for the timing and nature of love—a sign of chastity and waiting for authentic union. The repeated warning underscores spiritual discipline in the pursuit of love."
    },
    {
      "pk": 26002008,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 8,
      "text": "Listen! My beloved! Behold, he comes, leaping over the mountains, bounding over the hills.",
      "links": "<a href='/AIV/19/114/4'>Ps. 114:4</a>; <a href='/AIV/23/52/7'>Isa. 52:7</a>",
      "comment": "The beloved's arrival is sudden and joyful. Early Christian interpreters saw here a foreshadowing of Christ’s coming, both in the Incarnation and in His return (Isaiah 52:7)."
    },
    {
      "pk": 26002009,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 9,
      "text": "My beloved is like a gazelle or a young stag. Behold, he stands behind our wall, gazing through the windows, peering through the lattice.",
      "links": "<a href='/AIV/22/2/17'>Song 2:17</a>; <a href='/AIV/22/4/8'>Song 4:8</a>",
      "comment": "The lover is near yet unseen, representing the way God often works—present though invisible—inviting us to deeper communion even amid obscurity."
    },
    {
      "pk": 26002010,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 10,
      "text": "My beloved spoke and said to me: 'Arise, my love, my beautiful one, and come away.'",
      "links": "<a href='/AIV/19/45/10-11'>Ps. 45:10-11</a>",
      "comment": "A call to deeper intimacy and union, reminiscent of God’s call to His people. Parallels can be drawn to Psalm 45, which celebrates the King's love for His bride."
    },
    {
      "pk": 26002011,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 11,
      "text": "For behold, the winter is past; the rain is over and gone.",
      "links": "<a href='/AIV/24/8/20'>Jer. 8:20</a>; <a href='/AIV/23/55/10-13'>Isa. 55:10-13</a>",
      "comment": "Seasons of hardship are replaced by a time of renewal, much like God’s promises of restoration after exile or affliction (Isaiah 55:10-13)."
    },
    {
      "pk": 26002012,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 12,
      "text": "Flowers appear on the earth; the season of singing has come, and the voice of the turtledove is heard in our land.",
      "links": "<a href='/AIV/19/96/1-2'>Ps. 96:1-2</a>; <a href='/AIV/23/35/2'>Isa. 35:2</a>",
      "comment": "The imagery of spring and new growth represents spiritual awakening—both individual and collective. It's a symbol of the new life that follows reconciliation."
    },
    {
      "pk": 26002013,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 13,
      "text": "The fig tree puts forth its figs, and the vines are in blossom; they give off their fragrance. Arise, my love, my beautiful one, and come away.",
      "links": "<a href='/AIV/24/24/7'>Jer. 24:7</a>; <a href='/AIV/19/1/3'>Ps. 1:3</a>",
      "comment": "Fruitfulness is a common biblical sign of God’s blessing. The repeated invitation reflects God’s persistent call to His beloved."
    },
    {
      "pk": 26002014,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 14,
      "text": "O my dove, hidden in the clefts of the rock, in the secret places of the cliff, let me see your face, let me hear your voice; for your voice is sweet, and your face is lovely.",
      "links": "<a href='/AIV/19/27/5'>Ps. 27:5</a>; <a href='/AIV/19/91/1'>Ps. 91:1</a>",
      "comment": "The dove, a symbol of purity and the Spirit, finds refuge in the rock. The theme of God desiring fellowship with His people is emphasized, echoing language of prayer and contemplation."
    },
    {
      "pk": 26002015,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 15,
      "text": "Catch for us the foxes, the little foxes that ruin the vineyards—for our vineyards are in blossom.",
      "links": "<a href='/AIV/19/80/12-13'>Ps. 80:12-13</a>; <a href='/AIV/23/5/2'>Isa. 5:2</a>",
      "comment": "Small threats can destroy what is flourishing—an image of vigilance in the spiritual life. Many interpret these foxes as temptations or sins that can undermine union with God."
    },
    {
      "pk": 26002016,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 16,
      "text": "My beloved is mine and I am his; he grazes among the lilies.",
      "links": "<a href='/AIV/19/100/3'>Ps. 100:3</a>; <a href='/AIV/22/6/3'>Song 6:3</a>",
      "comment": "This mutual belonging expresses the deep relationship between bride and bridegroom, often read as Christ and the Church. The exclusive bond points to full and lasting communion."
    },
    {
      "pk": 26002017,
      "translation": "AIV",
      "book": 26,
      "bookName": "Song of Songs",
      "bookAbbreviation": "Song",
      "chapter": 2,
      "verse": 17,
      "text": "Until the day breathes and the shadows flee, turn, my beloved, and be like a gazelle or a young stag on the cleft mountains.",
      "links": "<a href='/AIV/19/46/5'>Ps. 46:5</a>; <a href='/AIV/19/42/1'>Ps. 42:1</a>",
      "comment": "The imagery points to awaiting the fullness of union at dawn, a metaphor for longing for Christ’s final coming. The appeal for the beloved to 'turn' can be seen as both a prayer for presence and a hopeful expectation of future reunion."
    }
  ],
  "translatedAt": "2025-12-24T07:12:27.558Z"
}