{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 11,
  "verses": [
    {
      "pk": 2091181,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 1,
      "text": "Then I was given a measuring rod, like a staff, and I was told, 'Rise and measure the temple of God and the altar, and those who worship there,'",
      "links": "<a href='/AIV/26/40/3-5'>Ezek. 40:3-5</a>; <a href='/AIV/38/2/1'>Zech. 2:1</a>",
      "comment": "The measuring of the temple recalls similar visions in Ezekiel and Zechariah (Ezek. 40; Zech. 2). The act of measuring symbolizes God's protection over His sanctuary and people, marking them off as belonging to Him. The temple here may have both a literal and spiritual dimension—pointing to both God's literal dwelling and His gathered people as a spiritual temple (1 Cor. 3:16)."
    },
    {
      "pk": 2091182,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 2,
      "text": "But do not measure the outer court, for it has been given to the nations, and they will trample the holy city for forty-two months.",
      "links": "<a href='/AIV/42/21/24'>Luke 21:24</a>; <a href='/AIV/27/7/25'>Dan. 7:25</a>",
      "comment": "The exclusion of the outer court points to a period of trial or desecration (cf. Luke 21:24). The forty-two months (three and a half years) is a prophetic period seen throughout Daniel and Revelation connected to tribulation (Dan. 7:25; Rev. 13:5). The distinction between inner and outer courts implies a divinely protected remnant within the people of God."
    },
    {
      "pk": 2091183,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 3,
      "text": "'And I will appoint my two witnesses, and they will prophesy for 1,260 days, clothed in sackcloth.'",
      "links": "<a href='/AIV/38/4/3-14'>Zech. 4:3-14</a>; <a href='/AIV/12/1/8'>2 Kgs. 1:8</a>",
      "comment": "The two witnesses echo the imagery of Moses and Elijah (the law and the prophets), or Joshua and Zerubbabel in Zechariah's vision. Sackcloth symbolizes repentance and mourning. The period of 1,260 days corresponds to forty-two months (cf. Dan. 12:6-7). These witnesses stand as testifiers to God’s truth amidst persecution, embodying the prophetic mission of the Church."
    },
    {
      "pk": 2091184,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 4,
      "text": "These are the two olive trees and the two lampstands that stand before the Lord of the earth.",
      "links": "<a href='/AIV/38/4/2-14'>Zech. 4:2-14</a>",
      "comment": "The olive trees and lampstands refer back to Zechariah’s vision (Zech. 4:2-14). Olive trees supply oil for lampstands, symbolizing the outpouring of the Spirit and the continual witness to the Light of Christ in the darkness (Matt. 5:14-16). This reinforces the idea of a priestly and prophetic role, carrying divine guidance for the people."
    },
    {
      "pk": 2091185,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 5,
      "text": "And if anyone seeks to harm them, fire comes out of their mouths and devours their enemies. So if anyone wants to harm them, he must be killed in this way.",
      "links": "<a href='/AIV/24/5/14'>Jer. 5:14</a>; <a href='/AIV/12/1/10'>2 Kgs. 1:10</a>",
      "comment": "This miraculous protection mirrors stories of Elijah (fire from heaven, 2 Kgs. 1:10) and prophetic authority (Jer. 5:14). The striking divine defense points to the authority given by God to His witnesses to proclaim His word, and the consequence of resisting divine truth."
    },
    {
      "pk": 2091186,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 6,
      "text": "These have the authority to shut the sky, so that no rain may fall during the days of their prophecy, and they have power over the waters to turn them into blood and to strike the earth with every kind of plague, as often as they desire.",
      "links": "<a href='/AIV/11/17/1'>1 Kgs. 17:1</a>; <a href='/AIV/2/7/17'>Exod. 7:17</a>",
      "comment": "The witnesses are granted powers like Elijah (shutting the sky; 1 Kgs. 17:1) and Moses (plagues, turning water to blood; Exod. 7:17). Their ministry encompasses both prophetic warning and divine judgment, reinforcing the link with the Old Testament mediators who prefigured the culmination of God’s covenant plan."
    },
    {
      "pk": 2091187,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 7,
      "text": "When they finish their testimony, the beast that rises from the abyss will make war against them, conquer them, and kill them.",
      "links": "<a href='/AIV/27/7/21'>Dan. 7:21</a>; <a href='/AIV/66/13/1'>Rev. 13:1</a>",
      "comment": "The beast’s assault occurs only after the witnesses complete their God-given mission, showing God's sovereignty. This foreshadows the intensified opposition that the people of God face before final victory (cf. Dan. 7:21; Rev. 13:1). Their deaths are likened to persecution of prophets and righteous leaders in salvation history."
    },
    {
      "pk": 2091188,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 8,
      "text": "Their dead bodies will lie in the street of the great city, which symbolically is called Sodom and Egypt, where also their Lord was crucified.",
      "links": "<a href='/AIV/1/19/29-31'>Gen. 19:29-31</a>; <a href='/AIV/2/12/31'>Exod. 12:31</a>; <a href='/AIV/43/19/17-18'>John 19:17-18</a>",
      "comment": "The 'great city' is both literal and symbolic—Jerusalem, the location of Christ’s crucifixion, but also portrayed spiritually as Sodom (sin) and Egypt (bondage). The humiliation of leaving bodies unburied adds to the picture of persecution and apparent defeat of God’s servants, yet anticipates vindication."
    },
    {
      "pk": 2091189,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 9,
      "text": "For three and a half days, people from every people and tribe and language and nation will gaze at their dead bodies and will not permit their bodies to be placed in a tomb.",
      "links": "<a href='/AIV/27/4/16'>Dan. 4:16</a>; <a href='/AIV/19/79/2-3'>Ps. 79:2-3</a>",
      "comment": "The international scope here shows the witnesses’ global relevance and the universal hostility to their message. The refusal to bury them reflects both shame and triumph over God’s servants, yet the three and a half days parallel Christ’s time in the grave, hinting at coming vindication."
    },
    {
      "pk": 2091190,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 10,
      "text": "And those who dwell on the earth will rejoice over them and celebrate, and they will send gifts to each other, because these two prophets had tormented those who dwell on the earth.",
      "links": "<a href='/AIV/8/18/9-12'>Esth. 9:19-22</a>; <a href='/AIV/66/13/7-10'>Rev. 13:7-10</a>",
      "comment": "The reaction of celebration over the death of prophets recalls the world’s opposition to truth. Gift-giving may echo the festivals of victory in Esther (Esth. 9:19-22). Yet, such apparent victory is only momentary, and God’s justice is not thwarted."
    },
    {
      "pk": 2091191,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 11,
      "text": "But after the three and a half days, the breath of life from God entered them, and they stood on their feet, and great fear fell on those who saw them.",
      "links": "<a href='/AIV/26/37/10'>Ezek. 37:10</a>; <a href='/AIV/40/28/5-6'>Matt. 28:5-6</a>",
      "comment": "The imagery of resurrection draws on Ezekiel’s valley of dry bones (Ezek. 37:10) and the resurrection of Jesus Himself, which instills both awe and fear in unbelievers. The 'breath of life' is the Spirit, showing God's power to raise and vindicate His faithful ones. This also points to general resurrection hope for the people of God."
    },
    {
      "pk": 2091192,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 12,
      "text": "And they heard a loud voice from heaven saying to them, 'Come up here.' And they went up to heaven in a cloud, while their enemies watched them.",
      "links": "<a href='/AIV/12/2/11'>2 Kgs. 2:11</a>; <a href='/AIV/41/16/19'>Mark 16:19</a>",
      "comment": "The witnesses’ ascension is reminiscent of Elijah’s translation (2 Kgs. 2:11) and Jesus' ascension (Acts 1:9). This signifies both vindication and exaltation of the faithful, while those who opposed them are left in awe. The cloud is frequently a symbol of divine presence."
    },
    {
      "pk": 2091193,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 13,
      "text": "At that hour there was a great earthquake, and a tenth of the city fell. Seven thousand people were killed in the earthquake, and the rest were terrified and gave glory to the God of heaven.",
      "links": "<a href='/AIV/2/9/12'>Exod. 9:12</a>; <a href='/AIV/27/4/34-37'>Dan. 4:34-37</a>",
      "comment": "The earthquake signifies divine judgment but also leads to repentance, as 'the rest gave glory to the God of heaven.' Throughout Scripture, such displays of power are meant to bring awe and conversion (cf. Dan. 4:34-37). The numbers are symbolic of a significant, but not total, judgment."
    },
    {
      "pk": 2091194,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 14,
      "text": "The second woe has passed; behold, the third woe is coming soon.",
      "links": "<a href='/AIV/66/8/13'>Rev. 8:13</a>; <a href='/AIV/66/9/12'>Rev. 9:12</a>",
      "comment": "This brief announcement heightens the urgency of the vision and connects to the cycle of woes announced earlier (Rev. 8:13, 9:12). Each woe marks intensifying judgment and the approach of God’s final intervention."
    },
    {
      "pk": 2091195,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 15,
      "text": "Then the seventh angel blew his trumpet, and loud voices in heaven said, 'The kingdom of the world has become the kingdom of our Lord and of His Messiah, and He shall reign forever and ever.'",
      "links": "<a href='/AIV/27/2/44'>Dan. 2:44</a>; <a href='/AIV/19/22/28'>Ps. 22:28</a>; <a href='/AIV/42/1/33'>Luke 1:33</a>",
      "comment": "The seventh trumpet announces the culmination of God’s reign (cf. Dan. 2:44; Ps. 22:28). The Messiah's eternal kingship is proclaimed, echoing Daniel and the Psalms. There is a clear fulfillment here of Old Testament prophecy about divine rule established through Christ."
    },
    {
      "pk": 2091196,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 16,
      "text": "And the twenty-four elders who sit before God on their thrones fell on their faces and worshiped God,",
      "links": "<a href='/AIV/66/4/4'>Rev. 4:4</a>; <a href='/AIV/66/5/14'>Rev. 5:14</a>",
      "comment": "The twenty-four elders represent the fullness of God’s people—twelve tribes and twelve apostles—symbolizing the unity of God’s covenant people, Old and New. Their worship shows heavenly liturgy, which earthly worship seeks to imitate."
    },
    {
      "pk": 2091197,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 17,
      "text": "saying, 'We give thanks to You, Lord God Almighty, who is and who was, for You have taken Your great power and begun to reign.'",
      "links": "<a href='/AIV/19/97/1'>Ps. 97:1</a>; <a href='/AIV/66/1/8'>Rev. 1:8</a>",
      "comment": "The elders’ praise affirms God’s eternal nature and sovereignty. Their thanksgiving corresponds to a formal act of liturgical worship, and the titles align with high Christology seen also in Revelation 1:8, showing the shared divine majesty of the Lord and Messiah."
    },
    {
      "pk": 2091198,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 18,
      "text": "'The nations were angry, and Your wrath has come, and the time for the dead to be judged, and for rewarding Your servants, the prophets and the saints, and those who fear Your name, both small and great, and for destroying the destroyers of the earth.'",
      "links": "<a href='/AIV/19/2/1-5'>Ps. 2:1-5</a>; <a href='/AIV/27/12/2'>Dan. 12:2</a>",
      "comment": "This verse refers to the final judgment, resurrection hope, and reward ('prophets and saints')—foreshadowed in Daniel (Dan. 12:2) and Psalms (Ps. 2:1-5). The act of rewarding includes the entire communion of saints across time, with the emphasis on a just and unified divine reward for all the faithful."
    },
    {
      "pk": 2091199,
      "translation": "AIV",
      "book": 66,
      "chapter": 11,
      "verse": 19,
      "text": "Then God’s temple in heaven was opened, and the ark of His covenant was seen within His temple. There were flashes of lightning, rumblings, peals of thunder, an earthquake, and heavy hail.",
      "links": "<a href='/AIV/2/25/10-22'>Exod. 25:10-22</a>; <a href='/AIV/66/15/5'>Rev. 15:5</a>",
      "comment": "The opening of the heavenly temple and revelation of the ark signals God’s intimate presence and faithfulness to His covenant. The accompanying signs are theophanic (cf. Sinai, Exod. 19:16). The ark, long hidden, is now accessible—indicating the new access to God made by Jesus, the true High Priest (Heb. 9:24)."
    }
  ],
  "translatedAt": "2025-12-23T04:25:16.349Z"
}