{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 22,
  "verses": [
    {
      "pk": 560220,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 1,
      "text": "Then the angel showed me a river of the water of life, bright as crystal, flowing from the throne of God and of the Lamb.",
      "links": "<a href='/AIV/26/47/1-12'>Ezekiel 47:1-12</a>; <a href='/AIV/43/4/14'>John 4:14</a>",
      "comment": "The imagery of the water of life echoes Messianic prophecies and also Jesus' promises to give living water (see John 4:14). The unity of God and the Lamb is emphasized, supporting the high Christology of Revelation."
    },
    {
      "pk": 560221,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 2,
      "text": "Through the middle of the street of the city, on both sides of the river, was the tree of life, bearing twelve kinds of fruit, yielding its fruit every month. And the leaves of the tree were for the healing of the nations.",
      "links": "<a href='/AIV/1/2/9'>Genesis 2:9</a>; <a href='/AIV/26/47/12'>Ezekiel 47:12</a>",
      "comment": "The tree of life recalls Eden (Genesis 2:9), now accessible in the New Jerusalem. The twelve fruits may signify fullness and the twelve tribes or apostles, showing the continuity of God's plan."
    },
    {
      "pk": 560222,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 3,
      "text": "No longer will there be any curse. The throne of God and of the Lamb will be in it, and his servants will worship him.",
      "links": "<a href='/AIV/1/3/17'>Genesis 3:17</a>; <a href='/AIV/66/7/15'>Revelation 7:15</a>",
      "comment": "The lifting of the curse fulfills Genesis 3:17, and worship before God's throne reflects a restoration of fellowship lost in Eden."
    },
    {
      "pk": 560223,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 4,
      "text": "They will see his face, and his name will be on their foreheads.",
      "links": "<a href='/AIV/19/17/15'>Psalm 17:15</a>; <a href='/AIV/66/14/1'>Revelation 14:1</a>",
      "comment": "Seeing God's face indicates intimate communion. The marking of foreheads echoes priestly service (Exodus 28:36-38; Revelation 14:1), and is tied to the concept of being set apart for God."
    },
    {
      "pk": 560224,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 5,
      "text": "There will be no night anymore. They will not need the light of a lamp or the sun, for the Lord God will shine upon them, and they will reign forever and ever.",
      "links": "<a href='/AIV/23/60/19-20'>Isaiah 60:19-20</a>; <a href='/AIV/66/21/23-25'>Revelation 21:23-25</a>",
      "comment": "The presence of God gives eternal light, fulfilling Isaiah 60:19-20. Reigning forever points not only to Christ's kingship but also involves the faithful in His reign."
    },
    {
      "pk": 560225,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 6,
      "text": "And he said to me, 'These words are trustworthy and true. The Lord, the God of the spirits of the prophets, has sent his angel to show his servants what must soon take place.'",
      "links": "<a href='/AIV/4/16/22'>Numbers 16:22</a>; <a href='/AIV/66/1/1'>Revelation 1:1</a>",
      "comment": "The phrase 'God of the spirits of the prophets' links to Old Testament images of prophetic inspiration. Revelation emphasizes its reliability."
    },
    {
      "pk": 560226,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 7,
      "text": "'Look, I am coming soon! Blessed is the one who keeps the words of the prophecy of this book.'",
      "links": "<a href='/AIV/66/1/3'>Revelation 1:3</a>; <a href='/AIV/40/24/42'>Matthew 24:42</a>",
      "comment": "A call to readiness. The blessing for 'keeping' the words hints at a tradition of sacred writings intended for spiritual formation, not mere knowledge."
    },
    {
      "pk": 560227,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 8,
      "text": "I, John, am the one who heard and saw these things. And when I had heard and seen, I fell down to worship at the feet of the angel who showed them to me.",
      "links": "<a href='/AIV/66/1/1-2'>Revelation 1:1-2</a>; <a href='/AIV/66/19/10'>Revelation 19:10</a>",
      "comment": "John's testimony stresses personal witness. His attempt to worship the angel demonstrates the importance of rightly directed worship."
    },
    {
      "pk": 560228,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 9,
      "text": "But he said to me, 'Do not do that! I am a fellow servant with you and with your brothers the prophets, and with those who keep the words of this book. Worship God.'",
      "links": "<a href='/AIV/66/19/10'>Revelation 19:10</a>; <a href='/AIV/2/20/3'>Exodus 20:3</a>",
      "comment": "Angels are servants, not objects of worship. This affirms the exclusive worship owed to God alone (Exodus 20:3), consistent with both Old and New Testament teaching."
    },
    {
      "pk": 560229,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 10,
      "text": "And he said to me, 'Do not seal up the words of the prophecy of this book, for the time is near.'",
      "links": "<a href='/AIV/27/8/26'>Daniel 8:26</a>; <a href='/AIV/66/1/3'>Revelation 1:3</a>",
      "comment": "Unlike Daniel's sealed prophecy (Daniel 8:26), Revelation is meant to be made known immediately for urgent response."
    },
    {
      "pk": 560230,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 11,
      "text": "'Let the evildoer still do evil, and the filthy still be filthy, and the righteous still do right, and the holy still be holy.'",
      "links": "<a href='/AIV/27/12/10'>Daniel 12:10</a>",
      "comment": "A solemn warning: at the close of history, people's choices are fixed. Echoes Daniel 12:10 regarding the finalization of destinies."
    },
    {
      "pk": 560231,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 12,
      "text": "'Look, I am coming soon, bringing my reward with me, to repay each one according to what he has done.'",
      "links": "<a href='/AIV/19/62/12'>Psalm 62:12</a>; <a href='/AIV/40/16/27'>Matthew 16:27</a>",
      "comment": "Judgment according to works (Matthew 16:27; Psalm 62:12) affirms both divine mercy and justice. This supports a view of final judgment including the consideration of deeds."
    },
    {
      "pk": 560232,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 13,
      "text": "'I am the Alpha and the Omega, the First and the Last, the Beginning and the End.'",
      "links": "<a href='/AIV/66/1/8'>Revelation 1:8</a>; <a href='/AIV/23/44/6'>Isaiah 44:6</a>",
      "comment": "Christ's absolute divinity is affirmed. This title parallels Old Testament references to YHWH (Isaiah 44:6), crowning Jesus with attributes belonging to God alone (see also Revelation 1:8)."
    },
    {
      "pk": 560233,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 14,
      "text": "Blessed are those who wash their robes, so that they may have the right to the tree of life and may enter the city by the gates.",
      "links": "<a href='/AIV/66/7/14'>Revelation 7:14</a>; <a href='/AIV/1/3/24'>Genesis 3:24</a>",
      "comment": "Washing robes symbolizes purification, possibly alluding to sacramental realities and cleansing in Christ (see Revelation 7:14). Entry to the city recalls the lost access to Eden (Genesis 3:24), now restored."
    },
    {
      "pk": 560234,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 15,
      "text": "Outside are the dogs, the sorcerers, the sexually immoral, the murderers, the idolaters, and everyone who loves and practices falsehood.",
      "links": "<a href='/AIV/66/21/8'>Revelation 21:8</a>; <a href='/AIV/5/23/18'>Deuteronomy 23:18</a>",
      "comment": "Those excluded mirror common biblical vice lists. The imagery of 'dogs' draws from Old Testament language for spiritual outsiders (Deuteronomy 23:18)."
    },
    {
      "pk": 560235,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 16,
      "text": "'I, Jesus, have sent my angel to give you this testimony for the churches. I am the root and the descendant of David, the bright morning star.'",
      "links": "<a href='/AIV/23/11/1'>Isaiah 11:1</a>; <a href='/AIV/66/2/28'>Revelation 2:28</a>",
      "comment": "Jesus as the root and offspring of David fulfills Messianic prophecy (Isaiah 11:1). The 'morning star' imagery associates Jesus with divine guidance and kingship."
    },
    {
      "pk": 560236,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 17,
      "text": "The Spirit and the bride say, 'Come.' And let the one who hears say, 'Come.' Let the one who is thirsty come, and let the one who desires take the water of life freely.",
      "links": "<a href='/AIV/43/7/37'>John 7:37</a>; <a href='/AIV/66/21/2'>Revelation 21:2</a>",
      "comment": "Spirit and bride together invite the world, suggesting both ecclesial and mystical union. The open invitation reflects Jesus' message in John 7:37 and the fulfillment of longing for communion with God."
    },
    {
      "pk": 560237,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 18,
      "text": "I warn everyone who hears the words of the prophecy of this book: If anyone adds to them, God will add to him the plagues described in this book.",
      "links": "<a href='/AIV/5/4/2'>Deuteronomy 4:2</a>; <a href='/AIV/66/16/1-21'>Revelation 16:1-21</a>",
      "comment": "Echoes Deuteronomy 4:2's warning to preserve God’s Word intact, showing continuity with earlier Scripture."
    },
    {
      "pk": 560238,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 19,
      "text": "And if anyone takes away from the words of this book of prophecy, God will take away his share in the tree of life and in the holy city, which are described in this book.",
      "links": "<a href='/AIV/5/12/32'>Deuteronomy 12:32</a>; <a href='/AIV/66/2/7'>Revelation 2:7</a>",
      "comment": "Again parallels Old Testament instruction on Scripture's integrity (Deuteronomy 12:32), and highlights the danger of altering revealed truth."
    },
    {
      "pk": 560239,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 20,
      "text": "He who testifies to these things says, 'Yes, I am coming soon.' Amen. Come, Lord Jesus!",
      "links": "<a href='/AIV/66/1/7'>Revelation 1:7</a>; <a href='/AIV/42/21/27'>Luke 21:27</a>",
      "comment": "The repeated assurance of Christ's soon return calls believers to eager expectation. The phrase 'Come, Lord Jesus!' has become a prayer in Christian worship, expressing longing for final union."
    },
    {
      "pk": 560240,
      "translation": "AIV",
      "book": 66,
      "chapter": 22,
      "verse": 21,
      "text": "The grace of the Lord Jesus be with all. Amen.",
      "links": "<a href='/AIV/53/3/18'>2 Thessalonians 3:18</a>; <a href='/AIV/1/6/8'>Genesis 6:8</a>",
      "comment": "The closing blessing extends the grace of Christ to all believers. This type of benediction ties together the ancient tradition of blessing and grace as God's final word to his people."
    }
  ],
  "translatedAt": "2025-12-23T04:29:33.455Z"
}