{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 5,
  "verses": [
    {
      "pk": 2056711,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 1,
      "text": "Then I saw in the right hand of Him who sits on the throne a scroll written inside and on the back, sealed with seven seals.",
      "links": "<a href='/AIV/26/2/9'>Ezek. 2:9</a>; <a href='/AIV/27/12/4'>Dan. 12:4</a>; <a href='/AIV/66/4/2'>Rev. 4:2</a>",
      "comment": "The scroll being sealed echoes Ezekiel and Daniel, emphasizing its divine authority and hidden truth. The seven seals symbolize completeness and the mystery of God's plan."
    },
    {
      "pk": 2056712,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 2,
      "text": "And I saw a mighty angel proclaiming with a loud voice, 'Who is worthy to open the scroll and to break its seals?'",
      "links": "<a href='/AIV/40/28/2'>Matt. 28:2</a>; <a href='/AIV/66/10/1'>Rev. 10:1</a>",
      "comment": "Only one who is truly holy and with authority from God can reveal His ultimate purpose, relating to the unique mediatorship found in the New Covenant."
    },
    {
      "pk": 2056713,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 3,
      "text": "And no one in heaven or on earth or under the earth was able to open the scroll or to look into it.",
      "links": "<a href='/AIV/19/49/7'>Psalm 49:7</a>; <a href='/AIV/27/4/35'>Dan. 4:35</a>",
      "comment": "This underlines the incapacity of all beings apart from Christ, highlighting humanity’s need for a divine savior and the significance of godly intercession."
    },
    {
      "pk": 2056714,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 4,
      "text": "And I began to weep greatly, because no one was found worthy to open the scroll or to look into it.",
      "links": "<a href='/AIV/45/8/22'>Rom. 8:22</a>",
      "comment": "John’s sorrow reflects humanity’s longing for redemption, which only Christ fulfills as the unique Lamb and true King."
    },
    {
      "pk": 2056715,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 5,
      "text": "But one of the elders said to me, 'Do not weep. Behold, the Lion of the tribe of Judah, the Root of David, has conquered, so that He can open the scroll and its seven seals.'",
      "links": "<a href='/AIV/01/49/9'>Gen. 49:9-10</a>; <a href='/AIV/23/11/1'>Isa. 11:1,10</a>; <a href='/AIV/40/1/1'>Matt. 1:1</a>",
      "comment": "The Lion and the Root point to Jesus as the fulfillment of messianic prophecy, son of David and Israel’s true King. The elder’s declaration also introduces the importance of the heavenly council (elders) as witnesses to God's plan."
    },
    {
      "pk": 2056716,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 6,
      "text": "And I saw, between the throne and the four living creatures, and among the elders, a Lamb standing, as though slain, having seven horns and seven eyes, which are the seven Spirits of God sent out into all the earth.",
      "links": "<a href='/AIV/23/53/7'>Isa. 53:7</a>; <a href='/AIV/43/1/29'>John 1:29</a>; <a href='/AIV/38/4/10'>Zech. 4:10</a>; <a href='/AIV/66/1/4'>Rev. 1:4</a>",
      "comment": "Jesus appears as the Lamb, recalling sacrifices in the Old Covenant, yet alive—signifying His resurrection. The seven eyes and horns represent the fullness of the Spirit (see Isaiah 11:2), and describe Christ’s divine authority and omniscience."
    },
    {
      "pk": 2056717,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 7,
      "text": "And He went and took the scroll from the right hand of Him who sits on the throne.",
      "links": "<a href='/AIV/43/5/22-27'>John 5:22-27</a>; <a href='/AIV/66/4/2'>Rev. 4:2</a>",
      "comment": "Christ alone is able to fulfill and execute the Father’s will, emphasizing His unique role as Mediator in the heavenly liturgy."
    },
    {
      "pk": 2056718,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 8,
      "text": "And when He had taken the scroll, the four living creatures and the twenty-four elders fell down before the Lamb, each holding a harp and golden bowls full of incense, which are the prayers of the saints.",
      "links": "<a href='/AIV/19/141/2'>Ps. 141:2</a>; <a href='/AIV/66/8/3-4'>Rev. 8:3-4</a>",
      "comment": "The prostration before the Lamb is direct worship, signifying Christ's divinity. The golden bowls of incense represent the prayers of saints, which ascend before God through intercessors in the heavenly court, underscoring the continuing efficacy of prayer and mediation."
    },
    {
      "pk": 2056719,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 9,
      "text": "And they sang a new song, saying, 'Worthy are You to take the scroll and to open its seals, because You were slain, and by Your blood You purchased people for God from every tribe and language and people and nation.'",
      "links": "<a href='/AIV/19/40/3'>Ps. 40:3</a>; <a href='/AIV/23/53/5'>Isa. 53:5</a>; <a href='/AIV/44/20/28'>Acts 20:28</a>",
      "comment": "The new song celebrates redemption accomplished by Christ’s sacrificial death, which gathers a universal people for God. It points toward a visible unity of the faithful, transcending nationality."
    },
    {
      "pk": 2056720,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 10,
      "text": "And You have made them a kingdom and priests to our God, and they shall reign on the earth.",
      "links": "<a href='/AIV/02/19/6'>Exod. 19:6</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>; <a href='/AIV/66/1/6'>Rev. 1:6</a>",
      "comment": "This affirms the royal priesthood of all believers, with Christ as the High Priest. The theme reinforces a visible, structured community united in worship and reign."
    },
    {
      "pk": 2056721,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 11,
      "text": "Then I looked, and I heard the voice of many angels around the throne and the living creatures and the elders; their number was myriads of myriads and thousands of thousands,",
      "links": "<a href='/AIV/27/7/10'>Dan. 7:10</a>; <a href='/AIV/58/12/22'>Heb. 12:22</a>",
      "comment": "This vast multitude points to the heavenly liturgy and the communion of saints, indicating that worship in heaven includes both angels and redeemed humanity."
    },
    {
      "pk": 2056722,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 12,
      "text": "saying with a loud voice, 'Worthy is the Lamb who was slain, to receive power and wealth and wisdom and strength and honor and glory and blessing!'",
      "links": "<a href='/AIV/50/2/9-11'>Phil. 2:9-11</a>; <a href='/AIV/66/4/11'>Rev. 4:11</a>",
      "comment": "The sevenfold doxology ascribes divine attributes to Christ, emphasizing His worthiness and unity with the Father. The repeated worship of the Lamb alongside the Father is clear evidence of Christ's divinity."
    },
    {
      "pk": 2056723,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 13,
      "text": "And I heard every creature in heaven and on earth and under the earth and in the sea, and all that is in them, saying, 'To Him who sits on the throne and to the Lamb be blessing and honor and glory and dominion forever and ever!'",
      "links": "<a href='/AIV/19/145/21'>Ps. 145:21</a>; <a href='/AIV/50/2/10-11'>Phil. 2:10-11</a>",
      "comment": "All creation joins in worship, signifying the cosmic lordship of the Father and the Son, further affirming Christ’s place in divine worship and universal authority."
    },
    {
      "pk": 2056724,
      "translation": "AIV",
      "book": 66,
      "chapter": 5,
      "verse": 14,
      "text": "And the four living creatures said, 'Amen!' and the elders fell down and worshiped.",
      "links": "<a href='/AIV/66/7/11'>Rev. 7:11</a>",
      "comment": "This closing act of worship by the heavenly court illustrates the perpetual adoration given to God and the Lamb. The structure and unity of this worship scene reflects a model for true worship on earth united with heaven."
    }
  ],
  "translatedAt": "2025-12-23T04:22:58.695Z"
}