{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 15,
  "verses": [
    {
      "pk": 73015001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 15,
      "verse": 1,
      "text": "Then I saw another sign in heaven, great and wonderful: seven angels with seven last plagues, for with them the wrath of God is finished.",
      "links": "<a href='/AIV/73/8/2'>Rev. 8:2</a>; <a href='/AIV/2/7/17'>Ex. 7:17</a>; <a href='/AIV/19/78/49'>Ps. 78:49</a>",
      "comment": "Here, the vision of the seven angels recalls the plagues on Egypt (see Exodus 7-12), signifying divine judgment and the completion of God’s wrath. The number seven emphasizes perfection and completion, and points to God’s sovereignty. The imagery prepares for the final stage of God’s plan, fulfilling prophetic patterns from the Old Testament."
    },
    {
      "pk": 73015002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 15,
      "verse": 2,
      "text": "And I saw something like a sea of glass mixed with fire, and those who had conquered the beast and its image and the number of its name, standing beside the sea of glass, holding harps of God.",
      "links": "<a href='/AIV/73/4/6'>Rev. 4:6</a>; <a href='/AIV/73/13/15-18'>Rev. 13:15-18</a>; <a href='/AIV/2/15/1'>Ex. 15:1</a>",
      "comment": "The sea of glass, previously mentioned in Rev. 4:6, is now mixed with fire, symbolizing both purity and judgment. The victorious believers—those who overcame by persevering in faith—hold harps, recalling the praise and worship found in Exodus 15 after crossing the Red Sea. This combination gently emphasizes the value of worship and endurance, including in liturgical form."
    },
    {
      "pk": 73015003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 15,
      "verse": 3,
      "text": "And they sing the song of Moses, the servant of God, and the song of the Lamb, saying, ‘Great and marvelous are Your works, Lord God Almighty! Righteous and true are Your ways, King of the nations!’",
      "links": "<a href='/AIV/2/15/1-18'>Ex. 15:1-18</a>; <a href='/AIV/19/92/5'>Ps. 92:5</a>; <a href='/AIV/24/10/7'>Jer. 10:7</a>; <a href='/AIV/73/5/9'>Rev. 5:9</a>",
      "comment": "The song of Moses (Ex. 15), sung after salvation from Egypt, is joined with the song of the Lamb, identifying Jesus' redemptive work with the deliverance of God’s people. These two songs, old and new, are united in praise for God—suggesting continuity and fulfillment in worship, and underscoring the importance of both Word and tradition."
    },
    {
      "pk": 73015004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 15,
      "verse": 4,
      "text": "Who will not fear You, Lord, and glorify Your name? For You alone are holy. All nations will come and worship before You, for Your righteous acts have been revealed.",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>; <a href='/AIV/19/22/27'>Ps. 22:27</a>; <a href='/AIV/23/66/23'>Is. 66:23</a>; <a href='/AIV/73/14/7'>Rev. 14:7</a>",
      "comment": "The universal call to worship echoes numerous Old Testament prophecies about all nations worshiping God (see Isaiah 66:23). Notice the emphasis on God’s holiness and the act of glorifying His name—these elements feature prominently in historic forms of worship, signaling both reverence and a liturgical tradition."
    },
    {
      "pk": 73015005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 15,
      "verse": 5,
      "text": "After this I looked, and the sanctuary of the tent of witness in heaven was opened.",
      "links": "<a href='/AIV/2/40/34-35'>Ex. 40:34-35</a>; <a href='/AIV/58/9/23'>Heb. 9:23</a>; <a href='/AIV/73/11/19'>Rev. 11:19</a>",
      "comment": "The opening of the heavenly sanctuary alludes to the tabernacle—the tent of meeting in the Old Testament (Exodus 40). This draws a parallel between earthly worship and the reality in heaven, hinting at the continuity of sacred space and the priestly function, and teasing the idea of access to grace through ritual."
    },
    {
      "pk": 73015006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 15,
      "verse": 6,
      "text": "And out of the sanctuary came the seven angels with the seven plagues, clothed in pure bright linen, with golden sashes around their chests.",
      "links": "<a href='/AIV/2/28/4'>Ex. 28:4</a>; <a href='/AIV/73/1/13'>Rev. 1:13</a>; <a href='/AIV/73/8/2'>Rev. 8:2</a>",
      "comment": "The linen garments and golden sashes signify holiness and priestly service, reminiscent of the attire of priests in the Old Testament (Exodus 28). These angelic ministers act on behalf of God, showing the sacramental and mediatorial aspects embedded in heavenly worship."
    },
    {
      "pk": 73015007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 15,
      "verse": 7,
      "text": "And one of the four living creatures gave the seven angels seven golden bowls full of the wrath of God, who lives forever and ever.",
      "links": "<a href='/AIV/73/4/6'>Rev. 4:6</a>; <a href='/AIV/73/5/8'>Rev. 5:8</a>; <a href='/AIV/19/75/8'>Ps. 75:8</a>",
      "comment": "The golden bowls recall temple imagery and sacrificial vessels (see Exodus and Psalms), and link worship with the pouring out of God’s judgment. The living creatures participate in the liturgy of heaven, blending worship and justice in a way that points toward the necessity of both mercy and truth in God’s plan."
    },
    {
      "pk": 73015008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 15,
      "verse": 8,
      "text": "And the sanctuary was filled with smoke from the glory of God and from His power, and no one could enter the sanctuary until the seven plagues of the seven angels were finished.",
      "links": "<a href='/AIV/2/40/34-35'>Ex. 40:34-35</a>; <a href='/AIV/19/104/32'>Ps. 104:32</a>; <a href='/AIV/58/9/7'>Heb. 9:7</a>",
      "comment": "The smoke recalls God’s presence at the dedication of the tabernacle (Exodus 40) and Solomon's temple (1 Kings 8:10-11). This visually attests to divine majesty and mystery, and the restriction from entering the sanctuary suggests the gravity of judgment and a reverence for sacred space, paralleling traditions where the fullness of God’s glory is approached with deep respect and holiness."
    }
  ],
  "translatedAt": "2025-12-24T12:38:54.837Z"
}