{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 20,
  "verses": [
    {
      "pk": 73020001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 1,
      "text": "Then I saw an angel coming down from heaven, holding in his hand the key to the Abyss and a great chain.",
      "links": "<a href='/AIV/42/8/31'>Luke 8:31</a>; <a href='/AIV/66/9/1'>Rev. 9:1</a>",
      "comment": "The 'Abyss' refers to the bottomless pit, a place of judgment and restraint for evil spirits. The imagery of the angel with authority reinforces divine control over spiritual forces."
    },
    {
      "pk": 73020002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 2,
      "text": "He seized the dragon, that ancient serpent, who is the devil and Satan, and bound him for a thousand years.",
      "links": "<a href='/AIV/01/3/1'>Gen. 3:1</a>; <a href='/AIV/66/12/9'>Rev. 12:9</a>",
      "comment": "The language explicitly identifies the serpent from Genesis with Satan. The 'thousand years' has been interpreted both literally and figuratively; it signifies a divinely appointed era of restraint upon evil."
    },
    {
      "pk": 73020003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 3,
      "text": "He threw him into the Abyss, shut it, and sealed it over him, so that he would not deceive the nations any longer until the thousand years were finished. After that, he must be released for a short time.",
      "links": "<a href='/AIV/66/12/9'>Rev. 12:9</a>; <a href='/AIV/66/9/1-2'>Rev. 9:1-2</a>",
      "comment": "Satan's influence is supernaturally restrained during this period. The subsequent release shows God's sovereignty even over evil, ensuring that ultimate judgment is entirely in God's timing."
    },
    {
      "pk": 73020004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 4,
      "text": "Then I saw thrones, and those who sat on them were given authority to judge. I also saw the souls of those who had been beheaded for their testimony of Jesus and for the word of God, and those who had not worshiped the beast or its image and had not received its mark on their foreheads or hands. They came to life and reigned with Christ for a thousand years.",
      "links": "<a href='/AIV/27/7/22'>Dan. 7:22</a>; <a href='/AIV/40/19/28'>Matt. 19:28</a>; <a href='/AIV/66/6/9'>Rev. 6:9</a>",
      "comment": "The thrones and judgment echo Daniel and Christ's promise to the apostles. This displays the reward for martyrdom and faithfulness. Viewing the reigning with Christ as including both earthly and heavenly rule reflects a tradition maintaining unity of the faithful with Christ."
    },
    {
      "pk": 73020005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 5,
      "text": "The rest of the dead did not come to life until the thousand years were ended. This is the first resurrection.",
      "links": "<a href='/AIV/43/5/28-29'>John 5:28-29</a>",
      "comment": "This distinguishes between the reward of the righteous and the final judgment. The spiritual implication is a foretaste of the resurrection promised by Christ (see John 5:28-29). Early Christian writers often connected the first resurrection with the entrance into the blessed state for the faithful."
    },
    {
      "pk": 73020006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 6,
      "text": "Blessed and holy is the one who shares in the first resurrection! Over such, the second death has no power, but they will be priests of God and of Christ, and will reign with him for a thousand years.",
      "links": "<a href='/AIV/66/2/11'>Rev. 2:11</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "The 'second death' is eternal separation from God. Sharing in the first resurrection is closely tied to union with Christ and priestly service, implying sacramental participation and the call to holiness."
    },
    {
      "pk": 73020007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 7,
      "text": "When the thousand years are finished, Satan will be released from his prison,",
      "links": "<a href='/AIV/66/20/3'>Rev. 20:3</a>",
      "comment": "The brief release after the thousand years signals a final confrontation, emphasizing God's timing and patience before the ultimate defeat of evil."
    },
    {
      "pk": 73020008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 8,
      "text": "and will go out to deceive the nations at the four corners of the earth—Gog and Magog—to gather them for battle. Their number is like the sand of the sea.",
      "links": "<a href='/AIV/26/38/2-3'>Ezek. 38:2-3</a>; <a href='/AIV/01/22/17'>Gen. 22:17</a>",
      "comment": "Gog and Magog symbolize forces opposed to God, drawing from Ezekiel. The reference to the 'sand of the sea' stresses the vast number, yet God's power is undiminished."
    },
    {
      "pk": 73020009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 9,
      "text": "They marched up over the breadth of the earth and surrounded the camp of the saints and the beloved city. But fire came down from heaven and consumed them.",
      "links": "<a href='/AIV/12/1/10-12'>2 Kgs. 1:10-12</a>; <a href='/AIV/19/87/2'>Ps. 87:2</a>",
      "comment": "The 'beloved city' is often seen as Jerusalem, both physical and symbolic. Divine intervention by fire recalls Old Testament theophanies. Safeguarding the faithful points to God’s unfailing protection."
    },
    {
      "pk": 73020010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 10,
      "text": "And the devil, who deceived them, was thrown into the lake of fire and sulfur where the beast and the false prophet also are, and they will be tormented day and night forever and ever.",
      "links": "<a href='/AIV/40/25/41'>Matt. 25:41</a>; <a href='/AIV/66/19/20'>Rev. 19:20</a>",
      "comment": "The final judgment is eternal and absolute. This verse underscores everlasting separation from God for rebellious powers, affirming the necessity of faithful endurance to the end."
    },
    {
      "pk": 73020011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 11,
      "text": "Then I saw a great white throne and the one seated on it. The earth and the sky fled from his presence, and no place was found for them.",
      "links": "<a href='/AIV/27/7/9'>Dan. 7:9-10</a>; <a href='/AIV/66/4/2'>Rev. 4:2</a>",
      "comment": "The great white throne symbolizes perfect justice and holiness. The cosmic disturbance demonstrates the overwhelming majesty of God's judgment."
    },
    {
      "pk": 73020012,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 12,
      "text": "And I saw the dead, great and small, standing before the throne, and books were opened. Another book was opened, which is the book of life. The dead were judged according to what was written in the books, according to their works.",
      "links": "<a href='/AIV/19/62/12'>Ps. 62:12</a>; <a href='/AIV/40/16/27'>Matt. 16:27</a>; <a href='/AIV/66/3/5'>Rev. 3:5</a>",
      "comment": "Judgment based on works highlights the importance of faith expressed through action, while the 'book of life' indicates God’s gracious initiative. Both justice and mercy are seen together."
    },
    {
      "pk": 73020013,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 13,
      "text": "The sea gave up the dead that were in it, and Death and Hades gave up the dead that were in them, and they were judged each one according to their works.",
      "links": "<a href='/AIV/40/25/31-32'>Matt. 25:31-32</a>",
      "comment": "No one escapes the final judgment. The resurrection here is general and universal, aligning with the consistent teaching of bodily resurrection."
    },
    {
      "pk": 73020014,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 14,
      "text": "Then Death and Hades were thrown into the lake of fire. This is the second death, the lake of fire.",
      "links": "<a href='/AIV/46/15/26'>1 Cor. 15:26</a>; <a href='/AIV/66/2/11'>Rev. 2:11</a>",
      "comment": "The defeat of Death and Hades fulfills the prophecy that death will be destroyed (see 1 Cor. 15:26). The 'second death' points to the ultimate consequence for those outside God's grace."
    },
    {
      "pk": 73020015,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 20,
      "verse": 15,
      "text": "And if anyone was not found written in the book of life, he was thrown into the lake of fire.",
      "links": "<a href='/AIV/66/3/5'>Rev. 3:5</a>; <a href='/AIV/40/10/28'>Matt. 10:28</a>",
      "comment": "To have one's name in the book of life is to belong to God fully. This underlines the need for perseverance in faith and relationship with God, as preserved and mediated through the community of believers."
    }
  ],
  "translatedAt": "2025-12-24T12:41:18.266Z"
}