{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 8,
  "verses": [
    {
      "pk": 8932080,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 1,
      "text": "When he opened the seventh seal, there was silence in heaven for about half an hour.",
      "links": "<a href='/AIV/66/6/1'>Rev. 6:1</a>; <a href='/AIV/38/2/13'>Zech. 2:13</a>",
      "comment": "The silence following the seventh seal signals a profound moment of awe before God’s unfolding judgments. Zechariah 2:13 similarly calls all creation to be silent before the Lord. Some early Christian commentators saw this silence as representing the reverent adoration of the heavenly liturgy before God acts."
    },
    {
      "pk": 8932081,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 2,
      "text": "Then I saw the seven angels who stand before God, and seven trumpets were given to them.",
      "links": "<a href='/AIV/66/8/6'>Rev. 8:6</a>; <a href='/AIV/66/15/1'>Rev. 15:1</a>; <a href='/AIV/20/9/13-14'>Prov. 9:13–14</a>",
      "comment": "The seven angels stand in God’s presence, suggesting a special role like the angels before the throne (Rev. 15:1). Trumpets throughout Scripture signal major divine interventions (<a href='/AIV/2/19/16'>Ex. 19:16</a>), echoing the trumpets at Mount Sinai."
    },
    {
      "pk": 8932082,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 3,
      "text": "And another angel came and stood at the altar with a golden censer, and he was given much incense to offer with the prayers of all the saints on the golden altar before the throne.",
      "links": "<a href='/AIV/66/5/8'>Rev. 5:8</a>; <a href='/AIV/2/30/1'>Ex. 30:1</a>; <a href='/AIV/19/141/2'>Ps. 141:2</a>",
      "comment": "Here, the angel intercedes, offering incense—symbolic of prayers—at the heavenly altar. This heavenly liturgy parallels earthly worship practices described in Exodus 30:1 and Psalm 141:2, suggesting that the worship of God includes prayer and offering, a theme deeply rooted in communion theology."
    },
    {
      "pk": 8932083,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 4,
      "text": "The smoke of the incense with the prayers of the saints rose up before God from the hand of the angel.",
      "links": "<a href='/AIV/66/5/8'>Rev. 5:8</a>; <a href='/AIV/19/141/2'>Ps. 141:2</a>",
      "comment": "Incense and prayers ascending together depict an active spiritual mediation, showing the communion of saints with God. The scene underlines the importance of intercessory prayer, echoing the idea of mediation between God and believers."
    },
    {
      "pk": 8932084,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 5,
      "text": "Then the angel took the censer, filled it with fire from the altar, and threw it on the earth. And there were peals of thunder, voices, flashes of lightning, and an earthquake.",
      "links": "<a href='/AIV/2/19/16-19'>Ex. 19:16–19</a>; <a href='/AIV/66/11/19'>Rev. 11:19</a>",
      "comment": "Fire from the altar cast to earth symbolizes judgment initiated from God’s throne, similar to Old Testament theophanies at Sinai (<a href='/AIV/2/19/16'>Exodus 19</a>). The physical phenomena reveal God’s direct involvement in creation and judgment."
    },
    {
      "pk": 8932085,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 6,
      "text": "Now the seven angels who had the seven trumpets prepared to blow them.",
      "links": "<a href='/AIV/66/8/2'>Rev. 8:2</a>; <a href='/AIV/6/6/16'>Josh. 6:16</a>",
      "comment": "The trumpets recall Joshua’s conquest of Jericho, where seven priests blew seven trumpets as God acted (<a href='/AIV/6/6/16'>Joshua 6:16</a>). These instruments often signal key moments in redemption history."
    },
    {
      "pk": 8932086,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 7,
      "text": "The first angel blew his trumpet, and hail and fire mixed with blood were thrown onto the earth. A third of the earth was burned up, a third of the trees burned up, and all green grass was burned up.",
      "links": "<a href='/AIV/2/9/23-25'>Ex. 9:23–25</a>; <a href='/AIV/66/16/2'>Rev. 16:2</a>",
      "comment": "The plague mirrors the Exodus judgments (hail and fire, <a href='/AIV/2/9/23'>Ex. 9</a>) and the devastation shows both literal and spiritual consequences—earthly destruction as a sign of spiritual impurity facing divine judgment."
    },
    {
      "pk": 8932087,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 8,
      "text": "The second angel blew his trumpet, and something like a great mountain burning with fire was thrown into the sea, and a third of the sea became blood.",
      "links": "<a href='/AIV/2/7/20-21'>Ex. 7:20–21</a>; <a href='/AIV/24/51/25'>Jer. 51:25</a>",
      "comment": "Imagery of the burning mountain recalls judgment prophecy in Jeremiah 51:25 and the plague of blood in Exodus 7. The spiritual reading points to the corruption and judgment of nations and powers arrayed against God’s kingdom."
    },
    {
      "pk": 8932088,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 9,
      "text": "A third of the living creatures in the sea died, and a third of the ships were destroyed.",
      "links": "<a href='/AIV/2/7/21'>Ex. 7:21</a>; <a href='/AIV/19/104/25-29'>Ps. 104:25–29</a>",
      "comment": "This verse underscores the scale of the judgment. God’s sovereignty over nature is demonstrated, reminiscent of events in Exodus and Psalms showing creation’s dependency on the Creator."
    },
    {
      "pk": 8932089,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 10,
      "text": "The third angel blew his trumpet, and a great star fell from heaven, blazing like a torch, and it fell on a third of the rivers and on the springs of water.",
      "links": "<a href='/AIV/23/14/12'>Isa. 14:12</a>; <a href='/AIV/66/9/1'>Rev. 9:1</a>",
      "comment": "The falling star may symbolize a fallen angel or a great calamity. Isaiah 14:12 uses similar imagery. Spiritually, this signals corruption entering even the sources of life and purity."
    },
    {
      "pk": 8932090,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 11,
      "text": "The name of the star is Wormwood. A third of the waters became bitter, and many people died from the waters because they had become bitter.",
      "links": "<a href='/AIV/24/9/15'>Jer. 9:15</a>; <a href='/AIV/24/23/15'>Jer. 23:15</a>",
      "comment": "Wormwood represents affliction, bitterness, and spiritual ruin (Jeremiah 9:15). The fact that many die points to the deadly effect of corruption and heresy—in both a literal and spiritual sense—on the faithful."
    },
    {
      "pk": 8932091,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 12,
      "text": "The fourth angel blew his trumpet, and a third of the sun was struck, and a third of the moon, and a third of the stars, so that a third of their light was darkened. A third of the day was without light, and likewise a third of the night.",
      "links": "<a href='/AIV/2/10/21-22'>Ex. 10:21–22</a>; <a href='/AIV/24/4/23'>Jer. 4:23</a>",
      "comment": "The cosmic darkening echoes the plague of darkness in Exodus 10. On a spiritual level, it reveals the disastrous effects of sin and error on the light God bestows, which guides souls to salvation."
    },
    {
      "pk": 8932092,
      "translation": "AIV",
      "book": 66,
      "chapter": 8,
      "verse": 13,
      "text": "Then I looked, and I heard a single eagle flying in midheaven, speaking in a loud voice, 'Woe, woe, woe to those who dwell on the earth, because of the remaining blasts of the trumpet which the three angels are about to blow!'",
      "links": "<a href='/AIV/66/9/12'>Rev. 9:12</a>; <a href='/AIV/66/11/14'>Rev. 11:14</a>",
      "comment": "The triple 'woe' marks the intensification of judgment. The eagle’s warning signals a universal call to repentance. Tradition often reads the eagle as a messenger summoning all to prepare for final judgment, much like Jesus’ exhortations to vigilance (<a href='/AIV/40/24/42'>Matt. 24:42</a>)."
    }
  ],
  "translatedAt": "2025-12-23T04:24:07.622Z"
}