{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 3,
  "verses": [
    {
      "pk": 3103001,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 1,
      "text": "To the angel of the church in Sardis write: These are the words of him who holds the seven spirits of God and the seven stars. I know your works; you have a reputation of being alive, but you are dead.",
      "links": "<a href='/AIV/66/1/4'>Rev. 1:4</a>; <a href='/AIV/66/1/16'>Rev. 1:16</a>; <a href='/AIV/66/1/20'>Rev. 1:20</a>",
      "comment": "The 'seven spirits of God' recalls Rev 1:4, symbolizing the fullness of the Holy Spirit. The seven stars are the angels or messengers of the churches (Rev 1:20). The contrast between reputation and reality warns against outward appearances of faith without inner life."
    },
    {
      "pk": 3103002,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 2,
      "text": "Be alert and strengthen what remains and is about to die, for I have not found your works complete before my God.",
      "links": "<a href='/AIV/66/2/5'>Rev. 2:5</a>; <a href='/AIV/49/5/14'>Eph. 5:14</a>",
      "comment": "A call for spiritual vigilance and restoration. 'Works not complete' implies that perseverance and striving for holiness is ongoing—see Jas. 2:17 on faith and works."
    },
    {
      "pk": 3103003,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 3,
      "text": "Remember, then, what you have received and heard. Hold to it and repent. If you do not wake up, I will come like a thief, and you will not know at what hour I will come upon you.",
      "links": "<a href='/AIV/40/24/43'>Matt. 24:43</a>; <a href='/AIV/52/5/2'>1 Thess. 5:2</a>",
      "comment": "The command to 'remember' what was received suggests the importance of the apostolic teaching handed down and remaining faithful to it."
    },
    {
      "pk": 3103004,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 4,
      "text": "Yet you have a few people in Sardis who have not soiled their garments. They will walk with me in white, for they are worthy.",
      "links": "<a href='/AIV/66/7/13'>Rev. 7:13</a>; <a href='/AIV/66/19/8'>Rev. 19:8</a>",
      "comment": "White garments are symbolic of purity and righteousness—a common image in Revelation. The reward is communion with Christ."
    },
    {
      "pk": 3103005,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 5,
      "text": "He who overcomes will be clothed like them in white garments. I will never blot his name out of the book of life. I will confess his name before my Father and before his angels.",
      "links": "<a href='/AIV/66/20/12'>Rev. 20:12</a>; <a href='/AIV/42/12/8'>Luke 12:8</a>; <a href='/AIV/19/69/28'>Ps. 69:28</a>",
      "comment": "The 'book of life' is an image of eternal destiny (see Phil. 4:3). The promise not to blot out the name emphasizes persevering grace. The confession before the Father echoes Christ’s words in Matt. 10:32."
    },
    {
      "pk": 3103006,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 6,
      "text": "He who has an ear, let him hear what the Spirit says to the churches.",
      "links": "<a href='/AIV/66/2/7'>Rev. 2:7</a>",
      "comment": "This repeated phrase in the letters to the churches underscores the direct guidance of the Holy Spirit to the one universal Church throughout history."
    },
    {
      "pk": 3103007,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 7,
      "text": "To the angel of the church in Philadelphia write: These are the words of the Holy One, the True One, who holds the key of David, who opens and no one can shut, who shuts and no one opens.",
      "links": "<a href='/AIV/23/22/22'>Isa. 22:22</a>; <a href='/AIV/41/2/10'>Mark 2:10</a>",
      "comment": "Jesus is identified here with titles reserved for God in the Old Testament, underscoring his divinity. The 'key of David' is an allusion to Isa. 22:22—a symbol of messianic authority over the house of God."
    },
    {
      "pk": 3103008,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 8,
      "text": "I know your works. See, I have set before you an open door, which no one is able to shut. I know that you have little power, yet you have kept my word and have not denied my name.",
      "links": "<a href='/AIV/46/16/9'>1 Cor. 16:9</a>",
      "comment": "'Open door' can mean opportunity for evangelization or access to God’s presence (see John 10:9). Perseverance in keeping the faith is highly valued."
    },
    {
      "pk": 3103009,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 9,
      "text": "Behold, I will make those of the synagogue of Satan, who say that they are Jews and are not, but lie—behold, I will make them come and bow down before your feet and they will know that I have loved you.",
      "links": "<a href='/AIV/66/2/9'>Rev. 2:9</a>; <a href='/AIV/23/60/14'>Isa. 60:14</a>",
      "comment": "'Synagogue of Satan' refers to spiritual opposition, not literal ethnicity. Salvation history involves fulfillment of Old Testament promises—see Isa. 60:14."
    },
    {
      "pk": 3103010,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 10,
      "text": "Because you have kept my command to persevere, I will also keep you from the hour of trial that is coming upon the whole world, to test those who dwell on the earth.",
      "links": "<a href='/AIV/43/17/15'>John 17:15</a>",
      "comment": "The promise of protection for the faithful. Some interpret this as spiritual preservation through trials, not necessarily absence of suffering but faithful endurance."
    },
    {
      "pk": 3103011,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 11,
      "text": "I am coming quickly. Hold fast what you have, so that no one may take your crown.",
      "links": "<a href='/AIV/66/22/7'>Rev. 22:7</a>; <a href='/AIV/46/9/25'>1 Cor. 9:25</a>",
      "comment": "Christ's return is imminent and encourages vigilance. The 'crown' is a symbol of eternal reward for faithfulness."
    },
    {
      "pk": 3103012,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 12,
      "text": "He who overcomes, I will make him a pillar in the temple of my God, and he shall never go out of it. I will write upon him the name of my God, and the name of the city of my God, the New Jerusalem which comes down from my God out of heaven, and my own new name.",
      "links": "<a href='/AIV/66/21/2'>Rev. 21:2</a>; <a href='/AIV/23/56/5'>Isa. 56:5</a>",
      "comment": "Pillars in the temple point to a permanent, honored position in God's dwelling, a metaphor for belonging eternally to God's house. The 'name' points to identity and possession by God."
    },
    {
      "pk": 3103013,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 13,
      "text": "He who has an ear, let him hear what the Spirit says to the churches.",
      "links": "<a href='/AIV/66/2/7'>Rev. 2:7</a>",
      "comment": "Repetition emphasizes universal application to all churches; a call to discern the Spirit's ongoing guidance."
    },
    {
      "pk": 3103014,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 14,
      "text": "To the angel of the church in Laodicea write: These are the words of the Amen, the faithful and true witness, the beginning of God's creation.",
      "links": "<a href='/AIV/43/1/3'>John 1:3</a>; <a href='/AIV/51/1/15'>Col. 1:15-18</a>",
      "comment": "Christ is 'the Amen,' signifying certainty and fulfillment of God’s promises, and 'the beginning of God's creation,' indicating Jesus’s preeminence and role as the source of creation."
    },
    {
      "pk": 3103015,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 15,
      "text": "I know your works: you are neither cold nor hot. I wish you were either cold or hot.",
      "links": "<a href='/AIV/45/12/11'>Rom. 12:11</a>",
      "comment": "Lukewarmness refers to spiritual apathy. God's desire is for passionate faith and decisive commitment."
    },
    {
      "pk": 3103016,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 16,
      "text": "So, because you are lukewarm, and neither hot nor cold, I am about to spit you out of my mouth.",
      "links": "<a href='/AIV/19/51/16-17'>Ps. 51:16–17</a>",
      "comment": "Being lukewarm equates to hypocrisy and insincerity, which is distasteful to God (see also Matt. 23 on hypocrisy)."
    },
    {
      "pk": 3103017,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 17,
      "text": "For you say, 'I am rich, I have prospered, and I need nothing,' not realizing that you are wretched, pitiful, poor, blind, and naked.",
      "links": "<a href='/AIV/40/5/3'>Matt. 5:3</a>",
      "comment": "Spiritual blindness and self-sufficiency are obstacles to grace. True riches are in spiritual poverty and dependence on God."
    },
    {
      "pk": 3103018,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 18,
      "text": "I counsel you to buy from me gold refined by fire, so that you may be rich; and white garments so that you may clothe yourself, and the shame of your nakedness may not be seen; and salve to anoint your eyes, so that you may see.",
      "links": "<a href='/AIV/60/1/7'>1 Pet. 1:7</a>; <a href='/AIV/19/51/7'>Ps. 51:7</a>",
      "comment": "Spiritual riches are refined by trial. Purity (white garments) and spiritual sight (salve) come from Christ alone."
    },
    {
      "pk": 3103019,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 19,
      "text": "Those whom I love, I rebuke and discipline; so be zealous and repent.",
      "links": "<a href='/AIV/20/3/12'>Prov. 3:12</a>; <a href='/AIV/58/12/6'>Heb. 12:6</a>",
      "comment": "Discipline is a sign of Christ’s love and sonship (see Heb. 12:6). Repentance is ongoing and necessary for all believers."
    },
    {
      "pk": 3103020,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 20,
      "text": "Behold, I stand at the door and knock. If anyone hears my voice and opens the door, I will come in to him and eat with him, and he with me.",
      "links": "<a href='/AIV/42/24/30'>Luke 24:30</a>; <a href='/AIV/22/5/2'>Song 5:2</a>",
      "comment": "Christ offers intimate communion, reminiscent of table fellowship, which points to the ongoing presence of Christ among His people, especially in the breaking of bread."
    },
    {
      "pk": 3103021,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 21,
      "text": "To the one who overcomes, I will grant the right to sit with me on my throne, as I also conquered and sat down with my Father on his throne.",
      "links": "<a href='/AIV/42/22/30'>Luke 22:30</a>; <a href='/AIV/66/21/7'>Rev. 21:7</a>",
      "comment": "Participation in Christ’s reign is promised to all who conquer. This points to the reality of sharing in Christ’s victory and authority."
    },
    {
      "pk": 3103022,
      "translation": "AIV",
      "book": 66,
      "chapter": 3,
      "verse": 22,
      "text": "He who has an ear, let him hear what the Spirit says to the churches.",
      "links": "<a href='/AIV/66/2/7'>Rev. 2:7</a>",
      "comment": "This repeated exhortation calls all believers to attentiveness and obedience to the Spirit’s direction throughout the generations."
    }
  ],
  "translatedAt": "2025-12-23T04:22:05.370Z"
}