{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 16,
  "verses": [
    {
      "pk": 2001601,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 1,
      "text": "Then I heard a loud voice from the temple saying to the seven angels, \"Go and pour out on the earth the seven bowls of God's wrath.\"",
      "links": "<a href='/AIV/2/7/17-21'>Ex. 7:17–21</a>; <a href='/AIV/19/79/6'>Ps. 79:6</a>; <a href='/AIV/66/15/1'>Rev. 15:1</a>",
      "comment": "The command comes from the temple, showing the divine origin and authority for the judgments. The reference to 'bowls' connects with Old Testament imagery, especially the plagues in Exodus."
    },
    {
      "pk": 2001602,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 2,
      "text": "So the first angel went and poured out his bowl on the earth, and harmful and painful sores came upon the people who had the mark of the beast and who worshiped its image.",
      "links": "<a href='/AIV/2/9/8-11'>Ex. 9:8–11</a>; <a href='/AIV/66/13/16-17'>Rev. 13:16–17</a>",
      "comment": "This plague echoes the boils sent on Egypt. Notice the emphasis that only those loyal to the beast are afflicted—pointing to a real separation between the righteous and the rebellious."
    },
    {
      "pk": 2001603,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 3,
      "text": "The second angel poured out his bowl into the sea, and it became like the blood of a dead man, and every living thing in the sea died.",
      "links": "<a href='/AIV/2/7/17-21'>Ex. 7:17–21</a>; <a href='/AIV/66/8/8-9'>Rev. 8:8–9</a>",
      "comment": "Mirroring the first Egyptian plague, the language of 'blood of a dead man' intensifies the thoroughness of judgment—total corruption and death."
    },
    {
      "pk": 2001604,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 4,
      "text": "Then the third angel poured out his bowl into the rivers and the springs of water, and they became blood.",
      "links": "<a href='/AIV/2/7/19'>Ex. 7:19</a>; <a href='/AIV/66/8/10-11'>Rev. 8:10–11</a>",
      "comment": "Further extending the scope, now even freshwater is struck. The parallel to the Exodus plagues is even more direct. God's justice is comprehensive."
    },
    {
      "pk": 2001605,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 5,
      "text": "And I heard the angel of the waters say, \"You are righteous, O Holy One, who is and who was, because you have judged these things;",
      "links": "<a href='/AIV/19/119/137'>Ps. 119:137</a>; <a href='/AIV/66/1/4'>Rev. 1:4</a>",
      "comment": "The declaration of righteousness reinforces God’s justice. The title ‘Holy One, who is and who was’ recalls God’s eternal nature, echoing the divine name in Exodus and earlier in Revelation."
    },
    {
      "pk": 2001606,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 6,
      "text": "for they have shed the blood of saints and prophets, and you have given them blood to drink. It is what they deserve.\"",
      "links": "<a href='/AIV/19/79/3'>Ps. 79:3</a>; <a href='/AIV/66/18/24'>Rev. 18:24</a>",
      "comment": "This links the suffering of God’s faithful across the ages, connecting to the blood of the prophets shed unjustly (cf. Matt. 23:34–35). Notice the righteous retribution—those who shed blood now face a just consequence."
    },
    {
      "pk": 2001607,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 7,
      "text": "And I heard the altar saying, \"Yes, Lord God Almighty, true and just are your judgments!\"",
      "links": "<a href='/AIV/5/32/4'>Deut. 32:4</a>; <a href='/AIV/66/15/3'>Rev. 15:3</a>",
      "comment": "The voice from the altar recalls the souls of the martyrs beneath it (Rev. 6:9), joining their prayers with God’s actions. God’s judgments are affirmed as reliable and just, a point stressed repeatedly."
    },
    {
      "pk": 2001608,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 8,
      "text": "The fourth angel poured out his bowl on the sun, and it was allowed to scorch people with fire.",
      "links": "<a href='/AIV/19/121/6'>Ps. 121:6</a>; <a href='/AIV/66/8/12'>Rev. 8:12</a>",
      "comment": "Instead of protecting life, the sun now becomes an instrument of judgment. There’s an allusion to God’s sovereignty over creation, reminiscent of Old Testament language."
    },
    {
      "pk": 2001609,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 9,
      "text": "People were scorched by the intense heat, and they cursed the name of God who had authority over these plagues. But they did not repent and give him glory.",
      "links": "<a href='/AIV/2/9/12'>Ex. 9:12</a>; <a href='/AIV/66/9/20-21'>Rev. 9:20–21</a>",
      "comment": "Despite clear signs, the people harden their hearts—mirroring Pharaoh in Exodus. The lack of repentance emphasizes divine justice and hints at the mystery of conversion and human will."
    },
    {
      "pk": 2001610,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 10,
      "text": "The fifth angel poured out his bowl on the throne of the beast, and its kingdom was plunged into darkness. People gnawed their tongues in pain",
      "links": "<a href='/AIV/2/10/21-23'>Ex. 10:21–23</a>; <a href='/AIV/66/13/2'>Rev. 13:2</a>",
      "comment": "Like the plague of darkness in Egypt, the beast’s power is shown to be vulnerable to God. The darkness here is a physical and spiritual image—a theme developed by Church tradition as a symbol of sin and separation from God."
    },
    {
      "pk": 2001611,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 11,
      "text": "and they cursed the God of heaven because of their pains and sores, but they did not repent of their deeds.",
      "links": "<a href='/AIV/66/9/20-21'>Rev. 9:20–21</a>",
      "comment": "Unrepentance is again stressed. This repeated refrain signals the tragedy of hard-heartedness and underscores the biblical call to perseverance and ongoing conversion."
    },
    {
      "pk": 2001612,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 12,
      "text": "The sixth angel poured out his bowl on the great river Euphrates, and its water was dried up, to prepare the way for the kings from the east.",
      "links": "<a href='/AIV/2/14/21'>Ex. 14:21</a>; <a href='/AIV/23/11/15'>Isa. 11:15</a>",
      "comment": "The Euphrates stood as a barrier against invasion. Its drying up evokes the Red Sea crossing and signals a coming conflict. Church tradition often sees this as paving the way for a final confrontation between good and evil."
    },
    {
      "pk": 2001613,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 13,
      "text": "And I saw coming out of the mouth of the dragon, the mouth of the beast, and the mouth of the false prophet, three unclean spirits like frogs.",
      "links": "<a href='/AIV/2/8/2-7'>Ex. 8:2–7</a>; <a href='/AIV/66/12/9'>Rev. 12:9</a>; <a href='/AIV/66/19/20'>Rev. 19:20</a>",
      "comment": "The unclean spirits, appearing like frogs, echo the Egyptian plague but here represent demonic deception through speech—a warning about false prophecy and deceit."
    },
    {
      "pk": 2001614,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 14,
      "text": "For they are demonic spirits, performing signs, who go out to the kings of the whole world, to gather them for battle on the great day of God the Almighty.",
      "links": "<a href='/AIV/40/24/24'>Matt. 24:24</a>; <a href='/AIV/29/3/2'>Joel 3:2</a>",
      "comment": "The lying wonders imitate God’s miracles to deceive the nations. This foreshadows the coming battle of Armageddon. Reference to 'the great day' points back to Old Testament prophecies about the Day of the Lord."
    },
    {
      "pk": 2001615,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 15,
      "text": "\"Behold, I am coming like a thief! Blessed is the one who stays awake and keeps his garments, so that he may not go about naked and be seen exposed!\"",
      "links": "<a href='/AIV/40/24/43'>Matt. 24:43</a>; <a href='/AIV/66/3/3-5'>Rev. 3:3-5</a>",
      "comment": "Jesus' sudden coming—'like a thief'—is repeatedly mentioned in the Gospels. The call to keep one’s garments emphasizes ongoing vigilance and purity, recalling teachings about spiritual readiness and persevering in faith."
    },
    {
      "pk": 2001616,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 16,
      "text": "And they assembled them at the place that in Hebrew is called Armageddon.",
      "links": "<a href='/AIV/7/5/19'>Judg. 5:19</a>; <a href='/AIV/66/20/8-9'>Rev. 20:8-9</a>",
      "comment": "Armageddon refers to the Mount of Megiddo, the site of many Bible battles. This symbolically represents the climactic struggle between God and evil."
    },
    {
      "pk": 2001617,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 17,
      "text": "The seventh angel poured out his bowl into the air, and a loud voice came out of the temple from the throne, saying, \"It is done!\"",
      "links": "<a href='/AIV/19/75/8'>Ps. 75:8</a>; <a href='/AIV/66/21/6'>Rev. 21:6</a>; <a href='/AIV/43/19/30'>John 19:30</a>",
      "comment": "The 'It is done!' echoes Jesus’ words on the cross, signaling completion (John 19:30). This final judgment is comprehensive, touching the very air."
    },
    {
      "pk": 2001618,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 18,
      "text": "And there were flashes of lightning, rumblings, peals of thunder, and a great earthquake such as had never been since mankind was on the earth, so great was that earthquake.",
      "links": "<a href='/AIV/2/19/16-19'>Ex. 19:16-19</a>; <a href='/AIV/66/11/19'>Rev. 11:19</a>",
      "comment": "The theophany signals God’s presence and judgment, drawing strongly from Old Testament imagery at Sinai and other times God revealed His majesty in storm and earthquake."
    },
    {
      "pk": 2001619,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 19,
      "text": "The great city was split into three parts, and the cities of the nations fell. And God remembered Babylon the great, to give her the cup of the wine of the fury of his wrath.",
      "links": "<a href='/AIV/23/13/19'>Isa. 13:19</a>; <a href='/AIV/24/25/15'>Jer. 25:15</a>; <a href='/AIV/66/14/8'>Rev. 14:8</a>",
      "comment": "Babylon symbolizes the sum of worldly opposition to God. 'The cup of wrath' is a common prophetic image for judgment (Jer. 25:15). Dividing the city recalls God’s ultimate sovereignty even over proud nations."
    },
    {
      "pk": 2001620,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 20,
      "text": "And every island fled away, and no mountains were to be found.",
      "links": "<a href='/AIV/23/24/19-20'>Isa. 24:19-20</a>; <a href='/AIV/66/6/14'>Rev. 6:14</a>",
      "comment": "Universal upheaval indicates dramatic transformation at the end times, echoing Old Testament prophecies about cosmic renewal."
    },
    {
      "pk": 2001621,
      "translation": "AIV",
      "book": 66,
      "chapter": 16,
      "verse": 21,
      "text": "And huge hailstones, about one hundred pounds each, fell from heaven on people; and they cursed God for the plague of the hail, because the plague was so severe.",
      "links": "<a href='/AIV/2/9/18-26'>Ex. 9:18-26</a>; <a href='/AIV/24/50/30'>Jer. 50:30</a>",
      "comment": "Like the final plagues on Egypt, the destructive hail shows God’s power to judge. Despite the severity, people still harden their hearts. The narrative calls believers to humility and ongoing conversion, echoing the ancient call to repentance in both Testaments."
    }
  ],
  "translatedAt": "2025-12-23T04:27:08.848Z"
}