{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 19,
  "verses": [
    {
      "pk": 73019001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 1,
      "text": "After this, I heard what sounded like a great multitude in heaven, shouting, 'Hallelujah! Salvation and glory and power belong to our God,",
      "links": "<a href='/AIV/19/3/8'>Ps. 3:8</a>; <a href='/AIV/42/2/13'>Luke 2:13</a>; <a href='/AIV/19/104/35'>Ps. 104:35</a>",
      "comment": "The hymn of praise recalls the worship of God in the Psalms and the angels' proclamation at Christ’s birth (Luke 2:13). Salvation is given by God alone and signals the ultimate victory over evil, reflecting both an ongoing spiritual reality and future fulfillment."
    },
    {
      "pk": 73019002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 2,
      "text": "because His judgments are true and just. He has condemned the great prostitute who corrupted the earth with her immorality, and has avenged the blood of His servants shed by her.'",
      "links": "<a href='/AIV/19/19/9'>Ps. 19:9</a>; <a href='/AIV/24/51/24'>Jer. 51:24</a>; <a href='/AIV/66/17/6'>Rev. 17:6</a>",
      "comment": "The reference to true and just judgments evokes Psalm 19:9. The 'great prostitute' likely symbolizes corrupt systems or false worship which harm God’s people, connecting to earlier references in Revelation 17. A strong statement about God’s protection and vindication for the faithful."
    },
    {
      "pk": 73019003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 3,
      "text": "Again they shouted, 'Hallelujah! The smoke from her goes up forever and ever.'",
      "links": "<a href='/AIV/23/34/9-10'>Isa. 34:9-10</a>; <a href='/AIV/19/104/35'>Ps. 104:35</a>",
      "comment": "The eternal rising of smoke symbolizes final judgment (Isaiah 34:9-10). The repeated 'Hallelujah' expresses joy in God's justice being fully established. Everlasting consequences reflect a literal fulfillment and serve as a spiritual warning."
    },
    {
      "pk": 73019004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 4,
      "text": "The twenty-four elders and the four living creatures fell down and worshipped God, who sits on the throne, saying, 'Amen. Hallelujah!'",
      "links": "<a href='/AIV/66/4/4'>Rev. 4:4</a>; <a href='/AIV/19/106/48'>Ps. 106:48</a>",
      "comment": "Those around God's throne represent leadership and creation’s fullness worshipping—in agreement ('Amen') and praise ('Hallelujah'). This is also a model for communal, united worship."
    },
    {
      "pk": 73019005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 5,
      "text": "And a voice came from the throne, saying, 'Praise our God, all you His servants, you who fear Him, small and great!'",
      "links": "<a href='/AIV/19/134/1'>Ps. 134:1</a>; <a href='/AIV/66/11/18'>Rev. 11:18</a>",
      "comment": "Praise is commanded to all, echoing Psalm 134:1’s call for each servant, no matter their status. This inclusive command fosters unity and the practice of communal praise, a sign of true worship."
    },
    {
      "pk": 73019006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 6,
      "text": "Then I heard something like the sound of a large crowd, like the roar of many waters and loud thunder, shouting, 'Hallelujah! For the Lord our God, the Almighty, reigns.'",
      "links": "<a href='/AIV/26/1/24'>Ezek. 1:24</a>; <a href='/AIV/19/97/1'>Ps. 97:1</a>",
      "comment": "The imagery of many waters (Ezekiel 1:24) and thunder accompany the declaration of the Almighty’s sovereignty (Psalm 97:1), emphasizing God's authority and inviting the Church to recognize His reign already present and future."
    },
    {
      "pk": 73019007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 7,
      "text": "Let us rejoice and be glad and give Him glory, because the marriage of the Lamb has come, and His bride has made herself ready.",
      "links": "<a href='/AIV/23/61/10'>Isa. 61:10</a>; <a href='/AIV/40/22/2'>Matt. 22:2</a>",
      "comment": "This verse unites Old Testament and New Testament marriage imagery: Isaiah 61:10 (bride adorned) and the parable in Matthew 22:2. The 'Lamb' refers to Christ and His union with the Church, teaching the importance of preparing for this union through faith, holiness, and sacraments."
    },
    {
      "pk": 73019008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 8,
      "text": "She was given fine linen to wear, bright and pure. For the fine linen is the righteous deeds of the saints.",
      "links": "<a href='/AIV/23/61/10'>Isa. 61:10</a>; <a href='/AIV/66/3/5'>Rev. 3:5</a>",
      "comment": "The linen represents good works performed by believers, which are granted by grace (Rev. 3:5). Emphasizes the necessity of visible, lived righteousness resulting from faith—a doctrine anchored in Scripture."
    },
    {
      "pk": 73019009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 9,
      "text": "And the angel said to me, 'Write this: Blessed are those who are invited to the wedding supper of the Lamb.' And he said, 'These are the true words of God.'",
      "links": "<a href='/AIV/40/22/2-10'>Matt. 22:2-10</a>; <a href='/AIV/42/14/15'>Luke 14:15</a>",
      "comment": "The imagery aligns with Jesus’ parable (Matthew 22:2-10), showing the blessing of being called to communion with Christ. The Church’s sacramental nature is hinted at in the celebration of the 'marriage feast.'"
    },
    {
      "pk": 73019010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 10,
      "text": "At this I fell at his feet to worship him. But he said to me, 'Don’t do that! I am a servant with you and your brothers, who hold to the testimony of Jesus. Worship God! For the testimony of Jesus is the spirit of prophecy.'",
      "links": "<a href='/AIV/44/10/25-26'>Acts 10:25-26</a>; <a href='/AIV/66/22/8-9'>Rev. 22:8-9</a>",
      "comment": "Saints and angels, though holy, are not worshipped; only God is. The testimony of Jesus as the spirit of prophecy affirms the unity of Scripture around Him—both literally, in fulfilled prediction, and spiritually, in the life of the Church."
    },
    {
      "pk": 73019011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 11,
      "text": "Then I saw heaven opened, and there was a white horse. Its rider is called Faithful and True, and He judges and makes war in righteousness.",
      "links": "<a href='/AIV/19/45/4'>Ps. 45:4</a>; <a href='/AIV/23/11/4'>Isa. 11:4</a>; <a href='/AIV/66/6/2'>Rev. 6:2</a>",
      "comment": "The rider is Christ, depicted as the conqueror (Rev. 6:2, Psalm 45:4), fulfilling prophecies of righteous judgment. Affirms the divine kingship and the role of Christ as judge—both present and future."
    },
    {
      "pk": 73019012,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 12,
      "text": "His eyes are like blazing fire, and on His head are many crowns. He has a name written that no one knows except Himself.",
      "links": "<a href='/AIV/27/10/6'>Dan. 10:6</a>; <a href='/AIV/66/1/14'>Rev. 1:14</a>",
      "comment": "Imagery suggests divine knowledge and authority (Daniel 10:6, Rev. 1:14). The mysterious name emphasizes Christ’s incomprehensible nature, alluding to the ineffability of God's truest identity known perfectly only to Himself."
    },
    {
      "pk": 73019013,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 13,
      "text": "He is dressed in a robe dipped in blood, and His name is called The Word of God.",
      "links": "<a href='/AIV/23/63/2-3'>Isa. 63:2-3</a>; <a href='/AIV/43/1/1'>John 1:1</a>",
      "comment": "The blood recalls Isaiah 63:2-3—judgment and sacrifice. John 1:1 identifies 'The Word' with Christ, confirming His divinity, active in both creation and redemption. This is a high Christological verse, revealing Jesus’ eternal role."
    },
    {
      "pk": 73019014,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 14,
      "text": "The armies of heaven, clothed in fine linen, white and pure, were following Him on white horses.",
      "links": "<a href='/AIV/19/68/17'>Ps. 68:17</a>; <a href='/AIV/66/17/14'>Rev. 17:14</a>",
      "comment": "These armies comprise holy ones—angels and saints—sharing in Christ’s victory (Psalm 68:17, Rev. 17:14). Their purity is sacramental, hinting at the transformative power of grace."
    },
    {
      "pk": 73019015,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 15,
      "text": "Out of His mouth comes a sharp sword with which to strike down the nations, and He will rule them with a rod of iron. He treads the winepress of the fury of the wrath of God Almighty.",
      "links": "<a href='/AIV/19/2/9'>Ps. 2:9</a>; <a href='/AIV/23/63/3'>Isa. 63:3</a>; <a href='/AIV/66/12/5'>Rev. 12:5</a>",
      "comment": "The sword is God’s word (Psalm 2:9, Isaiah 63:3), powerful for judgment and salvation. Christ’s divine authority is underscored, and the winepress echoes themes of atonement and judgment."
    },
    {
      "pk": 73019016,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 16,
      "text": "And on His robe and on His thigh He has a name written: KING OF KINGS AND LORD OF LORDS.",
      "links": "<a href='/AIV/27/2/47'>Dan. 2:47</a>; <a href='/AIV/54/6/15'>1 Tim. 6:15</a>; <a href='/AIV/66/17/14'>Rev. 17:14</a>",
      "comment": "This title affirms Jesus’ supreme authority, echoing Daniel 2:47 and 1 Timothy 6:15. Christ’s eternal kingship is both historical and spiritual, foundational for all Christian belief and worship."
    },
    {
      "pk": 73019017,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 17,
      "text": "Then I saw an angel standing in the sun, and he cried with a loud voice to all the birds flying high in the sky, 'Come, gather together for the great supper of God,",
      "links": "<a href='/AIV/26/39/17'>Ezek. 39:17</a>; <a href='/AIV/40/24/28'>Matt. 24:28</a>",
      "comment": "The gathering of birds for judgment references Ezekiel’s prophecy (39:17), a metaphor for the total defeat of evil. It is both a literal warning and a spiritual call to prepare for final judgment."
    },
    {
      "pk": 73019018,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 18,
      "text": "so that you may eat the flesh of kings, generals, mighty men, horses and riders, and all people, free and slave, small and great.'",
      "links": "<a href='/AIV/26/39/18-20'>Ezek. 39:18-20</a>; <a href='/AIV/66/6/15'>Rev. 6:15</a>",
      "comment": "This scene of judgment on all peoples, irrespective of status, refers back to Ezekiel. It teaches the impartiality of divine judgment and the consequence of opposition to God."
    },
    {
      "pk": 73019019,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 19,
      "text": "Then I saw the beast and the kings of the earth and their armies gathered together to wage war against Him who sat on the horse and His army.",
      "links": "<a href='/AIV/66/16/14'>Rev. 16:14</a>; <a href='/AIV/19/2/2'>Ps. 2:2</a>",
      "comment": "The forces of evil seek to confront Christ (Psalm 2:2). This acts as a warning against pride and rebellion, but also underlines Christ’s inevitable victory."
    },
    {
      "pk": 73019020,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 20,
      "text": "But the beast was captured, and with him the false prophet who performed signs in his presence, by which he deceived those who had received the mark of the beast and worshiped his image. They were both thrown alive into the lake of fire that burns with sulfur.",
      "links": "<a href='/AIV/66/13/13-14'>Rev. 13:13-14</a>; <a href='/AIV/66/20/10'>Rev. 20:10</a>",
      "comment": "Evil is defeated and condemned. The eternal consequence ('lake of fire') is a literal and spiritual image of absolute separation from God. The defeat points to the final triumph of Christ and the purification of the world."
    },
    {
      "pk": 73019021,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 19,
      "verse": 21,
      "text": "The rest were killed with the sword coming from the mouth of Him who sat on the horse, and all the birds gorged themselves on their flesh.",
      "links": "<a href='/AIV/26/39/17-20'>Ezek. 39:17-20</a>; <a href='/AIV/66/1/16'>Rev. 1:16</a>",
      "comment": "The Word of Christ (the sword from His mouth) executes final judgment (Ezekiel 39). Jesus’ word has the power to judge and to save, highlighting both His mercy and His justice."
    }
  ],
  "translatedAt": "2025-12-24T12:40:51.416Z"
}