{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 5,
  "verses": [
    {
      "pk": 73005001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 1,
      "text": "Then I saw in the right hand of Him who sat on the throne a scroll written inside and on the back, sealed with seven seals.",
      "links": "<a href='/AIV/26/2/9-10'>Ezek. 2:9-10</a>; <a href='/AIV/27/12/4'>Dan. 12:4</a>",
      "comment": "The scroll symbolizes God's ultimate plan for salvation and judgment. The seven seals indicate fullness and divine completion (see Dan. 12:4 for parallels about sealed prophecy). The double writing (inside and outside) hints at the depth and totality of God's decree."
    },
    {
      "pk": 73005002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 2,
      "text": "And I saw a powerful angel proclaiming with a loud voice, 'Who is worthy to open the scroll and break its seals?'",
      "links": "<a href='/AIV/23/29/11'>Isa. 29:11-12</a>",
      "comment": "No ordinary creature can reveal God's mysteries. The worthiness is not in power, but in sanctity and unique authority. The question emphasizes God's holiness and the need for a mediator (see Isa. 29:11-12 for similar imagery)."
    },
    {
      "pk": 73005003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 3,
      "text": "But no one in heaven or on earth or under the earth was able to open the scroll or look inside it.",
      "links": "<a href='/AIV/19/14/2-3'>Ps. 14:2-3</a>; <a href='/AIV/45/3/10-12'>Rom. 3:10-12</a>",
      "comment": "This stresses the universality of unworthiness apart from the chosen one. Humanity and creation cannot accomplish true redemption alone (see Psalms and Romans for sinfulness universality)."
    },
    {
      "pk": 73005004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 4,
      "text": "And I began to weep greatly because no one was found worthy to open the scroll or to look into it.",
      "links": "<a href='/AIV/20/1/4'>Prov. 1:4</a>; <a href='/AIV/42/19/41'>Luke 19:41</a>",
      "comment": "John's sorrow echoes the deep longing for redemption. It's an emotional recognition of the universal need for a savior."
    },
    {
      "pk": 73005005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 5,
      "text": "Then one of the elders said to me, 'Do not weep. See, the Lion of the tribe of Judah, the Root of David, has conquered so that He can open the scroll and its seven seals.'",
      "links": "<a href='/AIV/01/49/9-10'>Gen. 49:9-10</a>; <a href='/AIV/23/11/1'>Isa. 11:1</a>; <a href='/AIV/40/22/42-45'>Matt. 22:42-45</a>",
      "comment": "This verse directly connects Jesus to Old Testament prophecy as Messiah (Gen. 49, Isa. 11). The titles emphasize Christ's royal authority and victory. The elder here encourages understanding of Jesus' unique mediatory role, both human (son of David) and divine (root of David)."
    },
    {
      "pk": 73005006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 6,
      "text": "Then I saw, between the throne and the four living creatures and among the elders, a Lamb standing as though slain, having seven horns and seven eyes, which are the seven spirits of God sent out into all the earth.",
      "links": "<a href='/AIV/23/53/7'>Isa. 53:7</a>; <a href='/AIV/43/1/29'>John 1:29</a>; <a href='/AIV/38/4/10'>Zech. 4:10</a>; <a href='/AIV/66/1/4'>Rev. 1:4</a>",
      "comment": "The Lamb imagery fulfills Isaiah's prophecy of the suffering servant. Seven horns symbolize complete power; seven eyes represent perfect wisdom and spiritual presence (Isa. 11:2, Zech. 4:10). Christ's sacrificial death and a continuing real presence stand at the center of the worship. This points to both His once-for-all sacrifice and ongoing mediatory work."
    },
    {
      "pk": 73005007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 7,
      "text": "He went and took the scroll from the right hand of Him who sat on the throne.",
      "links": "<a href='/AIV/19/110/1'>Ps. 110:1</a>; <a href='/AIV/43/5/22-27'>John 5:22-27</a>",
      "comment": "Here, Christ alone is given authority by the Father, showing the unique relationship between them (see Ps. 110:1, John 5:22-27)."
    },
    {
      "pk": 73005008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 8,
      "text": "And when He had taken the scroll, the four living creatures and the twenty-four elders fell down before the Lamb. Each held a harp and golden bowls full of incense, which are the prayers of the saints.",
      "links": "<a href='/AIV/19/141/2'>Ps. 141:2</a>; <a href='/AIV/66/8/3-4'>Rev. 8:3-4</a>",
      "comment": "Worship and prayer are intimately connected with the Lamb's presence. The imagery of incense as prayers (Ps. 141:2, Rev. 8:3-4) highlights the power of intercessory prayer and collective worship. The elders reflect a heavenly council, representing a continuity of worship through the ages and a visible communion between heaven and the prayers of believers."
    },
    {
      "pk": 73005009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 9,
      "text": "And they sang a new song, saying, 'You are worthy to take the scroll and to open its seals, because You were slain, and by Your blood You redeemed people for God from every tribe and language and people and nation.'",
      "links": "<a href='/AIV/19/96/1'>Ps. 96:1</a>; <a href='/AIV/02/12/13'>Exod. 12:13</a>; <a href='/AIV/45/3/23-24'>Rom. 3:23-24</a>",
      "comment": "The 'new song' is biblical language for a new work of God. Redemption is universal and not limited to any ethnicity (Exod. 12:13 typology in the Passover). The verse points to the efficacy of Christ's blood for salvation and its universal invitation."
    },
    {
      "pk": 73005010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 10,
      "text": "'And You have made them into a kingdom and priests to our God, and they shall reign on the earth.'",
      "links": "<a href='/AIV/02/19/6'>Exod. 19:6</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>; <a href='/AIV/66/20/6'>Rev. 20:6</a>",
      "comment": "Believers share a priestly and royal calling, echoing Israel's vocation (Exod. 19:6, 1 Pet. 2:9). The priestly ministry includes offering spiritual sacrifices and intercessions. The visible spiritual ruling on earth points to both present and future realities."
    },
    {
      "pk": 73005011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 11,
      "text": "Then I looked, and I heard the voice of many angels around the throne and the living creatures and the elders, numbering myriads of myriads and thousands of thousands.",
      "links": "<a href='/AIV/27/7/10'>Dan. 7:10</a>; <a href='/AIV/19/68/17'>Ps. 68:17</a>",
      "comment": "The sheer number of angels echoes Daniel's vision and psalms about God's heavenly hosts, reinforcing the awe surrounding divine worship."
    },
    {
      "pk": 73005012,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 12,
      "text": "They were saying with a loud voice: 'Worthy is the Lamb who was slain to receive power and wealth and wisdom and strength and honor and glory and blessing!'",
      "links": "<a href='/AIV/19/29/2'>Ps. 29:2</a>; <a href='/AIV/50/2/9-11'>Phil. 2:9-11</a>",
      "comment": "This sevenfold acclamation mirrors perfect praise. The Lamb’s sacrifice is exalted above all, and His mediatorial work is affirmed with heavenly worship. Note how praise of Jesus is identical to that given to God, indicating His divinity (see Phil. 2:9-11 on every tongue confessing Christ's lordship)."
    },
    {
      "pk": 73005013,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 13,
      "text": "And I heard every creature in heaven and on earth and under the earth and in the sea, and all that is in them, saying: 'To Him who sits on the throne and to the Lamb be blessing and honor and glory and power forever and ever!'",
      "links": "<a href='/AIV/19/148/7-13'>Ps. 148:7-13</a>; <a href='/AIV/45/8/19-21'>Rom. 8:19-21</a>",
      "comment": "All creation is called to praise the Father and the Son equally. This is a strong statement of the Son’s equality with God. Old Testament worship passages are fulfilled and made explicit in Christ."
    },
    {
      "pk": 73005014,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 5,
      "verse": 14,
      "text": "And the four living creatures said, 'Amen!' and the elders fell down and worshiped.",
      "links": "<a href='/AIV/19/106/48'>Ps. 106:48</a>; <a href='/AIV/66/7/11'>Rev. 7:11</a>",
      "comment": "The final act is universal assent and worship. 'Amen' marks the reliability of heaven’s praise. Physical gestures of worship indicate true, embodied reverence. The passage subtly affirms the centrality of liturgical worship and shared prayer in the Christian faith."
    }
  ],
  "translatedAt": "2025-12-24T12:35:11.685Z"
}