{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 14,
  "verses": [
    {
      "pk": 73014001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 1,
      "text": "Then I looked, and there was the Lamb standing on Mount Zion, and with Him were 144,000 who had His Name and His Father's Name written on their foreheads.",
      "links": "<a href='/AIV/66/7/3'>Rev. 7:3</a>; <a href='/AIV/23/2/2-3'>Isa. 2:2-3</a>; <a href='/AIV/19/2/6'>Ps. 2:6</a>",
      "comment": "The Lamb symbolizes Christ (cf. John 1:29) and Mount Zion often represents God's ultimate dwelling and reign. The sealing of the 144,000 echoes Rev 7:3, signifying those set apart for God, and the seal denotes belonging and protection."
    },
    {
      "pk": 73014002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 2,
      "text": "And I heard a voice from heaven like the sound of many waters and like the sound of loud thunder. The voice I heard was like harpists playing their harps.",
      "links": "<a href='/AIV/26/43/2'>Ezek. 43:2</a>; <a href='/AIV/66/1/15'>Rev. 1:15</a>",
      "comment": "The majestic imagery mirrors God's overpowering presence and glory (cf. Ezek. 43:2, Rev. 1:15). Harps are associated with worship and heavenly music, a sign of perfect praise."
    },
    {
      "pk": 73014003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 3,
      "text": "And they sang a new song before the throne and before the four living creatures and the elders. No one could learn that song except for the 144,000, who had been redeemed from the earth.",
      "links": "<a href='/AIV/19/33/3'>Ps. 33:3</a>; <a href='/AIV/66/5/8-9'>Rev. 5:8-9</a>; <a href='/AIV/66/7/4'>Rev. 7:4</a>",
      "comment": "A 'new song' in the Psalms often marks God's saving acts. Here, the 144,000 represent those specially redeemed, symbolizing the faithful remnant. Only they can sing this song, highlighting a unique relationship with God, pointing toward the idea of a chosen, consecrated people."
    },
    {
      "pk": 73014004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 4,
      "text": "These are the ones who have not defiled themselves with women, for they are virgins. These are the ones who follow the Lamb wherever He goes. They were redeemed from among humanity as firstfruits for God and for the Lamb.",
      "links": "<a href='/AIV/24/2/3'>Jer. 2:3</a>; <a href='/AIV/46/7/34'>1 Cor. 7:34</a>",
      "comment": "Virginity and purity are emphasized (cf. 1 Cor. 7:34) as a sign of undivided devotion to Christ. 'Firstfruits' symbolizes an offering wholly dedicated to God, marking these as especially set apart for Him. The theme of consecrated following is prominent, foreshadowing a call to spiritual fidelity."
    },
    {
      "pk": 73014005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 5,
      "text": "And in their mouth no lie was found, for they are blameless.",
      "links": "<a href='/AIV/36/3/13'>Zeph. 3:13</a>; <a href='/AIV/60/2/22'>1 Pet. 2:22</a>",
      "comment": "Their integrity points to Christlike holiness ('blameless,' cf. 1 Pet. 2:22), highlighting not only purity but truthfulness, a core trait of the people of God. This passage has been understood spiritually as encouragement to pursue complete integrity."
    },
    {
      "pk": 73014006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 6,
      "text": "Then I saw another angel flying in mid-heaven, having the eternal gospel to proclaim to those who dwell on the earth—to every nation, tribe, language, and people.",
      "links": "<a href='/AIV/40/24/14'>Matt. 24:14</a>; <a href='/AIV/45/1/16'>Rom. 1:16</a>",
      "comment": "The 'eternal gospel' affirms a universal message: salvation is for all peoples (Matt. 24:14). This passage highlights the importance of tradition and the universality of gospel proclamation by the authority of messengers sent by God."
    },
    {
      "pk": 73014007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 7,
      "text": "He said with a loud voice, 'Fear God and give Him glory, for the hour of His judgment has come. Worship Him who made heaven and earth, the sea and the springs of water.'",
      "links": "<a href='/AIV/19/146/6'>Ps. 146:6</a>; <a href='/AIV/2/20/11'>Ex. 20:11</a>",
      "comment": "The angel calls for worship of the Creator—echoing the language of the Ten Commandments (Ex. 20:11). The appeal to 'fear God' refers to awe-filled reverence, the foundation for true worship. This reflects the call to liturgical and communal worship."
    },
    {
      "pk": 73014008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 8,
      "text": "And another, a second angel, followed, saying, 'Fallen, fallen is Babylon the great, she who made all nations drink the wine of her passionate immorality.'",
      "links": "<a href='/AIV/23/21/9'>Isa. 21:9</a>; <a href='/AIV/24/51/7'>Jer. 51:7-8</a>; <a href='/AIV/66/18/2'>Rev. 18:2</a>",
      "comment": "'Babylon' here symbolizes worldly corruption and opposition to God (cf. Jer. 51:7-8), often interpreted as secular powers that lead believers astray. This is a warning against being seduced by earthly allurements contrary to God's will."
    },
    {
      "pk": 73014009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 9,
      "text": "Then another angel, a third, followed them, saying with a loud voice, 'If anyone worships the beast and its image and receives a mark on his forehead or on his hand,'",
      "links": "<a href='/AIV/66/13/16-17'>Rev. 13:16-17</a>",
      "comment": "This reiterates the danger from Rev. 13: the mark of the beast as a sign of allegiance to evil. The warning is against idolatry and compromising one's faith, especially in actions (hand) or beliefs (forehead)."
    },
    {
      "pk": 73014010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 10,
      "text": "he will also drink the wine of God's wrath, poured full strength into the cup of His anger, and he will be tormented with fire and sulfur in the presence of the holy angels and in the presence of the Lamb.",
      "links": "<a href='/AIV/19/75/8'>Ps. 75:8</a>; <a href='/AIV/1/19/24-25'>Gen. 19:24-25</a>",
      "comment": "'Cup of wrath' is Old Testament imagery for divine judgment (cf. Ps. 75:8), here culminating in eternal separation and conscious torment, interpreted more strictly by some as a warning about the consequences of unrepentant sin against God."
    },
    {
      "pk": 73014011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 11,
      "text": "And the smoke of their torment goes up forever and ever, and they have no rest, day or night, these worshipers of the beast and its image, and whoever receives the mark of its name.",
      "links": "<a href='/AIV/23/34/10'>Isa. 34:10</a>; <a href='/AIV/41/9/48'>Mark 9:48</a>",
      "comment": "The imagery is one of eternal consequence—'forever and ever'—emphasizing the seriousness of choosing allegiance against God. Highlights an eternal reality, pointing toward deeper truths about final judgment and justice."
    },
    {
      "pk": 73014012,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 12,
      "text": "Here is a call for the endurance of the saints, those who keep the commandments of God and hold to the faith of Jesus.",
      "links": "<a href='/AIV/66/13/10'>Rev. 13:10</a>; <a href='/AIV/62/2/3-4'>1 John 2:3-4</a>",
      "comment": "Endurance is key for saints—persevering in both obedience (commandments) and faith in Jesus. The inclusion of 'keeping the commandments' highlights the importance of both faith and works, a harmony noted throughout Scripture."
    },
    {
      "pk": 73014013,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 13,
      "text": "And I heard a voice from heaven saying, 'Write this: Blessed are the dead who die in the Lord from now on.' 'Yes,' says the Spirit, 'that they may rest from their labors, for their deeds follow them!'",
      "links": "<a href='/AIV/19/116/15'>Ps. 116:15</a>; <a href='/AIV/58/6/10'>Heb. 6:10</a>",
      "comment": "The promise of blessedness for those who die in the Lord includes rest and a lasting legacy—'their deeds follow them.' This points toward the enduring value of faithful works, revered within the wider tradition of remembrance and veneration."
    },
    {
      "pk": 73014014,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 14,
      "text": "Then I looked, and behold, a white cloud, and seated on the cloud was one like a son of man, with a golden crown on his head and a sharp sickle in his hand.",
      "links": "<a href='/AIV/27/7/13'>Dan. 7:13</a>; <a href='/AIV/40/24/30'>Matt. 24:30</a>",
      "comment": "The 'Son of Man' recalls Dan. 7:13 and is a Messianic title Jesus often used (cf. Matt. 24:30), showing his authority and divinity. The golden crown and sickle point to a kingly figure coming to judge and to harvest."
    },
    {
      "pk": 73014015,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 15,
      "text": "And another angel came out of the temple, calling with a loud voice to him who sat on the cloud, 'Put in your sickle and reap, for the hour to reap has come, for the harvest of the earth is fully ripe.'",
      "links": "<a href='/AIV/29/3/13'>Joel 3:13</a>; <a href='/AIV/40/13/39'>Matt. 13:39</a>",
      "comment": "The angel's command identifies divine authority working through heavenly messengers to execute God's will. 'Harvest' themes appear throughout, symbolizing final judgment and gathering (Matt. 13:39), a motif tied to Christ's return."
    },
    {
      "pk": 73014016,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 16,
      "text": "So he who sat on the cloud swung his sickle over the earth, and the earth was harvested.",
      "links": "<a href='/AIV/24/51/33'>Jer. 51:33</a>",
      "comment": "The Son of Man, acting as both judge and redeemer, personally brings about the harvest. There is a strong emphasis on Christ's direct involvement in judgment and salvation."
    },
    {
      "pk": 73014017,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 17,
      "text": "Then another angel came out of the temple in heaven, and he also had a sharp sickle.",
      "links": "<a href='/AIV/66/15/6'>Rev. 15:6</a>",
      "comment": "The participation of angels in judgment underscores a heavenly order and delegated authority in God's plan, emphasizing the ongoing relationship between the divine and the ministerial."
    },
    {
      "pk": 73014018,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 18,
      "text": "And another angel came out from the altar—the one who has authority over the fire—and he called with a loud voice to the one who had the sharp sickle, 'Put in your sickle and gather the clusters from the vine of the earth, for its grapes are fully ripe.'",
      "links": "<a href='/AIV/19/80/8'>Ps. 80:8</a>; <a href='/AIV/24/6/9'>Jer. 6:9</a>",
      "comment": "The altar, connected with sacrifice, signals that judgment is an act of divine justice. The vine imagery also connects spiritually to the people of God (cf. Ps. 80:8), suggesting both blessing and reckoning."
    },
    {
      "pk": 73014019,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 19,
      "text": "So the angel swung his sickle across the earth and gathered the grape harvest of the earth and threw it into the great winepress of the wrath of God.",
      "links": "<a href='/AIV/23/63/3'>Isa. 63:3</a>; <a href='/AIV/25/1/15'>Lam. 1:15</a>",
      "comment": "The winepress imagery shows God's active judgment against evil (Isa. 63:3). The final separation of good and evil is a recurring biblical theme."
    },
    {
      "pk": 73014020,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 14,
      "verse": 20,
      "text": "And the winepress was trodden outside the city, and blood flowed from the winepress, as high as a horse's bridle, for about 1,600 stadia.",
      "links": "<a href='/AIV/23/63/6'>Isa. 63:6</a>; <a href='/AIV/66/11/2'>Rev. 11:2</a>",
      "comment": "The overflowing blood signifies the totality and seriousness of judgment, a vivid warning. The reference to 'outside the city' echoes the place of Christ’s passion (Heb. 13:12), suggesting both justice and mercy."
    }
  ],
  "translatedAt": "2025-12-24T12:38:41.128Z"
}