{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 2,
  "verses": [
    {
      "pk": 9402001,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 1,
      "text": "To the angel of the church in Ephesus write: ‘These are the words of the One who holds the seven stars in his right hand, who walks among the seven golden lampstands:",
      "links": "<a href='/AIV/66/1/12-13'>Rev. 1:12-13</a>",
      "comment": "The 'angel' refers to the spiritual overseer or bishop of the community. The 'seven stars' and 'golden lampstands' represent Christ's authority over the churches (see Rev. 1:20), showing His living presence within His Church."
    },
    {
      "pk": 9402002,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 2,
      "text": "I know your works, your toil and your steadfastness, and how you cannot tolerate those who are evil. You have tested those who claim to be apostles but are not, and you found them to be false.",
      "links": "<a href='/AIV/1/4/6'>1 John 4:6</a>; <a href='/AIV/2/11/13'>2 Cor. 11:13</a>",
      "comment": "Highlighting the need for doctrinal purity and discernment of true teaching authority—an enduring principle for the Church."
    },
    {
      "pk": 9402003,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 3,
      "text": "You have perseverance and have endured for my name’s sake, and have not grown weary.",
      "links": "<a href='/AIV/40/24/13'>Matt. 24:13</a>",
      "comment": "Shows the value of patient endurance in the faith, linking this to Christ’s call to persevere under trials."
    },
    {
      "pk": 9402004,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 4,
      "text": "But I have this against you: you have abandoned the love you had at first.",
      "links": "<a href='/AIV/40/22/37'>Matt. 22:37</a>",
      "comment": "Losing one’s fervent charity can erode authentic faith—even orthodoxy without love is in danger."
    },
    {
      "pk": 9402005,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 5,
      "text": "Remember, therefore, from where you have fallen; repent and do the works you did at first. Otherwise, I will come to you and remove your lampstand from its place, unless you repent.",
      "links": "<a href='/AIV/58/6/6'>Heb. 6:6</a>; <a href='/AIV/40/5/14-16'>Matt. 5:14-16</a>",
      "comment": "Repentance restores one's standing with Christ. The lampstand, symbolizing the church’s witness and presence, can be removed—implying the real danger of losing the visible gift of Christ’s light if faith and love are not renewed."
    },
    {
      "pk": 9402006,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 6,
      "text": "But this you have: you hate the works of the Nicolaitans, which I also hate.",
      "links": "",
      "comment": "The Nicolaitans likely promoted moral compromise. Christ affirms hatred for heretical or immoral practices, underscoring the necessity of both truth and love within His Church."
    },
    {
      "pk": 9402007,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 7,
      "text": "He who has an ear, let him hear what the Spirit says to the churches. To the one who overcomes, I will grant to eat from the tree of life, which is in the paradise of God.",
      "links": "<a href='/AIV/1/2/9'>Gen. 2:9</a>; <a href='/AIV/66/22/2'>Rev. 22:2</a>",
      "comment": "The tree of life is a clear reference to Eden (Gen. 2:9), restored in Christ’s new creation (Rev. 22:2). Eating from it alludes to eternal communion with God—an image connected to the sanctifying gifts that Jesus gives to the faithful."
    },
    {
      "pk": 9402008,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 8,
      "text": "To the angel of the church in Smyrna write: ‘These are the words of the First and the Last, who died and came to life again:",
      "links": "<a href='/AIV/66/1/17-18'>Rev. 1:17-18</a>",
      "comment": "‘The First and the Last’ echoes Isaiah 44:6, where God identifies Himself with this title. Jesus’ self-identification shows His divinity and victory over death."
    },
    {
      "pk": 9402009,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 9,
      "text": "I know your tribulation and your poverty (yet you are rich), and the slander of those who say they are Jews and are not, but are a synagogue of Satan.",
      "links": "<a href='/AIV/66/3/9'>Rev. 3:9</a>",
      "comment": "Spiritual wealth surpasses worldly poverty. ‘Synagogue of Satan’ refers to opposition from those within and outside the community who reject true worship."
    },
    {
      "pk": 9402010,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 10,
      "text": "Do not be afraid of what you are about to suffer. Behold, the devil is about to throw some of you into prison, so that you may be tested; and for ten days you will have tribulation. Be faithful unto death, and I will give you the crown of life.",
      "links": "<a href='/AIV/59/1/12'>James 1:12</a>; <a href='/AIV/40/10/22'>Matt. 10:22</a>",
      "comment": "Faithfulness through suffering is a path to eternal reward. The crown of life echoes James 1:12, and being faithful unto death links to the idea of martyrdom and perseverance."
    },
    {
      "pk": 9402011,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 11,
      "text": "He who has an ear, let him hear what the Spirit says to the churches. The one who overcomes will not be hurt by the second death.",
      "links": "<a href='/AIV/66/20/6'>Rev. 20:6</a>",
      "comment": "‘Second death’ (eternal separation from God) will not touch those who remain faithful."
    },
    {
      "pk": 9402012,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 12,
      "text": "To the angel of the church in Pergamum write: ‘These are the words of the One who has the sharp two-edged sword:",
      "links": "<a href='/AIV/66/1/16'>Rev. 1:16</a>; <a href='/AIV/58/4/12'>Heb. 4:12</a>",
      "comment": "The two-edged sword represents Christ’s authoritative and piercing word—used in both judgment and salvation."
    },
    {
      "pk": 9402013,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 13,
      "text": "I know where you live, where Satan’s throne is. Yet you hold fast to my name, and you did not deny your faith in me even in the days of Antipas, my faithful witness, who was killed among you, where Satan lives.",
      "links": "",
      "comment": "'Satan’s throne' likely refers to the pagan influence in Pergamum. The call is to remain faithful even when surrounded by opposition and martyrdom may result."
    },
    {
      "pk": 9402014,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 14,
      "text": "But I have a few things against you: you have some there who hold the teaching of Balaam, who taught Balak to put a stumbling block before the sons of Israel, to eat food sacrificed to idols and to commit sexual immorality.",
      "links": "<a href='/AIV/4/31/16'>Num. 31:16</a>",
      "comment": "Echoing Numbers 31:16, tolerating false teaching and immorality threatens the purity of the church, warning that even within the church there can be misleading doctrines and practices."
    },
    {
      "pk": 9402015,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 15,
      "text": "So also you have some who hold to the teaching of the Nicolaitans.",
      "links": "<a href='/AIV/66/2/6'>Rev. 2:6</a>",
      "comment": "This suggests that false teachings arise when Church discipline and sound doctrine are not maintained."
    },
    {
      "pk": 9402016,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 16,
      "text": "Therefore repent. If not, I will come to you soon and will war against them with the sword of my mouth.",
      "links": "<a href='/AIV/66/19/15'>Rev. 19:15</a>",
      "comment": "Christ keeps His church accountable, purifying it with His word. Repentance remains a means of restoration and unity with Him."
    },
    {
      "pk": 9402017,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 17,
      "text": "He who has an ear, let him hear what the Spirit says to the churches. To the one who overcomes, I will give some of the hidden manna, and I will give him a white stone, with a new name written on the stone that no one knows except the one who receives it.",
      "links": "<a href='/AIV/2/16/15'>Ex. 16:15</a>; <a href='/AIV/43/6/48-51'>John 6:48-51</a>",
      "comment": "The hidden manna echoes both Exodus and Christ’s own words in John 6 about the true bread from heaven, hinting at the supernatural nourishment provided by Christ to victors. The white stone with a new name symbolizes personal transformation and acceptance before God."
    },
    {
      "pk": 9402018,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 18,
      "text": "To the angel of the church in Thyatira write: ‘These are the words of the Son of God, who has eyes like a flame of fire, and whose feet are like burnished bronze:",
      "links": "<a href='/AIV/66/1/14-15'>Rev. 1:14-15</a>",
      "comment": "‘Son of God’ asserts Christ’s unique divine Sonship. Eyes like fire and feet like bronze denote both His purity and His authority to judge."
    },
    {
      "pk": 9402019,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 19,
      "text": "I know your works, your love and faith and service and perseverance, and that your latter works exceed the first.",
      "links": "",
      "comment": "Commends continuous growth in charity and piety as the true marks of a living and fruitful faith."
    },
    {
      "pk": 9402020,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 20,
      "text": "But I have this against you, that you tolerate that woman Jezebel, who calls herself a prophetess and teaches and seduces my servants to practice sexual immorality and to eat food sacrificed to idols.",
      "links": "<a href='/AIV/3/16/31'>1 Kings 16:31</a>",
      "comment": "Tolerating false prophecy and unholy practices, the church is once more called to safeguard the purity of its teaching and morals."
    },
    {
      "pk": 9402021,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 21,
      "text": "I gave her time to repent, but she refuses to repent of her sexual immorality.",
      "links": "",
      "comment": "God’s mercy precedes His judgment—He always offers repentance to sinners before consequences follow."
    },
    {
      "pk": 9402022,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 22,
      "text": "Behold, I will throw her onto a sickbed, and those who commit adultery with her I will throw into great tribulation, unless they repent of her deeds.",
      "links": "",
      "comment": "Divine judgment is both individual and communal, but always offers repentance up to the last moment."
    },
    {
      "pk": 9402023,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 23,
      "text": "And I will strike her children dead. Then all the churches will know that I am he who searches hearts and minds, and I will give to each of you according to your works.",
      "links": "<a href='/AIV/24/17/10'>Jer. 17:10</a>; <a href='/AIV/40/16/27'>Matt. 16:27</a>",
      "comment": "Christ’s judgment is rooted in His divine knowledge of hearts and His justice. The idea of reward 'according to your works' affirms the cooperation between faith and action in salvation."
    },
    {
      "pk": 9402024,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 24,
      "text": "But to the rest of you in Thyatira, who do not hold this teaching, who have not learned what some call 'the deep things of Satan,' to you I say, I do not lay on you any other burden.",
      "links": "<a href='/AIV/15/9/13'>Ezra 9:13</a>",
      "comment": "Remaining faithful to true teaching shapes the unity and holiness of the entire community."
    },
    {
      "pk": 9402025,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 25,
      "text": "Only hold fast to what you have until I come.",
      "links": "<a href='/AIV/66/3/11'>Rev. 3:11</a>",
      "comment": "Perseverance in the apostolic faith until the end is repeatedly emphasized—the call is to preserve the full deposit of faith handed down."
    },
    {
      "pk": 9402026,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 26,
      "text": "To the one who overcomes and keeps my works to the end, to him I will give authority over the nations,",
      "links": "<a href='/AIV/19/2/8-9'>Ps. 2:8-9</a>; <a href='/AIV/66/3/21'>Rev. 3:21</a>",
      "comment": "References Psalm 2:8-9 about the Messiah ruling the nations; Christ shares this authority with His faithful, showing the ecclesial dimension of Christ's reign with His people."
    },
    {
      "pk": 9402027,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 27,
      "text": "and he will rule them with a rod of iron, as when earthen pots are shattered, even as I myself have received authority from my Father.",
      "links": "<a href='/AIV/19/2/9'>Ps. 2:9</a>; <a href='/AIV/43/5/22-27'>John 5:22-27</a>",
      "comment": "Further quoting Psalm 2, this affirms the continuity between the Old Testament messianic promise and its fulfillment in Jesus, who receives all authority and shares it with the Church."
    },
    {
      "pk": 9402028,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 28,
      "text": "And I will give him the morning star.",
      "links": "<a href='/AIV/66/22/16'>Rev. 22:16</a>; <a href='/AIV/4/24/17'>Num. 24:17</a>",
      "comment": "The 'morning star' ultimately points to Christ Himself (see Rev. 22:16), showing that union with Him is the highest reward."
    },
    {
      "pk": 9402029,
      "translation": "AIV",
      "book": 66,
      "chapter": 2,
      "verse": 29,
      "text": "He who has an ear, let him hear what the Spirit says to the churches.",
      "links": "",
      "comment": "The seven exhortations highlight the Spirit's ongoing guidance for the Church as the mystical Body of Christ. Both faith and works are expected as signs of authentic discipleship."
    }
  ],
  "translatedAt": "2025-12-23T04:21:32.623Z"
}