{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 18,
  "verses": [
    {
      "pk": 19931801,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 1,
      "text": "After this I saw another angel coming down from heaven, having great authority, and the earth was illuminated by his glory.",
      "links": "<a href='/AIV/26/43/2'>Ezek. 43:2</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "The angel's authority and glory recall Old Testament theophanies, especially in Ezekiel. The brilliance signifies divine judgment and presence."
    },
    {
      "pk": 19931802,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 2,
      "text": "He cried out with a mighty voice, 'Fallen, fallen is Babylon the great! She has become a dwelling place for demons, a haunt for every unclean spirit, a haunt for every unclean bird, a haunt for every unclean and detestable beast.'",
      "links": "<a href='/AIV/23/21/9'>Isa. 21:9</a>; <a href='/AIV/24/51/37'>Jer. 51:37</a>; <a href='/AIV/66/14/8'>Rev. 14:8</a>",
      "comment": "The judgment of Babylon echoes prophetic oracles against proud empires. Babylon represents the ultimate enemy of God and His people."
    },
    {
      "pk": 19931803,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 3,
      "text": "For all the nations have drunk the wine of the passion of her sexual immorality, the kings of the earth have committed immorality with her, and the merchants of the earth have grown rich from her power and luxurious living.",
      "links": "<a href='/AIV/66/14/8'>Rev. 14:8</a>; <a href='/AIV/24/51/7'>Jer. 51:7</a>",
      "comment": "Sexual immorality is often used as a symbol for spiritual unfaithfulness. The nations’ participation points to both political and economic complicity in wickedness."
    },
    {
      "pk": 19931804,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 4,
      "text": "Then I heard another voice from heaven saying, 'Come out of her, my people, so that you do not take part in her sins, and so that you do not receive any of her plagues.'",
      "links": "<a href='/AIV/23/48/20'>Isa. 48:20</a>; <a href='/AIV/24/51/6'>Jer. 51:6</a>; <a href='/AIV/47/6/17'>2 Cor. 6:17</a>",
      "comment": "God’s call to His people echoes earlier commands to separate from sin. The call to ‘come out’ is both literal and spiritual—believers are set apart as a holy people."
    },
    {
      "pk": 19931805,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 5,
      "text": "For her sins are piled up to heaven, and God has remembered her crimes.",
      "links": "<a href='/AIV/24/51/9'>Jer. 51:9</a>; <a href='/AIV/19/109/14'>Ps. 109:14</a>",
      "comment": "The imagery of sins reaching heaven recalls the Tower of Babel and God’s justice. God’s memory here denotes His perfect and precise judgment."
    },
    {
      "pk": 19931806,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 6,
      "text": "Pay her back just as she has paid, and give her double according to her deeds. Mix a double portion for her in the cup she mixed.",
      "links": "<a href='/AIV/19/137/8'>Ps. 137:8</a>; <a href='/AIV/24/50/15'>Jer. 50:15</a>",
      "comment": "This reflects the biblical principle of retribution and justice. The 'cup' symbolizes God's wrath (see Isaiah 51:17; Revelation 14:10)."
    },
    {
      "pk": 19931807,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 7,
      "text": "As she glorified herself and lived in luxury, give her in the same measure torment and sorrow. Because in her heart she says, ‘I sit as a queen, I am not a widow, and I will never see sorrow.’",
      "links": "<a href='/AIV/23/47/7-8'>Isa. 47:7–8</a>",
      "comment": "Babylon’s arrogance is her downfall, just as pride precedes destruction throughout Scripture (see Proverbs 16:18). The 'queen' imagery presents the city as defiant against God."
    },
    {
      "pk": 19931808,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 8,
      "text": "Therefore her plagues will come in a single day—death and sorrow and famine. And she will be burned up with fire, for mighty is the Lord God who has judged her.",
      "links": "<a href='/AIV/23/47/9'>Isa. 47:9</a>; <a href='/AIV/66/17/16'>Rev. 17:16</a>",
      "comment": "Sudden judgment is a biblical theme (see 1 Thess. 5:3). God’s power to judge is unmatched."
    },
    {
      "pk": 19931809,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 9,
      "text": "And the kings of the earth, who had committed sexual immorality and lived in luxury with her, will weep and mourn over her when they see the smoke of her burning.",
      "links": "<a href='/AIV/26/26/16'>Ezek. 26:16</a>; <a href='/AIV/66/17/2'>Rev. 17:2</a>",
      "comment": "The lament of the kings is a fulfillment of God’s prophecy against proud nations, and their mourning is over loss of wealth and power."
    },
    {
      "pk": 19931810,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 10,
      "text": "Standing far off, in fear of her torment, they will say, 'Woe, woe, the great city, Babylon, the mighty city! For in a single hour your judgment has come.'",
      "links": "<a href='/AIV/26/27/32'>Ezek. 27:32</a>; <a href='/AIV/66/18/17'>Rev. 18:17</a>",
      "comment": "The repetition 'woe' is an ancient way of expressing disaster and lament. The mention of 'in a single hour' shows the swiftness of God’s justice."
    },
    {
      "pk": 19931811,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 11,
      "text": "And the merchants of the earth weep and mourn over her, because no one buys their goods anymore.",
      "links": "<a href='/AIV/26/27/36'>Ezek. 27:36</a>",
      "comment": "Babylon’s fall devastates earthly commerce, revealing the fleeting nature of worldly wealth (cf. Matthew 6:19–20)."
    },
    {
      "pk": 19931812,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 12,
      "text": "Goods of gold, silver, precious stones, pearls, fine linen, purple, silk, and scarlet; all kinds of scented wood, every kind of article of ivory, every kind of costly wood, bronze, iron, and marble;",
      "links": "<a href='/AIV/26/27/12'>Ezek. 27:12, 22</a>",
      "comment": "The list echoes the luxury trade in Tyre (Ezekiel 27), showing Babylon as the embodiment of materialistic seduction."
    },
    {
      "pk": 19931813,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 13,
      "text": "Cinnamon, spice, incense, myrrh, frankincense, wine, oil, fine flour, wheat, cattle and sheep, horses and chariots, and bodies and souls of men.",
      "links": "<a href='/AIV/26/27/22'>Ezek. 27:22</a>; <a href='/AIV/01/37/25'>Gen. 37:25</a>",
      "comment": "The reference to ‘bodies and souls of men’ (i.e., slaves) highlights the exploitation and dehumanization that flows from unchecked materialism."
    },
    {
      "pk": 19931814,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 14,
      "text": "The fruit for which your soul longed has gone from you, and all your delicacies and splendid things have perished and will be found no more.",
      "links": "<a href='/AIV/25/1/10-11'>Lam. 1:10–11</a>",
      "comment": "A warning that earthly pleasures are passing away, echoing Jesus’ teaching to store up treasure in heaven."
    },
    {
      "pk": 19931815,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 15,
      "text": "The merchants of these things, who gained wealth from her, will stand far off, in fear of her torment, weeping and mourning,",
      "links": "<a href='/AIV/66/18/11'>Rev. 18:11</a>",
      "comment": "Earthly wealth cannot bring security in the face of divine judgment; this theme is consistent throughout the New Testament."
    },
    {
      "pk": 19931816,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 16,
      "text": "saying, 'Woe, woe, the great city, which was clothed in fine linen, purple and scarlet, adorned with gold, precious stones and pearls!'",
      "links": "<a href='/AIV/66/17/4'>Rev. 17:4</a>; <a href='/AIV/26/28/13'>Ezek. 28:13</a>",
      "comment": "Purple and scarlet were colors of royalty and luxury. The lament is for lost glory, reminiscent of fallen empires of the past."
    },
    {
      "pk": 19931817,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 17,
      "text": "For in a single hour all this wealth has been laid waste.' And every ship captain, all who sail, and all sailors, and all whose work is on the sea, stood far off",
      "links": "<a href='/AIV/66/18/10'>Rev. 18:10</a>; <a href='/AIV/26/27/29-30'>Ezek. 27:29–30</a>",
      "comment": "The swiftness with which Babylon is destroyed underscores the instability of earthly glory."
    },
    {
      "pk": 19931818,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 18,
      "text": "and cried out as they saw the smoke of her burning, saying, 'What city is like the great city?'",
      "links": "<a href='/AIV/26/27/32'>Ezek. 27:32</a>",
      "comment": "The unique status of Babylon heightens the magnitude of her judgment and loss."
    },
    {
      "pk": 19931819,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 19,
      "text": "And they threw dust on their heads and wept, mourning and crying out, 'Woe, woe, the great city, by which all who had ships at sea grew rich from her wealth! For in a single hour she has been laid waste.'",
      "links": "<a href='/AIV/26/27/30'>Ezek. 27:30</a>",
      "comment": "Throwing dust is a sign of deep grief in the ancient world. The lament is repeated for emphasis."
    },
    {
      "pk": 19931820,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 20,
      "text": "Rejoice over her, O heaven, and you saints, apostles, and prophets, for God has judged her for you.",
      "links": "<a href='/AIV/66/6/10'>Rev. 6:10</a>; <a href='/AIV/19/96/11-13'>Ps. 96:11–13</a>",
      "comment": "The heavenly response reveals God’s vindication of His faithful witnesses. The threefold address points to the unity and continuity of the people of God through history."
    },
    {
      "pk": 19931821,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 21,
      "text": "Then a mighty angel took up a stone like a great millstone and threw it into the sea, saying, 'With this violence the great city Babylon will be thrown down, and will be found no more.'",
      "links": "<a href='/AIV/24/51/63-64'>Jer. 51:63–64</a>; <a href='/AIV/40/18/6'>Matt. 18:6</a>",
      "comment": "The millstone imagery parallels Jeremiah’s prophecy against Babylon. Judgment is total and final."
    },
    {
      "pk": 19931822,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 22,
      "text": "And the sound of harpists and musicians, of flute players and trumpeters, will be heard in you no more. No craftsman of any trade will be found in you anymore, and the sound of a mill will be heard in you no more.",
      "links": "<a href='/AIV/24/25/10'>Jer. 25:10</a>",
      "comment": "Musical and economic activity ceases completely, showing utter desolation, much like the prophetic oracles of old."
    },
    {
      "pk": 19931823,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 23,
      "text": "And the light of a lamp will shine in you no more, and the voice of bridegroom and bride will be heard in you no more. For your merchants were the great ones of the earth, and all nations were deceived by your sorcery.",
      "links": "<a href='/AIV/24/7/34'>Jer. 7:34</a>; <a href='/AIV/23/47/9'>Isa. 47:9</a>; <a href='/AIV/66/9/21'>Rev. 9:21</a>",
      "comment": "The loss of light and joy is a symbol of complete judgment. “Sorcery” refers to deceptive world systems that draw people away from true worship and faith."
    },
    {
      "pk": 19931824,
      "translation": "AIV",
      "book": 66,
      "chapter": 18,
      "verse": 24,
      "text": "And in her was found the blood of prophets and saints, and of all who have been slain on the earth.",
      "links": "<a href='/AIV/24/51/49'>Jer. 51:49</a>; <a href='/AIV/66/6/10'>Rev. 6:10</a>",
      "comment": "The persecution of God’s people throughout history finds its climax here. This concludes the judgment against spiritual corruption and those who oppose God’s faithful witnesses."
    }
  ],
  "translatedAt": "2025-12-23T04:27:56.407Z"
}