{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 13,
  "verses": [
    {
      "pk": 73013001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 1,
      "text": "Then I saw a beast rising out of the sea, with ten horns and seven heads. On its horns were ten crowns, and on its heads were names that are blasphemous.",
      "links": "<a href='/AIV/27/7/3-7'>Dan. 7:3-7</a>; <a href='/AIV/66/12/3'>Rev. 12:3</a>",
      "comment": "The imagery of the beast echoes Daniel's vision of oppressive world empires (see Dan. 7:3-7). The blasphemous names signify rebellion against God. Crowns point to earthly authority, but ultimately allowed under divine sovereignty."
    },
    {
      "pk": 73013002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 2,
      "text": "The beast I saw was like a leopard, its feet like those of a bear, and its mouth like a lion’s mouth. The dragon gave it his power and throne, and great authority.",
      "links": "<a href='/AIV/27/7/4-6'>Dan. 7:4-6</a>; <a href='/AIV/66/12/9'>Rev. 12:9</a>",
      "comment": "This composite creature draws from the same animal imagery found in Daniel. The dragon—previously identified as Satan (Rev. 12:9)—empowers the beast. The beast's authority is not self-derived but allowed by a higher spiritual agency."
    },
    {
      "pk": 73013003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 3,
      "text": "One of its heads seemed to have a fatal wound, but its deadly wound was healed. The whole earth marveled and followed the beast.",
      "links": "<a href='/AIV/66/17/8'>Rev. 17:8</a>; <a href='/AIV/42/4/6'>Luke 4:6</a>",
      "comment": "The false resurrection of the beast mimics Christ’s resurrection, deceiving many. The theme of imitation highlights the ongoing spiritual contest. The world's awe shows how easily humanity can be captivated by appearances and power."
    },
    {
      "pk": 73013004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 4,
      "text": "They worshiped the dragon, for he had given his authority to the beast. And they worshiped the beast, saying, “Who is like the beast, and who can wage war against it?”",
      "links": "<a href='/AIV/66/9/20'>Rev. 9:20</a>; <a href='/AIV/19/35/10'>Ps. 35:10</a>",
      "comment": "This is a counterfeit worship, reminiscent of devotion owed only to God (see Ex. 15:11). The question, “Who is like the beast?” mocks the true praise reserved for God alone. The text calls attention to the danger of misdirected worship."
    },
    {
      "pk": 73013005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 5,
      "text": "The beast was given a mouth uttering proud words and blasphemies, and it was allowed to exercise authority for forty-two months.",
      "links": "<a href='/AIV/27/7/8'>Dan. 7:8</a>; <a href='/AIV/66/11/2'>Rev. 11:2</a>",
      "comment": "The period of forty-two months (three and a half years) alludes to times of tribulation in Daniel and Revelation. The beast’s power is granted, not inherent, and God ultimately limits its time."
    },
    {
      "pk": 73013006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 6,
      "text": "It opened its mouth to speak blasphemies against God, to slander His name and His dwelling, that is, those dwelling in heaven.",
      "links": "<a href='/AIV/27/7/25'>Dan. 7:25</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "Speaking against God and His dwelling—often interpreted as the spiritual temple or those united with Christ—emphasizes the beast’s direct opposition to God’s people."
    },
    {
      "pk": 73013007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 7,
      "text": "It was allowed to make war against the saints and to conquer them. And it was given authority over every tribe and people and language and nation.",
      "links": "<a href='/AIV/27/7/21'>Dan. 7:21</a>; <a href='/AIV/27/7/25'>Dan. 7:25</a>",
      "comment": "The suffering of the saints is a central theme, reflecting the path of Christ (1 Pet. 2:21). Universal authority over the nations foreshadows a time of severe trial for the entire Church, which must be persevered with faith."
    },
    {
      "pk": 73013008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 8,
      "text": "All who dwell on the earth will worship it, everyone whose name was not written from the foundation of the world in the book of life of the Lamb who was slain.",
      "links": "<a href='/AIV/2/32/32'>Exod. 32:32</a>; <a href='/AIV/66/3/5'>Rev. 3:5</a>; <a href='/AIV/1/3/15'>Gen. 3:15</a>",
      "comment": "Salvation is grounded in the sacrificial Lamb, Christ, foreordained from the foundation of the world (see 1 Pet. 1:19-20). The book of life indicates a predestined plan, connected with the Church as the custodian of this spiritual register."
    },
    {
      "pk": 73013009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 9,
      "text": "If anyone has an ear, let him hear:",
      "links": "<a href='/AIV/66/2/7'>Rev. 2:7</a>; <a href='/AIV/40/11/15'>Matt. 11:15</a>",
      "comment": "A call for spiritual discernment—repeated throughout Revelation—reminds believers of the importance of remaining attentive to divine truth revealed through the Spirit, especially as mediated through the apostolic tradition."
    },
    {
      "pk": 73013010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 10,
      "text": "If anyone is to go into captivity, into captivity he goes. If anyone is to be killed with the sword, with the sword he will be killed. Here is a call for the endurance and faith of the saints.",
      "links": "<a href='/AIV/24/15/2'>Jer. 15:2</a>; <a href='/AIV/40/26/52'>Matt. 26:52</a>",
      "comment": "Echoes the ancient principle that God’s providence surpasses human control. Believers are urged to endurance, especially through trial, reflecting Christ’s own passion and the witness of the martyrs."
    },
    {
      "pk": 73013011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 11,
      "text": "Then I saw another beast rising out of the earth. It had two horns like a lamb, but it spoke like a dragon.",
      "links": "<a href='/AIV/66/16/13'>Rev. 16:13</a>; <a href='/AIV/40/7/15'>Matt. 7:15</a>",
      "comment": "This second beast imitates the Lamb yet speaks with evil intent, an image of false prophecy and deceptive religious authority. The contrast with Christ, the true Lamb, is stark, warning of counterfeit spirituality."
    },
    {
      "pk": 73013012,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 12,
      "text": "It exercises all the authority of the first beast in its presence, and makes the earth and its inhabitants worship the first beast, whose mortal wound was healed.",
      "links": "<a href='/AIV/66/19/20'>Rev. 19:20</a>; <a href='/AIV/43/5/43'>John 5:43</a>",
      "comment": "The second beast works as an enforcer of corrupt worship, carrying out spiritual deception similar to those Jesus warned of. The healing of the mortal wound continues to draw the world’s attention away from true faith."
    },
    {
      "pk": 73013013,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 13,
      "text": "It performs great signs, even making fire come down from heaven to earth in front of people.",
      "links": "<a href='/AIV/11/18/38'>1 Kings 18:38</a>; <a href='/AIV/40/24/24'>Matt. 24:24</a>",
      "comment": "Miraculous signs here are used for deception, paralleling Old Testament miracles (1 Kings 18:38), but twisted for evil. Jesus warned of such false wonders (Matt. 24:24), and discernment in the faith community is vital."
    },
    {
      "pk": 73013014,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 14,
      "text": "Because of the signs it was allowed to perform in the presence of the beast, it deceives those who dwell on the earth, telling them to make an image for the beast that was wounded by the sword yet lived.",
      "links": "<a href='/AIV/27/3/5'>Dan. 3:5</a>; <a href='/AIV/66/16/14'>Rev. 16:14</a>",
      "comment": "Idolatry, both literal and spiritual, is a recurring challenge (cf. Dan. 3:5). The call to make an image underscores the temptation to externalize faith in false forms rather than in authentic worship rooted in truth."
    },
    {
      "pk": 73013015,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 15,
      "text": "It was allowed to give breath to the image of the beast, so that the image could speak and cause those who would not worship the image of the beast to be killed.",
      "links": "<a href='/AIV/27/3/6'>Dan. 3:6</a>; <a href='/AIV/66/20/4'>Rev. 20:4</a>",
      "comment": "This is a distortion of true life, mimicking divine prerogatives (cf. Gen. 2:7). Those faithful to God, refusing idolatrous worship, often pay with their lives as true witnesses, echoing the tradition of saints and martyrs."
    },
    {
      "pk": 73013016,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 16,
      "text": "It also causes all, both small and great, rich and poor, free and slave, to be marked on their right hand or on their forehead,",
      "links": "<a href='/AIV/5/6/8'>Deut. 6:8</a>; <a href='/AIV/66/7/3'>Rev. 7:3</a>",
      "comment": "This false mark parodies the biblical tradition of being sealed by God (Deut. 6:8; Rev. 7:3). The dichotomy between God’s mark and that of the beast points to the need for perseverance in visible, unified faith and sacramental commitment."
    },
    {
      "pk": 73013017,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 17,
      "text": "so that no one can buy or sell unless he has the mark, that is, the name of the beast or the number of its name.",
      "links": "<a href='/AIV/66/14/11'>Rev. 14:11</a>",
      "comment": "Economic pressure is used as a tool of religious coercion. This recalls how the unity and discipline of the community of believers is vital for spiritual resistance and fidelity."
    },
    {
      "pk": 73013018,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 13,
      "verse": 18,
      "text": "Here is wisdom: let the one who has understanding calculate the number of the beast, for it is the number of a man, and his number is 666.",
      "links": "<a href='/AIV/27/12/10'>Dan. 12:10</a>; <a href='/AIV/66/15/2'>Rev. 15:2</a>",
      "comment": "Six hundred sixty-six likely refers to imperfection falling short of divine completion (symbolized by seven). Many interpreters see a historical reference to persecutors of the Church, but the text also points to the call for discernment and fidelity until the end, in union with Christ and the saints."
    }
  ],
  "translatedAt": "2025-12-24T12:38:12.085Z"
}