{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 4,
  "verses": [
    {
      "pk": 2850001,
      "translation": "AIV",
      "book": 66,
      "chapter": 4,
      "verse": 1,
      "text": "After these things I looked, and behold, a door standing open in heaven! And the first voice which I had heard speaking to me like a trumpet said, 'Come up here, and I will show you what must take place after this.'",
      "links": "<a href='/AIV/1/28/12'>Gen. 28:12</a>; <a href='/AIV/26/1/1'>Ezek. 1:1</a>; <a href='/AIV/66/1/10'>Rev. 1:10</a>",
      "comment": "John is invited into the heavenly realm, similar to Old Testament prophets like Ezekiel. The 'trumpet' voice emphasizes the authority and divine initiative of the vision (see <a href='/AIV/66/1/10'>Rev. 1:10</a>). The open door symbolizes access to heavenly mysteries, stressing the Church as a mediator of revelation."
    },
    {
      "pk": 2850002,
      "translation": "AIV",
      "book": 66,
      "chapter": 4,
      "verse": 2,
      "text": "Immediately I was in the Spirit, and behold, a throne stood in heaven, with One seated on the throne.",
      "links": "<a href='/AIV/26/1/26'>Ezek. 1:26–28</a>; <a href='/AIV/66/1/10'>Rev. 1:10</a>",
      "comment": "Being 'in the Spirit' signals prophetic inspiration. The throne imagery draws from Ezekiel’s vision (<a href='/AIV/26/1/26'>Ezek. 1:26</a>). This emphasizes God’s total sovereignty over heaven and earth, and the heavenly liturgy centered on His throne."
    },
    {
      "pk": 2850003,
      "translation": "AIV",
      "book": 66,
      "chapter": 4,
      "verse": 3,
      "text": "He who sat there had the appearance of jasper and carnelian, and a rainbow that looked like an emerald encircled the throne.",
      "links": "<a href='/AIV/26/1/28'>Ezek. 1:28</a>; <a href='/AIV/2/28/17-20'>Exod. 28:17-20</a>",
      "comment": "The precious stones evoke God’s inapproachable glory and also the priestly symbolism of the Old Testament (cf. <a href='/AIV/2/28/17-20'>Exod. 28:17-20</a>). The rainbow suggests both mercy and covenant (see <a href='/AIV/1/9/13'>Gen. 9:13</a>), balancing judgment and grace at the throne."
    },
    {
      "pk": 2850004,
      "translation": "AIV",
      "book": 66,
      "chapter": 4,
      "verse": 4,
      "text": "Around the throne were twenty-four thrones, and upon them seated twenty-four elders, clothed in white garments, with golden crowns on their heads.",
      "links": "<a href='/AIV/13/24/4'>1 Chr. 24:4</a>; <a href='/AIV/19/122/1-4'>Ps. 122:1-4</a>",
      "comment": "The 24 elders represent the fullness of God's people—twelve tribes (Old Covenant) and twelve apostles (New Covenant)—emphasizing the unity of God’s people and continuity between Israel and the Church. Their white garments and golden crowns signal purity and royal authority."
    },
    {
      "pk": 2850005,
      "translation": "AIV",
      "book": 66,
      "chapter": 4,
      "verse": 5,
      "text": "From the throne came flashes of lightning, rumblings, and peals of thunder, and before the throne were seven burning torches of fire, which are the seven spirits of God,",
      "links": "<a href='/AIV/2/19/16'>Exod. 19:16</a>; <a href='/AIV/23/11/2'>Isa. 11:2</a>; <a href='/AIV/66/1/4'>Rev. 1:4</a>",
      "comment": "Lightning and thunder evoke the presence of God on Sinai (<a href='/AIV/2/19/16'>Exod. 19:16</a>). The 'seven spirits' can be interpreted as the fullness of the Holy Spirit (cf. <a href='/AIV/23/11/2'>Isa. 11:2</a>), signifying divine action sustained through the Church's worship."
    },
    {
      "pk": 2850006,
      "translation": "AIV",
      "book": 66,
      "chapter": 4,
      "verse": 6,
      "text": "and before the throne there was as it were a sea of glass, like crystal. In the center, around the throne, were four living creatures, full of eyes in front and behind:",
      "links": "<a href='/AIV/1/1/2'>Gen. 1:2</a>; <a href='/AIV/26/1/5'>Ezek. 1:5, 18</a>",
      "comment": "The sea of glass suggests separation yet approach to God, recalling the primordial waters (see <a href='/AIV/1/1/2'>Gen. 1:2</a>). The four living creatures reflect the cherubim (cf. <a href='/AIV/26/1/5'>Ezek. 1:5</a>), often seen as representing all creation worshipping God. Their eyes emphasize perfect knowledge and vigilance."
    },
    {
      "pk": 2850007,
      "translation": "AIV",
      "book": 66,
      "chapter": 4,
      "verse": 7,
      "text": "The first living creature was like a lion, the second like an ox, the third had a face like a human, and the fourth was like a flying eagle.",
      "links": "<a href='/AIV/26/1/10'>Ezek. 1:10</a>; <a href='/AIV/19/103/20-22'>Ps. 103:20-22</a>",
      "comment": "These four creatures parallel Ezekiel 1:10 and traditionally symbolize the strength, steadfastness, intelligence, and swiftness of God’s creation. In Christian tradition, they foreshadow the fourfold Gospel, unified around the worship of the divine throne."
    },
    {
      "pk": 2850008,
      "translation": "AIV",
      "book": 66,
      "chapter": 4,
      "verse": 8,
      "text": "The four living creatures, each with six wings, are full of eyes all around and within. Day and night they do not cease to say, 'Holy, holy, holy, is the Lord God Almighty, who was and is and is to come!'",
      "links": "<a href='/AIV/23/6/2-3'>Isa. 6:2-3</a>; <a href='/AIV/19/99/9'>Ps. 99:9</a>",
      "comment": "This echoes the seraphim’s song in Isaiah 6:3, affirming God’s transcendence and eternity. The triple 'holy' anticipates trinatarian worship. The unceasing praise establishes the heavenly liturgy as the model for earthly worship, emphasizing the centrality and perpetuity of praise."
    },
    {
      "pk": 2850009,
      "translation": "AIV",
      "book": 66,
      "chapter": 4,
      "verse": 9,
      "text": "And whenever the living creatures give glory and honor and thanks to Him who is seated on the throne, who lives forever and ever,",
      "links": "<a href='/AIV/19/136/2'>Ps. 136:2</a>; <a href='/AIV/19/29/2'>Ps. 29:2</a>",
      "comment": "The perpetual worship and thanksgiving recall the Psalms and the unending adoration due to God (<a href='/AIV/19/29/2'>Ps. 29:2</a>). This continuous liturgy is reflected in the ongoing spiritual sacrifice of the earthly Church."
    },
    {
      "pk": 2850010,
      "translation": "AIV",
      "book": 66,
      "chapter": 4,
      "verse": 10,
      "text": "the twenty-four elders fall down before Him who is seated on the throne and worship Him who lives forever and ever. They cast their crowns before the throne, saying,",
      "links": "<a href='/AIV/19/95/6'>Ps. 95:6</a>; <a href='/AIV/19/103/19-22'>Ps. 103:19-22</a>",
      "comment": "The elders’ act of casting their crowns signifies surrendering all glory to God. This gesture is both royal and priestly, linking the Church’s bishops with the continual worship of heaven, underscoring apostolic succession and continuity in liturgical worship."
    },
    {
      "pk": 2850011,
      "translation": "AIV",
      "book": 66,
      "chapter": 4,
      "verse": 11,
      "text": "'Worthy are You, our Lord and God, to receive glory and honor and power, for You created all things, and by Your will they existed and were created.'",
      "links": "<a href='/AIV/19/148/5'>Ps. 148:5</a>; <a href='/AIV/19/24/1'>Ps. 24:1</a>; <a href='/AIV/1/1/1'>Gen. 1:1</a>",
      "comment": "This doxology grounds God’s worthiness in His work as Creator, resonating with Genesis 1:1 and Psalms. The liturgical focus concludes by affirming creation as the work of God's sovereign will—mirrored in the Church’s worship, which anticipates the heavenly liturgy."
    }
  ],
  "translatedAt": "2025-12-23T04:22:29.307Z"
}