{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 1,
  "verses": [
    {
      "pk": 40001001,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 1,
      "text": "The revelation of Jesus Christ, which God gave to Him to show His servants the things that must soon take place. He made it known by sending His angel to His servant John.",
      "links": "<a href='/AIV/27/2/28-30'>Dan. 2:28-30</a>; <a href='/AIV/43/15/15'>John 15:15</a>",
      "comment": "This introduction parallels Daniel, emphasizing the unveiling of future events. The purpose is to reveal, not hide. The mediation by an angel suggests a heavenly hierarchy and structured communication, pointing to the importance of apostolic authority."
    },
    {
      "pk": 40001002,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 2,
      "text": "John testified to the word of God and to the testimony of Jesus Christ, to everything he saw.",
      "links": "<a href='/AIV/43/21/24'>John 21:24</a>; <a href='/AIV/62/1/1-3'>1 John 1:1-3</a>",
      "comment": "John's witness is both prophetic and apostolic, rooted in firsthand experience. This connects the apostolic testimony (eyewitness) with divine revelation, underscoring the trustworthiness and continuity of church teaching."
    },
    {
      "pk": 40001003,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 3,
      "text": "Blessed is the one who reads aloud and those who hear the words of this prophecy and keep what is written in it, because the time is near.",
      "links": "<a href='/AIV/42/11/28'>Luke 11:28</a>; <a href='/AIV/65/1/17-18'>Jude 17-18</a>",
      "comment": "Hearing and keeping the prophecy brings blessing, suggesting a communal aspect of worship and the importance of tradition and obedience. Reading aloud was the norm in worship assemblies, highlighting the public nature of revelation."
    },
    {
      "pk": 40001004,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 4,
      "text": "John, to the seven churches that are in Asia: Grace to you and peace from Him who is, who was, and who is to come, and from the seven Spirits who are before His throne,",
      "links": "<a href='/AIV/02/03/14'>Ex. 3:14</a>; <a href='/AIV/23/11/2'>Isa. 11:2</a>",
      "comment": "The description of God echoes the divine name in Exodus. The 'seven Spirits' often signify the fullness of the Holy Spirit (see Isaiah), suggesting the Spirit's multiform action within the Church and its offices."
    },
    {
      "pk": 40001005,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 5,
      "text": "and from Jesus Christ, the faithful witness, the firstborn from the dead, and the ruler of the kings of the earth. To Him who loves us and released us from our sins by His blood,",
      "links": "<a href='/AIV/19/89/27'>Ps. 89:27</a>; <a href='/AIV/51/1/18'>Col. 1:18</a>",
      "comment": "Jesus' titles affirm His divinity and kingship. His priestly action of cleansing by His blood underscores sacramental language and hints at the ongoing application of His sacrifice."
    },
    {
      "pk": 40001006,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 6,
      "text": "and made us a kingdom, priests to His God and Father—to Him be glory and dominion forever and ever. Amen.",
      "links": "<a href='/AIV/02/19/6'>Ex. 19:6</a>; <a href='/AIV/60/2/9'>1 Pet. 2:9</a>",
      "comment": "Being made a kingdom and priests draws from Israel's vocation, now fulfilled in the new covenant. This affirms the priestly role for all the baptized, suggesting continuity and order in worship and ministry."
    },
    {
      "pk": 40001007,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 7,
      "text": "Look! He is coming with the clouds, and every eye will see Him, even those who pierced Him, and all the tribes of the earth will mourn because of Him. Yes, Amen.",
      "links": "<a href='/AIV/27/7/13'>Dan. 7:13</a>; <a href='/AIV/38/12/10'>Zech. 12:10</a>",
      "comment": "The 'clouds' reference is messianic and divine (Daniel). Universal recognition of Christ’s return, even by those who rejected Him, affirms His supremacy. The mourning links to repentance and the hope of mercy."
    },
    {
      "pk": 40001008,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 8,
      "text": "\"I am the Alpha and the Omega,\" says the Lord God, \"who is, who was, and who is to come, the Almighty.\"",
      "links": "<a href='/AIV/23/44/6'>Isa. 44:6</a>; <a href='/AIV/19/90/2'>Ps. 90:2</a>",
      "comment": "Alpha and Omega, the first and last, signal eternity and omnipotence. The language is used of both God and Christ, highlighting their unity in divinity."
    },
    {
      "pk": 40001009,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 9,
      "text": "I, John, your brother and partner in the tribulation and the kingdom and the endurance in Jesus, was on the island called Patmos because of the word of God and the testimony of Jesus.",
      "links": "<a href='/AIV/44/14/22'>Acts 14:22</a>",
      "comment": "John aligns himself with all believers in suffering, kingdom membership, and perseverance. Being on Patmos for the faith reflects a tradition of exile and witness common to prophetic ministry."
    },
    {
      "pk": 40001010,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 10,
      "text": "I was in the Spirit on the Lord’s Day, and I heard behind me a loud voice like a trumpet,",
      "links": "<a href='/AIV/23/58/13'>Isa. 58:13</a>; <a href='/AIV/03/23/3'>Lev. 23:3</a>",
      "comment": "The 'Lord’s Day' strongly suggests Sunday worship, linked to the resurrection and communal liturgy. The Spirit’s inspiration on this day sets a precedent for Christian worship."
    },
    {
      "pk": 40001011,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 11,
      "text": "saying, \"Write what you see in a book and send it to the seven churches: to Ephesus, Smyrna, Pergamum, Thyatira, Sardis, Philadelphia, and Laodicea.\"",
      "links": "<a href='/AIV/24/30/2'>Jer. 30:2</a>",
      "comment": "John is commanded to write—apostolic authority recorded in scripture. Sending to seven specific churches emphasizes both particular and universal application, mirroring a visible, united community."
    },
    {
      "pk": 40001012,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 12,
      "text": "Then I turned to see the voice that was speaking to me, and, turning, I saw seven golden lampstands.",
      "links": "<a href='/AIV/02/25/31-37'>Ex. 25:31-37</a>; <a href='/AIV/38/4/2'>Zech. 4:2</a>",
      "comment": "Seven lampstands refer to the churches, echoing the temple’s menorah. The imagery connects worship, light, and the presence of God in the community."
    },
    {
      "pk": 40001013,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 13,
      "text": "And in the midst of the lampstands was one like a son of man, clothed with a long robe and a golden sash around his chest.",
      "links": "<a href='/AIV/27/7/13'>Dan. 7:13</a>; <a href='/AIV/02/28/4'>Ex. 28:4</a>",
      "comment": "‘Son of man’ is a messianic and divine title from Daniel, highlighting Christ’s divinity. Priestly garments connect Christ to ongoing priestly functions, both intercessory and sacramental."
    },
    {
      "pk": 40001014,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 14,
      "text": "His head and hair were white as white wool, as snow, and His eyes were like flames of fire.",
      "links": "<a href='/AIV/27/7/9'>Dan. 7:9</a>",
      "comment": "White hair represents wisdom and eternity (cf. Daniel’s Ancient of Days); eyes of fire indicate knowledge, judgment, and spiritual insight—attributes shared by God."
    },
    {
      "pk": 40001015,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 15,
      "text": "His feet were like polished bronze refined in a furnace, and His voice was like the roar of many waters.",
      "links": "<a href='/AIV/26/1/24'>Ezek. 1:24</a>; <a href='/AIV/19/29/3'>Ps. 29:3</a>",
      "comment": "Polished bronze signifies strength and purity. The voice 'like many waters' is a common image for divine power and majesty in the Old Testament prophets."
    },
    {
      "pk": 40001016,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 16,
      "text": "In His right hand He held seven stars, from His mouth came a sharp double-edged sword, and His face was like the sun shining at full strength.",
      "links": "<a href='/AIV/19/84/11'>Ps. 84:11</a>; <a href='/AIV/23/49/2'>Isa. 49:2</a>",
      "comment": "Seven stars symbolize authority over the churches. The sword from His mouth signifies the power and judgment of the Word. The sun’s brilliance highlights glory and divinity."
    },
    {
      "pk": 40001017,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 17,
      "text": "When I saw Him, I fell at His feet as though dead. But He placed His right hand on me and said, \"Do not be afraid. I am the First and the Last,",
      "links": "<a href='/AIV/23/44/6'>Isa. 44:6</a>; <a href='/AIV/27/10/10'>Dan. 10:10</a>",
      "comment": "Falling down mirrors responses to theophany (divine appearance). 'First and Last' is an Old Testament title for God reiterated here by Christ, a clear claim to divinity and authority."
    },
    {
      "pk": 40001018,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 18,
      "text": "the Living One. I died, and look—I am alive forevermore, and I hold the keys of Death and of Hades.",
      "links": "<a href='/AIV/19/68/20'>Ps. 68:20</a>; <a href='/AIV/40/16/19'>Matt. 16:19</a>",
      "comment": "Christ declares His death and resurrection—the heart of the gospel. Holding the keys shows His authority, including over spiritual realms, which hints at a tradition of delegated authority within the visible Church."
    },
    {
      "pk": 40001019,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 19,
      "text": "Write therefore what you have seen, what is now, and what is to take place after this.",
      "links": "<a href='/AIV/27/10/14'>Dan. 10:14</a>",
      "comment": "John’s commission recalls prophetic patterns: articulate both present realities and the future. Apostolic writing is essential for preserving and transmitting authentic doctrine."
    },
    {
      "pk": 40001020,
      "translation": "AIV",
      "book": 66,
      "chapter": 1,
      "verse": 20,
      "text": "As for the mystery of the seven stars you saw in My right hand and the seven golden lampstands: the seven stars are the messengers of the seven churches, and the seven lampstands are the seven churches.",
      "links": "<a href='/AIV/38/4/2'>Zech. 4:2</a>; <a href='/AIV/40/5/14'>Matt. 5:14</a>",
      "comment": "The visible church and its appointed leaders are explicitly represented. This unites spiritual reality with earthly structure, affirming that God’s people are united and their spiritual leadership divinely appointed."
    }
  ],
  "translatedAt": "2025-12-23T04:21:02.253Z"
}