{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 13,
  "verses": [
    {
      "pk": 23451330,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 1,
      "text": "And I saw a beast rising out of the sea, having ten horns and seven heads. On its horns were ten crowns, and on its heads were blasphemous names.",
      "links": "<a href='/AIV/27/7/3-7'>Daniel 7:3-7</a>; <a href='/AIV/17/9/24'>Esther 9:24</a>",
      "comment": "The prophecy parallels Daniel's vision of beasts representing kingdoms (Daniel 7:3-7). The use of ten horns and seven heads points to a fullness of evil power and false authority, with the crowns representing rule and the blasphemous names signifying opposition to God. Naming blasphemies signifies a direct challenge to divine sovereignty."
    },
    {
      "pk": 23451331,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 2,
      "text": "The beast I saw was like a leopard, but its feet were like those of a bear and its mouth like a lion’s mouth. And the dragon gave his power and his throne and great authority to it.",
      "links": "<a href='/AIV/27/7/4-6'>Daniel 7:4-6</a>; <a href='/AIV/66/12/9'>Rev. 12:9</a>",
      "comment": "The imagery draws strongly from Daniel 7. The dragon, identified as Satan in Revelation 12:9, empowers the beast. The combination of beasts shows a perverted imitation of true sovereignty and reflects a spiritual reality behind worldly powers. Spiritual interpretation sees this as recurring opposition to Christ’s kingdom."
    },
    {
      "pk": 23451332,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 3,
      "text": "One of its heads seemed to have a mortal wound, but its mortal wound was healed. And the whole earth marveled, following the beast.",
      "links": "<a href='/AIV/66/17/8'>Rev. 17:8</a>; <a href='/AIV/27/8/8'>Daniel 8:8</a>",
      "comment": "The healing of the mortal wound is a counterfeit resurrection, mirroring Christ's true resurrection, stirring devotion among the people. This alludes to the deceptive power of evil, mimicking divine miracles (see also 2 Thessalonians 2:9-10)."
    },
    {
      "pk": 23451333,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 4,
      "text": "They worshiped the dragon because he had given authority to the beast, and they worshiped the beast, saying, 'Who is like the beast, and who can fight against it?'",
      "links": "<a href='/AIV/02/15/11'>Exodus 15:11</a>; <a href='/AIV/66/12/9'>Rev. 12:9</a>",
      "comment": "Their adoration of the beast mirrors the worship that belongs to God alone (cf. Exodus 15:11). The question posed is a blasphemous parody of the praises attributed to God, highlighting the ultimate spiritual battle."
    },
    {
      "pk": 23451334,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 5,
      "text": "The beast was given a mouth speaking proud words and blasphemies, and it was allowed to exercise authority for forty-two months.",
      "links": "<a href='/AIV/27/7/8'>Daniel 7:8</a>; <a href='/AIV/66/11/2'>Rev. 11:2</a>",
      "comment": "The forty-two months (three and a half years) symbolizes a limited period of tribulation, a recurring biblical theme (see Daniel 7:25; Rev. 11:2). The allowance shows God's ultimate sovereignty and limits on evil."
    },
    {
      "pk": 23451335,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 6,
      "text": "It opened its mouth to speak blasphemies against God, to blaspheme His name and His dwelling, those who dwell in heaven.",
      "links": "<a href='/AIV/27/7/25'>Daniel 7:25</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "The beast's blasphemy echoes the defiant spirit of the powers in Daniel. God's dwelling is both the heavenly sanctuary and, by spiritual interpretation, the community of the faithful, the living temple of God (cf. 1 Peter 2:5)."
    },
    {
      "pk": 23451336,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 7,
      "text": "It was allowed to make war against the saints and to conquer them. And it was given authority over every tribe, people, language, and nation.",
      "links": "<a href='/AIV/27/7/21'>Daniel 7:21</a>; <a href='/AIV/66/7/9'>Rev. 7:9</a>",
      "comment": "Here again, permission is given, not autonomous authority, emphasizing divine providence and the mystery of evil. The assault on the saints also alludes to ongoing earthly suffering endured by the faithful throughout history, with echoes of unity among all nations under Christ."
    },
    {
      "pk": 23451337,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 8,
      "text": "All who dwell on the earth will worship it, everyone whose name has not been written from the foundation of the world in the Book of Life of the Lamb who was slain.",
      "links": "<a href='/AIV/66/3/5'>Rev. 3:5</a>; <a href='/AIV/49/1/4'>Eph. 1:4</a>; <a href='/AIV/66/5/6'>Rev. 5:6</a>",
      "comment": "The Book of Life teaches on eternal predestination and sovereign grace (see Ephesians 1:4). The slain Lamb—a clear christological reference—shows Christ's atoning sacrifice as the foundation of hope."
    },
    {
      "pk": 23451338,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 9,
      "text": "If anyone has an ear, let him hear.",
      "links": "<a href='/AIV/66/2/7'>Rev. 2:7</a>",
      "comment": "This calling echoes Jesus’ repeated exhortation to attentive hearing, signifying the importance of spiritual readiness and discernment in all ages."
    },
    {
      "pk": 23451339,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 10,
      "text": "If anyone is to be taken captive, to captivity he goes; if anyone is to be killed with the sword, with the sword he must be killed. Here is a call for the endurance and faith of the saints.",
      "links": "<a href='/AIV/24/15/2'>Jer. 15:2</a>; <a href='/AIV/66/14/12'>Rev. 14:12</a>",
      "comment": "The sovereignty of God over suffering is highlighted (cf. Jeremiah 15:2). The saints are called to patient endurance and great fidelity in the face of suffering, tying the theme to the perseverance of the faithful."
    },
    {
      "pk": 23451340,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 11,
      "text": "Then I saw another beast rising out of the earth. It had two horns like a lamb but spoke like a dragon.",
      "links": "<a href='/AIV/66/16/13'>Rev. 16:13</a>; <a href='/AIV/40/7/15'>Matt. 7:15</a>",
      "comment": "This beast imitates the appearance of Christ (the Lamb) but its speech betrays its true nature, warning against false prophets and deceptive religious authorities (see Matthew 7:15)."
    },
    {
      "pk": 23451341,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 12,
      "text": "It exercises all the authority of the first beast in its presence, and it makes the earth and its inhabitants worship the first beast, whose mortal wound was healed.",
      "links": "<a href='/AIV/66/19/20'>Rev. 19:20</a>; <a href='/AIV/66/13/3'>Rev. 13:3</a>",
      "comment": "The second beast acts as the first beast’s support, enforcing false worship—a counterfeit of the true unity of faith, and a warning against false worship that mimics the true."
    },
    {
      "pk": 23451342,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 13,
      "text": "It performs great signs, even making fire come down from heaven to earth in front of people.",
      "links": "<a href='/AIV/02/7/11-12'>Exodus 7:11-12</a>; <a href='/AIV/11/18/38'>1 Kings 18:38</a>",
      "comment": "Signs recall the wonders of false prophets (Exodus 7:11) and true prophets (1 Kings 18:38). True signs confirm God’s messengers; the beast’s wonders show that not all miracles prove divine approval. Discernment is crucial."
    },
    {
      "pk": 23451343,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 14,
      "text": "By the signs it is allowed to perform on behalf of the beast, it deceives those who dwell on earth, telling them to make an image for the beast who was wounded by the sword and yet lived.",
      "links": "<a href='/AIV/27/3/5'>Daniel 3:5</a>; <a href='/AIV/66/13/3'>Rev. 13:3</a>",
      "comment": "The call to manufacture an image recalls idolatry in Daniel 3:5. The deception points to the dangers of visible idolatry alongside the spiritual, with the wound pointing to false signs of legitimacy."
    },
    {
      "pk": 23451344,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 15,
      "text": "It was allowed to give breath to the image of the beast, so that the image of the beast could even speak and cause those who would not worship the image of the beast to be killed.",
      "links": "<a href='/AIV/19/135/15-17'>Psalm 135:15-17</a>; <a href='/AIV/66/20/4'>Rev. 20:4</a>",
      "comment": "The speaking image parodies God's creation of life (Genesis 2:7), contrasting lifeless idols with the living God. Compelling worship on pain of death is a theme with echoes in the persecutions of the faithful, as later church history shows."
    },
    {
      "pk": 23451345,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 16,
      "text": "It also causes all, both small and great, both rich and poor, both free and slave, to be marked on their right hand or their forehead,",
      "links": "<a href='/AIV/05/6/8'>Deut. 6:8</a>; <a href='/AIV/66/7/3'>Rev. 7:3</a>",
      "comment": "The mark here is counterfeit of the seal God puts on His own (Deut. 6:8; Rev. 7:3), showing the enemy’s imitation of God’s sacraments and signs. Historically, this evokes the visible belonging to a community—true and false."
    },
    {
      "pk": 23451346,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 17,
      "text": "so that no one can buy or sell unless he has the mark—the name of the beast or the number of its name.",
      "links": "<a href='/AIV/66/14/9'>Rev. 14:9</a>; <a href='/AIV/66/16/2'>Rev. 16:2</a>",
      "comment": "Economic coercion is used to enforce religious apostasy, paralleling events in Daniel and other persecutions. The seal reflects spiritual allegiance—either to the Lamb or the beast."
    },
    {
      "pk": 23451347,
      "translation": "AIV",
      "book": 66,
      "chapter": 13,
      "verse": 18,
      "text": "Here is wisdom: let the one who has understanding calculate the number of the beast, for it is the number of a man, and his number is 666.",
      "links": "<a href='/AIV/11/10/14'>1 Kings 10:14</a>; <a href='/AIV/27/12/10'>Daniel 12:10</a>; <a href='/AIV/66/15/2'>Rev. 15:2</a>",
      "comment": "The number 666 is symbolic, often connected to imperfection or incompleteness, falling short of the number of divine fullness (cf. 1 Kings 10:14). The call for wisdom and discernment is important for interpreting prophecy rightly, relying on the teaching and unity of the apostles as guardians of the apostolic tradition."
    }
  ],
  "translatedAt": "2025-12-23T04:26:05.109Z"
}