{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 21,
  "verses": [
    {
      "pk": 73021001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 1,
      "text": "Then I saw a new heaven and a new earth, for the first heaven and the first earth had passed away, and the sea was no more.",
      "links": "<a href='/AIV/23/65/17'>Isa. 65:17</a>; <a href='/AIV/23/66/22'>Isa. 66:22</a>; <a href='/AIV/60/3/13'>2 Pet. 3:13</a>",
      "comment": "The vision of the new creation fulfills Old Testament prophecy (see Isaiah 65:17). The 'sea was no more' likely symbolizes the removal of chaos and evil, not just a literal absence of water—revealing a perfected state in God's presence."
    },
    {
      "pk": 73021002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 2,
      "text": "And I saw the holy city, new Jerusalem, coming down out of heaven from God, prepared like a bride adorned for her husband.",
      "links": "<a href='/AIV/23/52/1'>Isa. 52:1</a>; <a href='/AIV/48/4/26'>Gal. 4:26</a>",
      "comment": "The new Jerusalem symbolizes the redeemed people of God, prepared for a union with Christ, echoing Old Testament images of God as bridegroom (Isaiah 62:5). Notice the city comes down (from God, not built up), emphasizing salvation as a divine gift, not human achievement."
    },
    {
      "pk": 73021003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 3,
      "text": "And I heard a loud voice from the throne saying, “See, the dwelling place of God is with humanity, and he will dwell with them. They will be his people, and God himself will be with them as their God.”",
      "links": "<a href='/AIV/03/26/11-12'>Lev. 26:11-12</a>; <a href='/AIV/26/37/27'>Ezek. 37:27</a>; <a href='/AIV/40/1/23'>Matt. 1:23</a>",
      "comment": "God’s presence among his people fulfills the ancient prophecies (Lev. 26:11-12, Ezek. 37:27). The promise is now complete and permanent, showing an intimate union between God and humanity—the true communion for which we are created."
    },
    {
      "pk": 73021004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 4,
      "text": "He will wipe away every tear from their eyes, and death will be no more. Neither will there be mourning, nor crying, nor pain anymore, for the former things have passed away.",
      "links": "<a href='/AIV/23/25/8'>Isa. 25:8</a>; <a href='/AIV/46/15/54'>1 Cor. 15:54-55</a>",
      "comment": "The fulfillment of Isaiah 25:8 and the victory over death (1 Cor. 15:54-55). Christ’s resurrection and redemptive work open this new, perfected reality, a final restoration with no more suffering or tears."
    },
    {
      "pk": 73021005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 5,
      "text": "And the one seated on the throne said, “Behold, I am making all things new.” And he said, “Write this down, for these words are trustworthy and true.”",
      "links": "<a href='/AIV/23/43/19'>Isa. 43:19</a>; <a href='/AIV/66/19/9'>Rev. 19:9</a>",
      "comment": "God’s authority is stressed—he actively renews creation. The command to write affirms the certainty of these promises and their reliability for the faithful."
    },
    {
      "pk": 73021006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 6,
      "text": "And he said to me, “It is done! I am the Alpha and the Omega, the Beginning and the End. I will freely give from the spring of the water of life to the thirsty.”",
      "links": "<a href='/AIV/23/44/6'>Isa. 44:6</a>; <a href='/AIV/43/4/14'>John 4:14</a>; <a href='/AIV/66/1/8'>Rev. 1:8</a>",
      "comment": "‘Alpha and Omega’ again declares Christ’s divinity and sovereignty (Rev. 1:8, Isa. 44:6). The water of life recalls Jesus’ words about eternal life (John 4:14), given freely to those who seek him."
    },
    {
      "pk": 73021007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 7,
      "text": "The one who conquers will inherit these things, and I will be his God and he will be my son.",
      "links": "<a href='/AIV/10/7/14'>2 Sam. 7:14</a>; <a href='/AIV/43/1/12'>John 1:12</a>",
      "comment": "This echoes the covenant promise of God (2 Sam. 7:14) and being children of God through Christ (John 1:12). Overcoming through faith and persistent fidelity is essential."
    },
    {
      "pk": 73021008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 8,
      "text": "But as for the cowardly, the faithless, the detestable, murderers, the sexually immoral, those who practice sorcery, idolaters, and all liars—their portion will be in the lake that burns with fire and sulfur, which is the second death.”",
      "links": "<a href='/AIV/05/29/20'>Deut. 29:20</a>; <a href='/AIV/66/20/14'>Rev. 20:14</a>",
      "comment": "Sin has eternal consequences—‘second death’ refers to eternal separation from God. A warning to the Church: perseverance in faith and holiness is necessary for salvation (Heb. 12:14)."
    },
    {
      "pk": 73021009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 9,
      "text": "Then one of the seven angels who had the seven bowls filled with the last seven plagues came and spoke to me, saying, “Come, I will show you the bride, the wife of the Lamb.”",
      "links": "<a href='/AIV/66/15/1'>Rev. 15:1</a>; <a href='/AIV/49/5/25-27'>Eph. 5:25-27</a>",
      "comment": "The Church is depicted as the bride, in complete union with the Lamb (Christ); see Ephesians 5:25-27. The imagery emphasizes purity, unity, and holiness as fruits of true faith."
    },
    {
      "pk": 73021010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 10,
      "text": "And he carried me away in the Spirit to a great, high mountain and showed me the holy city, Jerusalem, coming down out of heaven from God.",
      "links": "<a href='/AIV/26/40/2'>Ezek. 40:2</a>; <a href='/AIV/66/21/2'>Rev. 21:2</a>",
      "comment": "The prophet’s vision from a mountain-top echoes Ezekiel, revealing a connection between the old covenant temple and the new, perfect dwelling of God with his people."
    },
    {
      "pk": 73021011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 11,
      "text": "It had the glory of God, its radiance like a most rare jewel, like jasper, clear as crystal.",
      "links": "<a href='/AIV/26/43/2'>Ezek. 43:2</a>; <a href='/AIV/02/28/17-20'>Ex. 28:17-20</a>",
      "comment": "The city’s glory recalls God’s presence filling the tabernacle and temple, and the use of precious stones signifies both beauty and sacredness—a holy people radiating God’s splendor."
    },
    {
      "pk": 73021012,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 12,
      "text": "It had a great, high wall, with twelve gates, and at the gates twelve angels, and on the gates the names of the twelve tribes of the sons of Israel were inscribed.",
      "links": "<a href='/AIV/26/48/30-35'>Ezek. 48:30-35</a>; <a href='/AIV/01/49/28'>Gen. 49:28</a>",
      "comment": "The twelve tribes highlight the continuity of God’s plan from Israel to the Church. The city is safe and complete, open for true worshipers from all nations."
    },
    {
      "pk": 73021013,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 13,
      "text": "On the east three gates, on the north three gates, on the south three gates, and on the west three gates.",
      "links": "<a href='/AIV/26/48/31-34'>Ezek. 48:31-34</a>",
      "comment": "Universal access from all directions symbolizes the invitation to all peoples. God’s kingdom is not restricted by geography or race."
    },
    {
      "pk": 73021014,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 14,
      "text": "And the wall of the city had twelve foundations, and on them were the twelve names of the twelve apostles of the Lamb.",
      "links": "<a href='/AIV/42/6/13'>Luke 6:13</a>; <a href='/AIV/49/2/20'>Eph. 2:20</a>",
      "comment": "The unity and apostolic foundation of the Church are emphasized, showing the importance of apostolic succession and authoritative teaching, as built upon the apostles chosen by Christ."
    },
    {
      "pk": 73021015,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 15,
      "text": "The one who spoke with me had a measuring rod of gold to measure the city and its gates and its walls.",
      "links": "<a href='/AIV/26/40/3'>Ezek. 40:3</a>; <a href='/AIV/66/11/1'>Rev. 11:1</a>",
      "comment": "Measuring the city symbolizes its perfection, order, and distinction. This recalls Ezekiel’s vision of the restored temple, now fulfilled in a perfect heavenly reality."
    },
    {
      "pk": 73021016,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 16,
      "text": "The city was laid out as a square, its length the same as its width. And he measured the city with the rod: twelve thousand stadia. Its length, width, and height are equal.",
      "links": "<a href='/AIV/11/6/20'>1 Kgs. 6:20</a>",
      "comment": "A cubical shape directly recalls the Holy of Holies (1 Kings 6:20) in the temple, symbolizing God’s complete and accessible presence for all his people."
    },
    {
      "pk": 73021017,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 17,
      "text": "He also measured its wall, 144 cubits by human measurement, which is also an angel's measurement.",
      "links": "<a href='/AIV/66/7/4'>Rev. 7:4</a>",
      "comment": "The number and measurement emphasize symbolic perfection and completeness—144 (12 × 12) is a number of fullness, likely representing all the people of God."
    },
    {
      "pk": 73021018,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 18,
      "text": "The wall was built of jasper, while the city was pure gold, like clear glass.",
      "links": "<a href='/AIV/02/28/20'>Ex. 28:20</a>; <a href='/AIV/66/21/11'>Rev. 21:11</a>",
      "comment": "Exquisite materials symbolize the immense holiness, glory, and preciousness of God’s people—the city is spiritually as well as physically glorious."
    },
    {
      "pk": 73021019,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 19,
      "text": "The foundations of the wall of the city were adorned with every kind of precious stone. The first was jasper, the second sapphire, the third chalcedony, the fourth emerald,",
      "links": "<a href='/AIV/02/28/17-20'>Ex. 28:17-20</a>",
      "comment": "This list echoes the stones in the high priest’s breastplate (Ex. 28:17-20), signifying the priestly identity of God’s people, connected to ongoing worship and heavenly liturgy."
    },
    {
      "pk": 73021020,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 20,
      "text": "the fifth sardonyx, the sixth carnelian, the seventh chrysolite, the eighth beryl, the ninth topaz, the tenth chrysoprase, the eleventh jacinth, the twelfth amethyst.",
      "links": "<a href='/AIV/02/28/17-20'>Ex. 28:17-20</a>",
      "comment": "The twelve stones continue the theme of completeness, unity, and priestly dignity—pointing toward the glorification of the Church as the new temple where God dwells."
    },
    {
      "pk": 73021021,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 21,
      "text": "The twelve gates were twelve pearls, each of the gates made from a single pearl, and the city's main street was pure gold, transparent as glass.",
      "links": "<a href='/AIV/40/13/45-46'>Matt. 13:45-46</a>",
      "comment": "Pearls symbolize purity and great value (Matt. 13:45-46), suggesting entry into God’s kingdom is precious and requires seeking the ultimate treasure—Christ himself."
    },
    {
      "pk": 73021022,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 22,
      "text": "I saw no temple in the city, for its temple is the Lord God, the Almighty, and the Lamb.",
      "links": "<a href='/AIV/43/2/19-21'>John 2:19-21</a>",
      "comment": "No physical temple is needed; Christ and the Father are the reality to which all previous temples pointed. The new covenant is fulfilled in perfect, perpetual communion with God."
    },
    {
      "pk": 73021023,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 23,
      "text": "And the city has no need of sun or moon to shine on it, for the glory of God illuminates it, and its lamp is the Lamb.",
      "links": "<a href='/AIV/23/60/19-20'>Isa. 60:19-20</a>; <a href='/AIV/43/8/12'>John 8:12</a>",
      "comment": "Isaiah’s prophecy (Isa. 60:19-20) is fulfilled; Jesus, the Light of the World (John 8:12), brings perfect and direct illumination, abolishing all forms of darkness and ignorance."
    },
    {
      "pk": 73021024,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 24,
      "text": "The nations will walk by its light, and the kings of the earth will bring their glory into it.",
      "links": "<a href='/AIV/23/60/3'>Isa. 60:3</a>",
      "comment": "All peoples are drawn to the city’s light, fulfilling Israel’s vocation to be a light to the world (Isa. 60:3). Unity and universality mark the coming kingdom."
    },
    {
      "pk": 73021025,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 25,
      "text": "Its gates will never be shut by day—and there will be no night there.",
      "links": "<a href='/AIV/23/60/11'>Isa. 60:11</a>",
      "comment": "Eternal security, peace, and uninterrupted access characterize God’s kingdom. God’s presence removes all threat and darkness."
    },
    {
      "pk": 73021026,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 26,
      "text": "They will bring into it the glory and the honor of the nations.",
      "links": "<a href='/AIV/23/66/12'>Isa. 66:12</a>; <a href='/AIV/23/60/5-11'>Isa. 60:5-11</a>",
      "comment": "Cultural and national distinctiveness are fulfilled and perfected in Christ, brought as offerings to the one sanctuary—showing the Church’s universal reach and mission."
    },
    {
      "pk": 73021027,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 21,
      "verse": 27,
      "text": "But nothing unclean will ever enter it, nor anyone who practices abomination or falsehood, but only those written in the Lamb’s Book of Life.",
      "links": "<a href='/AIV/23/52/1'>Isa. 52:1</a>; <a href='/AIV/66/20/12'>Rev. 20:12</a>",
      "comment": "Ultimate purity and holiness are necessary for communion with God. Only those made righteous by Christ (the Lamb) have access, reinforcing the call to steadfast faith, repentance, and the transformative life of grace."
    }
  ],
  "translatedAt": "2025-12-24T12:41:56.839Z"
}