{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 10,
  "verses": [
    {
      "pk": 401001,
      "translation": "AIV",
      "book": 66,
      "chapter": 10,
      "verse": 1,
      "text": "Then I saw another mighty angel coming down from heaven, clothed with a cloud, with a rainbow over his head. His face was like the sun, and his feet like pillars of fire.",
      "links": "<a href='/AIV/66/1/7'>Rev. 1:7</a>; <a href='/AIV/10/22/10-13'>2 Sam. 22:10-13</a>; <a href='/AIV/26/1/28'>Ezek. 1:28</a>; <a href='/AIV/19/104/3'>Ps. 104:3</a>",
      "comment": "The angel's appearance echoes Old Testament theophanies (manifestations of God), especially with the cloud and fiery elements, reminiscent of Christ's transfiguration and resurrection glory. The rainbow points back to God's covenant with Noah (Gen. 9:13). Some early interpreters see the angel as representing Christ; this is supported by striking imagery, though others view him as a distinct messenger."
    },
    {
      "pk": 401002,
      "translation": "AIV",
      "book": 66,
      "chapter": 10,
      "verse": 2,
      "text": "He held in his hand a little scroll, which was open. He set his right foot on the sea and his left foot on the land.",
      "links": "<a href='/AIV/66/5/1-7'>Rev. 5:1-7</a>; <a href='/AIV/66/10/8'>Rev. 10:8</a>; <a href='/AIV/66/13/1'>Rev. 13:1</a>",
      "comment": "The open scroll symbolizes revealed prophecy. The angel's stance on sea and land indicates authority over all creation, reflecting themes of Christ's universal sovereignty. Contrast with Rev. 5, where the scroll was sealed; this one is open, foreshadowing public revelation."
    },
    {
      "pk": 401003,
      "translation": "AIV",
      "book": 66,
      "chapter": 10,
      "verse": 3,
      "text": "And he cried out with a loud voice, like a roaring lion. When he called out, the seven thunders sounded their voices.",
      "links": "<a href='/AIV/66/5/5'>Rev. 5:5</a>; <a href='/AIV/29/3/16'>Joel 3:16</a>; <a href='/AIV/18/37/5'>Job 37:5</a>",
      "comment": "Lion imagery is often associated with Christ as the Lion of Judah (Rev. 5:5). The seven thunders suggest divine completeness and mystery, paralleling the voice of God in creation and judgment (Job 37:5)."
    },
    {
      "pk": 401004,
      "translation": "AIV",
      "book": 66,
      "chapter": 10,
      "verse": 4,
      "text": "When the seven thunders had spoken, I was about to write, but I heard a voice from heaven saying, 'Seal up what the seven thunders said, and do not write it down.'",
      "links": "<a href='/AIV/27/12/4'>Dan. 12:4</a>; <a href='/AIV/66/22/10'>Rev. 22:10</a>",
      "comment": "Divine mysteries are sometimes partially withheld, as in Daniel 12:4. Here, the voice commands silence, demonstrating that not all revelation is accessible—inviting humility before God's wisdom and hinting at the Church's role in faithfully preserving sacred mystery."
    },
    {
      "pk": 401005,
      "translation": "AIV",
      "book": 66,
      "chapter": 10,
      "verse": 5,
      "text": "Then the angel whom I saw standing on the sea and on the land raised his right hand toward heaven,",
      "links": "<a href='/AIV/27/12/7'>Dan. 12:7</a>",
      "comment": "The gesture of raising a hand toward heaven is an oath, linking to Daniel 12:7. This posture connects heavenly authority with earthly responsibility, a motif common in prophetic tradition."
    },
    {
      "pk": 401006,
      "translation": "AIV",
      "book": 66,
      "chapter": 10,
      "verse": 6,
      "text": "and swore by him who lives forever and ever, who created heaven and all that is in it, the earth and all that is in it, and the sea and all that is in it, that there should be no longer any delay.",
      "links": "<a href='/AIV/2/20/11'>Ex. 20:11</a>; <a href='/AIV/19/146/6'>Ps. 146:6</a>",
      "comment": "The angel swears by the Creator God, emphasizing eternity and creative power (Ex. 20:11, Ps. 146:6). 'No longer any delay' points to a culmination of God's plan—the appointed time approaches, paralleling themes of eschatological fulfillment."
    },
    {
      "pk": 401007,
      "translation": "AIV",
      "book": 66,
      "chapter": 10,
      "verse": 7,
      "text": "But in the days of the trumpet call of the seventh angel, when he is about to sound, the mystery of God will be completed, as he declared to his servants the prophets.",
      "links": "<a href='/AIV/66/11/15'>Rev. 11:15</a>; <a href='/AIV/30/3/7'>Amos 3:7</a>; <a href='/AIV/45/16/25'>Rom. 16:25</a>",
      "comment": "The 'mystery of God' reflects the fullness of divine revelation and salvation, prepared through the prophets (Amos 3:7) and fulfilled in Christ (Rom. 16:25). The language anticipates the visible establishment of God's kingdom on earth, a central theme in apostolic tradition."
    },
    {
      "pk": 401008,
      "translation": "AIV",
      "book": 66,
      "chapter": 10,
      "verse": 8,
      "text": "Then the voice that I heard from heaven spoke to me again, saying, 'Go, take the scroll that is open in the hand of the angel standing on the sea and on the land.'",
      "links": "<a href='/AIV/66/10/2'>Rev. 10:2</a>; <a href='/AIV/26/2/9-10'>Ezek. 2:9-10</a>",
      "comment": "John receives divine instruction to actively take the scroll. This recalls Ezekiel's prophetic commission, where receiving the scroll signifies acceptance of a difficult message for God's people."
    },
    {
      "pk": 401009,
      "translation": "AIV",
      "book": 66,
      "chapter": 10,
      "verse": 9,
      "text": "So I went to the angel and asked him to give me the little scroll. He said to me, 'Take it and eat it. It will make your stomach bitter, but in your mouth it will be sweet as honey.'",
      "links": "<a href='/AIV/26/3/1-3'>Ezek. 3:1-3</a>; <a href='/AIV/19/119/103'>Ps. 119:103</a>",
      "comment": "Eating the scroll represents full acceptance and internalization of God's word—sweet in revelation, bitter in consequence. This symbolism is rooted in Ezekiel 3:1-3 and Psalm 119:103."
    },
    {
      "pk": 401010,
      "translation": "AIV",
      "book": 66,
      "chapter": 10,
      "verse": 10,
      "text": "I took the little scroll from the angel's hand and ate it. It was sweet as honey in my mouth, but when I had eaten it, my stomach was made bitter.",
      "links": "<a href='/AIV/26/3/3'>Ezek. 3:3</a>; <a href='/AIV/19/19/10'>Ps. 19:10</a>",
      "comment": "This verse further emphasizes both the joy and cost of prophetic ministry. The sweetness recalls the delight in receiving God's word (Ps. 19:10), while the bitterness prefigures suffering that follows proclamation."
    },
    {
      "pk": 401011,
      "translation": "AIV",
      "book": 66,
      "chapter": 10,
      "verse": 11,
      "text": "And they said to me, 'You must prophesy again about many peoples, nations, languages, and kings.'",
      "links": "<a href='/AIV/66/5/9'>Rev. 5:9</a>; <a href='/AIV/24/1/10'>Jer. 1:10</a>",
      "comment": "John is called to universal prophetic ministry, echoing references to the worldwide scope of the Gospel (Rev. 5:9, Jer. 1:10). This highlights the ongoing need for the Church's witness and teaching authority in every generation."
    }
  ],
  "translatedAt": "2025-12-23T04:24:41.550Z"
}