{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 7,
  "verses": [
    {
      "pk": 2007001,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 1,
      "text": "After this I saw four angels standing at the four corners of the earth, holding back the four winds of the earth, so that no wind might blow on the land or sea or against any tree.",
      "links": "<a href='/AIV/24/49/36'>Jer. 49:36</a>; <a href='/AIV/27/7/2'>Dan. 7:2</a>",
      "comment": "The four angels symbolize completeness in restraining judgment. The phrase 'four corners of the earth' is an ancient idiom referring to the whole world."
    },
    {
      "pk": 2007002,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 2,
      "text": "And I saw another angel ascending from the rising of the sun, having the seal of the living God. He called out with a loud voice to the four angels who had been given power to harm the land and sea,",
      "links": "<a href='/AIV/26/9/4'>Ezek. 9:4</a>; <a href='/AIV/43/6/27'>John 6:27</a>",
      "comment": "The seal represents God's protective authority; compare marking on foreheads in Ezekiel 9:4. The east (rising sun) alludes to redemption and new creation."
    },
    {
      "pk": 2007003,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 3,
      "text": "saying, 'Do not harm the land or the sea or the trees until we have sealed the servants of our God on their foreheads.'",
      "links": "<a href='/AIV/26/9/6'>Ezek. 9:6</a>; <a href='/AIV/66/14/1'>Rev. 14:1</a>",
      "comment": "God's servants are marked and set apart as a sign of belonging. This seals them against spiritual danger, foreshadowing a fuller spiritual distinction between those who are faithful and those who are not."
    },
    {
      "pk": 2007004,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 4,
      "text": "And I heard the number of those sealed: one hundred forty-four thousand, sealed from every tribe of the sons of Israel:",
      "links": "<a href='/AIV/04/2/32'>Num. 2:32</a>; <a href='/AIV/66/14/3'>Rev. 14:3</a>",
      "comment": "The number 144,000 (12,000 from 12 tribes) symbolizes fullness and perfection of God's people. Some interpret this as literal; others see it as symbolic of all God's faithful people. Note the continuing theme of God's people being chosen and set apart."
    },
    {
      "pk": 2007005,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 5,
      "text": "From the tribe of Judah, twelve thousand sealed; from the tribe of Reuben, twelve thousand; from the tribe of Gad, twelve thousand;",
      "links": "<a href='/AIV/04/1/5'>Num. 1:5-15</a>",
      "comment": "Listing the tribes emphasizes unity and restoration of God's covenant people. Judah first signals messianic fulfillment (Jesus is from Judah: <a href='/AIV/58/7/14'>Heb. 7:14</a>)."
    },
    {
      "pk": 2007006,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 6,
      "text": "From the tribe of Asher, twelve thousand; from the tribe of Naphtali, twelve thousand; from the tribe of Manasseh, twelve thousand;",
      "links": "<a href='/AIV/04/1/27'>Num. 1:27-36</a>",
      "comment": "Manasseh is substituted for Dan, perhaps due to later associations of Dan with idolatry (Judg. 18:30)."
    },
    {
      "pk": 2007007,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 7,
      "text": "From the tribe of Simeon, twelve thousand; from the tribe of Levi, twelve thousand; from the tribe of Issachar, twelve thousand;",
      "links": "<a href='/AIV/04/1/23'>Num. 1:23-50</a>",
      "comment": "Including Levi (the priestly tribe) signals the new order in which all God's people share in holy worship, an idea taken up in the New Testament priesthood of believers (<a href='/AIV/60/2/9'>1 Pet. 2:9</a>)."
    },
    {
      "pk": 2007008,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 8,
      "text": "From the tribe of Zebulun, twelve thousand; from the tribe of Joseph, twelve thousand; from the tribe of Benjamin, twelve thousand sealed.",
      "links": "<a href='/AIV/04/1/36'>Num. 1:36-37</a>",
      "comment": "The tribes are listed without Dan; Joseph stands in for Ephraim, uniting the tribes. This fullness points to the completeness of the Church as God's people."
    },
    {
      "pk": 2007009,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 9,
      "text": "After this I looked, and there was a great multitude that no one could count, from every nation, tribe, people, and language, standing before the throne and before the Lamb, clothed in white robes, with palm branches in their hands.",
      "links": "<a href='/AIV/01/22/18'>Gen. 22:18</a>; <a href='/AIV/66/5/9'>Rev. 5:9</a>; <a href='/AIV/43/12/13'>John 12:13</a>",
      "comment": "The innumerable multitude fulfills promises to Abraham (blessing to all nations - Gen. 22:18) and anticipates the universal reach of salvation. White robes symbolize purity and victory. Palm branches recall the feast of Tabernacles, celebrating deliverance."
    },
    {
      "pk": 2007010,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 10,
      "text": "And they cried out with a loud voice, saying, 'Salvation belongs to our God, who sits on the throne, and to the Lamb!'",
      "links": "<a href='/AIV/19/3/8'>Ps. 3:8</a>; <a href='/AIV/66/5/6'>Rev. 5:6</a>",
      "comment": "The worship offered to both God and the Lamb affirms Christ's divinity and centrality in salvation, a high Christological statement."
    },
    {
      "pk": 2007011,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 11,
      "text": "And all the angels stood around the throne and the elders and the four living creatures, and they fell on their faces before the throne and worshipped God,",
      "links": "<a href='/AIV/66/4/4'>Rev. 4:4</a>; <a href='/AIV/66/5/11'>Rev. 5:11</a>",
      "comment": "Angelic and heavenly worship signifies the continuous and structured nature of liturgical worship in heaven. The elders represent the unified leadership of God's people."
    },
    {
      "pk": 2007012,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 12,
      "text": "saying, 'Amen! Blessing and glory and wisdom and thanksgiving and honor and power and might be to our God forever and ever. Amen.'",
      "links": "<a href='/AIV/19/104/1'>Ps. 104:1</a>; <a href='/AIV/66/5/13'>Rev. 5:13</a>",
      "comment": "Sevenfold praise highlights completeness and the ultimate worthiness of God, a recurring motif in Revelation."
    },
    {
      "pk": 2007013,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 13,
      "text": "Then one of the elders spoke to me, saying, 'Who are these, clothed in white robes, and from where have they come?'",
      "links": "<a href='/AIV/66/6/11'>Rev. 6:11</a>",
      "comment": "Elders as heavenly leaders guide John (and readers) to understand the vision's deeper meaning."
    },
    {
      "pk": 2007014,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 14,
      "text": "And I said to him, 'Sir, you know.' And he said to me, 'These are the ones who have come out of the great tribulation; they have washed their robes and made them white in the blood of the Lamb.'",
      "links": "<a href='/AIV/23/1/18'>Isa. 1:18</a>; <a href='/AIV/66/12/11'>Rev. 12:11</a>",
      "comment": "Washing robes in the blood of the Lamb symbolizes cleansing from sin by Christ's sacrifice—an explicit Christological image fulfilling prophecy (<a href='/AIV/23/53/5'>Isa. 53:5</a>). The great tribulation refers both to specific persecutions and ongoing suffering."
    },
    {
      "pk": 2007015,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 15,
      "text": "Therefore they are before the throne of God and serve him day and night in his temple; and he who sits on the throne will shelter them with his presence.",
      "links": "<a href='/AIV/19/27/4'>Ps. 27:4</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "Unending worship and service in God's presence reflects the promise of a heavenly liturgy. The concept of ongoing worship in a 'temple' points to forms of worship that continue into eternity and alludes to a visible, structured communion with God."
    },
    {
      "pk": 2007016,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 16,
      "text": "They will hunger no more, neither will they thirst anymore; the sun will not strike them, nor any burning heat;",
      "links": "<a href='/AIV/23/49/10'>Isa. 49:10</a>; <a href='/AIV/43/4/14'>John 4:14</a>",
      "comment": "Fulfillment of prophecy (Isa. 49:10); God's people experience full satisfaction in Him. Spiritual and physical needs are forever met in God's kingdom."
    },
    {
      "pk": 2007017,
      "translation": "AIV",
      "book": 66,
      "chapter": 7,
      "verse": 17,
      "text": "For the Lamb in the midst of the throne will be their shepherd, and he will guide them to springs of living water, and God will wipe away every tear from their eyes.",
      "links": "<a href='/AIV/19/23/1'>Ps. 23:1</a>; <a href='/AIV/23/25/8'>Isa. 25:8</a>; <a href='/AIV/43/7/37-38'>John 7:37-38</a>; <a href='/AIV/66/21/4'>Rev. 21:4</a>",
      "comment": "The Lamb as shepherd fulfills <a href='/AIV/19/23/1'>Psalm 23</a> and <a href='/AIV/43/10/11'>John 10:11</a> (Jesus as Good Shepherd). Living water refers to the Holy Spirit and eternal life (<a href='/AIV/43/7/37-39'>John 7:37-39</a>). God’s personal comfort is at the center of eternal life. The close relationship between the Lamb and worshippers suggests a mediated, sacramental communion."
    }
  ],
  "translatedAt": "2025-12-23T04:23:52.032Z"
}