{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 15,
  "verses": [
    {
      "pk": 3000015,
      "translation": "AIV",
      "book": 66,
      "chapter": 15,
      "verse": 1,
      "text": "Then I saw another great and marvelous sign in heaven: seven angels with the seven last plagues, for with them the wrath of God is finished.",
      "links": "<a href='/AIV/66/8/2'>Rev. 8:2</a>; <a href='/AIV/2/7/4'>Exodus 7:4</a>",
      "comment": "John sees a final and definitive stage in God's plan. The idea of completion echoes the seven plagues poured out in Egypt—a pattern of judgment and deliverance. Reference to 'the wrath of God is finished' points to the finality of divine justice."
    },
    {
      "pk": 3000016,
      "translation": "AIV",
      "book": 66,
      "chapter": 15,
      "verse": 2,
      "text": "And I saw what looked like a sea of glass mixed with fire, and standing beside the sea were those who had conquered the beast, its image, and the number of its name. They held harps given to them by God.",
      "links": "<a href='/AIV/66/4/6'>Rev. 4:6</a>; <a href='/AIV/66/13/15-18'>Rev. 13:15-18</a>",
      "comment": "The sea of glass recalls God's majesty and purity (see Rev. 4:6), and the fire suggests purification through trial. The victorious saints, those who resisted evil, are rewarded with harps—echoing worship and victory."
    },
    {
      "pk": 3000017,
      "translation": "AIV",
      "book": 66,
      "chapter": 15,
      "verse": 3,
      "text": "And they sang the song of Moses, the servant of God, and the song of the Lamb, saying, 'Great and marvelous are your works, Lord God Almighty! Just and true are your ways, King of the nations!'",
      "links": "<a href='/AIV/2/15/1'>Ex. 15:1</a>; <a href='/AIV/19/98/1'>Ps. 98:1</a>; <a href='/AIV/66/5/9'>Rev. 5:9</a>",
      "comment": "This dual song unites Old and New Testament deliverance: Moses led God’s people in victory, now Christ (the Lamb) brings ultimate redemption. The saints recognize God as just ruler of all nations—a theme found throughout Scripture."
    },
    {
      "pk": 3000018,
      "translation": "AIV",
      "book": 66,
      "chapter": 15,
      "verse": 4,
      "text": "Who will not fear, O Lord, and glorify your name? For you alone are holy. All nations will come and worship before you, for your righteous acts have been revealed.",
      "links": "<a href='/AIV/19/86/9'>Ps. 86:9</a>; <a href='/AIV/19/98/2'>Ps. 98:2</a>; <a href='/AIV/45/14/11'>Rom. 14:11</a>",
      "comment": "God’s holiness sets Him apart, drawing all nations to worship. This anticipates the fulfillment of prophecy where every knee will bow (see Rom. 14:11), resonating with the universal call to worship rooted in the faith’s ancient tradition."
    },
    {
      "pk": 3000019,
      "translation": "AIV",
      "book": 66,
      "chapter": 15,
      "verse": 5,
      "text": "After this I looked, and the sanctuary of the tent of testimony in heaven was opened.",
      "links": "<a href='/AIV/2/25/21-22'>Ex. 25:21-22</a>; <a href='/AIV/66/11/19'>Rev. 11:19</a>",
      "comment": "The opening of the heavenly sanctuary connects the heavenly reality to the earthly tabernacle, suggesting direct access to the divine presence. This also hints at the continuity of the divine liturgy from Old to New Covenant."
    },
    {
      "pk": 3000020,
      "translation": "AIV",
      "book": 66,
      "chapter": 15,
      "verse": 6,
      "text": "Out of the sanctuary came the seven angels who had the seven plagues, dressed in pure bright linen, with golden sashes around their chests.",
      "links": "<a href='/AIV/66/1/13'>Rev. 1:13</a>; <a href='/AIV/66/19/8'>Rev. 19:8</a>",
      "comment": "The pure linen and golden sashes indicate priestly service and purity. The angels’ attire connects them with Christ’s own high-priestly role (see Rev. 1:13), emphasizing the sacred nature of their mission."
    },
    {
      "pk": 3000021,
      "translation": "AIV",
      "book": 66,
      "chapter": 15,
      "verse": 7,
      "text": "Then one of the four living creatures gave the seven angels seven golden bowls full of the wrath of God, who lives forever and ever.",
      "links": "<a href='/AIV/66/4/6'>Rev. 4:6</a>; <a href='/AIV/66/5/8'>Rev. 5:8</a>",
      "comment": "The golden bowls recall the incense bowls of worship (see Rev. 5:8), but here they are filled with judgment, stressing the seriousness of divine justice. The living creatures continue their role as attendants of God’s throne."
    },
    {
      "pk": 3000022,
      "translation": "AIV",
      "book": 66,
      "chapter": 15,
      "verse": 8,
      "text": "And the sanctuary was filled with smoke from the glory of God and from His power, and no one could enter the sanctuary until the seven plagues of the seven angels were completed.",
      "links": "<a href='/AIV/2/40/34-35'>Ex. 40:34-35</a>; <a href='/AIV/11/8/10-11'>1 Kings 8:10-11</a>",
      "comment": "The filling of the sanctuary with smoke marks God’s glory and presence, barring entry as a sign of awe—just as in the dedication of the tabernacle (Ex. 40:34-35) and the temple (1 Kings 8:10-11). This emphasizes the seriousness of divine actions and a sense of sacred mystery surrounding the fullness of God’s plan, a theme cherished in ancient Christian worship and spirituality."
    }
  ],
  "translatedAt": "2025-12-23T04:26:41.289Z"
}