{
  "book": 73,
  "bookName": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 2,
  "verses": [
    {
      "pk": 73002001,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 1,
      "text": "To the angel of the church in Ephesus write: ‘The One who holds the seven stars in His right hand, who walks among the seven golden lampstands, says this:",
      "links": "<a href='/AIV/73/1/16-20'>Rev 1:16-20</a>; <a href='/AIV/2/25/8'>Exod 25:8,31-40</a>",
      "comment": "The 'seven stars' and 'seven lampstands' represent the church's leaders and communities, echoing the Old Testament imagery of lampstands in the tabernacle (Exod 25). Christ's authority is depicted in His holding of the stars, alluding to divine sovereignty and the ongoing presence with His church."
    },
    {
      "pk": 73002002,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 2,
      "text": "I know your works, your labor and your perseverance, and how you cannot tolerate evil people. You have tested those who claim to be apostles but are not, and found them to be false.",
      "links": "<a href='/AIV/44/20/29-30'>Acts 20:29-30</a>; <a href='/AIV/40/7/15'>Matt 7:15</a>",
      "comment": "Jesus commends discernment and faithfulness in doctrine, warning against false teachers. This underscores the importance of apostolic succession and the unbroken transmission of true teaching."
    },
    {
      "pk": 73002003,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 3,
      "text": "And you have endured, and have persevered for My name's sake, and have not grown weary.",
      "links": "<a href='/AIV/48/6/9'>Gal 6:9</a>; <a href='/AIV/58/12/3'>Heb 12:3</a>",
      "comment": "Faithful endurance is highlighted, recalling Christ’s exhortation to persevere amidst trials, drawing out a spirituality of endurance found throughout the epistles."
    },
    {
      "pk": 73002004,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 4,
      "text": "But I have this against you: you have abandoned the love you had at first.",
      "links": "<a href='/AIV/43/15/12'>John 15:12</a>; <a href='/AIV/54/1/5'>1 Tim 1:5</a>",
      "comment": "A warning that doctrinal correctness must be accompanied by fervent love. The early Christian virtue of charity is necessary alongside truth."
    },
    {
      "pk": 73002005,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 5,
      "text": "Remember then from where you have fallen. Repent, and do the works you did at first. If not, I will come to you and remove your lampstand from its place, unless you repent.",
      "links": "<a href='/AIV/40/5/14-16'>Matt 5:14-16</a>; <a href='/AIV/44/2/38'>Acts 2:38</a>",
      "comment": "Repentance is central, and removal of the lampstand signifies loss of Christ’s presence. The call to conversion and restoration through works aligns with the theme of ongoing sanctification."
    },
    {
      "pk": 73002006,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 6,
      "text": "Yet you have this: you hate the works of the Nicolaitans, which I also hate.",
      "links": "<a href='/AIV/73/2/15'>Rev 2:15</a>",
      "comment": "The Nicolaitans represented a permissive, morally lax sect. Fidelity to truth and uprightness is again emphasized."
    },
    {
      "pk": 73002007,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 7,
      "text": "Whoever has ears, let him hear what the Spirit says to the churches. To the one who overcomes, I will grant to eat from the tree of life, which is in the paradise of God.",
      "links": "<a href='/AIV/1/2/9'>Gen 2:9</a>; <a href='/AIV/73/22/2'>Rev 22:2</a>",
      "comment": "Promise of access to the tree of life recalls Eden, signifying restored communion with God. Overcoming indicates synergy between grace and perseverance."
    },
    {
      "pk": 73002008,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 8,
      "text": "And to the angel of the church in Smyrna write: ‘The First and the Last, who died and came to life, says this:",
      "links": "<a href='/AIV/73/1/17-18'>Rev 1:17-18</a>; <a href='/AIV/23/44/6'>Isa 44:6</a>",
      "comment": "Christ self-identifies with titles of divinity (First and Last), paralleling Yahweh’s claims in Isaiah. Strongly asserts Christ’s divine nature and resurrection."
    },
    {
      "pk": 73002009,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 9,
      "text": "I know your affliction and poverty—yet you are rich!—and the slander of those who claim to be Jews and are not, but are a synagogue of Satan.",
      "links": "<a href='/AIV/59/2/5'>James 2:5</a>; <a href='/AIV/73/3/9'>Rev 3:9</a>",
      "comment": "True wealth is spiritual, not material. Suffering churches are viewed as spiritually blessed. The phrase concerning 'Jews' should be understood in context of spiritual fidelity, not ethnicity."
    },
    {
      "pk": 73002010,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 10,
      "text": "Do not fear what you are about to suffer. Behold, the devil is about to throw some of you into prison to test you, and you will have tribulation for ten days. Remain faithful unto death, and I will give you the crown of life.",
      "links": "<a href='/AIV/59/1/12'>James 1:12</a>; <a href='/AIV/40/24/9'>Matt 24:9</a>",
      "comment": "Trials are inevitable, but perseverance leads to the 'crown of life', a recurring promise of divine reward for martyrdom or endurance."
    },
    {
      "pk": 73002011,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 11,
      "text": "Whoever has ears, let him hear what the Spirit says to the churches. The one who overcomes will not be hurt by the second death.",
      "links": "<a href='/AIV/73/20/6,14'>Rev 20:6,14</a>",
      "comment": "'Second death' means eternal separation from God (see Rev 20). Assurance is given for the faithful to escape final condemnation."
    },
    {
      "pk": 73002012,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 12,
      "text": "And to the angel of the church in Pergamum write: ‘The One who has the sharp, double-edged sword says this:",
      "links": "<a href='/AIV/58/4/12'>Heb 4:12</a>; <a href='/AIV/73/1/16'>Rev 1:16</a>",
      "comment": "The sword represents the penetrating power of Christ’s word and judgment, tied to imagery in Hebrews and Isaiah."
    },
    {
      "pk": 73002013,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 13,
      "text": "I know where you live—where Satan’s throne is—yet you hold fast My name and did not deny your faith in Me, even in the days of Antipas, My faithful witness, who was killed among you, where Satan dwells.",
      "links": "<a href='/AIV/44/22/20'>Acts 22:20</a>; <a href='/AIV/73/3/8'>Rev 3:8</a>",
      "comment": "Confession of Christ amid persecution is praised, showing the power of martyrdom and the witness of the faith even under the worst circumstances."
    },
    {
      "pk": 73002014,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 14,
      "text": "But I have a few things against you: there are some among you who hold to the doctrine of Balaam, who taught Balak to set a trap before the sons of Israel, to eat food sacrificed to idols and to commit sexual immorality.",
      "links": "<a href='/AIV/4/25/1-2'>Num 25:1-2</a>; <a href='/AIV/4/31/16'>Num 31:16</a>",
      "comment": "Reference to Balaam connects Old Testament rebellion and idolatry to New Testament corruption; highlights a persistent danger."
    },
    {
      "pk": 73002015,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 15,
      "text": "So you also have some who hold to the doctrine of the Nicolaitans likewise.",
      "links": "<a href='/AIV/73/2/6'>Rev 2:6</a>",
      "comment": "Repeat mention of Nicolaitans stresses that heresy and moral laxity must not be tolerated in the communion of believers."
    },
    {
      "pk": 73002016,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 16,
      "text": "Repent therefore. Otherwise, I will come to you quickly and fight against them with the sword of My mouth.",
      "links": "<a href='/AIV/23/11/4'>Isa 11:4</a>; <a href='/AIV/58/4/12'>Heb 4:12</a>",
      "comment": "The sword of Christ’s mouth is an image drawn from Isaiah and Hebrews, referring to the authoritative, defining word of divine judgment."
    },
    {
      "pk": 73002017,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 17,
      "text": "Whoever has ears, let him hear what the Spirit says to the churches. To the one who overcomes, I will give the hidden manna, and I will give him a white stone, and on the stone a new name written, which no one knows except the one who receives it.",
      "links": "<a href='/AIV/2/16/15'>Exod 16:15'>Exod 16:15</a>; <a href='/AIV/43/6/31-33'>John 6:31-33</a>",
      "comment": "‘Hidden manna’ recalls both the heavenly bread given to Israel and Christ’s eucharistic discourse (John 6), symbolizing supernatural sustenance reserved for the faithful."
    },
    {
      "pk": 73002018,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 18,
      "text": "And to the angel of the church in Thyatira write: ‘The Son of God, who has eyes like a flame of fire, and whose feet are like burnished bronze, says this:",
      "links": "<a href='/AIV/73/1/14-15'>Rev 1:14-15</a>; <a href='/AIV/27/10/6'>Dan 10:6</a>",
      "comment": "'Son of God' is an explicit Christological title, underscoring the divinity of Jesus. The fiery eyes and bronze feet echo Daniel, symbolizing judgment and purity."
    },
    {
      "pk": 73002019,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 19,
      "text": "I know your works, your love and faith, your service and perseverance, and that your latter works exceed your first.",
      "links": "<a href='/AIV/54/1/5'>1 Tim 1:5</a>; <a href='/AIV/59/2/17'>James 2:17</a>",
      "comment": "Praise is given for spiritual growth and increasing virtue, indicating sanctification is a lifelong process."
    },
    {
      "pk": 73002020,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 20,
      "text": "But I have this against you: you tolerate that woman Jezebel, who calls herself a prophetess, and teaches and leads My servants astray to commit sexual immorality and to eat food sacrificed to idols.",
      "links": "<a href='/AIV/11/16/31'>1 Kings 16:31</a>; <a href='/AIV/4/25/2'>Num 25:2</a>",
      "comment": "Comparison to Jezebel invokes Old Testament imagery of idolatry and corruption, warning against deceptive or self-appointed spiritual authorities."
    },
    {
      "pk": 73002021,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 21,
      "text": "I gave her time to repent, but she refuses to repent of her sexual immorality.",
      "links": "<a href='/AIV/10/12/13'>2 Sam 12:13</a>; <a href='/AIV/26/18/32'>Ezek 18:32</a>",
      "comment": "Divine patience is shown, but persistent refusal to repent leads to severe consequence, affirming the necessity of conversion."
    },
    {
      "pk": 73002022,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 22,
      "text": "Look, I am casting her onto a sickbed, and those who commit adultery with her will undergo great tribulation, unless they repent of her works.",
      "links": "<a href='/AIV/23/57/3'>Isa 57:3</a>; <a href='/AIV/26/23/37'>Ezek 23:37</a>",
      "comment": "Judgment is both temporal and spiritual, with hope for restoration held out through repentance."
    },
    {
      "pk": 73002023,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 23,
      "text": "And I will kill her children with pestilence, and all the churches will know that I am He who searches minds and hearts, and I will give to each of you according to your works.",
      "links": "<a href='/AIV/24/17/10'>Jer 17:10</a>; <a href='/AIV/19/7/9'>Ps 7:9</a>",
      "comment": "Jesus affirms knowledge of inner life, and rewards each according to their works, demonstrating divine justice and omniscience."
    },
    {
      "pk": 73002024,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 24,
      "text": "But to the rest of you in Thyatira, who do not hold to this teaching, who have not known the deep things of Satan, as they call them—I say, I do not put any other burden on you.",
      "links": "<a href='/AIV/44/15/28'>Acts 15:28</a>",
      "comment": "Affirmation that faithful believers are not weighed down with unnecessary burdens (cf. Acts 15), again highlighting mercy and compassion."
    },
    {
      "pk": 73002025,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 25,
      "text": "Only hold fast what you have until I come.",
      "links": "<a href='/AIV/54/6/12'>1 Tim 6:12</a>",
      "comment": "Exhortation to persevere until Christ’s return, emphasizing hope and the tangible expectation of parousia."
    },
    {
      "pk": 73002026,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 26,
      "text": "To the one who overcomes and keeps My works to the end, I will give authority over the nations.",
      "links": "<a href='/AIV/19/2/8-9'>Ps 2:8-9</a>; <a href='/AIV/40/19/28'>Matt 19:28</a>",
      "comment": "Promise of authority echoes messianic Psalm 2 and Christ’s promises to the apostles. The faithful will share in Christ’s kingship and rulership."
    },
    {
      "pk": 73002027,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 27,
      "text": "And he will rule them with an iron rod, as vessels of clay are shattered—just as I also received authority from My Father.",
      "links": "<a href='/AIV/19/2/9'>Ps 2:9</a>; <a href='/AIV/41/13/34'>Mark 13:34</a>",
      "comment": "Christ shares His authority with victorious believers, connecting back to His own reception of authority from the Father, a high Christological claim."
    },
    {
      "pk": 73002028,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 28,
      "text": "And I will give him the morning star.",
      "links": "<a href='/AIV/73/22/16'>Rev 22:16</a>; <a href='/AIV/4/24/17'>Num 24:17</a>",
      "comment": "The 'morning star' is Christ Himself, associated with messianic prophecy in Numbers and self-identification in Revelation."
    },
    {
      "pk": 73002029,
      "translation": "AIV",
      "book": 73,
      "bookName": "Revelation",
      "bookAbbreviation": "Rev",
      "chapter": 2,
      "verse": 29,
      "text": "Whoever has ears, let him hear what the Spirit says to the churches.",
      "links": "<a href='/AIV/41/4/9'>Mark 4:9</a>; <a href='/AIV/73/2/7'>Rev 2:7</a>",
      "comment": "Repeated exhortation to listen spiritually, reinforcing the unity and universality of Christ’s message and its ongoing relevance."
    }
  ],
  "translatedAt": "2025-12-24T12:33:55.872Z"
}