{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 9,
  "verses": [
    {
      "pk": 2009001,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 1,
      "text": "Then the fifth angel sounded his trumpet, and I saw a star fallen from heaven to earth, and to him was given the key to the shaft of the Abyss.",
      "links": "<a href='/AIV/23/14/12'>Isa. 14:12</a>; <a href='/AIV/42/10/18'>Luke 10:18</a>",
      "comment": "The star fallen from heaven represents a powerful angel, possibly Satan or another fallen angel, given temporary authority over the Abyss. This fulfills imagery found in Isaiah and echoes Jesus' words in Luke about the fall of Satan."
    },
    {
      "pk": 2009002,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 2,
      "text": "He opened the shaft of the Abyss, and smoke rose out from the shaft like the smoke of a great furnace; the sun and the air were darkened by the smoke from the shaft.",
      "links": "<a href='/AIV/02/19/18'>Ex. 19:18</a>; <a href='/AIV/29/2/10'>Joel 2:10</a>",
      "comment": "The imagery of darkening through smoke recalls Old Testament symbols of judgment and the spiritual consequences of rebellion."
    },
    {
      "pk": 2009003,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 3,
      "text": "Out of the smoke came locusts upon the earth, and they were given power like the scorpions of the earth.",
      "links": "<a href='/AIV/02/10/12'>Ex. 10:12–15</a>",
      "comment": "These are not ordinary locusts, but symbolic agents of judgment with power to torment. The reference to scorpions suggests severe spiritual and psychological pain."
    },
    {
      "pk": 2009004,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 4,
      "text": "They were instructed not to harm the grass of the earth or any green plant or tree, but only those people who do not have the seal of God on their foreheads.",
      "links": "<a href='/AIV/66/7/3'>Rev. 7:3</a>; <a href='/AIV/26/9/4'>Ezek. 9:4</a>",
      "comment": "The protected ones resemble the marked faithful in Ezekiel. The seal suggests spiritual protection granted through God's authority, hinting at a visible sign of belonging to His people."
    },
    {
      "pk": 2009005,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 5,
      "text": "They were not allowed to kill them, but to torment them for five months. Their torment was like the torment of a scorpion when it stings a person.",
      "links": "<a href='/AIV/66/6/8'>Rev. 6:8</a>",
      "comment": "Limitation in duration and intensity shows God's sovereignty even in suffering, with five months echoing the typical lifespan of a locust swarm."
    },
    {
      "pk": 2009006,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 6,
      "text": "During those days, people will seek death and will not find it. They will long to die, but death will flee from them.",
      "links": "<a href='/AIV/18/3/21'>Job 3:21</a>",
      "comment": "Extreme suffering leads to despair, a common biblical consequence of divine judgment; still, escape is not permitted."
    },
    {
      "pk": 2009007,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 7,
      "text": "The appearance of the locusts was like horses prepared for battle; on their heads were something like gold crowns, and their faces were like human faces.",
      "links": "<a href='/AIV/29/2/4'>Joel 2:4</a>",
      "comment": "Their unnatural features emphasize their supernatural origin, blending earthly and demonic attributes."
    },
    {
      "pk": 2009008,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 8,
      "text": "They had hair like women’s hair and teeth like lions’ teeth.",
      "links": "<a href='/AIV/07/16/19'>Judg. 16:19</a>; <a href='/AIV/29/1/6'>Joel 1:6</a>",
      "comment": "The mixture of seductive and ferocious traits underlines their capacity to entice and destroy."
    },
    {
      "pk": 2009009,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 9,
      "text": "They had breastplates like breastplates of iron, and the sound of their wings was like the sound of many chariots with horses rushing into battle.",
      "links": "<a href='/AIV/29/2/5'>Joel 2:5</a>",
      "comment": "The terrifying sound signals overwhelming assault, recalling prophetic warnings of overwhelming armies."
    },
    {
      "pk": 2009010,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 10,
      "text": "They have tails and stings like scorpions, and in their tails is their power to hurt people for five months.",
      "links": "<a href='/AIV/66/9/5'>Rev. 9:5</a>",
      "comment": "Five months duration and the repeating scorpion imagery stress that this torment is deliberate but limited, permitted by divine authority."
    },
    {
      "pk": 2009011,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 11,
      "text": "They have as king over them the angel of the Abyss; his name in Hebrew is Abaddon and in Greek he is called Apollyon.",
      "links": "<a href='/AIV/20/15/11'>Proverbs 15:11</a>",
      "comment": "Abaddon/Apollyon means Destroyer, personifying the power of death and destruction but still under the limits set by God."
    },
    {
      "pk": 2009012,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 12,
      "text": "The first woe has passed; behold, two woes are still to come after this.",
      "links": "<a href='/AIV/66/8/13'>Rev. 8:13</a>",
      "comment": "The progression of woes structures the intensity of judgment, heightening the anticipation for deeper revelations."
    },
    {
      "pk": 2009013,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 13,
      "text": "Then the sixth angel sounded his trumpet, and I heard a voice from the four horns of the golden altar before God.",
      "links": "<a href='/AIV/02/27/2'>Ex. 27:2</a>; <a href='/AIV/66/8/3'>Rev. 8:3'</a>",
      "comment": "Horned altars indicate places of sacrifice and prayer in the Temple, highlighting the role of heavenly liturgy, fulfillment of Old Testament worship practices in the heavenly realm."
    },
    {
      "pk": 2009014,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 14,
      "text": "The voice said to the sixth angel who had the trumpet, 'Release the four angels who are bound at the great river Euphrates.'",
      "links": "<a href='/AIV/01/2/14'>Gen. 2:14</a>; <a href='/AIV/24/46/2'>Jer. 46:2'</a>",
      "comment": "The Euphrates marks ancient boundaries of Israel, often associated with judgment from the north. The four angels likely represent destructive powers restrained until this set moment."
    },
    {
      "pk": 2009015,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 15,
      "text": "So the four angels, who had been kept ready for this hour, day, month, and year, were released to kill a third of mankind.",
      "links": "<a href='/AIV/66/8/7-12'>Rev. 8:7–12</a>",
      "comment": "Divine timing is emphasized; no event is random but conforms to God’s eternal providence. Judgments are allowed but measured."
    },
    {
      "pk": 2009016,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 16,
      "text": "The number of mounted troops was twice ten thousand times ten thousand; I heard their number.",
      "links": "<a href='/AIV/19/68/17'>Ps. 68:17</a>",
      "comment": "The immense army (200 million) underscores the magnitude of coming judgment, an incomprehensible force as described in Psalm imagery."
    },
    {
      "pk": 2009017,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 17,
      "text": "This is how I saw the horses and their riders in the vision: they wore breastplates that were fiery red, blue as sapphire, and yellow as sulfur. The heads of the horses were like lions’ heads, and out of their mouths came fire, smoke, and sulfur.",
      "links": "<a href='/AIV/01/19/24'>Gen. 19:24</a>; <a href='/AIV/66/14/10'>Rev. 14:10</a>",
      "comment": "Imagery combines ferocity, judgment, and the elements of divine wrath as seen in the destruction of Sodom, echoing both Old and New Testament pictures of purified vengeance."
    },
    {
      "pk": 2009018,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 18,
      "text": "A third of mankind was killed by these three plagues—by the fire and the smoke and the sulfur coming out of their mouths.",
      "links": "<a href='/AIV/66/9/15'>Rev. 9:15</a>; <a href='/AIV/02/7/17'>Ex. 7:17</a>",
      "comment": "The plagues recall those sent against Egypt, demonstrating God’s power to judge and punish decisively in history."
    },
    {
      "pk": 2009019,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 19,
      "text": "For the power of the horses is in their mouths and in their tails; their tails are like serpents, having heads, and with them they injure.",
      "links": "<a href='/AIV/04/21/9'>Num. 21:9</a>",
      "comment": "Serpentine tails recall Old Testament themes of judgment through fiery serpents; these supernatural agents execute authority through both word (mouth) and action (tail)."
    },
    {
      "pk": 2009020,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 20,
      "text": "The rest of mankind who were not killed by these plagues did not repent of the works of their hands, nor did they stop worshiping demons and idols of gold, silver, bronze, stone, and wood, which cannot see, hear, or walk.",
      "links": "<a href='/AIV/19/115/4-7'>Ps. 115:4–7</a>; <a href='/AIV/45/1/21-23'>Rom. 1:21–23</a>",
      "comment": "Persistence in idol worship in spite of judgment echoes both Psalm and Pauline theology, showing the depth of human stubbornness. Repentance is connected throughout Scripture with the need for sacramental conversion and turning from falsehood to truth."
    },
    {
      "pk": 2009021,
      "translation": "AIV",
      "book": 66,
      "chapter": 9,
      "verse": 21,
      "text": "Nor did they repent of their murders or their sorceries or their sexual immorality or their thefts.",
      "links": "<a href='/AIV/19/106/37-39'>Ps. 106:37–39</a>; <a href='/AIV/48/5/19-21'>Gal. 5:19–21</a>",
      "comment": "Unrepentance in grave sins is a recurring biblical warning. The gravity of these sins is traditionally addressed through sincere conversion, confession, and a life shaped by faithfulness and sacramental grace."
    }
  ],
  "translatedAt": "2025-12-23T04:24:27.180Z"
}