{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 19,
  "verses": [
    {
      "pk": 996301,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 1,
      "text": "After this I heard what seemed to be the loud voice of a great multitude in heaven, crying out, \"Hallelujah! Salvation and glory and power belong to our God,\"",
      "links": "<a href='/AIV/19/104/35'>Ps. 104:35</a>; <a href='/AIV/19/145/17'>Ps. 145:17</a>",
      "comment": "\"Hallelujah\" is a term of praise meaning \"Praise the Lord.\" The worship of God by the heavenly multitude stresses His sovereignty and glory, echoing the psalms."
    },
    {
      "pk": 996302,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 2,
      "text": "for his judgments are true and just; for he has judged the great prostitute who corrupted the earth with her immorality, and he has avenged the blood of his servants at her hand.\"",
      "links": "<a href='/AIV/24/51/25'>Jer. 51:25</a>; <a href='/AIV/05/32/43'>Deut. 32:43</a>; <a href='/AIV/66/17/1'>Rev. 17:1</a>",
      "comment": "The imagery of the 'great prostitute' represents both literal and symbolic opposition to God's people. God's justice is shown in the vindication of His saints, similar to OT prophecies of judgment against Babylon."
    },
    {
      "pk": 996303,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 3,
      "text": "Again they cried out, \"Hallelujah! The smoke from her goes up forever and ever.\"",
      "links": "<a href='/AIV/23/34/10'>Isa. 34:10</a>; <a href='/AIV/19/104/35'>Ps. 104:35</a>; <a href='/AIV/66/14/11'>Rev. 14:11</a>",
      "comment": "The eternal rising of smoke signifies the completeness and permanence of God's judgment. Parallels can be seen in the destruction of Edom (Isaiah 34)."
    },
    {
      "pk": 996304,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 4,
      "text": "And the twenty-four elders and the four living creatures fell down and worshiped God, who was seated on the throne, saying, \"Amen. Hallelujah!\"",
      "links": "<a href='/AIV/66/4/4'>Rev. 4:4</a>; <a href='/AIV/66/5/8'>Rev. 5:8</a>",
      "comment": "The twenty-four elders symbolize the fullness of God’s redeemed people, combining the twelve tribes and twelve apostles. This shows the unity and continuity of God’s covenant family."
    },
    {
      "pk": 996305,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 5,
      "text": "And a voice came from the throne, saying, \"Praise our God, all you his servants, you who fear him, small and great.\"",
      "links": "<a href='/AIV/19/115/13'>Ps. 115:13</a>; <a href='/AIV/66/18/20'>Rev. 18:20</a>",
      "comment": "The call to praise includes all of God's people, emphasizing that worship is due from all ranks and nations."
    },
    {
      "pk": 996306,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 6,
      "text": "Then I heard what seemed to be the voice of a great multitude, like the roar of many waters and like mighty peals of thunder, crying out, \"Hallelujah! For the Lord our God the Almighty reigns.\"",
      "links": "<a href='/AIV/19/93/1'>Ps. 93:1</a>; <a href='/AIV/66/1/8'>Rev. 1:8</a>",
      "comment": "God's kingship is proclaimed in absolute terms, connecting to the Old Testament declarations of His reign and power over all creation."
    },
    {
      "pk": 996307,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 7,
      "text": "\"Let us rejoice and be glad and give him glory, for the marriage of the Lamb has come, and his bride has made herself ready.\"",
      "links": "<a href='/AIV/40/22/2'>Matt. 22:2</a>; <a href='/AIV/66/21/2'>Rev. 21:2</a>",
      "comment": "The marriage imagery shows Christ’s union with His people, often interpreted as the ultimate fulfillment of God’s covenant promises. The Lamb is a reference to Jesus (see John 1:29)."
    },
    {
      "pk": 996308,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 8,
      "text": "\"She was given to be clothed in fine linen, bright and pure\"—for the fine linen is the righteous deeds of the saints.",
      "links": "<a href='/AIV/23/61/10'>Isa. 61:10</a>; <a href='/AIV/66/3/5'>Rev. 3:5</a>",
      "comment": "The 'fine linen' imagery stresses both God's gift (grace) and the saints’ cooperation with that gift via righteous living. The symbolic connection between faith and visible works is prominent."
    },
    {
      "pk": 996309,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 9,
      "text": "And the angel said to me, \"Write this: Blessed are those who are invited to the marriage supper of the Lamb.\" And he said to me, \"These are the true words of God.\"",
      "links": "<a href='/AIV/40/8/11'>Matt. 8:11</a>; <a href='/AIV/42/14/15'>Luke 14:15</a>",
      "comment": "The invitation reflects the blessedness of eternal communion with Christ. Christ's supper links to both the Eucharistic meal and the heavenly banquet."
    },
    {
      "pk": 996310,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 10,
      "text": "Then I fell at his feet to worship him, but he said to me, \"You must not do that! I am a fellow servant with you and with your brothers who hold the testimony of Jesus. Worship God! For the testimony of Jesus is the spirit of prophecy.\"",
      "links": "<a href='/AIV/44/10/26'>Acts 10:26</a>; <a href='/AIV/66/22/8-9'>Rev. 22:8–9</a>",
      "comment": "True worship belongs to God alone, not to angels. The testimony of Jesus is central to all prophecy, highlighting the unity of faith and revelation."
    },
    {
      "pk": 996311,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 11,
      "text": "Then I saw heaven opened, and behold, a white horse! The one sitting on it is called Faithful and True, and in righteousness he judges and wages war.",
      "links": "<a href='/AIV/66/6/2'>Rev. 6:2</a>; <a href='/AIV/23/11/4'>Isa. 11:4</a>",
      "comment": "The white horse and its rider represent Christ as the righteous judge and warrior, fulfilling messianic prophecy and New Testament teaching."
    },
    {
      "pk": 996312,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 12,
      "text": "His eyes are like a flame of fire, and on his head are many crowns, and he has a name written that no one knows but himself.",
      "links": "<a href='/AIV/66/1/14'>Rev. 1:14</a>; <a href='/AIV/23/62/2'>Isa. 62:2</a>",
      "comment": "The flame of fire symbolizes divine insight and judgment. The secret name points to the mystery of Christ's person, which surpasses human understanding."
    },
    {
      "pk": 996313,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 13,
      "text": "He is clothed in a robe dipped in blood, and the name by which he is called is The Word of God.",
      "links": "<a href='/AIV/23/63/2-3'>Isa. 63:2–3</a>; <a href='/AIV/43/1/1'>John 1:1</a>",
      "comment": "The blood-soaked robe alludes to both judgment and the sacrifice of the Messiah. Referring to Christ as 'The Word of God' ties this passage closely to John 1, emphasizing Jesus' divinity."
    },
    {
      "pk": 996314,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 14,
      "text": "And the armies of heaven, arrayed in fine linen, white and clean, were following him on white horses.",
      "links": "<a href='/AIV/66/17/14'>Rev. 17:14</a>; <a href='/AIV/19/149/5'>Ps. 149:5</a>",
      "comment": "These armies symbolize the saints and angels sharing in Christ’s victory, dressed in purity reflective of their redemption."
    },
    {
      "pk": 996315,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 15,
      "text": "From his mouth comes a sharp sword with which to strike down the nations, and he will rule them with a rod of iron. He treads the winepress of the fury of the wrath of God the Almighty.",
      "links": "<a href='/AIV/19/2/9'>Ps. 2:9</a>; <a href='/AIV/23/63/3'>Isa. 63:3</a>; <a href='/AIV/66/2/27'>Rev. 2:27</a>",
      "comment": "The sword of the mouth represents the power of Christ’s word in judgment. Ruling with a rod of iron fulfills the Messianic prophecy of Psalm 2."
    },
    {
      "pk": 996316,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 16,
      "text": "On his robe and on his thigh he has a name written: King of kings and Lord of lords.",
      "links": "<a href='/AIV/17/6/8'>Dan. 6:8</a>; <a href='/AIV/54/6/15'>1 Tim. 6:15</a>",
      "comment": "This is the ultimate Christological title, expressing the absolute sovereignty and authority of Christ over all rulers and powers."
    },
    {
      "pk": 996317,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 17,
      "text": "Then I saw an angel standing in the sun, and with a loud voice he called to all the birds flying in midheaven, \"Come, gather for the great supper of God,\"",
      "links": "<a href='/AIV/26/39/17-20'>Ezek. 39:17–20</a>; <a href='/AIV/40/24/28'>Matt. 24:28</a>",
      "comment": "The imagery is drawn from Ezekiel's vision of judgment, reinforcing the completeness of God’s victory over His enemies."
    },
    {
      "pk": 996318,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 18,
      "text": "\"to eat the flesh of kings, the flesh of commanders, the flesh of mighty men, the flesh of horses and their riders, and the flesh of all, both free and slave, small and great.\"",
      "links": "<a href='/AIV/26/39/18-20'>Ezek. 39:18–20</a>",
      "comment": "All levels of society are included in the judgment, showing no one is exempt from divine justice."
    },
    {
      "pk": 996319,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 19,
      "text": "Then I saw the beast and the kings of the earth with their armies gathered to make war against him who sat on the horse and against his army.",
      "links": "<a href='/AIV/66/16/14'>Rev. 16:14</a>; <a href='/AIV/19/2/2'>Ps. 2:2</a>",
      "comment": "This depicts the climax of opposition to Christ, recalling the gathering for battle in Psalm 2 and previous visions in Revelation."
    },
    {
      "pk": 996320,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 20,
      "text": "And the beast was captured, and with it the false prophet who performed the signs by which he deceived those who had received the mark of the beast and worshiped its image. These two were thrown alive into the lake of fire that burns with sulfur.",
      "links": "<a href='/AIV/66/13/13-14'>Rev. 13:13–14</a>; <a href='/AIV/66/20/10'>Rev. 20:10</a>",
      "comment": "The lake of fire is the final and total defeat of evil. The narrative affirms ultimate justice and the reality of eternal punishment."
    },
    {
      "pk": 996321,
      "translation": "AIV",
      "book": 66,
      "chapter": 19,
      "verse": 21,
      "text": "And the rest were slain by the sword that came from the mouth of him who sat on the horse, and all the birds were filled with their flesh.",
      "links": "<a href='/AIV/23/11/4'>Isa. 11:4</a>; <a href='/AIV/26/39/17-20'>Ezek. 39:17–20</a>",
      "comment": "Christ’s word brings decisive judgment. The passage closes with complete victory, reminding the reader that surrender and unity with Christ are the only sure path to salvation."
    }
  ],
  "translatedAt": "2025-12-23T04:28:31.670Z"
}