{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 17,
  "verses": [
    {
      "pk": 501701,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 1,
      "text": "Then one of the seven angels who had the seven bowls came and spoke with me, saying, \"Come, I will show you the judgment of the great prostitute who sits upon many waters.\"",
      "links": "<a href='/AIV/24/51/13'>Jer. 51:13</a>; <a href='/AIV/66/16/19'>Rev. 16:19</a>",
      "comment": "The 'great prostitute' is widely understood as a symbol of corrupt worldliness and spiritual adultery. The 'many waters' recalls Jeremiah's prophecy against Babylon, linking to Old Testament imagery of nations and peoples."
    },
    {
      "pk": 501702,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 2,
      "text": "With whom the kings of the earth committed sexual immorality, and those who inhabit the earth became drunk with the wine of her sexual immorality.",
      "links": "<a href='/AIV/23/1/21'>Isa. 1:21</a>; <a href='/AIV/66/18/3'>Rev. 18:3</a>",
      "comment": "Sexual immorality is often used symbolically in scripture for idolatry and unfaithfulness to God. This verse also draws upon prophetic language of betrayal by nations."
    },
    {
      "pk": 501703,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 3,
      "text": "And he carried me away in the Spirit into a wilderness. And I saw a woman sitting on a scarlet beast, full of blasphemous names, with seven heads and ten horns.",
      "links": "<a href='/AIV/66/13/1'>Rev. 13:1</a>; <a href='/AIV/27/7/7'>Dan. 7:7</a>",
      "comment": "The scarlet beast mirrors earlier visions in Daniel and Revelation, representing global powers opposed to God. The woman's placement atop the beast shows a close alliance with these hostile powers."
    },
    {
      "pk": 501704,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 4,
      "text": "The woman was clothed in purple and scarlet, and adorned with gold, precious stones, and pearls, holding a golden cup in her hand full of abominations and the impurities of her sexual immorality.",
      "links": "<a href='/AIV/24/51/7'>Jer. 51:7</a>; <a href='/AIV/66/18/16'>Rev. 18:16</a>",
      "comment": "Her lavish clothing and cup recall the opulence of ancient empires, often condemned for leading others into spiritual downfall."
    },
    {
      "pk": 501705,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 5,
      "text": "And on her forehead was written a name — a mystery: \"Babylon the Great, the mother of prostitutes and of the abominations of the earth.\"",
      "links": "<a href='/AIV/24/50/2'>Jer. 50:2</a>; <a href='/AIV/66/14/8'>Rev. 14:8</a>",
      "comment": "The title on her forehead identifies her with the infamous spiritual and moral corruption associated with Babylon in Old Testament prophecy."
    },
    {
      "pk": 501706,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 6,
      "text": "And I saw that the woman was drunk with the blood of the saints and with the blood of those who bear witness to Jesus. And when I saw her, I was greatly astonished.",
      "links": "<a href='/AIV/66/6/9'>Rev. 6:9</a>; <a href='/AIV/66/18/24'>Rev. 18:24</a>",
      "comment": "Her persecution of followers of Christ highlights the reality of martyrdom and opposition the Church confronted historically and spiritually."
    },
    {
      "pk": 501707,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 7,
      "text": "But the angel said to me, \"Why are you astonished? I will tell you the mystery of the woman and of the beast that carries her, which has seven heads and ten horns.\"",
      "links": "<a href='/AIV/66/13/1'>Rev. 13:1</a>; <a href='/AIV/27/7/7'>Dan. 7:7</a>",
      "comment": "The angel promises to unveil the spiritual meaning and underlying reality of these symbols, offering a deeper theological interpretation for the reader."
    },
    {
      "pk": 501708,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 8,
      "text": "The beast that you saw was, and is not, and is about to rise out of the abyss and go to destruction. And those who dwell on the earth whose names are not written in the book of life from the foundation of the world will be amazed when they see the beast, for it was and is not and yet will be present.",
      "links": "<a href='/AIV/66/11/7'>Rev. 11:7</a>; <a href='/AIV/66/13/3'>Rev. 13:3</a>",
      "comment": "The animal’s apparent death and revival may symbolize recurring cycles of evil in history, while the reference to the book of life recalls God's eternal election (<a href='/AIV/66/13/8'>Rev. 13:8</a>)."
    },
    {
      "pk": 501709,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 9,
      "text": "Here is understanding for one who has wisdom: The seven heads are seven mountains on which the woman sits. They are also seven kings.",
      "links": "<a href='/AIV/24/51/25'>Jer. 51:25</a>; <a href='/AIV/66/13/1'>Rev. 13:1</a>",
      "comment": "The dual interpretation of the seven heads as mountains and kings connects both to geographical and political realities in prophecy, signifying the pervasive influence of sin and corruption in worldly kingdoms."
    },
    {
      "pk": 501710,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 10,
      "text": "Five have fallen, one remains, the other has not yet come; and when he does come, he must remain for a short time.",
      "links": "<a href='/AIV/27/2/37-45'>Dan. 2:37–45</a>; <a href='/AIV/27/7/24'>Dan. 7:24</a>",
      "comment": "The succession of kings refers to a series of ruling powers that align with parallel visions in Daniel, suggesting God's sovereignty over history."
    },
    {
      "pk": 501711,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 11,
      "text": "The beast that was and is not — he himself is the eighth, but belongs with the seven, and goes to destruction.",
      "links": "<a href='/AIV/66/13/14'>Rev. 13:14</a>; <a href='/AIV/66/19/20'>Rev. 19:20</a>",
      "comment": "The paradoxical nature of the beast alludes to a destructive power that keeps resurfacing among the rulers of history."
    },
    {
      "pk": 501712,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 12,
      "text": "The ten horns that you saw are ten kings who have not yet received a kingdom, but they will receive authority as kings for one hour, together with the beast.",
      "links": "<a href='/AIV/27/7/24'>Dan. 7:24</a>; <a href='/AIV/66/12/3'>Rev. 12:3</a>",
      "comment": "Ten horns as ten kings continues Daniel’s symbolic imagery, pointing to the temporary and fleeting nature of worldly power."
    },
    {
      "pk": 501713,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 13,
      "text": "These have one purpose and they give their power and authority to the beast.",
      "links": "<a href='/AIV/66/13/7'>Rev. 13:7</a>",
      "comment": "This verse illustrates a unity against God, as nations join in opposition through their shared allegiance to evil. Such rebellion sets the stage for ultimate divine judgment."
    },
    {
      "pk": 501714,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 14,
      "text": "They will make war with the Lamb, but the Lamb will conquer them, for he is Lord of lords and King of kings, and those with him are called and chosen and faithful.",
      "links": "<a href='/AIV/66/19/16'>Rev. 19:16</a>; <a href='/AIV/55/2/12'>2 Tim. 2:12</a>; <a href='/AIV/02/19/5'>Ex. 19:5–6</a>",
      "comment": "Here Christ is shown as sovereign over all, fulfilling prophecy of the Messiah’s triumph. The terms \"called, chosen, and faithful\" echo the Church's distinct vocation, both in spiritual and visible unity."
    },
    {
      "pk": 501715,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 15,
      "text": "And he said to me, \"The waters that you saw, where the prostitute sits, are peoples, multitudes, nations, and languages.\"",
      "links": "<a href='/AIV/24/51/13'>Jer. 51:13</a>; <a href='/AIV/66/13/1'>Rev. 13:1</a>",
      "comment": "This symbolism points to the pervasive reach of spiritual corruption over all the earth, recalling how all nations can be affected by the lure of sin."
    },
    {
      "pk": 501716,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 16,
      "text": "The ten horns that you saw, and the beast, will hate the prostitute; they will strip her bare, eat her flesh, and burn her with fire.",
      "links": "<a href='/AIV/26/23/25'>Ezek. 23:25–29</a>; <a href='/AIV/24/50/26'>Jer. 50:26</a>",
      "comment": "Divine judgment comes even from those in alliance with evil; sin ultimately consumes itself. The imagery here echoes Old Testament judgments on idolatrous cities and powers."
    },
    {
      "pk": 501717,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 17,
      "text": "For God has put it into their hearts to carry out his purpose by being of one mind and giving their royal power to the beast until the words of God are fulfilled.",
      "links": "<a href='/AIV/20/21/1'>Prov. 21:1</a>; <a href='/AIV/66/10/7'>Rev. 10:7</a>",
      "comment": "God’s sovereignty governs even the machinations of evil, using them for His ultimate design and fulfillment of prophecy. Unity in purpose, even for destructive ends, occurs within God’s providential control."
    },
    {
      "pk": 501718,
      "translation": "AIV",
      "book": 66,
      "chapter": 17,
      "verse": 18,
      "text": "And the woman that you saw is the great city that has dominion over the kings of the earth.",
      "links": "<a href='/AIV/27/4/30'>Dan. 4:30</a>; <a href='/AIV/66/18/10'>Rev. 18:10</a>",
      "comment": "Identified as both a literal city and a spiritual power, her dominion reflects the enduring struggle between God’s kingdom and the allure of worldly authority. The Church throughout history is called to resist such temptation and live faithfully under Christ’s reign."
    }
  ],
  "translatedAt": "2025-12-23T04:27:26.561Z"
}