{
  "book": "Revelation",
  "bookAbbreviation": "Rev",
  "chapter": 6,
  "verses": [
    {
      "pk": 663060,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 1,
      "text": "Then I watched when the Lamb opened one of the seven seals, and I heard one of the four living creatures say with a voice like thunder, \"Come!\"",
      "links": "<a href='/AIV/66/5/5-9'>Rev. 5:5-9</a>; <a href='/AIV/26/1/10'>Ezek. 1:10</a>",
      "comment": "The Lamb here is clearly Christ, who alone has authority to judge (see Rev. 5:5-9). The command 'Come!' is an invitation to observe God’s unfolding plan of judgment. The four living creatures connect this scene to Ezekiel’s vision of heaven (Ezek. 1:10)."
    },
    {
      "pk": 663061,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 2,
      "text": "And I looked, and behold, a white horse! Its rider held a bow, and a crown was given to him, and he went out conquering and to conquer.",
      "links": "<a href='/AIV/38/6/2-3'>Zech. 6:2-3</a>; <a href='/AIV/19/45/4-5'>Ps. 45:4-5</a>",
      "comment": "The rider on the white horse represents conquest or victory, echoing passages like Psalm 45:4-5 and Zechariah 6:2-3. Some interpret this as Christ or the spirit of conquest preceding the end times. The passive 'a crown was given' emphasizes that authority is granted by God."
    },
    {
      "pk": 663062,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 3,
      "text": "When he opened the second seal, I heard the second living creature say, \"Come!\"",
      "links": "<a href='/AIV/66/4/7'>Rev. 4:7</a>",
      "comment": "Each seal’s opening is heralded by one of the living creatures, emphasizing the participation of heavenly beings in God’s plan (Rev. 4:7)."
    },
    {
      "pk": 663063,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 4,
      "text": "And another horse, bright red, went out. Its rider was permitted to take peace from the earth, so that people would slay one another, and he was given a great sword.",
      "links": "<a href='/AIV/38/1/8'>Zech. 1:8</a>; <a href='/AIV/40/24/6-7'>Matt. 24:6-7</a>",
      "comment": "The red horse symbolizes war and bloodshed, paralleling Zechariah’s red horse (Zech. 1:8). The escalation of violence fulfills Jesus’ warnings about coming strife (Matt. 24:6-7). The rider acts by permission, showing God’s sovereignty even in times of judgment."
    },
    {
      "pk": 663064,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 5,
      "text": "When he opened the third seal, I heard the third living creature say, \"Come!\" And I looked, and behold, a black horse! Its rider held a pair of scales in his hand.",
      "links": "<a href='/AIV/38/6/2'>Zech. 6:2</a>; <a href='/AIV/19/107/34'>Ps. 107:34</a>",
      "comment": "The black horse with scales represents famine and economic imbalance. Scales were used to measure out food in scarcity (see Zech. 6:2 and Ps. 107:34)."
    },
    {
      "pk": 663065,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 6,
      "text": "And I heard what sounded like a voice in the midst of the four living creatures, saying, \"A quart of wheat for a denarius, and three quarts of barley for a denarius, but do not harm the oil and the wine!\"",
      "links": "<a href='/AIV/12/6/25'>2 Kings 6:25</a>; <a href='/AIV/40/20/2'>Matt. 20:2</a>",
      "comment": "The prices indicate scarcity—a denarius was a day's wage (Matt. 20:2), so bread becomes expensive. The protection of oil and wine suggests limited but not total devastation, reflecting God’s measured judgment (2 Kings 6:25)."
    },
    {
      "pk": 663066,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 7,
      "text": "When he opened the fourth seal, I heard the voice of the fourth living creature say, \"Come!\"",
      "links": "<a href='/AIV/66/4/7'>Rev. 4:7</a>",
      "comment": "The repetition of ‘Come!’ marks the sequence and shows the unfolding nature of the vision."
    },
    {
      "pk": 663067,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 8,
      "text": "And I looked, and behold, a pale horse! Its rider's name was Death, and Hades followed him. They were given authority over a fourth of the earth, to kill with sword, with famine, with plague, and by wild beasts of the earth.",
      "links": "<a href='/AIV/26/14/21'>Ezek. 14:21</a>; <a href='/AIV/19/49/14'>Ps. 49:14</a>",
      "comment": "Death and Hades are personified, with their authority permitted by God. The judgments mirror Ezekiel 14:21’s listing of God’s four severe judgments. Destruction is limited (a fourth), showing mercy amid judgment."
    },
    {
      "pk": 663068,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 9,
      "text": "When he opened the fifth seal, I saw under the altar the souls of those who had been slain because of the word of God and because of the testimony they had maintained.",
      "links": "<a href='/AIV/19/79/3'>Ps. 79:3</a>; <a href='/AIV/66/20/4'>Rev. 20:4</a>",
      "comment": "The altar suggests sacrificial worship, with the souls of martyrs under it recalling Old Testament sacrifices (Ps. 79:3) and the future reign of the martyrs (Rev. 20:4)."
    },
    {
      "pk": 663069,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 10,
      "text": "They cried out with a loud voice, \"O Sovereign Lord, holy and true, how long before you will judge and avenge our blood on those who dwell on the earth?\"",
      "links": "<a href='/AIV/35/1/2'>Hab. 1:2</a>; <a href='/AIV/19/79/10'>Ps. 79:10</a>",
      "comment": "Their plea echoes the lament of the faithful in suffering (Hab. 1:2; Ps. 79:10). This shows the martyrs’ ongoing awareness and intercession before God."
    },
    {
      "pk": 663070,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 11,
      "text": "Then each of them was given a white robe and told to rest a little longer, until the number of their fellow servants and their brothers who were to be killed as they had been was completed.",
      "links": "<a href='/AIV/66/7/9'>Rev. 7:9, 13-14</a>; <a href='/AIV/38/3/5'>Zech. 3:5</a>",
      "comment": "The white robe signifies purity and victory, similar to Zechariah 3:5 and Revelation 7:9, 13-14. Martyrs are assured their suffering is seen and has a purpose in God's providence."
    },
    {
      "pk": 663071,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 12,
      "text": "And I looked when he opened the sixth seal, and behold, there was a great earthquake. The sun became black as sackcloth made of hair, and the whole moon became like blood.",
      "links": "<a href='/AIV/23/13/10'>Isa. 13:10</a>; <a href='/AIV/29/2/10'>Joel 2:10</a>",
      "comment": "The cosmic disturbances mentioned here are prophesied in Isaiah 13:10 and Joel 2:10, signifying judgment and God's direct intervention in human history."
    },
    {
      "pk": 663072,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 13,
      "text": "And the stars of the sky fell to the earth, as a fig tree sheds its unripe figs when shaken by a strong wind.",
      "links": "<a href='/AIV/23/34/4'>Isa. 34:4</a>; <a href='/AIV/41/13/25'>Mark 13:25</a>",
      "comment": "This dramatic imagery represents the collapse of order and authority, prefigured in Isaiah 34:4 and echoed in Jesus' words in Mark 13:25."
    },
    {
      "pk": 663073,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 14,
      "text": "The sky vanished like a scroll being rolled up, and every mountain and island was moved from its place.",
      "links": "<a href='/AIV/23/34/4'>Isa. 34:4</a>; <a href='/AIV/19/46/2'>Ps. 46:2</a>",
      "comment": "The image of the sky rolling up is taken directly from Isaiah 34:4. Events affect all creation, fulfilling prophetic expectations of a transformed world (Ps. 46:2)."
    },
    {
      "pk": 663074,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 15,
      "text": "Then the kings of the earth and the great ones and the generals and the rich and the powerful and everyone, slave and free, hid themselves in the caves and among the rocks of the mountains.",
      "links": "<a href='/AIV/23/2/10,19,21'>Isa. 2:10, 19, 21</a>",
      "comment": "All ranks of society are equally subject to God's judgment, fulfilling Isaiah 2:10, 19, 21. No earthly status can protect from divine justice."
    },
    {
      "pk": 663075,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 16,
      "text": "They called to the mountains and the rocks, \"Fall on us and hide us from the face of him who sits on the throne and from the wrath of the Lamb,\"",
      "links": "<a href='/AIV/28/10/8'>Hos. 10:8</a>; <a href='/AIV/23/2/19'>Isa. 2:19</a>",
      "comment": "Their cry echoes Hosea 10:8 and Isaiah 2:19, recognizing a direct encounter with God and His anointed. The 'wrath of the Lamb' asserts Christ’s divine authority to judge."
    },
    {
      "pk": 663076,
      "translation": "AIV",
      "book": 66,
      "chapter": 6,
      "verse": 17,
      "text": "for the great day of their wrath has come, and who can stand?",
      "links": "<a href='/AIV/19/76/7'>Ps. 76:7</a>; <a href='/AIV/66/16/14'>Rev. 16:14</a>",
      "comment": "The 'great day' echoes prophetic themes of divine judgment (Ps. 76:7). Only those made righteous can stand before God. This prepares the reader for the coming vision of the redeemed in Rev. 7."
    }
  ],
  "translatedAt": "2025-12-23T04:23:26.043Z"
}