{
  "book": 3,
  "bookName": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 24,
  "verses": [
    {
      "pk": 3024001,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 1,
      "text": "The LORD spoke to Moses, saying,",
      "links": "<a href='/AIV/2/25/1'>Ex. 25:1</a>; <a href='/AIV/3/1/1-2'>Lev. 1:1-2</a>",
      "comment": "This introductory formula signals another direct revelation from the LORD to Moses, signifying divine authority for all instructions that follow."
    },
    {
      "pk": 3024002,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 2,
      "text": "Command the people of Israel to bring you pure oil of beaten olives for the lamp, to keep a lamp burning continually.",
      "links": "<a href='/AIV/2/27/20'>Ex. 27:20</a>; <a href='/AIV/4/8/2'>Num. 8:2</a>",
      "comment": "The perpetual lamp signifies God’s enduring presence among His people. The use of pure olive oil and the command for continual light points forward typologically to Christ as the Light of the World (<a href='/AIV/43/8/12'>John 8:12</a>), and to the continual worship found later in Christian tradition."
    },
    {
      "pk": 3024003,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 3,
      "text": "Outside the veil of the testimony, in the tent of meeting, Aaron shall arrange it from evening to morning before the LORD continually. It shall be a statute forever throughout your generations.",
      "links": "<a href='/AIV/2/26/33'>Ex. 26:33-35</a>",
      "comment": "Aaron, the high priest, is tasked with maintaining the lamp before the LORD. This perpetual ordinance is reminiscent of the ongoing prayer and worship that is central to the Christian faith. It also prefigures the intercessory role of the priesthood."
    },
    {
      "pk": 3024004,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 4,
      "text": "He shall keep the lamps in order on the pure gold lampstand before the LORD continually.",
      "links": "<a href='/AIV/2/25/31-40'>Ex. 25:31-40</a>; <a href='/AIV/2/40/24-25'>Ex. 40:24-25</a>",
      "comment": "The lampstand crafted from pure gold symbolizes holiness and purity. Its continual light points toward the fullness of revelation in Christ and the unbroken praise that is ideal for God’s people."
    },
    {
      "pk": 3024005,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 5,
      "text": "You shall take fine flour and bake twelve loaves from it; two-tenths of an ephah shall be in each loaf.",
      "links": "<a href='/AIV/2/25/30'>Ex. 25:30</a>; <a href='/AIV/3/2/1'>Lev. 2:1</a>",
      "comment": "The twelve loaves represent the twelve tribes of Israel and their unity before God. Bread here is not merely physical sustenance but also subtly foreshadows the sacred bread of the New Covenant (see <a href='/AIV/40/26/26'>Matt. 26:26</a>)."
    },
    {
      "pk": 3024006,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 6,
      "text": "And you shall set them in two rows, six in a row, on the pure gold table before the LORD.",
      "links": "<a href='/AIV/2/25/23-30'>Ex. 25:23-30</a>",
      "comment": "The arrangement on the pure gold table once again highlights holiness. The loaves and their presentation prefigure the communal sharing of holy bread in the worship life of God’s people."
    },
    {
      "pk": 3024007,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 7,
      "text": "You shall put pure frankincense on each row, so that it may go with the bread as a memorial portion, an offering by fire to the LORD.",
      "links": "<a href='/AIV/2/30/34'>Ex. 30:34</a>; <a href='/AIV/3/2/2'>Lev. 2:2</a>",
      "comment": "The frankincense denotes prayer rising to God (<a href='/AIV/19/141/2'>Ps. 141:2</a>), and the memorial portion signifies a lasting remembrance before the LORD, recalling the importance of remembrance in worship."
    },
    {
      "pk": 3024008,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 8,
      "text": "Every Sabbath day Aaron shall arrange it before the LORD continually; it is from the people of Israel as a covenant forever.",
      "links": "<a href='/AIV/2/31/16-17'>Ex. 31:16-17</a>",
      "comment": "Renewal each Sabbath highlights the perpetual nature of covenant worship and preparation, hinting at the fulfillment of this pattern in the continual offering of praise and thanksgiving."
    },
    {
      "pk": 3024009,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 9,
      "text": "And it shall be for Aaron and his sons, and they shall eat it in a holy place, for it is most holy to him from the LORD’s offerings by fire, a perpetual statute.",
      "links": "<a href='/AIV/3/6/16'>Lev. 6:16</a>; <a href='/AIV/9/18/8-11'>Num. 18:8-11</a>",
      "comment": "Only the priests may eat this bread, and only in a holy place. This exclusivity prefigures the sacredness and reservation of holy things for those set apart, much as in later Christian practice of sacred bread reserved for the ministers in the sanctuary."
    },
    {
      "pk": 3024010,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 10,
      "text": "Now an Israelite woman’s son, whose father was an Egyptian, went out among the people of Israel; and the Israelite woman’s son and a man of Israel fought in the camp.",
      "links": "",
      "comment": "This begins a narrative interlude illustrating the consequences of blasphemy. The mixed heritage of the man points to larger questions about identity and belonging within God’s covenant people."
    },
    {
      "pk": 3024011,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 11,
      "text": "And the Israelite woman’s son blasphemed the Name, and cursed. Then they brought him to Moses. (His mother’s name was Shelomith, daughter of Dibri, of the tribe of Dan.)",
      "links": "",
      "comment": "Blaspheming 'the Name' refers to a direct insult to the holiness of God (see <a href='/AIV/2/3/14'>Ex. 3:14</a>). The seriousness is underlined by the naming of parties involved, establishing that such sin is not anonymous but specific."
    },
    {
      "pk": 3024012,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 12,
      "text": "And they put him in custody, till the will of the LORD should be made clear to them.",
      "links": "<a href='/AIV/4/15/34'>Num. 15:34</a>",
      "comment": "They seek direct guidance from God for new or difficult cases, underscoring the authority of divine law and the role of the mediator in consulting God’s will."
    },
    {
      "pk": 3024013,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 13,
      "text": "Then the LORD spoke to Moses, saying,",
      "links": "",
      "comment": "A return to the direct speech of God. The resolution for the people comes only from divine revelation, highlighting the ongoing need for a living authority to interpret and apply God’s commands."
    },
    {
      "pk": 3024014,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 14,
      "text": "Bring out of the camp the one who cursed, and let all who heard him lay their hands on his head, and let all the congregation stone him.",
      "links": "<a href='/AIV/5/13/9'>Deut. 13:9</a>",
      "comment": "The laying on of hands signifies corporate responsibility and witness (see <a href='/AIV/4/27/23'>Num. 27:23</a>). This judicial execution, severe as it is, reflects the seriousness of treating God's holy presence and name with utmost reverence."
    },
    {
      "pk": 3024015,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 15,
      "text": "And you shall speak to the people of Israel, saying, Whoever curses his God shall bear his sin.",
      "links": "",
      "comment": "Blasphemy is not just social crime but a deep rupture with the divine order. Each person is accountable for what they say about God, a principle carried forward in Jesus' own teaching (<a href='/AIV/40/12/36-37'>Matt. 12:36-37</a>)."
    },
    {
      "pk": 3024016,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 16,
      "text": "Whoever blasphemes the Name of the LORD shall surely be put to death; all the congregation shall stone him. Both the foreigner and the native, when he blasphemes the Name, shall be put to death.",
      "links": "<a href='/AIV/5/17/2-7'>Deut. 17:2-7</a>",
      "comment": "The law applies equally to all in the community, emphasizing the universality of God’s demands for holiness. This prepares the way for the New Covenant in which all nations are called to holiness, not just Israel."
    },
    {
      "pk": 3024017,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 17,
      "text": "He who takes a human life shall surely be put to death.",
      "links": "<a href='/AIV/1/9/6'>Gen. 9:6</a>; <a href='/AIV/2/21/12'>Ex. 21:12</a>",
      "comment": "Murder violates the dignity of the person made in the image of God, maintaining the sanctity of human life. Justice is demanded for the taking of innocent life."
    },
    {
      "pk": 3024018,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 18,
      "text": "Whoever kills an animal shall make it good, life for life.",
      "links": "<a href='/AIV/2/21/34-36'>Ex. 21:34-36</a>",
      "comment": "Proportional justice: restitution for lost property or livelihood. The law distinguishes between crimes against persons and crimes against property."
    },
    {
      "pk": 3024019,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 19,
      "text": "If anyone injures his neighbor, as he has done, so it shall be done to him:",
      "links": "<a href='/AIV/2/21/23-25'>Ex. 21:23-25</a>",
      "comment": "This is the 'lex talionis' or law of retribution. In later Christian interpretation, Jesus radicalizes this teaching with a call to mercy (<a href='/AIV/40/5/38-39'>Matt. 5:38-39</a>)."
    },
    {
      "pk": 3024020,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 20,
      "text": "Fracture for fracture, eye for eye, tooth for tooth; whatever injury he has given a person shall be given to him.",
      "links": "<a href='/AIV/2/21/24'>Ex. 21:24</a>; <a href='/AIV/5/19/21'>Deut. 19:21</a>",
      "comment": "The principle is about measured justice, not revenge. In Christ, this law finds a greater fulfillment in the call to forgive and to seek reconciliation, showing the law’s role as preparation for a higher standard."
    },
    {
      "pk": 3024021,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 21,
      "text": "Whoever kills an animal shall make it good, and whoever kills a person shall be put to death.",
      "links": "<a href='/AIV/1/9/6'>Gen. 9:6</a>; <a href='/AIV/2/21/12'>Ex. 21:12</a>",
      "comment": "Reiterates the distinction between restitution for property and the gravity of murder. The unchanging value of human life is thus embedded in the law."
    },
    {
      "pk": 3024022,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 22,
      "text": "You shall have one law for the foreigner and for the native; for I am the LORD your God.",
      "links": "<a href='/AIV/2/12/49'>Ex. 12:49</a>; <a href='/AIV/4/15/15-16'>Num. 15:15-16</a>",
      "comment": "God’s law is for all people within the community, foreshadowing the universality of God's call to holiness and truth, regardless of ethnic origin."
    },
    {
      "pk": 3024023,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 24,
      "verse": 23,
      "text": "So Moses spoke to the people of Israel, and they brought out of the camp the one who had cursed and stoned him with stones. Thus the people of Israel did as the LORD commanded Moses.",
      "links": "",
      "comment": "Israel’s obedience to God’s command is immediately enacted, demonstrating the seriousness of holiness and the efficacy of God-given authority in providing order. Later Christian traditions will see this as pointing to the need for obedience to divinely-instituted guidance and discipline among God’s people."
    }
  ],
  "translatedAt": "2025-12-24T01:23:52.464Z"
}