{
  "book": 3,
  "bookName": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 21,
  "verses": [
    {
      "pk": 3021001,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 1,
      "text": "The LORD said to Moses, 'Speak to the priests, the sons of Aaron, and say to them: None shall make himself ceremonially unclean for a dead person among his people,",
      "links": "<a href='/AIV/4/19/11'>Num. 19:11</a>; <a href='/AIV/3/22/4'>Lev. 22:4</a>",
      "comment": "Priests were held to higher standards of purity, emphasizing their role as mediators between God and the people. This foreshadows the high calling of those serving in spiritual leadership throughout salvation history. See also Hebrews 7:26 for Christ as the perfect high priest."
    },
    {
      "pk": 3021002,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 2,
      "text": "except for his closest relatives: his mother, his father, his son, his daughter, and his brother.",
      "links": "<a href='/AIV/3/10/6'>Lev. 10:6</a>",
      "comment": "Family ties allow certain exceptions, showing both the respect for family bonds and the importance of ritual purity for priestly service. This echoes Christ’s own fulfillment of the Law’s demand for purity yet His deep compassion for human relationships."
    },
    {
      "pk": 3021003,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 3,
      "text": "He may also make himself unclean for his unmarried sister, if she is close to him and has had no husband.",
      "links": "<a href='/AIV/3/18/6'>Lev. 18:6</a>",
      "comment": "This provision highlights the special duty of priests toward unmarried female relatives, reflecting the deep sense of responsibility expected of God’s ministers."
    },
    {
      "pk": 3021004,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 4,
      "text": "He shall not make himself unclean, as a husband among his people, so as to defile himself.",
      "links": "<a href='/AIV/3/21/1'>Lev. 21:1</a>",
      "comment": "Priests were to retain their spiritual office above familial customs. The clear boundary invokes the primacy of religious vocation and service over ordinary affairs."
    },
    {
      "pk": 3021005,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 5,
      "text": "Priests shall not shave their heads, trim the edges of their beards, or cut their bodies.",
      "links": "<a href='/AIV/3/19/27-28'>Lev. 19:27-28</a>; <a href='/AIV/5/14/1'>Deut. 14:1</a>",
      "comment": "These prohibitions separate God’s ministers from pagan mourning rituals, emphasizing surrender to God’s will. The priestly call to holiness invites all Christians to reject worldly patterns in favor of spiritual renewal (Romans 12:2)."
    },
    {
      "pk": 3021006,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 6,
      "text": "They shall be holy to their God and not profane the name of their God. They offer the food of the LORD; therefore, they must be holy.",
      "links": "<a href='/AIV/3/10/3'>Lev. 10:3</a>; <a href='/AIV/60/1/16'>1 Pet. 1:16</a>",
      "comment": "The priests’ holiness is tied to the sacred rituals they perform, reflecting how liturgical acts sanctify God’s people. This anticipates Christ’s promise to sanctify believers through the offering of Himself (Hebrews 10:10)."
    },
    {
      "pk": 3021007,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 7,
      "text": "They shall not marry a prostitute or a woman defiled, nor shall they marry a woman divorced from her husband, for the priest is holy to his God.",
      "links": "<a href='/AIV/3/20/7'>Lev. 20:7</a>; <a href='/AIV/26/44/22'>Ezek. 44:22</a>",
      "comment": "Marriage rules for priests stress the importance of purity in leadership—and foreshadow Christ’s call for His ministers to live out sacrificial fidelity and spiritual integrity."
    },
    {
      "pk": 3021008,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 8,
      "text": "You shall set him apart as holy because he offers the food of your God. He shall be holy to you, for I, the LORD, who sanctifies you, am holy.",
      "links": "<a href='/AIV/2/19/6'>Exod. 19:6</a>; <a href='/AIV/3/20/26'>Lev. 20:26</a>",
      "comment": "God Himself sanctifies His priests, marking a deep mystery about God’s action through holy ministers. A similar theme is found in John 17:19, where Christ consecrates Himself so believers may be sanctified."
    },
    {
      "pk": 3021009,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 9,
      "text": "If a priest's daughter defiles herself by becoming a prostitute, she profanes her father. She shall be burned with fire.",
      "links": "<a href='/AIV/3/19/29'>Lev. 19:29</a>; <a href='/AIV/6/7/15'>Josh. 7:15</a>",
      "comment": "The severe penalty underscores the seriousness of defilement and the integrity of the priestly line. The priesthood’s sanctity is guarded zealously, foreshadowing the importance of spiritual purity for all Christians."
    },
    {
      "pk": 3021010,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 10,
      "text": "The high priest, who is greater than his brothers, on whose head the anointing oil has been poured and who has been consecrated to wear the garments, must not let his hair hang loose or tear his clothes.",
      "links": "<a href='/AIV/2/29/7'>Exod. 29:7</a>;<a href='/AIV/3/8/12'>Lev. 8:12</a>",
      "comment": "The high priest’s special consecration highlights the mediator’s unique role—a typology for Christ as the Anointed One (Hebrews 4:14), who fulfills the Old Testament priesthood perfectly."
    },
    {
      "pk": 3021011,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 11,
      "text": "He shall not go near any dead body, nor make himself unclean even for his father or his mother.",
      "links": "<a href='/AIV/3/21/1'>Lev. 21:1</a>",
      "comment": "The high priest’s absolute separation from death reflects final victory over death that Christ brings (see 1 Corinthians 15:54)."
    },
    {
      "pk": 3021012,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 12,
      "text": "He shall not leave the sanctuary or profane the sanctuary of his God, for the consecration of the anointing oil of his God is upon him: I am the LORD.",
      "links": "<a href='/AIV/2/29/7'>Exod. 29:7</a>; <a href='/AIV/3/8/12'>Lev. 8:12</a>",
      "comment": "God’s presence in the sanctuary is central; priests are consecrated permanently to service. This points toward Christ’s eternal priesthood and the perpetual offering for God’s people."
    },
    {
      "pk": 3021013,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 13,
      "text": "He shall marry only a woman who is a virgin.",
      "links": "<a href='/AIV/26/44/22'>Ezek. 44:22</a>",
      "comment": "Priestly marriage laws emphasize purity and prefigure the spiritual purity expected of those consecrated for service. Christ’s Church is often described as a pure bride in Revelation 19:7."
    },
    {
      "pk": 3021014,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 14,
      "text": "He must not marry a widow, a divorced woman, or a woman defiled by prostitution; but only a virgin from his own people.",
      "links": "<a href='/AIV/3/21/7'>Lev. 21:7</a>",
      "comment": "The priest must maintain a high standard of holiness in marriage, echoing the pure and spotless union of Christ with the Church (Ephesians 5:27)."
    },
    {
      "pk": 3021015,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 15,
      "text": "He shall not profane his offspring among his people, for I am the LORD who sanctifies him.",
      "links": "<a href='/AIV/3/22/9'>Lev. 22:9</a>",
      "comment": "God’s sanctifying power is transmitted through the priestly line, reinforcing the sacredness of devoted service in God’s household."
    },
    {
      "pk": 3021016,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 16,
      "text": "The LORD spoke to Moses, saying,",
      "links": "<a href='/AIV/3/6/1'>Lev. 6:1</a>",
      "comment": "A new speech signals a change in topic, deepening the instruction about priestly holiness."
    },
    {
      "pk": 3021017,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 17,
      "text": "'Speak to Aaron, saying: None of your descendants throughout their generations who has any defect may approach to offer the food of his God.",
      "links": "<a href='/AIV/3/22/3'>Lev. 22:3</a>",
      "comment": "Only those without physical defects may serve at the altar—an image pointing to the perfect sacrifice Christ accomplishes (Hebrews 7:26-27)."
    },
    {
      "pk": 3021018,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 18,
      "text": "For no one who has a defect may approach—a man blind or lame, or with a disfigured face or deformed limb,",
      "links": "<a href='/AIV/3/21/21'>Lev. 21:21</a>; <a href='/AIV/5/23/1'>Deut. 23:1</a>",
      "comment": "Physical wholeness is a symbol of spiritual perfection, foreshadowing the wholeness believers receive in Christ (Matthew 8:17)."
    },
    {
      "pk": 3021019,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 19,
      "text": "or a man with a broken foot or a broken hand,",
      "links": "<a href='/AIV/3/21/18'>Lev. 21:18</a>",
      "comment": "These requirements continue to emphasize fitness for sacred service, reinforcing God’s holiness."
    },
    {
      "pk": 3021020,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 20,
      "text": "or one who is a hunchback or a dwarf, or someone with an eye defect, a rash or sores, or damaged testicles.",
      "links": "<a href='/AIV/3/21/21'>Lev. 21:21</a>",
      "comment": "While physical attributes barred priestly service, Christ’s ministry brings healing and inclusion (Luke 7:22), showing fulfillment of God’s mercy toward the broken."
    },
    {
      "pk": 3021021,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 21,
      "text": "No descendant of Aaron the priest who has a defect is to come near to offer the food of his God. He may not approach to offer sacrifices on the altar, having a defect; he must not profane My sanctuaries, for I am the LORD who sanctifies them.",
      "links": "<a href='/AIV/3/21/17'>Lev. 21:17</a>; <a href='/AIV/3/22/2'>Lev. 22:2</a>",
      "comment": "Priestly ritual purity reflects the profound mystery of spiritual perfection. Christ, the spotless Lamb, is the ultimate fulfillment of this law (1 Peter 1:19)."
    },
    {
      "pk": 3021022,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 22,
      "text": "He may eat the food of his God, both of the most holy and of the holy.",
      "links": "<a href='/AIV/3/2/3'>Lev. 2:3</a>; <a href='/AIV/3/6/17'>Lev. 6:17</a>",
      "comment": "Even disqualified priests could share in sacred food, reflecting the generous mercy found in God’s household for all consecrated people."
    },
    {
      "pk": 3021023,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 23,
      "text": "But he shall not go through the veil or approach the altar, because he has a defect, and he must not profane My sanctuaries; for I am the LORD who sanctifies them.",
      "links": "<a href='/AIV/2/26/33'>Exod. 26:33</a>; <a href='/AIV/3/22/2'>Lev. 22:2</a>",
      "comment": "The restriction affirms the sacredness of God’s dwelling and the essential mystery of sanctification through God’s consecrating presence."
    },
    {
      "pk": 3021024,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 21,
      "verse": 24,
      "text": "So Moses spoke these things to Aaron and to his sons and to all the Israelites.",
      "links": "<a href='/AIV/3/10/8'>Lev. 10:8</a>",
      "comment": "The laws are given to all, emphasizing universal responsibility to uphold God’s holiness. The priesthood serves as both mediator and example for faithfulness across generations—ultimately fulfilled in Christ’s eternal priesthood."
    }
  ],
  "translatedAt": "2025-12-24T01:21:47.397Z"
}