{
  "book": 3,
  "bookName": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 10,
  "verses": [
    {
      "pk": 3010001,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 1,
      "text": "Now Aaron’s sons, Nadab and Abihu, each took his censer, put fire in it, laid incense on it, and offered unauthorized fire before the LORD, which He had not commanded them.",
      "links": "<a href='/AIV/2/30/9'>Ex. 30:9</a>; <a href='/AIV/3/16/1'>Lev. 16:1</a>",
      "comment": "Nadab and Abihu acted presumptuously, offering worship not prescribed by God. This highlights the importance of obedience and sacred tradition in worship practices. Even priests are not free to innovate contrary to clear divine instruction."
    },
    {
      "pk": 3010002,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 2,
      "text": "And fire went out from the LORD and consumed them, and they died before the LORD.",
      "links": "<a href='/AIV/3/9/24'>Lev. 9:24</a>; <a href='/AIV/4/16/35'>Num. 16:35</a>",
      "comment": "God responds with immediate judgment, demonstrating His holiness and the consequences of approaching Him disrespectfully. This points forward to the seriousness with which New Testament worship and discipline are regarded (<a href='/AIV/52/5/23'>1 Thes. 5:23</a>)."
    },
    {
      "pk": 3010003,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 3,
      "text": "Then Moses said to Aaron, 'This is what the LORD spoke, saying, “I will be sanctified by those who draw near to Me, and before all the people I will be glorified.”' And Aaron kept silent.",
      "links": "<a href='/AIV/3/8/35'>Lev. 8:35</a>; <a href='/AIV/58/12/28'>Heb. 12:28-29</a>",
      "comment": "God demands holiness from those who serve Him closely. Aaron’s silence is a sign of submission to God’s will, even in personal loss. Note the link to sanctification and public witness in worship, a theme later connecting to Christ's own consecration (<a href='/AIV/43/17/19'>John 17:19</a>)."
    },
    {
      "pk": 3010004,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 4,
      "text": "Then Moses called Mishael and Elzaphan, sons of Uzziel the uncle of Aaron, and said to them, 'Come near, carry your cousins away from the front of the sanctuary out of the camp.'",
      "links": "<a href='/AIV/2/6/18'>Ex. 6:18, 22</a>",
      "comment": "Family members of the priesthood are called to serve, but even they must respect the sacredness of God’s dwelling. Touching the bodies required ritual purity, echoing later care for the holy in the life of the Church."
    },
    {
      "pk": 3010005,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 5,
      "text": "So they came near and carried them in their tunics out of the camp, as Moses had commanded.",
      "links": "<a href='/AIV/4/16/47'>Num. 16:47</a>",
      "comment": "Obedience to Moses, God’s chosen leader, preserves order. Ritual purity and separation from uncleanness begins to be defined, later fulfilled in Christ who touches sinners yet remains holy."
    },
    {
      "pk": 3010006,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 6,
      "text": "And Moses said to Aaron, and to Eleazar and Ithamar, his sons, 'Do not let your hair hang loose or tear your clothes, lest you die, and wrath come upon all the congregation. But let your brothers, the whole house of Israel, mourn for the burning which the LORD has kindled.'",
      "links": "<a href='/AIV/3/21/10'>Lev. 21:10</a>; <a href='/AIV/3/13/45'>Lev. 13:45</a>",
      "comment": "Priests are called to maintain dignity and composure in liturgical service, even in crisis. Their unique role requires them to offer spiritual leadership above personal emotion."
    },
    {
      "pk": 3010007,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 7,
      "text": "'Do not go out from the entrance of the tent of meeting, lest you die, for the anointing oil of the LORD is upon you.' So they did according to the word of Moses.",
      "links": "<a href='/AIV/3/8/30'>Lev. 8:30</a>; <a href='/AIV/23/61/6'>Isa. 61:6</a>",
      "comment": "The special anointing places priests under sacred obligation. Holiness is not just a private matter but a public duty for those consecrated, prefiguring ordained ministry later on."
    },
    {
      "pk": 3010008,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 8,
      "text": "And the LORD spoke to Aaron, saying:",
      "links": "<a href='/AIV/3/6/8'>Lev. 6:8</a>",
      "comment": "God speaks directly to Aaron, affirming his continuing office and responsibility as high priest even after tragedy. Note direct communication from God, analogous to apostolic succession."
    },
    {
      "pk": 3010009,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 9,
      "text": "'Do not drink wine or strong drink, you or your sons with you, when you go into the tent of meeting, lest you die. This is a statute forever throughout your generations,'",
      "links": "<a href='/AIV/26/44/21'>Ezek. 44:21</a>; <a href='/AIV/46/11/21'>1 Cor. 11:21</a>",
      "comment": "Priests must be sober and reverent when serving. Later warnings about drunkenness are linked to worthiness to partake in New Covenant worship and the Eucharist (<a href='/AIV/46/11/27'>1 Cor. 11:27</a>)."
    },
    {
      "pk": 3010010,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 10,
      "text": "'You are to make a distinction between the holy and the common, and between the unclean and the clean,'",
      "links": "<a href='/AIV/3/11/47'>Lev. 11:47</a>; <a href='/AIV/58/7/26'>Heb. 7:26</a>",
      "comment": "Clear separation between sacred and profane anticipated the need for doctrinal purity and spiritual discernment in worship and community life."
    },
    {
      "pk": 3010011,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 11,
      "text": "'and you are to teach the people of Israel all the statutes that the LORD has spoken to them through Moses.'",
      "links": "<a href='/AIV/5/33/10'>Deut. 33:10</a>; <a href='/AIV/40/28/20'>Matt. 28:20</a>",
      "comment": "Teaching and authority are united in the priesthood, foreshadowing Christ’s commission to His ministers to teach faithfully all things He commanded."
    },
    {
      "pk": 3010012,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 12,
      "text": "And Moses spoke to Aaron and to Eleazar and Ithamar, his surviving sons, 'Take the grain offering that remains of the LORD’s offerings made by fire, and eat it unleavened beside the altar, for it is most holy.'",
      "links": "<a href='/AIV/3/2/3'>Lev. 2:3</a>; <a href='/AIV/3/6/16'>Lev. 6:16-18</a>",
      "comment": "Eating the offering by the altar emphasizes participation in the sacrifice, a theme found in later understandings of priestly communion with God."
    },
    {
      "pk": 3010013,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 13,
      "text": "'You shall eat it in a holy place, for it is your due and your sons’ due from the LORD’s offerings made by fire, for so I am commanded.'",
      "links": "<a href='/AIV/3/6/26'>Lev. 6:26</a>; <a href='/AIV/3/24/9'>Lev. 24:9</a>",
      "comment": "Priestly rights and duties reinforce God’s provision for His ministers. Sacred meals foreshadow deeper spiritual realities, including the new covenant supper."
    },
    {
      "pk": 3010014,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 14,
      "text": "'And the breast that is waved and the thigh that is contributed you shall eat in a clean place, you and your sons and your daughters with you; for they are your due and your sons’ due, given from the sacrifices of the peace offerings of the people of Israel.'",
      "links": "<a href='/AIV/3/7/34'>Lev. 7:34</a>",
      "comment": "The priestly family shares the gifts from worship, signaling communal participation in the sacred—another precursor to united spiritual fellowship in Christ."
    },
    {
      "pk": 3010015,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 15,
      "text": "'The thigh that is contributed and the breast that is waved they shall bring with the offerings of fat made by fire, to wave as a wave offering before the LORD; and it shall be yours and your sons’ with you, as a due forever, as the LORD has commanded.'",
      "links": "<a href='/AIV/3/7/31'>Lev. 7:31-34</a>",
      "comment": "Priestly participation in the offering is established as an unending ordinance, suggesting continuity of ministerial order throughout salvation history."
    },
    {
      "pk": 3010016,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 16,
      "text": "Now Moses diligently sought the goat of the sin offering, and behold, it was burned up. And he was angry with Eleazar and Ithamar, the surviving sons of Aaron, saying:",
      "links": "<a href='/AIV/3/9/3'>Lev. 9:3</a>",
      "comment": "Moses carefully oversees the sacrificial order, emphasizing reverence for sacred procedures."
    },
    {
      "pk": 3010017,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 17,
      "text": "'Why have you not eaten the sin offering in the sanctuary, since it is most holy and has been given to you to bear the guilt of the congregation, to make atonement for them before the LORD?'",
      "links": "<a href='/AIV/3/6/24'>Lev. 6:24-26</a>; <a href='/AIV/3/4/20'>Lev. 4:20</a>",
      "comment": "Priests are mediators bearing the people's guilt, prefiguring Christ’s unique mediation. The priest’s role in atonement foreshadows both literal and spiritual realities in God’s plan."
    },
    {
      "pk": 3010018,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 18,
      "text": "'See, its blood was not brought inside the sanctuary; you certainly should have eaten it in the sanctuary, as I commanded.'",
      "links": "<a href='/AIV/3/6/30'>Lev. 6:30</a>",
      "comment": "The specific instructions on blood and place of eating guard the sanctity of the ritual, a symbol of respecting liturgical tradition handed down from God."
    },
    {
      "pk": 3010019,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 19,
      "text": "Aaron said to Moses, 'Look, today they have offered their sin offering and their burnt offering before the LORD, yet such things have happened to me. If I had eaten the sin offering today, would it have been acceptable in the sight of the LORD?'",
      "links": "<a href='/AIV/3/9/8'>Lev. 9:8</a>",
      "comment": "Aaron expresses a concern for proper offering in the face of grief, recognizing that ritual purity also involves interior disposition—a deep harmony of law and spirit."
    },
    {
      "pk": 3010020,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 10,
      "verse": 20,
      "text": "When Moses heard that, he was satisfied.",
      "links": "<a href='/AIV/3/9/10'>Lev. 9:10</a>",
      "comment": "Mercy and understanding within the structure of God’s law is illustrated here—a sign of pastoral wisdom, reminiscent of how Christ fulfills and perfects the Law (see <a href='/AIV/40/5/17'>Matt. 5:17</a>)."
    }
  ],
  "translatedAt": "2025-12-24T01:15:09.412Z"
}