{
  "book": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 16,
  "verses": [
    {
      "pk": 4201601,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 1,
      "text": "The LORD spoke to Moses after the death of the two sons of Aaron, who died when they drew near before the LORD.",
      "links": "<a href='/AIV/3/10/1-2'>Lev. 10:1–2</a>",
      "comment": "Refers back to Lev. 10:1–2, maintaining the timing and context."
    },
    {
      "pk": 4201602,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 2,
      "text": "The LORD said to Moses, 'Tell your brother Aaron not to come at any time into the Holy Place inside the veil, before the mercy seat that is on the ark, so that he does not die. For I will appear in the cloud over the mercy seat.'",
      "links": "<a href='/AIV/2/25/21-22'>Ex. 25:21–22</a>; <a href='/AIV/3/10/2'>Lev. 10:2</a>",
      "comment": "Important instruction for Aaron’s approach. 'Mercy seat' is used for the lid of the ark as in traditional translations."
    },
    {
      "pk": 4201603,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 3,
      "text": "'But in this way Aaron shall come into the Holy Place: with a young bull for a sin offering and a ram for a burnt offering.'",
      "links": "<a href='/AIV/3/4/3'>Lev. 4:3</a>",
      "comment": "Sin offering and burnt offering specified, as in the original."
    },
    {
      "pk": 4201604,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 4,
      "text": "He shall put on the holy linen tunic, and he shall have the linen undergarments on his body. He shall tie the linen sash around his waist and wear the linen turban. These are holy garments. Therefore, he shall bathe his body in water and then put them on.",
      "links": "<a href='/AIV/2/28/39-43'>Ex. 28:39–43</a>",
      "comment": "Clothing and washing instructions closely match the Hebrew terms."
    },
    {
      "pk": 4201605,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 5,
      "text": "And he shall take from the congregation of the people of Israel two male goats for a sin offering and one ram for a burnt offering.",
      "links": "<a href='/AIV/3/23/19'>Lev. 23:19</a>",
      "comment": "Animals specified are as in the Masoretic text."
    },
    {
      "pk": 4201606,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 6,
      "text": "Aaron shall offer the bull as a sin offering for himself and shall make atonement for himself and for his house.",
      "links": "<a href='/AIV/3/9/7'>Lev. 9:7</a>",
      "comment": "Atonement language retained per traditional interpretation."
    },
    {
      "pk": 4201607,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 7,
      "text": "Then he shall take the two goats and set them before the LORD at the entrance of the tent of meeting.",
      "links": "<a href='/AIV/3/4/7'>Lev. 4:7</a>",
      "comment": "Entrance to the tent of meeting is maintained from original."
    },
    {
      "pk": 4201608,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 8,
      "text": "Aaron shall cast lots for the two goats—one lot for the LORD and the other lot for Azazel.",
      "links": "<a href='/AIV/3/16/10'>Lev. 16:10</a>",
      "comment": "Azazel is kept as transliteration of Hebrew rather than interpretation."
    },
    {
      "pk": 4201609,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 9,
      "text": "Aaron shall present the goat on which the lot fell for the LORD and offer it as a sin offering.",
      "links": "<a href='/AIV/3/16/5'>Lev. 16:5</a>",
      "comment": "Faithful translation with clarity."
    },
    {
      "pk": 4201610,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 10,
      "text": "But the goat on which the lot fell for Azazel shall be presented alive before the LORD to make atonement upon it, that it may be sent away into the wilderness to Azazel.",
      "links": "<a href='/AIV/3/16/21-22'>Lev. 16:21–22</a>",
      "comment": "Keeps ambiguity of Azazel per original Hebrew."
    },
    {
      "pk": 4201611,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 11,
      "text": "Aaron shall bring the bull of the sin offering, which is for himself, and shall make atonement for himself and for his house. He shall kill the bull as a sin offering for himself.",
      "links": "<a href='/AIV/3/9/7-8'>Lev. 9:7–8</a>",
      "comment": "Repetition for emphasis is preserved."
    },
    {
      "pk": 4201612,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 12,
      "text": "And he shall take a censer full of coals of fire from the altar before the LORD, and two handfuls of sweet incense beaten small. He shall bring it inside the veil.",
      "links": "<a href='/AIV/2/30/1-10'>Ex. 30:1–10</a>",
      "comment": "Order and location maintained, 'incense beaten small' per literal wording."
    },
    {
      "pk": 4201613,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 13,
      "text": "He shall put the incense on the fire before the LORD, so that the cloud of the incense may cover the mercy seat that is on the testimony, so that he does not die.",
      "links": "<a href='/AIV/2/25/21-22'>Ex. 25:21–22</a>; <a href='/AIV/3/16/2'>Lev. 16:2</a>",
      "comment": "“Mercy seat” and “testimony” as original, with death penalty strongly stated."
    },
    {
      "pk": 4201614,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 14,
      "text": "He shall take some of the blood of the bull and sprinkle it with his finger on the front of the mercy seat on the east side, and before the mercy seat he shall sprinkle some of the blood with his finger seven times.",
      "links": "<a href='/AIV/3/4/6'>Lev. 4:6</a>; <a href='/AIV/3/8/11'>Lev. 8:11</a>",
      "comment": "Direction and number of sprinklings as in Hebrew."
    },
    {
      "pk": 4201615,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 15,
      "text": "Then he shall kill the goat of the sin offering that is for the people and bring its blood inside the veil, and do with its blood as he did with the blood of the bull, sprinkling it on the mercy seat and in front of the mercy seat.",
      "links": "<a href='/AIV/3/16/14'>Lev. 16:14</a>",
      "comment": "Parallelism to previous verse made clear for modern readers."
    },
    {
      "pk": 4201616,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 16,
      "text": "Thus he shall make atonement for the Holy Place, because of the uncleanness of the people of Israel and because of their transgressions, all their sins. So he shall do for the tent of meeting, which dwells with them in the midst of their uncleanness.",
      "links": "<a href='/AIV/3/15/31'>Lev. 15:31</a>; <a href='/AIV/4/19/13'>Num. 19:13</a>",
      "comment": "Terms for sin and uncleanness strictly preserved."
    },
    {
      "pk": 4201617,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 17,
      "text": "No one may be in the tent of meeting from the time he enters to make atonement in the Holy Place until he comes out and has made atonement for himself, for his house, and for all the congregation of Israel.",
      "links": "<a href='/AIV/2/30/10'>Ex. 30:10</a>",
      "comment": "Exclusive nature of priestly ritual is retained."
    },
    {
      "pk": 4201618,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 18,
      "text": "Then he shall go out to the altar that is before the LORD and make atonement for it. He shall take some of the blood of the bull and some of the blood of the goat, and put it on the horns of the altar all around.",
      "links": "<a href='/AIV/3/4/7'>Lev. 4:7</a>",
      "comment": "Precise sequence of ritual acts as in Hebrew text."
    },
    {
      "pk": 4201619,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 19,
      "text": "He shall sprinkle some of the blood on it with his finger seven times, and cleanse it and consecrate it from the uncleanness of the people of Israel.",
      "links": "<a href='/AIV/3/8/11'>Lev. 8:11</a>",
      "comment": "Key words 'cleanse' and 'consecrate' reflect sacrificial terminology."
    },
    {
      "pk": 4201620,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 20,
      "text": "When he has finished atoning for the Holy Place, the tent of meeting, and the altar, he shall present the live goat.",
      "links": "<a href='/AIV/3/16/10'>Lev. 16:10</a>",
      "comment": "Clear division between sacrificial animals shown."
    },
    {
      "pk": 4201621,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 21,
      "text": "Then Aaron shall lay both of his hands on the head of the live goat, and confess over it all the iniquities of the people of Israel, and all their transgressions, all their sins. He shall put them on the head of the goat, and send it away into the wilderness by the hand of a man who is ready.",
      "links": "<a href='/AIV/3/1/4'>Lev. 1:4</a>; <a href='/AIV/3/16/10'>Lev. 16:10</a>",
      "comment": "Redundant phrases 'all the iniquities... all their transgressions, all their sins' kept for emphasis."
    },
    {
      "pk": 4201622,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 22,
      "text": "The goat shall bear all their iniquities on itself to a remote area, and he shall let the goat go free in the wilderness.",
      "links": "<a href='/AIV/3/16/10'>Lev. 16:10</a>; <a href='/AIV/4/5/17'>Num. 5:17</a>",
      "comment": "'Remote area' translated from Hebrew 'land cut off.'"
    },
    {
      "pk": 4201623,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 23,
      "text": "Then Aaron shall go into the tent of meeting and shall take off the linen garments that he put on when he went into the Holy Place and shall leave them there.",
      "links": "<a href='/AIV/3/16/4'>Lev. 16:4</a>",
      "comment": "Instructions for removing priestly garments accurately reflected."
    },
    {
      "pk": 4201624,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 24,
      "text": "He shall bathe his body in water in a holy place and put on his garments. Then he shall come out and offer his burnt offering and the burnt offering of the people, and make atonement for himself and for the people.",
      "links": "<a href='/AIV/3/16/3'>Lev. 16:3</a>",
      "comment": "Bathing and offerings matched to the traditional process."
    },
    {
      "pk": 4201625,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 25,
      "text": "And the fat of the sin offering he shall burn on the altar.",
      "links": "<a href='/AIV/3/4/8-10'>Lev. 4:8–10</a>",
      "comment": "No significant changes."
    },
    {
      "pk": 4201626,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 26,
      "text": "And he who lets the goat go to Azazel shall wash his clothes and bathe his body in water, and afterward he may come into the camp.",
      "links": "<a href='/AIV/3/14/8-9'>Lev. 14:8–9</a>",
      "comment": "'Azazel' kept; ritual washing instruction as in original."
    },
    {
      "pk": 4201627,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 27,
      "text": "And the bull for the sin offering and the goat for the sin offering, whose blood was brought in to make atonement in the Holy Place, shall be carried outside the camp. Their skin and their flesh and their dung shall be burned up with fire.",
      "links": "<a href='/AIV/3/4/11-12'>Lev. 4:11–12</a>",
      "comment": "Details on burning maintained, consistent with sacrificial codes."
    },
    {
      "pk": 4201628,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 28,
      "text": "And he who burns them shall wash his clothes and bathe his body in water, and afterward he may come into the camp.",
      "links": "<a href='/AIV/3/11/25'>Lev. 11:25</a>",
      "comment": "Cleansing ritual strongly retained."
    },
    {
      "pk": 4201629,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 29,
      "text": "'And this shall be a statute forever for you: In the seventh month, on the tenth day of the month, you shall humble yourselves and do no work, either the native or the foreigner who sojourns among you.'",
      "links": "<a href='/AIV/3/23/27-32'>Lev. 23:27–32</a>",
      "comment": "'Humble yourselves' is literal for Hebrew 'afflict your souls.'"
    },
    {
      "pk": 4201630,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 30,
      "text": "'For on this day atonement shall be made for you to cleanse you. You shall be clean before the LORD from all your sins.'",
      "links": "<a href='/AIV/3/16/16'>Lev. 16:16</a>",
      "comment": "Promise of cleansing made explicit."
    },
    {
      "pk": 4201631,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 31,
      "text": "'It is a Sabbath of solemn rest for you, and you shall humble yourselves; it is a statute forever.'",
      "links": "<a href='/AIV/3/23/32'>Lev. 23:32</a>",
      "comment": "'Sabbath of solemn rest' for Hebrew 'Sabbath sabbaton.'"
    },
    {
      "pk": 4201632,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 32,
      "text": "'And the priest who is anointed and consecrated as priest in his father's place shall make atonement, wearing the holy linen garments.'",
      "links": "<a href='/AIV/2/29/29-30'>Ex. 29:29–30</a>",
      "comment": "Succession of high priest described as in original."
    },
    {
      "pk": 4201633,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 33,
      "text": "'He shall make atonement for the holy sanctuary, and he shall make atonement for the tent of meeting and for the altar, and he shall make atonement for the priests and for all the people of the assembly.'",
      "links": "<a href='/AIV/3/8/15'>Lev. 8:15</a>",
      "comment": "Atonement order and scope precisely maintained."
    },
    {
      "pk": 4201634,
      "translation": "AIV",
      "book": 3,
      "chapter": 16,
      "verse": 34,
      "text": "'And this shall be a statute forever for you, that atonement may be made for the people of Israel once in the year because of all their sins.' And he did as the LORD commanded Moses.",
      "links": "<a href='/AIV/3/23/27'>Lev. 23:27</a>; <a href='/AIV/4/29/7'>Num. 29:7</a>",
      "comment": "Final summary and faithful adherence to the original."
    }
  ],
  "translatedAt": "2025-12-20T09:17:32.285Z"
}