{
  "book": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 10,
  "verses": [
    {
      "pk": 3101001,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 1,
      "text": "Now Nadab and Abihu, the sons of Aaron, each took his censer, put fire in it, and laid incense on it, and offered unauthorized fire before the LORD, which he had not commanded them.",
      "links": "<a href='/AIV/2/30/9'>Ex. 30:9</a>; <a href='/AIV/3/16/1'>Lev. 16:1</a>",
      "comment": "The expression 'unauthorized fire' reflects the Hebrew 'strange fire' (esh zarah), meaning fire not commanded by God."
    },
    {
      "pk": 3101002,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 2,
      "text": "And fire came out from the presence of the LORD and consumed them, and they died before the LORD.",
      "links": "<a href='/AIV/1/19/24'>Gen. 19:24</a>; <a href='/AIV/3/9/24'>Lev. 9:24</a>",
      "comment": "Parallels with divine fire judgments elsewhere, as in Genesis 19."
    },
    {
      "pk": 3101003,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 3,
      "text": "Then Moses said to Aaron, 'This is what the LORD has spoken: “Among those who are near me, I will be sanctified, and before all the people I will be glorified.”' Aaron kept silent.",
      "links": "<a href='/AIV/3/8/35'>Lev. 8:35</a>; <a href='/AIV/26/20/41'>Ezek. 20:41</a>",
      "comment": "Reflects the principle of God's holiness and glory, with a direct quote from the LORD."
    },
    {
      "pk": 3101004,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 4,
      "text": "Moses called Mishael and Elzaphan, the sons of Uzziel, Aaron’s uncle, and said to them, 'Come near, carry your brothers away from the front of the sanctuary to a place outside the camp.'",
      "links": "<a href='/AIV/2/6/22'>Ex. 6:22</a>",
      "comment": "'Brothers' refers to the bodies of Nadab and Abihu."
    },
    {
      "pk": 3101005,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 5,
      "text": "So they came near and carried them in their tunics out of the camp, as Moses had said.",
      "links": "<a href='/AIV/4/19/7-10'>Num. 19:7-10</a>",
      "comment": "Indicates Nadab and Abihu's priestly garments were still on them."
    },
    {
      "pk": 3101006,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 6,
      "text": "And Moses said to Aaron, and to Eleazar and Ithamar, his sons, 'Do not let your hair hang loose, and do not tear your garments, lest you die and wrath come upon all the assembly; but let your brothers, the whole house of Israel, mourn for those whom the LORD has burned.'",
      "links": "<a href='/AIV/3/21/10'>Lev. 21:10</a>; <a href='/AIV/3/19/27'>Lev. 19:27</a>",
      "comment": "'Let your hair hang loose' refers to customary mourning practices, forbidden here for priests."
    },
    {
      "pk": 3101007,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 7,
      "text": "'And you shall not go out from the entrance of the tent of meeting, or you will die, for the anointing oil of the LORD is upon you.' And they did according to the word of Moses.",
      "links": "<a href='/AIV/3/21/10-12'>Lev. 21:10-12</a>",
      "comment": "Priests must not leave their holy duties even in mourning."
    },
    {
      "pk": 3101008,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 8,
      "text": "And the LORD spoke to Aaron, saying,",
      "links": "",
      "comment": "The LORD addresses Aaron directly here, unique in Leviticus."
    },
    {
      "pk": 3101009,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 9,
      "text": "'Do not drink wine or strong drink, you or your sons with you, when you go into the tent of meeting, lest you die; it shall be a statute forever throughout your generations.'",
      "links": "<a href='/AIV/4/6/3'>Num. 6:3</a>; <a href='/AIV/26/44/21'>Ezek. 44:21</a>",
      "comment": "'Strong drink' is from the Hebrew 'shekar', referring to fermented beverages other than wine."
    },
    {
      "pk": 3101010,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 10,
      "text": "'You are to distinguish between the holy and the common, and between the unclean and the clean,'",
      "links": "<a href='/AIV/3/11/47'>Lev. 11:47</a>; <a href='/AIV/26/44/23'>Ezek. 44:23</a>",
      "comment": "One of Leviticus's central themes is maintaining distinctions."
    },
    {
      "pk": 3101011,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 11,
      "text": "'and you are to teach the people of Israel all the statutes that the LORD has spoken to them by Moses.'",
      "links": "<a href='/AIV/5/17/8-13'>Deut. 17:8–13</a>",
      "comment": "Duty of priests includes instruction of the people."
    },
    {
      "pk": 3101012,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 12,
      "text": "Moses spoke to Aaron and to Eleazar and Ithamar, his sons who were left, 'Take the grain offering that remains from the LORD’s food offerings, and eat it unleavened beside the altar, for it is most holy.'",
      "links": "<a href='/AIV/3/6/16-18'>Lev. 6:16–18</a>",
      "comment": "'Most holy' designates special offerings reserved for the priests."
    },
    {
      "pk": 3101013,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 13,
      "text": "'You shall eat it in a holy place, because it is your due and your sons' due, from the LORD’s food offerings; for so I am commanded.'",
      "links": "<a href='/AIV/3/2/3'>Lev. 2:3</a>",
      "comment": "Emphasizes location and right of priests to eat offerings."
    },
    {
      "pk": 3101014,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 14,
      "text": "'But the breast that is waved and the thigh that is contributed you shall eat in a clean place, you and your sons and your daughters with you; for they are given as your due and your sons' due from the sacrifices of the peace offerings of the people of Israel.'",
      "links": "<a href='/AIV/3/7/29-36'>Lev. 7:29–36</a>",
      "comment": "Waved breast and contributed thigh are the priestly portions from peace offerings."
    },
    {
      "pk": 3101015,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 15,
      "text": "'The thigh that is contributed and the breast that is waved they shall bring with the food offerings of the fat pieces to wave as a wave offering before the LORD; and it shall be yours and your sons' with you as a due forever, as the LORD has commanded.'",
      "links": "<a href='/AIV/2/29/28'>Ex. 29:28</a>",
      "comment": "Priestly family has perpetual right to these portions."
    },
    {
      "pk": 3101016,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 16,
      "text": "Now Moses diligently inquired about the goat of the sin offering, and behold, it had been burned up. And he was angry with Eleazar and Ithamar, the sons of Aaron who were left, saying,",
      "links": "<a href='/AIV/3/6/30'>Lev. 6:30</a>",
      "comment": "Sin offering was supposed to be eaten unless its blood was brought into the sanctuary."
    },
    {
      "pk": 3101017,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 17,
      "text": "'Why have you not eaten the sin offering in the sanctuary, since it is most holy, and he has given it to you to bear the guilt of the congregation, to make atonement for them before the LORD?'",
      "links": "<a href='/AIV/3/6/26'>Lev. 6:26</a>",
      "comment": "Priests bear the guilt of the people symbolically by eating the offering."
    },
    {
      "pk": 3101018,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 18,
      "text": "'Behold, its blood was not brought into the inner part of the sanctuary. You should certainly have eaten it in the sanctuary, as I commanded.'",
      "links": "<a href='/AIV/3/6/30'>Lev. 6:30</a>",
      "comment": "Eating the sin offering correct except if blood is brought inside the tent."
    },
    {
      "pk": 3101019,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 19,
      "text": "And Aaron said to Moses, 'Behold, today they have offered their sin offering and their burnt offering before the LORD, yet such things as these have happened to me. If I had eaten the sin offering today, would it have been acceptable in the sight of the LORD?'",
      "links": "<a href='/AIV/3/9/8'>Lev. 9:8</a>",
      "comment": "Aaron appeals to circumstance: deep mourning, perhaps, would compromise sanctity."
    },
    {
      "pk": 3101020,
      "translation": "AIV",
      "book": 3,
      "chapter": 10,
      "verse": 20,
      "text": "And when Moses heard that, it was good in his sight.",
      "links": "",
      "comment": "Moses accepts Aaron’s explanation; God’s law interpreted with mercy in this case."
    }
  ],
  "translatedAt": "2025-12-20T09:14:35.015Z"
}