{
  "book": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 27,
  "verses": [
    {
      "pk": 1352701,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 1,
      "text": "The LORD spoke to Moses, saying,",
      "links": "<a href='/AIV/3/25/1'>Lev. 25:1</a>",
      "comment": "Introduction to the Lord's speech; same formula as in previous chapters."
    },
    {
      "pk": 1352702,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 2,
      "text": "Speak to the Israelites and say to them, ‘When anyone makes a special vow to the LORD involving the equivalent value of persons,",
      "links": "<a href='/AIV/4/6/2'>Num. 6:2</a>",
      "comment": "\"Equivalent value\" translates the Hebrew \"’erekh\", meaning monetary assessment for a vow."
    },
    {
      "pk": 1352703,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 3,
      "text": "then your valuation shall be: for a male from twenty years old up to sixty years old, your valuation shall be fifty shekels of silver, according to the sanctuary shekel.",
      "links": "<a href='/AIV/2/30/13'>Ex. 30:13</a>",
      "comment": "One shekel = about 11 grams or 0.4 oz. Sanctuary shekel is the standard weight."
    },
    {
      "pk": 1352704,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 4,
      "text": "If it is a female, your valuation shall be thirty shekels.",
      "links": "<a href='/AIV/3/27/5'>Lev. 27:5</a>",
      "comment": "Female valuations were less than males, reflecting ancient economic/social context, not divine worth."
    },
    {
      "pk": 1352705,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 5,
      "text": "If it is someone from five years old up to twenty years old, your valuation for a male shall be twenty shekels, and for a female, ten shekels.",
      "links": "<a href='/AIV/3/27/3'>Lev. 27:3</a>",
      "comment": "Youth valuations are lower, see verse 3 for valuation rules."
    },
    {
      "pk": 1352706,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 6,
      "text": "If it is a child from one month old up to five years old, your valuation shall be five shekels of silver for a male, and three shekels of silver for a female.",
      "links": "<a href='/AIV/3/27/5'>Lev. 27:5</a>",
      "comment": "Babies' and toddlers' valuations are the lowest, reflecting economic contribution."
    },
    {
      "pk": 1352707,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 7,
      "text": "If it is for a person sixty years old or older, then for a male your valuation shall be fifteen shekels, and for a female, ten shekels.",
      "links": "<a href='/AIV/3/27/3'>Lev. 27:3</a>",
      "comment": "Elderly valuations are again lower, similar to age gradations in ancient Israel."
    },
    {
      "pk": 1352708,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 8,
      "text": "But if he is poorer than your valuation, then he shall present himself before the priest and the priest shall set a value for him, according to what he who vowed can afford.",
      "links": "<a href='/AIV/3/5/11'>Lev. 5:11</a>",
      "comment": "Provision for the poor, priest sets an affordable value."
    },
    {
      "pk": 1352709,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 9,
      "text": "‘If it is an animal that may be offered as an offering to the LORD, all that anyone gives of such to the LORD shall be holy.",
      "links": "<a href='/AIV/3/22/18'>Lev. 22:18</a>",
      "comment": "\"Holy\" means set apart for God."
    },
    {
      "pk": 1352710,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 10,
      "text": "He must not exchange it or substitute it, good for bad or bad for good; if he does substitute one animal for another, then both it and its substitute shall be holy.",
      "links": "<a href='/AIV/3/22/10'>Lev. 22:10</a>",
      "comment": "No substitution allowed, to prevent manipulating the vow."
    },
    {
      "pk": 1352711,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 11,
      "text": "If it is any unclean animal, which is not allowed as an offering to the LORD, then he shall present the animal before the priest,",
      "links": "<a href='/AIV/3/11/26'>Lev. 11:26</a>",
      "comment": "Unclean animals cannot be sacrificed, but can be dedicated."
    },
    {
      "pk": 1352712,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 12,
      "text": "and the priest shall set a value for it, whether it is good or bad; as the priest values it, so it shall stand.",
      "links": "<a href='/AIV/3/27/8'>Lev. 27:8</a>",
      "comment": "Priest assesses fair value for unclean animals."
    },
    {
      "pk": 1352713,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 13,
      "text": "But if he wishes to redeem it, then he must add one-fifth to your valuation.",
      "links": "<a href='/AIV/3/5/16'>Lev. 5:16</a>",
      "comment": "Redeeming with an extra 20% was a penalty and compensation."
    },
    {
      "pk": 1352714,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 14,
      "text": "‘If a man dedicates his house as holy to the LORD, the priest shall assess its value, whether it is good or bad. As the priest assesses it, so shall it stand.",
      "links": "<a href='/AIV/3/27/12'>Lev. 27:12</a>",
      "comment": "Procedure also applies to dedicating a house."
    },
    {
      "pk": 1352715,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 15,
      "text": "If the one who dedicates it wishes to redeem his house, he must add one-fifth to its value, and it shall be his.",
      "links": "<a href='/AIV/3/27/13'>Lev. 27:13</a>",
      "comment": "Owner can buy back the house at 120% of its assessed value."
    },
    {
      "pk": 1352716,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 16,
      "text": "‘If a man dedicates some of the land that he owns to the LORD, then your valuation shall be according to its seed required: a homer of barley seed shall be valued at fifty shekels of silver.",
      "links": "<a href='/AIV/3/25/16'>Lev. 25:16</a>",
      "comment": "Land value based on how much seed it takes, homer = about 220 liters."
    },
    {
      "pk": 1352717,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 17,
      "text": "If he dedicates his field from the year of Jubilee, it shall stand at your full valuation.",
      "links": "<a href='/AIV/3/25/10-13'>Lev. 25:10–13</a>",
      "comment": "Jubilee occurs every 50 years (see Lev 25)."
    },
    {
      "pk": 1352718,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 18,
      "text": "But if he dedicates his field after the Jubilee, the priest shall calculate the price according to the number of years left until the next Jubilee, and your valuation shall be reduced accordingly.",
      "links": "<a href='/AIV/3/25/27'>Lev. 25:27</a>",
      "comment": "Valuation is pro-rated depending on how many years remain."
    },
    {
      "pk": 1352719,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 19,
      "text": "If the one who dedicates the field wishes to redeem it, then he must add one-fifth to your valuation, and it shall return to him.",
      "links": "<a href='/AIV/3/27/15'>Lev. 27:15</a>",
      "comment": "Owner can repurchase for 120% of assigned value."
    },
    {
      "pk": 1352720,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 20,
      "text": "But if he does not redeem the field, or if he has sold the field to someone else, the field may not be redeemed anymore.",
      "links": "<a href='/AIV/3/25/28'>Lev. 25:28</a>",
      "comment": "Once sold or not redeemed, field is permanently transferred."
    },
    {
      "pk": 1352721,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 21,
      "text": "But when the field is released in the Jubilee, it shall be holy to the LORD, like a field devoted; it becomes the priest’s property.",
      "links": "<a href='/AIV/3/25/32'>Lev. 25:32</a>",
      "comment": "In Jubilee, devoted fields go to the priests."
    },
    {
      "pk": 1352722,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 22,
      "text": "If a man dedicates to the LORD a field that he has bought, which is not part of his inherited property,",
      "links": "<a href='/AIV/3/25/25'>Lev. 25:25</a>",
      "comment": "Dedication of non-family land follows a different rule."
    },
    {
      "pk": 1352723,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 23,
      "text": "then the priest shall calculate for him the value up to the year of Jubilee, and the man shall give the valuation on that day as a holy thing to the LORD.",
      "links": "<a href='/AIV/3/27/18'>Lev. 27:18</a>",
      "comment": "Payment is according to value for years remaining to Jubilee."
    },
    {
      "pk": 1352724,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 24,
      "text": "In the year of Jubilee the field shall return to him from whom it was bought, to the one who owns the land as an inherited property.",
      "links": "<a href='/AIV/3/25/10-28'>Lev. 25:10–28</a>",
      "comment": "Inherited land always reverts to the original family in Jubilee."
    },
    {
      "pk": 1352725,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 25,
      "text": "Every valuation shall be according to the sanctuary shekel; twenty gerahs shall make a shekel.",
      "links": "<a href='/AIV/2/30/13'>Ex. 30:13</a>",
      "comment": "Standard weights clarify the sanctuary rules—a gerah is a small coin/weight."
    },
    {
      "pk": 1352726,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 26,
      "text": "‘But a firstborn among animals, which as a firstborn already belongs to the LORD, no one may dedicate; whether an ox or a sheep, it is the LORD’s.",
      "links": "<a href='/AIV/2/13/2'>Ex. 13:2</a>",
      "comment": "Firstborn animals are already God’s, can’t be re-dedicated."
    },
    {
      "pk": 1352727,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 27,
      "text": "But if it is an unclean animal, then the person shall redeem it at the valuation, adding a fifth to it; or if it is not redeemed, it shall be sold at the valuation.",
      "links": "<a href='/AIV/3/5/16'>Lev. 5:16</a>",
      "comment": "Unclean animals can be bought back or sold, with a 20% penalty if redeemed."
    },
    {
      "pk": 1352728,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 28,
      "text": "‘But nothing that a man devotes irrevocably to the LORD, of anything that he owns, whether man or animal or field of his property, may be sold or redeemed; every devoted thing is most holy to the LORD.",
      "links": "<a href='/AIV/3/27/21'>Lev. 27:21</a>",
      "comment": "\"Devoted\" is the Hebrew cherem—something banned from common use, set apart completely."
    },
    {
      "pk": 1352729,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 29,
      "text": "No one devoted to destruction from mankind shall be ransomed; he shall surely be put to death.",
      "links": "<a href='/AIV/6/6/17'>Josh. 6:17</a>",
      "comment": "\"Devoted to destruction\" means under a ban for capital punishment."
    },
    {
      "pk": 1352730,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 30,
      "text": "‘Every tithe of the land, whether of the seed of the land or of the fruit of the trees, belongs to the LORD; it is holy to the LORD.",
      "links": "<a href='/AIV/3/27/32'>Lev. 27:32</a>",
      "comment": "Tithe means one-tenth."
    },
    {
      "pk": 1352731,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 31,
      "text": "If a man wishes to redeem any of his tithe, he shall add one-fifth to it.",
      "links": "<a href='/AIV/3/5/16'>Lev. 5:16</a>",
      "comment": "Anyone redeeming the tithe must add a 20% premium."
    },
    {
      "pk": 1352732,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 32,
      "text": "And every tithe of herds and flocks, every tenth animal that passes under the shepherd’s staff, shall be holy to the LORD.",
      "links": "<a href='/AIV/4/18/17'>Num. 18:17</a>",
      "comment": "Tithing of livestock was also required."
    },
    {
      "pk": 1352733,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 33,
      "text": "He must not examine whether it is good or bad, nor substitute it; but if he does substitute it, both it and its substitute shall be holy; it shall not be redeemed.",
      "links": "<a href='/AIV/3/27/10'>Lev. 27:10</a>",
      "comment": "No picking and choosing; all counted animals belong to God."
    },
    {
      "pk": 1352734,
      "translation": "AIV",
      "book": 3,
      "chapter": 27,
      "verse": 34,
      "text": "These are the commandments which the LORD commanded Moses for the Israelites on Mount Sinai.",
      "links": "<a href='/AIV/3/25/1'>Lev. 25:1</a>",
      "comment": "Summary statement concluding the laws given in Leviticus."
    }
  ],
  "translatedAt": "2025-12-20T09:23:26.696Z"
}