{
  "book": 3,
  "bookName": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 9,
  "verses": [
    {
      "pk": 3009001,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 1,
      "text": "On the eighth day, Moses called Aaron, his sons, and the elders of Israel.",
      "links": "<a href='/AIV/2/19/24'>Ex. 19:24</a>; <a href='/AIV/3/8/1'>Lev. 8:1</a>",
      "comment": "The 'eighth day' marks the completion of Aaron's ordination, symbolizing a new beginning—a theme later fulfilled in Christ's resurrection on the eighth day, Sunday (Matt. 28:1)."
    },
    {
      "pk": 3009002,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 2,
      "text": "He said to Aaron, 'Take for yourself a young bull for a sin offering and a ram for a burnt offering, both without blemish, and offer them before the LORD.'",
      "links": "<a href='/AIV/2/29/1'>Ex. 29:1</a>; <a href='/AIV/3/4/3'>Lev. 4:3</a>",
      "comment": "The demand for sacrifices 'without blemish' prefigures Christ, the perfect and sinless offering (Heb. 9:14)."
    },
    {
      "pk": 3009003,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 3,
      "text": "And speak to the people of Israel, saying, 'Take a male goat for a sin offering; a calf and a lamb, both a year old and without blemish, for a burnt offering;'",
      "links": "<a href='/AIV/3/4/23'>Lev. 4:23</a>; <a href='/AIV/4/28/3'>Num. 28:3</a>",
      "comment": "Involving the people underscores the communal nature of worship and atonement—reflecting the unity of God's people in sacrificial offering."
    },
    {
      "pk": 3009004,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 4,
      "text": "and an ox and a ram for peace offerings to sacrifice before the LORD, and a grain offering mixed with oil. For today, the LORD will appear to you.'",
      "links": "<a href='/AIV/2/29/22'>Ex. 29:22</a>; <a href='/AIV/3/7/12'>Lev. 7:12</a>",
      "comment": "The promise that 'the LORD will appear to you' shows God's real presence at the heart of worship, foreshadowing later the more perfect and abiding presence of God among His people."
    },
    {
      "pk": 3009005,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 5,
      "text": "They brought what Moses commanded before the Tent of Meeting, and all the congregation drew near and stood before the LORD.",
      "links": "<a href='/AIV/3/8/3'>Lev. 8:3</a>; <a href='/AIV/3/8/4'>Lev. 8:4</a>",
      "comment": "The entire assembly draws near, anticipating the call for all believers to participate in the worship and liturgy of God."
    },
    {
      "pk": 3009006,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 6,
      "text": "And Moses said, 'This is what the LORD has commanded you to do, so that the glory of the LORD may appear to you.'",
      "links": "<a href='/AIV/2/16/10'>Ex. 16:10</a>; <a href='/AIV/4/14/10'>Num. 14:10</a>",
      "comment": "Obedience to God's commands is required for His glory to be revealed, pointing to the necessity of ordered worship and fidelity to divine instructions."
    },
    {
      "pk": 3009007,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 7,
      "text": "Then Moses said to Aaron, 'Draw near to the altar and offer your sin offering and your burnt offering, and make atonement for yourself and for the people. Offer the offering of the people and make atonement for them, as the LORD has commanded.'",
      "links": "<a href='/AIV/3/1/5'>Lev. 1:5</a>; <a href='/AIV/3/16/6'>Lev. 16:6</a>",
      "comment": "Aaron, as high priest, mediates between God and the people, prefiguring the ultimate high priestly role of Christ (Heb. 7:27)."
    },
    {
      "pk": 3009008,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 8,
      "text": "So Aaron drew near to the altar and slaughtered the calf of the sin offering, which was for himself.",
      "links": "<a href='/AIV/3/8/14'>Lev. 8:14</a>",
      "comment": "Aaron must first offer sacrifice for his own sins, showing that even high priests needed atonement—fulfilled perfectly and permanently by Christ, who was sinless (Heb. 7:27)."
    },
    {
      "pk": 3009009,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 9,
      "text": "And the sons of Aaron brought the blood to him, and he dipped his finger in the blood and put it on the horns of the altar, and poured out the rest of the blood at the base of the altar.",
      "links": "<a href='/AIV/3/4/7'>Lev. 4:7</a>",
      "comment": "Blood on the altar's horns symbolizes purification and dedication. This sacrifice points forward to the cleansing blood of Christ (Heb. 9:22)."
    },
    {
      "pk": 3009010,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 10,
      "text": "But the fat, the kidneys, and the lobe of the liver from the sin offering he burned on the altar, as the LORD commanded Moses.",
      "links": "<a href='/AIV/3/4/8-10'>Lev. 4:8-10</a>",
      "comment": "Strict adherence to God's instructions about parts of the animal offered reflects the importance of reverent, detailed worship."
    },
    {
      "pk": 3009011,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 11,
      "text": "The flesh and the hide he burned up with fire outside the camp.",
      "links": "<a href='/AIV/3/4/11-12'>Lev. 4:11-12</a>; <a href='/AIV/58/13/11-12'>Heb. 13:11-12</a>",
      "comment": "Burning the remains outside the camp prefigures Christ suffering outside Jerusalem (Heb. 13:12)."
    },
    {
      "pk": 3009012,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 12,
      "text": "Then he killed the burnt offering, and Aaron's sons handed him the blood, and he dashed it against the sides of the altar.",
      "links": "<a href='/AIV/3/1/5'>Lev. 1:5</a>",
      "comment": "The burnt offering symbolizes total dedication of the people to God, ultimately fulfilled in the self-giving of Christ."
    },
    {
      "pk": 3009013,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 13,
      "text": "They presented the burnt offering to him, piece by piece, including the head, and he burned them on the altar.",
      "links": "<a href='/AIV/3/1/8-9'>Lev. 1:8-9</a>",
      "comment": "Offering all parts emphasizes entire consecration—body, soul, and mind—to the LORD."
    },
    {
      "pk": 3009014,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 14,
      "text": "He washed the entrails and the legs and burned them with the burnt offering on the altar.",
      "links": "<a href='/AIV/3/1/9'>Lev. 1:9</a>",
      "comment": "Cleansing the sacrifices points to purification as key to acceptability before God."
    },
    {
      "pk": 3009015,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 15,
      "text": "Then he presented the people's offering. He took the goat of the sin offering, which was for the people, killed it, and offered it for sin, like the first one.",
      "links": "<a href='/AIV/3/4/23-24'>Lev. 4:23-24</a>",
      "comment": "Aaron, as ordained mediator, intercedes for the people, prefiguring the continuing ministry of Christ (Heb. 7:25)."
    },
    {
      "pk": 3009016,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 16,
      "text": "And he presented the burnt offering and offered it according to the ordinance.",
      "links": "<a href='/AIV/3/1/9'>Lev. 1:9</a>",
      "comment": "Fidelity to the God-given ordinance is a recurring theme in proper worship."
    },
    {
      "pk": 3009017,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 17,
      "text": "He presented the grain offering, took a handful of it, and burned it on the altar, besides the burnt offering of the morning.",
      "links": "<a href='/AIV/3/2/2'>Lev. 2:2</a>; <a href='/AIV/4/28/4'>Num. 28:4</a>",
      "comment": "The grain offering represents the dedication of daily labor and life, fulfilled in the New Covenant’s call to offer our very selves."
    },
    {
      "pk": 3009018,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 18,
      "text": "He killed the ox and the ram, the sacrifice of peace offerings for the people. Aaron's sons handed him the blood, which he dashed against the sides of the altar.",
      "links": "<a href='/AIV/3/3/1'>Lev. 3:1</a>",
      "comment": "'Peace offerings' signify fellowship with God—the people's union with Him, a theme that continues in the unity of worship."
    },
    {
      "pk": 3009019,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 19,
      "text": "But the fat portions of the ox and the ram, the fat tail, what covers the entrails, the kidneys, and the lobe of the liver—",
      "links": "<a href='/AIV/3/7/3-4'>Lev. 7:3-4</a>",
      "comment": "The specified parts are consistently given to God, teaching careful observance and respect for tradition in worship."
    },
    {
      "pk": 3009020,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 20,
      "text": "they placed the fat portions on the breasts, and he burned the fat portions on the altar.",
      "links": "<a href='/AIV/3/7/31'>Lev. 7:31</a>",
      "comment": "Burning 'the fat' as the best portion is an act of giving God what is most valuable, a spiritual principle transcending into the new covenant worship."
    },
    {
      "pk": 3009021,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 21,
      "text": "But the breasts and the right thigh Aaron waved as a wave offering before the LORD, as Moses commanded.",
      "links": "<a href='/AIV/3/7/30'>Lev. 7:30</a>; <a href='/AIV/4/18/18'>Num. 18:18</a>",
      "comment": "Wave offerings symbolize participation and acceptance; ministers share the gifts with the people, reflecting the provision within the worshiping community."
    },
    {
      "pk": 3009022,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 22,
      "text": "Then Aaron lifted up his hands toward the people and blessed them, and he came down from offering the sin offering, the burnt offering, and the peace offerings.",
      "links": "<a href='/AIV/4/6/23-26'>Num. 6:23-26</a>; <a href='/AIV/42/24/50'>Luke 24:50</a>",
      "comment": "Aaron blesses the people after sacrifice, prefiguring the priestly benediction that follows the offering of worship in the New Covenant (Luke 24:50)."
    },
    {
      "pk": 3009023,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 23,
      "text": "Moses and Aaron went into the Tent of Meeting, and when they came out, they blessed the people. Then the glory of the LORD appeared to all the people.",
      "links": "<a href='/AIV/2/40/34'>Ex. 40:34</a>; <a href='/AIV/4/14/10'>Num. 14:10</a>",
      "comment": "Joint blessing and the appearance of divine glory show God's approval of rightly ordered, sacramental worship, culminating in His manifest presence among the assembly."
    },
    {
      "pk": 3009024,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 9,
      "verse": 24,
      "text": "And fire came out from the LORD and consumed the burnt offering and the fat on the altar. When all the people saw it, they shouted and fell on their faces.",
      "links": "<a href='/AIV/3/10/2'>Lev. 10:2</a>; <a href='/AIV/11/18/38-39'>1 Kgs 18:38-39</a>",
      "comment": "Divine fire consuming the offerings signifies God’s acceptance, instilling awe. This theophany connects to Christ’s sacrifice, with God's consuming love shown perfectly at Calvary and the descent of the Holy Spirit as fire (Acts 2:3)."
    }
  ],
  "translatedAt": "2025-12-24T01:14:47.410Z"
}