{
  "book": 3,
  "bookName": "Leviticus",
  "bookAbbreviation": "Lev",
  "chapter": 26,
  "verses": [
    {
      "pk": 3026001,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 1,
      "text": "You shall not make idols for yourselves, nor shall you set up a carved image or a sacred pillar, and you shall not place a stone figure in your land to bow down to it; for I am the LORD your God.",
      "links": "<a href='/AIV/2/20/3-5'>Ex. 20:3–5</a>; <a href='/AIV/5/5/8-9'>Deut. 5:8-9</a>",
      "comment": "God prohibits idolatry here, emphasizing exclusive worship owed to Him. In the broader biblical narrative, this absolute monotheism prepares God’s people for true worship in spirit and truth (John 4:23-24). The use of physical objects is not inherently forbidden—what matters is their purpose and the inner disposition of worship."
    },
    {
      "pk": 3026002,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 2,
      "text": "You shall keep my Sabbaths and reverence my sanctuary: I am the LORD.",
      "links": "<a href='/AIV/3/19/3,30'>Lev. 19:3, 30</a>; <a href='/AIV/2/20/8'>Ex. 20:8</a>",
      "comment": "This verse connects reverence for sacred times (Sabbath) and sacred places (sanctuary). God commands both, highlighting communal worship and sacred space as integral to a relationship with Him (Heb. 10:25)."
    },
    {
      "pk": 3026003,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 3,
      "text": "If you walk in my statutes and keep my commandments and do them,",
      "links": "<a href='/AIV/5/28/1'>Deut. 28:1</a>; <a href='/AIV/19/119/1'>Ps. 119:1</a>",
      "comment": "The blessings and curses that follow are directly connected to obedience. This conditional aspect prefigures the new covenant, fulfilled and perfected in Christ, who brings grace for obedience to God’s law (Rom. 8:4)."
    },
    {
      "pk": 3026004,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 4,
      "text": "then I will give you rain in its season, and the land will yield its produce, and the trees of the field will yield their fruit.",
      "links": "<a href='/AIV/5/28/12'>Deut. 28:12</a>; <a href='/AIV/19/67/6'>Ps. 67:6</a>",
      "comment": "Material blessings are promised for obedience—a sign of God's covenantal faithfulness. Spiritually, this foreshadows the abundant life and the fruits of the Spirit (Gal. 5:22-23)."
    },
    {
      "pk": 3026005,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 5,
      "text": "Your threshing will last until the grape harvest, and the grape harvest will last until the sowing; you shall eat your bread to the full, and live securely in your land.",
      "links": "<a href='/AIV/3/25/19'>Lev. 25:19</a>; <a href='/AIV/19/37/3'>Ps. 37:3</a>",
      "comment": "God promises superabundance and security. The imagery of perpetual harvest points to the spiritual fullness Christ offers (John 6:35), and the secure dwelling hints at the permanent home God prepares for His people."
    },
    {
      "pk": 3026006,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 6,
      "text": "I will grant peace in the land, and you shall lie down and no one will make you afraid. I will remove wild beasts from your land, and the sword will not pass through your land.",
      "links": "<a href='/AIV/3/25/18-19'>Lev. 25:18-19</a>; <a href='/AIV/19/4/8'>Ps. 4:8</a>",
      "comment": "Peace (shalom) encompasses safety, well-being, and God’s comprehensive blessing—fulfilled in Christ, who is our peace (Eph. 2:14)."
    },
    {
      "pk": 3026007,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 7,
      "text": "You shall pursue your enemies, and they shall fall by the sword before you.",
      "links": "<a href='/AIV/5/28/7'>Deut. 28:7</a>",
      "comment": "The context is physical security for Israel. Spiritually, Christ’s victory over sin and death is prefigured here (Col. 2:15), showing God’s power to deliver His faithful."
    },
    {
      "pk": 3026008,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 8,
      "text": "Five of you shall chase a hundred, and a hundred of you shall chase ten thousand; and your enemies shall fall by the sword before you.",
      "links": "<a href='/AIV/23/30/17'>Isa. 30:17</a>; <a href='/AIV/24/46/15-16'>Jer. 46:15-16</a>",
      "comment": "This supernatural victory demonstrates that when God is with His people, numbers do not matter—foreshadowing God working through the few to impact the many, as in the early Christian church."
    },
    {
      "pk": 3026009,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 9,
      "text": "I will turn to you, make you fruitful, and multiply you, and I will establish my covenant with you.",
      "links": "<a href='/AIV/1/17/7'>Gen. 17:7</a>; <a href='/AIV/3/26/42'>Lev. 26:42</a>",
      "comment": "Fruitfulness echoes God’s blessing to Abraham. God’s faithfulness guarantees the continuation of His covenant people, foreshadowing the worldwide family promised in Christ (Gal. 3:29)."
    },
    {
      "pk": 3026010,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 10,
      "text": "You will still be eating last year’s harvest when you will have to move it out to make room for the new.",
      "links": "<a href='/AIV/3/25/21-22'>Lev. 25:21–22</a>",
      "comment": "God’s blessings surpass human need. This overflow previews the spiritual abundance found in God’s ultimate promise, fulfilled in Christ (John 10:10)."
    },
    {
      "pk": 3026011,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 11,
      "text": "I will set my dwelling among you, and my soul will not despise you.",
      "links": "<a href='/AIV/2/25/8'>Ex. 25:8</a>; <a href='/AIV/43/1/14'>John 1:14</a>",
      "comment": "God’s presence among His people is a central hope. This points to the incarnation of Christ, God dwelling among us in the flesh (John 1:14), and to the real indwelling presence of God with His people in worship."
    },
    {
      "pk": 3026012,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 12,
      "text": "I will walk among you and be your God, and you shall be my people.",
      "links": "<a href='/AIV/26/37/27'>Ezek. 37:27</a>; <a href='/AIV/66/21/3'>Rev. 21:3</a>",
      "comment": "This covenant formula reaches its highest realization in Christ, who makes God’s presence accessible and enables believers to enter into true communion with Him."
    },
    {
      "pk": 3026013,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 13,
      "text": "I am the LORD your God, who brought you out of the land of Egypt, so that you would not be slaves; I broke the bars of your yoke and made you walk upright.",
      "links": "<a href='/AIV/2/20/2'>Ex. 20:2</a>; <a href='/AIV/19/81/6'>Ps. 81:6</a>",
      "comment": "Redemption from slavery is a type of the greater deliverance Christ brings from sin (Rom. 6:18). God’s liberation has both physical and spiritual fulfillment."
    },
    {
      "pk": 3026014,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 14,
      "text": "But if you will not listen to me and will not observe all these commandments,",
      "links": "<a href='/AIV/5/28/15'>Deut. 28:15</a>",
      "comment": "The contrast between covenant blessing and curse is now introduced, underscoring the seriousness of covenant relationship and obedience."
    },
    {
      "pk": 3026015,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 15,
      "text": "and if you reject my statutes, and if your soul despises my judgments, so that you do not do all my commandments but break my covenant,",
      "links": "<a href='/AIV/4/15/31'>Num. 15:31</a>; <a href='/AIV/19/50/16-17'>Ps. 50:16-17</a>",
      "comment": "Deliberate rejection of God’s law is tantamount to breaking relationship with Him. In the new covenant, the law is written on the heart (Jer. 31:33)."
    },
    {
      "pk": 3026016,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 16,
      "text": "then I will do this to you: I will appoint sudden terror over you, wasting disease and fever that consume the eyes and sap the soul; and you shall sow your seed in vain, for your enemies shall eat it.",
      "links": "<a href='/AIV/5/28/22'>Deut. 28:22</a>; <a href='/AIV/19/78/33'>Ps. 78:33</a>",
      "comment": "Consequences of covenant-breaking are catastrophic, affecting body and sustenance. These warnings are ultimately remedial, meant to call God’s people to repentance and renewal."
    },
    {
      "pk": 3026017,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 17,
      "text": "I will set my face against you, and you shall be struck down before your enemies; those who hate you shall rule over you, and you shall flee when no one pursues you.",
      "links": "<a href='/AIV/19/53/5'>Ps. 53:5</a>",
      "comment": "God’s ‘face’ denotes His presence. The absence of God brings insecurity and defeat. New Testament warnings of drifting from God echo this (Heb. 2:1-3)."
    },
    {
      "pk": 3026018,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 18,
      "text": "If after all this you will not listen to me, then I will punish you seven times more for your sins.",
      "links": "<a href='/AIV/3/26/21,24,28'>Lev. 26:21, 24, 28</a>",
      "comment": "‘Seven times more’ indicates the completeness of God’s discipline, intended not for destruction, but for correction, as God’s love chastens (Heb. 12:6)."
    },
    {
      "pk": 3026019,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 19,
      "text": "I will break the pride of your power, and I will make your heavens like iron and your earth like bronze.",
      "links": "<a href='/AIV/5/28/23'>Deut. 28:23</a>",
      "comment": "Pride is at the heart of disobedience; God’s discipline humbles to heal. The image of closed heavens underscores dependence on God’s mercy."
    },
    {
      "pk": 3026020,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 20,
      "text": "Your strength shall be spent in vain, for your land will not yield its increase, and the trees of the land will not yield their fruit.",
      "links": "<a href='/AIV/5/28/38-42'>Deut. 28:38-42</a>",
      "comment": "Without God, labor is fruitless. Fruitfulness only comes from union with God—the same principle expressed by Jesus (John 15:5)."
    },
    {
      "pk": 3026021,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 21,
      "text": "If you walk contrary to me and will not listen to me, I will bring seven times more plagues upon you, according to your sins.",
      "links": "<a href='/AIV/3/26/18'>Lev. 26:18</a>",
      "comment": "Persistent disobedience invites escalating consequences, yet each is a call to repentance—God’s discipline as mercy."
    },
    {
      "pk": 3026022,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 22,
      "text": "I will send wild animals among you, and they will rob you of your children and destroy your livestock and make you few in number, so that your roads become deserted.",
      "links": "<a href='/AIV/2/23/29'>Ex. 23:29</a>; <a href='/AIV/4/21/6'>Num. 21:6</a>",
      "comment": "The loss of children and livestock points to the reversal of God’s blessings. God’s judgments affect the whole community, reminding us that sin has social consequences."
    },
    {
      "pk": 3026023,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 23,
      "text": "If by these things you are not corrected by me, but walk contrary to me,",
      "links": "<a href='/AIV/5/28/27'>Deut. 28:27</a>",
      "comment": "Repeated calls to repentance show God’s patience. Persistence in sin makes the discipline more severe but also indicates the enduring possibility of return to God."
    },
    {
      "pk": 3026024,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 24,
      "text": "then I will also walk contrary to you, and I myself will strike you seven times for your sins.",
      "links": "<a href='/AIV/19/18/26-27'>Ps. 18:26–27</a>",
      "comment": "God opposes the proud but gives grace to the humble (Jas. 4:6); discipline matches desertion to bring about humility and dependence on God."
    },
    {
      "pk": 3026025,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 25,
      "text": "I will bring a sword against you to execute the vengeance of the covenant; when you gather within your cities, I will send pestilence among you, and you shall be delivered into the hand of the enemy.",
      "links": "<a href='/AIV/24/14/12'>Jer. 14:12</a>; <a href='/AIV/12/17/5-6'>2 Kings 17:5–6</a>",
      "comment": "The sword and pestilence are acts of judgment to defend the sanctity of the covenant. God’s justice is necessary for His mercy to be recognized."
    },
    {
      "pk": 3026026,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 26,
      "text": "When I break your supply of bread, ten women will bake your bread in one oven, and they will return your bread by weight; and you shall eat and not be satisfied.",
      "links": "<a href='/AIV/25/5/6'>Lam. 5:6</a>; <a href='/AIV/5/28/51'>Deut. 28:51</a>",
      "comment": "Scarcity and hunger result from disobedience. Jesus’s miracle of the loaves (Mark 6:41-44) stands as the reversal: He provides true and abundant bread."
    },
    {
      "pk": 3026027,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 27,
      "text": "If, despite this, you do not listen to me but walk contrary to me,",
      "links": "<a href='/AIV/3/26/14,21,23'>Lev. 26:14, 21, 23</a>",
      "comment": "God’s patience is emphasized by repeated warnings. Persistent rejection brings ever-stronger consequences and shows the seriousness of responding to God’s mercy."
    },
    {
      "pk": 3026028,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 28,
      "text": "then I will walk contrary to you in fury, and I myself will discipline you seven times for your sins.",
      "links": "<a href='/AIV/3/26/24'>Lev. 26:24</a>",
      "comment": "Divine discipline is not arbitrary, but the necessary means of drawing people back to true faith and relationship. God’s fury is the passion of divine love correcting wayward hearts."
    },
    {
      "pk": 3026029,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 29,
      "text": "You shall eat the flesh of your sons, and you shall eat the flesh of your daughters.",
      "links": "<a href='/AIV/25/2/20'>Lam. 2:20</a>; <a href='/AIV/25/4/10'>Lam. 4:10</a>",
      "comment": "The ultimate horror of judgment is cannibalism during siege, later fulfilled in Israel's history (2 Kings 6:28-29). This shows how sin’s consequences eventually undermine even the most basic fabric of community and life."
    },
    {
      "pk": 3026030,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 30,
      "text": "I will destroy your high places, cut down your incense altars, and cast your dead bodies upon the lifeless forms of your idols; my soul will despise you.",
      "links": "<a href='/AIV/12/23/20'>2 Kings 23:20</a>; <a href='/AIV/24/7/33'>Jer. 7:33</a>",
      "comment": "False worship leads to utter desecration. God must purify worship, demanding the proper worship of Himself alone—a theme that continues to the worship God commands in the New Covenant."
    },
    {
      "pk": 3026031,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 31,
      "text": "I will lay your cities waste and make your sanctuaries desolate, and I will not smell your pleasing aromas.",
      "links": "<a href='/AIV/19/74/7'>Ps. 74:7</a>; <a href='/AIV/23/1/11-15'>Isa. 1:11-15</a>",
      "comment": "Even legitimate worship is rejected when hearts are far from God (see Isa. 1:11-15). The true sanctuary is ultimately Christ Himself (John 2:19)."
    },
    {
      "pk": 3026032,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 32,
      "text": "I will make the land a desolation, and your enemies who settle in it will be appalled at it.",
      "links": "<a href='/AIV/33/6/16'>Mic. 6:16</a>; <a href='/AIV/24/18/16'>Jer. 18:16</a>",
      "comment": "The land’s desolation is a sign that sin devastates everything God gives. Restoration is possible, prefiguring the ultimate renewal in Christ (Rom. 8:20-21)."
    },
    {
      "pk": 3026033,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 33,
      "text": "I will scatter you among the nations, and I will draw out the sword after you; your land will be a waste and your cities will be ruins.",
      "links": "<a href='/AIV/24/9/16'>Jer. 9:16</a>; <a href='/AIV/24/44/22'>Jer. 44:22</a>",
      "comment": "Exile is the ultimate covenant curse, but also sets the stage for the hope of return—a motif fulfilled as the Gospel goes to all nations."
    },
    {
      "pk": 3026034,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 34,
      "text": "Then the land will enjoy its Sabbaths as long as it lies desolate and you are in your enemies’ land; then the land will rest and enjoy its Sabbaths.",
      "links": "<a href='/AIV/2/23/10-11'>Ex. 23:10–11</a>; <a href='/AIV/14/36/21'>2 Chr. 36:21</a>",
      "comment": "The land’s Sabbath shows God’s ultimate ownership and the restorative design even in exile. Rest is essential in God’s plan—a principle later perfected in Christ (Heb. 4:9-10)."
    },
    {
      "pk": 3026035,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 35,
      "text": "As long as it lies desolate, it shall have the rest it did not have during your Sabbaths when you lived on it.",
      "links": "<a href='/AIV/14/36/21'>2 Chr. 36:21</a>",
      "comment": "Rest for the land points to restoring God’s intended order. The ultimate Sabbath rest is a future reality brought by Christ (Heb. 4:9)."
    },
    {
      "pk": 3026036,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 36,
      "text": "As for those of you who are left, I will send faintness into their hearts in the lands of their enemies; and the sound of a driven leaf will put them to flight. They shall flee as one flees from the sword and fall when no one pursues.",
      "links": "<a href='/AIV/5/28/65'>Deut. 28:65</a>; <a href='/AIV/19/53/5'>Ps. 53:5</a>",
      "comment": "Utter fear and dismay are the lot of those cut off from God’s peace. Yet this fear can prompt repentance and a longing for restoration."
    },
    {
      "pk": 3026037,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 37,
      "text": "They shall stumble over one another as if fleeing from the sword, though no one pursues; and you shall have no strength to stand before your enemies.",
      "links": "<a href='/AIV/5/28/25'>Deut. 28:25</a>",
      "comment": "Loss of moral and spiritual fortitude is a sign of severe exile from God’s presence. Strength comes only from God’s favor."
    },
    {
      "pk": 3026038,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 38,
      "text": "You shall perish among the nations, and the land of your enemies shall devour you.",
      "links": "<a href='/AIV/24/24/10'>Jer. 24:10</a>",
      "comment": "The threat of perishing among other nations is both punishment and a grieving loss—yet, scripturally, God’s mercy always leaves a remnant."
    },
    {
      "pk": 3026039,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 39,
      "text": "And those who are left of you shall rot away in your enemies’ lands because of their iniquity; even because of the iniquity of their fathers, they will rot away with them.",
      "links": "<a href='/AIV/25/4/9'>Lam. 4:9</a>; <a href='/AIV/26/18/2-4'>Ezek. 18:2-4</a>",
      "comment": "Judgment is both personal and corporate; the effects of sin persist across generations, yet hope for repentance remains."
    },
    {
      "pk": 3026040,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 40,
      "text": "But if they confess their iniquity and the iniquity of their fathers—their treachery that they committed against me, and also that they walked contrary to me—",
      "links": "<a href='/AIV/19/32/5'>Ps. 32:5</a>; <a href='/AIV/27/9/4-5'>Dan. 9:4-5</a>; <a href='/AIV/62/1/1/9'>1 John 1:9</a>",
      "comment": "Repentance and confession open the way for restoration, both individually and corporately. This prefigures the ministry of reconciliation (2 Cor. 5:18-20) and the sacramental confession of sins."
    },
    {
      "pk": 3026041,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 41,
      "text": "if then their uncircumcised hearts are humbled and they make amends for their iniquity,",
      "links": "<a href='/AIV/5/10/16'>Deut. 10:16</a>; <a href='/AIV/19/51/17'>Ps. 51:17</a>",
      "comment": "A humble heart is what God desires. Restoring relationship with God is not simply outward, but must be inward, heartfelt, and penitent."
    },
    {
      "pk": 3026042,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 42,
      "text": "then I will remember my covenant with Jacob, my covenant with Isaac and my covenant with Abraham, and I will remember the land.",
      "links": "<a href='/AIV/1/9/15-16'>Gen. 9:15-16</a>; <a href='/AIV/1/17/7'>Gen. 17:7</a>",
      "comment": "God’s memory is covenantal faithfulness. God does not forget His promises, which are all fulfilled in Christ (2 Cor. 1:20)."
    },
    {
      "pk": 3026043,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 43,
      "text": "But the land shall be abandoned by them and enjoy its Sabbaths while it lies desolate without them; they shall make amends for their iniquity because they rejected my judgments and despised my statutes.",
      "links": "<a href='/AIV/3/26/34-35'>Lev. 26:34-35</a>",
      "comment": "Repentance leads to restoration, but first comes the justice that heals. Discipline aims ultimately at renewal, not destruction."
    },
    {
      "pk": 3026044,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 44,
      "text": "Yet for all that, when they are in the land of their enemies, I will not reject them, nor will I abhor them to destroy them utterly and break my covenant with them; for I am the LORD their God.",
      "links": "<a href='/AIV/19/94/14'>Ps. 94:14</a>; <a href='/AIV/24/33/24-26'>Jer. 33:24-26</a>; <a href='/AIV/45/11/2'>Rom. 11:2</a>",
      "comment": "God’s faithfulness endures despite human unfaithfulness, a theme Paul affirms of the people of Israel (Rom. 11:2, 29)—and applies spiritually for all who are in the New Covenant."
    },
    {
      "pk": 3026045,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 45,
      "text": "But I will remember for their sake the covenant with their ancestors, whom I brought out of the land of Egypt in the sight of the nations, that I might be their God: I am the LORD.",
      "links": "<a href='/AIV/2/6/8'>Ex. 6:8</a>; <a href='/AIV/5/7/8-9'>Deut. 7:8-9</a>",
      "comment": "Redemption in the sight of the nations prepares for the Gospel’s universal scope. God’s covenants are everlasting (Heb. 13:20)."
    },
    {
      "pk": 3026046,
      "translation": "AIV",
      "book": 3,
      "bookName": "Leviticus",
      "bookAbbreviation": "Lev",
      "chapter": 26,
      "verse": 46,
      "text": "These are the statutes, ordinances, and laws which the LORD established between himself and the sons of Israel through Moses on Mount Sinai.",
      "links": "<a href='/AIV/2/19/3'>Ex. 19:3</a>; <a href='/AIV/3/7/37-38'>Lev. 7:37-38</a>",
      "comment": "The giving of the Law marks the foundation of God’s set-apart people. The fullness of the Law is revealed in Christ (Matt. 5:17), whose Church is the place where the fullness of covenant life continues."
    }
  ],
  "translatedAt": "2025-12-24T01:26:26.291Z"
}